{"organizations": ["Mavericks", "Rockets"], "uuid": "9a3e32f45c935dda7a83f6944f32a439c734c152", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kltv.com", "main_image": "", "site_section": "http://www.kltv.com/global/Category.asp?c=50707&clienttype=rss", "section_title": "KLTV - Texas Sports Headlines", "url": "http://www.kltv.com/story/30212369/hardens-19-points-help-rockets-over-mavericks-109-82", "country": "US", "title": "Harden's 19 points help Rockets over Mavericks 109-82", "performance_score": 0, "site": "kltv.com", "participants_count": 0, "title_full": "Harden's 19 points help Rockets over Mavericks 109-82", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:55:00.000+03:00", "replies_count": 0, "uuid": "9a3e32f45c935dda7a83f6944f32a439c734c152"}, "author": "", "url": "http://www.kltv.com/story/30212369/hardens-19-points-help-rockets-over-mavericks-109-82", "ord_in_thread": 0, "title": "Harden's 19 points help Rockets over Mavericks 109-82", "locations": ["Jacksonville", "Longview", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Harden"], "text": "Harden's 19 points help Rockets over Mavericks 109-82 - KLTV.com-Tyler, Longview, Jacksonville, Texas | ETX News Member Center: Harden's 19 points help Rockets over Mavericks 109-82 By KRISTIE RIEKENAP Sports Writer \nHOUSTON (AP) - James Harden had 19 points and five assists in the first half and the Houston Rockets went on to a 109-82 preseason victory over the Dallas Mavericks on Wednesday night. \nHarden and Patrick Beverley, who made four 3-pointers, were Houston's only two regulars in the starting lineup one night after the Rockets (1-1) started all their top players in their preseason opener at Memphis. \nJohn Jenkins had 19 points for Dallas (0-2), while J.J. Barea had 14 points and Charlie Villanueva added 10 points and six rebounds. \nCorey Brewer had 16 points for the Rockets and K.J. McDaniels added 13. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Wednesday, October 7 2015 11:06 PM EDT 2015-10-08 03:06:27 GMT Rivals Marshall and Longview will face off on Friday for the 105th time. In a series that dates back to 1909, rivals Longview and Marshall will meet on Friday night for the 105th time.It's the third oldest rivalry in the state and what makes this edition special is the fact that both the Lobos and Mavericks enter at 2-0 in District 15-5A play. More >> In a series that dates back to 1909, rivals Longview and Marshall will meet on Friday night for the 105th time.It's the third oldest rivalry in the state and what makes this edition special is the fact that both the Lobos and Mavericks enter at 2-0 in District 15-5A play. More >> Wednesday, October 7 2015 11:14 PM EDT 2015-10-08 03:14:07 GMT John Tyler and Lufkin meet on Friday with district title implications. Longview and Marshall might be the Red Zone Game of the Week, but Fox Sports Southwest is making the trip down to Lufkin for their DQ Big Game of the Week between the panthers and John Tyler.The winner will have the inside track to a district 16-5A title.. More >> Longview and Marshall might be the Red Zone Game of the Week, but Fox Sports Southwest is making the trip down to Lufkin for their DQ Big Game of the Week between the panthers and John Tyler.The winner will have the inside track to a district 16-5A title.. More >> Tuesday, October 6 2015 11:14 PM EDT 2015-10-07 03:14:05 GMT Updated: Wednesday, October 7 2015 9:00 AM EDT 2015-10-07 13:00:16 GMT In order to have a chance in the SEC East race, Tennessee and Missouri need strong showings on offense to beat conference front-runners. More >> In order to have a chance in the SEC East race, Tennessee and Missouri need strong showings on offense to beat conference front-runners. More >> Tuesday, October 6 2015 8:51 PM EDT 2015-10-07 00:51:11 GMT West Rusk Football Practice It’s no secret, that there has been somewhat of a drought for west rusk football. But like the first drops of the rain season the raiders have announced their comeback by quenching the thirst of fans with win after win.“Our energy, the passion for the game has went up dramatically from the last couple of years. We just want to win. It’s really that simple,” said Dee Starling, Raiders quarterback. More >> It’s no secret, that there has been somewhat of a drought for west rusk football. But like the first drops of the rain season the raiders have announced their comeback by quenching the thirst of fans with win after win.“Our energy, the passion for the game has went up dramatically from the last couple of years. We just want to win. It’s really that simple,” said Dee Starling, Raiders quarterback. More >>", "external_links": [], "published": "2015-10-08T05:55:00.000+03:00", "crawled": "2015-10-08T06:31:14.578+03:00", "highlightTitle": ""}