{"organizations": [], "uuid": "ba25f1758aedecd8c4575d280b5364acbccbd639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/9c89b9521a43902c830f6a706700ec92.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/latest-news/2015-10-01/oregon-marijuana-shops-begin-sales-recreational-users", "country": "US", "title": "Oregon marijuana shops begin sales to recreational users", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Oregon marijuana shops begin sales to recreational users | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T15:29:00.000+03:00", "replies_count": 0, "uuid": "ba25f1758aedecd8c4575d280b5364acbccbd639"}, "author": "JONATHAN J. COOPER and BOB SEAVEY | Associated Press", "url": "http://savannahnow.com/latest-news/2015-10-01/oregon-marijuana-shops-begin-sales-recreational-users", "ord_in_thread": 0, "title": "Oregon marijuana shops begin sales to recreational users", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Juliano Hamana, 24, samples the aroma of one of the offerings at Shango Premium Cannabis, in Portland , Ore., Thrusday, Oct. 1, 2015. Oregon marijuana stores have begun sales to recreational users, marking a big day for the budding pot industry in the state. Some of the more than 250 dispensaries in Oregon that already offer medical marijuana opened their doors early Thursday to begin selling the drug just moments after it became legal to do so. (AP Photo/Timothy J. Gonzalez) Back | Next Davia Fleming, 29, center, is surrounded by media members as she becomes the first shopper at Shango Premium Cannabis, in Portland, Ore., Thursday, Oct. 1, 2015. Oregon marijuana stores have begun sales to recreational users, marking a big day for the budding pot industry in the state. Some of the more than 250 dispensaries in Oregon that already offer medical marijuana opened their doors early Thursday to begin selling the drug just moments after it became legal to do so. (AP Photo/Timothy J. Gonzalez) Back | Next Customers line up outside of Shango Premium Cannabis, in Portland, Ore., Wednesday, Sept. 30, 2015. Oregon marijuana stores will begin sales to recreational users on Thursday. (AP Photo/Timothy J. Gonzalez) Back | Next Associate Chris Hewitt holds up 7 gram bags of marijuana buds being prepared for sale at Nature Scripts medical marijuana dispensary in Murphy, Ore., Wednesday, Sept. 30, 2015. The dispensary is one of many across the state preparing for the first day of retail legal sales starting Thursday. (AP Photo/Jeff Barnard) SPECIAL OFFER FOR NEW READERS 99 cent digital subscription to savannahnow.com\nSubscriber-members get access to ALL our digital products AND become eligible for free event tickets, discount coupons and other benefits. SIGN UP FOR SUBSCRIBER BENEFITS As a Savannah Morning News / savannahnow.com subscriber, you're eligible for members-only discounts. Download your coupons now. By JONATHAN J. COOPER and BOB SEAVEY | Associated Press PORTLAND, Ore. — Oregon marijuana shops began selling marijuana Thursday for the first time to recreational users, marking a big day for the budding pot industry.\nSome of the more than 250 dispensaries that already offer medical marijuana in Oregon opened their doors soon after midnight — just moments after it became legal to sell to anyone who is at least 21.\nAt Portland's Shango Premium Cannabis, co-founder Shane McKee said the first sale to an excited customer came about a minute after midnight, with many others waiting.\n\"It looks like there is about 60-70 in line out front,\" he said in a telephone interview shortly after midnight. \"They all seem extremely eager.\"\nThat first buyer, Davia Fleming of Portland, said the sales launch was important.\n\"I was really excited about that,\" said Fleming, who uses the drug for medicinal purposes. \"It's the end of a prohibition.\"\nShe described the atmosphere inside the store as \"beautiful. ... very friendly; everyone is upbeat.\"\nStore owners say they're hopeful they can avoid the shortages and price spikes that followed the start of legal sales last year in Washington and Colorado, the only other states where the drug can now be sold for recreational use. Alaska could begin retail sales next year.\nMany stores in Oregon were trying to lure customers with extended hours, food giveaways and discounted marijuana.\nMcKee said his store offered its first 25 customer a 35-40 percent discount. The store was also handing out soda, coffee, juice and other refreshments.\nBut he also pointed to what he considered the significance of the moment.\n\"I think it's not only historical for folks in Oregon but nationwide — anytime people start selling that as an alternative to alcohol or tobacco.\"\nShoppers have one more incentive to buy early and often: Under Oregon law, pot purchases will be tax-free until January — a savings of up to 20 percent.\nOne store was offering a goody bag with T-shirts, but no free marijuana. Another will have a live band and 10 percent discounts. The marijuana review site Leafly will set up with food trucks at a handful of stores, giving away free meals to anyone who promotes the service on social media.\nSeveral stores have erected billboards in Portland. A shop in Merlin is advertising on the radio.\n\"I'm just trying to basically stock up for maybe four or five times what the normal volume would be,\" said Chris Byers, owner of River City Dispensary in the southern Oregon town of Merlin.\nCustomers can buy as much as seven grams at a time of dried marijuana flower and leaf — the part that's generally smoked — plus plants and seeds. For the next year or so, marijuana infused candy, cookies, oils and lotions will be available only to people with medical marijuana cards as the state works on retail regulations involving those products.\nOregon has a robust supply system for marijuana that has supported medical marijuana users and the black market. Companies have invested in massive warehouses in Portland to grow the drug indoors, and southern Oregon has some of the nation's best conditions for outdoor cultivation of marijuana.\nGrowers don't face strict regulations yet, so the supply can more easily flow into retail stores than it did in Washington and Colorado.\nStill, there's concern. Summer has historically been a time of marijuana shortages in Oregon, and most of the outdoor crop isn't ready to harvest. Indoor growers have had minimal time to ramp up production, since lawmakers only approved the Oct. 1 start date three months ago.\n\"We have kind of a seasonal growing market here in Oregon,\" said Jeremy Pratt, owner of Nectar Cannabis, which has four stores in Portland. \"We have lots of product in the fall, and then it kind of gets tight this time of year anyway.\"\nGreen Oasis, which has two locations in Portland and more on the way, has prepared by trying to cultivate strong relationships with growers. On Thursday evening, it will entice customers with a band playing outdoors. People who spend at least $40 on Thursday will get a 10 percent discount, co-owner Matthew Schwimmer said.\n\"We don't know of anyone else doing a band, and we thought it was a good idea to give back to the community,\" Schwimmer said.\n___\nSeavey reported from Phoenix", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/5b7d0763f45d872b830f6a706700be98.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/996606d71a46902c830f6a70670021b4.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/9ab964f01a42902c830f6a706700ac3f.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/9c89b9521a43902c830f6a706700ec92.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/996606d71a46902c830f6a70670021b4.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/9c89b9521a43902c830f6a706700ec92.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/9ab964f01a42902c830f6a706700ac3f.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/5b7d0763f45d872b830f6a706700be98.jpg"], "published": "2015-10-01T15:29:00.000+03:00", "crawled": "2015-10-01T15:31:16.016+03:00", "highlightTitle": ""}