{"organizations": [], "uuid": "428c778fa74c936d49172ca5d25e456052fa5c30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/sports/bluejays/2015/10/09/it-was-more-than-one-call-that-cost-the-blue-jays-game-2-arthur/second.jpg", "site_section": "http://www.thestar.com/sports/golf.html", "section_title": "Golf and PGA News | Sports | Toronto Star", "url": "http://www.thestar.com/sports/bluejays/2015/10/09/it-was-more-than-one-call-that-cost-the-blue-jays-game-2-arthur.html", "country": "CA", "title": "It was more than one call that cost the Blue Jays Game 2: Arthur", "performance_score": 1, "site": "thestar.com", "participants_count": 1, "title_full": "It was more than one call that cost the Blue Jays Game 2: Arthur | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "428c778fa74c936d49172ca5d25e456052fa5c30"}, "author": "Bruce Arthur", "url": "http://www.thestar.com/sports/bluejays/2015/10/09/it-was-more-than-one-call-that-cost-the-blue-jays-game-2-arthur.html", "ord_in_thread": 0, "title": "It was more than one call that cost the Blue Jays Game 2: Arthur", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You can howl about the second-base Zapruder film, and you can spend forever there, if you like. You can swear that Rougned Odor’s cleated foot slipped all the way off the bag, just enough, amid the splash of dirt and slow-motion physics. Some Toronto Blue Jays officials watched video and believed Odor, the young man torturing this already tortured city, was out. They were not alone.\nBut upon review Odor was called safe, rather than the third out of the 14th inning. Two pitches later he was the winning run in an operatic 6-4 Texas Rangers win in Game 2 of this best-of-five American League Division Series. You can howl, but you would be wrong, and it’s not what really mattered anyway. An 0-2 deficit may doom Toronto’s glorious, magic-carpet season, and you could almost hear the city wail. But the call was at best a Rorschach test, and at worse, correct.\n“What defines definitive?” said Toronto centre fielder Kevin Pillar, who was only one of several angry Jays. “I thought it passed the eye test. That’s my opinion on it. I know we don’t have all the angles . . . I know a lot of people are going to see with their heart, but I’m pretty sure I saw some daylight in there.”\n“Was he off the bag, was he on the bag, I don’t know,” said first baseman Chris Colabello, who more or less had the game of his life, especially in the field. “The view we had, it looked like he came off, but you don’t know if his spikes are hanging on or whatever. One play like that, it’s not going to make a difference in a game. Obviously it’s going to stand out in a lot of people’s eyes, ’cause we’re out of the inning. But it’s just part of it.”\nHere’s what I saw: From one lonely camera angle — not the one everybody screencapped and circulated online like proof of conspiracy — you could actually see the far side of second base, and you could not see Odor’s spikes definitely leave the bag. Hell, second baseman Troy Tulowitzki said he wasn’t sure, and he applied the tag. You could not overturn that call. At least Toronto was sure Gretzky high-sticked Gilmour.\nAnd faced with that reality, Jays manager John Gibbons left reliever LaTroy Hawkins in the game, even as his pitches were producing hard contact, to cap a day of decisions that went wrong. There was plenty that was ridiculous on this day, starting with a Vic Carapazza strike zone that shifted like a big wiggling amoeba, and that if put to paper would resemble the paintings my children produced around the age of three. It flustered Marcus Stroman in the first, and produced a Tulowitzki strikeout in the 14th that was absurd. Jays catcher Russell Martin said, “if that was a regular-season game, I’m pretty sure there’s a pretty good chance I’m getting thrown out of that game.”\nBut the strike zone was a jellyfish for everyone, and it was the Jays who couldn’t hold onto fly balls or foul tips or a bad throw in the first inning, which led to a second Texas run. It was the Jays who couldn’t hold a 4-3 lead in the eighth. And it was the Jays who got two hits between the fifth inning and the 14th, one of which left the infield. After Josh Donaldson’s first-inning home run — his cinematic, come-back-from-a-knee-to-the-head home run — Toronto’s No. 2 to No. 5 hitters went 1-for-21 This monster-hitting team didn’t hit, and dropped to 16-61 when they score four runs or less.\nA great team, at its best, plays through a wobbly strike zone, and one bad call in 14 innings. A great team, at its best, has enough. Donaldson and Jose Bautista each crushed balls that hooked just foul, and Edwin Encarnacion hit one 391 feet to centre field, but baseball isn’t a nearly game. You do it or you don’t. Through the anger, they knew that.\n“We had so many chances,” said Martin. “We didn’t come through. You can’t really blame the umpire.”\n“We’ve lost these games, not anyone else for us,” said Jose Bautista. “Have these been the easiest games to play? Perhaps not. But we could’ve won if we’d played better.”\nThe Jays are a great team, without a doubt, even after these two debacles. But right now, they are not at their best. They will go to Texas without killer left-handed reliever Brett Cecil, limping on a torn calf, and with no margin for error. “I told the guys, we just need to get on the 11-game winning streak,” said Martin, a smile on his face. “We’ll be fine. We’ve done it before.”\nThe season deserves to be kept alive. Baseball isn’t fair, but you still have to play.\nMore on thestar.com\nQuestionable umpiring leaves Blue Jays frustrated: Griffin\nUpset about playing in the great indoors? Blame MLB, not the Jays", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T04:03:34.562+03:00", "highlightTitle": ""}