{"organizations": [], "uuid": "4415683c6e02ec65e4322031f0d67f5531f7ae3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/03/04smith.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/college/college_football/2015/10/bc_notebook_points_left_on_field_irk_coach", "country": "US", "title": "BC notebook: Points left on field irk coach", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "BC notebook: Points left on field irk coach | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "4415683c6e02ec65e4322031f0d67f5531f7ae3a"}, "author": "Rich Thompson", "url": "http://bostonherald.com/sports/college/college_football/2015/10/bc_notebook_points_left_on_field_irk_coach", "ord_in_thread": 0, "title": "BC notebook: Points left on field irk coach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DURHAM, N.C. — The number 13 proved exceptionally unlucky for Boston College in yesterday’s 9-7 loss to Duke at Wallace Wade Stadium.\nThat was the number of points BC left on the field that could have produced the Eagles’ first ACC victory this season.\n“There were 13 points that realistically should have been made and if you add that 13 to the seven you have a 20 to 9 game,” said BC coach Steve Addazio .\nSix points were squandered on two horrific plays in the kicking game. BC was on the Duke 25 with freshman kicker Colton Lichtenberg looking at a 42-yard field-goal attempt with the wind at his back. But the relay between long snapper Leonard Skubal and holder Bobby Swigert blew up resulting in a 6-yard loss and change of possession.\nBC had a chance to take the lead with 3:35 to play. Lichtenberg’s 45-yard field-goal attempt sailed off his foot like a wounded duck and never reach the goal line. Because of a leg injury, Alex Howell was relieved of his field goal and kickoff duties for the Eagles.\nBC had an apparent touchdown pass from quarterback Jeff Smith to receiver Thadd Smith ruled incomplete on a close call. Smith went over Duke cornerback Alonzo Saxton and got both hands on the ball. But as he spun around to protect the ball, Smith lost possession when he hit the turf.\n“Thadd was presenting the ball after he caught the ball,” said Addazio. “You catch the ball and bring the ball to you.”\nSmith makes amends\nSmith was actually the Eagles’ most dependable weapon in the passing game against the Blue Devils.\nOn a third-and-10 from the BC 1-yard line, quarterback Troy Flutie connected on a 33-yard strike to Smith down the left sideline.\nSmith scored the Eagles’ lone touchdown on a 66-yard strike from Flutie with 28 seconds to play in the third quarter. Smith ran a deep post, caught the ball on the Duke 30 and ran it in for his first of the season.\n“Thadd is a great receiver and he got open all day,” said Flutie. “He played great and there is a connection there.”\nKavalec returns\nThe Eagles got five tackles and 1.5 tackles for a loss by returning right defensive end Kevin Kavalec .\nKavalec suffered a concussion when was hit on a blindside block by Florida State quarterback Everett Golson on Sept. 18. Kavalec left that game and did not play the following week against Northern Illinois.\nKavalec’s signature tackle came on the last play of a magnificent goal-line stand. He combined with middle linebacker Connor Strachan to stuff Duke tailback Jela Duncan on fourth-and-goal at the 1 with 11:15 to play in the third quarter.", "external_links": [], "published": "2015-10-04T03:00:00.000+03:00", "crawled": "2015-10-04T11:18:41.519+03:00", "highlightTitle": ""}