{"organizations": [], "uuid": "bca7c2a93d60be5609836719db7aa859ce469ffa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "diabetes.diabetesjournals.org", "main_image": "", "site_section": "http://www.aasdn.org/feed/", "section_title": ":: American Academy of Sports Dietitians and Nutritionists ::", "url": "http://diabetes.diabetesjournals.org/content/early/2015/08/28/db15-0675.abstract", "country": "US", "title": "Mechanism by which caloric restriction improves insulin sensitivity in sedentary obese adults", "performance_score": 0, "site": "diabetesjournals.org", "participants_count": 1, "title_full": "Mechanism by which caloric restriction improves insulin sensitivity in sedentary obese adults", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T14:03:00.000+03:00", "replies_count": 0, "uuid": "bca7c2a93d60be5609836719db7aa859ce469ffa"}, "author": "admin", "url": "http://diabetes.diabetesjournals.org/content/early/2015/08/28/db15-0675.abstract", "ord_in_thread": 0, "title": "Mechanism by which caloric restriction improves insulin sensitivity in sedentary obese adults", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "K. Sreekumaran Nair 1 , * 1 Division of Endocrinology and Metabolism, Mayo Clinic College of Medicine, Rochester, Minnesota 2 Howard Hughes Medical Institute and the Departments of Medicine and Cellular & Molecular Physiology, Yale University School of Medicine, New Haven, CT * Corresponding author: K. Sreekumaran Nair, Email: nair{at}mayo.edu Abstract Caloric restriction (CR) improves insulin sensitivity and reduces the incidence of diabetes in obese individuals. The underlying mechanisms whereby CR improves insulin sensitivity are not clear. We evaluated the effect of 16-weeks of CR on whole-body insulin sensitivity by pancreatic clamp before and after CR in 11 obese participants (BMI=35 kg/m 2 ) in comparison with a matched control period (CON, N=9, BMI=34 kg/m 2 ). Compared to CON, CR increased the glucose infusion rate needed to maintain euglycemia during hyperinsulinemia indicating enhancement of peripheral insulin sensitivity. This improvement in insulin sensitivity was not accompanied by changes in skeletal muscle mitochondrial oxidative capacity or oxidant emissions, nor was there changes in skeletal muscle ceramide, diacylglycerol, or amino acid metabolite levels. However, CR lowered insulin-stimulated thioredoxin-interacting protein (TXNIP) levels and enhanced non-oxidative glucose disposal. These results support a role for TXNIP in mediating the improvement in peripheral insulin sensitivity after CR. Received May 20, 2015. Accepted August 26, 2015. © 2015 by the American Diabetes Association. Readers may use this article as long as the work is properly cited, the use is educational and not for profit, and the work is not altered. CiteULike", "external_links": [], "published": "2015-10-07T14:03:00.000+03:00", "crawled": "2015-10-09T10:29:39.252+03:00", "highlightTitle": ""}