{"organizations": ["Seattle Seahawks", "Seahawks"], "uuid": "ac8c532f522ffcc94e2694c95b16316a672d0757", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spokesman.com", "main_image": "http://media.spokesman.com/photos/2015/10/22/OPIX_Seahawks_49ers_Football.JPG_qm4UVV2_t400.jpg?fd5af0684d698ce74dd4392bafb4f89a6dc66ee3", "site_section": "http://www.spokesman.com/feeds/stories/sports/", "section_title": "Spokesman.com: Sports stories", "url": "http://www.spokesman.com/stories/2015/oct/22/wilson-seahawks-rule-rivalry-with-49ers-again-in-2/", "country": "US", "title": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win - Thu, 22 Oct 2015 PST", "performance_score": 0, "site": "spokesman.com", "participants_count": 0, "title_full": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win - Thu, 22 Oct 2015 PST", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:36:00.000+03:00", "replies_count": 0, "uuid": "ac8c532f522ffcc94e2694c95b16316a672d0757"}, "author": "", "url": "http://www.spokesman.com/stories/2015/oct/22/wilson-seahawks-rule-rivalry-with-49ers-again-in-2/", "ord_in_thread": 0, "title": "Wilson, Seahawks rule rivalry with 49ers again in 20-3 win - Thu, 22 Oct 2015 PST", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wilson"], "text": "Tags: San Francisco 49ers Seattle Seahawks \nSANTA CLARA, Calif. — Before the Seahawks could tear down the San Francisco 49ers on Thursday night they had to learn how to chop wood. \nWell, that was the message delivered to the team by defensive lineman Michael Bennett shortly before the game. \nBennett decided the team’s problem the past … Marcio Jose Sanchez photo (Full-size photo) \nSANTA CLARA, Calif. — Before the Seahawks could tear down the San Francisco 49ers on Thursday night they had to learn how to chop wood. \nWell, that was the message delivered to the team by defensive lineman Michael Bennett shortly before the game. \nBennett decided the team’s problem the past few weeks as it bafflingly blew fourth-quarter lead after fourth-quarter lead was that it was viewing the task as completed while there was still work to be done. \nSo Bennett told his teammates to think of winning a game like chopping down a tree. \n“When you are chopping wood you keep chopping until the tree falls,’’ Bennett said. “You can’t get ahead of yourself. You just keep chopping and chopping, and eventually the tree is going to fall.’’ \nOr, in football parlance Colin Kaepernick, whom the Seahawks sacked six times in beating the 49ers 20-3. It was the Seahawks’ most dominating performance of the season. \nThe Seahawks outgained the 49ers 388-142 in total yards, outgained them 176-61 on the ground and established a tone of domination with a 61-yard, 12-play drive for a touchdown the first time they had the ball. It was a drive that basically decided the game, even if Seahawks fans understandably never felt comfortable until the final minutes. \nThis time, though, there was no fourth-quarter drama as the Seahawks led 17-3 entering the final 15 minutes and then forced the 49ers into three consecutive three-and-outs to win going away. \nMarshawn Lynch sparked the offense with a season-high 122 yards on 27 carries despite spending the second series of the game vomiting into a garbage can, and rookie Tyler Lockett scored on a 43-yard pass in the second quarter as part of a career-high five receptions for 79 yards. \nWhen it ended, the Seahawks had rushed 41 times and thrown just 24, the kind of run-pass ratio so common during the good days of the past two years. They held the 49eres to just 3.2 yards a play. \n“It felt like a really normal Seahawk night tonight,’’ coach Pete Carroll said. “That’s the way we are supposed to finish games.’’ \nEven if Seattle had a 2-0 deficit in the turnover margin, winning for the second time this season when losing the turnover battle after having three times this year lost when winning the turnover battle, something Carroll said he couldn’t wrap his head around. \nThe victory snapped a two-game losing streak for the Seahawks, both games in which Seattle held a substantial fourth-quarter lead — 24-7 at Cincinnati two Sundays ago and 23-14 against Carolina on Sunday — only to lose in the final minute. \nThe lasting image of the Carolina game was a 26-yard touchdown pass from Cam Newton to Greg Olsen in the final minute with the Seattle defense playing two different coverages, and then Earl Thomas and Richard Sherman turning and pointing at each other in confusion. \nMany viewed the sequence as a sign of internal strife. \nTold that after the game Thursday in a locker room again happy with the sounds of hip-hop music and jokes, Thomas laughed and said, “I’m glad I didn’t hear that,’’ \nThomas had said Monday the week would be big to see if the team could quickly turn the season on a short week following two tough defeats. \nThe celebration around him gave the answer. \n“We’re definitely going in the right direction.’’ \nThomas cited the team’s decision to have Richard Sherman follow San Francisco receiver Torrey Smith all over the field, something the team’s other cornerback, Cary Williams, could have viewed as a demotion. \n“A lot of guys would have been like, ‘You are not taking me off the No. 1 receiver,’ ’’ Thomas said. “He’s very humble. That’s a team player.’’ \nAnd the Seahawks again appeared a team from start to finish, highlighted by Bennett and Cliff Avril combining for five of the teams sacks. \nBennett, fitting the mood of the night, cited the play of the secondary as the key. \n“The quarterback held the ball today so that gave me time to get there,’’ he said. \nSaid Avril: “We are just in a groove, man. Playing ball. Having fun. Enjoying what we are doing.’’ \nComments that painted a stark contrast from the popular view of this team even 24 hours ago when the Seahawks were 2-4, with many ready to paint the team that has gone to two consecutive Super Bowls as being dead in the water. \n“We really haven’t been playing bad defense,’’ Bennett said after the Seahawks held the 49ers to the second-lowest yardage total allowed during the Carroll era. “We just had some bad plays in the second half.’’ \nThere were few on this night. \n“It was very important to get back to playing football the way we like to play,’’ receiver Doug Baldwin said. “And the style that we play football and also to finish games. It wasn’t clean, it wasn’t perfect. But we are on the right track.’’", "external_links": [], "published": "2015-10-23T06:36:00.000+03:00", "crawled": "2015-10-23T11:07:50.550+03:00", "highlightTitle": ""}