{"organizations": [], "uuid": "7c1c1cdf9243d072d1043d1275a8d5ac2e13e95e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ithacajournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/fbd2e856b3aaab8e3e8bb67a05d070949e6d9805/c=0-46-1598-949&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/30/CNYGroup/Elmira/635792384947268717-IMG-0112-001.JPG", "site_section": "http://rssfeeds.ithacajournal.com/ithaca/sports", "section_title": "Ithaca - Sports", "url": "http://www.ithacajournal.com/picture-gallery/sports/2015/10/02/gallery-lansing-defeats-dryden-18-13/73248096/", "country": "US", "title": "Conversation With: Marathon co-director Sheila Sutton", "performance_score": 0, "site": "ithacajournal.com", "participants_count": 0, "title_full": "Conversation With: Marathon co-director Sheila Sutton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T00:30:00.000+03:00", "replies_count": 0, "uuid": "7c1c1cdf9243d072d1043d1275a8d5ac2e13e95e"}, "author": "", "url": "http://www.ithacajournal.com/picture-gallery/sports/2015/10/02/gallery-lansing-defeats-dryden-18-13/73248096/", "ord_in_thread": 0, "title": "Conversation With: Marathon co-director Sheila Sutton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sheila Sutton Andrew Legare", "Sheila Sutton", "Mark Landin"], "text": "Conversation With: Marathon co-director Sheila Sutton Andrew Legare, alegare@stargazette.com | @SGAndrewLegare 5:30 p.m. EDT October 2, 2015 Painted Post resident is co-director of the Wineglass Marathon with Mark Landin Wineglass Marathon co-director Sheila Sutton at the marathon's headquarters in Corning on Sept. 30. (Photo: ANDREW LEGARE / Staff Photo) CONNECT 7 TWEET LINKEDIN COMMENT EMAIL MORE \nSheila Sutton, 55, has been co-director of the Wineglass Marathon along with Mark Landin since 2011. She was previously a volunteer for the event and is also a competitive runner who has competed on Wineglass weekend. The mother of three lives in Painted Post and previously worked for Corning Inc. in human resources. \nWhat is your running background? \nI have been running all my life — 16, 17 marathons I've done. I have several planned coming up. I come from a running family. I have a brother (Bob Weiner) who runs for the Newton Elite running team, is a lawyer, and actually won our masters a couple of years ago and just did a (1 minute, 12 second) half marathon. My dad was head of corporate security for Corning (Inc.) for many years, FBI before that. I kind of grew up all over the country. I used to work for Corning in and stayed home with three kids. I got back to running after I was finished having three kids. It's a passion. Wineglass Marathon packs big economic punch in region \nDo you have another job? \nThis is it. This is year round. If you ask any of the folks behind the scenes, logistically there's a lot to it. The more runners, the more safety. We have really worked to have an even better relationship with our fire departments and our police and (the Department of Transportation) and 911 centers and stuff just to ensure that everything runs smoothly. So it really is year-round planning. \nSo if someone were to ask what you and Mark do, would it basically come down to making sure everything goes off without issue? \nEvery little detail. Whether the food tent has paper plates and napkins, whether the water stations have rakes and enough cups and enough water. How much chicken soup we've ordered from Wegmans, how many apples we're getting from Peaches 'n Cream. There are no little details that really get overlooked. \nIt seems like the Wineglass, now in its 34th year, keeps growing in terms of stature. What are your thoughts on that growth? \nIt really kind of topped out at a little less than 1,000 runners. The relay (since replaced by the half marathon) logistically was very challenging because of our country rides and safety-wise. We really have an ideal spot starting at Campbell-Savona High School for the half and the half is very popular, particularly with women. It's a nice distance. You can run and train and still have some free time. Training for a marathon can really take a lot of time and is a big-time commitment and can drain on families. \nBut we just are a great destination race with the wineries and now we have tons of breweries. The museums. If you have a family, there's a lot for them to do. It's a great place to come for a girls weekend. There's shopping. And we really want people to come and then come back. And we're seeing that. People start arriving on Thursdays, do wine-tasting tours or do things at the museum, then they'll stay through Monday. We discovered last year Monday was as busy as Friday business-wise. \nHow many people are involved in putting together the race weekend? \nOver 2,000, which is a nice average when you think that we have roughly 6,000 to 6,500 runners. It’s a nice balance between those two numbers. \nHow important are those people in making this all happen? \nWe couldn’t do it without our fire departments. Our fire departments along the course are phenomenal. They really take it to heart, and the safety of the runners, and ensuring that their area works smoothly. We have the start of the half in Campbell and the fire department there, those folks are very instrumental in making sure the traffic flows, the buses get to the start and the runners safely get on through Campbell and on to the course. They’re there a long time. \nTodd Hall and the Coopers Plains Fire Department have an incredible job. Coopers Plains is kind of spread out. There are a lot of roads in and out of Coopers Plains. They’re now actually covering the one-way section on Victory Highway up to Robert Dann. A lot of volunteers work with him and his fire department and again, we couldn’t do it without them. Painted Post, we have the bike path and they drive with ATVs along the course to make sure the runners are safe. We use Rural/Metro, the Red Cross, Health Ministries staff the medical tents. We have two sheriff bikers. Everybody works tirelessly to ensure everything goes smoothly. \nHow much do you enjoy the aspect of bringing the community together for this event? \nI love it. We live in an absolutely stunning area. To showcase it by our marathon and our half marathon to the world — and we have runners from all over the world coming — it’s very rewarding. They thank the volunteers, they’re pleasant, they have comments afterward about how pretty it is or they say they’re coming back. It’s all things we strive to see happen. What to do after the Wineglass Marathon \nIs there anything about this event behind the scenes people would be surprised about? \nI think the last couple of years, runners worry about being too slow and being on the course and us kicking them off the course. And we’ve not kicked anybody off the course. We have a team of 19 bikers out on the course and somebody hits the city limits and we have bikers who stay with them, take them water. We have ham radio folks out on the course who follow the last runner — usually at that point a walker. We may be cleaning up some of Market Street and putting bike racks and some equipment away, but we’re there for that last person who comes in. We’ve had people come out of restaurants and joined us as we’ve clapped for that person coming down Market Street. We make sure they get their medal. They worked hard, probably harder than the rest of us for the day. That’s a lot of determination to stay out there for six and a half or seven hours. That last runner is usually very surprised and in tears. Wineglass Marathon expands, improves \nWith Olympian Molly Huddle from Elmira, the area boasting national-caliber high school runners and teams, and the success of the Wineglass Marathon, what do you see as the reason the sport is so big around here? \nI think a lot of dedicated coaches for the schools. The marathon has grown and the half marathon. You’re seeing more runners locally who say, ‘I can run a 5K and they’re challenging themselves to run a half. It’s just really sticking. We’re blessed with good genes I guess, too, in the area. \nWe’ve established a scholarship fund for each of the three high schools this year. A graduating male and a graduate female from Bath, from Campbell-Savona and from Corning-Painted Post will each receive a scholarship, a running one, just as our way to continue that whole continue to run. Running is a great, lifelong sport. You just put your shoes on and you go out. \nOn Twitter: @SGAndrewLegare Read or Share this story: http://stargaz.tt/1L9ebeu TOP VIDEOS", "external_links": [], "published": "2015-10-03T00:30:00.000+03:00", "crawled": "2015-10-03T11:05:02.887+03:00", "highlightTitle": ""}