{"organizations": [], "uuid": "d5f850a1e739cb58677102f1fd3f207d22365872", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com/asset/1200_630/562e57021900002d00b94dee.png", "site_section": "http://www.huffingtonpost.com/feeds/verticals/sports/index.xml", "section_title": "Sports - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/rondae-hollis-jefferson-mom-new-house_562e553ee4b0443bb564a44d", "country": "US", "title": "Brooklyn Nets Rookie Buys New House For Mom Instead Of Himself", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Brooklyn Nets Rookie Buys New House For Mom Instead Of Himself", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:25:00.000+02:00", "replies_count": 0, "uuid": "d5f850a1e739cb58677102f1fd3f207d22365872"}, "author": "Justin Block", "url": "http://www.huffingtonpost.com/entry/rondae-hollis-jefferson-mom-new-house_562e553ee4b0443bb564a44d", "ord_in_thread": 0, "title": "Brooklyn Nets Rookie Buys New House For Mom Instead Of Himself", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brooklyn Nets Rookie Buys New House For Mom Instead Of Himself Rondae Hollis-Jefferson made his mother's birthday an especially memorable one. Justin Block Associate Sports Editor, The Huffington Post Posted: 10/26/2015 01:25 PM EDT | Edited: 14 minutes ago \nRondae Hollis-Jefferson just gave back to the woman who gave him everything. \nThe Brooklyn Nets rookie celebrated his mother's birthday on Friday by pulling out his checkbook for the biggest gift imaginable: A new house. In an entry for The New York Post, Hollis-Jefferson recounted Friday night's life-changing surprise party for his mother, Rylanda Hollis. \nShe said it was her best birthday ever. That’s huge for me and my brother, and my uncle, who is like a brother to us. … That’s big in our eyes, to be able to do that. Being able to change your mom’s life, to be able to put her in a comfortable situation. … It makes that feeling in your heart go to ease. \nInstead of worrying about where your mom is going, what she’s doing, it puts you at ease knowing she has a place of her own, and that she has somewhere to lay her head at night. It’s pretty special. \nAccompanied by a videographer, Hollis-Jefferson surprised his mom -- who showed up to the house not knowing that she owned it or that there was a party going on inside -- right at the door for the reveal. \nSO MANY FEELINGS. \nFor Hollis-Jefferson, that memory is worth putting himself in a less-than-glamorous living situation. Armed with a new multi-million dollar contract , Hollis-Jefferson is equipped to experience the high-rolling NBA lifestyle, but instead, he seems to be staying as grounded as possible. \nIn September, he complained about the rip-off that is the New York City real estate market to The Wall Street Journal, revealing that he's chosen to lock-down a rental with his brother, NBA D-Leaguer Rahlir Hollis-Jefferson and a friend in Northern New Jersey. Having traversed the tri-state real estate market once before, Hollis-Jefferson probably got a sick deal on his mom's home -- a far cry from the run-down but still insanely expensive apartments you can score in Brooklyn . \nOn a $1.33 million salary this season, he could easily afford any number of luxury apartments and homes in Manhattan or Brooklyn, but those extravagant comforts are secondary to Hollis-Jefferson. A sensible rental in New Jersey and a real home for mom will do for now. \nFamily first.", "external_links": [], "published": "2015-10-26T19:25:00.000+02:00", "crawled": "2015-10-26T19:54:54.305+02:00", "highlightTitle": ""}