{"organizations": ["Red Wings", "Lightning Zetterberg"], "uuid": "f716a4b9dc59054abef51733b7eb1ebab69ef5f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxsports.com", "main_image": "http://a.fssta.com/content/dam/fsdigital/RSN/Detroit/2015/10/13/pi-wings-zetterberg-101315.vresize.1200.675.high.82.jpg", "site_section": "http://api.foxsports.com/v1/rss?partnerKey=zBaFxRyGKCfxBagJG9b8pqLyndmvo7UU&tag=detroit", "section_title": "FOX Sports Digital", "url": "http://www.foxsports.com/detroit/story/zetterberg-lifts-red-wings-to-3-1-win-over-lightning-101315", "country": "", "title": "Zetterberg lifts Red Wings to 3-1 win over Lightning", "performance_score": 0, "site": "foxsports.com", "participants_count": 0, "title_full": "Zetterberg lifts Red Wings to 3-1 win over Lightning", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:21:00.000+03:00", "replies_count": 0, "uuid": "f716a4b9dc59054abef51733b7eb1ebab69ef5f0"}, "author": "", "url": "http://www.foxsports.com/detroit/story/zetterberg-lifts-red-wings-to-3-1-win-over-lightning-101315", "ord_in_thread": 0, "title": "Zetterberg lifts Red Wings to 3-1 win over Lightning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Zetterberg"], "text": "Zetterberg lifts Red Wings to 3-1 win over Lightning AP \nOct 13, 2015 at 10:21p ET + \nHenrik Zetterberg and his Red Wings are now 3-0. Rick Osentoski / USA TODAY Sports AP Updated Oct 13, 2015 at 10:25p ET \nDETROIT (AP) -- Henrik Zetterberg had a goal and an assist and Jimmy Howard made 20 saves to help the Detroit Red Wings beat the Tampa Bay Lightning 3-1 Tuesday night. \nDetroit is now 3-0 on the season, while the Lightning fell to 3-1. The game was also a rematch of last year's first-round playoff matchup, which Tampa Bay won in seven games. \nBen Bishop made 21 saves for the Lightning. \nDetroit outplayed Tampa Bay for most of the first period, but Bishop made a pair of tough saves against Gustav Nyquist , the second on the period's only power play. \nTampa had their first great chance with a 2-on-1 midway through the second, but Howard stopped Vladimir Namestnikov, and the defense cleared the rebound. \nJustin Abdelkader drew a roar from the crowd late in the second, leveling Alex Killorn , but Tampa Bay kept the puck in the zone, and Steven Stamkos hit the post. Moments later, Nyquist drew a tripping penalty, and it only took 12 seconds for him to beat Bishop at 17:52 of the second period for his first goal of the season. \nDetroit killed two power plays early in the third period, preserving the lead, and rookie Dylan Larkin's aggressive forechecking set up three scoring chances. The first two trickled wide, but Zetterberg fired Larkin's pass over Bishop's right shoulder at 8:25. Larkin has a goal and three assists in his first three NHL games. \nRyan Callahan made it 2-1 at 11:03, beating Howard from the high slot, and the Red Wings were lucky to clear a goal-mouth scramble seconds later. \nLarkin had a chance to clinch the game in the final three minutes, but fired wide on a breakaway. Howard then kept Detroit ahead with a blocker save on Nikita Nesterov with 2:25 left. \nJon Cooper pulled Bishop after the Red Wings iced the puck with 1:57 to play, but Detroit won the faceoff and Kyle Quincey hit the center of the net with a 185-foot blast to make it 3-1. \nNOTES : Johan Franzen was a late scratch because he was not feeling well, and was replaced by Landon Ferraro . Franzen was not seriously ill, but the Red Wings are being very cautious with him due to his concussion history. ... Detroit D Brendan Smith left the game in the first period after being slashed on the arm by Alex Killorn, but returned at the start of the second. ... The Lightning were playing their third road game in four nights.", "external_links": [], "published": "2015-10-14T05:21:00.000+03:00", "crawled": "2015-10-14T06:18:22.441+03:00", "highlightTitle": ""}