{"organizations": [], "uuid": "eabb8c7c4fedc09b732c0313ddb5331d66690916", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beloitdailynews.com", "main_image": "", "site_section": "http://www.beloitdailynews.com/search/?q=&t=article&l=100&d=&d1=&d2=&s=start_time&sd=desc&c[]=sports,sports/*&f=rss", "section_title": "Beloit Daily News - sports,sports/", "url": "http://www.beloitdailynews.com/sports/knights-safety-sets-school-records-for-tackles/article_94cfbb72-7813-11e5-92e8-4b7e22083e8c.html", "country": "US", "title": "Knights safety sets school records for tackles", "performance_score": 0, "site": "beloitdailynews.com", "participants_count": 1, "title_full": "Knights safety sets school records for tackles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:00:00.000+03:00", "replies_count": 0, "uuid": "eabb8c7c4fedc09b732c0313ddb5331d66690916"}, "author": "JIM FRANZ Sports editor", "url": "http://www.beloitdailynews.com/sports/knights-safety-sets-school-records-for-tackles/article_94cfbb72-7813-11e5-92e8-4b7e22083e8c.html", "ord_in_thread": 0, "title": "Knights safety sets school records for tackles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Knights safety sets school records for tackles Curtis-Dupuis has most ever in game, season BELOIT — Tyler Curtis-Dupuis kept his fingers crossed head coach Rodney Wedig would be able to locate a 10th opponent for the Beloit Memorial football team to face this week. Options and time ran out on the Purple Knights, however. Wedig thought he had a game lined up with Milwaukee North, but that team apparently had some behavioral issues during its game last Friday and pulled the plug on playing again. The Knights can start turning in their gear, too. Curtis-Dupuis, a junior safety, will have to be satisfied with putting up some extraordinary statistics in his team’s finale last Friday against playoff-bound Madison La Follette. He was a tackling dynamo against the Lancers, posting a single-game school record with 29. The previous mark was held by linebacker Chris Whitt (Class of 1989) with 24. The record night also boosted Curtis-Dupuis to Beloit’s single-season tackle record with 140, surpassing the 130 put up by linebacker Austin Noble in 2011. He now ranks fifth overall in Wisconsin in total tackles and second in both the Big Eight and Division 1 behind Verona’s Sam Favour. Perhaps the most amazing thing is that despite all that contact, the 5-foot-6, 130-pound Knight never missed any action. “You can really tell he has a wrestling background,” Wedig said. “He knows how to absorb hits and he does a good job when we bring him down into the box knowing how to bring the bigger guys down.” Wedig said Curtis-Dupuis does much more than just tackle,. “He’s one of our leaders,” the coach said. “He’s a quiet guy who leads by example. He hustles all the time. He’s been a glue for our defense.” Curtis-Dupuis agrees wrestling has been the perfect complement for his football career, along with a great deal of technique work. “I’d been a wide receiver in the past,” he said. “I made the switch to defense this year and worked really hard on it with my dad (assistant coach Jon Dupuis) and Coach (Joe) Oberneder. I watched a lot of film and I worked real hard on technique. It was a lot of hard work, but it paid off. I feel a lot more confident now.” The Knight said he was pleased to steadily progress. “It’s all about knowing the right way to tackle, the right angles and knowing your opponent and his tendencies,” Curtis-Dupuis said. “Early in the season, I was having trouble with bigger guys stiff-arming me. But we worked on solving that in practice and it hasn’t been as big a problem.” Curtis-Dupuis said wrestling not only helped his body control, but also his attitude on defense. “It definitely helps you because you’re more aggressive,” he said. “You have that competitive drive to be better. On the mat, every second counts. That translates well to football. You know that if you have a play that doesn’t go well you have to put it behind you immediately and go on and play hard that next play.” Curtis-Dupuis has an excellent football pedigree. His father, Jon, was a standout running back for the Knights in the 1990s and went on to play for Beloit College. Also height-challenged, he was a powerful runner with a low center of gravity. John Heineke used to call him his “search and destroy” back. Tyler’s game is more built around speed, although he has the same tenacity his father displayed. “I don’t think of my size as a problem,” Curtis-Dupuis said. “Sure, it would be easier if I was 6-2. Everybody wants to be 6-2. But my size isn’t something that will keep me from playing.” While he had a season to remember, it was another 0-9 for the Knights. Still, there was progress. “Our defense really has gotten better even if the final scores don’t reflect it,” Curtis-Dupuis said. “The guys we have out now are the guys who want to be out. They’re doing the right things and they’re putting in the time. The team is closer and has better chemistry. It’s just not a quick fix. It’s still the Big Eight. But we didn’t have many seniors. So we’ll have a lot of experience coming back. Curtis-Dupuis said he hopes to continue playing football in college. “I really would like the opportunity to play football and wrestle, the way my dad played football and baseball at Beloit College,” he said. Wedig said despite his stature, Curtis-Dupuis should have plenty of options. “The bigger schools are more likely to look for the cookie-cutter kind of physique and get caught up with the height and weight,” he said. “They figure they can coach a guy up. But a lower division will look more at how he plays. With his work ethic, I think he will be able to excel at that level.”", "external_links": [], "published": "2015-10-22T00:00:00.000+03:00", "crawled": "2015-10-23T10:23:26.456+03:00", "highlightTitle": ""}