{"organizations": ["AFCA", "NCAA", "Ithaca Bomber"], "uuid": "a0507ca5066e9aec42603e5b5ad10dc8837f4710", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ithacajournal.com", "main_image": "http://www.gannett-cdn.com/-mm-/1e1f4221b0842218dbe8d2efd8b17a2f1774e026/c=0-972-2582-2431&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/02/CNYGroup/Ithaca/635793995731357618-WELCH-Mike-2-.JPG", "site_section": "http://rssfeeds.ithacajournal.com/ithaca/sports", "section_title": "Ithaca - Sports", "url": "http://www.ithacajournal.com/story/sports/2015/10/02/no-17-ithaca-football-heads-utica-empire-8-game/73228702/", "country": "US", "title": "No. 17 Ithaca football heads to Utica for Empire 8 game", "performance_score": 0, "site": "ithacajournal.com", "participants_count": 0, "title_full": "No. 17 Ithaca football heads to Utica for Empire 8 game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T23:29:00.000+03:00", "replies_count": 0, "uuid": "a0507ca5066e9aec42603e5b5ad10dc8837f4710"}, "author": "", "url": "http://www.ithacajournal.com/story/sports/2015/10/02/no-17-ithaca-football-heads-utica-empire-8-game/73228702/", "ord_in_thread": 0, "title": "No. 17 Ithaca football heads to Utica for Empire 8 game", "locations": ["Utica", "ITHACA", "Cortland", "Ithaca"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Fleischman", "Mike Welch"], "text": "No. 17 Ithaca football heads to Utica for Empire 8 game Tom Fleischman, tfleischman@ithacajournal.com | @TomF_IJSports 4:29 p.m. EDT October 2, 2015 The Bombers, featuring one of NCAA Division III's best defenses, look to improve to 4-0 when they take on a Pioneers squad that is ranked nationally in total offense at better than 476 yards per game. Mike Welch's undefeated, 17th-ranked Ithaca Bomber football team heads to Utica on Saturday for a 1 p.m. date with the 2-2 Pioneers. Ithaca has won 13 of 14 meetings all-time with Utica. (Photo: ITHACA COLLEGE SPORTS INFORMATION) Story Highlights The Bombers are ranked 17th in the AFCA Coaches' Poll and are No. 19 in the d3football.com rankings. The Pioneers lost at Cortland last weekend, 47-40 in overtime, as the No. 25 Red Dragons moved to 4-0. Utica is 32nd in Div. III in passing yards per game (306.8) and 40th in total offense (476.8). CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nITHACA After averaging fewer than 63 rushing yards per game in its first two outings, the Ithaca College football team exploded for 253 yards last weekend in a 20-point defeat of Alfred. Sophomore Tristan Brown led the ground assault with a career-best 176 yards on just 17 carries. \nCoach Mike Welch's Bombers (3-0 overall, 1-0 Empire 8) will likely need a similar performance from Brown and Co. -- and another strong effort from its defense -- if it hopes to extend its win streak to four games against a potent Utica squad (2-2, 1-1) in an E8 clash slated for 1 p.m. at Charles A. Gaetano Stadium in Utica. \nSaturday's game, on Homecoming Weekend in Utica, will be shown live on Time Warner Cable Sports (ch. 323), then rebroadcast Saturday night, Tuesday and Thursday. \nIthaca, ranked 17th in the latest AFCA Division III poll and No. 19 in the d3football.com rankings, celebrated its homecoming last Saturday with a 38-18 defeat of the Saxons in its conference opener. Leading 21-18 with just over 10 minutes left, the Bombers put the game out of reach by scoring 17 unanswered points, sparked by Brown's 64-yard touchdown run that pushed Ithaca's lead to 10 points with 8:24 left. \nSophomore linebacker Kenny Bradley returned an interception 45 yards for a score with 7:04 to play, and senior placekicker Max Rottenecker capped the scoring with a 38-yard field goal in the final minute. \nThe Pioneers dropped a wild 47-40 overtime decision to 25th-ranked SUNY Cortland last Saturday in Cortland. Utica yielded 24 points in the second quarter alone, but forced overtime when Thomas Woodburn hit a 22-yard field goal with 1:19 to play. Steven Ferreira's second touchdown run of the game, from 7 yards out in overtime, won the game for the Red Dragons (4-0, 2-0 E8). \nIthaca will likely want to control the ball and the clock as much as possible on Saturday against a Pioneers squad that leads the conference in rushing, passing and total offense (476.8 yards per game), a figure that's good for 40th in Division III. Utica ranks 32nd nationally in passing offense (306.8 ypg), led by junior quarterback Teddy VanGalen, who completed 24 of 40 passes for 351 yards and three TDs against the Red Dragons. \nBut the Bomber defense just might provide the toughest challenge to date for Utica; Ithaca is ranked 22nd nationally in total defense (243 yards per game allowed), and is even better against the run (18th, 68.3 ypg). Led by linebackers Dan Loizos (13 tackles) and Malik Morris (12 tackles), Ithaca held Alfred to just 75 rushing yards on 30 attempts. \nThe Saxons averaged more than 167 yards per game on the ground entering last weekend; Utica is gaining 170 yards per game on the ground this season. \nUtica's lone victory over Ithaca in 14 all-time meetings came four years ago, a 20-15 win at Gaetano Stadium in the middle of the Bombers' worst season in more than 40 years. Ithaca finished 4-6 in 2011, its first losing season since the 1969 team posted the second of back-to-back 3-5 campaigns. The Bombers are 25-11 in the last three-plus seasons, with two Empire 8 titles and two trips to the NCAA Division III tournament. \nThe Pioneers are coached by Blaise Faggiano, a 1993 Ithaca graduate and starting noseguard on the Bombers' 1991 national-championship squad. Faggiano led Utica to a 7-4 record last season, the best in the program's 15-year history, and its first postseason appearance. Utica lost to the Empire 8's Morrisville State, 52-41, in the ECAC North Central Bowl. \nIthaca stays on the road next weekend, traveling to Oneonta for a 2 p.m. clash with Hartwick (2-1, 0-1 E8) before playing three of its final games at Butterfield Stadium, including the season-ending \"Cortaca\" Jug clash with SUNY Cortland on Nov. 21. Read or Share this story: http://ithacajr.nl/1L9cLRd TOP VIDEOS", "external_links": [], "published": "2015-10-02T23:29:00.000+03:00", "crawled": "2015-10-03T00:48:25.472+03:00", "highlightTitle": ""}