{"organizations": [], "uuid": "c330963964b38f993e5e71dbd8ba900bd1800cbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/200/200.jpg", "site_section": "http://www.deseretnews.com/sports/index.rss", "section_title": "Sports news and headlines for the Utah Jazz, BYU Cougars, Utah Utes and high schools, Salt Lake City sports, Utah sports  - Deseret News", "url": "http://www.deseretnews.com/article/765680984/How-to-watch-attend-or-listen-to-the-Utah-State-Boise-State-game.html?pg=all", "country": "US", "title": "How to watch, attend or listen to the Utah State-Boise State game", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "How to watch, attend or listen to the Utah State-Boise State game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:50:00.000+03:00", "replies_count": 0, "uuid": "c330963964b38f993e5e71dbd8ba900bd1800cbc"}, "author": "", "url": "http://www.deseretnews.com/article/765680984/How-to-watch-attend-or-listen-to-the-Utah-State-Boise-State-game.html?pg=all", "ord_in_thread": 0, "title": "How to watch, attend or listen to the Utah State-Boise State game", "locations": ["Maverik Stadium", "Utah"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Macey"], "text": "Pregame activities: Macey's Fan Fest, which begins at 4:30 p.m., and is located west of Maverik Stadium on 800 East. Live music will be provided by Mile Marker 6, presented by Edge Rock and Moto Clothing. What’s at stake \nBoise State navigated the most difficult part of its schedule with only one loss. Now there's only Mountain West opponents left and the Broncos should be significant favorites in all of them as they strive for aanother major bowl bid. The Aggies are likely the toughest obstacle left for the Broncos. Key matchup \nThe Boise State offense has been rolling of late with freshman QB Brett Rypien at the helm. The Broncos rank No. 10 in the country in scoring offense (40.7 points per game) and have scored at least 52 points in three of their last four games. Utah State counters with the No. 2 scoring defense in the conference that hasn't allowed more than 18 points to any non-Power Five teams. LB Fackrell leads the team with three sacks. Players to watch \nBoise State: S Darian Thompson. The senior picked off a pass for the third straight game last week and is now tied with Eric Weddle for the Mountain West career record 18 interceptions. Thompson and teammate Donte Deayon are tied for sixth in the nation with four interceptions. \nUtah State: QB Kent Meyers. The sophomore has stepped in for oft-injured starter Chuckie Keeton and led the Aggies to two wins in two starts. He was named Mountain West offensive player of the week after rushing for 191 yards and a touchdown on 16 carries against Colorado State. Meyers relied on his arm last week and threw for a career-high 260 yards and a touchdown. Facts & figures \nUtah State QB Chuckie Keeton is out four to six weeks with a knee injury. ... Meyers is 7-1 as a starter. ... The Aggies have won 20 of its last 22 home games. ... Boise State ranks No 2 nationally in run defense, allowing 60.7 rushing yards per game. ... The Broncos have outscored opponents 204-24 during their current four-game win streak. ... Boise State has won 12 straight against Utah State. Next up \nSan Diego State hosts Utah State next Friday. Utah State schedule \nSept. 3 — Utah State 12, Southern Utah 9 \nSept. 11 — Utah 24, Utah State 14 \nSept. 19 — Washington 31, Utah State 17 \nOct. 3 — Utah State 33, Colorado State 18 \nOct. 10 — Utah State 56, Fresno State 14 \nOct. 16 — BOISE STATE, 7 p.m. \nOct. 23 — at San Diego State, 8:30 p.m. \nOct. 30 — WYOMING, 8:15 p.m. \nNov. 7 — at New Mexico, 1:30 \nNov. 14 — at Air Force, TBA \nNov. 21 — NEVADA, TBA \nNov. 28 — BYU, 1:30 p.m. \nAll times Mountain", "external_links": [], "published": "2015-10-16T02:50:00.000+03:00", "crawled": "2015-10-16T08:18:08.396+03:00", "highlightTitle": ""}