{"organizations": ["AP College", "Huskers"], "uuid": "761ed758606e7a3e4adffbd2790b1886b480bd8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/18275d62088e4988985124776c74505f/FBC--Nebraska/", "country": "US", "title": "Nebraska loses 23-21 to Wisconsin on FG with 4 seconds left", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Nebraska loses 23-21 to Wisconsin on FG with 4 seconds left", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T04:02:00.000+03:00", "replies_count": 0, "uuid": "761ed758606e7a3e4adffbd2790b1886b480bd8f"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/18275d62088e4988985124776c74505f/FBC--Nebraska/", "ord_in_thread": 0, "title": "Nebraska loses 23-21 to Wisconsin on FG with 4 seconds left", "locations": ["Wisconsin", "Nebraska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ERIC OLSON"], "text": "Wisconsin's late FG sends Nebraska to 23-21 loss, Huskers' 4th of season on foe's last play By ERIC OLSON AP College Football Writer   9:01   9:02   \nPeople: \n\nLINCOLN, Nebraska — Once again, Nebraska seemed to have a game won. And then it didn't. \nThis time Rafael Gaglianone sent the Cornhuskers to another crushing defeat, making a 46-yard field goal with four seconds left to give Wisconsin a 23-21 victory on Saturday. \nGaglianone made the winning kick just over a minute after he missed from 39 yards, and now the Huskers have lost four games by a total of 11 points. All four losses came on the opponent's final offensive play. \n\"I'd have to look back a ways, but I don't think I've really seen this before,\" first-year Nebraska coach Mike Riley said. \"But we are in it. When you have games like we've had, you'll look at many different circumstances on how playing or coaching you could make a difference.\" \nThe Huskers (2-4, 0-2 Big Ten) had taken the lead with 3:38 to play, but for the second straight week they failed to put away their opponent. Last week they squandered a 13-0 fourth-quarter lead, losing 14-13 to Illinois after the Illini drove for the go-ahead touchdown in the last minute. \n\"We said from day one that you've got to expect the unexpected, and we really didn't think that we would have a season like this,\" quarterback Tommy Armstrong Jr. said. \"It's heartbreaking to look at it this way. We have to stick together and drive on to next week.\" \nFullback Andy Janovich broke a 55-yard touchdown run to put Nebraska up 21-20. After the Badgers drove from their 9 to the Nebraska 21, Gaglianone's field-goal try hit the right upright and bounced away. \n\"That was devastating, not just for me missing that opportunity but just knowing how hard my teammates have worked putting that drive together,\" Gaglianone said. \"Me missing just felt like I really let my teammates down. It was just crazy. They were just like, 'We've still got a chance, don't give up.' \" \nThe Huskers got the ball with 1:26 left, and they ran three straight times. Riley said he never considered passing, wanting to force the Badgers to use all three of their timeouts. \nWisconsin (4-2, 1-1) started its last drive at its 30 with 1:03 left, and Joel Stave completed three passes for 42 yards to set up Gaglianone for another attempt. \n\"Going to back to that same spot, I thought I'm going to swing a little different, a little more to the left. It worked out great,\" Gaglianone said. \nStave said he had a feeling Gaglianone, who was 3 for 5 on field goals against the Huskers, would come through. \n\"It's like a golfer; they hit their putt once and if they miss it, they're going to make it the second time,\" Stave said. \"They've got the line, they've got the read.\" \nIt was the first time Wisconsin made a game-winning kick in the final minute of regulation since Matt Davenport's 48-yarder with six seconds left beat Northwestern 26-25 in 1997. \nDare Ogunbowale rushed for 117 yards, most coming after starting Wisconsin running back Taiwan Deal went out with an injury to his left ankle in the first quarter. Stave was 25 of 50 for 322 yards and a touchdown in only the fourth game in program history that the Badgers attempted 50 or more passes. \nThe Badgers played a turnover-free game a week after Stave committed four in a 10-6 loss to Iowa. \nArmstrong completed 11 of 28 passes for 129 yards and a TD and ran eight times for 50 for the Huskers, who are off to their worst start since 1959. Janovich and Terrell Newby each rushed for 59 yards. \nAP college football website: collegefootball.ap.org \n ", "external_links": [], "published": "2015-10-11T04:02:00.000+03:00", "crawled": "2015-10-11T04:23:37.035+03:00", "highlightTitle": ""}