{"organizations": [], "uuid": "fb0a410128876b905933d531cec5c81fa93aa0fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports", "section_title": "Sports News, Scores, Schedules, Standings, Stats, Photos, Videos - MSN Sports", "url": "http://www.msn.com/en-us/sports/nfl/report-andrew-luck-may-be-dealing-with-rib-injury/ar-AAfwFzF", "country": "US", "title": "Report: Andrew Luck may be dealing with rib injury", "performance_score": 0, "site": "msn.com", "participants_count": 14, "title_full": "Report: Andrew Luck may be dealing with rib injury", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 14, "uuid": "fb0a410128876b905933d531cec5c81fa93aa0fc"}, "author": "Steve DelVecchio", "url": "http://www.msn.com/en-us/sports/nfl/report-andrew-luck-may-be-dealing-with-rib-injury/ar-AAfwFzF", "ord_in_thread": 0, "title": "Report: Andrew Luck may be dealing with rib injury", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report: Andrew Luck may be dealing with rib injury Larry Brown Sports 6 hrs ago Steve DelVecchio © Brian Spurlock/USA TODAY Sports Andrew Luck has been dealing with a shoulder injury for the past few weeks, but he might also have a rib injury he is keeping quiet about. Andrew Luck has missed his team’s last two games with a sore throwing shoulder, but that may not be the only injury that has kept the Indianapolis Colts signal caller off the field.\nAdChoices ESPN’s Tim Hasselbeck, who happens to be the brother of Colts backup quarterback Matt Hasselbeck, believes that Luck has been dealing with a rib injury in addition to shoulder pain.\n“I think it will probably come out that Andrew’s been dealing with some ribs before the Tennessee game, when my brother patted him on the chest during that game,” Tim Hasselbeck said this week, according to Ben Volin of The Boston Globe . “We don’t necessarily have all the information of what he’s playing with. There are a lot of players playing through stuff that people generally aren’t aware of, and it prevents guys from playing their best.”\nSince Tim’s brother is teammates with Luck, it would stand to reason that he would know more about Luck’s injury situation than the average person.\nLuck took a few big shots in a 35-33 win over the Tennessee Titans in Week 3. While the Colts have not said anything about his ribs, some onlookers noticed that he was favoring his midsection during that game.\nLuck has been practicing on a limited basis and will almost certainly start against the New England Patriots Sunday night. We have gathered some information about what is going on with his shoulder , but perhaps the Colts would rather keep the rip injury quiet so opponents don’t target that area.\nWhile Matt Hasselbeck did an admirable job filling in for Luck when you consider the frightening trip he had to take to the emergency room , the Colts need Luck if they want to have a chance to beat New England. Can he get it done at less than 100 percent health? It sounds like we are going to find out.\nAndrew Luck Career Passing Accuracy | PointAfter\nGo to MSN Home", "external_links": ["http://www.yardbarker.com/", "http://www.bostonglobe.com/sports/2015/10/15/colts-andrew-luck-off-slow-start/j9bA8S8MshiMDFt0MUFOHI/story.html", "http://larrybrownsports.com/football/andrew-luck-partial-separation-shoulder/276720", "https://w.graphiq.com/w/gMI1L8mf3c9", "http://larrybrownsports.com/football/matt-hasselbeck-emergency-room-illness/277149", "http://football-players.pointafter.com/l/12698/Andrew-Luck", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T01:03:08.837+03:00", "highlightTitle": ""}