{"organizations": ["K-State"], "uuid": "213d13bddf76586743ac81033cd4f93ff0cc1a60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "themercury.com", "main_image": "", "site_section": "http://themercury.com/feeds/kstate-sports", "section_title": "The Manhattan Mercury - K-State Sports", "url": "http://themercury.com/articles/k-state-men-finish-second-in-louisiana", "country": "US", "title": "K-State men finish second in Louisiana", "performance_score": 0, "site": "themercury.com", "participants_count": 0, "title_full": "K-State men finish second in Louisiana", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:13:00.000+03:00", "replies_count": 0, "uuid": "213d13bddf76586743ac81033cd4f93ff0cc1a60"}, "author": "", "url": "http://themercury.com/articles/k-state-men-finish-second-in-louisiana", "ord_in_thread": 0, "title": "K-State men finish second in Louisiana", "locations": ["Louisiana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "K-State men finish second in Louisiana By The Mercury October 12, 2015 \nBATON ROUGE, La. — The Kansas State men’s golf team carded a 4-over-par 292 during Sunday’s final round to claim second place — the Wildcats’ best team finish of the fall season — with a three-round total 16-over 880 at the David Toms Intercollegiate at the par-72, 7,234-yard University Club. \nThe Wildcats, who had two players in the top-five, tied for best placing under second-year head coach Grant Robbins. \n“Overall, it was a good finish for us,” Robbins said. “We got off to a great start and got within five shots of the lead at one point, but we made too many mental errors down the stretch that cost us. We have to do a much better job of finishing off rounds, but experience is sometimes the best teacher. Hopefully we can learn from this and continue to get better.” \nK-State was led by Jeremy Gandon. A freshman from Charpy, France, Gandon tied for second place at 3-under-par 213 after firing a 3-under 69 in the final round to jump three spots up the leaderboard. It was his second-straight top-two finish, as he tied for first at the Golfweek Conference Challenge two weeks ago. His final-round total marked the third time in just nine collegiate rounds he carded a sub-70 round. \nMatt Green recorded his sixth-career top-five finish by tying for fifth at 1-over-par 217. He recorded a final-round score of even-par 72 to improve three spots on the leaderboard. \nRounding out the K-State lineup, Oscar Spolander tied for 16th with a three-day total 8-over-par 224, while Kyle Weldon and Connor Knabe tied for 39th at 15-over-par 231. Weldon and Knabe each notched five birdies in the final round, bringing Weldon to a final round score of 2-over-par 74 and Knabe to a 5-over-par 77. \n“I really like the progress we are making and do not think we have scratched the surface of how good we can be,” Robbins said. \n“We have to continue to work hard and keep striving to improve.” \nHost school LSU claimed the team victory after carding a 2-under-par 286 in the final round to total an even-par 864. \nLSU’s Eric Ricard went wire-to-wire to claim the individual crown at 10-under-par 206. \nK-State’s Hank Simpson, Roland Massimino, and Andrew Beckler are competing as individuals in the Bill Ross Intercollegiate today and Tuesday at Milburn Country Club in Overland Park. \nThe next team action for the Wildcats will be the fall finale, Oct. 25-26, at the Bridgestone Golf Collegiate in Greensboro, N.C.", "external_links": [], "published": "2015-10-12T20:13:00.000+03:00", "crawled": "2015-10-12T23:02:19.712+03:00", "highlightTitle": ""}