{"organizations": ["Week Parkview", "Vikings", "Parkview High"], "uuid": "a854a2771d590086dafbb18fb06b4039ef7045d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ozarkssportszone.com", "main_image": "http://imgsrv.ozarkssportszone.com/image/DbGraphic/201510/3182751.jpg", "site_section": "http://www.kspr.com/sports/21051914_21051920?format=rss_2.0&view=feed", "section_title": "Sports Top Stories", "url": "http://www.ozarkssportszone.com/pages/22095808.php", "country": "US", "title": "Athlete of the Week Parkview's Anthony Riley", "performance_score": 0, "site": "ozarkssportszone.com", "participants_count": 0, "title_full": "Athlete of the Week Parkview's Anthony Riley", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:03:00.000+03:00", "replies_count": 0, "uuid": "a854a2771d590086dafbb18fb06b4039ef7045d2"}, "author": "", "url": "http://www.ozarkssportszone.com/pages/22095808.php", "ord_in_thread": 0, "title": "Athlete of the Week Parkview's Anthony Riley", "locations": ["SPRINGFIELD", "Mo.", "Parkview"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hays", "Riley", "Anthony Hays", "Anthony", "Anthony Riley", "Anthony Riley Jonathan Huskey"], "text": "Posted : Wednesday, 21 October 2015 10:59PM Athlete of the Week Parkview's Anthony Riley Jonathan Huskey Reporting SPRINGFIELD, Mo. -- Trying to get Anthony Riley to talk about himself is much like trying to tackle him in the open field. That is, it’s hard to do. Try to get the Parkview senior to open up about the record-setting 2015 he’s having, and he immediately deflects any praise.“The O-line’s been improving throughout the year, ever since the summertime,” he said. “We’re really starting to get things going and get into our prime.” Before being told of that exchange, head coach Anthony Hays offers a confirmation.“He’s the first person to tell you about his O-line and how they’re the reason he has success,” Hays said. Whether he wants to talk about it or not, Riley is re-writing the record books at Parkview High. He has 1,699 yards and 22 touchdowns through nine games this year—both numbers eclipsing his 2014 total, which he got in 12 games.“We’ve been putting a lot of work in practice,” Riley said. “We’ve been having probably the best practices we’ve had all year, this time of year.” After a struggle at the beginning of the year, the Vikings have come back to clinch the no. 2 seed in Class 5 District 5, and will host Ozark in the first round on Friday.“Really proud of our kids for being resilient after a slow start to earn home-field advantage in the playoffs,” Hays said. “Hopefully we can get a little win streak going.” Riley and the ground game is a big part of that success, but Hays says, you’d never know it from talking to him.“Sometimes when you have a kid with that much talent, they like to tell you that they’re that talented,” he said. “Anthony is a team-first guy. When you got a guy who’s got the biggest stats on the whole team who’s living that out, that helps a ton.” Riley does admit he has one goal most may not realize.“I try to be uncommon,” he said. “That’s kind of the thing I always tell myself, is try to be uncommon.” As for Hays, he’s got a more light-hearted take on the life of Anthony Riley.“Well, I can tell you he’s constantly hungry,” he said. “He’s always snacking on something. The kid is ripped to shreds, but I don’t know how he doesn’t weight 300 pounds, as much as he’s snacking on something.” Anthony Riley—snacking and all—is the Ozone Athlete of the Week. Filed Under :", "external_links": [], "published": "2015-10-22T07:03:00.000+03:00", "crawled": "2015-10-22T07:39:50.514+03:00", "highlightTitle": ""}