{"organizations": [], "uuid": "bfffc201cd66fd8e4f2f542909a18736da9d2fcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13536/technology-news", "section_title": "Technology &amp; Science News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30277329/ugandas-government-denies-maliciously-spying-on-opponents", "country": "US", "title": "Uganda's government denies maliciously spying on opponents", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Uganda's government denies maliciously spying on opponents - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "bfffc201cd66fd8e4f2f542909a18736da9d2fcd"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30277329/ugandas-government-denies-maliciously-spying-on-opponents", "ord_in_thread": 0, "title": "Uganda's government denies maliciously spying on opponents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By RODNEY MUHUMUZA\nAssociated Press KAMPALA, Uganda (AP) - The Ugandan government on Friday denied the existence of a secret program to use computer spyware on its opponents, saying the report by a London-based advocacy group is based on a fake document.\nThe purportedly classified document cited by Privacy International isn't an authentic government document, Col. Shaban Bantariza, a government spokesman, told reporters.\n\"It is an assumed government report,\" he said, referring to the document detailing the allegedly secret espionage program to hack and blackmail perceived opponents. \"We do not surveille political activists.\"\nBut Francis Mwijukye, an aide to opposition leader Kizza Besigye, said the report proves it is \"time for Ugandans to say enough is enough\" with the government of long-time President Yoweri Museveni. Besigye, a four-time presidential candidate, was put under house arrest Thursday in his home near Kampala by policemen who said he planned to hold illegal rallies.\nBantariza warned that \"the government and the state certainly have the means, which include equipment, to monitor those who would like to endanger Ugandan security.\"\nMaria Burnett, who researches Uganda for Human Rights Watch, said: \"We have real concerns that basic rights such as expression, assembly and privacy are violated by the use of these types of technologies.\"\nPrivacy International said FinFisher spyware was deployed against Museveni's opponents during street protests that followed elections in 2011. The Ugandan government \"used surveillance tools explicitly to be one step ahead of their opponents,\" the group said. \"It is seeking out more capabilities to hack computers and devices, and aims to build a national monitoring center capable of sweeping up large amounts of Ugandans' communications data.\"\nThe group published what it said was a leaked Ugandan presidential briefing which said \"hordes of data\" had been gathered by the spyware.\n ", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-20T17:47:16.110+03:00", "highlightTitle": ""}