{"organizations": [], "uuid": "bbcf18c4e638e44c8eb8c19a3307edc71446204f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://images.worldnow.com/AP/images/8885803_G.jpg", "site_section": "http://www.wcax.com/category/13530/national-news", "section_title": "National News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30121234/boehner-to-leave-as-congress-confronts-intractable-issues", "country": "US", "title": "Boehner to leave as Congress confronts intractable issues", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Boehner to leave as Congress confronts intractable issues - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "bbcf18c4e638e44c8eb8c19a3307edc71446204f"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30121234/boehner-to-leave-as-congress-confronts-intractable-issues", "ord_in_thread": 0, "title": "Boehner to leave as Congress confronts intractable issues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By STEPHEN OHLEMACHER\nAssociated Press WASHINGTON (AP) - House Speaker John Boehner says he had planned to resign at the end of last year but stayed on because he feared a leadership shakeup would create too much turmoil for House Republicans.\nNow he's stepping down at the end of October, when Congress could once again be scrambling to avert a looming government shutdown, the loss of federal funding for thousands of highway projects and an unprecedented government default.\nTalk about turmoil.\nBoehner announced his resignation Friday amid growing discontent among some of the most conservative members of the House Republican conference.\nSome tea partyers were pushing for a vote to oust Boehner as speaker, a formal challenge that hasn't happened in more than 100 years. They complained that Boehner wasn't fighting hard enough to strip Planned Parenthood of government funds, even though doing so risked a government shutdown next week.\n\"Listen, it was never about the vote, all right?\" Boehner told reporters. \"There was never any doubt about whether I could survive the vote.\"\nBut, he added, \"I don't want my members to have to go through this. I certainly don't want the institution to go through this.\"\nBesides, Boehner said, his new plan was to leave at the end of this year. Boehner said he had planned to announce it on his 66th birthday, Nov. 17.\n\"If I wasn't planning on leaving here soon, I can tell you I would not have done this,\" he said.\nBoehner said he came to his decision Friday morning, a day after a historic visit to the Capitol by Pope Francis at his invitation. Boehner, a Catholic, said he woke up, said his prayers and decided \"today's the day I'm going to do this.\"\nHe relayed a private moment when the pope put his arm around Boehner and asked the speaker to pray for him.\n\"Who am I to pray for the pope?\" Boehner said. \"But I did.\"\nBoehner said he told House Majority Leader Kevin McCarthy, the No. 2 House Republican, about two minutes before he addressed a closed-door meeting of House Republicans Friday morning.\n\"I had to tell him five times because he didn't believe me,\" Boehner said.\nIt is uncertain who will succeed Boehner, but McCarthy, a genial Californian who was first elected to Congress in 2006, is the most obvious candidate.\nWhile insisting the decision is up to fellow Republicans, Boehner declared that \"Kevin McCarthy would make an excellent speaker.\"\nAfter Boehner's announcement, McCarthy rushed past reporters and TV cameras, refusing to say anything.\nLater, he issued a statement that said now is the time for House Republicans \"to focus on healing and unifying to face the challenges ahead.\"\nRep. Mick Mulvaney, R-S.C., said he and other conservatives would support \"anybody who is willing to work to re-establish Congress as a co-equal branch of government.\"\n\"If that's Kevin McCarthy, great. If it's somebody else, great,\" Mulvaney added. \"But I think one of the reasons you saw the pressure on John to leave is that John had allowed Congress to become irrelevant.\"\nMulvaney conceded that tea party Republicans don't have enough votes to elect one of their own as speaker.\n\"I do think, however, we have a bloc of 40 votes that will stick together and make sure that whoever is elected to whatever leadership positions are open will understand why we feel what we feel,\" Mulvaney said.\nPresident Barack Obama, Boehner's frequent antagonist and occasional partner, called the speaker \"a good man\" and a patriot.\n\"And I think, maybe most importantly, he's somebody who understands that in government and governance, you don't get 100 percent of what you want,\" the president said. \"But you have to work with people who you disagree with, and sometimes strongly, in order to do the people's business.\"\nBoehner was first elected to the House in 1990 and was part of former Speaker Newt Gingrich's leadership team when Republicans took over the House in 1995.\nBoehner took over the speakership in January 2011. His tenure has been defined by his early struggles to reach budget agreements with Obama and his wrestling with the expectations of tea party conservatives who abhorred his tendencies toward deal-making.\nWith his unnatural-looking tan, relaxed and sociable demeanor, love of golf and well-known tendency to cry in public, Boehner was widely popular among House Republicans.\nThough he is also known as a strong conservative, his tactics were never confrontational enough to satisfy the most conservative faction in the House.\n\"We need bold leadership, and this gives us a chance to get it,\" said Rep. Louie Gohmert, R-Texas.\nBoehner's work is not yet done.\nUnless Congress acts, the federal government faces a partial shutdown on Thursday. The Senate is scheduled to hold a procedural vote Monday on a bill to fund the government - including money for Planned Parenthood - into December.\nBoehner also announced plans to schedule a vote on a government funding bill that includes money for Planned Parenthood before Wednesday's midnight deadline. It's likely to pass with Democratic support, setting up another funding fight in just a few months.\nAlso on the agenda, Congress has until Oct. 29 to renew federal highway programs, and the government's ability to pay its bills expires around Oct. 30. That means Congress will have to extend the government's borrowing authority or face a first-ever federal default.\n\"I'm not going to sit around here and do nothing for the next 30 days,\" Boehner said. \"There's a lot of work that needs to be done. I plan on getting it as much of it done as I can before I exit.\"\n___\nAssociated Press writers Erica Werner, Alan Fram, Andrew Taylor and Steve Peoples contributed to this report.\n___\nFollow Stephen Ohlemacher on Twitter: http://twitter.com/stephenatap\n ", "external_links": ["http://twitter.com/stephenatap"], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-10-02T23:07:38.560+03:00", "highlightTitle": ""}