{"organizations": [], "uuid": "14c54e3ca208d5e6d84761a75af63aeffe6d2cc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/10/101015bruinsjw06.jpg", "site_section": "http://bostonherald.com/sports/bruins_nhl", "section_title": "Sports: Bruins &amp; NHL | Boston Herald", "url": "http://bostonherald.com/sports/bruins_nhl/boston_bruins/2015/10/buckley_julien_cant_escape_hot_seat", "country": "US", "title": "Buckley: Julien can't escape hot seat", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Buckley: Julien can't escape hot seat | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "14c54e3ca208d5e6d84761a75af63aeffe6d2cc6"}, "author": "Steve Buckley", "url": "http://bostonherald.com/sports/bruins_nhl/boston_bruins/2015/10/buckley_julien_cant_escape_hot_seat", "ord_in_thread": 0, "title": "Buckley: Julien can't escape hot seat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just to be clear, I am not telling you Bruins president Cam Neely recently was seen grabbing media people by their throats and screaming, “Listen, don’t you dare say that Claude Julien is on some freakin’ hot seat, ’cuz if you do, I’m going to rip your . . .”\nNo, that’s not what happened at all.\nIt just seems that way.\nThis all goes back to last week during a day-before-Opening-Night press conference in which members of the Spoked B Politburo — Neely, chairman Jeremy Jacobs, CEO Charlie Jacobs, general manager Don Sweeney and Julien — spoke about the upcoming season.\nAnd about Coach Claude.\n“People have mentioned that Claude could be on the hot seat, and I think it’s unfair to say that,” Neely said. “Claude’s a very good coach in this league. Donnie (Sweeney) came to us with a plan of how he’d like to see the team play. He’s had many conversations with Claude about that, but a lot of things happen throughout the course of the year that’s not necessarily just on the coach.\n“I know why certain things are said at times, but it’s really unfair to start the season where it’s out there that the coach could be on the hot seat. I think it’s unfair to Claude.”\nIt appears you can ask Neely about anything — Chase Utley barreling into Ruben Tejada, Donald Trump’s upcoming appearance on “Saturday Night Live,” or Emerson College’s lame, stupid, colossally insensitive plan to destroy the Colonial Theater — and the guy will move the conversation right back to how Julien is, you know, not on the hot seat.\nYet here we are, kids: The Bruins are three games into the new season and are 0-3, getting outscored 16-7.\nAnd changes already are being made. Defenseman Matt Irwin, a 27-year-old former San Jose Shark in his first season with the Bruins, was dispatched after just two games. Irwin, better than anyone, can tell you that offense in the NHL can be a beautiful thing. During those two games he played with the Bruins, he was on the ice for five opposing goals.\nFollowing their 6-3 loss to the Tampa Bay Lightning on Monday afternoon at the Garden, the Bruins were either booed off the ice or the crowd was offering up a spirited endorsement of L u Merloni to replace the NESN-bound Dave O’Brien in the Red Sox radio booth. I suspect it’s the former, which means Bruins fans already are growing impatient with the “growing pains” theme that was all the rage during training camp.\nIt’d be unfair to blame it all on Julien, since he’s being asked by the new guy in charge (Sweeney, who was given the job following Peter Chiarelli’s release and the traditional nationwide search) to play a new brand of hockey (scoring goals is fun!) with a lot of new players.\nBut there are only so many Matt Irwins you can shuttle down to Providence, which is why people eventually are going to wonder if Julien is going to get the ax. Heck, the whispers are starting to sneak into talk shows, even if Neely is preaching its unfairness.\nIf history taught us anything, this business of telling you what to think actually is one of the Bruins’ nagging organizational habits. And Julien himself is one of its chief practitioners. Back in December 2011, he benched Tyler Sequin after the Bruins’ life of the party slept through a mandatory team breakfast in Winnipeg. And then, a couple days later, when the Bruins were back in Boston, the coach was asked about it.\n“Old news,” he said.\nFollowing a loss to the Canadiens in January, Julien returned to his I’ll-decide-what’s-news ways when he said, “I don’t think I have to explain myself why I pull a goalie,” this answer in response to a question about yanking Tuukka Rask.\nA simple, “Yeah, go look up Tuukka’s numbers against the Canadiens,” would have sufficed. (Counting last Saturday’s 4-2 loss, Rask is 3-14 lifetime against the Habs. But we digress.)\nThe New York Times has “All the news that’s fit to print.” The Bruins have “We’ll tell you what’s news and when to print it.”\nBut you know what?\nHere’s hoping Coach Claude holds onto his job, if only because he still presents himself as a rock at a time when so much about this franchise seems unstable. One thing for concern, though: If the Bruins keep losing, there’s always a chance the boys will tune out their coach, and that would mean Julien would be Outsville with the Spoked B Politburo.\nSo keep an eye on this, even if Cam tells you not to.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T07:18:29.688+03:00", "highlightTitle": ""}