{"organizations": [], "uuid": "1cf4aaea5d9ff392e17551fb1674d24ac5cd81e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/10/16/1017-licking-valley01.jpg.JPG", "site_section": "http://dispatch.com//content/syndication/sports_highschools.xml", "section_title": "The Columbus Dispatch High School Sports Feed", "url": "http://www.dispatch.com/content/stories/sports/2015/10/17/hsfb-johnstown-licking-valley.html", "country": "US", "title": "High-school football | Johnstown overpowers Licking Valley 24-7", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "High-school football | Johnstown overpowers Licking Valley 24-7 | The Columbus Dispatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T02:57:00.000+03:00", "replies_count": 0, "uuid": "1cf4aaea5d9ff392e17551fb1674d24ac5cd81e7"}, "author": "THISWEEK NEWSPAPERS", "url": "http://www.dispatch.com/content/stories/sports/2015/10/17/hsfb-johnstown-licking-valley.html", "ord_in_thread": 0, "title": "High-school football | Johnstown overpowers Licking Valley 24-7", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HANOVER, Ohio — Richie Carey said the best is yet to come for Johnstown.\nCarey had two interceptions as the Johnnies shut down a powerful Licking Valley offense in a 24-7 victory Friday night in a game matching the division leaders of the Licking County League.\nJohnstown (8-0) shut down Licking Valley (5-3), which had outscored opponents 128-7 in its past three games.\n“Man, we have been pushing ourselves,” said Carey, a senior defensive back who has four interceptions. “We have a higher level that we can reach. We keep getting better and better each week.”\nThe Johnnies scored 21 points in the second quarter to break open a stalemate. Cody Workman hit Kyle Carpenter for a 48-yard touchdown pass with 11:02 left in the first half to start the scoring. Workman was only 9-of-23 passing for 139 yards with one touchdown and two interceptions after seven games.\n“We played great on defense and we did what we needed to do on offense,” Johnstown coach Mike Carter said. “It was a true team effort.”\nThe Johnnies limited the Panthers to 106 total yards, including 26 rushing.\n“That’s about as big of a football team as we have played, and they were aggressive,” Licking Valley coach Randy Baughman said. “I don’t know where they keep getting them, but they keep ’em coming.”\nJohnstown defensive end Brandon Siegfried had four sacks. At 6 feet 4 and 195 pounds, the junior had the quickness to shoot the gaps and harass Licking Valley quarterback Jake Lewis.\n“We knew coming in that they had some good tackles,” Siegfried said. “We thought we could use our speed to get past them and that seemed to work for us.”\nThe Panthers found most of their success in the air. Lewis completed 11 of 21 passes for 80 yards and two interceptions. The sophomore scored his team’s lone touchdown with a 6-yard run with 7:57 left in the fourth.\n“We couldn’t get any rhythm going offensively,” Baughman said. “They did a great job of putting our offense in long-yardage situations. They were really aggressive but they didn’t do anything that we didn’t expect. They just did it well.”\nJustin Franklin rushed for 126 yards to lead the Johnnies on 20 carries and had a 1-yard touchdown. Workman added 50 rushing yards and a 14-yard score on 18 attempts. The quarterback was 3-of-4 passing for 76 yards with one touchdown and one interception.\n“We needed to come out and play four quarters of football and we did that,” Carter said. “It was a team effort, especially on defense.”\nJohnstown’s defense has allowed only 14 points in its past three games while scoring 83.\n“We feel confident that we can match up with anyone,” Siegfried said. “We feel like we keep getting better each game and we want to continue that.”\nElijah Brechbill had one interception for the Panthers.\n“They took us out of a lot of the things we wanted to do,” Baughman said. “Our kids kept battling through to the end, but that was a good football team.”\nshennen@thisweeknews.com", "external_links": [], "published": "2015-10-17T02:57:00.000+03:00", "crawled": "2015-10-17T08:18:54.128+03:00", "highlightTitle": ""}