{"organizations": [], "uuid": "15ba6b72a187ab9caf8939b941d18244d1bcea8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sltrib.com", "main_image": "http://www.sltrib.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=7x3zqF6YNez$3$N8Q261Ds$daE2N3K4ZzOUsqbU5sYvK9ArUaKRCQbPney1m$wU7WCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://sltrib.com//csp/cms/sites/sltrib/RSS/rss.csp?cat=Sports", "section_title": "Sports - The Salt Lake Tribune", "url": "http://www.sltrib.com/sports/3019503-155/byu-football-receivers-got-redemption-in", "country": "US", "title": "BYU football: Receivers got redemption in 30-13 win over UConn", "performance_score": 0, "site": "sltrib.com", "participants_count": 3, "title_full": "BYU football: Receivers got redemption in 30-13 win over UConn | The Salt Lake Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 2, "uuid": "e8efa71ad7433a717bb207a137852749e8dd8f79"}, "author": "JAY DREW", "url": "http://www.sltrib.com/sports/3019503-155/byu-football-receivers-got-redemption-in#post-0", "ord_in_thread": 0, "title": "BYU football: Receivers got redemption in 30-13 win over UConn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Provo • BYU's receivers were called out by offensive coordinator Robert Anae and receivers coach Guy Holliday after their abysmal performance against Michigan a week ago, with Holliday saying that \"you can't be 6-foot-6 and play 5-11.\"\nThe wideouts answered that criticism in resplendent fashion in Friday's 30-13 win over UConn, helping freshman quarterback Tanner Mangum throw for 365 yards and two touchdowns.\n\"It was definitely [redemption],\" said senior inside receiver Terenn Houk, who caught six passes for a career-high 129 yards. \"I feel like we got called out last week against Michigan, and it was hard not to produce anything as a receiving corps, and kind of embarrassing.\"\n  UConn didn't play nearly as much man-press as Michigan did, and clearly didn't have the athletes. BYU receivers ran free all game, and several times Mangum had more than one option to deliver the ball after finding nobody open in the 31-0 loss to the Wolverines.\n\"Obviously, they played a lot better,\" BYU coach Bronco Mendenhall said after five receivers — Houk, Mitch Juergens, Mitch Mathews, Nick Kurtz and Devon Blackmon — combined on 32 catches for 348 yards.\nMathews caught a pair of touchdown passes, but did have one lapse where he didn't fight hard for a ball that was picked off in the end zone by Jhavon Williams. Kurtz and Moroni Lualu-Pututau dropped passes in the end zone that would have been above-average catches.\nBut other than that, Holliday won't have much to complain about on Monday.\n\"Tanner can't throw the ball as well as he did without the receivers catching the ball well,\" Mendenhall said. \"It was a different style of game also, though. We weren't being pressed nearly as much, and there wasn't as much pressure and their defense is very similar to ours. So some of the looks we were really used to seeing … I think [the receivers] played more representative of what they did the first three weeks than last week.\"\nBYU's tight ends still don't have a reception through five games, but the 6-5, 225-pound Houk often lines up in that spot and could be considered a tight end in some situations.\n\"This game was a really big opportunity for us as a receiving corps to really step up and make a statement, and I feel like not only me, but the entire receiving corps did a good job of getting separation, being physical, all those things that we didn't do last week,\" Houk said. \"We really stepped up and did that.\"\nHouk said having Anae and Holliday say more is expected of the receivers — both coaches placed the blame on themselves first — drove the pass-catchers all week in practice.\n\"But when you have coaches do that, it is because they care, and they want to see you do better,\" Houk said. \"It was hard to know that we didn't get the job done. This week, we have done a lot of drills, put in a lot of time on film, and just on the field really working on being physical and getting open against man [defense].\"\nMangum, Houk and running back Algernon Brown, who rushed for 95 yards on 18 carries in his first appearance since the Boise State game, also credited the offensive line for giving Mangum time to throw. He was sacked twice, not a disappointing number since he threw 53 passes.\n\"To start our home stretch with a win is huge,\" Mangum said. \"The crowd was really behind us tonight, which helps. Any time you get a win it builds momentum everywhere, the team, the fans, the coaches. It builds our confidence. That will motivate us to work even harder next week, to come out and be even better next Saturday against East Carolina. It is a good momentum-builder for us, and something we look to build on to come out even better next week.\"\n\ndrew@sltrib.com \nTwitter: @drewjay", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-04T06:50:31.277+03:00", "highlightTitle": ""}