{"organizations": [], "uuid": "777dd9be5a337eb37848dbfbf10233e7944e75b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://media.lehighvalleylive.com/express-times/photo/2015/07/01/18235975-large.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/4654552775209779329/bethlehem-catholic-senior-golfer-nick-maff-gives-commitment-to-monmouth-university/", "country": "IL", "title": "Bethlehem Catholic golfer Nick Maff commits to Monmouth", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "Bethlehem Catholic golfer Nick Maff commits to Monmouth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T19:48:00.000+03:00", "replies_count": 0, "uuid": "777dd9be5a337eb37848dbfbf10233e7944e75b9"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/4654552775209779329/bethlehem-catholic-senior-golfer-nick-maff-gives-commitment-to-monmouth-university/", "ord_in_thread": 0, "title": "Bethlehem Catholic golfer Nick Maff commits to Monmouth", "locations": ["Bethlehem"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Karl Gilbert", "Nick Maff"], "text": "By Karl Gilbert | lehighvalleylive.com contributor on October 01, 2015 6:00 AM \nNick Maff was wearing a new midnight blue and white golf hat last Thursday at the Lehigh Valley Amateur. \nTurns out, Maff was displaying his college choice. \nEarly last week, the 17-year-old Bethlehem Catholic High School senior made a verbal commitment to accept a partial golf scholarship offer from Monmouth University in West Long Branch, New Jersey. \nMaff, the son of Mary Jo and Dave Maff, chose Monmouth for academic and athletic reasons, and for its fine campus facilities. \n\"From a golf standpoint, Monmouth has a strong and still improving program that will challenge me and give me the opportunity to play against great competition,\" said Maff, who has won over 50 junior golf tournaments. \"This was not an easy decision, as I was speaking with and had offers from some great schools; but after I looked at all factors important to me, Monmouth just felt like the right place for me. \n\"The Monmouth campus is one of the nicest campuses I visited,\" Maff continued. \"It is widely recognized as such, and has been listed as one of the nicest campuses in various surveys and reviews. It is just a fantastic place.\" \nRELATED : Bethlehem Catholic's Nick Maff is 2015 lehighvalleylive Boys Golfer of the Year \nMaff, a Bethlehem Township resident, said he plans to study business. \n\"Monmouth offers a variety of specialties in business,\" Maff said. \"I will need to determine if I select a specific track prior to my freshman year or start in a more generic track to start.\" \nDuring his four-year career at Bethlehem Catholic, Maff has won two District 11 titles. \nAs a freshman in 2012, he shot 4-under-par at Shawnee Inn & Golf Resort to win the District 11 title, and tie Steve Bourbon of Emmaus (Class of 1990) for the all-time low winning score in tournament history. During his junior season in 2014, Maff captured his second District 11 crown (AA) at Shawnee, and won the inaugural Eastern Pennsylvania Conference individual title at Woodstone Country Club. \nHe capped off his junior season by being named the 2015 lehighvalleylive Boys Golfer of the Year . \nThis fall, Maff has enjoyed a fine senior season with low rounds of 65 and 66. On Oct. 12, he will seek to become only the second boy to win three District 11 championships. Jeff Billie of Emmaus won three straight from 1963-1965. \nUnderstanding the highly competitive nature of NCAA Division I golf, Maff plans to have a busy practice regimen and play a demanding tournament schedule in an effort to break into the Hawks' starting lineup. \n\"Monmouth has a very strong team,\" said Maff who won the 2015 Lehigh Valley Sportsfest Junior Golf Classic. \"They added four strong players this year and will add potentially one more player besides me next year. I will need to up my game in a variety of areas to compete for a spot given the depth of the existing team. I will be focusing on my overall course management and consistency of iron play.\" \nAnother asset Maff believes the Monmouth golf program has is veteran golf coach Dennis Shea, who gives the program stability. \n\"Coach Shea and I had great interactions from the start,\" Maff said. \"He has been at Monmouth for over 20 years, and has built a very good and stable program. He was very clear about his expectations of his team members when it comes to academics and the golf program. After my last visit where we spent a significant amount of time together, I knew Monmouth was one of my top choices and that I would probably accept if Coach Shea made me an offer. \nMaff credits his success to the support from his family, Bethlehem Golf Club teaching professional Eric Cogorno, Green Pond head pro John Kulhamer, and veteran Golden Hawks golf coach Tim McGorry. \n\"I started working with Eric last year and it has been a great experience,\" Maff said. \"We focus on all aspects of my swing. In addition, we focus on proper preparation, practice, course management and strategy. John Kulhamer has also been a great influence on me. John has been there for me since I was 8 years old. I can’t say enough about John’s support and coaching over the years.\" \n\"Coach McGorry has been a great mentor to me,\" Maff continued. \"We obviously discuss a lot of golf, but most of our discussions are about life in general and how to handle the obstacles you face every day.\"", "external_links": [], "published": "2015-10-01T19:48:00.000+03:00", "crawled": "2015-10-02T01:35:41.515+03:00", "highlightTitle": ""}