{"organizations": ["Kaiserslautern", "Royals", "Lakenheath"], "uuid": "232c3e1c66ae63a5a93f1d28229f75383635a250", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stripes.com", "main_image": "/img/socialmedia/images/placeholder_facebook_small.png", "site_section": "http://feeds.stripes.com/starsandstripes/sports#", "section_title": "Stars and Stripes Sports", "url": "http://www.stripes.com/sports/every-game-will-matter-in-d-i-regular-season-finales-1.374477", "country": "US", "title": "Every game will matter in D-I regular season finales", "performance_score": 0, "site": "stripes.com", "participants_count": 0, "title_full": "Every game will matter in D-I regular season finales", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:02:00.000+03:00", "replies_count": 0, "uuid": "232c3e1c66ae63a5a93f1d28229f75383635a250"}, "author": "", "url": "http://www.stripes.com/sports/every-game-will-matter-in-d-i-regular-season-finales-1.374477", "ord_in_thread": 0, "title": "Every game will matter in D-I regular season finales", "locations": ["Kaiserslautern", "Ramstein", "Stuttgart", "Wiesbaden", "Lakenheath", "Europe", "Vilseck"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lakenheath"], "text": "DODDS Europe 2015 football schedule In DODDS-Europe Division I football, the only thing more fascinating than this weekend’s set of regular-season finales is the slate of playoff games it will set up for next weekend. First, the established facts. Ramstein is in as the No. 1 seed and will host a semifinal game on Oct. 31. Kaiserslautern has been eliminated from postseason contention. The other four teams in the six-team division – Lakenheath, Stuttgart, Vilseck and Wiesbaden – are tied at 2-2. Three will get in, one will not. As it turns out, all three games scheduled for the final weekend of the Division I regular season will have direct impacts on the postseason. That includes Friday’s clash between Stuttgart and host Wiesbaden and Saturday’s matchups of Lakenheath at Kaiserslautern and Vilseck at Ramstein. By Saturday evening, there are circumstances that could leave any one of the four teams out of the postseason. Under other scenarios, any one of the four teams could end up as the No. 2 seed and host a semifinal, just four home-field quarters removed from a title shot. Put simply, each team can secure a playoff spot if it simply wins its own game, regardless of other outcomes. Put much less simply, here are the best and worst case scenarios for each. Lakenheath will host a semifinal as the second seed if it beats Kaiserslautern and Stuttgart beats Wiesbaden, as the Warriors are the only team Lakenheath wouldn’t beat in a tiebreaker based on head-to-head play. But Lakenheath will miss the playoffs entirely if it loses to the Raiders and both Vilseck and Stuttgart win, leaving the Lancers on the wrong side of a head-to-head with Wiesbaden. Stuttgart can nab a home-field semifinal with a win over Wiesbaden and a Lakenheath loss, as the Panthers would win a head-to-head tiebreaker with Vilseck. But a loss to Wiesbaden coupled with a Vilseck win would leave the Panthers out of the playoffs. Vilseck needs both Stuttgart and Lakenheath to lose to have a shot at hosting a semifinal, not to mention a win of its own over the outright No. 1 seed and defending champion Royals. A loss to Ramstein and wins by Wiesbaden and Lakenheath would put Vilseck on the sidelines for the playoffs. Wiesbaden , two years removed from a Division I title and seeking a return to the championship game, won’t get that opportunity if it loses to Stuttgart and Lakenheath defeats Kaiserslautern. The Warriors can be the No. 2 seed to Ramstein’s No. 1, however, if they knock off Stuttgart and Vilseck takes a Saturday loss.", "external_links": [], "published": "2015-10-22T07:02:00.000+03:00", "crawled": "2015-10-22T20:15:21.588+03:00", "highlightTitle": ""}