{"organizations": [], "uuid": "16849de230a52db772358145a7cc99f7932f0e7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13571/political-news", "section_title": "Political News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30249818/eu-applauds-calm-in-guinea-vote-calls-for-transparency", "country": "US", "title": "EU applauds calm in Guinea vote, calls for transparency", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "EU applauds calm in Guinea vote, calls for transparency - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "16849de230a52db772358145a7cc99f7932f0e7b"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30249818/eu-applauds-calm-in-guinea-vote-calls-for-transparency", "ord_in_thread": 0, "title": "EU applauds calm in Guinea vote, calls for transparency", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BOUBACAR DIALLO\nAssociated Press CONAKRY, Guinea (AP) - European Union observers on Tuesday commended voters in Guinea for their enthusiasm and peaceful conduct during a presidential election despite logistical problems, and called for transparency as the electoral commission finalizes the results of the first round.\nEU mission chief Frank Engel called for calm as the National Independent Electoral Commission finishes the vote count.\nMany hope that political violence that killed at least three people in the run-up to the election in this West African nation - and that marred the first democratic election in 2010 - does not resurface.\nWitnesses said demonstrations broke out in two of the capital's suburbs known as opposition strongholds but they were stopped by anti-riot police.\nOpposition candidates said Monday they will not accept the results for Guinea's second democratic presidential election in more than 50 years, citing voting fraud. The government of President Alpha Conde, who is favored to win the election, denied that there was fraud.\nEngel said it was vital that the election commission remain transparent in determining the results of Sunday's election. Provisional results are expected in the next few days.\nMillions of Guineans voted in the second democratic presidential elections since the country's independence from France in 1958.\nThe opposition last week called for the poll to be postponed, but the electoral commission said everything was in order. Some polling stations remained open late, after voting materials arrived late or ran out.\nGuinea has endured decades of corrupt dictatorship. In 2008, after the longtime strongman died, a military coup led to tumultuous rule until the junta's leader agreed to go into exile.\n ", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-16T07:46:14.100+03:00", "highlightTitle": ""}