{"organizations": [], "uuid": "6c39b3d7e59f2b61600b0f351035e721312c18e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thesportseagle.co.za", "main_image": "http://thesportseagle.co.za/wp-content/uploads/South-Africa5.jpg", "site_section": "http://thesportseagle.co.za/feed/", "section_title": "The Sports Eagle", "url": "http://thesportseagle.co.za/proteas-fined/", "country": "ZA", "title": "Proteas Fined", "performance_score": 0, "site": "thesportseagle.co.za", "participants_count": 1, "title_full": "Proteas Fined", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:08:00.000+03:00", "replies_count": 0, "uuid": "6c39b3d7e59f2b61600b0f351035e721312c18e4"}, "author": "@TheSportsEagle", "url": "http://thesportseagle.co.za/proteas-fined/", "ord_in_thread": 0, "title": "Proteas Fined", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "@TheSportsEagle 0 Comment South Africa has been fined for maintaining a slow over-rate during its victory in the opening game of the ODI series against India at Kanpur on Sunday . Chris Broad of the Elite Panel of ICC Match Referees imposed the fine after AB De Villiers’ side was ruled to be two overs short of its target when time allowances were taken into consideration. In accordance with Article 2.5.1 of the ICC Code of Conduct for Players and Players Support Personnel, which relates to minor over-rate offences, players are fined 10 per cent of their match fees for every over their side fails to bowl in the allotted time, with the captain fined double that amount. As such, De Villiers was fined 40 per cent of his match fee, while his players received 20 per cent fines. The Proteas captain had previously been found guilty of minor over-rate offences on two occasions in the past 12 months (in Perth in November 2014 and during the ICC Cricket World Cup 2015), and served a one match suspension during the first ODI against Bangladesh in July. Consequently, the note in 4.2 of Appendix 2 of the Code now applies and this is deemed to be a first offence for the purpose of penalty. If South Africa commits another minor over rate breach in ODIs within 12 months of this offence with De Villiers as captain, it will be deemed a second offence by De Villiers and he will again face a suspension. De Villiers pleaded guilty to the offence and accepted the proposed sanction, so there was no need for a formal hearing. The charge was laid by on-field umpires Aleem Dar, from the Elite Panel of ICC Umpires, and Vineet Kulkarni, third umpire Chettithody Shamshuddin and fourth umpire Anil Dandekar.", "external_links": [], "published": "2015-10-12T14:08:00.000+03:00", "crawled": "2015-10-12T15:12:10.937+03:00", "highlightTitle": ""}