{"organizations": [], "uuid": "707378d39b313750c280d343ef3e9186cb7ac348", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13530/national-news", "section_title": "National News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30132707/spinning-top-puppet-among-12-toy-hall-of-fame-finalists", "country": "US", "title": "Spinning top, puppet among 12 Toy Hall of Fame finalists", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Spinning top, puppet among 12 Toy Hall of Fame finalists - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "707378d39b313750c280d343ef3e9186cb7ac348"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30132707/spinning-top-puppet-among-12-toy-hall-of-fame-finalists", "ord_in_thread": 0, "title": "Spinning top, puppet among 12 Toy Hall of Fame finalists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ROCHESTER, N.Y. (AP) - The spinning top, coloring book, Wiffle Ball and puppet are vying for a place in the National Toy Hall of Fame. The simple classics are among 12 finalists for this year's class announced Monday.\nThey are up against American Girl dolls, Battleship, Jenga, PLAYMOBIL, the scooter, Super Soaker, Teenage Mutant Ninja Turtles and Twister.\nTwo winners will be inducted into hall at The Strong museum on Nov. 5.\nAnyone can nominate a toy, but to earn a place in the hall of fame, they must have survived multiple generations, be widely recognized and foster learning, creativity or discovery through play.\nThe finalists are chosen by historians and curators at The Strong. From there, a national panel of judges made up of inventors, educators, psychologists and others choose the winners.\nLast year, little green Army men, the Rubik's Cube and bubbles took their place in the hall, joining 53 other old favorites, including Barbie, Easy-Bake Oven, G.I. Joe, the Frisbee and View-Master.\nThis year's finalists include two toys that date to ancient times, the puppet and the top. At the other end of the timeline is the Super Soaker, which put a tank of water on a squirt gun in 1990.\nAmerican Girl dolls, Jenga and Teenage Mutant Ninja Turtle toys emerged in the 1980s, while the PLAYMOBIL line of three-inch figures was a product of the 1970s. Twister was introduced in 1966, followed a year later by Battleship. The Wiffle Ball was introduced in 1953.\nScooters have been around since the turn of the 20th century, according to The Strong, along with coloring books, whose popularity soared with the invention of crayons.\n ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-10-02T23:51:57.695+03:00", "highlightTitle": ""}