{"organizations": [], "uuid": "804a71a4ab58cb401acb25e4f24e1dbbf6882d6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2343704!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/sayreville1s-1-web.jpg", "site_section": "http://www.nydailynews.com/sports/high-school/index.html", "section_title": "New York High School Sports Coverage, Photos, HS Hoops, Recaps - NY Daily News", "url": "http://www.nydailynews.com/sports/high-school/defendants-sayreville-hazing-scandal-probation-article-1.2343705", "country": "US", "title": "Six defendants in Sayreville hazing scandal get probation", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Six defendants in Sayreville hazing scandal get probation - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "804a71a4ab58cb401acb25e4f24e1dbbf6882d6e"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/sports/high-school/defendants-sayreville-hazing-scandal-probation-article-1.2343705", "ord_in_thread": 0, "title": "Six defendants in Sayreville hazing scandal get probation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mel Evans/AP Sayreville High School is rocked by scandal last year when seven football players are accused of sexually assaulting and abusing four teammates. Four of the seven teenagers charged in the Sayreville football locker room hazing and sexual-abuse scandal have pleaded guilty to charges ranging from simple assault to hazing and were sentenced to probation, the Middlesex County prosecutor said in a statement Monday.\nTwo other youngsters charged were judged to be delinquent, though not of the most serious charges of sexual assault. A seventh teen’s case remains pending.\nNone of the six defendants will be required to register for Megan’s Law, the list of convicted sex offenders.\n SPORTS ON FACEBOOK. \"LIKE\" US HERE.\nIn stating that three of the defendents admitted to digitally penetrating their victims through clothing, the prosecutor, Andrew Carey, said that the facts alleged by his office “have clearly been proven in a court of law,” adding, “The community of Sayreville needs to know that these serious crimes occurred, and now must work together to heal.”\nThe release from Carey’s offices said the sentences were imposed by a Family Court judge after four of the six football players pleaded guilty to charges of committing a disorderly persons offense (hazing), and a third degree charge of endangering the welfare of their younger fellow teammates.\nFour defendants were placed on two-year probation. Two players were given one-year probation after they were found not guilty of the most serious charges of sexual assualt following a trial.\nPamela Brause, an attorney for one of players whose case has been resolved, felt it was essential the players not be on the Megan’s Law list.\n“These are young kids who sometimes do things that show a lack of judgment, but you hate to see their lives ruined by a single dopey moment,” Brause told the Daily News.\n“My client is a good, solid kid with good values who wants to go to college, play some sports and move on with his life. … My concern from the day this started was that I didn’t want it to be something that defined him for the rest of his life. My client has done well to use this as a life lesson.”\nThe scandal came to light in early October when Sayreville first cancelled a single game and four days later announced that the entire season was being scrapped. On Oct. 10, seven players were arrested on sexual charges related to locker room hazing, setting off an emotional time in Sayreville filled with candlelight vigils, tense Board of Education meetings and parents disputing the charges and defending coach George Najar.\nBut Najar, who had won three straight titles during his 20-year run at the school, was suspended from his physical education teaching job in early October and fired as football coach in February.\nAccording to Carey, the first incident took place on Sept. 19, “when a 17-year-old juvenile defendant “body slammed” a 15-year-old victim to the floor and pretended to stomp and kick the victim, exposing him to bodily injury.”\nAccording to the statement, exactly a week later, “the same 17-year-old defendant, along with the two who were adjudicated delinquent following the trial, and another 16-year-old male who is awaiting trial, took part in an attack of a 14-year-old boy.”\nThe release says the boy was forcibly knocked to the ground, held down by one defendant while two others “grabbed his penis and attempted to digitally penetrate his anus.”\nThen, on Sept. 30, 2014, “the 15-year-old male charged with the digital penetration on the previous day, swiped his fingers between the buttocks of a 14-year-old boy. The defendant also pleaded guilty to the lesser charges in that sexual assault.”\nSayreville will play its first football game since the scandal on Sept. 11.\nMOBILE USER? SEE THE VIDEO HERE\nRelated Stories Two teens in Sayreville hazing case cleared of worst charges Sayreville lets ex-football coach Najjar keep teaching job Sayreville narrows down search for Najjar's replacement Sayreville students wear T-shirt to support fired Najjar George Najjar officially out as Sayreville HS football coach Tags: sayreville high school", "external_links": ["https://www.facebook.com/NYDNSports", "http://launch.newsinc.com/js/embed.js"], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T10:03:37.052+03:00", "highlightTitle": ""}