{"organizations": [], "uuid": "7dd4fa77ee2a0f9e224526f0f342dd041eb69c4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theday.com", "main_image": "http://www.theday.com/Assets/images/facebook/day_logo_291.png", "site_section": "http://www.theday.com/section/rss11", "section_title": "The Day RSS Feeds - UConn Sports News", "url": "http://www.theday.com/uconn-sports/20151016/uconn-football-searching-for-the-finishing-touch", "country": "US", "title": "UConn football searching for the finishing touch", "performance_score": 0, "site": "theday.com", "participants_count": 1, "title_full": "UConn football searching for the finishing touch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:51:00.000+03:00", "replies_count": 0, "uuid": "7dd4fa77ee2a0f9e224526f0f342dd041eb69c4e"}, "author": "Gavin Keefe", "url": "http://www.theday.com/uconn-sports/20151016/uconn-football-searching-for-the-finishing-touch", "ord_in_thread": 0, "title": "UConn football searching for the finishing touch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UConn football searching for the finishing touch Published October 16. 2015 5:51PM By Gavin Keefe \nFourth quarter failures have haunted UConn this season. \nIf not for stumbling down the stretch, the Huskies' record would be better than 3-3 at the midway point of the football season. \nUConn has been outscored 50-21 in the final quarter this season, including by a combined 14 points in their three losses. In the first three quarters, they hold a 98-62 edge. \nThe Huskies looking to reverse that trend on Saturday against South Florida (2-3, 0-1) in an American Athletic Conference game at Rentschler Field in East Hartford (noon, ESPNU). \n\"We've had a chance in every single game in the fourth quarter,\" quarterback Bryant Shirreffs said. \"So we've just got to learn from the games that we were presented tough challenges and ended up losing. Now it becomes even more important in conference play where every game matters so much that you can't afford a fold in the fourth quarter.\" \nThe outcome has remained in doubt heading into the final quarter in nearly every game of this series, which is tied at 6-6. The last eight meetings, including last year's 17-14 road defeat, have been decided by an average of 4.3 points. The Huskies have lost three straight by a combined 13 points. \nDespite the late game breakdowns this season, UConn can double last season's victory total by beating the Bulls. A win also would give the Huskies a winning record through seven games for the first time since 2009. \nThey're tied for second place in the AAC East Division at 1-1, trailing only first-place Temple (5-0, 2-0). \nThey're progressing according to coach Bob Diaco's plan. \n\"I'm so pleased with where the team is and pleased with the leadership from the seniors and how they've been the strong backbone for the younger guys to follow,\" Diaco said. \nThe Bulls are riding momentum from what they called the program's biggest win in coach Willie Taggart's three years. South Florida beat Syracuse, 45-24, on Oct. 10 to end a three-game winless streak that featured losses to unbeaten Memphis, Maryland and nationally-ranked Florida State. \nSophomore Marlon Mack powered a potent offense that piled up 535 yards, rushing for a season-high 184 yards and two touchdowns against Syracuse. Diaco called Mack, the conference's second-leading rusher, one of the best tailbacks in the country and compared dual-threat quarterback Quinton Flowers (784 passing yards, 264 rushing yards, 11 touchdowns overall) to Navy standout Keenan Reynolds. \nThe Bulls recorded 10 tackles for loss last week and rank third in the conference in total defense at 352.8 yards, sitting just behind UConn (339.2 yards). They possess dangerous playmakers on both sides of the ball. \n\"They look like a very strong team, especially last Saturday against Syracuse,\" Diaco said. \"The score wasn't close and the game was even less close. They're a high-powered group in all three phases. ... It will be a great challenge for our program.\" \ng.keefe@theday.com", "external_links": [], "published": "2015-10-17T00:51:00.000+03:00", "crawled": "2015-10-17T04:53:57.849+03:00", "highlightTitle": ""}