{"organizations": [], "uuid": "26976b367af1aed5474a91c7ba1923c228450933", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyherald.com", "main_image": "http://www.dailyherald.com/storyimage/DA/20151022/sports/310229980/AR/0/AR-310229980.jpg&amp;updated=201510220150&amp;imageversion=Facebook&amp;exactH=630&amp;exactW=1200&amp;exactfit=crop&amp;noborder", "site_section": "http://www.dailyherald.com/rss/feed/?feed=sports_all", "section_title": "DailyHerald.com &gt; Sports", "url": "http://www.dailyherald.com/article/20151022/sports/310229980/", "country": "US", "title": "As MLB postseason lengthens, outfielders outfitted as skiers", "performance_score": 0, "site": "dailyherald.com", "participants_count": 1, "title_full": "As MLB postseason lengthens, outfielders outfitted as skiers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:00:00.000+03:00", "replies_count": 0, "uuid": "26976b367af1aed5474a91c7ba1923c228450933"}, "author": "RONALD BLUM", "url": "http://www.dailyherald.com/article/20151022/sports/310229980/", "ord_in_thread": 0, "title": "As MLB postseason lengthens, outfielders outfitted as skiers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK -- Joe Maddon walked to the mound in a ski cap. Yoenis Cespedes wore a balaclava. As baseball's postseason keeps getting longer, the Boys of Summer are starting to resemble skiers on a Steamboat Springs lift line.\n\"This weather is not for me,\" Cubs infielder Javier Baez said. \"I'm from Puerto Rico, and you know how the weather is in the island - it's hot all year long.\"\nPlayers wish there was only 6 degrees of separation between the dog days of summer and the coolest venues in baseball they all try to reach - the postseason. It was 48 degrees when the NL Championship Series opener began at New York's Citi Field last weekend and 45 for the start of Game 2. The teams did get a break with a 72 degree night at Chicago's Wrigley Field for Game 4 on Wednesday.\n\"Baseball is a warm weather sport. Guys like to sweat,\" Toronto manager John Gibbons said. \"The pitchers tend to have the advantage and dominate a little bit more because guys get sawed off and guys' hands are hurting. You're just not as loose and relaxed.\"\nBefore the start of the League Championship Series in 1969, the World Series ended by Oct. 16 each year except for 1910, when the NL attempted to expand the regular season from 154 to 168 games before backing off, and 1911, when there were six days off between Games 3 and 4 because of rain.\nExpanded playoffs and television have extended the schedule, with the Division Series round starting in 1995 and a one-game wild-card matchup added for 2012. Game 7 this year is scheduled for Nov. 4, which would match 2009 for the latest date a World Series game has been played.\nAll World Series games were played in the daytime until 1971, when the lure of television money started the night owl transformation. There hasn't been a Series day game since 1987 - and no outdoor day games since 1984.\nWhen Bud Selig presided over his final All-Star Game as commissioner in 2014, a fan asked whether the wild-card round could expand to best-of-three.\n\"We start running into November and you are asking for trouble,\" Selig said.\nEven the second half of October has been problematic.\nWhen Bowie Kuhn was commissioner, he sat in the stands without a coat on cold nights during the 1976 World Series, trying to make it appear he was not impacted by the weather. When Cleveland hosted the Florida Marlins for Game 4 of the 1997 World Series, the game-time temperature was 38 degrees, the coldest at the start of a Series game since its records began in 1990, according to STATS.\n\"It was the coldest I've pitched in,\" said Cleveland pitcher Jaret Wright, who got the win that night. \"It was tough to get a grip on the ball.\"\nSince 1990, the coldest temperature at the start of a postseason contest was 35 degrees when Colorado hosted Philadelphia for Game 3 of a 2009 NL Division Series.\n\"Not the easiest conditions in the world to play baseball,\" Colorado manager Jim Tracy said.\nWhile managing Tampa Bay in the 2008 postseason, Maddon became fond of caps with downflaps, nicknamed \"Elmer Fudds\" after Bugs Bunny's antagonist.\n\"I'm looking for it,\" Maddon said before his Cubs played the Mets last weekend, holding a cup of hot tea to try to stay warm. \"It didn't make the trip to New York.\"\nDespite the chill, Cubs pitcher Jake Arrieta decided to pitch Game 2 in short sleeves.\n\"The way that clothes are made now,\" Chicago pitching coach Chris Bosio said, \"they can outfit you and make you as cold as you want or as warm as you want.\"\n___\nAP Sports Writer Eric Nunez contributed to this report.\n MLB Baseball Pro Men Associated Press", "external_links": ["https://twitter.com/share"], "published": "2015-10-22T15:00:00.000+03:00", "crawled": "2015-10-23T06:37:17.648+03:00", "highlightTitle": ""}