{"organizations": ["Seminoles", "Florida State-Louisville", "Cook lead Seminoles"], "uuid": "58f237ecf6849a053b77e633d19405a85acf78a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tallahassee.com", "main_image": "http://www.gannett-cdn.com/-mm-/3647b011c27b38722cbaa3f1ad8f89fd106f4192/c=0-58-599-397&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/17/Tallahassee/Tallahassee/635806791297470050-Jameis.jpg", "site_section": "http://rssfeeds.news-press.com/ftmyers/sports", "section_title": "Ft Myers - Sports", "url": "http://www.tallahassee.com/story/sports/college/fsu/football/2015/10/17/fsu-louisville-game-updates-jameis-winston-visits-old-stomping-grounds/74121804/", "country": "US", "title": "Golson, Cook lead Seminoles to 6-0 start with win over Louisville", "performance_score": 0, "site": "tallahassee.com", "participants_count": 0, "title_full": "Golson, Cook lead Seminoles to 6-0 start with win over Louisville", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T22:17:00.000+03:00", "replies_count": 0, "uuid": "58f237ecf6849a053b77e633d19405a85acf78a6"}, "author": "", "url": "http://www.tallahassee.com/story/sports/college/fsu/football/2015/10/17/fsu-louisville-game-updates-jameis-winston-visits-old-stomping-grounds/74121804/", "ord_in_thread": 0, "title": "Golson, Cook lead Seminoles to 6-0 start with win over Louisville", "locations": ["Louisville Safid Deen", "Louisville Golson"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cook", "Golson"], "text": "Golson, Cook lead Seminoles to 6-0 start with win over Louisville Safid Deen, Democrat staff writer 3:17 p.m. EDT October 17, 2015 Buy Photo Jameis Winston shakes hands with a teammates before the Florida State-Louisville game on Saturday, Oct. 17, 2015. (Photo: Safid Deen/Democrat) Buy Photo 836 CONNECT 91 TWEET LINKEDIN 1 COMMENT EMAIL MORE \nSometimes it's not how you start. It's how you finish. \nFlorida State (6-0, 3-0 Atlantic Coast Conference) scored on its first five possessions in the second half, after entering halftime down 7-6, to beat Louisville (2-6, 1-2 ACC) win its 28th consecutive game in conference play. \nEverett Golson led FSU's offense in his best game as a Seminole, completing 26 of 38 passes for 378 yards and three touchdown passes. \nRunning back Dalvin Cook, who came up lame with a hamstring cramp on two separate plays in both halves, finished the game with 22 carries for 163 yards and two touchdowns. He also caught four passes for 60 yards. \nLouisville's Lamar Jackson saw some success in the air, connecting with receiver James Quick for three touchdowns. Jackson, a freshman from Boynton Beach, completed 20 of 35 passes for 307 yards and an interception. \nThe Seminoles trailed at halftime for the first time since losing to Oregon in the Rose Bowl game during last season's College Football Playoff semifinal. \nFourth-quarter updates, FSU up 41-21: Everett Golson found Travis Rudolph in the end zone for a 13-yard touchdown pass to extend the Seminoles' lead to 33-14. \nBut Louisville quarterback Lamar Jackson threw his third touchdown to James Quick to cut the deficit to 13 with 10:47 remaining in the game. \nGolson found tight end Ryan Izzo for a 2-yard touchdown pass with 4:12 remaining. \nEnd of third quarter, FSU up 27-14: FSU running back Dalvin Cook scored his second touchdown of the quarter, a 14-yard run up the left side. \nEverett Golson found Kermit Whitfield open for a pass that went 70 yards for a touchdown to put FSU up 20-14 with 8:05 left in the quarter. \nU of L quarterback Lamar Jackson connected with receiver James Quick for their second touchdown of the day, a 19-yard play, on the previous drive to retake the lead. \nCook broke free for the first time Saturday, scoring a 54-yard touchdown to give the Seminoles a 13-7 lead to start the quarter. \nHalftime, Louisville up 7-6: Both offenses have struggled early, but Louisville holds the lead. \nFSU running back Dalvin Cook got a bulk of his seven first-half carries in the penultimate drive of the second half, and came up limping after a stellar pass from Everett Golson that went for a gain of 26 yards. Cook has 62 total yards in the first half. \nGolson has completed 13 of 20 passes for 150 yards in the first half. Louisville's Lamar Jackson has completed 10 of 15 passes for 148 yards and a touchdown. \nRoberto Aguayo narrowed Louisville's lead with a 32-yard kick with 13:12 left in the first half. Kermit Whitfield dropped a touchdown in the end zone on the previous play. \nEnd of first quarter, Louisville up 7-3: Louisville quarterback Lamar Jackson found receive James Quick wide open on two consecutive plays, the second an 18-yard touchdown, to give the Cardinals the lead. \nJackson found Quick for a 48-yard completion, but Quick fell at the 20-yard line to set up the next play. \nRoberto Aguayo kicked a 43-yard field goal to give the Seminoles an early 3-0 lead. \nA fumbled snap between center Ryan Hoefeld and quarterback Everett Golson resulted in a 10-yard loss for FSU to halt the drive downfield. Golson connected with tight end Mavin Saunders for a 21-yard catch to put the team in its best field position of the day. \nFSU's first two drives of the game started at the 11- and 14-yard lines, respectively. \nPregame: The Florida State-Louisville game is set to kickoff at noon on ESPN, and the Seminoles fans in attendance at Doak Campbell Stadium have already seen a familiar face on the field before the game. \nFormer quarterback Jameis Winston was on the field for pregame warmups, wearing a generic black No. 4 Seminoles jersey. Former FSU QB Jameis Winston has arrived for #LOUvsFSU rocking a No. 4 jersey. #Noles pic.twitter.com/G0Rebf9h7s — Safid Deen (@Safid_Deen) October 17, 2015 Jameis Winston and Jimbo Fisher's son Ethan share a hug before playing catch on the field. pic.twitter.com/7isBzmC6b3 — Safid Deen (@Safid_Deen) October 17, 2015 \nWinston greeted former teammates and shard an embrace with many including Jimbo Fisher’s son, Ethan, before the two played catch on the field. \nFormer defensive end Mario Edwards Jr., of the Oakland Raiders, is also visiting for the game. \nStay tuned to tallahassee.com for more game updates. 836 CONNECT 91 TWEET LINKEDIN 1 COMMENT EMAIL MORE Read or Share this story: http://on.tdo.com/1ROmD42 TOP VIDEOS", "external_links": [], "published": "2015-10-17T22:17:00.000+03:00", "crawled": "2015-10-18T04:52:14.436+03:00", "highlightTitle": ""}