{"organizations": [], "uuid": "ccf2a595b8f4d526f8e890b1fdf0b572506c515c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/6/55/Sports/World.aspx", "section_title": "World - Sports - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/6/55/161449/Sports/World/Chelsea-have-hunger,-ambition-to-progress-Skipper-.aspx", "country": "EG", "title": "Chelsea have hunger, ambition to progress: Skipper Terry", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Chelsea have hunger, ambition to progress: Skipper Terry - World - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "ccf2a595b8f4d526f8e890b1fdf0b572506c515c"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/55/161449/Sports/World/Chelsea-have-hunger,-ambition-to-progress-Skipper-.aspx", "ord_in_thread": 0, "title": "Chelsea have hunger, ambition to progress: Skipper Terry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Chelsea boss Mourinho urges struggling Matic to stay calm Pedro and Remy out for Chelsea Chelsea looks to boost poor season with win in Kiev Mourinho lauds Chelsea discipline after win without Hazard Chelsea, Manchester United back to form in Premier League With two of Chelsea's three remaining Champions League group games to come at Stamford Bridge, skipper John Terry is confident qualification for the knockout rounds is in their own hands after Tuesday's 0-0 draw at Dynamo Kiev.\nThe English champions, who beat Maccabi Tel Aviv 4-0, lost 2-1 at Porto and sit third in Group G, were denied by the woodwork twice in Kiev and had a strong penalty claim turned down when Cesc Fabregas was tripped.\nWith Kiev and Porto still to play in London, Terry said home advantage would give them the edge to progress from the group.\n\"I think we deserved to win. We created a few chances, Willian's free-kick hit the bar, and there was the penalty that for me maybe was one, that wasn't given,\" Terry told reporters.\n\"We were unlucky not to score and they had a couple of half-chances as well and we are disappointed not to win, we came here to win the game and there were some good performances.\n\"We move on and it is important now we go back to the Bridge and we have to win our home games.\n\"Big Champions League nights in front of our home support, under the floodlights, is where we want to be so it is in our hands and we feel comfortable with that,\" he added.\nTerry hopes his side is building momentum after a torrid start to their Premier League campaign. Chelsea are 12th after nine games and already 10 points behind leaders Manchester City.\n\"We are a great side and we will get there with the hunger and the ambition that is in the squad,\" the 34-year-old defender said.\n\"You don't win trophies year after year without that hunger in the belly. We are collectively together, the players, the manager and the fans and we will be alright,\" he added.\n ", "external_links": ["https://twitter.com/AO_Sports", "https://www.facebook.com/AhramOnlineSports?fref=ts"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T18:56:35.251+03:00", "highlightTitle": ""}