{"organizations": [], "uuid": "7f4305a8c98346109f15d7ad9876c042c9e3bafc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49317821.cms", "site_section": "http://timesofindia.indiatimes.com/rssfeeds/4719148.cms", "section_title": "The Times of India Sports: Extensive sports coverage, key statistics and free downloads", "url": "http://timesofindia.indiatimes.com/sports/chess/The-making-of-Swapnil-Dhopade-Vidarbhas-first-chess-grandmaster/articleshow/49317636.cms", "country": "IL", "title": "The making of Swapnil Dhopade, Vidarbha's first chess grandmaster", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "The making of Swapnil Dhopade, Vidarbha's first chess grandmaster - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T12:34:00.000+03:00", "replies_count": 0, "uuid": "7f4305a8c98346109f15d7ad9876c042c9e3bafc"}, "author": "Suhas Nayse", "url": "http://timesofindia.indiatimes.com/sports/chess/The-making-of-Swapnil-Dhopade-Vidarbhas-first-chess-grandmaster/articleshow/49317636.cms", "ord_in_thread": 0, "title": "The making of Swapnil Dhopade, Vidarbha's first chess grandmaster", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NAGPUR: When Swapnil Dhopade will return to Amravati from Pune on Monday morning after playing the ongoing Maheshwaranand Saraswati Memorial All India Open FIDE Rating Chess tournament, it will be an emotional moment for him. \n\nBefore leaving the home a couple of weeks ago for the Inter-Railways Chess Championship held at Chennai, a lot of things were going through his mind. He was uncertain about his future as the Grand Master title was eluding him for the last three years. He was trying hard and giving his best, but he just could not able to cross the magical figure of 2500 Elo points despite having the necessary 3 GM norms to his credit way back in 2013. \n\nHowever, all that is past now and the agonizing wait is over for this 25-year-old Amravati youngster. His perseverance has paid off finally. The determination to succeed took him in the history books of Indian chess. On Friday, he became the first from Vidarbha and only the fifth GM from Maharashtra. \n\nDuring his tough times, it was his parents - mother Hema and father Sunil - who always encouraged him to go for the GM title. \n\n\"Frankly speaking, it was very tough for us to motivate him when he was not able cross that required points' barrier. Although he was not showing us from outside, we know that deep inside he was feeling the pain. Constant failures in the last couple of years had left him totally frustrated. He had almost reached the breaking point where we thought he would give up,\" said Hema. \n\nThe reason for Swapnil's disappointment was obvious. He was just eleven points away from becoming the GM in 2013 itself when he had 2489 Elo points under his belt. \n\nFrom 2489, he slipped to 2418 as the pressure of becoming the first GM from Vidarbha took a heavy toll on his mind and body. At that point, reaching 2500 looked a distant dream. \n\n\"The role of mother was very crucial when Swapnil was going through a rough patch. I had to use all my skills and convincing power. I constantly motivated him and told him that he could do it. Most of the players would have given up had they faced so many hurdles. But I am glad that my son stood firm and brought glory to us and the region. He lived up to our expectations in a big way. Hours and hours of practice and untiring hard work Swapnil has put in the last few years bore fruit,\" said the proud mother. \n\nThe journey from an average chess player to GM was a challenging one for the Dhopades. They have to make lot of sacrifices to realize their dream. \n\n\"Coming from a middle class family, it was always going to be tough for us to make a champion. We have to pump in a lot of money on coaching and other things to fulfill Swapnil's needs. There were times when we all thought that was it really worth taking the big risk. But Swapnil's continuous results in the state and national tournaments kept us going. When he became International Master in 2011 (only second from Vidarbha after Anup Deshmukh), we thought we must pursue his dream of becoming GM no matter what sacrifices we have to make,\" said Hema, who works in PWD department in Amravati. \n\nA chess player's calendar is pretty busy. It involves a lot of travelling for participating in various national and international tournaments. One of the two parents had to accompany Swapnil all the time for the support. \n\nOf late, Swapnil's father Sunil more often than not travels with his son for the tournaments. \n\n\"It is either me or my wife who has to travel with Swapnil. I took VRS from Amravati Municipal Corporation around four years ago so that my wife doesn't have to take leave all the time. When there are two rounds in a, day as it is happening in Pune now, we have to act fast and provide all the support to him. We have to make sure he takes lunch and dinner at proper time. Taking rest and sleeping at the correct time are the things we need to take care for the good performance,\" said Sunil. Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": [], "published": "2015-10-12T12:34:00.000+03:00", "crawled": "2015-10-12T10:21:38.217+03:00", "highlightTitle": ""}