{"organizations": [], "uuid": "ef072ae5def97d377dec9c339d60e54c54245f70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1013/20151013__SJM-RAIDERS-1014-01~1.JPG", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/225005.xml", "section_title": "Sports", "url": "http://www.contracostatimes.com/raiders/ci_28964566/raiders-murray-will-use-bye-week-get-healthy?source=rss", "country": "IL", "title": "Raiders' Murray will use bye week to get healthy", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "Raiders' Murray will use bye week to get healthy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:34:00.000+03:00", "replies_count": 0, "uuid": "ef072ae5def97d377dec9c339d60e54c54245f70"}, "author": "Jimmy Durkin\n\njdurkin@bayareanewsgroup.com", "url": "http://www.contracostatimes.com/raiders/ci_28964566/raiders-murray-will-use-bye-week-get-healthy?source=rss", "ord_in_thread": 0, "title": "Raiders' Murray will use bye week to get healthy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Raiders' Murray will use bye week to get healthy By Jimmy Durkin Posted: 10/13/2015 04:41:11 PM PDT Updated: 10/13/2015 05:07:34 PM PDT Raiders news on Facebook ALAMEDA -- It's an early bye week for the Raiders after just five games this season, but the timing is good for banged up running back Latavius Murray. \nMurray had only two second-half carries in the Raiders' 16-10 loss to the Denver Broncos on Sunday as he continued to deal with a shoulder injury suffered the week. \nMurray briefly went into the locker room during the second half of the game, but he spent most of his time on the sidelines standing with the offensive personnel. Coach Jack Del Rio said after the game that he was banged up, but available. \nThe third-year running back in his first full season as the starter is hoping a week off -- the team practices Wednesday and Thursday before getting four days off -- is enough to get him back to full strength. Oakland Raiders' Latavius Murray (28) runs against Denver Broncos' Danny Trevathan (59) in the first quarter of their NFL game at O.co Coliseum in Oakland, Calif, on Sunday, Oct. 11, 2015. (Nhat V. Meyer/Bay Area News Group) ( Nhat V. Meyer ) \n\"I definitely think it's a good time to get some rest, just relax and heal up,\" Murray said Tuesday. \nWithout Murray, the Raiders options on the ground are limited. He leads the team with 336 yards, an average of 67.2 per game that would put him on pace for a 1,000-yard season. \nTaiwan Jones, who has missed the past two weeks with a foot injury, is next with just 30 yards. Current No. 2 back Roy Helu Jr. has only 28 yards on eight carries. \nThe Raiders are 27th in the NFL in rushing yards per game and 29th in attempts at just 22.4 per game. But Murray said the issue isn't a lack of commitment to the run game, it's more about taking advantage of opportunities. Advertisement \n\"It's not a matter of how many carries I get,\" Murray said. \"Obviously the more you get, the more comfortable you may be. But you never know, the first one could go for 90. The second one could go for a yard or negative. It's not a matter of when or how many times, it's a matter of making the most of how many carries we get.\" \nAgainst Denver, the Raiders ran 25 times -- their second-highest total of the year behind the 30 attempts in the win at Cleveland. But a less than full strength Murray couldn't break free and the options behind him (fullback Jamize Olawale carried a career-high six times but for only 13 yards) weren't good enough. Murray didn't enjoy his view from the sideline as the Raiders couldn't keep a close game from getting away. \n\"It's very frustrating anytime you can't do the things that you're able to do,\" Murray said. \"I've got some time take care of my body and I'm looking forward to it.\" \nRookie linebacker Neiron Ball said he got a heads up early last week that he'd be a major part of the defense on Sunday. \nThe fifth-round pick out of Florida started and played a career-high 36 defensive snaps, putting him on the field 62 percent of the game. His playing time came at the expense of free agent signee Curtis Lofton, who saw just 22 snaps. \n\"It was exciting because I came here to play football and I got more playing time and that's what I'm looking for,\" Ball said. \nHis biggest contribution was helping to shut down Denver tight end Owen Daniels, a position that had caused the Raiders fits. Daniels didn't catch a pass on five targets. \n\"I feel like that just wasn't on me,\" Ball said. \"I feel like it was a team effort. The DBs did their job to cover their man and the guys that were pass rushing the quarterback, they did their job, and I feel like it all just worked together. It wasn't just a one-man effort.\" \nBall certainly earned more playing time in the future with his performance and conceded he might be one of the few guys unhappy to see the bye week come up right now. \n\"I do want to get back out there,\" he said. \nBall is taking a load of confidence into the bye week after his best effort as a pro. \n\"If you don't play well, obviously you're going to be skeptical about the second time,\" Ball said. \"I played well, so I've got a little confidence. But I had confidence before.\" For more on the Raiders, visit the Inside the Oakland Raiders blog at ibabuzz.com/oaklandraiders .", "external_links": [], "published": "2015-10-14T04:34:00.000+03:00", "crawled": "2015-10-14T04:48:22.173+03:00", "highlightTitle": ""}