{"organizations": ["AP Photo/Amy E. Conn", "Associated Press", "NCAA", "Florida State", "AP"], "uuid": "8313dc444f2b589cebe37d989ae0a3cbdd480998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wftv.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/10/0f/e4/178bb8cbde4442aaaf6a089fe97522db-2792ef5b09e744ae927df0b72d14c95c-0.jpg", "site_section": "http://www.wftv.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.wftv.com/ap/ap/top-news/miami-fsu-tee-it-up-nw-michigan-cal-utah-in-league/nny9J/", "country": "US", "title": "Miami-FSU tee it up; NW-Michigan, Cal-Utah in league games", "performance_score": 0, "site": "wftv.com", "participants_count": 0, "title_full": "Miami-FSU tee it up; NW-Michigan, Cal-Utah in league games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T09:35:00.000+03:00", "replies_count": 0, "uuid": "8313dc444f2b589cebe37d989ae0a3cbdd480998"}, "author": "", "url": "http://www.wftv.com/ap/ap/top-news/miami-fsu-tee-it-up-nw-michigan-cal-utah-in-league/nny9J/", "ord_in_thread": 0, "title": "Miami-FSU tee it up; NW-Michigan, Cal-Utah in league games", "locations": ["Fla", "Miami", "Miami Gardens", "Tallahassee", "Florida State", "South Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["M. Alvarez", "Roberto Aguayo", "Gerry Thomas", "Cason Beatty", "RICHARD ROSENBLATT", "Bobby Bowden", "Jesse Mitchell", "Matt Munyon", "Cal-Utah", "Michael Badgley"], "text": "Updated: 2:35 a.m. Saturday, Oct. 10, 2015 | Posted: 2:35 a.m. Saturday, Oct. 10, 2015 Miami-FSU tee it up; NW-Michigan, Cal-Utah in league games Related View Larger FILE - In this Oct. 7, 2000, file photo, Florida State kicker Matt Munyon (86) reacts after missing a field goal in the final seconds that would have tied the game against Miami in Miami. New coaches, new players, new era, but the 'Canes (3-1) and 12th-ranked 'Noles (4-0) tee it up again on Saturday, Oct. 10, 2015, with Florida State looking to make it five wins in a row over Miami. (AP Photo/Amy E. Conn, File) View Larger FILE - In this Nov. 16, 1991, file photo, Miami's Jesse Mitchell (79) celebrates as Florida State kicker Gerry Thomas (15) leaves the field after missing a field goal in the closing seconds of an NCAA college football game in Tallahassee, Fla. New coaches, new players, new era, but the 'Canes (3-1) and 12th-ranked 'Noles (4-0) tee it up again on Saturday, Oct. 10, 2015, with Florida State looking to make it five wins in a row over Miami. (AP Photo/Don Dughi, File) View Larger FILE - In this Sept. 10, 2004, file photo, Florida State coach Bobby Bowden paces along the sideline during an NCAA college football game against Miami in Miami. New coaches, new players, new era, but the 'Canes (3-1) and 12th-ranked 'Noles (4-0) tee it up again on Saturday, Oct. 10, 2015, with Florida State looking to make it five wins in a row over Miami. (AP Photo/Luis M. Alvarez, File) View Larger FILE - In this Sept. 12, 2015, file photo, Florida State's Roberto Aguayo kicks an extra point from the hold of Cason Beatty during an NCAA college football game against South Florida in Tallahassee, Fla. New coaches, new players, new era, but Miami (3-1) and Florida State (4-0) tee it up again on Saturday, Oct. 10, 2015, with Florida State looking to make it five wins in a row over Miami. (AP Photo/Steve Cannon, File) View Larger FILE - In this Nov. 15, 2014, file photo, Miami's Michael Badgley (24) attempts a field goal in the first half an NCAA college football game against Florida State in Miami Gardens, Fla. New coaches, new players, new era, but the 'Canes (3-1) and 12th-ranked 'Noles (4-0) tee it up again on Saturday, Oct. 10, 2015, with Florida State looking to make it five wins in a row over Miami. (AP Photo/Lynne Sladky, File) Sponsored Links By RICHARD ROSENBLATT The Associated Press \nWay back when, a 5-foot-6, 145-pound kicker nicknamed \"Flea\" trotted over to the sideline and told the big guy wearing a jacket and tie, holding his trademark pipe and looking anxious, \"Coach, this one's for you.\" \nWith that, Jeff Davis kicked a dramatic 19-yard field goal on the last play in the final regular-season game in 1983 that sent Miami to a 17-16 win over Florida State and on to its first national championship. \nIt was one of the rare times this intense rivalry produced a field goal that lifted a team to victory. Oh, there have been quite a few memorable attempts since — none of them good and all of them flubs by Florida State, as in Wide Right I, II, III, IV and Wide Left I. \n\"Dadgumit,\" was retired Florida State coach Bobby Bowden's favorite way of describing so many near-misses against the Hurricanes. \n\"This is a fairybook story with a fairybook ending,\" was Miami's pipe-smoking coach Howard Schnellenberger's response after the '83 game. \nNew coaches, new players, new era, but the 'Canes (3-1) and 12th-ranked 'Noles (4-0) tee it up again on Saturday night (ABC, 8 p.m. ET), with Florida State looking to make it six in a row over Miami. \nThese days, the game is played earlier in the season, but if it's close — even if it's not — stay tuned for replays of some classic finishes from yesteryear. \nOn Saturday, Roberto Aguayo kicks for Florida State and Michael Badgley for Miami. \nThose misses? \n— Gerry Thomas: Wide right with a 34-yard attempt with less than a minute left of a 17-16 loss in 1991. \n— Dan Mowrey: Wide right with a 39-yard attempt on the final play of a 19-16 loss in 1992. \n— Matt Munyon: Wide right on a 49-yard attempt on the final play of a 27-24 loss in 2000. \n— Xavier Beitia: Wide left on a 43-yard attempt on the final play of a 28-27 loss 2002. \n— Beitia: Wide right on a 39-yard attempt with 5:30 left of a 16-14 loss in the 2004 Orange Bowl. \n___ \nGATOR FLOP? \nLet's not leave surprising Florida out of the Sunshine State conversation. The 11th-ranked Gators (5-0, 3-0 SEC) are at Missouri (4-1, 1-1) and coming off a rout of No. 14 Mississippi. However, they were less than dominant in wins against East Carolina, Kentucky and Tennessee. \n\"Let's look at it from a historical standpoint. This is where the University of Florida should be,\" coach Jim McElwain said. \"So don't be surprised, but let's take advantage of it. I don't know what they're going to do.\" \nKeep your eyes on QB Will Grier, who is completing more than 67 percent of his passes. For Missouri, it's freshman QB Drew Lock starting again with Maty Mauk still suspended. The Tigers may find it difficult to run the ball — they are last in the SEC, while the Gators are second in rushing defense (SEC Network, 7:30 p.m.). \n___ \nWILDCATS AT WOLVERINES TOPS BIG TEN CARD \nIf this is not a statement game for No. 13 Northwestern (5-0, 1-0), it's tough to know what is. With a win in the Big House, the Wildcats move to 6-0 for the first time since 1962, when Ara Parseghian was their coach. If you get tired of Baylor and TCU piling on, Michigan (4-1, 1-0) has two shutouts in a row, and is second in points allowed under coach Jim Harbaugh (BTN, 3:30 p.m.) \n___ \nPAC-12 SPOTLIGHT: CAL AT UTAH \nSurprise unbeatens meet in a Pac-12 showdown. And the QBs are pretty good, too — Jared Goff of No. 23 California (5-0, 2-0) and the less-heralded Travis Wilson of No. 5 Utah (4-1, 1-0). The Utes moved way up in the rankings with a 42-point win over Oregon two weeks ago, and may just be the best team in the league. In three games, Wilson has been an efficient leader for a team that has a strong running game and rugged defense. Cal goes as Goff goes. He is among the nation's leaders in completion percentage, passing efficiency, passing touchdowns and yards passing. The Bears are looking for their first win over a top-10 team in 12 years (ESPN, 10 p.m.). \n___ \nRED RIVER BLOWOUT? \nIt's the day's early rivalry game featuring No. 10 Oklahoma (4-0, 1-0 Big 12) and the hapless Texas Longhorns (1-4, 0-2) in their annual hoe-down. It's not often that a top-notch program falls as far as fast as Texas under coach Charlie Strong, so maybe the 'Horn gather themselves for a big effort. But poor play, bickering players and embarrassing blowout losses don't bode well for a close game. Sooners QB Baker Mayfield (from Austin) is certainly worth watching. He's averaging 380 total yards per game (ABC, noon). \nIn other Big 12 action, look to see if No. 2 Baylor (4-0, 1-0) can top 70 points against Kansas (FS1, noon) and if Heisman hopeful QB Trevone Boykin and No. 3 TCU (5-0, 2-0) can romp at Kansas State (3-1, 0-1), which appears to have little offense due to injuries (Fox, 7:30 p.m.) \n___ \nAP college football website: collegefootball.ap.org Copyright The Associated Press Sign up for our WFTV Morning News Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-10T09:35:00.000+03:00", "crawled": "2015-10-10T09:47:01.599+03:00", "highlightTitle": ""}