{"organizations": ["United Arab Emirates", "Matt Smith Cricket", "Reuters"], "uuid": "17be3aecb7b2f20c29cd22568679887526801114", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151026&t=2&i=1089804543&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9P0GD", "site_section": "http://feeds.reuters.com/reuters/UKSportsNews/", "section_title": "Reuters: Sports News", "url": "http://uk.reuters.com/article/2015/10/26/uk-cricket-pakistan-idUKKCN0SK0RY20151026", "country": "US", "title": "Pakistan beat England in nail-biting finish", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Pakistan beat England in nail-biting finish", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:31:00.000+02:00", "replies_count": 0, "uuid": "17be3aecb7b2f20c29cd22568679887526801114"}, "author": "", "url": "http://uk.reuters.com/article/2015/10/26/uk-cricket-pakistan-idUKKCN0SK0RY20151026", "ord_in_thread": 0, "title": "Pakistan beat England in nail-biting finish", "locations": ["United Arab Emirates", "Pakistan", "England", "DUBAI"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Root", "Jason O'BrienLivepic", "Ben StokesAction"], "text": "DUBAI | By Matt Smith Cricket - Pakistan v England - Second Test - Dubai International Stadium, United Arab Emirates - 26/10/15England's Joe Root looks dejected after being dismissedAction Images via Reuters / Jason O'BrienLivepic left 1 of 2 right Cricket - Pakistan v England - Second Test - Dubai International Stadium, United Arab Emirates - 26/10/15England's Ben StokesAction Images via Reuters / Jason O'BrienLivepic left 2 of 2 right \nDUBAI Pakistan overcame belligerent resistance from England's tail-enders to win the second test by 178 runs on Monday after bowling out Alastair Cook's men for 312 with just 6.3 overs remaining. \nVictory put Pakistan 1-0 up in the three-game series and maintains their record of never having lost a series in their adopted home of the United Arab Emirates. \nStarting the final day on 130 for three and chasing an unlikely 491 for victory, England slumped to 193 for seven after lunch. \nAdil Rashid (61) and Stuart Broad (30) then added 60 in 90 balls before the latter was bowled by an inswinging Wahab Riaz yorker. \nUndeterred, Rashid and Mark Wood (29) were adroit in defence as Pakistan captain Misbah-ul-Haq switched between pace and spin to try to end their resistance. \nHis team's appeals grew more desperate as the overs ticked by and the game entered the final hour with two wickets remaining. \nSeven fielders crowded the batsmen and the pressure told when Wood edged Zulfiqar Babar’s turning ball to Mohammad Hafeez in the gully. \nFive overs later Rashid was last man out, caught attempting a drive through the covers off Yasir Shah. \nWAHAB THREAT \nEarlier, Joe Root and Jonny Bairstow extended their overnight partnership, repelling the threat of paceman Wahab who had engineered England’s match-defining collapse in the first innings. \nHowever, the England pair proved less able to deal with the spin of Zulfiqar (3-53) and Yasir (4-87). \nRoot (71) was first to fall after edging Zulfiqar to Younus Khan. The slip snaffled the ball a fraction above the turf to reduce England to 157 for four. \nMisbah turned up the heat by positioning helmet-clad fielders at silly point and short-leg to accompany two slips. \nBairstow initially read the spin well, lurching forward to pad the ball away and getting on his heels to defend, before he was clean bowled for 22 by a Yasir googly. \nJos Buttler continued his poor form, edging Yasir to Younus at slip on seven, and Ben Stokes was removed for 13 when his wayward drive off paceman Imran Khan went to Misbah at slip. \nThat brought Rashid and Broad together and they scored freely. \nRashid brought up his maiden test half-century with a scrambled single but ultimately it proved in vain. \nSharjah will host the final test from Nov. 1.", "external_links": [], "published": "2015-10-26T18:31:00.000+02:00", "crawled": "2015-10-26T19:12:40.653+02:00", "highlightTitle": ""}