{"organizations": [], "uuid": "0d284f6c1597dd1fa1371bcb4cede697301e745c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nypost.com", "main_image": "https://thenypost.files.wordpress.com/2015/10/murphy-shrug.jpg", "site_section": "http://nypost.com/sports/feed/", "section_title": "| Sports | New York Post", "url": "http://nypost.com/2015/10/24/why-daniel-murphy-insists-on-downplaying-his-playoff-tear/", "country": "", "title": "Why Daniel Murphy insists on downplaying his playoff tear", "performance_score": 0, "site": "nypost.com", "participants_count": 1, "title_full": "Why Daniel Murphy insists on downplaying his playoff tear | New York Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:43:00.000+02:00", "replies_count": 0, "uuid": "0d284f6c1597dd1fa1371bcb4cede697301e745c"}, "author": "Dan Martin", "url": "http://nypost.com/2015/10/24/why-daniel-murphy-insists-on-downplaying-his-playoff-tear/", "ord_in_thread": 0, "title": "Why Daniel Murphy insists on downplaying his playoff tear", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of the advantages of knocking off the Cubs so quickly in the NLCS was the Mets got a few extra days off at home, soaking in their victory.\nAnd it has been a long time since the Mets owned New York this time of year.\nThere have been talk-show appearances and fans meeting them at Citi Field.\n“Guys have asked, ‘Is this what it was like in ’06?’ ” said David Wright, the only player still on the team from their last postseason run, when the Mets lost in the NLCS to the Cardinals. “People pounding on windows at restaurants, chanting, ‘Let’s go Mets.’ You obviously miss that these last nine years.”\nThough the Mets are enjoying their sudden star turns, they’re trying not to look too far ahead.\n“I’d say a handful more people recognize us on the street,” the newest playoff breakout star, Daniel Murphy, said. “It’s just the city is really excited right now. We still feel there’s a lot of work to do, but this is a lot of fun.”\nMurphy should know, as the only thing that has stopped him from hitting home runs lately are days off, like the one the team had on Saturday, when they worked out at Citi Field. The Mets will travel to Kansas City on Sunday morning and work out there in preparation for Game 1 of the World Series, set for Tuesday.\n“You almost wish we could go right into the World Series, the way he’s swinging,” Wright said of Murphy, the NLCS MVP. “He spends more time in the cage than maybe anyone I’ve ever played with.”\nBut don’t try to get Murphy to explain his recent tear.\n“I’ve seen the ball pretty well the last week or so,” Murphy said.\nWhen asked about this being the postseason when “Daniel Murphy went nuts,” the second baseman disagreed with the notion.\n“I don’t really think of it that way,” Murphy said. “I think this is the postseason the Mets made it to the World Series and get to play a great ball club, the Kansas City Royals.”\nHe doesn’t want to dwell on it much more than that.\n“I think of it as a great team accomplishment with some work to be done,” Murphy said. “You guys [in the media] get to use all the adjectives you want. That’s above my pay grade.”\nThat pay grade is due to change soon when Murphy hits free agency after this season, but in the meantime, he is left to inadequately describe his torrid pace at the plate, with homers in six straight playoff games.\nInstead, he pointed to Jacob deGrom’s 3-0 playoff record, Matt Harvey’s performance in Game 1 of the NLCS and Noah Syndergaard’s pitching as a starter and out of the bullpen.\nThere have been plenty of good examples to choose from — so many that Wright even admitted to being surprised by how well things have gone lately for a team that typically finds ways to struggle.\n“I remember thinking during the Chicago Cubs series, we won the first two games and it was incredible to beat [Jon Lester] and [Jake] Arrieta and then we go to Chicago and score those runs early in [Game 3],” Wright said. “[I thought] ‘This can’t be going like this. Something’s got to happen and I’m waiting for some of those speed bumps which we’ve experienced plenty of the past few years.”\nInstead, they get another trip to the Midwest in the hope of winning four more games.\nShare this: Facebook Twitter Google Whatsapp Email Filed under daniel murphy ,  david wright ,  mlb playoffs ,  new york mets ,  world series", "external_links": [], "published": "2015-10-25T01:43:00.000+02:00", "crawled": "2015-10-25T13:54:50.725+02:00", "highlightTitle": ""}