{"organizations": [], "uuid": "50ad9acdaa8e54f52d20a85f295394539370cb72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "savannahnow.com", "main_image": "http://savannahnow.com/sites/default/files/ajibade_3_1_0_1_5.jpg", "site_section": "http://savannahnow.com/", "section_title": "savannahnow.com | Savannah Georgia's source for News, Entertainment, Sports, Weather, Classifieds, Jobs, Autos, Real Estate and St. Patricks Day", "url": "http://savannahnow.com/news/2015-10-15/jury-deliberations-begin-mathew-ajibade-jail-death-case", "country": "US", "title": "Jury deliberations begin in Mathew Ajibade jail death case", "performance_score": 0, "site": "savannahnow.com", "participants_count": 1, "title_full": "Jury deliberations begin in Mathew Ajibade jail death case | savannahnow.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:31:00.000+03:00", "replies_count": 0, "uuid": "50ad9acdaa8e54f52d20a85f295394539370cb72"}, "author": "Jan Skutch", "url": "http://savannahnow.com/news/2015-10-15/jury-deliberations-begin-mathew-ajibade-jail-death-case", "ord_in_thread": 0, "title": "Jury deliberations begin in Mathew Ajibade jail death case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos Back | Next Back | Next Gregory Brown Back | Next Maxine Evans Back | Next Jason Kenny Related Stories Jury in Mathew Ajibade death case to get case against three defendants today Related Links The full story: Mathew Ajibade case timeline By Jan Skutch A Chatham County Superior Court jury this morning began deliberations in the trial of three former Chatham County jail workers charged in connection with the January death of Mathew Ajibade.\nJudge James F. Bass Jr. instructed the jury on the laws to be applied to the evidence they have heard over the past eight days before sending them the evidence about 10:30 a.m.\nYesterday, during closing arguments, Assistant District Attorney Matt Breedon told jurors that Ajibade deserved better than to be left to die, uncared for, in a restraining chair at the Chatham County jail, and he urged them to convict the three defendants charged in the case.\n“He was left in there to die and no one cared — and that is why we are here,” Breedon argued. “They just didn’t do what they were supposed to do, and that’s why Mathew died.”\nBreedon’s closing arguments were the final word from attorneys in the trial of former deputies Jason Kenny and Maxine Evans and Corizon Health contract nurse Gregory Brown, who are charged in connection with Ajibade’s death late Jan. 1 or early Jan. 2.\nBreedon said Ajibade “was tased multiple times in stress and left in a restraint chair. …It was everything added together that caused the death.\n“It was neglect that caused the death.”\nBut defense attorneys painted a starkly different picture of the evidence — or lack of evidence.\n“Mathew Ajibade didn’t deserve to die that night,” attorney Bobby Phillips, who represents Evans, told jurors. “No one intended for him to die that night. No one. … There’s no excuse for his death.”\nHe argued that Evans never had any role in the initial fight between Ajibade and deputies nor with his being put in restraints.\n“Mathew died because it was a perfect storm of events. … (Evans) was not negligent. … She’s not a criminal. She did not intend any harm to come to Mathew Ajibade.”\nAttorney Willie Yancey II, who represents Kenny, told jurors he saw the case as “an individual riding a stagecoach without a driver.”\nHe said that a string of reckless conduct beginning with Ajibade’s arrest earlier Jan. 1 and a take down by Savannah-Chatham police started the episode that ended in Ajibade’s death at the jail.\nJail officials “were aware there was a problem and didn’t do anything about it,” Yancey said, adding that case was a “civil case that the state wants to make into a criminal case against these individuals.”\nAttorney Tom Withers, who represents Brown, told jurors that Bass had granted an acquittal for Brown in the charge of involuntary manslaughter and that only two charges of falsifying an official document and lying to a Georgia Bureau of Investigation agent remained for them to consider.\nThe case, he said, was a mistake from January, through a June grand jury and into the trial.\n“Even though the state knew they had it wrong, they continued to blindly pursue the case against Gregory Brown,” Withers told jurors.\nSheriff’s “internal affairs got it wrong. The GBI got it wrong. The DA’s office got it wrong.”\nCentral to Brown’s defense is the application of the check every 15 minutes for jail staff for inmates in restraints to the two-hour requirement for medical staff, such as Brown.\n“They’re trying to fit a square peg into a round hole,” Withers argued.\nBut Breedon told jurors, “At some point someone has to stand up and say no.”\nThe case did not involve the 15-minute/two-hour requirement for checking inmates in restraint chairs, but rather with “lies” he attributed to both Brown and Evans on jail logs.\nAjibade “got tased so many times and it was so painful that he just wanted to die.” “She (Evans) never did a thing. Not a thing,” Breedon told the jury. “If she had done her job, we might not be here.\n“At the end of the day … Mathew deserved better.”\nProsecutors contend Ajibade was left in the restraining chair in a holding cell at 11:47 p.m. Jan. 1, then ignored between 12:09 a.m. Jan. 2 and 1:38 a.m. when Evans found him unresponsive.\nBrown, 45, remains in the case on charges of public records fraud and making a false statement to investigators.\nKenny and Evans are on trial for involuntary manslaughter for causing Ajibade’s death “without any intention to do so.” The charge said that Kenny caused the death during the commission of “reckless conduct...without intention to do so by tasing (Ajibade) while he was restrained.”\nEvans is charged with reckless conduct by failing to monitor Ajibade’s status.\nIn addition, both are charged in two separate indictments with committing perjury before the Chatham County grand jury that was hearing the case in what the state contends was part of an attempt to cover up their involvement in the death.", "external_links": ["http://sav-cdn.com/sites/all/themes/whitelabel/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14766969_3_2.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14033157_6.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14033152_5.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/ajibade_3_1_0_1_5.jpg", "http://sav-cdn.com/sites/default/files/imagecache/superphoto/14033152_5.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14033157_6.jpg", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/ajibade_3_1_0_1_5.jpg", "http://sav-cdn.com/sites/all/themes/savannahnow/images/blank.gif", "http://sav-cdn.com/sites/default/files/imagecache/story_slideshow_thumb/14766969_3_2.jpg"], "published": "2015-10-15T18:31:00.000+03:00", "crawled": "2015-10-15T20:48:25.009+03:00", "highlightTitle": ""}