{"organizations": [], "uuid": "ef8988fe135f2e07b808b1bb65c56922388016e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wgem.com", "main_image": "http://WGEM.images.worldnow.com/images/9071956_G.jpg", "site_section": "http://www.wgem.com/category/123718/sports?&clienttype=rss", "section_title": "WGEM - SPORTS", "url": "http://www.wgem.com/story/30322086/2015/10/22/qhs-vs-qnd-motivating-factors-ignite-blue-devils", "country": "US", "title": "QHS vs. QND: Motivating factors ignite Blue Devils", "performance_score": 0, "site": "wgem.com", "participants_count": 1, "title_full": "QHS vs. QND: Motivating factors ignite Blue Devils", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:05:00.000+03:00", "replies_count": 0, "uuid": "ef8988fe135f2e07b808b1bb65c56922388016e2"}, "author": "Ben Marth", "url": "http://www.wgem.com/story/30322086/2015/10/22/qhs-vs-qnd-motivating-factors-ignite-blue-devils", "ord_in_thread": 0, "title": "QHS vs. QND: Motivating factors ignite Blue Devils", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "QHS vs. QND: Motivating factors ignite Blue Devils - WGEM.com: Quincy News, Weather, Sports, and Radio Member Center: QHS vs. QND: Motivating factors ignite Blue Devils Posted: bmarth@wgem.com Quincy High will secure its third straight playoff berth with a win over QND Friday night. \nQUINCY, Ill. (WGEM) -- The countdown to kickoff began last November when QHS and QND agreed to match wits in football.Nearly a year of waiting has been trimmed to hours.And the Quincy High School football team is ready.\"We've been looking at our weekly opponent first. But QND has always been in the back of your mind,\" senior Nathan Ruxlow admitted.Friday's contest is a family affair for QHS senior Blayne Schlueter and he's in need of bragging rights.\"Actually a lot of my family (goes) to Notre Dame. It's kind of split in our family,\" Schlueter said.\"It's great getting to play them and I know the winner is going to have a lot to say.\"Speed is one of the Blue Devils biggest assets. Running backs Cameron and Carson Gay, and fullback Deven Smith, can all get to the edge.Their big-play capability poses the biggest challenge to the QND defense.\"(Speed) will benefit us a lot because you can't tackle what you can't catch,\" Cameron Gay said.\"But the speed wouldn't happen if the (offensive) line didn't do their thing up front and they have all year.\"The Blue Devil defense got gashed up the middle but hung on to beat Galesburg last Friday. It's something head coach Rick Little says has to be corrected in order to beat their crosstown rival.\"Last week statistically we did not play well,\" Little noted. \"But the thing I think I'm proud of about this team is they know how to win.\"There are plenty of motivating factors for Quincy High.A win means they'll secure a playoff spot for the third straight season. It could also be the last time the seniors ever play at Flinn Stadium.\"It definitely makes this game more competitive,\" senior Devin Prost explained.\"For us to get into the playoffs again would be awesome and then to maybe keep (QND) off their home field week one (of the playoffs) would be great too.\"Senior Devin Austin added: \"Winning this game doesn't mean anything if we didn't go to the postseason. The postseason is our number goal going into the season. We want to keep that streak alive.\"Little says it all adds up to a potential epic crosstown showdown.\"They need the game. We need the game. I don't think you would want it any other way,\" he said.\"It's important to both of us and certainly both of us will be striving to get that (win).\" Can't Find Something? 513 Hampshire Quincy, IL 62301 Switchboard: (217) 228-6600", "external_links": [], "published": "2015-10-22T07:05:00.000+03:00", "crawled": "2015-10-22T09:00:25.170+03:00", "highlightTitle": ""}