{"organizations": [], "uuid": "b68fbb6324ae53d144110af1cd0a5515bb16bbde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seacoastonline.com", "main_image": "http://www.seacoastonline.com/storyimage/SO/20151004/SPORTS/151009663/AR/0/AR-151009663.jpg", "site_section": "http://www.seacoastonline.com/sports/professional?template=rss&mime=xml", "section_title": "Pro Sports - seacoastonline.com", "url": "http://www.seacoastonline.com/article/20151004/SPORTS/151009663/101035/SPORTS?rssfeed=true", "country": "US", "title": "Red Sox drop finale; Farrell to return", "performance_score": 0, "site": "seacoastonline.com", "participants_count": 1, "title_full": "Red Sox drop finale; Farrell to return", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:56:00.000+03:00", "replies_count": 0, "uuid": "b68fbb6324ae53d144110af1cd0a5515bb16bbde"}, "author": "Tim Britton Providence Journal", "url": "http://www.seacoastonline.com/article/20151004/SPORTS/151009663/101035/SPORTS?rssfeed=true", "ord_in_thread": 0, "title": "Red Sox drop finale; Farrell to return", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Red Sox drop finale; Farrell to return Comment Posted Oct. 4, 2015 at 9:18 PM Updated at 9:56 PM Posted Oct. 4, 2015 at 9:18 PM Updated at 9:56 PM » Social News CLEVELAND — The Red Sox closed out their season with a disappointing sweep at the hands of the Indians. Cleveland finished it off on Sunday with a 3-1 victory. Boston's offense went cold over the final days of the season. In losing their final four games of the season, the Red Sox scored a total of four runs. Their only tally on Sunday came when Xander Bogaerts and David Ortiz doubled consecutively in the first inning. Ortiz then made the final out of the inning by attempting to steal third. Ortiz finished the year with a .913 OPS, 37 home runs and 108 RBI. Bogaerts closed his breakout campaign with 196 hits, good for second in the American League. \"It definitely would have been a nice accomplishment,\" Bogaerts said of reaching the 200-hit milestone. \"I'm obviously extremely happy with the way my season has been and how we played down the stretch. It's a lot of excitement going into next year.\" Rick Porcello took his 15th loss of the season despite a solid afternoon. Porcello's biggest mistake was an errant pickoff throw to first base in the third inning that assisted two Indians runs. The right-hander went seven innings, allowing three runs (two earned) on 10 hits. He lowered his ERA below 5, finishing the year at 4.92. \"That's me,\" Porcello said of his encouraging final six weeks. \"I'm not going to go out there and strike out 17 and throw no-hitters, but I'll give us a chance to win. I was able to finish strong. Take some positives out of that, learn a little bit and carry that into next year.\" The Red Sox finished the season at 78-84, alone in last place in the American League East for the second straight time and the third time in four years. Boston had not finished last in consecutive seasons since 1929-1930. \"Collectively, we're pushing forward, and everything is looking very bright for a solid 2016,\" interim manager Torey Lovullo said. \"I think we built a lot of this foundation here this year with some young score players. We're ready to move forward in advance to next season.\" nnn The biggest question entering the offseason for the Red Sox has been answered. The team announced on Sunday that John Farrell will return as manager in 2016 \"provided (he is given) a clean bill of health.\" Furthermore, the Red Sox reached an agreement on a two-year contract with Lovullo to return to his role as bench coach. As part of the deal, Lovullo waived his right to pursue managerial vacancies this offseason. The contracts for both Farrell and Lovullo run through 2017, though Farrell's contains an option for 2018. The Red Sox and new president of baseball operations Dave Dombrowski have again voted for continuity. Dombrowski went that route when he promoted Mike Hazen to general manager earlier this month, and he is sticking with a manager he has yet to watch preside over a game since his own hiring in August. \"The reality is, I haven't had a chance to evaluate John at all as a manager,\" Dombrowski said. \"He's managed successfully at the big-league level. It's hard to find established major-league managers that have won. I've talked to a lot of people that I trust. I look forward to working with him. I think he deserves that opportunity.\" \"We were all expecting that and hoping that. We just wanted John to be back to normal,\" said Dustin Pedroia. \"We can't wait to get him back.\" nnn The Red Sox have asked Hanley Ramirez to lose 15 to 20 pounds this offseason in order to be better suited to the infield, Lovullo said Sunday. \"It was outlined in his exit physical that he comes in at a certain weight. That's our expectation,\" Lovullo said. \"We all know when you carry extra weight, it puts more stress on your joints. To be an infielder you have to be a little more agile.\" Lovullo wanted to make it clear that Boston has these year-end conversations with every player about conditioning. That also includes Pablo Sandoval. \"We're keeping an eye on our athletes. We don't just let them go home and do nothing,\" Lovullo said. \"They're on a program they follow and they're expected to follow. It's part of being on the Boston Red Sox. You come to spring training ready to go.\"", "external_links": [], "published": "2015-10-05T05:56:00.000+03:00", "crawled": "2015-10-05T09:36:23.044+03:00", "highlightTitle": ""}