{"organizations": [], "uuid": "07fcb237ecb74fdcfb4b6e72e16329dd9f1b8ae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13537/business-news", "section_title": "Business &amp; economy news - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30150942/whole-foods-to-stop-selling-products-made-by-inmates", "country": "US", "title": "Whole Foods to stop selling products made by inmates", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Whole Foods to stop selling products made by inmates - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "07fcb237ecb74fdcfb4b6e72e16329dd9f1b8ae1"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30150942/whole-foods-to-stop-selling-products-made-by-inmates", "ord_in_thread": 0, "title": "Whole Foods to stop selling products made by inmates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By CANDICE CHOI\nAP Food Industry Writer NEW YORK (AP) - Whole Foods will stop selling products made using a prison labor program after a protest against the practice at one of its stores in Texas.\nThe company said the products should be out of its stores by April 2016, if not sooner. Whole Foods said it has sold tilapia and goat cheese produced through a Colorado inmate program at some stores since at least 2011.\nMichael Allen, a prison reform advocate, said Whole Foods informed him of its change in policy after he organized a protest at one of the company's stores in Houston, this past weekend. Although other companies sell products made by inmates, Allen said he thought it was hypocritical of Whole Foods to do so, given the image it tries to cultivate.\n\"They say they care about the community, but they're enhancing their profit off of poor people,\" Allen said, noting that inmates are often paid meager wages for their work.\nMichael Silverman, a Whole Foods spokesman, said the company had sourced the products because it was a way to \"help people get back on their feet and eventually become contributing members of society.\"\nBut he said the company decided to end the practice because some customers were uncomfortable with it.\nSilverman said the tilapia and cheese in question come through Colorado Correctional Industries, a division of Colorado's department of corrections. On its website, CCI says its mission is to train inmates with skills and work ethics that help them secure employment after release.\nDennis Dunsmoor, director of the program, said it doesn't provide goods directly to Whole Foods, but that its partners do. He declined to provide details on wages or other comments pending approval from the program's media relations coordinator.\nRepresentatives for Haystack Mountain Goat Dairy and Quixotic Farming, which say on their websites that they work with Colorado Correctional Industries, were not immediately available for comment. Haystack sells goat cheese and Quixotic sells tilapia.\nIn its 2014 annual report, Colorado Correctional Industries said it employed more than 1,800 inmates, with the goal of doubling the program over the next decade. It said more than 80 percent of inmates with at least six months experience remain out of jail a year after release, compared with the national average of 62 percent.\nWhole Foods' sourcing of products through inmate labor has been covered in publications including Fortune, Dissent magazine and Vice.\n__\nFollow Candice Choi at www.twitter.com/candicechoi\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-05T17:51:15.750+03:00", "highlightTitle": ""}