{"organizations": [], "uuid": "6b363d6e5dce10c0c3751c7e775114668e6ce770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/ap/c9f7b78f2851436b973063736350f45c.jpg", "site_section": "http://bostonherald.com/sports", "section_title": "Sports | Boston Herald", "url": "http://bostonherald.com/sports/bruins_nhl/nhl_coverage/2015/10/ryan_zibanejad_karlsson_key_senators_past_blue_jackets_7_3", "country": "US", "title": "Ryan, Zibanejad, Karlsson key Senators past Blue Jackets 7-3", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Ryan, Zibanejad, Karlsson key Senators past Blue Jackets 7-3 | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b363d6e5dce10c0c3751c7e775114668e6ce770"}, "author": "Associated Press", "url": "http://bostonherald.com/sports/bruins_nhl/nhl_coverage/2015/10/ryan_zibanejad_karlsson_key_senators_past_blue_jackets_7_3", "ord_in_thread": 0, "title": "Ryan, Zibanejad, Karlsson key Senators past Blue Jackets 7-3", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMBUS, Ohio — Ottawa simplified its offensive approach and the flood gates opened. It helped that Columbus couldn't stop giving the puck away.\nBobby Ryan and Mika Zibanejad each had a goal and two assists, and Erik Karlsson added a career-high four assists as the Senators scored five consecutive goals to roll to a 7-3 victory over the struggling Columbus Blue Jackets on Wednesday night.\nKarlsson said the Senators focused on getting pucks out and into the zones and it made a huge difference.\n\"The puck wasn't really moving all that well out there, it was tough making plays,\" he said. \"Once we got quality scoring chances we beared down and we were good around their net. I think that's won us the game.\"\nKyle Turris had a goal and an assist, and Marc Methot, Milan Michalek, Jean-Gabriel Pageau and Mike Hoffman also scored to help Ottawa improve to 3-0-0 on the road for the first time since 2007-08. Ryan Stone had two assists and Craig Anderson made 37 saves.\nDespite the win, Ottawa coach Dave Cameron still thinks his squad has some things to work on.\n\"We played well in spurts,\" he said. \"We moved our feet, held on to pucks, made good decisions. Then we played in spurts where we were just the opposite. We stopped moving our feet, we didn't compete and Columbus took advantage of it.\"\nBrandon Saad, Boone Jenner and Brandon Dubinsky scored for Columbus and Ryan Johansen had two assists. The Blue Jackets have dropped their first four games in regulation for the first time in the franchise's 15-year history.\nFormer Vezina Trophy winner Sergei Bobrovsky came in with a .850 save percentage and was shaky from the start, finishing with just 21 saves.\n\"We have opportunities to make simple plays and we're forcing pucks into areas where we don't need to do it,\" Columbus coach Todd Richards said. \"It's resulting in turnovers and we're spending more time in our zone.\"\nThe teams seemingly couldn't stop trading goals over the first half of the game until Ottawa bolted ahead, aided by more sloppy defensive play and botched coverage by the Blue Jackets that grew worse as the game wore on.\nTrailing 3-2 midway through the second period, Turris — after a flub clear by Dalton Prout — took a slick pass from Stone behind the net and ripped a shot from in close for his fourth goal of the season — first in 13 games against Columbus.\nAn uncontested Zibanejad put the Senators ahead late in the period, slotting home a feed from Ryan for his first.\n\"Right now the trouble isn't in our offensive zone,\" Richards said.\nOttawa kept it up in the third period. After a turnover in the neutral zone, Pageau grabbed the puck and zipped a shot in full-stride behind Bobrovsky for his second to make it 5-3 just 1:45 into the period. Nick Foligno's turnover trying to clear the lone led to Hoffman's easy score about 7 1/2 minutes later. Ryan scored into an empty net with 4:05 left.\n\"For the most part we did what we had to do,\" Karlsson said.\nColumbus opened the scoring for the first time this season when Saad gave Columbus its first lead since a 74-second stretch late in their season opener. All three of Saad's goals have come on the man advantage.\nThe Blue Jackets' lead didn't last long. Methot tied it about four minutes later on a deflected shot launched from the blue line.\nBut with just over a minute left in the period, Anderson wandered behind his net to play the puck and got stuck in traffic. Jenner grabbed it, curled around and squeezed the puck inside the near post for his first.\nThen on the power play 1:44 into the second period — after the Blue Jackets where whistled for too many men — an unmarked Michalek tied it 2-2 with his second.\nDubinsky scored his first three minutes later to put Columbus ahead again, converting a 2-on-1 with Cam Atkinson.\n\"I thought we traded chances way too much early and gave them some rushes,\" Ryan said.\nNOTES: Ottawa's No.1 goalie Andrew Hammond, who has been sidelined with a groin injury, made his first appearance of the season, suiting up as Anderson's back up. He could make his debut Thursday at Pittsburgh against the 0-3-0 Penguins. ... Saad's three power-play goals ties his career high set with the Blackhawks two seasons ago. ... Ottawa's power play is 4 for 9 on the road. ... Karlsson has seven assists on the season with the other three also coming in one game — a 5-4 shootout win Saturday at Toronto. ... Johansen has registered a point in each of Columbus' first four games. ... The Blue Jackets have been outscored 20-9.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T07:19:05.422+03:00", "highlightTitle": ""}