{"organizations": [], "uuid": "c792c3c6659fb044c1998304c83468a4dd288f84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canindia.com", "main_image": "http://canindia.com/wp-content/uploads/2012/06/01/Avatar.jpg", "site_section": "http://canindia.com/category/sports/feed", "section_title": "CanIndia NEWS » Sports Archive » CanIndia NEWS", "url": "http://www.canindia.com/2015/10/india-hold-kiwis-to-1-1-draw-to-clinch-hockey-test-series/", "country": "US", "title": "India hold Kiwis to 1-1 draw to clinch Hockey Test series", "performance_score": 0, "site": "canindia.com", "participants_count": 1, "title_full": "India hold Kiwis to 1-1 draw to clinch Hockey Test series", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T12:54:00.000+03:00", "replies_count": 0, "uuid": "c792c3c6659fb044c1998304c83468a4dd288f84"}, "author": "NewsWire", "url": "http://www.canindia.com/2015/10/india-hold-kiwis-to-1-1-draw-to-clinch-hockey-test-series/", "ord_in_thread": 0, "title": "India hold Kiwis to 1-1 draw to clinch Hockey Test series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 0 0 0 0 \nChristchurch, Oct.11 (ANI): The Indian men’s hockey team won the four-match Test series 2-1 after playing out a 1-1 draw against New Zealand in Christchurch on Sunday. \nThe first quarter of the game witnessed a series of attacks coming in from the India who dominated the entire session. Without wasting much time, Sardar Singh broke into the hosts defence from the right flank but unluckily his attack was stopped by New Zealand’s Alex Shaw. In the 11th minute India was awarded with a penalty corner but Rupinder Pal Singh’s effort went off the target. New Zealand started putting some pressure on the Indian defence with a long pass from Blair Tarrant and which Nic Woods found himself in a goal scoring position but an alert Indian defence blocked his attack . Dying moments of the first quarter saw Akashdeep Singh get a chance to open the account but his attempt went wide of the post. The score line remained 0-0 as first quarter saw no goals from either side. \nIn the second quarter of the match, the Black Sticks dominated the early part with attack from left side of the pitch which earned them a penalty corner, but PR Sreejesh beautifully saved the ball. This was followed by the India’s counter attack as they broke through the Kiwi defence by an unmarked Dharamvir Singh, who, attempted a scoring chance but unfortunately it was blocked by New Zealand goalkeeper. Going ahead in the half time Akashdeep Singh pierced the New Zealand defence but his attempt was thwarted, which concluded the first half without any goal. \nGoing into the quarter, both the teams tried to find the opening goal but could not find a way through. Finally in the 41st minute, the game saw the first goal of the game coming from the stick of Nick Ross, who collected the pass from Steve Edwards and finished calmly to give New Zealand a 1-0 lead over India. India replied immediately in the 43rd minute with a goal from SV Sunil through a field effort as he successfully opened the Indian account from the left side of the post, which concluded the third quarter at 1-1. \nThe last quarter started with equal zeal as New Zealand got a great chance to take the lead in the early minutes with Simon Child running into the Indian defence but a vigilant Indian defence blocked the attack without any damage. Riding on series of attacks, New Zealand earned a penalty corner in the 54th minute of the match but PR Sreejesh, diving to his left brilliantly saved the ball. As the scores were equaled, India kept the possession in the dying moments of the game and the final game of the tour finished with a score line of 1-1. (ANI) Related Posts", "external_links": [], "published": "2015-10-11T12:54:00.000+03:00", "crawled": "2015-10-11T13:04:40.730+03:00", "highlightTitle": ""}