{"organizations": ["Collins", "Tigers", "Detric Hawthorn"], "uuid": "c384264bb7258d4e3a7ba015fff4bc1cb7fbd02b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hattiesburgamerican.com", "main_image": "http://www.gannett-cdn.com/-mm-/40d78d079b63759ff70a104d574db3d6fc335e6f/c=0-0-3977-2247&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/17/Hattiesburg/B9319306871Z.1_20151017021140_000_G8LC94KP1.1-0.jpg", "site_section": "http://rssfeeds.hattiesburgamerican.com/hattiesburgamerican/sports", "section_title": "Hattiesburg - Sports", "url": "http://www.hattiesburgamerican.com/story/sports/high-school/football/2015/10/17/collins-west-marion-football/74115746/", "country": "US", "title": "Collins claws back to beat West Marion, 38-34", "performance_score": 0, "site": "hattiesburgamerican.com", "participants_count": 0, "title_full": "Collins claws back to beat West Marion, 38-34", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T09:35:00.000+03:00", "replies_count": 0, "uuid": "c384264bb7258d4e3a7ba015fff4bc1cb7fbd02b"}, "author": "", "url": "http://www.hattiesburgamerican.com/story/sports/high-school/football/2015/10/17/collins-west-marion-football/74115746/", "ord_in_thread": 0, "title": "Collins claws back to beat West Marion, 38-34", "locations": ["West Marion", "Eli Baylis/Hattiesburg American"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Collins", "Jason Munz"], "text": "Collins claws back to beat West Marion, 38-34 Jason Munz, Southern Miss Sports Writer 1:35 a.m. CDT October 17, 2015 Buy Photo Collins quarterback Detric Hawthorn runs the ball during the Tigers’ Oct. 16 game against West Marion at Collins. (Photo: Eli Baylis/Hattiesburg American) Buy Photo 165 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE \nCOLLINS — Collins turned the ball over twice against West Marion in Friday’s battle between the top teams in Class 3A. \nThe Tigers were also 0-for-2 on fourth-down conversions, punted the ball away more times than it has all season, drew more than 15 penalty flags and finished the game with eight drops. \nBut Ryan Earnest’s club — the defending 3A State Champions — is nothing if not buoyant. \nCollins rallied from a 14-0 deficit and won 38-34, knocking West Marion out of the two-way tie atop Region 8-3A. The Tigers and Trojans are both 8-1 overall, while the former improves to 3-0 in region play and the latter drops to 2-1. Buy Photo \nWest Marion quarterback Josh Miller searches for an open receiver during the Trojans’ Oct. 16 game against Collins. (Photo: Eli Baylis/Hattiesburg American) \n“This team has been through so much over the course of a year,” Earnest said. “Winning a championship, going through the highs and lows of trying to defend one, losing a teammate (Jabari Goudy in a Hattiesburg shooting) this summer. These guys are so resilient.” \nWest Marion got off to a hot start, especially quarterback Josh Miller and receiver Money Gaddis. The pair hooked up on a 43-yard score with 5:13 left in the first quarter to take an 8-0 lead, then connected again at the 3:49 mark, this time from 34 yards out to go up 14-0. \nThe Trojans threatened to go up by three scores, but on first-and-goal from the Collins 3-yard line, Miller was intercepted in the end zone by Rakerian Forrest. Six plays later, Collins’ Detric Hawthorn hit Calvin Keys with a pass near the line of scrimmage that Keys took 77 yards to the end zone with 11:10 left in the second quarter. A successful 2-point conversion cut the visitors’ lead to 14-8. \nFollowing a three-and-out, the Tigers took a 16-14 lead with 8:24 left in the second quarter when Keys reeled in a 21-yard touchdown pass from Hawthorn. \nWest Marion’s Caleb Batie scored twice in less than 15 seconds late in the second quarter to give the Trojans a 28-16 lead at halftime. Batie’s 5-yard run put Brad Duncan’s squad up 20-16, then Collins fumbled the ensuing kickoff and on the next play, Batie sauntered in from 10 yards out. \nBut with 4:22 left in the third quarter, Collins began its comeback march. Timothy Durr scored on a 3-yard dive and Hawthorn’s 2-point conversion run cut the West Marion lead to 28-24. \n“I just knew we had to keep fighting,” Earnest said. “They came out with the fast start, but I thought if we just kept fighting, we’d give ourselves a chance to win. I knew we’d find a way. This isn’t new to us. We were down 17-6 to Charleston in the state championship game last year and we found a way.” \nAfter recovering a fumble, then forcing the Trojans to turn the ball over on downs, the Tigers took the lead for good on a 51-yard pass play from Hawthorn to Keys at the 7:05 mark in the fourth quarter. Hawthorn’s 1-yard scoring run with 2 minutes left in the game sealed the deal. \nThe play before — a 50-yard strike from Detric Hawthorn to Derric Hawthorn on third-and-12 near midfield — set up Collins’ final score. Earnest said calling a deep ball in a third-and-long situation, up by 4 points with plenty of time left on the clock, boiled down to trust. \n“You just trust your players,” he said. “They’ve come through in those situations many, many times before. I never had any doubt.” \nWest Marion added a score with 50 seconds left in the game — Miller’s third touchdown pass of the game to Gaddis — but it was too little, too late. \n“We talked about it before the game,” Duncan said. “We thought it would be a slugfest and that’s what it turned out to be. Two of the best teams in the South. They got us. We made some mistakes that hurt us and they capitalized on it. That’s what good teams do.” 165 CONNECT 2 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://hatne.ws/1RNLepB TOP VIDEOS", "external_links": [], "published": "2015-10-17T09:35:00.000+03:00", "crawled": "2015-10-18T01:39:06.196+03:00", "highlightTitle": ""}