{"organizations": [], "uuid": "0141ea54707de7e9bf3b4d6654dc2b13a64c5914", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.timesunion.com", "main_image": "http://ww2.hdnux.com/photos/41/31/52/8755853/3/rawImage.jpg", "site_section": "http://timesunion.com//sports/collectionRss/Sports-Block-States-Homepage-48042.php", "section_title": "Sports Block States Homepage", "url": "http://www.timesunion.com/sports/article/Torres-scores-in-65th-minute-Mexico-beats-6557679.php", "country": "US", "title": "Torres scores in 65th minute, Mexico beats Honduras 2-1", "performance_score": 0, "site": "timesunion.com", "participants_count": 1, "title_full": "Torres scores in 65th minute, Mexico beats Honduras 2-1 - Times Union", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T04:02:00.000+03:00", "replies_count": 0, "uuid": "0141ea54707de7e9bf3b4d6654dc2b13a64c5914"}, "author": "timesunion.com", "url": "http://www.timesunion.com/sports/article/Torres-scores-in-65th-minute-Mexico-beats-6557679.php", "ord_in_thread": 0, "title": "Torres scores in 65th minute, Mexico beats Honduras 2-1", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: David Zalubowski, AP Image 1 of / 3   3 Honduras players surround the referee to argue after defender Allans Vargas was given a red card for tripping Mexico forward Marco Bueno during the first half of a CONCACAF Men's Olympic qualifying soccer match Wednesday, Oct. 7, 2015, in Commerce City, Colo.\nPhoto: David Zalubowski, AP Honduras players surround the referee to argue after defender... Image 2 of 3 Mexico midfielder Raul Lopez jumps in the air to celebrate after scoring goal on a penalty kick against Honduras during the first half of a CONCACAF Men's Olympic qualifying soccer match Wednesday, Oct. 7, 2015, in Commerce City, Colo.\nPhoto: David Zalubowski, AP Mexico midfielder Raul Lopez jumps in the air to celebrate after... Image 3 of 3 Mexico midfielder Raul Lopez celebrates after scoring a goal on a penalty kick against Honduras during the first half of a CONCACAF Men's Olympic qualifying soccer match Wednesday, Oct. 7, 2015, in Commerce City, Colo.\nPhoto: David Zalubowski, AP Mexico midfielder Raul Lopez celebrates after scoring a goal on a... Torres scores in 65th minute, Mexico beats Honduras 2-1 1  /  3 Back to Gallery COMMERCE CITY, Colo. (AP) — Erick Torres scored in the 65th minute to help Mexico beat 10-man Honduras 2-1 on Wednesday night and wrap up Group B in the CONCACAF Olympic qualifying tournament.\nDefending Olympic champion Mexico will face Group A runner-up Canada in a semifinal match Saturday in Sandy, Utah, while Honduras will meet the Group A champion United States. The semifinal winners will qualify for the Rio Olympics .\n\"Without a doubt, we've been improving since the very first game,\" Torres said through a translator. \"We still have a lot to improve and all the mistakes we've made, we're planning not to repeat them again. And everything we've done well? Continue to do that to be able to win.\n\"We have a game against Canada now. We're going to go out and win, no matter what.\"\nRaul Lopez also scored for Mexico.\nThe complexion of the game changed in the second minute, when Allans Vargas received a red card for appearing to hit a player in the face on a play and was sent off. Lopez lined a shot past goalkeeper Harold Fonseca .\nHonduras tied it in the 59th minute on a goal from Alberth Elis .\nBut Mexico soon responded, with Torres knocking a right-footed shot past Fonseca. Mexico outshot Honduras by an 8-2 margin.\n\"We executed pretty well,\" Mexico coach Raul Gutierrez said through a translator. \"We have to continue to evolve all phases.\"\nAs far as playing their next opponent, Gutierrez said Canada \"deserves all of our respect.\"", "external_links": [], "published": "2015-10-08T04:02:00.000+03:00", "crawled": "2015-10-08T11:16:27.176+03:00", "highlightTitle": ""}