{"organizations": [], "uuid": "c3904bf550b97d795de2176e3a7c6cccf8abd0d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mid-day.com", "main_image": "http://images.mid-day.com/images/2015/oct/11Akhil-Herwadkar-l.jpg", "site_section": "http://www.mid-day.com/Resources/midday/rss/sports.xml#", "section_title": "sports", "url": "http://www.mid-day.com/articles/ranji-trophy-crucial-to-bowl-out-punjab-at-the-earliest-says-mumbai-skipper-aditya-tare/16599187", "country": "IN", "title": "Ranji Trophy: Crucial to bowl out Punjab at the earliest, says Mumbai skipper Aditya Tare", "performance_score": 0, "site": "mid-day.com", "participants_count": 1, "title_full": "Ranji Trophy: Crucial to bowl out Punjab at the earliest, says Mumbai skipper Aditya Tare - Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "c3904bf550b97d795de2176e3a7c6cccf8abd0d0"}, "author": "Harit N Joshi", "url": "http://www.mid-day.com/articles/ranji-trophy-crucial-to-bowl-out-punjab-at-the-earliest-says-mumbai-skipper-aditya-tare/16599187", "ord_in_thread": 0, "title": "Ranji Trophy: Crucial to bowl out Punjab at the earliest, says Mumbai skipper Aditya Tare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mumbai may have dominated the last three days, but skipper Aditya Tare feels today — the fourth and final day — is going to be the most important day which will add colour to their efforts.\n\n\nAkhil Herwadkar (left) celebrates the wicket of Punjab skipper Yuvraj Singh with Mumbai captain Aditya Tare at Wankhede Stadium on Saturday. Pic/Suresh KK \nMumbai, going for an outright win, put Punjab on the mat by grabbing four wickets for 244 on Saturday as the visitors trail by 171 runs after the hosts scored a mammoth 569 for eight declared, taking a massive lead of 415 on Day Three at the Wankhede Stadium. \"Tomorrow is going to be the most important day of this match. It is crucial that we bowl them out at the earliest,\" said Tare, who scored a brilliant 137 not out.\nHaving bowled out Punjab for a paltry 154 in the first innings, Yuvraj Singh & Co were better in their application in the second innings. The 101-run third wicket partnership between Jiwanjot Singh and Mandeep Singh helped Punjab steady the ship after Shardul Thakur removed opener Manan Vohra (6) caught behind by Tare, and left-arm spinner Harmeet Singh claiming the wicket of Uday Kaul for 20.\nJiwanjot fell nine runs short of his century as he failed to make his ground while stealing the second run, thanks to Harmeet's accurate throw from deep mid-wicket. Punjab skipper Yuvraj received a loud welcome from the crowd, but the senior India player once again disappointed.\nPart time off-spinner Akhil Herwadkar surprised the southpaw, bowling him around his legs. One of Punjab's biggest hopes, Mandeep is batting on 82. Tare expected resistance from Punjab in their second innings, but felt another wicket in the last session would have helped. \"I think we were one wicket short today. Had it been five wickets, it would have been a good day for us,\" he said.\nManan Vohra docked 30% of match fee \nPunjab opener Manan Vohra was on Saturday fined 30 per cent of his match fee after he was found guilty on two counts - abuse of furniture and showing dissent to the umpire. \"He has been fined 20 per cent for damaging a chair after his dismissal in the second innings and 10 per cent for showing dissent to the umpire,\" said a match official.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T09:56:58.920+03:00", "highlightTitle": ""}