{"organizations": [], "uuid": "4255b5186d758ba6c4470253af7f2504114fd583", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56181beb/turbine/ct-five-myths-about-christopher-columbus-20151009", "site_section": "http://www.chicagotribune.com/", "section_title": "Chicago Tribune: Chicago breaking news, sports, business, entertainment, weather and traffic - Chicago Tribune", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-five-myths-about-christopher-columbus-20151009-story.html", "country": "US", "title": "Five myths about Christopher Columbus - Chicago Tribune", "performance_score": 1, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Five myths about Christopher Columbus - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T14:26:00.000+03:00", "replies_count": 0, "uuid": "4255b5186d758ba6c4470253af7f2504114fd583"}, "author": "Kris Lane", "url": "http://www.chicagotribune.com/news/opinion/commentary/ct-five-myths-about-christopher-columbus-20151009-story.html", "ord_in_thread": 0, "title": "Five myths about Christopher Columbus - Chicago Tribune", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As Columbus Day gives way to \"fall break\" and drops off many workers' calendars altogether, it has become easy to overlook a perennial teaching moment. When Christopher Columbus does come up in the media or the classroom, he is usually simply bashed or praised, depending on the viewpoint of the speaker. In either case, he remains more myth than man. Let's revisit some of the biggest misconceptions about the man Monday's federal holiday is named for.\n1. Columbus proved the \"flat Earth\" theory wrong.\nIn an early scene in the 1992 Ridley Scott film \"1492: Conquest of Paradise,\" Columbus, played by Gérard Depardieu, gazes out at the Atlantic Ocean with his son. He tells the boy the world is like the orange he is peeling: round, not flat. In this traditional rendering, Columbus is an enlightened scientific figure, a pre-Galileo surrounded by obscurantists determined to scuttle his plans. We owe this myth to Washington Irving, who Americanized Columbus in a best-selling 1828 biography. Already known for Rip Van Winkle and \"The Legend of Sleepy Hollow,\" Irving was a dedicated Hispanophile who researched Columbus's life and voyages while living in Spain in the 1820s. Despite careful scholarship, Irving peddled the \"all American\" idea that Columbus was a hands-on seafaring man willing to challenge immobile academics who couldn't see past the horizon.\nIn reality, that the Earth is more or less spherical was not news in Columbus's day. The question was size, shape and how much of it was covered by oceans. Columbus would eventually opt for a smaller, pear-shaped world vs. the rounder orange.\nFlorentine mathematician Paolo Toscanelli is credited with inspiring Columbus's voyage, but neither Toscanelli nor Columbus could convince Portugal's court of its feasibility. Spanish cosmographers were similarly unmoved when Columbus met them in 1486, but the Catholic monarchs, Isabella and Ferdinand, were intrigued. They gave Columbus a stipend and kept him on hold. Portugal was pushing east to Asia by rounding Africa. Would Spain be left out? The monarchs granted Columbus another audience in early 1492. In April, an agreement was signed in the shadow of the Alhambra. Columbus was now \"admiral of the ocean sea.\"\nVideo: Debunking Columbus myths Read the story 2. Columbus was Italian.\nThe National Italian American Foundation calls the Columbus Day parade in New York \"the most visible and accessible manifestation of our Italian American Pride,\" and Italian Americans have led efforts to oppose changes to the holiday's focus nationwide.\nBut when Columbus lived, there was no such thing as an Italian; Italy did not exist until 1861. The best evidence suggests that the explorer was born in a village near Genoa, which is part of Italy today. To his deathbed, he proudly claimed Genoa as home. In Columbus's lifetime, Genoa was a fiercely independent republic with its own language, currency and overseas colonies. Its commercial ties to Castile and Aragon, in modern-day Spain, were intimate. Genoese trading colonies in Seville, Barcelona and Lisbon were sizable. Some Genoese who married locally were naturalized Castilian, Catalan or Portuguese subjects.\nThose cozy relationships helped give rise to a crop of Columbus \"birthers.\" Catalan, Majorcan, Ibizan, Portuguese, Greek, Sephardic Jewish, Sardinian, Polish and even Scottish claims have been made by a mix of serious scholars and crackpot theorists. Most historians believe that Columbus was Genoese, but they hesitate to call him \"Italian,\" partly for the reasons stated above, and partly because Columbus left home early and moved around a lot.\n3. Columbus was a successful businessman and a model leader.\nAn early American archetype, Columbus has long served as a model entrepreneur. Columbus Day blog posts and articles have included \"3 Business Lessons Learned from Christopher Columbus\" and \"5 Lessons in Leadership Effectiveness from Christopher Columbus.\" These inspirational essays boil down to memorable bullet points such as: \"Find an opportunity where the wind is at your back.\" One asks, \"Do you have a Columbus in your company?\"\nBy all accounts, Columbus was a confident risk-taker who knew from hot commodities. He sailed the West African coast seeking gold in the early 1480s, then moved on to the sugar of the Madeiras, where he married a Portuguese noblewoman, Filipa de Perestrello. Columbus also knew the North Atlantic's cod fisheries, but there was no romance in fish. He wanted the spices of Asia, lovingly described by Marco Polo.\nHad Columbus reached Asia, perhaps he'd have proved a keen entrepreneur. As it happened, he landed on Caribbean shores, in a densely populated region that was economically impenetrable for an Old World trader. Some gold was available, but it was not used as currency. Captives could be had, but they weren't sold in open markets. Columbus presumed soon after landing that he could make friends and trade for gold and slaves following Portuguese \"best practices\" in West Africa, yet with a few exceptions, there was no market economy in the Americas to match those of the Old World.\nFailing to understand this, Columbus quickly made managerial mistakes, some fatal. He planted a colony on the north shore of Haiti and named it La Navidad. When he returned on his second voyage, everyone at \"Christmas town\" was dead. Columbus launched another settlement, named La Isabela for his royal patron, that met much the same fate.\nArchaeologists have found that La Isabela was constructed like a hybrid Genoese-Portuguese trading post of the sort found in the Mediterranean and Atlantic Africa. It was intended to survive by trade rather than self-sufficiency, prompting inhabitants to engage in suicidal raids on neighboring indigenous villages. Columbus's misunderstanding of local economies and his failure to adapt to local conditions cost not only Spanish lives but also countless indigenous ones.\n4. Columbus committed genocide.\nOn Columbus Day in 1989, the late Native American activist Russell Means led an American Indian Movement protest, pouring buckets of fake blood over the Columbus statue in downtown Denver while Italian Americans paraded in the streets. (Columbus Day was inaugurated in Denver in 1907.) The city's parades were canceled for a decade. AIM activists are not alone in charging Columbus with mass murder, and in recent years several cities and states have instead started celebrating \"Indigenous People's Day\" or \"Native American Day.\"\nBut if we judge Columbus on what we know from the historical record, is that the right charge? He definitely saw profit in enslaving and selling native peoples kidnapped from Caribbean shores. Once he made allies among what he called \"good Indians,\" Columbus advocated fighting and enslaving native groups he presumed to be cannibals. By 1500, he and his brothers had sent nearly 1,500 enslaved islanders to European markets to be sold. Even \"friendly\" indigenous peoples were forced to mine gold en masse, speeding death from malnourishment, overwork and disease.\nColumbus was clearly no friend of native peoples, but a document discovered 10 years ago in Simancas, Spain, suggests he was an equal-opportunity tyrant. Witnesses testified that his brief government of Hispaniola was marked by routine cruelty not only to the native Taínos but also to Spaniards who defied or mocked him. A woman who reminded Columbus that he was the son of a weaver had her tongue cut out. Others were executed for minor crimes.\nColonialism is never pretty, and in his treatment of native peoples, Columbus was following Spanish and Portuguese trading and slaving practices. We may charge him with genocide by negligence (if there is such a thing), but it is harder to prove intention. Columbus wanted live and multiplying subjects to tax and govern. He was not interested in depopulating newly acquired territories.\nWas Columbus an active protector of Native Americans? No. Did he wish to eliminate them? No. Did genocide directly result from his decrees and his family's commercial aims? Yes.\n5. Columbus believed he had discovered America.\nFor decades, U.S. schoolchildren learned that in \"fourteen hundred and ninety-two, Columbus sailed the ocean blue\" on his way to \"discovering\" the New World. By the 1992 quincentennial, though, new academic scholarship had begun to seep into elementary and secondary history lessons. Today, few people claim that Columbus was the first European to sail to the Americas. Evidence for medieval Norse voyages and colonization is overwhelming.\nWhat did Columbus himself think he was doing, though? He never believed he had landed somewhere that Europeans weren't otherwise aware of, and thus America was named for another navigator, the Florentine Amerigo Vespucci, who recognized the \"newness\" of South America. Columbus thought he was discovering some parts of Asia not described by Marco Polo or other Western authorities. He also believed he had found a new maritime route to the East Indies that would circumvent Muslim-controlled land routes and waterways.\nAs Nicolás Wey-Gómez has recently shown, sailing south to the tropics was perhaps Columbus's main innovation, since he wanted to reach the Spice Islands first. From there, he could travel to China from a safe commercial base - the fortified trading post he had tried to establish on Hispaniola. Columbus's geographical stubbornness seems strange today, but he was hardly alone in refusing to believe that he had stumbled onto continents that were unknown to contemporary authorities. The fact of an entirely new world inhabited by many millions of previously unknown people was simply too much for most educated Europeans to grasp.\nIf Columbus did discover something, it was the true extent of the North Atlantic trade wind circuit. Portuguese mariners had already observed this wind-and-current system, but Columbus went much further, proving over his four voyages that transatlantic sea travel in the age of sail was far more certain than anyone had imagined.\nFor true discovery, we must go back at least 13,000 to 14,000 years before Columbus. Recent research confirms that the first humans to reach the Americas migrated from northeast Asia to North America via a temporary isthmus or by short island hops in the Bering Strait and along the Alaskan and British Columbian coasts. In several waves, these earliest Americans made their way south and east, rapidly settling and altering two vast continents and numerous islands.\nFor Native Americans, Columbus's fateful arrival prompted 523 years of resistance. Whether we call it Columbus Day or Indigenous People's Day, Oct. 12 merits reflection. No matter what he thought he was doing, Columbus rocked our world.\nLane holds the France V. Scholes chair in colonial Latin American history at Tulane University.\n Tulane University", "external_links": ["http://www.niaf.org/culture/march-with-niaf-in-the-columbus-day-parade-in-nyc/", "http://www.trbimg.com/img-56181beb/turbine/ct-five-myths-about-christopher-columbus-20151009", "http://www.trbimg.com/img-56181a73/turbine/ct-video-debunking-columbus-myths-20151009", "http://blog.seattlepi.com/seattlepolitics/2014/10/08/italian-americans-plan-push-back-on-dumping-of-columbus-day/", "http://www.youtube.com/watch?v=aLAnlt_DF4Y"], "published": "2015-10-11T14:26:00.000+03:00", "crawled": "2015-10-11T15:29:39.354+03:00", "highlightTitle": ""}