{"organizations": [], "uuid": "9ac05ae7143b90ccc74765e095d9d16d4b77ea12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/23/19031471-large.jpg", "site_section": "http://www.oregonlive.com/", "section_title": "Oregon Local News, Breaking News, Sports &amp; Weather - OregonLive.com", "url": "http://www.oregonlive.com/today/index.ssf/2015/10/hurricane_patricia_aims_for_me.html", "country": "US", "title": "Hurricane Patricia aims for Mexican coast; Western Hemisphere's strongest storm ever", "performance_score": 0, "site": "oregonlive.com", "participants_count": 5, "title_full": "Hurricane Patricia aims for Mexican coast; Western Hemisphere's strongest storm ever | OregonLive.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:15:00.000+03:00", "replies_count": 4, "uuid": "9ac05ae7143b90ccc74765e095d9d16d4b77ea12"}, "author": "The Associated Press", "url": "http://www.oregonlive.com/today/index.ssf/2015/10/hurricane_patricia_aims_for_me.html", "ord_in_thread": 0, "title": "Hurricane Patricia aims for Mexican coast; Western Hemisphere's strongest storm ever", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PUERTO VALLARTA, Mexico — Hurricane Patricia headed toward southwestern Mexico Friday as a monster Category 5 storm, the strongest ever in the Western Hemisphere that forecasters said could make a \"potentially catastrophic landfall\" later in the day.\nResidents of a stretch of Mexico's Pacific Coast dotted with resorts and fishing villages on Thursday had already boarded up homes and bought supplies ahead of Patricia's arrival. Some evacuations were reported in Puerto Vallarta, but few people were seen going to the shelters.\nWith maximum sustained winds near 200 mph (325 kph), Patricia is the strongest storm ever recorded in the eastern Pacific or in the Atlantic, said Dave Roberts, a hurricane specialist at the U.S. National Hurricane Center.\nPatricia's power was comparable to that of Typhoon Haiyan, which left more than 7,300 dead or missing in the Philippines two years ago, according to the U.N.'s World Meteorological Organization. More than 4 million people were displaced and over 1 million houses were destroyed or damaged in 44 provinces in the central Visayas region, a large cluster of islands.\nIn Mexico, officials declared a state of emergency in dozens of municipalities in Colima, Nayarit and Jalisco states that contain the bustling port of Manzanillo and the posh resort of Puerto Vallarta. The governor of Colima state ordered schools closed on Friday, when the storm was forecast to make what the Hurricane Center called a \"potentially catastrophic landfall.\"\nAccording to the 2010 census, there were more than 7.3 million inhabitants in Jalisco state and more than 255,000 in Puerto Vallarta municipality. There were more than 650,000 in Colima state, and more than 161,000 in Manzanillo.\nEvacuations were under way in Puerto Vallarta Friday, with officials taking people to 14 shelters, mostly in schools, according to the Jalisco government's webpage. Exact numbers of those evacuated were not immediately available, and few people were seen going to them.\nInterior Minister Miguel Angel Osorio told Mexico's Radio Formula Friday morning that officials are especially worried about the safety of people in the tourist resort of Puerto Vallarta, in Jalisco state, and in the nearby community of Bahia de Banderas, in Nayarit state.\n\"We need people to understand the magnitude of the hurricane, it is a devastating hurricane, the biggest one ever registered,\" he said.\nOsorio added that the government had deployed soldiers and federal police agents to help out, but has provided no numbers.\nRoberto Ramirez, the director of Mexico's National Water Commission, which includes the nation's meteorological service, said that Hurricane Patricia will be powerful enough to lift up automobiles, destroy homes that are not sturdily built with cement and steel and will be able to drag along people caught outside when the storm strikes.\nRamirez said that the people in the most danger from the hurricane will be those on the coast, especially in the state of Jalisco.\nThe lobby of the Sheraton Hotel in Puerto Vallarta was bustling Friday morning, with a long line of people forming to check out. More than 900 guests had rooms at the hotel the previous evening, but many wanted to get out of town before the storm arrived.\nSandra Rojas and her husband, a veterinarian from San Jose, Costa Rica, were among those trying to leave. After loading their cars, they were going to drive to the Jalisco state capital of Guadalajara to plan their next move.\nThe hotel is saying that nothing is going to happen,\" said Rojas. \"But it's nature. Anything can happen.\nIn Puerto Vallarta on Thursday, restaurants and stores taped or boarded-up windows, and residents raced to stores for last-minute purchases ahead of the storm.\nThe Hurricane Center in Miami warned that preparations should be rushed to completion, saying the storm could cause coastal flooding, destructive waves and flash floods.\n\"This is an extremely dangerous, potentially catastrophic hurricane,\" center meteorologist Dennis Feltgen said.\nFeltgen said Patricia also poses problems for Texas. Forecast models indicate that after the storm breaks up over land, remnants of its tropical moisture will likely combine with and contribute to heavy rainfall that is already soaking Texas independently of the hurricane, he said.\n\"It's only going to make a bad situation worse,\" he said.\nThe National Weather Service said a flash flood watch would be in effect through Sunday morning for Dallas Fort-Worth, Austin and San Antonio, Texas.\nA coastal food warning was in effect through Friday night in Corpus Christi. Galveston was under a coastal flood advisory until Saturday night.\nBy early Friday, Patricia's maximum sustained winds had increased to 200 mph (325 kph) — a Category 5 storm, the highest designation on the Saffir-Simpson scale used to quantify a hurricane's wind strength.\nPatricia was centered about 145 miles (235 kilometers) southwest of the Pacific resort of Manzanillo early Friday and was moving northwest at 12 mph (19 kph) on a projected track to come ashore between Manzanillo and Puerto Vallarta sometime Friday afternoon or evening.\nSome fluctuations in intensity were forecast before then, but the Hurricane Center said it was expected to be an \"extremely dangerous\" Category 5 storm when it made landfall.\nA hurricane warning was in effect for the Mexican coast from San Blas to Punta San Telmo, a stretch that includes Manzanillo and Puerto Vallarta. A broader area was under hurricane watch, tropical storm warning or tropical storm watch.\nThe Hurricane Center said Patricia was expected to bring rainfall of 6 to 12 inches, with isolated amounts of up to 20 inches in some locations. Tropical storm conditions were expected to reach land late Thursday or early Friday, complicating any remaining preparation work at that point.\n\"We are calm,\" said Gabriel Lopez, a worker at Las Hadas Hotel in Manzanillo. \"We don't know what direction (the storm) will take, but apparently it's headed this way. ... If there is an emergency we will take care of the people. There are rooms that are not exposed to wind or glass.\"\n-- The Associated Press", "external_links": [], "published": "2015-10-23T15:15:00.000+03:00", "crawled": "2015-10-23T20:06:59.525+03:00", "highlightTitle": ""}