{"organizations": [], "uuid": "da7e63528f69b8c991750d8bedfda02deadb1464", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/a054f3b685095a2f2383d7decec2e8e8.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/rugby/dai-young-tells-his-wasps-players-to-get-nasty-against-bath/6976791/", "country": "JE", "title": "Dai Young tells his Wasps players to get nasty against Bath", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "Dai Young tells his Wasps players to get nasty against Bath", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:01:00.000+03:00", "replies_count": 0, "uuid": "da7e63528f69b8c991750d8bedfda02deadb1464"}, "author": "", "url": "http://www.sport.co.uk/rugby/dai-young-tells-his-wasps-players-to-get-nasty-against-bath/6976791/", "ord_in_thread": 0, "title": "Dai Young tells his Wasps players to get nasty against Bath", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bath Dai Young", "Dai Young"], "text": "Dai Young tells his Wasps players to get nasty against Bath 23 Oct 2015 12:01:55 \ncomments \nWasps director of rugby Dai Young has told his players they need to get nastier if they want to beat Bath in the Aviva Premiership on Saturday. \nYoung's side were edged out 26-21 in their opening match of the season at Harlequins last weekend and can expect an even sterner test from Bath, who reached the Premiership final in May before losing to Saracens. \nWasps narrowly missed out on the top four and a place in the knock-outs last season and Young wants his side to be meaner in pursuit of a higher finish this time around. \n\"We didn't feel we clicked at all really against Harlequins,\" Young told the club's official website. \n\"We never really got going in attack, we played lateral without getting much width. \n\"We didn't stretch Quins' defence enough, we didn't give our talented runners enough space. We need to stretch them but we need to play with more penetration. \n\"And in defence we need to have a bit more bite in us. \n\"We've been giving away too many points - we're averaging over 20 points a game. If we can be a bit meaner, we'll put less pressure on our attack.\" \nBath visit the Ricoh Arena on the back of an opening day victory over Exeter, who will be looking to respond when they host London Irish. \nThe Chiefs were pipped to fourth place on points difference by Saracens last season and have lost only one of their last 10 league matches at Sandy Park. \n\"If you're not on your game from minute one against sides like London Irish then you'll find yourself struggling to win the game,\" Exeter's Phil Dollman told exeterchiefs.co.uk. \n\"They've got dangers across the park and offer something different to Bath last week, so we've got to adjust our gameplan. \n\"We'll need to make sure we're doing the right things attackingly and defensively so we can be dominant from the word go.\" \nThe day's other game sees Northampton host Newcastle, with Saints eager to bounce back after a surprise opening defeat to newly-promoted Worcester. \nNewcastle are also looking to get off the mark after losing at home to Gloucester seven days ago and Falcons centre Adam Powell believes both sides will be desperate for a win this weekend. \n\"I think on the back of last week, everyone is desperate to get out on the pitch and to put some things right,\" Powell told the official club website. \n\"I think that's a good thing taking into the Premiership, every week is a new game and you have to get your head around what happened the previous week and get your head around it. \n\"It's early days and we just want to get out there and play as well as we can play and try and get the win. Northampton will be the same.\" Related Sport News", "external_links": [], "published": "2015-10-23T15:01:00.000+03:00", "crawled": "2015-10-23T20:11:56.325+03:00", "highlightTitle": ""}