{"organizations": ["VA News", "Falcon Club Play", "Falcon Club"], "uuid": "3a249a0feee6e79c0c3dfd39922b5a4a4a97242c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbc29.com", "main_image": "http://wvir.images.worldnow.com/images/8968311_G.jpg", "site_section": "http://www.nbc29.com/Global/category.asp?C=85724&clienttype=rss", "section_title": "NBC 29 News - Local Sports", "url": "http://www.nbc29.com/story/30211219/stabs-jalen-harrison-switching-to-quarterback-falcon-club-player-of-the-week", "country": "US", "title": "STAB's Jalen Harrison Switching to Quarterback; Falcon Club Player of the Week", "performance_score": 0, "site": "nbc29.com", "participants_count": 0, "title_full": "STAB's Jalen Harrison Switching to Quarterback; Falcon Club Player of the Week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T02:06:00.000+03:00", "replies_count": 0, "uuid": "3a249a0feee6e79c0c3dfd39922b5a4a4a97242c"}, "author": "", "url": "http://www.nbc29.com/story/30211219/stabs-jalen-harrison-switching-to-quarterback-falcon-club-player-of-the-week", "ord_in_thread": 0, "title": "STAB's Jalen Harrison Switching to Quarterback; Falcon Club Player of the Week", "locations": ["Charlottesville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jalen Harrison"], "text": "STAB's Jalen Harrison Switching to Quarterback; Falcon Club Play - NBC29 WVIR Charlottesville, VA News, Sports and Weather Member Center: STAB's Jalen Harrison Switching to Quarterback; Falcon Club Player of the Week Posted: STAB Quarterback Jalen Harrison is the Falcon Club Player of the Week \nSt. Anne's Belfield's Jalen Harrison has been voted the Falcon Club Player of the Week. \nHarrison, an All-State wide receiver, made the switch to quarterback for STAB's game Thursday against Nansemond Suffolk. \nSTAB coach John Blake says, \"Its been something we've been toying with and he's been after me for a year trying to do it, and I always teased him if he could figure out how to catch it when he throws it, then we'd move him.\" \nHarrison accounted for six touchdowns in STAB's 41-24 win over Nansemond Suffolk, four passing and two rushing, earning player of the week honors. \nHarrison says, \"I really wasn't expecting this because I was really nervous coming in and playing quarterback but form now on I know I have my teammates help. They probably had more confidence in me than I had in myself.\" \nHarrison who's 6-foot-4, 215 pounds, ran for a whopping 230 yards in the win. He had 185 passing yards. \nBlake says, \"He's such a great athlete, if he gets in the open field he can just outrun you. As athletic as he is and as smart as he is, he's got a great IQ for football, he's what we're looking for.\" \nFootball is a hobby for Harrison. His future lies in baseball, where he's committed to play at Virginia for coach Brian O'Connor. \nHarrison says, \"I'm really excited and blessed to be able to play at the University of Virginia. it's the best program in the country and I'm just blessed to have that opportunity.\" \nAs far as football goes, Harrison's switch to quarterback is a permanent move. \nWe're looking forward to getting back to where we were last year, state championship, and hoping to win it this year with our speed and our power as well as our passing game.STAB now has a record of 3-2 and plays host to North Cross Friday night at 7pm. STAB's Jalen Harrison Switching to Quarterback; Falcon Club Player of the Week More>>", "external_links": [], "published": "2015-10-08T02:06:00.000+03:00", "crawled": "2015-10-08T04:16:36.502+03:00", "highlightTitle": ""}