{"organizations": [], "uuid": "adc58dd56c3e0bc63b1a48049f80336ed2316dcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/nba", "section_title": "NBA News, Scores, Schedule, Standings, Stats, Photos, Videos - Basketball - MSN Sports", "url": "http://www.msn.com/en-us/sports/nba/parker-comments-on-finishing-career-with-spurs/ar-AAfjzu9", "country": "US", "title": "Parker Comments on Finishing Career with Spurs", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Parker Comments on Finishing Career with Spurs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "adc58dd56c3e0bc63b1a48049f80336ed2316dcd"}, "author": "Adam Wells", "url": "http://www.msn.com/en-us/sports/nba/parker-comments-on-finishing-career-with-spurs/ar-AAfjzu9", "ord_in_thread": 0, "title": "Parker Comments on Finishing Career with Spurs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Parker Comments on Finishing Career with Spurs Bleacher Report 2 days ago Adam Wells © Soobum Im-USA TODAY Sports Spurs guard Tony Parker plans to play 20 NBA seasons; the 2015-16 season will be his 15th. San Antonio Spurs point guard Tony Parker has already had a fantastic 14-year career, but the future Hall of Famer doesn't have plans to hang up his basketball shoes anytime soon.\nAdChoices Speaking to Marc J. Spears of Yahoo Sports, Parker stated that he would like to play six more seasons with the Spurs.\n\"The Spurs know I want to play until I'm 38,\" Parker said. \"That will be 20 seasons for me. That's my goal. This year is No. 15. And if I'm lucky enough and I'm healthy, hopefully I can play 20 seasons, and then I'll be ready to retire.\"\nParker also acknowledged that it would be special to join the likes of David Robinson as spending his entire career in San Antonio.\nBut Parker has started to show signs of slowing down. He hasn't hit the 70-game mark in a season since 2010-11, and his performance has been on the decline each of the past two seasons.\nAfter shooting 52.2 percent from the field in 2012-13, Parker dropped to 49.9 in 2013-14 and 48.6 last year. His scoring average also went from 20.3 points per game two years ago to 16.7 in 2013-14 and 14.4 in 2014-15, his lowest total since his rookie season in 2001-02.\nParker also told Spears that he is confident in his body.\nLast year was the first year in my whole career where I had a lot of nagging injuries. When I compare to all the other guys, when you look at D-Rose [Derrick Rose], [Paul] George and Wesley Matthews, I feel very lucky and blessed that I have been able with my little body to play all those years .\nSpears noted that Parker shot just 34.3 percent from the field for France during the FIBA EuroBasket tournament this summer. The six-time All-Star said he wasn't \"in a good rhythm\" in part due to the coach sitting him during preliminary rounds \"because of my age.\"\nTo help combat some of the natural wear and tear that comes with playing for so long, Parker told Spears one thing he did to prepare for next season was get in touch with two-time NBA MVP Steve Nash.\n\"Everybody is different and does different stuff that works for them,\" Parker said. \"But because he was a point guard like me with a great example of longevity who was still great at 38, an All-Star at 38, what did he do to make sure his body was ready?\n\"The main thing I learned is to do the routine every day.\"\nEven though Parker's numbers declined each of the last two seasons, a point guard who shoots nearly 49 percent overall and nearly 43 percent from three-point range is still valuable. He needs to be more consistent, but the Spurs are so deep that Parker needs only to maintain that level of performance for them to be great.\nHead coach Gregg Popovich always seems to get the most out of his roster, too, even when aging veterans like Parker, Tim Duncan and Manu Ginobili need time off. A\nAfter adding LaMarcus Aldridge and David West this offseason, San Antonio vaulted from first-round playoff loser to one of the most dangerous teams in the NBA.\nA healthy, focused and rejuvenated Parker will only make the Spurs more potent as they seek their sixth championship since 1999.\nGo to MSN Home", "external_links": ["http://sports.yahoo.com/news/tony-parker--i-want-to-play-20-seasons-with-the-spurs-061832700.html", "http://bleacherreport.com/", "http://bleacherreport.com/david-west", "http://bleacherreport.com/san-antonio-spurs", "http://bleacherreport.com/tony-parker", "http://bleacherreport.com/lamarcus-aldridge", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-13T10:43:06.817+03:00", "highlightTitle": ""}