{"organizations": ["Dodgers", "Mets"], "uuid": "71cb5b6ea1d17766dbb714a7b0099d85456c9fce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/08/f6/0b/db1b4a6d8e1b4676919a8bcea2246290-a5ec410193ef43df9c570a00a5eed098-0.jpg", "site_section": "http://www.palmbeachpost.com/feeds/categories/sports/", "section_title": "News | Sports", "url": "http://www.palmbeachpost.com/ap/ap/sports/kershaw-dodgers-facing-different-mets-in-playoffs/nnyJ5/", "country": "US", "title": "Kershaw, Dodgers facing different Mets in playoffs", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 0, "title_full": "Kershaw, Dodgers facing different Mets in playoffs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:26:00.000+03:00", "replies_count": 0, "uuid": "71cb5b6ea1d17766dbb714a7b0099d85456c9fce"}, "author": "", "url": "http://www.palmbeachpost.com/ap/ap/sports/kershaw-dodgers-facing-different-mets-in-playoffs/nnyJ5/", "ord_in_thread": 0, "title": "Kershaw, Dodgers facing different Mets in playoffs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kershaw"], "text": "Kershaw, Dodgers facing different Mets in playoffs 7:27 p.m. Thursday, Oct. 8, 2015 | Filed in: Sports Comments 0 ﻿ \nClayton Kershaw isn't sure what to expect from the new-look Mets, whose dramatic transformation in the second half of the season led to an NL East title. \nThe Los Angeles Dodgers ace faced a mostly different New York lineup before the July trade deadline. Even veteran Mets infielder David Wright was out at the time. Los Angeles Dodgers starting pitcher Clayton Kershaw watches during batting practice for the National League Division Series that is set to begin on Friday between the Los Angeles Dodgers and the New York Mets, Thursday, Oct. 8, 2015 in Los Angeles. (AP Photo/Chris Carlson) \n\"There's a lot of guys that I'll be seeing for the first time this season,\" Kershaw said Thursday. \"Definitely a completely different team. Obviously, a lot better than what we faced in July.\" \nThe Dodgers aren't the same team that got chased out of the Division Series by St. Louis a year ago. They shipped out Matt Kemp, Hanley Ramirez and Juan Uribe (now a Met), and ushered in veterans Jimmy Rollins, Howie Kendrick and Yasmani Grandal. \nWhen Kershaw takes the mound for Friday night's opener at Dodger Stadium, he'll be trying to earn just the second postseason win of his career after going 0-4 in his last two series against the Cardinals. Los Angeles Dodgers right fielder Yasiel Puig throws during workouts for the National League Division Series between the Los Angeles Dodgers and the New York Mets that is set to begin on Friday, Thursday, Oct. 8, 2015 in Los Angeles. (AP Photo/Chris Carlson) \n\"I definitely remember,\" he said, \"but it's a new team, new season and, hopefully, for me a new outcome.\" \nThe Mets won four of seven meetings between the teams, all in that month before Yoenis Cespedes arrived from Detroit in a trade that boosted the Mets' anemic offense. They are in the playoffs for the first time in nine years; the Dodgers are making their third straight appearance for the first time in franchise history. \nKelly Johnson and Uribe joined the Mets shortly after Cespedes, acquisitions manager Terry Collins credited for turning around the team along with the his message to the players: If you hit, you'll play. Los Angeles Dodgers manager Don Mattingly watches during batting practice in preparation for the National League Division Series that is set to begin on Friday against the New York Mets, Thursday, Oct. 8, 2015 in Los Angeles. (AP Photo/Chris Carlson) \n\"Lucas Duda took off, (Wilmer) Flores took off, Kelly Johnson and Juan kept playing, as well,\" Collins said. \"All of a sudden guys are looking at their jobs saying, 'Oh my gosh, I've got to step up here, and they did.'\" \nKershaw will be opposed by Jacob deGrom, last year's NL Rookie of the Year and a converted infielder who is making his playoffs debut. The right-hander isn't about to compare himself to Kershaw, last year's NL MVP and a three-time Cy Young Award winner, except in one area. \n\"The way he takes the mound, he goes out there and attacks hitters,\" deGrom said. \"I try to do the same thing, not get intimidated by anybody who steps in the box and go out there and make your pitches when you need to.\" Los Angeles Dodgers manager Don Mattingly watches during batting practice in preparation for the National League Division Series against the New York Mets that is set to begin on Friday, Thursday, Oct. 8, 2015 in Los Angeles. (AP Photo/Chris Carlson) \nKershaw chatted with deGrom at the All-Star Game in July, already aware of deGrom's explosive fastball. \n\"Just the carry and the ride that it has on it, the ball that looks like it's at your shins or ankles seems like he gets a lot of called strikes there,\" Kershaw said. \"His off-speed pitches have gotten better from last year. We definitely have a challenge. This whole series, the three, four guys they're throwing at us are pretty solid.\" \nThe teams split the four regular-season games started by Kershaw and Zack Greinke, who will take the mound for the Dodgers in Game 2 on Saturday. New York Mets starting pitcher Jacob deGrom warms up during workouts in preparation for the National League Division Series against the Los Angeles Dodgers that is set to begin on Friday, Thursday, Oct. 8, 2015, in Los Angeles. (AP Photo/Chris Carlson) \nDeGrom's path to the majors took several twists and turns, starting with him becoming a pitcher in his junior year at Stetson University. He was drafted ninth by the Mets in 2010 and missed his first minor-league season the next year after undergoing Tommy John surgery. DeGrom didn't make it to the big leagues until last year. \n\"All of us are thankful every day we get to put this uniform on and we play this game,\" he said, \"so try not to take any days for granted.\" \nAlready the oldest manager in the majors at 66, Collins is making his managerial playoff debut with the Mets after previous managing stints in Houston and with the Los Angeles Angels. He was director of playoff development for the Dodgers in 2006 when they drafted Kershaw, who began in the Gulf Coast League. New York Mets starting pitcher Jacob deGrom, left, greets third baseman David Wright during batting practice in preparation for the National League Division Series against the Los Angeles Dodgers that is set to begin on Friday, Thursday, Oct. 8, 2015, in Los Angeles. (AP Photo/Chris Carlson) \nCurrent Dodgers pitching coach Rick Honeycutt was Collins' minor league pitching coordinator then and approached him after watching Kershaw throw. \n\"He went, 'Oh wow,'\" Collins said. \n\"When he takes the ball he wants to finish what he starts,\" Collins said of Kershaw. \"I'm not surprised he's as good as he is.\" New York Mets manager Terry Collins talks with the media in Los Angeles, Thursday, Oct. 8, 2015, before workouts in preparation for the National League Division Series against the Los Angeles Dodgers. The series is set to begin on Friday. (AP Photo/Chris Carlson) \nCollins plans to start three left-handed hitters against Kershaw: Curtis Granderson, Daniel Murphy and Lucas Duda, who reminded his manager of his ability to hit against lefties. \n\"I told him the other day, 'Remember when you told me you hit lefties?'\" Collins said. \"Well, you're going to face a pretty good one Friday, so you better.\" \nNOTES: Mets LHP Steven Matz, who has been bothered by back stiffness, threw approximately 90 pitches in a simulated game in Port St. Lucie, Florida. If he is put on the Division Series roster Friday, he likely would start Game 4. New York Mets center fielder Yoenis Cespedes poses with his caricature after a workout in preparation for the National League Division Series against the Los Angeles Dodgers that is set to begin on Friday, Thursday, Oct. 8, 2015, in Los Angeles. (AP Photo/Chris Carlson)", "external_links": [], "published": "2015-10-09T02:26:00.000+03:00", "crawled": "2015-10-09T05:40:45.367+03:00", "highlightTitle": ""}