{"organizations": [], "uuid": "8acb517f8d12914d451df40c11fad96f22e30c77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "westhawaiitoday.com", "main_image": "http://westhawaiitoday.com/sites/westhawaiitoday.com/files/field/image/2348625_web1_IMG_1865.jpg", "site_section": "http://westhawaiitoday.com/taxonomy/term/15/feed", "section_title": "Local Sports", "url": "http://westhawaiitoday.com/sports/local-sports/biif-football-kealakehe-dominates-keaau-heads-back-title-game", "country": "US", "title": "BIIF Football: Kealakehe dominates Keaau, heads back to title game", "performance_score": 0, "site": "westhawaiitoday.com", "participants_count": 1, "title_full": "BIIF Football: Kealakehe dominates Keaau, heads back to title game", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T14:30:00.000+03:00", "replies_count": 0, "uuid": "8acb517f8d12914d451df40c11fad96f22e30c77"}, "author": "nefeeder", "url": "http://westhawaiitoday.com/sports/local-sports/biif-football-kealakehe-dominates-keaau-heads-back-title-game", "ord_in_thread": 0, "title": "BIIF Football: Kealakehe dominates Keaau, heads back to title game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BIIF Football: Kealakehe dominates Keaau, heads back to title game Published October 18, 2015 - 1:30am Updated: October 18, 2015 - 1:30am By J.R. De Groote West Hawaii Today jdegroote@westhawaiitoday.com \nKAILUA-KONA — Kealakehe hasn’t missed a BIIF championship games since 2001 — just its third year as a varsity program. That streak won’t end this season, as the Waveriders handily beat Keaau 50-8 in a BIIF Division I semifinal game on Friday night, punching their return ticket to the title game. \nKealakehe running back Riggs Kurashige rushed for 103 yards and two scores in the win, and quarterback Markus Degrate added two scores through the air. \n“We tried not to take them lightly and polish up what we have done leading up to this game,” Kealakehe head coach Sam Kekuaokalani said. “I think we did that tonight.” \nThe Waveriders will face off with Hilo for the fourth consecutive year in the title bout, which will be held at Waverider Stadium next Saturday at 7 p.m. The Waveriders’ last championship came in 2012, with the Vikings taking the last two. \n“The game is over here and we have a week to prepare,” Kekuaokalani said. “We will take that week and prepare the best we can. We are looking forward to the challenge.” \nKeaau finishes its season at 0-8. It’s the Cougars second consecutive winless season. \nThe teams couldn’t have started the game in more opposite ways. Kealakehe lit up the scoreboard on its first play from scrimmage — a perfectly placed 31-yard play-action pass from Degrate to Akoni Demello. The touchdown was set up by a 46-yard Kurashige return on the opening kickoff. \nMeanwhile, Keaau went 10 yards in reverse on its first two plays, and was forced to punt after a three-and-out. \nThe Waveriders never slowed down from there. Touting an I formation look, Kealakehe drove the ball at will against Keaau, racking up more than 200 yards rushing in the first half. \n“We like it,” Kekuaokalani said with a smile of his team’s I formation look. “We have been mixing it up.” \nNice blocking sprung big runs for Kurashige, Mason Kaawa-Loa and a host of other Kealakehe backs, and the play-action passing game played off the success of the ground game. \nKurashige made it a two-score game just under five minutes in with a 14-yard scamper, and Kobe Antolin — playing the full back role — was rewarded for his blocking efforts with a 1-yard touchdown plunge. \nAntolin added to his yardage total after the touchdown, migrating from full back to the primary back, picking up four consecutive first downs. Antolin moved the ball down to the Keaau 1-yard line and Kaawa-Loa punched it in to make it 28-0. \nDegrate added his second touchdown toss of the night on a 27-yard pass to Anthony “Head” Trevino. \nKeaau picked up just one first down, and was held to negative yardage until its last play before the half. Quarterback Dilan Santos heaved a ball downfield, it deflected up in the air and Dreq Agliam snagged the loose ball, sprinting into the end zone to put the Cougars on the board with no time left. \nThe momentum didn’t last through the break. Santos’ first pass after the half was picked off by Kealakehe junior linebacker Randy Hatori and Kurashige punched in his second touchdown of the night off the turnover. The five-play, 15-yard drive made it 50-8. \nKealakehe didn’t do much in the second half after that, but didn’t have to thanks to a running clock. \nKeaau 0 8 0 0 — 8 \nKealakehe 21 22 7 0 — 50 \nScoring summary \nKealakehe — Markus Degrate 31-yard pass to Akoni Demello (kick good) 11:38 \nKealakehe — Riggs Kurashige 14-yard run (kick good) 7:11 \nKealakehe — Kobe Antolin 1-yard run (kick good) 2:41 \nSecond quarter \nKealakehe – Mason Kaawa-Loa 1-yard run (kick good) 6:57 \nKealakehe — Degrate 27-yard pass to Anthony Trevino (2-pt run good) 3:37 \nKealakehe — Demello 5-yard run (kick good) \nKeaau — Dilan Santos 55-yard pass to Dreq Agliam (2-pt run good) 0:00 \nThird quarter \nKealakehe — Kurashige 2-yard run (kick good) 8:44 Search Site", "external_links": [], "published": "2015-10-18T14:30:00.000+03:00", "crawled": "2015-10-18T21:16:01.756+03:00", "highlightTitle": ""}