{"organizations": [], "uuid": "a052283195041d01197fe3352485b9aadbcdca2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wtop.com", "main_image": "", "site_section": "http://wtop.com/section/sports/feed/", "section_title": "WTOP » Sections » Sports", "url": "http://wtop.com/ncaa-football/2015/10/usc-notre-dame-preview-capsule/", "country": "US", "title": "USC-Notre Dame Preview Capsule", "performance_score": 0, "site": "wtop.com", "participants_count": 1, "title_full": "USC-Notre Dame Preview Capsule", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:12:00.000+03:00", "replies_count": 0, "uuid": "a052283195041d01197fe3352485b9aadbcdca2c"}, "author": "wtopstaff", "url": "http://wtop.com/ncaa-football/2015/10/usc-notre-dame-preview-capsule/", "ord_in_thread": 0, "title": "USC-Notre Dame Preview Capsule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press  12 pm \nUSC (3-2) at No. 14 NOTRE DAME (5-1), 7:30 p.m. (NBC) \nLine: Notre Dame by 6 1/2. \nSeries Record: Notre Dame leads 45-36-5 (USC lists it at 45-35-5 because it doesn’t count the 2005 Bush-Push game because that victory was vacated after the NCAA found Reggie Bush received improper benefits). \nWHAT’S AT STAKE \nThe Fighting Irish have to keep winning to keep their College Football Playoff hopes alive. USC already has lost two home conference games and is looking to end a tumultuous week after the firing of coach Steve Sarkisian. \nKEY MATCHUP \nUSC QB Cody Kessler vs. Notre Dame secondary. Kessler was held without a touchdown pass, the first time that’s happened in a year, and threw two interceptions in a 17-12 loss to Washington. Kessler ranks seventh in the nation in pass completions at 69.5 percent and 20th in yards per game at 290.6. He threw for 372 yards and six touchdowns against the Irish a year ago. The Notre Dame secondary has struggled at times, giving up eight passes of 25 yards. \nPLAYERS TO WATCH \nUSC: CB/WR Adoree Jackson. The 5-11, 185-pound sophomore was in for 94 plays against Washington, including a season-high 30 snaps at receiver. He could be forced to play a lot on offense again this week because of injuries. He has 10 catches for 196 yards and 11 tackles and a pass breakup. He also averaging 10.2 yards per punt return and 23 yards a kickoff return. \nNotre Dame: DL Sheldon Day. The 6-2, 285-pound senior has 21 tackles and career-highs with eight tackles for loss, two sacks and has matched his career-high with nine quarterback hurries and has been disruptive all season. \nFACTS & FIGURES \nUSC head coaches are winless in six tries when their first games against Notre Dame are in South Bend. .. Notre Dame is averaging 503 yards a game total offense. The Irish haven’t averaged 500 yards a game since 1970. … USC teams with two or more losses are 2-16 in South Bend. The wins came in 1971 and 1997. … Notre Dame RB C.J. Prosise has two games this season where he has rushed for three touchdowns. The only other Irish running back to do that in the past 100 years was Reggie Brooks in 1992. Topics:", "external_links": [], "published": "2015-10-15T19:12:00.000+03:00", "crawled": "2015-10-15T19:48:10.454+03:00", "highlightTitle": ""}