{"organizations": ["KARL RITTER Associated Press"], "uuid": "def46ce1e6301ced4c3aa62415374e884e13fc2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pendletontimespost.com", "main_image": "", "site_section": "http://pendletontimespost.com//feed/sec/6000/", "section_title": "PendletonTimesPost.com - Sports News", "url": "http://www.pendletontimespost.com/view/story/2dfb3707aaa14e72bedeb7108407d867/SOC--Malmo-Real-Madrid/", "country": "US", "title": "Ronaldo scores twice as Madrid beats Malmo 2-0", "performance_score": 0, "site": "pendletontimespost.com", "participants_count": 0, "title_full": "Ronaldo scores twice as Madrid beats Malmo 2-0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:14:00.000+03:00", "replies_count": 0, "uuid": "def46ce1e6301ced4c3aa62415374e884e13fc2e"}, "author": "", "url": "http://www.pendletontimespost.com/view/story/2dfb3707aaa14e72bedeb7108407d867/SOC--Malmo-Real-Madrid/", "ord_in_thread": 0, "title": "Ronaldo scores twice as Madrid beats Malmo 2-0", "locations": ["Malmo", "Madrid"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ronaldo"], "text": "Ronaldo scores twice as Madrid beats Malmo 2-0 in the Champions League By KARL RITTER Associated Press   5:14   5:14   \nOrganizations: \nSweden (39) \n\nMALMO, Sweden — Cristiano Ronaldo scored the 500th and 501st goals of his career to give Real Madrid a 2-0 win over 10-man Malmo in Group A of the Champions League on Wednesday. \nThe Swedish side held off Madrid for nearly half an hour before they were caught off guard by a counterattack as Ronaldo gathered a Francisco \"Isco\" Alarcon's pass and made no mistake alone with goalkeeper Johan Wiland. \nRonaldo got his second goal of the night in the 90th when he tapped in a pass from Lucas Vazquez in front of goal. It was his 323rd goal for Madrid, equaling Raul's scoring record for the club. \nThe match wasn't as lopsided as many had expected with a tough-tackling Malmo shutting down Madrid's attack. Dani Carvajal's shot in the 42nd hit both the crossbar and the post, leaving Madrid with a one-goal lead at half-time. \nMalmo chased an equalizer in the second half and Captain Markus Rosenberg's header narrowly missed the post in the 74th as Madrid started feeling the pressure. But the home side's hopes dimmed four minutes later when left back Yoshimar Yotun was sent off for his second yellow card. \nWiland denied Ronaldo with two one-handed saves before the Portuguese striker surged into the area and sealed the win for Madrid, which has six points after two games. \n\"I think that to win away, to get three points, a clean sheet and two goals from Ronaldo, another record, so I have to be really pleased,\" Real Madrid coach Rafael Benitez said. \nMadrid was missing Gareth Bale, James Rodriguez, Sergio Ramos and Pepe due to injuries. Coach Rafael Benitez also left Marcelo and Luka Modric out of the starting lineup, with an important league derby coming up this weekend against Atletico Madrid. \nAll content copyright ©2015 Pendleton Times-Post, a division of Home News Enterprises unless otherwise noted.", "external_links": [], "published": "2015-10-01T00:14:00.000+03:00", "crawled": "2015-10-01T00:19:24.353+03:00", "highlightTitle": ""}