{"organizations": [], "uuid": "f22ea44bd00e53eff645f9425e0087acb8c7bf19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/6/51/151863/Sports/Egyptian-Football/Five-footballers-names-Egyptian-commentators-get-w.aspx", "country": "EG", "title": "Five footballers' names Egyptian commentators get wrong - Egyptian Football - Sports", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Five footballers' names Egyptian commentators get wrong - Egyptian Football - Sports - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "f22ea44bd00e53eff645f9425e0087acb8c7bf19"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/6/51/151863/Sports/Egyptian-Football/Five-footballers-names-Egyptian-commentators-get-w.aspx", "ord_in_thread": 0, "title": "Five footballers' names Egyptian commentators get wrong - Egyptian Football - Sports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With an influx of foreign players and managers in Egypt over the past two decades, local commentators and fans remain unaware of many names' pronunciation.\nAttempts to pronounce some names often end in embarrassment for Egyptian commentators. Instead, some stick to using players' first names and others merely refer to the player by his number.\nHere is a list of five current and former players and managers who might have forgotten how their names are correctly pronounced, given the number of times commentators and fans get them wrong.\n1-John Antwi (Ghana)\nThe burly striker has been in Egypt for almost three years now, enjoying spells at popular clubs Ismaily and Ahly, but he is still known as “Antoy” rather than Antwi.\nOne Egyptian commentator, Hatem Batteisha of BeIN Sports, asserted that his name is Antwi not “Antoy” during a recent African Confederation Cup clash featuring Cairo giants Ahly but few have taken notice of the remark, with “Antoy” still prevailing.\nIn the below video, how many times does the commentator say “Antoy?\nJohn Antwi 2- Akwetey Mensah (Ghana)\nAnother Ghanaian victim is Akwetey Mensah, a 32-year-old midfielder who has played for Masry, Ahly, Wadi Degla and Ittihad El-Shorta in Egypt.\nThis time it's the first name that caused commentators trouble. It might seem straightforward for many, but he was called “Akouti” with a clear conscience.\nThis is a video of a reckless challenge by “Akouti”, sorry Akwetey, on an opponent while he was playing for Wadi Degla.\nAkwetey Mensah 3- Minusu Buba (Nigeria)\nThe Nigerian striker was once one of the top marksmen in Egyptian football, excelling for the likes of Arab Contractors, ENPPI and Ittihad El-Shorta.\nHis first name puzzled the commentators, whose attempts included pronouncing it as “Minswah” and “Menesio” among others. They finally settled on calling him “Buba The Nigerian\".\nMinusu Buba 4- Isaac Lawal (Nigeria)\nThe attacking midfielder was one of Ahly’s well-known players in the late 1990s. His last name seems easy to pronounce but that was not the case.\nAttempts to pronounce Lawal yielded “Awall”, which means “the first” in Arabic. Consequently, he was simply called “Isaac Awall” (Isaac the first).\n5- Jaime Pacheco (Portugal)\nThe Portuguese coach, who left Zamalek in acrimony last season, might have left because of his reported frustration at how his name was pronounced by media personnel. Just joking!\nMany commentators simply melded the two names, as well as complete failing to utter the letter \"p\". The result was “Jembasheco”.\nJaime Pacheco From 0-9 seconds\n(For more sports news and updates, follow Ahram Online Sports on Twitter at @AO_Sports and on Facebook at AhramOnlineSports .)", "external_links": ["http://www.youtube.com/watch?v=Tdak22XLtqI?rel=1", "https://www.facebook.com/AhramOnlineSports?fref=ts", "https://twitter.com/AO_Sports", "http://www.youtube.com/watch?v=YxdUOZJf1aE?rel=1", "http://www.youtube.com/watch?v=fHNbB4sXXeI?rel=1", "http://www.youtube.com/watch?v=x6tBvEW_TSY?rel=1"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T22:37:52.024+03:00", "highlightTitle": ""}