{"organizations": [], "uuid": "6afd127f43327d57c771a157750a2a2b9371b444", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Dmong.jpg", "site_section": "http://www.deccanchronicle.com/sports", "section_title": "Sports | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151013/sports-cricket/article/nonsense-dinesh-mongia-allegations-spot-fixing", "country": "US", "title": "This is nonsense: Dinesh Mongia on allegations of spot-fixing", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "This is nonsense: Dinesh Mongia on allegations of spot-fixing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T11:34:00.000+03:00", "replies_count": 0, "uuid": "6afd127f43327d57c771a157750a2a2b9371b444"}, "author": "DC", "url": "http://www.deccanchronicle.com/151013/sports-cricket/article/nonsense-dinesh-mongia-allegations-spot-fixing", "ord_in_thread": 0, "title": "This is nonsense: Dinesh Mongia on allegations of spot-fixing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DC | Bipin Dani | October 13, 2015, 21.46 pm IST \"This is nonsense,” said Dinesh Mongia, speaking over the phone from his residence when claims of spot-fixing by New Zealand cricketer Lou Vincent surfaced again on Tuesday. (Photo: AFP) Mumbai: \"This is nonsense,” said Dinesh Mongia, speaking over the phone from his residence when claims of spot-fixing by New Zealand cricketer Lou Vincent surfaced again on Tuesday.\n“I am innocent and wondering why my name is being discussed again and again and that too after eight years. I was never involved and was even cleared by the organizers of the ICL (Indian Cricket League) and I can even produce the legal document,” Mongia made it clear.\nMongia sent a copy of the letter, which he received from Pan Infra Projects Pvt. Ltd. formerly known as Essel Sports Pvt. Ltd.).\n\"This is to confirm that the agreement executed between yourself and Essel Sports Pvt. Ltd. stands terminated and neither party has any claim of any nature whatsoever against each other\", the letter read.\n\"Please note the terms of confidentiality inter-alia any information shared with you during your association with ICL, continue to be valid and binding on you\".\n\"We wish you the very best in your further assignments\", said the letter.\nThe 38-year-old left-handed batsman has not been a part of BCCI's pension scheme.\n\"This is because I have not announced my retirement yet. I don't intend to retire now. I will approach the board for my eligibility for the pension once I retire from the game\", he added.\nAarti, Mongia's wife, added: “Of course, we are all very disturbed. The letter is clear.”\n\"We are living a normal life and would have been enjoying the luxurious life had my husband was involved in fixing the matches.\n\"Vincent's allegations are baseless. Had Dinesh been involved in fixing he wouldn't have been the player of the domestic tournament held by ICL way back.\n\"Also his statistics were the best compared to the Kiwis and the others. He has always been a team person and has never put his personal interests ahead,” the wife added.\n\"These guys just need a scapegoat and they are ganging up against Dinesh. It is very unfortunate that someone who has never backstabbed, never done ill to anyone, has to go though unnecessary trauma. Players with evidence against them walk free and Dinesh has only baseless statements against him and his image is being tarnished,” she said.\nDinesh has been providing coaching to the poor boys in Chandigarh.\n\"My husband is on the ground from morning till dusk teaching children. He earns a living and we are happy with our life. This unnecessary allegation is just baseless and only harassing the peace in our lives,” she concluded.\n Dinesh Mongia Lou Vincent Cricket spot-fixing Indian Cricket League Also Read India's Dinesh Mongia part of fixing gang, says Lou Vincent Match-fixing: ‘My name is Lou Vincent and I’m a cheat’ 'Fixer' Lou Vincent banned for life New Zealand’s Lou Vincent admits not reporting bookie’s approach", "external_links": ["http://twitter.com/share?url=http://www.deccanchronicle.com/151013/sports-cricket/article/nonsense-dinesh-mongia-allegations-spot-fixing", "http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Dmong.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Dmong.jpg", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-14T11:34:00.000+03:00", "crawled": "2015-10-14T01:06:10.179+03:00", "highlightTitle": ""}