{"organizations": [], "uuid": "a9c5e09376c9c7ae50c1fc3eb9fbb34eb7da0599", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fosters.com", "main_image": "http://www.fosters.com/storyimage/FD/20151010/SPORTS/151019935/AR/0/AR-151019935.jpg", "site_section": "http://www.fosters.com/sports?template=rss&mime=xml", "section_title": "Sports - fosters.com", "url": "http://www.fosters.com/article/20151010/SPORTS/151019935/14322/NEWS?rssfeed=true", "country": "US", "title": "West no match for Saints", "performance_score": 0, "site": "fosters.com", "participants_count": 1, "title_full": "West no match for Saints", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T07:43:00.000+03:00", "replies_count": 0, "uuid": "a9c5e09376c9c7ae50c1fc3eb9fbb34eb7da0599"}, "author": "John Doyle jdoyle@fosters.com", "url": "http://www.fosters.com/article/20151010/SPORTS/151019935/14322/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "West no match for Saints", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "West no match for Saints By John Doyle Posted Oct. 10, 2015 at 11:37 PM Updated at 11:43 PM Posted Oct. 10, 2015 at 11:37 PM Updated at 11:43 PM DOVER — It wasn't the largest margin of victory for the St. Thomas Aquinas High School football team in terms of points, but it was definitely the team's most lopsided win so far this season. The Saints scored twice in the first 31 seconds and rolled to a 38-0 win over completely overmatched Manchester West in Division II action Saturday night under the portable lights at the Saints' home field. St. Thomas improved to 6-0 with two games remaining — Friday night at Kingswood and the season finale at Trinity of Manchester following a bye week. \"We're putting ourselves in position to be a No. 1 or 2 seed,\" St. Thomas coach Eric Cumba said. \"Obviously you want to be there. That way we wouldn't have to leave Dover until we went to Durham (for the D-II title game). That's what our goals are now.\" In what has become a mini-tradition for the Saints this year, quarterback Stephen Hedberg connected with Trevor Martin for a big offensive play on the game's first snap. This time it was a 65-yard touchdown pass that put the Saints up 7-0 just seconds into the contest. \"I thought about running it, but Trevor started screaming at me,\" Hedberg said. \"So I just dished it out to him and he did the rest.\" Hedberg passed to Martin for a 70-yard touchdown on the first play of a 41-7 rout of Pembroke on Sept. 12. West (0-5) fumbled on its first snap on Saturday, and on the very next play Hedberg threw to Tom Bouchard for a 15-yard touchdown. St. Thomas was up 14-0 with 11:29 to go in the first quarter. The win was bittersweet for Hedberg, who once again saw limited action with the Saints possessing a large lead. \"We love to be out there and play, but it's also fun to get the other kids in,\" Hedberg said. \"But it's a great environment. We love to play, but we love the scoreboard, too.\" The Saints rolled the rest of the way. Tim Wesson ran 10 yards for a score and St. Thomas was up 21-0 before the game was three minutes old. Hedberg and Martin hooked up again, this time for a 36-yard touchdown pass, and the Saints led 28-0 just over halfway through the opening frame. Nate Grunbeck put an exclamation point on the first quarter with a 60-plus-yard punt return for a score to make it 35-0. Matt Baker was 5 for 5 on extra points in the first quarter. \"We had a chance to get a lot of different kids in,\" Cumba said. \"Every kid on our roster played today. That's a good experience.\" The game took an ugly turn when a West player was hurt on the ensuing kickoff return. The teams were sent to the locker rooms as the player was tended to and taken off the field on an ambulance and to Portsmouth Regional Hospital. Manchester coach Vance Sullivan said the player was responsive and moving his limbs. Play resumed after a delay of about 40 minutes with 4:04 remaining in the first quarter. Both coaches agreed to play the rest of the game with running time. Manuel Paz hit a 22-yard field goal just before time expired in the first half to give St. Thomas a 38-0 lead. There was no scoring in the second half. \"We have a lot of respect for those West kids,\" Cumba said. \"Despite how the game was going, they were in good spirits. It's a good group of kids over there. They played hard and that's what they've done all year.\" By John Doyle", "external_links": [], "published": "2015-10-11T07:43:00.000+03:00", "crawled": "2015-10-11T13:21:36.131+03:00", "highlightTitle": ""}