{"organizations": [], "uuid": "d12ae133db997462f9847af3960a775b1d3385b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jenningsdailynews.net", "main_image": "", "site_section": "http://www.jenningsdailynews.net/category/sports/feed/", "section_title": "Jennings Daily News » Sports", "url": "http://www.jenningsdailynews.net/2015/10/the-boys-are-back-in-town/", "country": "US", "title": "The boys are back in town", "performance_score": 0, "site": "jenningsdailynews.net", "participants_count": 1, "title_full": "The boys are back in town", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:11:00.000+03:00", "replies_count": 0, "uuid": "d12ae133db997462f9847af3960a775b1d3385b9"}, "author": "Graphic Designer 2", "url": "http://www.jenningsdailynews.net/2015/10/the-boys-are-back-in-town/", "ord_in_thread": 0, "title": "The boys are back in town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The boys are back in town \nBulldog Bites \nby JIMMY SEGURA Hello, Defense. It’s good to see you back. You were probably hearing all the talk and negativity. I heard it. I’m ashamed to say I was also guilty of saying it. “They can’t stop anybody.” “Do they have tackling drills?” “We will have to score 60 points to have a chance to win any more games.” We felt bad for the kids. We felt bad for the coaches. We felt bad for the offense. They were young and inexperienced. They tried different personnel and schemes. Had the Maroon Wall crumbled? NO! They grew up and came back this past Friday on the road against the 6th-ranked South Beauregard Knights. I am here to tell you the Maroon Wall stood tall. Three stops in a row led to three Bulldog scores in the first half. They gained more confidence with every stop. We could feel it on the sidelines. Instead of hangings heads there were high fives all around. They fed off of the crowd and the crowd in turn fed off of them. Hard-hitting tackles, tackles for losses, pressure, flying to the football, and punt. Yes, punts. We had not seen a lot of those lately. The Maroon Wall held the Knights to 26 points. In the previous 6 games, the opposing teams had averaged close to 50. Welcome back, guys. We are very proud of you coming through after such adversity. Who are these young men? Jacob Guidry, Ryan Lachaussee, Amir Darjean, Brent Meche, David Madden, Masin Williams, Walker Phelps, Gavin McZeal, Michael Bryant, Joey Scoggins, Elijah Brumfield, Adrian Trent, Gavin Benoit, Ethan Guillory, Lucas Spencer and Peyton Trahan. Also, Taylor Joseph, Jacob Soileau, Ian Cassidy, Will Green and Keegan Clement. I really sense we will see more good things from these guys. Longest Run – Travis Etienne’s 70-yard touchdown on a sweep play in the fourth quarter for the final Bulldog score of the night. Best Highlight – You had to see it to believe it. The play was just “33 veer.” Etienne took the ball, bounced to the right, cut to the left, made two spin moves and was touched by 11 guys before being brought down for a 34-yard gain in the second quarter. It was a “wow” moment by a guy who has redefined “wow.” Second-Best Highlight – A fourth-quarter reverse to WR Taylor Joseph. Joseph lined up on the right side. He took the handoff and ran to the left perimeter and cut right while jumping over and cutting by would-be tacklers for a 54-yard score. I think he must have run at least 90 yards on this play. Good Call – South Beauregard finally stole a possession with a well-executed on side kick in the 3rd quarter. This led to a score that closed the gap…for a while. C’mon, Man! Again in the fourth quarter the clock operator could not figure out when to restart the clock. I know these guys have some training. Maybe this guy slept through that part. C’mon, man! Biggest Play – One of many by the Maroon Wall was a South Beau fumble caused by Amir Darjean and recovered by Walker Phelps late in the fourth quarter to seal the win. Oops – In last week’s column I named and applauded the O’line. I left one out. Sorry, Kaylin “K’Money” Gary. Foo Facts Etienne rushed for 315 yards and scored 3 touchdowns. This puts him at close to 1,760 yards and 27 touchdowns in seven games. Another “wow” Team Captains – Joey Scoggins and Gavin Benoit First Downs – Jennings, 13– South Beau, 25 Penalties – Jennings 5 for 45 yards – South Beau 5 for 65 yards Punts – For the third game in a row, the Bulldogs did not punt. Foo wants to know if Kendrick Lejeune gets Punters unemployment benefits. 4th down conversions – Jennings, 1-for-1 – South Beau, 3-for-5 Bad Streak Broken – This is the first time this year the Bulldogs gave up less than 40 points Good Streak Going – The ‘Dogs have now won 3 in a row and are 2-0 in district play. Thanks Foo for all of your help. Up Next – The Bulldogs begin a 3-game home stand by facing the St. Louis Saints this Friday. Like Jennings, St. Louis is 4-3 and 2-0 in district play. The winner of this game will be in the driver’s seat for the district championship. On a personal note – Thanks for the positive feedback from readers who have enjoyed “The Bulldog Bites.” I do appreciate it, but I will say it is bittersweet. Sports Editor Dylan Brossette asked me to write this column in place of Tom Precht. As many of you know, Tom was one of my best friends. He and I and Mike “Rat” Gary not only put together the Alumni Tournament for the past 22 years, but we have all been good friends since high school. When Tom passed away this past June the real “Bulldog Bites” died with him. I think about him every day, especially when I’m writing Tom’s “Bulldog Bites.” No one can take his place.  //www.jenningsdailynews.net/?p=34355   20  ", "external_links": [], "published": "2015-10-20T19:11:00.000+03:00", "crawled": "2015-10-21T11:54:43.598+03:00", "highlightTitle": ""}