{"organizations": [], "uuid": "d4bd8d1f6e3d0d59747040cfa630f0b0c256de7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/AP_365804666037.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/college-football-so-wacky-this-fall-it-s-glorious/333410411/", "country": "US", "title": "Scoggins: College football so wacky this fall, it's glorious", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "Scoggins: College football so wacky this fall, it's glorious - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:27:00.000+03:00", "replies_count": 0, "uuid": "d4bd8d1f6e3d0d59747040cfa630f0b0c256de7d"}, "author": "Rick Bowmer, AP", "url": "http://www.startribune.com/college-football-so-wacky-this-fall-it-s-glorious/333410411/", "ord_in_thread": 0, "title": "Scoggins: College football so wacky this fall, it's glorious", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "College football is insane right now. Positively, certifiably, fabulously bonkers.\nAnd that’s not a bad thing, unless you’re a USC Trojans fan or a person who simply prefers order in life.\nThe season hasn’t even reached November and all hell has broken loose.\nCoaches have been fired, the Head Ball Coach has retired, offenses are on record pace, Ohio State looks pedestrian, Utah might be the best team in the nation and the playoff race appears as wide open as Montana prairie.\nYes, more please.\nThe NFL loves to trumpet its “Any given Sunday” natural order. If parity is that league’s buzzword, euphoric unpredictability governs its feeder system.\nThe perfect snapshot of a typical college football weekend is the Lloyd Bridges character in “Airplane!” after noting he picked the wrong week to give up all his vices.\nHair raised, eyes squinted, emotionally exhausted from a series of wild shootouts and down-to-the-wire finishes.\nSaturday always delivers the goods.\nThis week in college football felt like an episode of “The Twilight Zone.”\nSteve Spurrier abruptly turned in his resignation at South Carolina. Steve Sarkisian was placed on leave at USC and then fired the next day after his alcohol issues fueled erratic behavior.\nMaryland fired Randy Edsall, Florida quarterback Will Grier received a one-year suspension after testing positive for a banned substance and Arkansas coach Bret Bielema — surprise, surprise — found himself knee-deep in another controversy over his sideline conduct.\nIt was quite a week. The actual games have provided plenty to chew on, as well.\nSix teams received first-place votes in this week’s Associated Press poll, including Texas A&M, which is ranked ninth. How often does a ninth-ranked team get a first-place vote and the first thought that enters your mind is, well, that’s actually not outlandish?\nA scan of AP rankings since 2002 found that no other season had as many as six teams earning a first-place vote at this same juncture, Week 7.\nWasn’t supposed to be this way, right? Ohio State began the season as the unanimous No. 1 after returning three Heisman Trophy candidates off a national championship team. No team can match their talent.\nCount me among those who blindly assumed the Buckeyes would turn every opponent into roadkill. They haven’t lost a game, but their overall performance has been rather sleepy. Instead of wow, it’s been meh.\nIn public perception, style points matter in college football because conferences are not uniform in talent, and we demand that elite teams look invincible.\nWinning ugly or by a smaller margin than expected is treated as a Scarlet Letter. How dare you not destroy Ball State by a zillion points!\nRule of thumb with college football: Never discount the effects of complacency on a team or the fickle nature of 19- and 20-year-olds in athletic competition.\nOr maybe there are just more good players and teams these days, so the gap that separates the entire landscape isn’t as significant as expected.\nWho among us didn’t snicker when Michigan lost to Utah in Jim Harbaugh’s debut? The Utes subsequently nipped Oregon by 42 points on the road and defeated a ranked Cal team last week, and now a team that began the season unranked can reasonably claim that it belongs at No. 1 in the polls.\nClemson also has a valid argument.\nAnd Baylor.\nAnd TCU.\nAnd Ohio State, of course. The Buckeyes remain a safe bet to make the four-team playoff and defend their title.\nSpeaking of the playoff, we’re less than three weeks away from the release of the committee’s initial rankings, and the first order of teams undoubtedly will result in mass hysteria. Happens like clockwork.\nIn the immortal words of Aaron Rodgers, R-E-L-A-X.\nIt’s a natural reaction, but to get hung up on the committee’s rankings so soon ignores the unpredictable nature of college football. Rest assured, things can and will change from one week to the next as the race heats up.\nAnd if the season ends with seven teams worthy of a playoff bid, we can all scream until we’re hoarse and demand change to the system, another favorite pastime for college football fans.\nMy suggestion? Sit back and enjoy the inevitable craziness. Saturdays rarely disappoint.", "external_links": [], "published": "2015-10-17T04:27:00.000+03:00", "crawled": "2015-10-18T00:43:37.585+03:00", "highlightTitle": ""}