{"organizations": [], "uuid": "7932cfa50e56b3f7e06e00f639c407a62dcf3eba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg10_Saturday_2015_132611739.jpg", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/world/-us-to-cooperate-with-india-in-dealing-with-climate-change/144216.html", "country": "US", "title": "'US to cooperate with India in dealing with climate change'", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "'US to cooperate with India in dealing with climate change'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "7932cfa50e56b3f7e06e00f639c407a62dcf3eba"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/world/-us-to-cooperate-with-india-in-dealing-with-climate-change/144216.html", "ord_in_thread": 0, "title": "'US to cooperate with India in dealing with climate change'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington, October 10\nThe US has said it welcomes any contributions by India in dealing with the problems of climate change and looks forward to cooperate with the country in this regard. \"Any contributions by India towards helping us deal with the problems of climate change and clean energy initiatives are welcome and we would look forward to working in close cooperation to achieve those goals,\" State Department Spokesman John Kirby said yesterday. India has pledged to curb its greenhouse gas emissions by up to 35 per cent from the 2005 level. It announced that it aims at achieving around 40 per cent cumulative electric power installed capacity from non-fossil fuel-based energy resources by 2030. Meanwhile, prestigious weekly The Economist said India has shown that it can enact reforms which have a big environmental impact by submitting its emission plans ahead of the climate change summit in Paris later this year. \"India has shown that it can enact reforms that have a big environmental impact,\" the weekly said in its latest issue yesterday. In the past two years, for example, India has removed a subsidy on diesel consumption (which subsidised carbon), and replaced subsidised liquefied natural gas with a cash payment for the poor, encouraging people to use gas less wastefully. \"India's emissions are still too modest for it to rival China anytime soon. Modest, too, are its manufacturing sector and middle class, both big polluters. As always, India will go its own sweet way. But it could do more to make that way greener,\" the paper reported. — PTI", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T12:13:39.637+03:00", "highlightTitle": ""}