{"organizations": [], "uuid": "993859f41b905a882dc44dbceb70488262630b22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.providencejournal.com", "main_image": "http://www.providencejournal.com/storyimage/PJ/20151010/SPORTS/151019838/AR/0/AR-151019838.jpg", "site_section": "http://www.providencejournal.com/sports?template=rss&mime=xml", "section_title": "Sports - providencejournal.com", "url": "http://www.providencejournal.com/article/20151010/SPORTS/151019838/13933/NEWS?rssfeed=true", "country": "US", "title": "Bruins' Colin Miller gets his first taste of NHL action", "performance_score": 0, "site": "providencejournal.com", "participants_count": 1, "title_full": "Bruins' Colin Miller gets his first taste of NHL action", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T06:48:00.000+03:00", "replies_count": 0, "uuid": "993859f41b905a882dc44dbceb70488262630b22"}, "author": "Bill Doyle @BillDoyle15", "url": "http://www.providencejournal.com/article/20151010/SPORTS/151019838/13933/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Bruins' Colin Miller gets his first taste of NHL action", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bruins' Colin Miller gets his first taste of NHL action Comment Posted Oct. 10, 2015 at 10:48 PM By Bill Doyle@BillDoyle15 Posted Oct. 10, 2015 at 10:48 PM BOSTON — The Bruins and Canadiens have played each other a whopping 730 times, the most by any two National Hockey League teams, and familiarity has definitely bred contempt. Colin Miller got his first chance to hate the Canadiens as a Bruin Saturday night when he made his NHL debut in Boston’s 4-2 loss at the Garden. “It was all right,” Miller said. “It would have been nicer to get a win obviously, but I felt all right. I felt confident with the puck. So it was OK.” The 6-foot-1, 201-pound native of Sault Ste. Marie, Ontario, was a healthy scratch for the Bruins’ 6-2 loss to Winnipeg in the season opener on Thursday. “It was actually kind of beneficial, a little bit,” Miller said after the morning skate, “to sit out the other night and watch the game, read the pace, get used to it, just by watching. It definitely wasn’t a bad thing.” Miller, 22, replaced Zach Trotman in the lineup against the Canadiens. He played 16:13 and wasn’t on the ice for any goals. He nearly had an assist at 6:30 of the second period when Loui Eriksson redirected his slap shot past Montreal goaltender Carey Price for an apparent goal that would have pulled Boston within, 2-1. But the goal was waved off because Patrice Bergeron interfered with Price. Bruins coach Claude Julien challenged the call because he and the sellout crowd at the Garden thought Montreal’s Alexei Emelin had pushed Bergeron into Price, but the call stood. Miller was paired with Joe Morrow on his first shift and because he is known as an offensive defenseman he played on the Bruins’ first power play. “The first couple of shifts there were a bit hectic,” Miller admitted, “but I felt I settled down after that and kind of got better as the game went on.” Miller picked up his first penalty at 11:16 of the third for cross-checking Brian Flynn in the crease, but he may have saved a goal in the process because Flynn redirected the puck off the post as he was falling. “I think I could have definitely lifted his stick there,” Miller said, “and not cross-checked him in the back there, but yeah it was a little bit of panic there so I was just trying to do everything I could to keep it out of the net.” Bruins coach Claude Julien liked what he saw of Miller. “I thought he was good tonight,” Julien said. “He did a good job for his first game. You can see where he moved the puck well. He’s got a good shot. He’ll get better. He competes hard. In my mind, I’m not disappointed in his start.” Page 2 of 2 - Miller was drafted in the fifth round by the Los Angeles Kings in 2012, but he was never called up to the NHL. Last season, Miller helped the Manchester Monarchs win the Calder Cup as champions of the American Hockey League before the franchise joined the Worcester Sharks in moving to California for this season. In 70 regular-season games, Miller shared the league lead for goals by a defenseman with 19 and tied for second among blueliners with 52 points. In 19 playoff games, he registered two goals and eight assists for 10 points. During the AHL All-Star skills competition last year, Miller won the fastest skater competition and set a skills record for hardest shot at 105.5 miles an hour. Miller is the only player on the active roster whom the Bruins acquired from the Kings for Milan Lucic last June. They also acquired Martin Jones and the 13th pick in the NHL Draft that they used to take Jakub Zboril. The Bruins then dealt Jones to San Jose for a 2016 first-round pick and Sean Kuraly, who is still playing in college for Miami of Ohio. Zboril is playing junior hockey. By Bill Doyle", "external_links": [], "published": "2015-10-11T06:48:00.000+03:00", "crawled": "2015-10-11T07:00:03.855+03:00", "highlightTitle": ""}