{"organizations": [], "uuid": "87ecd079bf501f8f7e625f12944f30c6e4cc1920", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "manilastandardtoday.com", "main_image": "http://manilastandardtoday.com/panel/_files/images/default/default-thumb.jpg", "site_section": "http://manilastandardtoday.com/feed/sports/", "section_title": "The Standard Sports", "url": "http://manilastandardtoday.com/2015/10/10/gilas-dream-lives-on/", "country": "CA", "title": "Gilas dream lives on", "performance_score": 0, "site": "manilastandardtoday.com", "participants_count": 1, "title_full": "Gilas dream lives on", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:01:00.000+03:00", "replies_count": 0, "uuid": "87ecd079bf501f8f7e625f12944f30c6e4cc1920"}, "author": "Ronnie Nathanielsz", "url": "http://manilastandardtoday.com/2015/10/10/gilas-dream-lives-on/", "ord_in_thread": 0, "title": "Gilas dream lives on", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gilas dream lives on By Ronnie Nathanielsz | Oct. 10, 2015 at 12:01am \nTHE eminent businessman-sportsman Manny Pangilinan has once again demonstrated his class and his sense of integrity by announcing that he would relinquish his position as President of the Samahang Basketbol ng Pilipinas because the SBP Constitution prohibits his remaining at the helm after two terms. \nNot one to trifle with the rules and regulations of an organization he built from the debris of the former Basketball Association of the Philippines and elevated to a position of respect in the international basketball community, Pangilinan has committed to continue to support Gilas Pilipinas and all its programs with the same kind of enthusiasm that drove him over the past eight years. \nBut for him to continue to support the Gilas program and to commit vast resources to the undertaking aimed at making the Philippines a genuine competitor in the international arena, he must get the wholehearted support of the basketball community, foremost of which is the Philippine Basketball Association. \nHe—and indeed the national team—has been hurt in the past by the failure of some PBA team owners to set aside considerations of business rivalry and to realize that MVP does what he does, not for his personal glory but for a sport for which he has, like most Filipinos an unbridled passion and for our country in whom his faith has been unwavering despite the ups and downs. \nWe are aware that there are a few individuals with hidden agenda seeking to take control of the SBP, but we seriously doubt whether these individuals have the same desire or the ability to commit substantial resources to help our national team improve its standing internationally and to further strengthen our quest for a measure of greatness that is surely within our grasp as evidenced by the performance of Gilas Pilipinas which far exceeded the expectations of a nation and people who remarkably kept the faith and prayed fervently for success. \nOur FIBA Asia Championship run with a team that was undermined by men who should have committed themselves totally to a national undertaking once again regrettably showed the ugly side of the Filipino in the process ignoring what the great nationalist Heneral Luna said: “Bayan muna hindi sarili,” or what two-time FIBA president the late Lito Puyat often remarked with conviction: “Para sa Bayan.” \nThankfully, there are men like former PBA chairman Wilfred Steven Uytengsu, who responded to the call and released three of his best players, Sonny Thoss, Dondon Hontiveros and the redoubtable Calvin Abueva, who was prepared, at every turn, to become a hard-court warrior, unafraid of whoever confronted him. \nThere was naturalized Filipino Andray Blatche, whose admirable attitude was the hallmark of a true Filipino and not a mercenary and of course Marc Pingris, whose commitment to Gilas and our country was shoved in the faces of those who sought in miserable fashion to falsely blame him for not wanting to suit up. \nPingris is a man after our own heart just like the incomparable Jayson Castro, point guard extraordinaire and a member of the Asian Mythical Team for the second time in a row. \nThere was Ranidel de Ocampo, a veteran who was prepared whenever necessary to stand up for his teammates and the remarkable Terrence Romeo, the dream of every Juliet on earth, whose creative genius was likened to that of Allen Iverson and the ageless Asi Taulava, who was more Filipino than foreigner. \nAnd on and on it goes even as we must never forget the amazing head coach Tab Baldwin and his assistants Jong Uichico, Alex Compton and Norman Black. Baldwin was able to instill a remarkable sense of togetherness and the philosophy of playing for one another and for the country no matter what sacrifices had to be made. \nAs Manny Pangilinan so simply but eloquently pointed out: “This is a special team, comprising players who really want to be a part of Gilas and who truly love this country by serving it the best way they can.” \nObviously, MVP, by far the most valuable person in Philippine sports not just basketball, was the inspiration for a performance of epic proportions. \nWe can’t think of any single individual who has given so much and asked so little in return. To find a replacement with the same passion and a similar commitment we frankly believe is almost next to impossible but as long as he remains a staunch supporter, the Gilas dream will live on.  ", "external_links": [], "published": "2015-10-09T19:01:00.000+03:00", "crawled": "2015-10-10T00:24:47.885+03:00", "highlightTitle": ""}