{"organizations": [], "uuid": "82ded00a0f35756c99a96c8b3c75730bed88a6f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/", "section_title": "The Tribune, Chandigarh, India : Latest news, India, Punjab, Chandigarh, Haryana, Himachal, Uttarakhand, J&amp;K, sports, cricket ", "url": "http://www.tribuneindia.com/news/business/gdp-growth-to-exceed-7-5-taxes-to-miss-target-finmin/142111.html", "country": "US", "title": "GDP growth to exceed 7.5%, taxes to miss target: FinMin", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "GDP growth to exceed 7.5%, taxes to miss target: FinMin", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "82ded00a0f35756c99a96c8b3c75730bed88a6f5"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/business/gdp-growth-to-exceed-7-5-taxes-to-miss-target-finmin/142111.html", "ord_in_thread": 0, "title": "GDP growth to exceed 7.5%, taxes to miss target: FinMin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sanjeev Sharma\nTribune News Service\nNew Delhi, October 5\nContending that the Indian economy is now better placed to handle external shocks, the Finance Ministry today said tax collection will undershoot the target by Rs 50,000 crore though the fiscal deficit target is on track with the next generation public distribution system (PDS) reforms to be implemented through the Jan Dhan, Aadhaar, Mobile (JAM) trinity. Growth is expected to be more than 7.5% and one of the drivers of this will be infrastructure growth which has picked up on the back of accelerated government spending on highways, railways and the power sector. Addressing a press conference, Finance Secretary Ratan P Wattal flanked by the other secretaries in the Finance Ministry, said despite the global slowdown and declining export demand, India has emerged as the fastest growing major economy in the world and anchored by strong macro-fundamentals is better placed to handle external shocks. However, revenue collection is likely to fall short of the target. Revenue Secretary Hasmukh Adhia said it will fall short of the budgetary target by 5-7%, mainly because of subdued growth in direct taxes. The total tax revenue is likely to be around Rs 14 lakh crore in the current fiscal, as against the budget estimate of Rs 14.5 lakh crore, a shortfall of Rs 50,000 crore. As regards growth, Economic Affairs Secretary Shaktikanta Das said there are indications that it will exceed 7.5% in the current financial year. It may be pointed out that the RBI had recently cut the GDP target. The fiscal deficit target will meet with better spending. The Finance Ministry said digitisation and Aadhaar seeding of Public Distribution System (PDS) is being pursued all over the country to lay the foundation for next generation of PDS reforms along the lines of the JAM trinity outlined in the Economic Survey of 2015-16. Overall, expenditure on major subsidies as a percentage of GDP has come down from 2.5% of GDP in 2012-13 to 1.6% of GDP in 2015-16 as direct benefit transfer schemes in LPG, diesel deregulation, lower diversion of fertiliser through neem-coated urea and lower prices of oil kicked in. Higher growth is being driven by stronger government spending on infrastructure. Infrastructure spending has picked up on the back of accelerated government spending on highways, railways and the power sector. The Finance Ministry noted that the Plan capex has increased by over 30% this year. This is beginning to crowd-in private investment, and the public-private partnership projects which had stalled are also now picking up. The Finance Secretary said the government has achieved 10% increase in tax devolution to the states, achieved over 30% increase in the Plan capex, and yet, adhered to the fiscal glide path outlined in the Budget. “We continue to work together on rationalising Central sector schemes and programmes in run-up to the Union Budget 2016-17”, he added.", "external_links": [], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T02:17:27.050+03:00", "highlightTitle": ""}