{"organizations": [], "uuid": "6b6d4447c03c733bcf5e2c8ec597c61cd7beada4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/c7cfb2413e1fa587e6b31b2281457a4b758a748d/0_284_5184_3110/master/5184.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=354533154ccbcb6942fc24278c0af76c", "site_section": "http://www.theguardian.com/us", "section_title": "Latest US news, world news, sports and opinion from the Guardian | theguardian.com | The Guardian", "url": "http://www.theguardian.com/culture/2015/oct/01/jesse-williams-greys-anatomy-celebrity-culture-civil-rights", "country": "GB", "title": "Jesse Williams: 'Celebrity culture? I am not going to participate in that' | Culture", "performance_score": 2, "site": "theguardian.com", "participants_count": 5, "title_full": "Jesse Williams: 'Celebrity culture? I am not going to participate in that' | Culture | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:11:00.000+03:00", "replies_count": 4, "uuid": "f3eccf23483fa848ad7e6f8ea57c2ab19de13190"}, "author": "Jana Kasperkevic", "url": "http://www.theguardian.com/culture/2015/oct/01/jesse-williams-greys-anatomy-celebrity-culture-civil-rights#post-0", "ord_in_thread": 0, "title": "Jesse Williams: 'Celebrity culture? I am not going to participate in that' | Culture", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "T here is a heatwave making its way though Los Angeles. It’s the second week of September yet temperatures remain at 32C (89F). At 8am, most of the city is still asleep or just waking up, while surfers at Venice Beach have already spent hours searching for the perfect wave. About 5,000 of the city’s residents will wake up to no power as demand on the power grid has triggered blackouts.\nOn South La Brea Avenue, the street seems deserted except for Jesse Williams, who has seemingly appeared out of nowhere – with no car in sight or handlers in view as he casually strolls up the street. It’s a surprisingly low-key entrance into the world of a man millions of viewers watched when Grey’s Anatomy returned to ABC for its 12th season. On average, about 8.22 million viewers tuned in every Thursday night during its 11th season.\nFacebook Twitter Pinterest Jesse Williams in Grey’s Anatomy. Photograph: ABC Inc/Everett/Rex Features\nWilliams plays Jackson Avery, a handsome doctor who unlike some of his other male colleagues – McSteamy and McDreamy – has been able to escape death thus far. Yet, even if he were killed off, Williams has a back-up plan: being a civil rights attorney. It was that or being a football player, says Williams, recalling his childhood aspirations.\n“I didn’t quite fill out,” he quips before talking about his aspirations in law: “That was the plan. It still very well could be the plan. I could still get around to taking the bar. It’s what I love and what I care about. That’s why I wake up.”\nEven now as he spends most of his time in Los Angeles filming Grey’s Anatomy, Williams remains involved with the social justice movement. When he is not playing a doctor at Seattle Grace hospital, Williams serves on board of directors of Advancement Project, a civil rights organization, and he works as one of the executive producers of Question Bridge, a trans-media art project/exhibit that focused on experience of black men in the US.\n“My parents were both activists and I really connected to the social justice movement. Growing up in Chicago, that was a big part of the community that we were in and the people that were in our house,” he says. “I also lived below the poverty line for my entire childhood.”\nWhen his family moved to suburban Massachusetts during his adolescence, Williams, who is biracial, went from being one of the whitest kids in his area to being one of the darkest. While in high school, Williams became co-president of his school’s black student union.\n“It consisted of maybe 12 people because it was a white private school … the righteous 12 though,” he says smiling. After graduating from Temple University in Philadelphia, Williams became a teacher. He taught mostly high school, but also had stints in kindergarten and seventh grade. “I loved being a teacher. It’s the best thing I have ever done. My favorite job ever. I miss it every day,” says Williams.\nNow, when he’s not shooting he’s working with different organizations to empower and inform people on the ground in communities that are struggling. One of them is the Advancement Project, a civil rights organization that develops community-based solutions to help protect voting rights, increase school attendance and end the school-to-prison pipeline.\nAdvancement Project employees are “social justice ninjas”, says Williams. They do the hard work on the ground by empowering local organizers.\n“We can’t just show up and tell people what they should be doing in condescending bullshit manner, which is common for a lot of organizations,” he says.\nFacebook Twitter Pinterest ‘We can’t just show up and tell people what they should be doing in condescending bullshit manner.’ Photograph: Noah Smith for the Guardian\nA lot of Williams’ social justice work requires going where the people are – their neighborhoods, their schools, even tapping into their online communities.\nBy reaching black males online, Question Bridge has allowed them to post videos asking and answering questions that they might have always wanted other black men within and beyond their communities to answer. Part art project, part traveling exhibit , part safe space that exists within the internet; it allows black Americans to “be a village again” and helps provide answers to the younger generation, says Williams.\nThe point of Question Bridge, according to Williams, is to show everybody that black men are not the “bogey man”.\n“We are just like your husband, son, your father, your brothers. We have the same fears and worries,” says Williams. Instead of minimizing the experience of black males and the racism they experience, the project is designed to help reveal what they go through.\nBeing biracial – his mom is white and his dad is black – Williams has been able to experience both sides of the spectrum. “I have access to rooms and information. I am white and I am also black. I am invisible man in a lot of these scenarios. I know how white people talk about black people. I know how black people talk about white folks. I know I am there and everyone speaks honestly around me,” he says.\n“I remember a mom of a friend of mine in the suburbs made some comment about a black person and – I had to be 12, about 60 pounds – and I said something and she said: ‘Oh no, not you. You are not black. You are great.’ It was real. That fucking happened. And she meant it. And she meant it sincerely and sweetly. She was paying me a compliment.”\nIt’s hard to pay Williams a compliment. As we talk he actively avoids taking credit, instead bringing up everyone else who works on the projects he is involved in. He praises the Black Lives Matter organizers, “particularly the incredible women running the organization”; the Advancement Project employees; the new generation of social justice activists.\nHe’s equally loth to discuss his looks. Anyone who has watched Williams on Grey’s Anatomy has at one point or another caught a glimpse of his bare chest. Back in 2010, Shonda Rhimes, the creator of Grey’s told Entertainment Weekly : “We felt that having a shirtless Jackson Avery would be a benefit to society.”\nWhen he first joined Grey’s Anatomy, People magazine chose Williams as their sexy man of the week . Since then Cosmopolitan included him in their 2012 Fun Fearless Males list and, in 2014, BuzzFeed declared Williams to be the “ The Most Perfect Man Alive ”.\nThe day we meet, Williams is dressed in all black – neat but comfortable. His gaze is even more intense in person. But for him, his looks are just a way for him to further his projects rather than his career.\n“To some people I might be a celebrity because I’m physically attractive. We are programmed to believe that someone is attractive because they told you that blue eyes are hot. I am not going to participate in that shit,” he says. “I aim to do what I can with what I have. And I have my [looks] – you know, European beauty standards give me access to things.”\nWilliams’s cautious approach to embracing the celebrity media game may be explained by how he feels the press presents African Americans. He says that had he not interacted with other black people after moving to the suburbs, it’s likely that he too would get his information about black culture from music, TV and movies.\n“Let’s look at that. What percentage of that is going to be aggressive and formed somehow by drugs and poverty? That would inform my perspective of blackness,” he said.\nFacebook Twitter Pinterest Jesse Williams: ‘Is anger just a negative quality?’ Photograph: Noah Smith for the Guardian\n“There is zero evidence, zero evidence that black people are more inclined to be angry in vacuum than anybody else,” Williams says when I ask him about the prevailing stereotype of the angry black male and female that has haunted those in his profession as well as others – even including Barack Obama . “They are upset. Is being upset bad? Is anger just a negative quality?” Black Americans are not angry, Williams argues: rather, they are hurting.\n“It doesn’t begin with rage, right. It’s a community that’s fucking hurting and is really disappointed in itself, in the people that it trusted, in the government it paid taxes to,” he points out. “That is where the frustration comes from.”\nShortly after we began the interview, Williams warned me that he tends to ramble. It’s more than that, though. He is passionate, often losing himself in his answers, taking you with him. “I don’t know what your question was,” he says at one point, looking down at his hands. Truth is, neither do I any more.\nGrey’s Anatomy is on ABC, Thursdays at 8pm; Williams appears at the New Yorker festival on 4 Oct as part of the panel, The Fire This Time: Black in America alongside Ta-Nehisi Coates, Jelani Cobb, Claudia Rankine, Danai Gurira and David Simon", "external_links": ["https://i.guim.co.uk/img/media/804c94dfd09ed3158aced7543ddb23c7772d705d/0_0_2704_1623/master/2704.jpg?w=605&q=85&auto=format&sharp=10&s=d77b2107bff56795f6bf8c2f4015a7b3", "http://www.ew.com/article/2010/08/11/greys-anatomy-nudity-jesse-williams", "https://i.guim.co.uk/img/media/94f39137492e5d1cdc923d72a77b3bd3da655f95/0_0_5184_3456/master/5184.jpg?w=620&q=85&auto=format&sharp=10&s=79ed0d9c4959667d3a700e37b69de171", "https://i.guim.co.uk/img/media/5486071d30e0f374b6df323822f478d4c39e2a77/0_496_4914_2949/master/4914.jpg?w=300&q=85&auto=format&sharp=10&s=f8bf8422c194b50e0e2778933f6fd547", "https://i.guim.co.uk/img/media/94f39137492e5d1cdc923d72a77b3bd3da655f95/0_0_5184_3456/master/5184.jpg?w=300&q=85&auto=format&sharp=10&s=b6110ffe466ae1892a8ced2fe9f1e25f", "http://www.people.com/people/archive/article/0,,20314000,00.html", "https://www.brooklynmuseum.org/exhibitions/question_bridge/", "http://questionbridge.com/", "http://www.latimes.com/local/lanow/la-me-ln-power-outages-extreme-heat-southern-california-20150909-story.html", "http://www.cosmopolitan.com/entertainment/celebs/news/a3751/fun-fearless-males-2012-jesse-williams/", "http://www.pinterest.com/pin/create/button/?description=Jesse+Williams%3A+%27Celebrity+culture%3F+I+am+not+going+to+participate+in+that%27&url=http%3A%2F%2Fwww.theguardian.com%2Fculture%2F2015%2Foct%2F01%2Fjesse-williams-greys-anatomy-celebrity-culture-civil-rights&media=http%3A%2F%2Fmedia.guim.co.uk%2F94f39137492e5d1cdc923d72a77b3bd3da655f95%2F0_0_5184_3456%2F5184.jpg", "https://twitter.com/intent/tweet?text=Jesse%20Williams%3A%20", "https://i.guim.co.uk/img/media/94f39137492e5d1cdc923d72a77b3bd3da655f95/0_0_5184_3456/master/5184.jpg?w=445&q=85&auto=format&sharp=10&s=97d6684f8f0fb98822cd75c7cf0e8b11", "https://i.guim.co.uk/img/media/5486071d30e0f374b6df323822f478d4c39e2a77/0_496_4914_2949/master/4914.jpg?w=620&q=85&auto=format&sharp=10&s=6fdfc24d4e78e8bb7a7a1886b33af9e4", "https://i.guim.co.uk/img/media/804c94dfd09ed3158aced7543ddb23c7772d705d/0_0_2704_1623/master/2704.jpg?w=300&q=85&auto=format&sharp=10&s=72d099c2a7cdc3e5e49a93f55c62f074", "https://i.guim.co.uk/img/media/804c94dfd09ed3158aced7543ddb23c7772d705d/0_0_2704_1623/master/2704.jpg?w=380&q=85&auto=format&sharp=10&s=b0a7355af0acdd678b983a090b31bca5", "https://i.guim.co.uk/img/media/5486071d30e0f374b6df323822f478d4c39e2a77/0_496_4914_2949/master/4914.jpg?w=445&q=85&auto=format&sharp=10&s=3a17c57503c178f70b818218a52500f0", "http://tvseriesfinale.com/tv-show/greys-anatomy-season-11-ratings-34077/", "https://i.guim.co.uk/img/media/5486071d30e0f374b6df323822f478d4c39e2a77/0_496_4914_2949/master/4914.jpg?w=605&q=85&auto=format&sharp=10&s=fe70d3f0884dcecb6dedf6c32178d73e", "https://i.guim.co.uk/img/media/94f39137492e5d1cdc923d72a77b3bd3da655f95/0_0_5184_3456/master/5184.jpg?w=605&q=85&auto=format&sharp=10&s=37819a037e99b09ed5d5b9e3eb53643b", "https://i.guim.co.uk/img/media/94f39137492e5d1cdc923d72a77b3bd3da655f95/0_0_5184_3456/master/5184.jpg?w=380&q=85&auto=format&sharp=10&s=c47b24575be23eaf5d16410bc2c81151", "https://i.guim.co.uk/img/media/804c94dfd09ed3158aced7543ddb23c7772d705d/0_0_2704_1623/master/2704.jpg?w=620&q=85&auto=format&sharp=10&s=a50417a652d1f14fa4871d398b74606c", "http://www.buzzfeed.com/hnigatu/why-jesse-williams-is-actually-the-most-perfect-man-alive", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4cgj2%2Fsfb%23img-3&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4cgj2&picture=http%3A%2F%2Fmedia.guim.co.uk%2F5486071d30e0f374b6df323822f478d4c39e2a77%2F0_496_4914_2949%2F4914.jpg", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4cgj2%2Fsfb%23img-4&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4cgj2&picture=http%3A%2F%2Fmedia.guim.co.uk%2F94f39137492e5d1cdc923d72a77b3bd3da655f95%2F0_0_5184_3456%2F5184.jpg", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4cgj2%2Fsfb%23img-2&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4cgj2&picture=http%3A%2F%2Fmedia.guim.co.uk%2F804c94dfd09ed3158aced7543ddb23c7772d705d%2F0_0_2704_1623%2F2704.jpg", "http://www.pinterest.com/pin/create/button/?description=Jesse+Williams%3A+%27Celebrity+culture%3F+I+am+not+going+to+participate+in+that%27&url=http%3A%2F%2Fwww.theguardian.com%2Fculture%2F2015%2Foct%2F01%2Fjesse-williams-greys-anatomy-celebrity-culture-civil-rights&media=http%3A%2F%2Fmedia.guim.co.uk%2F804c94dfd09ed3158aced7543ddb23c7772d705d%2F0_0_2704_1623%2F2704.jpg", "https://i.guim.co.uk/img/media/804c94dfd09ed3158aced7543ddb23c7772d705d/0_0_2704_1623/master/2704.jpg?w=445&q=85&auto=format&sharp=10&s=49cadbf029bfa65d92749cefa9b8bf54", "http://www.pinterest.com/pin/create/button/?description=Jesse+Williams%3A+%27Celebrity+culture%3F+I+am+not+going+to+participate+in+that%27&url=http%3A%2F%2Fwww.theguardian.com%2Fculture%2F2015%2Foct%2F01%2Fjesse-williams-greys-anatomy-celebrity-culture-civil-rights&media=http%3A%2F%2Fmedia.guim.co.uk%2F5486071d30e0f374b6df323822f478d4c39e2a77%2F0_496_4914_2949%2F4914.jpg"], "published": "2015-10-02T02:11:00.000+03:00", "crawled": "2015-10-02T00:10:24.900+03:00", "highlightTitle": ""}