{"organizations": [], "uuid": "f14ab51155454b5d45b721851bd7c8f22fdd4c78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sport.co.uk", "main_image": "http://images.sport.co.uk/150x150/16e0e959414590034ed5c048fc25c0d5.jpg", "site_section": "http://feeds.feedburner.com/SportcoukNewsRssFeed", "section_title": "General Sports News from Sports.co.uk", "url": "http://www.sport.co.uk/cricket/england-play-down-alastair-cook-injury-concerns/6989958/", "country": "JE", "title": "England play down Alastair Cook injury concerns", "performance_score": 0, "site": "sport.co.uk", "participants_count": 0, "title_full": "England play down Alastair Cook injury concerns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:16:00.000+02:00", "replies_count": 0, "uuid": "f14ab51155454b5d45b721851bd7c8f22fdd4c78"}, "author": "", "url": "http://www.sport.co.uk/cricket/england-play-down-alastair-cook-injury-concerns/6989958/", "ord_in_thread": 0, "title": "England play down Alastair Cook injury concerns", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alastair Cook"], "text": "England play down Alastair Cook injury concerns 25 Oct 2015 16:16:53 \ncomments \nEngland insist they have no injury concerns about Alastair Cook, despite their captain's evident discomfort while batting to try to help somehow save the second Test against Pakistan in Dubai. \nCook's brief innings, by his standards, featured much laboured running between the wickets as England's bid to bat out more than four-and-a-half sessions got under way. \nHe was out of the equation long before stumps, gone early like his opening partner Moeen Ali, and leaving Joe Root to once again stand most obviously in the way of Pakistan. \nEngland closed day four on 130 for three, with Root unbeaten after a century stand with Ian Bell and on 59 alongside Jonny Bairstow, in nominal pursuit of a world-record run chase of 491 after Pakistan declared on 354 for six. \nThe tourists must pin their hopes on elongated rearguard heroics from Root, who has had a prolific year and made 88 in the first innings. \nBut with the third and final Test already only a week away, the sight of Cook so obviously struggling appeared an obvious worry. \nNot so, however, claimed England assistant coach Paul Farbrace. \n\"I'm not aware of any injury, except for the amount of hours he's spent hunched over a bat handle scoring thousands of runs,\" he said. \n\"He never looks the best mover anyway. He is someone who from time-to-time does get treatment on his back, but honestly it's not something we are spending time talking about. \n\"He needs to manage himself and he does that really well. It isn't a concern for us.\" \nAn England team without Cook is not something Farbrace wants to think about in the foreseeable future, let alone in Sharjah next week. \nAsked that question, he said: \"Not at the moment because he has played so well. \n\"Even during the lean times run-wise, he's an important member of the team in terms of how he captains the side. \n\"The way he plays, the experience and leadership he gives our side with the way he bats, that's the greatest thing about Cooky - he leads by example. \n\"He's in great form and we want him in great form and playing for as long as possible.\" \nCook's vice-captain Root represents their best chance of avoiding a defeat which would put them 1-0 down with one to play. \nThe Yorkshireman was annoyed with himself for getting out short of his century on Saturday, a dismissal which started a collapse of seven wickets for 36 runs. \nThen, as now, England were just three down overnight - with the same two unbeaten batsmen - and it was that miserable morning session which effectively created their currently perilous position. \nFarbrace added: \"We've got to come back with the attitude that we can survive the day. \n\"I thought the way Bell and Root played, particularly against Wahab (Riaz), was impressive and that's something we have to learn from yesterday. \n\"We had a very poor session and we've got to make sure our batters don't make the same mistake twice. \n\"I thought that's what the two of them showed today - if you apply yourself and you are very clear on how you are looking to play you can survive on that pitch. \n\"We have to show we can learn quickly.\" \nYounus Khan did that long ago, and proved yet again his liking for conditions in the United Arab Emirates when he completed his 31st Test century for Pakistan. \n\"The pitches here are good for batsmen and similar to Pakistan,\" he said, having made 118 and shared a partnership of 113 with Asad Shafiq (79). \n\"That's why, whenever I play in the UAE, I perform.\" \nYounus expects England to do so too, though, and make the hosts earn victory. \nAsked if he has his eyes on a series lead here, Younus said: \"We're thinking so. But England are a tough team and may fight back. \n\"They still have good batsmen in, so there's still hard work for us to win this game.\" Related Sport News", "external_links": [], "published": "2015-10-25T18:16:00.000+02:00", "crawled": "2015-10-26T20:25:37.503+02:00", "highlightTitle": ""}