{"organizations": [], "uuid": "403772bab2c8d06aaaa5edb4d5504447aeae0183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20150927-1443381001-ns_27cowboysfalcons2_46324083_61902.jpg.ece/BINARY/original/1443381001-NS_27CowboysFalcons2_46324083_61902.JPG", "site_section": "http://www.dallasnews.com/sports/columnists/rick-gosselin/", "section_title": "Rick Gosselin Sports Columns - Sports News for Dallas, Texas ", "url": "http://www.dallasnews.com/sports/columnists/rick-gosselin/20150927-gosselin-overexposed-cowboys-defense-gets-smacked-in-the-face-by-falcons.ece", "country": "US", "title": "Overexposed Cowboys defense gets smacked in the face by Falcons", "performance_score": 0, "site": "dallasnews.com", "participants_count": 25, "title_full": "Gosselin: Overexposed Cowboys defense gets smacked in the face by Falcons | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:29:00.000+03:00", "replies_count": 56, "uuid": "2f67602891655bf3669424ca6c5fc67c752c4898"}, "author": "Gosselin", "url": "http://www.dallasnews.com/sports/columnists/rick-gosselin/20150927-gosselin-overexposed-cowboys-defense-gets-smacked-in-the-face-by-falcons.ece#post-0", "ord_in_thread": 0, "title": "Overexposed Cowboys defense gets smacked in the face by Falcons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ARLINGTON -- Barry Church sat at his locker with a bandage under his nose the length of his upper lip, covering a six-stitch gash.\nSean Lee stood at his locker with a cut of his own on a very thick lower lip that also required stitches.\nYes, the Cowboys got smacked in the face Sunday.\nThat's what happens when the Dallas defense gets overexposed -- the Atlanta Falcons did the overexposing on this day, slapping the Cowboys around for five touchdowns and 438 yards in a 39-28 triumph.\nThe Cowboys entered the game with the NFL's second-ranked defense. But let's not kid ourselves. A unit playing without its two best pass rushers (Greg Hardy and Randy Gregory), its best run defender (Rolando McClain) and its best cover cornerback (Orlando Scandrick) was not the second-best defense in all of football.\nThis unit survived the opening two weeks of the season by staying off the field. Rod Marinelli's defense played only 22 minutes, 50 seconds in a season-opening 27-26 victory over the New York Giants, then played only 19 minutes, 30 seconds in a 20-10 triumph over the Philadelphia Eagles in the second week.\nThat was just a continuation of 2014 when the Cowboys overachieved on defense playing barely 27 minutes per game. The less this defense plays, the better it plays. Fresh legs are productive legs.\nThe Cowboys had the NFL rushing champion and the best ball-control offense in the NFL a year ago to make sure the defense wasn't overexposed. The Dallas defense forced enough turnovers in 2014 to get off the field, then the legs of DeMarco Murray kept his defensive teammates off the field.\nThe defense was asked to play more than 30 minutes in a game only five times a year ago in that 12-4 season. They Cowboys lost three of those games and the needed overtime to win another of them.\nIt was more of the same Sunday. Atlanta held onto the football for more than 34 minutes, reducing the Dallas defense to the role of overmatched sparring partner. The Dallas defense couldn't get off the field in the second half -- and a Cowboys offense could not keep them off the field.\nThe Cowboys held a 28-17 halftime lead but did absolutely nothing on offense the rest of the way, managing only three first downs and 52 yards in the second half. The best way to protect your defense is to run the ball and control the clock -- yet the Cowboys ran the ball only five times in the second half for a minus-4 yards.\nThat put the pressure on the defense to win this game -- and that wasn't going to happen.\n\"We knew coming in we had to stop three things -- the running game, Julio (Jones) and Matt Ryan,\" Lee said. \"We didn't stop any of them.\"\nThe Cowboys entered the game first in the NFL in run defense, allowing only 53 yards per game. But with starter Tevin Coleman sidelined with a rib injury, Atlanta's backup tailback Devonta Freeman gashed the Cowboys for 141 yards on 30 carries.\nThe Cowboys entered the game ninth in the NFL in pass defense, allowing only 204 yards per game. But Jones caught 12 passes for 164 yards and two touchdowns on the day and Ryan completed 13-of-17 passes in the second half alone for 153 yards and both of those scores.\nThe Cowboys sacked Ryan on his first dropback but didn't get him again on his final 36 pass attempts. The Cowboys also didn't intercept any passes or recover any fumbles.\nRyan in the second half reminded me of Aaron Rodgers in the second half of the Green Bay playoff game last January. It's difficult to cover receivers when the quarterback has all day to throw, especially when one of those receivers is Julio Jones. He caught nine second-half passes for seven first downs.\nThe Falcons outscored the Cowboys 22-0 in the second half, mounting touchdown drives of 83, 89 and 62 yards. Atlanta pieced together another 80-yard touchdown drive in the first half.\nIt was an ugly afternoon for this defense.\n\"It's on me,\" Marinelli said. \"I thought we were ready. We weren't. When you don't have any takeaways, you can't stop the run, we didn't get a rush...that comes back to coaching. We just didn't execute.\"\nThis defense needs to get healthy and at full strength. In the meantime, it needs to get to the quarterback, get to the football and get off the field. The NFC East is there for the taking -- but not if the Cowboys continue to play defense like they did Sunday. The Cowboys don't necessarily need to win games on defense. But they do need to compete -- something they didn't do Sunday.\n Sportsradio 1310 AM/96.7 FM The Ticket with Norm Hitzges, and follow @RickGosselinDMN on Twitter.\nFULL COVERAGE: FALCONS 39, COWBOYS 28 Columnist's Corner\nCowlishaw: Jason Garrett's gift to Falcons triggers unstoppable Atlanta comeback\nGosselin: Overexposed Cowboys defense got smacked in the face by Falcons\nExpert opinions, analysis Moore: Dark reality of life without Tony Romo, Dez Bryant shows in Cowboys' loss\nGeorge: Brandon Weeden's 'thing of beauty' arm absent in Cowboys' loss\nSabin: 'Damn good' Julio Jones torments Cowboys cornerbacks\nBob Sturm: Cowboys' loss shows Brandon Weeden is out of his league\nPhotos, video, media\nPhotos: Super leaps from Randle, McFadden; Erin Andrews talks to Matt Cassel in Cowboys loss\nTailgating photos: Cowboys fans show weird costumes, hair, shoes and cars\nHot Air: Troy Aikman zings Brandon Weeden as Cowboys' QB debate about to take center stage\nStephen Jones on Super Bowl window: 'I feel the urgency' in Cowboys organization\nWatch: Cowboys' Joseph Randle's amazing 37-yard touchdown run\nPlayer, coaches react Terrance Williams doesn't catch a pass, lashes out at fans on Twitter\nDallas Cowboys undrafted rookie LG La'el Collins calls first NFL start 'amazing'\nFalcons safety William Moore: Defense baited Cowboys QB Brandon Weeden into key interception\nJoseph Randle: It felt like Atlanta had all 11 defenders in the box during second half\nDallas Cowboys TE Jason Witten says he feels good after playing through 3 injuries Sunday\nFalcons WR Julio Jones feels a little sorry for Cowboys CB Tyler Patmon, breaks down exactly how he beat Cowboys for two touchdowns\nFalcons explain what changed in second half in win over Cowboys: 'We had to respect the speed and start cheating up'\nDT Tyrone Crawford, Dallas Cowboys DL silent Sunday in loss to Atlanta Falcons\nWhat about those QBs?\n10 things to know about Cowboys QB Brandon Weeden, including the first impression he made on Dez Bryant\nMoore: Brandon Weeden can't play like he did last year for Cowboys to tread water until Tony Romo returns\nRemember them? 10 notable backup quarterbacks in Cowboys history\nHow quickly can Matt Cassel pick up the Cowboys playbook? He does have one advantage\nCassel fulfills childhood dream, becomes Dallas Cowboy after pregnant wife approves\n10 things you might not know about new Cowboys quarterback Matt Cassel\nSherrington: Trading for Matt Cassel more proof Cowboys are all in for 2015; will he eventually beat out Weeden?\nThe game Recap: Cowboys fail first test without Tony Romo and Dez Bryant\nWhom do you blame most for the Cowboys' loss to the Falcons?\nNational reaction: Cowboys are worst team in division with Brandon Weeden at helm\nJeremy Mincey suffered concussion during pregame warm-ups in Philadelphia\nLance Dunbar makes debut in different role as Cowboys alternate punt returners\nDallas Cowboys DE Jack Crawford fails to make impact in first NFL start\nFun stuff\nNeed a laugh after the game? Build your own Cowboys meme with our meme-generator!\nThis Cowboys truck Dez-truction is cooler than your pickup\nOn Twitter:\n @RickGosselinDMN", "external_links": ["http://beta.sportsdaydfw.com/dallas-cowboys/rickgosselin/2015/09/27/gosselin-overexposed-cowboys-defense-got-smacked-face-falcons", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/dallas-cowboys-de-jack-crawford-fails-make-impact-first-nfl-start", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/27/george-brandon-weedens-thing-beauty-arm-absent-cowboys-loss", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/lance-dunbar-makes-debut-different-role-cowboys-alternate-punt-returners", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/27/stephen-jones-super-bowl-wundow-feel-urgency-cowboys-organization", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/falcons-explain-changed-second-half-respect-speed-start-cheating", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/27/moore-dark-reality-life-without-tony-romo-dez-bryant-shows-cowboys-loss", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/27/national-reaction-cowboys-worst-team-division-brandon-weeden-helm", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/23/10-best-backup-quarterbacks-cowboys-history", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/27/sabin-damn-goodjulio-jones-torments-cowboys-cornerbacks", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/falcons-wr-julio-jones-feels-little-sorry-cowboys-cb-tyler-patmon-breaks-exactly-beat-cowboys-two-touchdowns", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/22/10-things-might-know-new-cowboys-quarterback-matt-cassel", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/jeremy-mincey-suffered-concussion-pregame-warm-ups-philadelphia", "http://beta.sportsdaydfw.com/dallas-cowboys/timcowlishaw/2015/09/27/cowlishaw-jason-garretts-gift-falcons-triggers-unstoppable-atlanta-comeback", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/dallas-cowboys-te-jason-witten-says-feels-good-playing-3-injuries-sunday", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/bob-sturm-cowboys-loss-shows-brandon-weeden-league", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/photos-super-leaps-randle-mcfadden-erin-andrews-talks-matt-cassel-cowboys-loss", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/dallas-cowboys-undrafted-rookie-lg-lael-collins-calls-first-nfl-start-amazing", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/tailgating-photos-cowboys-fans-show-weird-costumes-hair-shoes-cars", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboysheadlines/2015/09/27/hot-air-troy-aikman-zings-brandon-weeden-cowboys-qb-debate-take-center-stage", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/dt-tyrone-crawford-dallas-cowboys-dl-silent-sunday-loss-atlanta-falcons", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/blame-cowboys-loss-falcons", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/joseph-randle-felt-like-atlanta-11-defenders-box-second-half", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/recap-cowboys-fail-first-test-without-tony-romo-dez-bryant", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/falcons-safety-william-moore-defense-baited-cowboys-qb-brandon-weeden-key-interception", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/terrance-williams-catch-pass-lashes-fans-twitter", "http://beta.sportsdaydfw.com/dallas-cowboys/cowboys/2015/09/27/watch-cowboys-joseph-randles-amazing-37-yard-touchdown-run", "https://twitter.com/RickGosselinDMN"], "published": "2015-09-28T03:29:00.000+03:00", "crawled": "2015-10-13T11:29:06.577+03:00", "highlightTitle": ""}