{"organizations": [], "uuid": "eb5267a75db21f8911b2e820dc945bfc47e2eb10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_144461848168199.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=top", "site_section": "http://www.startribune.com/sports/index.rss2", "section_title": "Sports", "url": "http://www.startribune.com/lynx-fever-is-the-kind-of-series-that-should-go-down-to-the-wire/331953741/", "country": "US", "title": "Scoggins: Lynx-Fever is the kind of series that should go down to wire", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "Scoggins: Lynx-Fever is the kind of series that should go down to wire - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T06:50:00.000+03:00", "replies_count": 0, "uuid": "eb5267a75db21f8911b2e820dc945bfc47e2eb10"}, "author": "LEILA NAVIDI • leila.navidi@startribune.com", "url": "http://www.startribune.com/lynx-fever-is-the-kind-of-series-that-should-go-down-to-the-wire/331953741/", "ord_in_thread": 0, "title": "Scoggins: Lynx-Fever is the kind of series that should go down to wire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "INDIANAPOLIS ­ – Cheryl Reeve begged and pleaded and flailed her arms. The Lynx coach shed her jacket in frustration and had a constant expression of consternation and bewilderment.\nShe probably didn’t recognize the team on the floor.\nAnd, frankly, followers of the Lynx probably didn’t either.\nThe owners of two WNBA championships looked frazzled in a way that felt unusual. They were careless with the ball. They took poor shots and missed easy ones. They didn’t handle stifling defense and full-court pressure with confidence.\nThe Lynx braced for a strong pushback by the resilient Indiana Fever in Game 4 elimination scenario, and that’s precisely what they encountered in what proved to be a night of never-ending frustration.\nThe WNBA Finals have not gone the full five games since 2009. This one felt inevitable.\nThe Lynx and Fever appear so close in talent and determination that the bigger surprise would be if this series didn’t go the distance.\n“It’s definitely been a fun series for people to watch and for us to play in,” Maya Moore said before Game 4. “It’s been hard. But we embrace that.”\nMoore gave the Lynx a little life late when everything appeared lost. Her three-pointer with 4 minutes, 31 seconds left cut Indiana’s lead to 64-56 and added a little drama down the stretch.\nA hot start and early aggressiveness by the Lynx disappeared in the second quarter once center Sylvia Fowles picked up her third foul.\nThe Lynx had a few nice spurts, but for the most part, they looked ragged and out of sorts.\nThe Fever’s pressure disrupted the Lynx offense and caused them to become stagnant. Unable to get any flow, the Lynx settled for outside jumpers, while the Fever attacked the basket unencumbered with Fowles relegated to a spectator in foul trouble most of the first half.\nThe Lynx looked uncharacteristically flustered by Indiana’s physical play. Seimone Augustus missed five of her first seven shots. Anna Cruz blew a wide-open, uncontested layup. The Lynx had a shot clock violation and nearly had another in one third quarter stretch.\nAll four games have been fiercely contested, a fabulous showcase for women’s basketball. Two deep, talented teams that know how to win and expect to and have competed like mad in pursuit of a ring.\nThe first three games were decided by a total of 15 points. The largest lead in any of those games was 10 points. Nothing has come easy for either team on either end.\nVeterans on both sides appreciate what this series has done for them individually, collectively and for the overall good of their sport.\n“This is been very competitive, very high level basketball,” Lynx guard Lindsay Whalen said. “It’s just been back and forth every game.”\nIt’s been all one can hope from a championship series — two evenly matched teams challenging and bringing out the best in one another.\nForget about TV ratings and mainstream popularity of women’s basketball for a moment. That’s a discussion for another day.\nThe discussion about this particular series should revolve around the fact that both teams are putting on a fine display of tooth-and-nail basketball.\n“It’s like a really fun, focused, intense environment,” Whalen said.\nThe Lynx were prepared for another desperate effort from their opponent in Game 4. The Fever entered 4-0 in elimination games in this postseason. It had won eight of their previous 10 elimination games.\nThe Lynx were aware of Indiana’s backs-against-the-wall resolve, but Reeve didn’t feel the need to expound on it in her pregame message.\n“When you get the WNBA Finals, things that you shouldn’t be talking about is how hard you have to play,” she said. “Or being aware of how hard the other team is going to play. It goes without saying. We talk about our will and determination.”\nReeve uses an interesting analogy when explaining the loose vibe around her team. The first series, she says, is more stressful than the Finals because they’ve reached their destination at this point.\n“[Now] we’re just trying to be king of the mountain,” she said.\nThey have one more chance to prove that.", "external_links": [], "published": "2015-10-12T06:50:00.000+03:00", "crawled": "2015-10-12T07:22:26.506+03:00", "highlightTitle": ""}