{"organizations": [], "uuid": "99968f6a4843f6dcc4ff3e214d4425639cbff929", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/BC-US-Manhattan-Officer-Shot-IMG-jpg1-400x277.jpg", "site_section": "http://www.abqjournal.com/", "section_title": "Albuquerque Journal | Albuquerque and New Mexico News, Sports, Business and more", "url": "http://www.abqjournal.com/663517/news/crime/new-york-city-police-officer-dies-after-being-shot-in-head.html", "country": "US", "title": "New York City police officer dies after being shot in head", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Albuquerque Journal | New York City police officer dies after being shot in head", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:27:00.000+03:00", "replies_count": 0, "uuid": "99968f6a4843f6dcc4ff3e214d4425639cbff929"}, "author": "Michael Balsamo / Associated Press", "url": "http://www.abqjournal.com/663517/news/crime/new-york-city-police-officer-dies-after-being-shot-in-head.html", "ord_in_thread": 0, "title": "New York City police officer dies after being shot in head", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — A New York City police officer died after being shot in the head in a gun battle while pursuing a suspect following a report of shots fired, police said.\n“He is the fourth New York City police officer murdered in this city in the last 11 months,” Police Commissioner William Bratton said during a press conference at Harlem hospital where Officer Randolph Holder, 33, was pronounced dead Tuesday night. “That’s about as bad as it gets,” he said.\nOfficer Randolph Holder\nDozens of Holder’s fellow officers stood outside the hospital early Wednesday morning and saluted as the ambulance carrying their fallen comrade left. Afterward, many embraced one another.\n“Tonight, he did what every other officer in the NYPD does when the call comes — he ran toward danger,” Bratton said. “It was the last time he will respond to that call.”\nThe shooting in Manhattan’s East Harlem neighborhood happened while the 5-year veteran and his partners were responding to a call of shots fired.\nWitnesses told the officers a man had fled on a foot path and the officers encountered another man who told them an assailant had stolen his bicycle at gunpoint.\nHolder and another officer confronted the armed man and there was an exchange of gunfire at East 120 Street and the FDR Drive, Bratton said. The officer was struck and the shooter fled on foot. The suspect was caught several blocks away with a gunshot wound to his leg.\nBratton said the suspect was expected to be released from a hospital early Wednesday and transferred to police custody. The suspect was not identified.\n“We are humbled by Officer Randolph Holder’s example, an example of service and courage and sacrifice,” Mayor Bill de Blasio said. “Our hearts are heavy. We offer our thoughts and our prayers to his family.”\nDe Blasio said Holder, who joined the force in July 2010, had an “exemplary record” as a police officer.\nHolder was a native of Guyana. In the NYPD, he worked in the division that polices the city’s public housing developments. His father and grandfather both were police officers in Guyana, Bratton said.\nPatrolmen’s Benevolent Association President Patrick Lynch said: “New York City police officers everyday go out and carry themselves like superheroes but the reality is when we’re attacked we bleed, when we bleed we die and when we die we cry.”\nSo far this year, 101 police officers have died in the line of duty in the U.S. — 33 of those deaths caused by gunfire — according to the Officer Down Memorial Page. By early Wednesday, Holder’s name already had been added to the list.\n___\nAssociated Press writer Jonathan Lemire also contributed to this report.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/BC-US-Manhattan-Officer-Shot-IMG-jpg2-294x400.jpg"], "published": "2015-10-22T04:27:00.000+03:00", "crawled": "2015-10-22T16:44:06.525+03:00", "highlightTitle": ""}