{"organizations": [], "uuid": "eb465a837f4d7e103506017fa1a4fc4734d450aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/", "section_title": "Ahram Online - News, Business, Culture, Sports &amp; Multimedia from Egypt ", "url": "http://english.ahram.org.eg/NewsContent/2/8/161041/World/Region/Palestinians-torch-Jewish-shrine-amid-revolution-c.aspx", "country": "EG", "title": "Palestinians torch Jewish shrine amid 'revolution' calls - Region - World", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 2, "title_full": "Palestinians torch Jewish shrine amid 'revolution' calls - Region - World - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 1, "uuid": "eb465a837f4d7e103506017fa1a4fc4734d450aa"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/2/8/161041/World/Region/Palestinians-torch-Jewish-shrine-amid-revolution-c.aspx", "ord_in_thread": 0, "title": "Palestinians torch Jewish shrine amid 'revolution' calls - Region - World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related BDS Egypt calls for protest stand in Cairo to support Palestinian 'intifada' UN Security Council to meet on Israeli-Palestinian violence Palestinians want UN to examine protection force Israel to set-up checkpoints in East Jerusalem; Palestinian general strikes in Bethlehem, Sakhneen Palestinians torched a site revered by Jews in the West Bank overnight, Israeli and Palestinian sources said Friday, amid calls for fresh protests after more than two weeks of deadly unrest.\nVideo showed what looked like an extensive blaze at the site in the northern city of Nablus known as Joseph's Tomb, and the Israeli army called the attack \"a despicable act\" of desecration.\nPalestinians have called for a \"Friday of revolution\" against Israel and Jerusalem police barred men under 40 years of age from attending the main weekly prayers at the flashpoint Al-Aqsa mosque, seeking to keep young protesters away.\nIsraeli security forces have deployed massively in Jerusalem after two weeks of Palestinian attacks in the city and across Israel.\n\"Police and border police forces will act with determination and without compromise against any attempt to disturb order or public safety,\" a police statement said late on Thursday.\nThe United Nations Security Council will hold an emergency meeting at Jordan's request on Friday to discuss the upsurge of violence.\nIsraeli Prime Minister Benjamin Netanyahu on Thursday reiterated his willingness to meet Palestinian leader Mahmud Abbas, while accusing him of inciting and encouraging violence.\n\"It's time that president Abbas stops not only justifying it, but also calling for it,\" Netanyahu told reporters.\nUS Secretary of State John Kerry also warned the Palestinian leader not to incite violence.\n\"President Abbas has been committed to non-violence. He needs to be condemning this, loudly and clearly,\" said Kerry, who plans to travel to the region \"in the coming days\" to try to calm tempers.\nAbbas has called for peaceful protest, but frustrated Palestinian youths have defied attempts to restore calm.\nIsrael is to deploy some 300 soldiers from Sunday to reinforce police stretched thin by the unrest.\nThe last time soldiers deployed in such large numbers was in 2002, during the second intifada, according to a security source.\nJoseph's Tomb, inside a compound in the Palestinian refugee camp of Balata in Nablus, has been the scene of recurring violence between Israelis and Palestinians.\nMany Jews believe it to be the final resting place of the biblical Joseph, while Muslims believe that an Islamic cleric, Sheikh Yussef (Joseph) Dawiqat was buried there two centuries ago.\nThe shrine is under Palestinian control and off-limits to Israelis except on escorted trips organised by the army.\nThe military said it would make the repairs necessary to allow visits to continue.\n\"The burning and desecration of Joseph's tomb last night is a blatant violation and contradiction of the basic value of freedom of worship,\" spokesman Lieutenant Colonel Peter Lerner said.\n\"The Israel Defence Forces will take all measures to bring the perpetrators of this despicable act to justice, restore the site to its previous condition and ensure that the freedom of worship returns to Joseph's Tomb.\"\nOn a main road in Jerusalem, border police were boarding and searching every bus on Thursday.\nThere has been a spate of stabbing attacks and violent protests have swept the Palestinian territories.\nSeven Israelis have been killed and dozens wounded.\nAt least 30 Palestinians have also died, including alleged attackers, and hundreds more been wounded in clashes with Israeli forces.\nIn the first two Palestinian intifadas, or uprisings, in 1987-1993 and 2000-2005, thousands of people were killed and many more wounded in near daily violence.\nIsrael's best-selling newspaper, Yediot Aharonot, carried photographs on Thursday of Jews arming themselves with even broomsticks and rolling pins, as gun sellers said demand had skyrocketed.\nOn Wednesday, police began setting up checkpoints in parts of annexed east Jerusalem, including a neighbourhood which is home to three Palestinians who carried out gun, knife and car-ramming attacks this week.\nThe move followed a decision by Netanyahu's security cabinet authorising police to seal off or impose a curfew on parts of Jerusalem.\nNetanyahu has come under immense pressure to halt the violence.\nAbbas again called on Wednesday night for peaceful resistance, but young people fed up with Israel's occupation and the lack of progress in peace efforts have grown tired of his leadership.\nThe attackers seem to be mostly acting on their own. With no mastermind to pursue, that poses a major challenge to security forces.\nWhile the attacks have fanned Israeli anger and fear, online video footage of security forces shooting dead alleged assailants has fed Palestinian anger, with protesters seeing some of the killings as unjustified.\nPalestinians have been protesting for weeks against Israel's attempts to build more settlements in east Jerusalem and force out Arab residents of the city that is meant to be a capital for any future Palestinian state.\nPalestinians have also been protesting repeated Israeli and illegal Jewish settler attacks on Al-Aqsa mosque and closing the Muslim holy site on a number of occasions to worshippers.\nThe crisis started in late July when an 18-month old toddler Ali Dawabsha was burned to death and three other Palestinians were severely injured after their house in the occupied West Bank was set on fire by Israeli settlers.\nThe settlers smashed the windows of two homes in the village of Duma near Nablus and threw Molotov cocktails inside the buildings. Dawabsha died after sustaining serious burns.\nThe parents of the toddler, Riham and Saad, and their other son Ahmad lost their lives after suffering serious injuries as a result of the attack.\n* The story was edited by Ahram Online.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T20:54:53.722+03:00", "highlightTitle": ""}