{"organizations": ["Oscar Smith Tigers", "James Madison University", "Falcons", "Marlins", "South Carolina State"], "uuid": "d4438dc14f48ed57e10dc3a93c75b5341991767f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "virginiapreps.rivals.com", "main_image": "", "site_section": "http://www.rivals.com/rss2feed.asp?type=HS&state=VA", "section_title": "Virginia High School Sports Headlines", "url": "https://virginiapreps.rivals.com/content.asp?CID=1810820", "country": "US", "title": "Cox blanks Bayside 20-0", "performance_score": 0, "site": "rivals.com", "participants_count": 0, "title_full": "Cox blanks Bayside 20-0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T07:59:00.000+03:00", "replies_count": 0, "uuid": "d4438dc14f48ed57e10dc3a93c75b5341991767f"}, "author": "", "url": "https://virginiapreps.rivals.com/content.asp?CID=1810820", "ord_in_thread": 0, "title": "Cox blanks Bayside 20-0", "locations": ["Landstown", "Bayside"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jacquez McClenon", "Zack Lerman", "Williams", "Kempsville", "Matt DeMasi", "Cole Johnson", "Tayvion Robinson", "Anne", "Chris Beaver", "Jake Herslow", "PAT", "Johnson", "Matthew Broccoletti", "Jordan Williams", "Nate Hoogstra", "A.J. Smith", "Kellam", "Evan Couch", "Joe Fuller", "DeMasi", "Donte Lampley"], "text": "DeMasi 2 yards, PAT failed 20-0 KEYS TO VICTORY GAIN AN EARLY ADVANTAGE On their opening possession of the game, the Falcons pieced together an eight-play, 70-yard drive that took almost five minutes off the clock, aided by three Bayside penalties, capped by a three-yard run from senior Matt DeMasi . The Falcons looked sharp up front using a combination of power runs and misdirection counters to keep the Marlins defense on their heels, a scene that would repeat itself much of the first half. Carrying their 7-0 advantage in to the second quarter, the Falcons offense once again marched down the field advancing 63 yards on 12 plays to add to their lead when quarterback Cole Johnson found junior wide receiver A.J. Smith (pictured) alone in the end zone from 12 yards out. The drive was kept alive twice with third down conversions including once on a 24-yard strike from Johnson to freshman wide out Tayvion Robinson . Though the James Madison University commit didn't put up eye-popping numbers on the night connecting on 4 of 12 passes for 88 yards, he made key plays throughout the contest that kept the Marlins at bay. With just over three minutes left in the first half, Johnson hit Jake Herslow for a 37-yard completion that set up DeMasi's second touchdown run of the night as the tailback punched it across from two yards out with 2:53 left in the half to cap the scoring for the night. CONTROL THE LINE OF SCRIMMAGE From left to right along the offensive front, junior Jordan Williams , senior Chris Beaver , senior Nate Hoogstra , senior Zack Lerman and sophomore Evan Couch (pictured) set the tone for the Falcons offense all night. The group paved the way for a running game that amassed 185 yards on 50 attempts while adding another 88 yards through the air. Also, Johnson was never sacked on the night and complemented DeMasi's big night with 20 yards of his own. Two of the Falcons three scoring drives were clock-killing grind-it-out efforts as they traveled 70 yards in five minutes for their first score, then added a second scoring drive of 63 yards in 5:44 in pounding the middle of the Bayside defense. They pieced together another big drive in the second half that ate up 4:22 off the clock, but failed to get any points out of it missing a field goal LIMIT OPPORTUNITIES The shutout marked the first time that Bayside has been blanked since the 2013 postseason when they were sent home by the Oscar Smith Tigers in a 35-0 loss. It was their first regular season shutout since 2012 when Ocean Lakes blanked them 45-0 in the fourth game of the season. The Cox defense notched four shutouts last season as they held Landstown, Princess Anne, Kellam and Kempsville scoreless, but this was their first shut out of 2015. Defensively, Williams and seniors Joe Fuller and Jacquez McClenon (pictured) were disruptive and in the face of Marlins quarterback Donte Lampley , a South Carolina State commit, all night long. the trio collected seven tackles for loss with three sacks and several hurries as they limited the Bayside attack to just 107 yards on 9 of 26 passing. In total, the Marlins offense generated only 47 yards on 36 plays rushing for -60 on the night. That included just 15 yards totaled through Bayside's first eight possessions with a pair of turnovers collected as both DeMasi and junior linebacker Matthew Broccoletti picked off Marlins' passes on the night. Of the Marlins' ten possessions on the night, only one lasted more than four plays as they were forced to punt five times, ended three drives on downs and were intercepted twice.", "external_links": [], "published": "2015-10-06T07:59:00.000+03:00", "crawled": "2015-10-06T08:13:55.522+03:00", "highlightTitle": ""}