{"organizations": [], "uuid": "9aec468256dd440b517b9f1042cc420a14ab058e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/sports/mlb", "section_title": "MLB News, Scores, Schedule, Standings, Stats, Photos, Videos - Baseball - MSN Sports", "url": "http://www.msn.com/en-us/sports/mlb/volquez-blue-jays-may-have-stolen-signs/ar-BBmfPqg", "country": "US", "title": "Volquez: Blue Jays may have stolen signs", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "Volquez: Blue Jays may have stolen signs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 2, "uuid": "9aec468256dd440b517b9f1042cc420a14ab058e"}, "author": "Steve Gardner, USA TODAY Sports", "url": "http://www.msn.com/en-us/sports/mlb/volquez-blue-jays-may-have-stolen-signs/ar-BBmfPqg", "ord_in_thread": 0, "title": "Volquez: Blue Jays may have stolen signs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Volquez: Blue Jays may have stolen signs USA Today Sports 11 hrs ago by Steve Gardner, USA TODAY Sports © John E. Sokolowski, USA TODAY Sports Volquez: Blue Jays may have stolen signs TORONTO – The Toronto Blue Jays tied for the best home record in the American League during the regular season, but their opponents in the league championship series think they may have an even bigger advantage in the postseason.\nAdChoices There’s speculation among some Kansas City Royals players that Jays hitters may have been stealing signs during Game 3.\nToronto exploded for nine runs in the second and third innings – eight of them charged to Royals starter Johnny Cueto – on the way to an 11-8 victory Monday night.\nIn a pregame press conference Tuesday, Kansas City’s Game 5 starter, Edinson Volquez, revealed that Cueto felt the Jays hitters might have known what kind of pitch he was going to throw before he threw it.\n“Johnny said last night, but that's your fault. You've got to hide the ball and have better communication with the catcher giving you signs when you're pitching,” Volquez said.\n“We've got a lot of friends on different teams, they always say that, they give the signs or whatever it is. But I don't go crazy with it. I just want to pitch my own game.”\nIn the second and third innings, six Blue Jays faced Cueto with a runner on second base - often a scenario where runners can pass signs on to the batter. Four of six Toronto hitters reached base in those situations - including the game's key blows, a go-ahead two-run single by Ryan Goins in the second inning and Troy Tulowitzki's three-run homer in the third.\nVolquez indicated Cueto also wondered about the possibility of a Toronto \"eye in the sky\" in center field that possibly aided the cause, too.\n\"I think he said last night, they got a guy in center field,\" Volquez said. \"You see how hard it is, he looks to center field and he see somebody do this or do that, it's really hard to do that. I don't know, he said that. But when the guy gets on second base, he said something about that, too, they were giving signs to the hitter. But I don't know.\"\nCueto seemed uncomfortable from the beginning of Game 3, throwing 25 pitches in each of the first two innings and ultimately leaving in the third without recording an out and with the Royals in a 7-2 hole.\nHe said there was a noticeable difference in the height of the bullpen mound and the one on the field – but said he should have been able to make the necessary adjustments.\nCueto allowed six hits and four walks in his two-plus innings.\nHowever, he could get another shot at the Blue Jays if the ALCS goes the full seven games. Fortunately for Cueto, that game would be played back home at Kauffman Stadium in Kansas City.\nGo to MSN Home", "external_links": ["http://www.usatoday.com/sports/", "http://go.microsoft.com/fwlink/?LinkID=286759"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T08:48:32.832+03:00", "highlightTitle": ""}