{"organizations": ["Reuters", "Manchester City"], "uuid": "f7e49dd0bc568d5aa9197ee1ea06c794af1f196a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jakartaglobe.beritasatu.com", "main_image": "http://img.thejakartaglobe.com/2015/10/2015-10-17T144242Z_88094562_MT1ACI14101201_RTRMADP_3_SOCCER-ENGLAND-MCI-BOU-1024x594.jpg", "site_section": "http://jakartaglobe.beritasatu.com/rss/sports/", "section_title": "Sports | Jakarta Globe", "url": "http://jakartaglobe.beritasatu.com/football/man-city-wary-injuries-big-week/", "country": "ID", "title": "Man City Wary of More Injuries in Big Week", "performance_score": 0, "site": "beritasatu.com", "participants_count": 0, "title_full": "Man City Wary of More Injuries in Big Week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:02:00.000+03:00", "replies_count": 0, "uuid": "f7e49dd0bc568d5aa9197ee1ea06c794af1f196a"}, "author": "", "url": "http://jakartaglobe.beritasatu.com/football/man-city-wary-injuries-big-week/", "ord_in_thread": 0, "title": "Man City Wary of More Injuries in Big Week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wilfried Bony"], "text": "Man City Wary of More Injuries in Big Week i Manchester City's Raheem Sterling scores their third goal as Wilfried Bony looks on. (Reuters Photo/Jason Cairnduff) By : Steve Tongue | on 1:02 PM October 20, 2015 \nLondon. Manchester City will be almost as concerned to avoid further injuries as they are to take three Champions League points when Sevilla visit the Etihad Stadium on Wednesday. \nFour days later Premier League leader City has a big local derby at third-placed Manchester United. \nManuel Pellegrini's side is already without top scorer Sergio Aguero who hit six goals in two games, five of them in 20 minutes against Newcastle United, before suffering a hamstring problem playing for Argentina. \nPlaymaker David Silva was also injured on international duty and will miss Wednesday's game against his fellow countrymen. \nCaptain Vincent Kompany was not considered fit enough to play in Saturday's 5-1 win over lowly Bournemouth while midfielder Samir Nasri strained a hamstring injury in that game. \n\"I prefer to play with Aguero and Silva,\" Pellegrini told reporters before adding he was \"very happy\" with the performances of attacking players Raheem Sterling, who scored a hat-trick, Wilfried Bony and record signing Kevin De Bruyne. \nBoth teams have three points from two Group D matches after losing to Juventus and beating Borussia Moenchengladbach. \nWednesday's game will be an emotional occasion for City winger Jesus Navas who came through Sevilla's academy and played nearly 400 times for the club. \nNavas, a World Cup and European Championship winner who last played for Spain in March 2014, won two UEFA Cups, one European Super Cup and two King's Cups before leaving for City in 2013. \nSevilla's stuttering start to their La Liga campaign continued on Saturday when the Europa League holders had to come from behind to rescue a point in a 1-1 draw at modest Basque side Eibar. \nUnai Emery's side are 12th after eight matches, having managed only two wins, although they did beat Spanish and European champions Barcelona 2-1 earlier this month. \n\"The draw left a bitter taste but was also positive as it was the third match in a row we accrued points,\" said goalkeeper Sergio Rico after the game at Eibar. \n\"That allows us to continue growing as a team although there are still things to improve.\" \nReuters", "external_links": [], "published": "2015-10-20T02:02:00.000+03:00", "crawled": "2015-10-20T19:45:20.791+03:00", "highlightTitle": ""}