{"organizations": [], "uuid": "40245e7ea81f03ac372fdf5dc0026f75f2b18874", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jpost.com", "main_image": "http://www.jpost.com/HttpHandlers/ShowImage.ashx?ID=306676", "site_section": "http://www.jpost.com/Israel-News/Sports", "section_title": "Israel Sports | The Jerusalem Post ", "url": "http://www.jpost.com/Opinion/Terra-Incognita-Irrational-fears-amid-irrational-terror-424961", "country": "IL", "title": "Terra Incognita: Irrational fears amid irrational terror - Opinion", "performance_score": 0, "site": "jpost.com", "participants_count": 1, "title_full": "Terra Incognita: Irrational fears amid irrational terror - Opinion - Jerusalem Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:24:00.000+03:00", "replies_count": 0, "uuid": "40245e7ea81f03ac372fdf5dc0026f75f2b18874"}, "author": "SETH J. FRANTZMAN", "url": "http://www.jpost.com/Opinion/Terra-Incognita-Irrational-fears-amid-irrational-terror-424961", "ord_in_thread": 0, "title": "Terra Incognita: Irrational fears amid irrational terror - Opinion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Violence involving Palestinian stabbing attacks on Jews in Israel is widely misunderstood both at home in Israel and abroad. Here are six responses that should be challenged.\nThe Oslo generation and the intifada : Some commentators have posited that the violence is tied to the “lost” generation of Oslo that had “hope” for a Palestinian state. With their hopes dashed, so the logic goes, people turn to violence in frustration. That would be a nice narrative if the math was correct. Someone who was a teenager during Oslo is today in their thirties. The “Oslo generation” was born between 1980 and 1985. But the age of those carrying out stabbing attacks is from 13 to 21. They were born in the mid-1990s.\nThose carrying out attacks were kids during the second intifada. They barely remember the terrorism and Israeli response of those days. Their response to Israel’s actions has nothing to do with the failure of Oslo. They are the post-Oslo generation, the ones who were never promised a state and never had any hope for a state.\nIntifadas and anniversaries : It is 15th anniversary of the outbreak of the second intifada. In the past weeks we have been reminded of the anniversary of Ariel Sharon’s visit to the Temple Mount, the killing of 12 Arabs in Israel during riots and the lynching of two IDF soldiers in Ramallah.\nThe “intifada” narrative for the ongoing clashes in the West Bank and the stabbings ignores the most salient feature of the last two intifadas: the presence of the Palestinian leadership. The first intifada is generally thought to have started on December 8, 1987, when an Israeli truck killed several Palestinians in Gaza. Riots and clashes spread throughout Gaza and the West Bank.\nThen defense minister Yitzhak Rabin ordered the IDF to use “force, might and beatings” to crush the uprising, which, of course, only made it worse. The PLO under Yasser Arafat attempted from the beginning to play a role in the intifada, despite being in exile in Tunisia.\nMany of those who discuss this round of stabbings argue that in fact it is part of a Jerusalem-centered rise in violence that began more than a year ago during last summer’s Gaza war. The clashes take place primarily on the seam between the Palestinian Authority-controlled areas and Israeli-controlled areas. Unlike in the second intifada, there is no role so far played by major Palestinian organizations. In fact Palestinian civil society is almost totally absent, which makes this violence totally different than that of 1987-1993 and 2000-2005. It also makes it more unpredictable and uncontrollable.\nMore soldiers for Jerusalem : The IDF is deploying six companies of soldiers to Jerusalem to bolster an Israeli police force that has called up its reserves and bused in riot police from across the country.\nIt’s not clear why more police and more soldiers in the streets will help the situation. In many cases civilian citizens or security guards have played a role in stopping stabbing attacks. Since some of the attacks have been against police and the army, having more soldiers may just create more targets.\nIn general countries that flood themselves with soldiers and police do not create a more calm public or even defeat the thing they claim to be fighting. Mexico, for instance, has always had large numbers of military and police everywhere, and that hasn’t made Mexico more safe or defeated drug-related violence. If Israel can’t defeat a few stabbing attacks a day, how will it confront a massive uprising in the West Bank that will bring far more violence?\nNetanyahu and Barkat are to blame: “I hold the prime minister responsible for every one of these stabbings,” one woman wrote on Facebook. It’s a constant refrain in some parts of the Israeli Left. At the same time a host on Channel 2 berated Jerusalem’s mayor, Nir Barkat, for the violence, implying that it stems from the city’s mismanagement of the school system in Arab areas. The feeling is that the rest of “good Israel” is a victim of the Israeli government, “the settlers” and Jerusalem. If only those could be cast aside, like weight from a balloon, then it would all be fine.\nThe theory that Jerusalem is the problem and that Prime Minister Benjamin Netanyahu’s relations with Palestinian Authority President Mahmoud Abbas are to blame create a contradictory fallacy. If the real issue is Palestinian statehood, then it can’t also be the Jerusalem issue, because the creation of a Palestinian state won’t change the status of the east Jerusalem Palestinian neighborhoods. There is no doubt that in each case the systematic discrimination creates long-term animosity.\nBut those who are to blame for stabbing people are the individuals who stab people, not some complex self-flagellating concept that if only the Israeli prime minister had a different name, all would be well.\nJohn Kerry’s bizarre statement : The US secretary of state told reporters on Tuesday that “I am not going to point fingers from afar,” about the current situation. Then he went on to point fingers.\n“This is a revolving cycle that damages the future for everybody... but when I see violence like the killing of three innocent Israelis I am going to condemn it – like we condemned the settler violence against a Palestinian family.”\nSpeaking at Harvard University he elaborated: “What’s happening is that, unless we get going, a two-state solution could conceivably be stolen from everybody... and there’s been a massive increase in settlements in the course of the last years, and now you have this violence because there’s frustration that its growing.”\nSo the finger clearly is pointed, and the problem is Israel.\nThe violence is part of a “cycle” and the real problem is that it harms Palestinians and “damages the future.”\nThe statement is as callous as telling the bleeding victim of a stabbing, “Look how you and your assailant have damaged the future for everyone.”\nThe two-state solution mantra is confusing given the fact that almost all the perpetrators are from Jerusalem, and thus were never going to be part of the two-state solution anyway. Is the violence because of frustration over lack of two states? Those with the most to gain from having a Palestinian state, i.e those who live in the PA-controlled areas, play the least role in the violence.\nThose Palestinians living in a sort of no-man’s land between the two authorities of Israel and the PA are the ones who are involved the most. Is that because of frustration? Perhaps.\nHowever many Palestinians and their supporters claim the violence stems from conspiracies claiming Israel has plans to “change the status quo” on the Temple Mount and take over al-Aksa mosque. So is it settlements or al-Aksa? They are both volatile issues that helped spark the second intifada.\nAnd what about the third common belief among Palestinians, namely that most of the perpetrators of stabbing attacks were themselves the victims of Israeli lynch mobs.\nThe three Arab women who attacked Jews were all said to have been first attacked by Israelis, who are accused of “forcing them to remove their hijabs.” The widespread belief among Palestinians is that they were not perpetrators.\nMany other attacks were explained differently as well. Fadi Alwan was just out for a jog when police “executed” him, according to many Palestinians. The two teenage Arabs who stabbed a 13-year-old Jewish boy in Pisgat Ze’ev were just innocent kids attacked by a mob. “The new Mohammed al-Dura,” said Nabil Abu Rudeineh, a Palestinian politician.\nSo if the Palestinian public’s belief is that most of the attackers are innocent, then they can’t also be martyrs fighting against settlements due to frustration, can they? Kerry’s statement is just the usual laundered response to all violence in Israel and the Palestinian areas.\nRacism against Arabs : The violence has led to numerous racist incidents. One Jewish man stabbed another Jew near Acre because he thought the man was an Arab. Another Jewish man, in Dimona, went on a stabbing spree against Beduin. Many Arabs in Israel who work with Jews have found themselves the target of comments and suspicion. This is ironic; those Arabs who did the most to integrate into Israeli culture, who speak Hebrew, who have Jewish friends and colleagues, are the ones targeted.\nThe violence then results in the same thing the last intifada caused, which is a deepening and total rift between Arabs and Jews in Israel. The long-term consequences of that are very bad for Israel’s internal politics and relations with its large minority. Growing voices emerge speaking of Arabs as a “fifth column” and seeking to “wall off their neighborhoods” in Jerusalem. On Wednesday Israel began sealing off Jebel Mukaber and erected full-time checkpoints around it. Of course, the same voices who say “wall them off” will then talk about the greatness of “united Jerusalem.” If you want to wall them off, you can’t also claim they are part of Jerusalem.\nFor years Israel walled off Shuafat camp and other neighborhoods near Qalandia that are technically within the municipal borders of Jerusalem. That isn’t a long-term solution.\nFollow the author @Sfrantzman.\n ", "external_links": [], "published": "2015-10-15T04:24:00.000+03:00", "crawled": "2015-10-14T20:26:51.130+03:00", "highlightTitle": ""}