{"organizations": ["Liberty", "Freedom Liberty High School"], "uuid": "f226463e25ba42258dbc22f8496fcfcaeb167aa3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "highschoolsports.lehighvalleylive.com", "main_image": "http://hssn-media.advance.net/PennLive.com/news/3ef59f5a12b9afda4571a05816e8f0bd/MTLibertyboyssoccerteamplaysFreedomonOct.120151.jpg", "site_section": "http://blog.lehighvalleylive.com/lehighvalleylive_high_school_sports_homepage_feed/atom.xml", "section_title": "lehighvalleylive.com High School Sports", "url": "http://highschoolsports.lehighvalleylive.com/news/article/6874237216672881193/4-throw-ins-from-liberty-boys-soccers-rainy-win-over-rival-freedom/", "country": "IL", "title": "4 throw-ins from Liberty boys soccer's rainy win over rival Freedom", "performance_score": 0, "site": "lehighvalleylive.com", "participants_count": 0, "title_full": "4 throw-ins from Liberty boys soccer's rainy win over rival Freedom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T09:11:00.000+03:00", "replies_count": 0, "uuid": "f226463e25ba42258dbc22f8496fcfcaeb167aa3"}, "author": "", "url": "http://highschoolsports.lehighvalleylive.com/news/article/6874237216672881193/4-throw-ins-from-liberty-boys-soccers-rainy-win-over-rival-freedom/", "ord_in_thread": 0, "title": "4 throw-ins from Liberty boys soccer's rainy win over rival Freedom", "locations": ["Bethlehem"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Liberty High School's boys soccer team picked up its fifth win in a row by downing rival Freedom 2-1 on Thursday night at Bethlehem Area School District Stadium. \nHere are 4 takeaways from the Eastern Pennsylvania Conference Steel Division game: \n1. Hey, are you awake back there? Liberty has the capability to dominate possession, which is great but goalkeepers can slip into naptime when the ball is on the other side of the field a ton. Keeper Tony Silva didn't run into that issue on Thursday, however, as Freedom challenged the senior early. \nSteven Riad nodded a ball to Mezen Abdalla near the midway point of the first half. Abdalla got his shot off but Silva (five saves, unofficially) charged quickly and sprawled to block the attempt. \n\"He’s done a great job of staying focused even though a lot of times — not in this game — he’s not seeing the ball a whole lot,\" Liberty coach Jason Horvath said. \n\"I like to get into the swing of things,\" Silva said. \"It’s never good to fall asleep out there. There’s nothing worse than that because then, when you are called upon, it’s easier to make a mistake. You’re not as sharp. It’s nice to get a few shots early to kind of settle into things. I was lucky enough to make a good save on that first chance that they had.\" \n2. Soccer showers . Recent Liberty-Freedom boys soccer games have been marked by rainstorms. Thursday was no exception. \nWet conditions on an artificial surface create a different type of pace and style to game play, for sure. \nThere would have been a soggy highlight for the ages, though, if Riad connected with his bicycle kick attempt in the first half. \n3. Fashion statements . Patriots coach Michael O'Connell has sported a neon yellow hat with matching shoes this fall. Thursday night, that look was complemented by the highlighter-like shade of the game ball. \nIt might have been possible to spot the coach and the ball if the lights went out at BASD. \n4. Talhah aka Lloyd . Liberty junior Talhah \"Lloyd\" Netherlin is one of the most dangerous wide players in the EPC. He's also not afraid to mix it up despite his shorter stature. \nNetherlin won possession in enemy territory to set up Abe Meral's game-winning goal. \n\"He’s just a great player,\" Meral said. \"For his size, he plays like he’s one of the big guys on the field. I couldn’t have asked for a better ball. It was just a great team goal.\"", "external_links": [], "published": "2015-10-02T09:11:00.000+03:00", "crawled": "2015-10-03T01:52:25.748+03:00", "highlightTitle": ""}