{"organizations": [], "uuid": "6106da19a56c192a07d1560c8b010da21766e3ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.houstonpress.com", "main_image": "http://images1.houstonpress.com/imager/u/original/7842227/houston-press-keuchel-astros-marco-torres.jpg", "site_section": "http://www.houstonpress.com/news/harden-20-how-james-harden-became-houston-s-biggest-crossover-sports-celebrity-7815671", "section_title": "Harden 2.0: How James Harden Became Houston’s Biggest Crossover Sports Celebrity | Houston Press", "url": "http://www.houstonpress.com/news/young-and-restless-the-astros-are-way-ahead-of-themselves-with-a-breakthrough-season-7842220", "country": "US", "title": "Young and Restless: The Astros are Way Ahead of Themselves With a Breakthrough Season", "performance_score": 0, "site": "houstonpress.com", "participants_count": 1, "title_full": "Young and Restless: The Astros are Way Ahead of Themselves With a Breakthrough Season | Houston Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:00:00.000+03:00", "replies_count": 0, "uuid": "6106da19a56c192a07d1560c8b010da21766e3ef"}, "author": "Sean Pendergast", "url": "http://www.houstonpress.com/news/young-and-restless-the-astros-are-way-ahead-of-themselves-with-a-breakthrough-season-7842220", "ord_in_thread": 0, "title": "Young and Restless: The Astros are Way Ahead of Themselves With a Breakthrough Season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carlos Correa couldn’t legally drink a few weeks ago, and now he is having champagne celebrations. espn.com screengrab The proverbial ink was barely dry on the Houston Astros’ 3-0 American League wildcard game victory over the New York Yankees, but the celebration was well under way. There were the Houston Astros, adorned in ski goggles, carousing and spraying booze all over anything that moved right there in the backyard of the most revered franchise in team sports.\nIn front of millions on SportsCenter, ESPN’s Buster Olney summoned Astros wunderkind Carlos Correa over for an interview on live television, which Correa happily granted, but not before joyously pepper-spraying Olney with a bottle of champagne. Correa cackled, Olney winced and Twitter laughed out loud. America, meet the Houston Astros!\nIn so many ways, that brief snapshot embodied everything about this team. Sure, there was Correa’s ear-to-ear grin, there were ski goggles and there were liquid fireworks. Frankly, the raucousness was something the Astros had perfected in 86 regular season practice sessions following their victories, turning the clubhouse each time into a makeshift nightclub called “Club Astros.”\nBut when you break down those 20 seconds beamed out to millions of homes around the world, here you had Carlos Correa, who just five months ago was neither a Major League baseball player nor legally allowed to hold an open bottle of champagne, much less spray it on another human being.\nNow, at age 21, he is the present and the future, the straw that stirs the drink for a franchise whose ceiling is still unknown.\nThe evolution of Correa is happening at warp speed, and he’s bringing the Astros with him. And according to most experts, they’re doing it ahead of schedule. “Nobody expected us to be here,” said Correa. “We trust in this group of guys, and have a lot of confidence in this group of guys.”\nSure, on paper, it was just one wildcard playoff win over a Yankees team that was a shell of its Jeter-era predecessors. Symbolically, though, for an Astros team whose road struggles were so painful that you could create a fifth Vacation movie from the carnage (33-48 on the road in 2015), the wildcard win was both breakthrough and -affirmation.\nGeneral Manager Jeff Luhnow’s analytically based blueprint for this roster is pretty simple — lots of pitching and lots of home runs. To that end, their path to the postseason was paved primarily by the only 20-game winner in the American League, Dallas Keuchel, and 230 home runs, the second highest total in baseball.\nLuhnow’s plan worked. It worked last Tuesday night, and it worked the previous six months. Keuchel’s six shutout innings against the Yankees on three days’ rest were the next chapter in the evolution of an ace. “I don’t think [Keuchel] was actually at his best,” said Astros manager A.J. Hinch. “But to say that after six innings scoreless and three hits given up is pretty remarkable. He’s usually more efficient, but he found ways to get guys out.”\nIt worked again the following week as the Astros shoved the American League’s top seeded Kansas City Royals to the brink of elimination, again behind the combination of timely hitting, home runs and a heaping helping of Keuchel. In their ace, the Astros have developed the most coveted commodity in baseball — a frontline starting pitcher whom they can pencil into the rotation and feel unflinching confidence that they will win this game. Not can win. Will win.\nAfter another positively Keuchel-ian start against the Royals Sunday afternoon (seven innings pitched, one earned run), the American League Cy Young frontrunner ran his postseason numbers to a perfect 2-0 with a sparkling 0.69 earned run average. Keuchel’s record is a perfect 16-0 at Minute Maid Park this season. This postseason stage, so daunting that it oftentimes consumes great young pitchers initially (See: Kershaw, Clayton), for Keuchel may as well have been a chaise lounge. He looked that comfortable.\nIn assembling this group, Luhnow has managed to meticulously balance the three main methods of player acquisition and development — homegrown minor leaguers, veteran free agents and the combo bucket of trade, waiver and Rule 5 pickups. In the process, he has constructed a roster that Forbes deemed the most efficient in baseball, with each Astros regular season win costing “only” $936,608 in players’ salary. (For a basis of comparison, each Yankee win cost more than $2.5 million, the second highest of all the postseason teams.)\nEXPAND Dallas Keuchel gives the Astros their ace in the American League arms race. Marco Torres Appropriately, each acquisition method was represented with an RBI in the 3-0 wildcard win over the Yankees — Colby Rasmus, a free agent who signed a one-year deal to come to Houston, hit a second-inning solo home run; Carlos Gomez, acquired in a trade from Milwaukee in July, hit a fourth-inning solo home run; and Jose Altuve, a product of the farm system who was here during the dark times of 2012 and 2013, capped the scoring with an RBI single in the seventh inning.\nThe Astros’ first playoff win in more than a decade was an inspired group effort, but perhaps it was also a window into what will become an expensive future for owner Jim Crane. The Astros made this run into the postseason with a Dollar General payroll of around $80 million, chump change in the continually exploding world of baseball salaries. The payroll won’t stay this low forever. It can’t.\nOne peek across the diamond and the Astros saw a Yankees team with a payroll of more than $215 million. In fact, the Astros’ starting lineup against the Yankees had a combined salary of $27,859,970. The Yankees had outfielder Jacoby Ellsbury sitting on their bench making $21 million this season.\nThe Astros will never be the Yankees in terms of player spending, but they won’t have the luxury of players like Correa, Keuchel and George Springer playing for salaries of barely $500,000 forever. At the very least, Keuchel will get a huge bump this offseason in salary arbitration, but MLB.com’s Richard Justice thinks it will be a priority for Luhnow and Crane to get all three locked into long-term deals.\n“Jim Crane and Jeff Luhnow want to keep this core together,” Justice said. “There’s no team in baseball with a brighter future than the Houston Astros. Getting Keuchel, Correa and Springer signed to long-term deals is a huge priority for them this offseason.”\nFor now, though, this is a group that, independent of whatever wealth their contracts bring, loves playing with each other. Success compounds that love. “We started accumulating those wins in April, and it started to become a reality for us that we could make the postseason,” said Luhnow after the Astros clinched a playoff spot on the final day of the regular season. “And through the ups and downs of a long season, they battled through every element of it, and I couldn’t be prouder.”\nCorrea, like most 21-year-olds who speak in texts and tweets, put it much more simply after the wildcard win: “We came here to get the job done, and we did. Now, we just keep playing baseball.”\nThe future is bright, so bright they gotta wear ski goggles.\nListen to Sean Pendergast on SportsRadio 610 from 2 to 6 p.m. weekdays. Also follow him on Twitter at twitter.com/SeanCablinasian or email him at sean.pendergast@cbsradio.com.\nContact: Sean Pendergast ", "external_links": ["http://twitter.com/SeanCablinasian", "https://www.facebook.com/HairBallsNews", "http://www.twitter.com/houstonnews_"], "published": "2015-10-13T14:00:00.000+03:00", "crawled": "2015-10-13T14:57:49.687+03:00", "highlightTitle": ""}