{"organizations": [], "uuid": "ad937b63b37996ae1b11cec334227e7e2c600ab2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30257934/thirteens-nature-travels-with-celebrated-filmmakers-dereck-and-beverly-joubert-to-discover-the-soul-of-the-elephant", "country": "US", "title": "THIRTEEN's Nature Travels with Celebrated Filmmakers Dereck and Beverly Joubert to Discover the Soul of the Elephant", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "THIRTEEN's Nature Travels with Celebrated Filmmakers Dereck and Beverly Joubert to Discover the Soul of the Elephant - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad937b63b37996ae1b11cec334227e7e2c600ab2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30257934/thirteens-nature-travels-with-celebrated-filmmakers-dereck-and-beverly-joubert-to-discover-the-soul-of-the-elephant", "ord_in_thread": 0, "title": "THIRTEEN's Nature Travels with Celebrated Filmmakers Dereck and Beverly Joubert to Discover the Soul of the Elephant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " THIRTEEN/WNET New York\nAn intimate look into the lives of one of the world's most intelligent and sensitive animals through the uniquely personal lens of extraordinary cinematic storytellers\nNEW YORK , Oct. 14, 2015 /PRNewswire-USNewswire/ -- Despite living in the wild in Botswana for 30 years, filming, researching and exploring the world they have come to know so well, award-winning filmmakers and conservationists Dereck and Beverly Joubert say they are often still surprised by what they come across on their journeys. Such was the case when the couple were exploring the backwaters of the bush one day and stumbled upon the skulls of two large bull elephants with their ivory tusks intact. To the Jouberts, this is always cause for celebration because it means the giants died of natural causes and not, for example, from poaching, snares or bullets.\nAn elephant's age can be determined by its molar teeth, and the Jouberts conclude from them that both animals died at around 70, but still had a few years left to live. So what caused these bulls to die in the same place and at the same time? The mystery so intrigues the filmmakers, they decide to spend the next two years traveling through what would have been their home range, reconstructing the lives these elephants would have led, reimagining their birth and childhood, how they would have interacted with each other, their great migrations for water with their families and the inevitable encounters with lions. Soul of the Elephant airs Wednesday, October 14, 2015 at 8 p.m. (ET) on PBS (check local listings). After the broadcast, the episode will be available for online streaming at pbs.org/nature .\nTo understand the lives of the two old bulls, the Jouberts paddle from one end of a river to the other in the Selinda Reserve, home to over 7,000 elephants in a remote corner of Botswana. Their journey brings them into extremely close contact with herds that, over time, seem to accept their presence as the couple film and photograph them. They capture scenes of a mother teaching her new calf that he can't have his milk until he stops his temper tantrum, and also manage to document elephants snoring. But there are moments when an elephant suddenly charges toward their canoe. When that happens, the experienced pair know it's best not to move, but to rather remain quiet and wait. The filmmakers only discover what caused the herd's agitation after they paddle downstream, and come upon piles of discarded bones and skulls that had been chopped away to remove the ivory.\nThe Jouberts explain that prior to 2014, hunting male elephants was legal in Botswana , and that it is traumatic for elephants to come across a killing field. The couple follow different herds on foot and place small cameras in strategic positions to capture them stopping to examine carcasses of dead elephants with their trunks, perhaps searching for the cause of death or remembering a friend. The film likens the scene to a family in mourning and suggests that these elephants, whose brains are almost five times the size of ours, are feeling emotions similar to those we might feel, showing evidence of living beings with full lives and even souls. But not all threats are from man as an elephant's raging testosterone can take its toll when one young bull is pitted against another, and a severe injury can signal death.\nTo track the herds as they head across the grasslands, the Jouberts take to the skies. They film the elephants following ancient networks of paths in search of their daily requirement of nearly a quarter pound of salt. Aerials also track each herd as it methodically crosses the floodplains, led by a matriarch giving commands with growls, trumpets and even the flapping of her ears. The families close ranks in a crisis. When a mother loses her calf at a crossing and lions begin their attack, a small group of relatives helps her rescue the calf just in time.\nBotswana is home to over one-third of the elephants living in the wild today, and is one of the few places where these animals can still live out a natural life. The Jouberts take us into that world and bring the story of the two bulls to life. They even arrive at a solution to the mystery of their deaths. Those deaths remain a cause for celebration because when an elephant dies with its ivory intact, perhaps the soul of that elephant is at peace.\nNature is a production of THIRTEEN Productions LLC for WNET. For Nature , Fred Kaufman is executive producer. Soul of the Elephant is a production of Wildlife Films and THIRTEEN Productions LLC in co-production with Terra Mater Factual Studios.\nNature pioneered a television genre that is now widely emulated in the broadcast industry. Throughout its history, Nature has brought the natural world to millions of viewers. The series has been consistently among the most-watched primetime series on public television.\nNature has won over 700 honors from the television industry, the international wildlife film communities and environmental organizations, including 12 Emmys and three Peabodys. The series received two of wildlife film industry's highest honors: the Christopher Parsons Outstanding Achievement Award given by the Wildscreen Festival and the Grand Teton Award given by the Jackson Hole Wildlife Film Festival. The International Wildlife Film Festival honored Nature executive producer Fred Kaufman with its Lifetime Achievement Award for Media.\nPBS.org/nature is the award-winning web companion to Nature , featuring streaming episodes, filmmaker interviews, teacher's guides and more.\nSupport for this Nature program was made possible in part by the Arnhold Family in memory of Clarisse Arnhold , Sue and Edgar Wachenheim III , the Kate W. Cassidy Foundation, the Lillian Goldman Charitable Trust, the Filomen M. D'Agostino Foundation, Sandra Atlas Bass , Rosalind P. Walter , Susan R. Malloy and the Sun Hill Foundation, the Arlene and Milton D. Berkman Philanthropic Fund, the Corporation for Public Broadcasting and public television viewers.\nAbout WNET\nAs New York's flagship public media provider and the parent company of THIRTEEN and WLIW21 and operator of NJTV , WNET brings quality arts, education and public affairs programming to more than 5 million viewers each week. WNET produces and presents such acclaimed PBS series as Nature , Great Performances , American Masters , PBS NewsHour Weekend , Charlie Rose and a range of documentaries, children's programs, and local news and cultural offerings available on air and online. Pioneers in educational programming, WNET has created such groundbreaking series as Get the Math , Oh Noah! and Cyberchase and provides tools for educators that bring compelling content to life in the classroom and at home. WNET highlights the tri-state's unique culture and diverse communities through NYC-ARTS , Reel 13 , NJTV News with Mary Alice Williams and MetroFocus , the multi-platform news magazine focusing on the New York region. WNET is also a leader in connecting with viewers on emerging platforms, including the THIRTEEN Explore App where users can stream PBS content for free.\nPress Materials: http://pbs.org/pressroom or http://thirteen.org/pressroom\nWebsites: http://pbs.org/nature , http://facebook/PBSNature , @PBSNature , #NaturePBS, http://pbsnature.tumblr.com , https://www.youtube.com/user/NaturePBS\nLogo - http://photos.prnewswire.com/prnh/20110922/DC73481LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/thirteens-nature-travels-with-celebrated-filmmakers-dereck-and-beverly-joubert-to-discover-the-soul-of-the-elephant-300159285.html\n ", "external_links": ["http://thirteen.org/", "http://wliw.org/", "http://www.pbs.org/newshour/", "http://www.njtvonline.org/", "http://www.pbs.org/wnet/gperf", "http://pbs.org/pressroom", "http://www.thirteen.org/explore/", "http://www.nyc-arts.org/", "http://www.pbs.org/wnet/nature", "http://photos.prnewswire.com/prnvar/20110922/DC73481LOGO", "http://pbs.org/nature", "http://www.pbskids.org/noah", "http://thirteen.org/pressroom", "http://www.prnewswire.com/news-releases/thirteens-nature-travels-with-celebrated-filmmakers-dereck-and-beverly-joubert-to-discover-the-soul-of-the-elephant-300159285.html", "http://www.charlierose.com/", "http://www.thirteen.org/sites/reel13", "http://www.pbskids.org/cyberchase", "http://www.pbs.org/nature", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC27509&Transmission_Id=201510140830PR_NEWS_USPR_____DC27509&DateId=20151014", "http://pbsnature.tumblr.com/", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20110922/DC73481LOGO", "http://www.pbs.org/wnet/americanmasters", "https://www.youtube.com/user/NaturePBS", "http://www.pbs.org/wnet/nature/", "http://www.njtvonline.org/njtoday/", "http://www.twitter.com/pbsnature", "http://www.thirteen.org/metrofocus", "https://www.facebook.com/PBSNature/", "http://www.thirteen.org/get-the-math"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T18:24:20.380+03:00", "highlightTitle": ""}