{"organizations": [], "uuid": "e1998dc1774859e5bfb701652020b178717bb025", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03468/Couplebyfire-GETTY_3468537k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11920096/breakdown-recovery-romance.html", "country": "US", "title": "The art of breakdown recovery", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The art of breakdown recovery - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:35:00.000+03:00", "replies_count": 0, "uuid": "e1998dc1774859e5bfb701652020b178717bb025"}, "author": "John O’Connor", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11920096/breakdown-recovery-romance.html", "ord_in_thread": 0, "title": "The art of breakdown recovery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More extraordinary road stories » Living in a fast-paced city has its benefits – an all-you-can-eat social buffet of restaurants, bars, museums and theatres at your fingertips. But an increasingly sophisticated, social-media-rated dating scene might demand more than the metropolis has to offer, if you want to really impress a lady. One mild winter we were blessed with a short blast of snow, so I decided to whisk a girl I was dating up to the mountains for a day trip. Not having a car (see metropolis above) I was lucky to secure a Saturday rental at short notice – a modest saloon. Wanting to get the most value out of the rental, I decided to drive as high up as I could On arrival to the airport to collect, I was informed that the Toyota Corolla I had booked was unavailable and the only alternative was a BMW M5. As one can imagine, I kept the news of the upgrade to myself to boost my profile with the girl in question. My date was duly impressed and we enjoyed a romantic afternoon and evening exploring the snow-blanketed countryside and mountains. Don't land yourself in hot water while driving in the cold Photo: Alamy Wanting to get the most value out of the rental, I decided to drive as high up as I could. Unfortunately the lane I took was a mess with ice, and the car got stuck and wouldn’t start. After an hour trying to get it out, there was no sign of it budging. It was late, dark and freezing. The car rental company couldn’t get a tow up to us until midnight, so I suggested to my now-unhappy date that we walk back to a village we had passed earlier. She agreed, I am sure through gritted teeth (part cold, part annoyed that I had taken that lane despite her protestations). My companion quickly thawed as we discovered the bar still open and comfy seats by a fire After a few miles’ walk lit by iPhone torch, we came across the quiet hamlet, finding the local inn still open. My companion quickly thawed as we discovered that the bar was still open and there were comfy seats by a roaring fire. We talked and drank hot whiskies late into the night. Choosing to stay the night, we cancelled the tow until the following day. In the morning, as we walked back to the car, she half-joked with me that the whole thing seemed like an elaborate set-up. I laughed it off, explaining that it was just a series of happy and unhappy coincidences. It didn’t help my case that I got the car started in five minutes. As told to Aisling O’Connor The AA can't promise to help you get lucky in love - but they can help with roadside assistance. Find out more at theaa.com", "external_links": [], "published": "2015-10-09T22:35:00.000+03:00", "crawled": "2015-10-09T18:39:39.265+03:00", "highlightTitle": ""}