{"organizations": [], "uuid": "b2d19d2e65e36752523ba469435b213cb86f3740", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/silversea.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/cruise/", "section_title": "Cruise News| Online Cruise Industry News| Cruise Market Trends | Cruise Business News| Travel Industry NewsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/world-renowned-explorers-to-celebrate-shackleton-centenary-with-silversea/", "country": "US", "title": "World-renowned explorers to celebrate Shackleton Centenary with Silversea - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "World-renowned explorers to celebrate Shackleton Centenary with Silversea - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "b2d19d2e65e36752523ba469435b213cb86f3740"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/world-renowned-explorers-to-celebrate-shackleton-centenary-with-silversea/", "ord_in_thread": 0, "title": "World-renowned explorers to celebrate Shackleton Centenary with Silversea - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "World-renowned explorers to celebrate Shackleton Centenary with Silversea Published on : Monday, October 5, 2015\nSilversea Expeditions, the ultra-luxury cruise line, will be operating a series of unique voyages to Antarctica in 2015 and 2016 to mark the centenary of explorer Sir Ernest Shackleton’s Endurance expedition. World-renowned explorers Rebecca Stephens MBE and Michael Palin CBE will be supporting this historic event with Silversea Expeditions and the Royal Geographical Society (with IBG).\nThe story of how Shackleton led his men in the Weddell Sea party over ice and ocean to safety is one of the greatest survival tales in human history. In November 1915 Shackleton’s ship, the Endurance, could no longer navigate the frozen waters of Antarctica and his expedition team were faced with the daunting task of surviving both the unforgiving climate and environment while waiting for the ice to break up again.\nIn November 2015, marking 100 years since the stricken expedition team managed to endure 138 days in one of the most inhospitable places on earth, the first in a series of unique Silversea expedition voyages will depart Ushuaia, Argentina, to retrace Shackleton’s journey to Antarctica. Explorer and journalist Rebecca Stephens MBE, who was the first British woman to climb Everest and the Seven Summits, will be on Silver Explorer as part of the exclusive onboard enrichment programme providing an insight into her experiences while trekking in some of the most remote regions on the planet.\nRebecca Stephens MBE said: “The story of Shackleton’s Endurance expedition is a testament to humankind’s determination and quest for discovery. Celebrating this unique centennial anniversary with Silversea Expeditions and the Royal Geographical Society is an opportunity to rediscover and bring to life this unique moment in history.”\nContinuing the centenary celebrations during November Silversea, in partnership with the Royal Geographical Society (with IBG), will host a unique Shackleton experience at the RGS headquarters for one evening in central London with the renowned travel writer, broadcaster and actor Michael Palin CBE as guest of honour.\nThe evening will mark the opening of a major exhibition “The Enduring Eye: the Antarctic Legacy of Sir Ernest Shackleton and Frank Hurley,” which will be held at the RGS from the end of November 2015 to the end of February 2016.\nMichael Palin’s journeys have taken him across the world, including the North and South Poles, the Sahara Desert, the Himalayas, Eastern Europe, and Brazil. In 2000 Palin was honoured as a Commander of the Order of the British Empire (CBE) for his services to television and between 2009 and 2012 he was president of the Royal Geographical Society.\nGuests booking one of the Antarctica 18-day voyages in November 2015, January, February, and December 2016, will hear from distinguished historians on board and visit iconic areas of the Antarctic including Elephant Island, South Shetland Islands, where Shackleton and his crew were stranded for 105 days.\nThe Antarctica voyages will call at South Georgia, where Shackleton and five of his crew first touched land after crossing 878 miles (1,413 kilometres) of ocean. Guests will also be able to visit Shackleton’s burial site in Grytviken.\nSilversea’s long-term partnership with the Royal Geographical Society (with IBG) will bring other benefits for those booked to travel on Silver Explorer. An exclusive onboard exhibition will show a specially curated gallery of images by the Endurance’s official photographer Frank Hurley, who documented the expedition on film and through iconic stills photography.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T16:15:15.534+03:00", "highlightTitle": ""}