{"organizations": [], "uuid": "7e359e12b2b017a4f7be1d205d486864a2847862", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151013Venezuela.jpg", "site_section": "http://www.ticotimes.net/categories/topics/global", "section_title": "Global Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/13/venezuelas-questionable-election-observers", "country": "US", "title": "Venezuela’s questionable election observers", "performance_score": 0, "site": "ticotimes.net", "participants_count": 2, "title_full": "Venezuela’s questionable election observers -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T06:13:00.000+03:00", "replies_count": 1, "uuid": "7e359e12b2b017a4f7be1d205d486864a2847862"}, "author": "Kevin Casas-Zamora", "url": "http://www.ticotimes.net/2015/10/13/venezuelas-questionable-election-observers", "ord_in_thread": 0, "title": "Venezuela’s questionable election observers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, D.C. – The congressional elections to be held in Venezuela in December offer a flicker of hope to a country facing dark prospects. Provided they are carried out correctly, they offer an institutional channel to manage the country’s deep political polarization and growing popular discontent. Given the near certainty that the opposition to President Nicolás Maduro’s Chavista regime will, at the very least, make important gains, the result could open the way for negotiations capable of correcting Venezuela’s self-destructive path.\nThat will not be possible, however, unless the elections are transparent and credible. In Venezuela’s volatile political climate, ensuring a fair process will require the presence of reputable international election observers – something that, so far, Maduro has refused to allow.\nAccording to the 2005 Declaration of Principles of International Election Observations , credible monitoring requires that five criteria be met. First, the observers must be autonomous – financially and otherwise – in their relationship to the host country. Second, observers must be granted unrestricted access to all aspects and phases of the election process, as well as to all of the technologies involved. Third, observers must face no restrictions in meeting with all authorities and political actors. Fourth, observers must not be subject to any pressure or threat of retaliation by any government authority. And, fifth, observers must be free to issue public statements and reports with their findings and recommendations.\nThese principles have been ratified by the United Nations, the African Union, the Organization of American States (OAS), the European Union, the Carter Center, and a long list of highly respected organizations involved in the promotion of democracy. Conspicuously absent from the list of signatories is the Union of South American Nations (UNASUR) – the only international body that Venezuelan authorities have invited to monitor the December election.\nSee also: Chávez’s other disciple, Diosdado Cabello, rises as Venezuela unravels under Maduro\nSadly, Venezuela has a long tradition of cherry-picking its election observers. Neither the OAS nor the EU has been invited to observe elections in Venezuela since 2006. The Carter Center, which issued politely worded but unmistakably critical reports after the 2012 and 2013 elections, did not receive an invitation this time around, despite its long association with the country and former U.S. President Jimmy Carter’s past praise of its vote-counting technology.\nRelying exclusively on UNASUR for election observations is deeply problematic, even if one overlooks some of its heterodox norms and practices, such as the absence of an explicit ban on receiving funding or deploying observers from host countries. What is far more worrying is that the organization has accepted the questionable preconditions imposed by Venezuela’s authorities.\nThe rules that UNASUR has agreed to uphold are so peculiar that the entire exercise is not even called election observation; it is called, tellingly, an “election accompaniment.” Under the current law, the movements and monitoring activities of UNASUR’s observers are subject to a plan previously approved by the authorities. The observers are to request explicit approval for any visit, interview, or meeting to be carried out at the office of any electoral authority. The organization is also obliged to abstain from making public statements of any kind until after the results are announced, and to keep all comments and suggestions they make to electoral authorities – including their final report – strictly confidential.\nNot surprisingly, the Venezuelan opposition – which lost the last presidential contest by one percentage point – has little confidence that UNASUR’s involvement will ensure a credible election. Nor is it surprising that opposition leaders have called for the presence of observers from the OAS, by far the most experienced body in the Western Hemisphere when it comes to election monitoring. OAS Secretary General Luis Almagro has repeatedly offered to field an electoral mission, only to be indignantly rebuffed by Maduro.\nKevin Casas-Zamora\n© 2015, Project Syndicate\nIt is unfortunate that neighboring countries like Brazil, Uruguay, Argentina, and Chile – all of which consistently hold high-quality elections – are not making more of an effort to ensure that Venezuela’s upcoming vote is free and fair. Recent polls show Maduro losing his parliamentary majority. If, instead, he wins by a slim margin, his victory, in the absence of trustworthy observers, will have no credibility. Given the potential for serious political unrest, such an outcome poses a danger to all parties involved.\nKevin Casas-Zamora, a former vice president of Costa Rica, is director of the Inter-American Dialogue’s Peter D. Bell Rule of Law Program.\n© 2015 , Project Syndicate, www.project-syndicate.org", "external_links": ["https://www.ndi.org/dop", "http://www.project-syndicate.org/"], "published": "2015-10-14T06:13:00.000+03:00", "crawled": "2015-10-15T02:32:47.478+03:00", "highlightTitle": ""}