{"organizations": [], "uuid": "b3aa27c44204c5500fe281ff5919d815276762f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/17/travel/17update-europetravel1/17update-europetravel1-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT &gt; Travel", "url": "http://www.nytimes.com/2015/10/17/travel/the-latest-on-travel-in-central-europe.html", "country": "US", "title": "The Latest on Travel in Central Europe", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "The Latest on Travel in Central Europe - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T01:27:00.000+03:00", "replies_count": 0, "uuid": "b3aa27c44204c5500fe281ff5919d815276762f9"}, "author": "Barbara Whitaker", "url": "http://www.nytimes.com/2015/10/17/travel/the-latest-on-travel-in-central-europe.html", "ord_in_thread": 0, "title": "The Latest on Travel in Central Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " A sense of normalcy has returned to Budapest’s Keleti rail station. The tent camp and thousands of migrants who jammed the area in September are gone — all that remains is an empty Migration Aid office. But while steps have been effective in controlling the flow of migrants who flooded parts of Europe from war-torn areas in the Middle East, Asia and Africa, some restrictions remain in place and the situation is constantly evolving.\nOn Friday, for example, Hungary announced it would close its border with Croatia to migrants although border crossings will remain open. Precisely what that means for travelers remains to be seen.\nContinue reading the main story Related Coverage Hungary to Close Its Border With Croatia in Migrant Crackdown OCT. 16, 2015 Air travel has not been affected by the migrant crisis in Central Europe, but on the ground diligence is needed. While normally passports would not be required within the Schengen zone of the European Union, which allows for open travel within the region, authorities in Germany , Austria and several other E.U. countries are now checking them as part of emergency measures to control the flow of migrants. Security checks on some trains and at some borders are resulting in delays. The situation is fluid, so it is best to check with rail and country-specific websites, many of which are listed below, to get the most up-to-date information on delays or rail routes that are not running.\nContinue reading the main story Closing the Back Door to Europe In recent months European nations have worked to block the main route taken by migrants fleeing war and upheaval.\n“No one can really say on Wednesday the 15th you have to avoid this border crossing,” said Sigrid Pichler, manager of public relations for the Austrian Tourist Office in New York. “It is very random.”\nAnd, whether you are traveling by car or rail, it is best to have your passport at the ready — just like the old days before the European Union; you just won’t get a stamp.\nGermany and Austria\nBorder controls introduced by the German Federal Police on Sept. 13 will remain in place at least through the end of October, officials in the country’s Ministry of the Interior announced this week. People crossing the border should be prepared to be stopped and asked for passports and visas.\n“You should have your documents ready. You should expect to be pulled out. It doesn’t matter if you’re on holiday from Italy,” said Lisa Häger? press spokeswoman in Germany’s Federal Ministry of the Interior, adding that the border is not closed and waits are not hours and hours.\nBorder controls that have been implemented are not permanent, and not every car passing through them is stopped, officials said. They work more like sobriety checkpoints in the United States where traffic is slowed and some cars are pulled out for inspection.\nAdvertisement\nContinue reading the main story Officials in Austria say roughly 5,000 to 8,000 migrants are crossing into the country daily, but that there is not a large impact on tourists. Two spots where they may be noticed by tourists is at train stations in Vienna and, more so, at the train station in Salzburg, where bottlenecks develop as migrants wait for their next move. Train service between Salzburg, Austria, and Freilassing, Germany, which had been halted at the height of the crisis, is running, but long-distance service to Munich remains suspended and regional service disrupted. For the most up-to-date information check the Austria rail website . Detailed information on rail service in Germany is available on the Deutsche Bahn website .\nFor those traveling by car across borders in Austria, the Austrian Automobile Association has real-time information and daily updates on areas where there are delays. The information is only in German, but a Web translator like Google Translate will make the information accessible. The site has details about what is happening on the borders of Germany, Hungary, Slovakia, Slovenia and Czech Republic, in some cases with details on wait times.\nAlthough it is not in a tourist area, officials cautioned drivers to avoid crossing into Austria from Hungary at Nickelsdorf because it is a migrant transit point with delays and congestion.\n“There are other border crossings further south,” Ms. Pichler said. “Granted it will take you out of your way a little bit, but you don’t have to use that.”\nHowever, she said, the situation at border crossings is unpredictable.\n“One day it can be good, the other day it can be bad,” she said. “From one day to the other we don’t necessarily know how many refugees will be coming through a crossing. They are expecting the number to go down because it is getting colder.”\nHungary\nHungary’s decision to close its border with Croatia does not mean it is shutting things down entirely. The closure is along what is known as the “green border,” and razor wire now creates a barrier along the border.\nHungary took the same action on its border with Serbia recently, and in that case migrants caught crossing the “green border” or tampering with the border fence were to be arrested. The official border crossings are reported to be open.\nHungarian officials say that despite the flood of migrants, personal safety and the safety of property remains just as high in Hungary as it has been at any time in recent years.\nSerbian and Hungarian railways report that international rail traffic between the two countries is currently operating on schedule.\nAdvertisement\nContinue reading the main story Advertisement\nContinue reading the main story The Hungarian National Railway maintains up-to-date information on its website about route disruptions. According to current information, the Budapest-Munich railjet trains are running only between Budapest and Salzburg because of border controls, with service disrupted on the EuroNight night-train lines. Hungarian authorities suggest checking the Hungarian National Police website and the Hungarian National Railway website before traveling to the country. Both websites provide information in English.\nThe key to traveling through the region is to check for changes. The situation with the migrants and the countries they are transiting remains fluid, and changes with rail service and at borders can happen quickly.\n”You just have this domino thing hanging out there, and the moment someone pulls the plug this will travel through the region quickly, and it could be a big mess for tourists,” said Martin Weiss, a spokesman for the Austrian Foreign Ministry.\nFor additional information:\nRoads:\nAustrian Automobile Association: oeamtc.at/portal/situation-an-den-grenzen+2500+1635286 (Information in German only.)\nGermany: adac.de/reise_freizeit/verkehr\nCroatia: hak.hr/de\nSlovenia: amzs.si/en/768/Traffic_report.aspx\nHungary: police.hu\nRail:\nAustrian rail information: oebb.at/en/index.jsp\nCroatia rail information: hzpp.hr/en\nGerman rail information: bahn.de/p_en/view\nHungary rail information: mavcsoport.hu/en", "external_links": ["http://www.mavcsoport.hu/en/", "http://www.oebb.at/en/", "http://static01.nyt.com/images/2015/09/15/world/europe/migrant-borders-europe-1442357424369/migrant-borders-europe-1442357424369-master495-v3.png", "http://www.hzpp.hr/en", "http://www.oebb.at/en/index.jsp", "http://translate.googleusercontent.com/translate_c?depth=1&hl=en&rurl=translate.google.com&sl=auto&tl=en&u=http://www.adac.de/reise_freizeit/verkehr/aktuelle_verkehrslage/default.aspx&usg=ALkJrhiLTjPFn3ShYFeaWUq-bcmJZ2Y7ng", "http://translate.googleusercontent.com/translate_c?depth=1&hl=en&rurl=translate.google.com&sl=auto&tl=en&u=http://www.hak.hr/de&usg=ALkJrhga0nreSpCbv7YsypbnVL-leo8yJw", "http://www.oeamtc.at/portal/situation-an-den-grenzen+2500+1635286", "http://translate.googleusercontent.com/translate_c?depth=1&hl=en&rurl=translate.google.com&sl=auto&tl=en&u=http://www.amzs.si/en/768/Traffic_report.aspx&usg=ALkJrhhGWcU9ITTp_WLNbKI3P1u3WtB7Kg", "http://translate.googleusercontent.com/translate_c?depth=1&hl=en&rurl=translate.google.com&sl=auto&tl=en&u=http://www.police.hu/hirek-es-informaciok/hatarinfo&usg=ALkJrhgCM744YGL3WWDZTjUqeGhrswxDFQ", "http://static01.nyt.com/images/2015/10/16/world/europe/20151016_hungary_hp-slide-78LH/20151016_hungary_hp-slide-78LH-thumbStandard.jpg", "http://www.bahn.de/p_en/view/", "http://www.bahn.de/p_en/view/index.shtml"], "published": "2015-10-17T01:27:00.000+03:00", "crawled": "2015-10-17T02:05:24.818+03:00", "highlightTitle": ""}