{"organizations": [], "uuid": "7269e9cda9a5d81bc343032f04f8cc13a77cb8b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailynews.com", "main_image": "http://www.dailynews.com/apps/pbcsi.dll/storyimage/LA/20151011/SPORTS/151019906/AR/0/AR-151019906.jpg?Maxh=1500&Maxw=1500", "site_section": "http://www.dailynews.com/travel", "section_title": "Travel news, photos, staycation ideas: Los Angeles Daily News", "url": "http://www.dailynews.com/sports/20151011/bonsignore-sarkisian-needs-to-get-rightx2014-but-so-does-usc-which-needs-to-turn-the-page", "country": "US", "title": "Bonsignore: Sarkisian needs to get right— but so does USC, which needs to turn the page", "performance_score": 0, "site": "dailynews.com", "participants_count": 1, "title_full": "Bonsignore: Sarkisian needs to get right— but so does USC, which needs to turn the page", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "7269e9cda9a5d81bc343032f04f8cc13a77cb8b5"}, "author": "Vincent Bonsignore", "url": "http://www.dailynews.com/sports/20151011/bonsignore-sarkisian-needs-to-get-rightx2014-but-so-does-usc-which-needs-to-turn-the-page", "ord_in_thread": 0, "title": "Bonsignore: Sarkisian needs to get right— but so does USC, which needs to turn the page", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK >> First and foremost, we wish nothing but the best for USC coach Steve Sarkisian. Whatever issues he’s dealing with , we offer him support, well wishes and prayers.\nThis isn’t about football or winning and losing or game plans.\nThis is about life.\nAnd by all accounts Sarkisian is in the fight of his life .\nHis future, personally and professionally, hangs in the balance.\nWe all have his back.\nBut if you are USC, it’s time to move on from Sarkisian and identify and hire a coach the Trojans can rely on, lean on, depend on and expect to carry one of the great football programs in the country back to national prominence.\nSarkisian isn’t that coach. For various reasons, probably.\nSome of which have to do with ability.\nBut that’s subjective, isn’t it?\nWhat we do know, what’s been made painfully clear over the last month and last few days is that Sarkisian has much more serious issues to deal with than coming up with a game plan to beat Notre Dame and UCLA and recruiting and developing the next USC Heisman Trophy winner.\nAnd we all hope he finds the peace and balancing that is eluding him.\nDoesn’t matter who you root for, either. From every corner of the Pac-12 to across college football, this is one of those moments we should set aside rooting interest and focus on what’s really important.\nThere is sports and there is life.\nThis is life.\nSomething isn’t right with Sarkisian . There is a problem .\nBased on the events of Sunday, when Sarkisian reportedly showed up to work in no condition to do his job and USC athletic director Pat Haden not only asked Sarkisian to leave, he put him on indefinite leave of absence, it’s obvious the Trojans second-year coach has some serious issues to deal with.\nWe won’t speculate what those problems are, but Sarkisian himself admitted last month he mixed medication with alcohol at a school-sponsored event with USC donors in late August. The result was an ugly and embarrassing video that went viral in which Sarkisian staggered about slurring his speech and making outlandish comments.\nHe was obviously drunk .\nHe was obviously out of control .\nBut we gave him a pass.\nOne of those nights. Some of us have been there before. Have a drink or two too many, someone hands you the mike, and, well, you get the picture.\nIn retrospect we should have all seen beyond just a guy mistakenly mixing a drink or two too many with whatever medication he was on. We should have realized something bigger and scarier was in play.\nBut we cut him some slack.\nThen came Sunday when USC players reportedly noticed Sarkisian wasn’t sober during a special teams meeting. Haden stepped in, took one look at his coach and sent him home.\nAdvertisement\nThen Haden announced Sarkisian was going on indefinite leave.\nAs the day unfolded reports of other incidents surfaced, including ones in which Sarkisian may or may not have been intoxicated on flights to and from USC games and on the field.\nIt raises serious questions about what was known and who knew it, but finger-pointing will be left for another day.\nRight now it’s about getting Sarkisian right and about what is right for USC moving forward.\nMore and more it looks like that should mean moving on without Sarkisian.\nDefensive coordinator Clay Helton takes over on an interim basis and will coach the Trojans on Saturday when they take on longtime rival Notre Dame in South Bend.\nWhatever Sarkisian is dealing with. Whatever demons he’s facing. We wish him the best.\nThat’s the life side of this complex coin.\nBut there is another side, and it’s the 100 or so kids on the USC roster and the remaining coaches and staff members and everybody who works or supports USC football.\nAnd they all deserve a leader they can count on and a coach they can truly have faith in.\nThat doesn’t appear to be Sarkisian.\nNot right now, for sure.\nAnd who really knows when or if he ever will?\nIt’s time to cut ties with Sarkisian, who obviously needs and deserves the time and space to focus on himself and work through whatever personal problems he’s dealing with.\nHe’s still young. He still has a future. If he can get himself right, he will land on his feet somewhere and hopefully reach as high and as far as he is capable.\nBut USC deserves better.\nHis current and future players do as well.\nWe can wish the best for Sarkisian while also understanding the best for USC is turning the page, cutting ties and looking for a long-term answer as the Trojans head football coach.\nSarkisian deserves the time and space to get his life back in order.\nBut his job shouldn’t necessarily be waiting for him when he does.\nAbout the Author Reach the author at vincent.bonsignore@dailynews.com or follow Vincent on Twitter: @DailyNewsVinny .\nFull bio and more articles by Vincent Bonsignore Back to top", "external_links": ["http://mn1-laweb.newscyclecloud.com/apps/pbcsi.dll/persbilde?Avis=LA&ID=32", "http://twitter.com/DailyNewsVinny"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-13T05:17:33.349+03:00", "highlightTitle": ""}