{"organizations": [], "uuid": "90df57ff4e194cd16918a90e5223795e5114ed28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30191312/navistar-selects-continental-tires-as-standard-equipment-for-all-vehicles", "country": "US", "title": "Navistar Selects Continental Tires as Standard Equipment for all Vehicles", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Navistar Selects Continental Tires as Standard Equipment for all Vehicles - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "90df57ff4e194cd16918a90e5223795e5114ed28"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30191312/navistar-selects-continental-tires-as-standard-equipment-for-all-vehicles", "ord_in_thread": 0, "title": "Navistar Selects Continental Tires as Standard Equipment for all Vehicles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Navistar, Inc.\nNavistar, Continental Sign Letter of Intent for 5-year Supply Agreement\nContinental Tires is an Industry Leader in GHG-Regulation Compliant, Low-Rolling Resistance Tires\nLISLE, Ill. , Oct. 5, Navistar, Inc. (\"Navistar\") and Continental Tire the Americas, LLC (\"Continental\") announced today that the two companies have signed a Letter of Intent for a five-year supply agreement where Continental tires will be the standard tire offering on all International ® brand medium-duty, severe service and heavy-duty trucks and all IC Bus ™ brand school buses.\n\"Continental tires are well-regarded by customers in a wide range of applications and duty cycles throughout the commercial vehicle industry and we're proud to make them the standard offering across our entire vehicle line-up,\" said Bill Kozek , president, Navistar Truck and Parts. \"Continental offers a full range of durable, low rolling resistance tires that help drive fuel efficiency improvements and maximize uptime for our customers.\"\nContinental provides offerings optimized for a wide range of commercial truck applications, which complements the diverse portfolio of vehicle options at Navistar.\nFor on-highway customers, Continental tires deliver optimized wear resistance, ground pressure distribution, rolling resistance and tire weight which results in superior fuel economy performance that will be critical in helping to meet upcoming EPA Greenhouse Gas requirements. For vehicles operating on- and off-highway, Continental tires offer durable casing designs, extra tough compounds, high-traction treads with self-cleaning characteristics, and deliver outstanding reliability. In addition to Continental's portfolio of product offerings, the tire maker also offers a suite of replacement market services including ContiFleet roadside assistance, TruckFix Emergency Road Service Program, ContiTread retread products and services, and a network of more than 430 dealers across North America . \"We're honored to be selected as the standard tire for International trucks and IC Bus school buses,\" said Wes Garber , Director of Commercial OE Sales Continental Tire the Americas. \"The performance characteristics of our tires will complement the strong performance of their vehicles.\"\nContinental tires are currently standard on International Truck severe service vocational trucks and will be standard across the International Truck and IC Bus brand portfolio starting January 2016 .\nAbout Navistar\nNavistar International Corporation (NYSE: NAV) is a holding company whose subsidiaries and affiliates produce International ® brand commercial and military trucks, proprietary diesel engines, and IC Bus ™ brand school and commercial buses. An affiliate also provides truck and diesel engine service parts. Another affiliate offers financing services. Additional information is available at www.Navistar.com .\nAbout Continental Tire the Americas, LLC\nContinental develops intelligent technologies for transporting people and their goods. As a reliable partner, the international automotive supplier, tire manufacturer, and industrial partner provides sustainable, safe, comfortable, individual, and affordable solutions. In 2014, the corporation generated sales of approximately $38.7 billion with its five divisions, Chassis & Safety, Interior, Powertrain, Tire, and ContiTech. Continental currently employs more than 205,000 people in 53 countries.\nAll marks are trademarks of their respective owners.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/navistar-selects-continental-tires-as-standard-equipment-for-all-vehicles-300154293.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.navistar.com/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG20269&Transmission_Id=201510051730PR_NEWS_USPR_____CG20269&DateId=20151005", "http://www.prnewswire.com/news-releases/navistar-selects-continental-tires-as-standard-equipment-for-all-vehicles-300154293.html"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T05:26:40.727+03:00", "highlightTitle": ""}