{"organizations": [], "uuid": "b7fedae6e6d9b0b6506bba2c2728c9e436f80424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30187162/share-the-road-highway-safety-program-visits-eight-eastern-panhandle-high-schools", "country": "US", "title": "Share the Road Highway Safety Program Visits Eight Eastern Panhandle High Schools", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Share the Road Highway Safety Program Visits Eight Eastern Panhandle High Schools - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "b7fedae6e6d9b0b6506bba2c2728c9e436f80424"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30187162/share-the-road-highway-safety-program-visits-eight-eastern-panhandle-high-schools", "ord_in_thread": 0, "title": "Share the Road Highway Safety Program Visits Eight Eastern Panhandle High Schools", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " American Trucking Associations\nNational Program Demonstrates Critical Driving Skills to Teen Drivers\nBERKELEY SPRINGS, W.Va. , Oct. 5, 2015 /PRNewswire-USNewswire/ -- The West Virginia Trucking Association and the American Trucking Associations are teaming up with the national Share the Road highway safety program Oct. 5-9 to educate high school students in the eastern panhandle how to drive safely around large trucks, organization representatives announced.\n\"We are excited to share valuable information with the young drivers of West Virginia and we hope that the students will develop stronger driving habits as a result of our visit,\" said Share the Road Professional Driver Clarence Jenkins (UPS Freight). \"Our message today will emphasize the importance of staying alert at all times while driving and how important it is to not be a distracted driver.\"\nProfessional truck drivers with millions of accident-free driving miles will demonstrate safety measures critical to saving lives on West Virginia highways to students. Students will have the opportunity to climb inside the cab of a tractor-trailer and see firsthand what a professional truck driver can and cannot see.\nIn 2013, the trucking industry in West Virginia provided 34,410 jobs or one out of 16 in the state. 84 percent of West Virginia communities depend exclusively on trucks to move their goods.\nThe event is open to media and interviews with elite drivers at the school or in the cab of a tractor-trailer during a \"ride-along\" on the highway are available and encouraged.\nThe program schedule includes:\nOct. 5 ; 8:15am-Noon\nBerkeley Springs HS\n836 Concord Avenue\nOct. 5 ; 1:15pm-2:30pm\nPaw Paw HS\n422 Moser Avenue\nOct. 6 ; 7:30am-2:30pm\nJefferson HS\n4141 Flowing Springs Road\nOct. 8 ; 11:30am-2:30pm\nBerkeley County Driver Education Range\n404 Cumbo Road, Hedgesville\nHedgesville HS, Musselman HS, Martinsburg HS, Spring Mills HS\nOct. 9 ; 7:15am-2:30pm\nBerkeley County Driver Education Range\n404 Cumbo Road, Hedgesville\nHedgesville HS, Musselman HS, Martinsburg HS, Spring Mills HS\nShare the Road is a highway safety outreach program of the American Trucking Associations that educates all drivers about sharing the roads safely with large trucks. An elite team of professional truck drivers with millions of accident-free miles deliver life-saving messages to millions of motorists annually. The safety program is sponsored by Mack Trucks Inc. and Michelin North America Inc., and supported by TA-Petro, Pre-Pass, Hyundai Translead, OmniTracs, SmartDrive and Mack Leasing and Spireon. www.atastr.org . Follow the Share the Road on Twitter and Facebook .\nAmerican Trucking Associations is the largest national trade association for the trucking industry. Through a federation of 50 affiliated state trucking associations and industry-related conferences and councils, ATA is the voice of the industry America depends on most to move our nation's freight. Follow ATA on Twitter or on Facebook . Trucking Moves America Forward\nThe West Virginia Trucking Association was formed in 1932 to bring about an organized and uniform effort within the trucking industry for increased highway safety as well as public education on the importance and value of commercial vehicle transportation. To that end, the Association has some 260 member companies and is involved in legislative representation, government relations and many highway safety programs. The WVTA is an integral part of the American Trucking Associations (ATA) headquartered in Washington, DC .\nLogo - http://photos.prnewswire.com/prnh/20140523/90962\n releases/share-the-road-highway-safety-program-visits-eight-eastern-panhandle-high-schools-300154025.html\n ", "external_links": ["https://www.facebook.com/ATAShareTheRoad", "https://twitter.com/atasharetheroad", "http://photos.prnewswire.com/prnvar/20140523/90962", "http://twitter.com/TRUCKINGdotORG", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20140523/90962", "http://www.trucking.org/Share_the_Road.aspx", "http://www.wvtrucking.com/", "http://www.atastr.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC19651&Transmission_Id=201510051020PR_NEWS_USPR_____DC19651&DateId=20151005", "http://www.prnewswire.com/news-releases/share-the-road-highway-safety-program-visits-eight-eastern-panhandle-high-schools-300154025.html", "http://www.facebook.com/pages/American-Trucking-Associations-ATA/144598425170", "http://www.trucking.org/", "http://truckingmovesamerica.com/"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T20:27:55.083+03:00", "highlightTitle": ""}