{"organizations": [], "uuid": "7fea07b6521727ee4185da27c58b6d417a8c19b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30259662/hertz-appoints-executive-vice-president-and-chief-marketing-officer", "country": "US", "title": "Hertz Appoints Executive Vice President and Chief Marketing Officer", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hertz Appoints Executive Vice President and Chief Marketing Officer - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "7fea07b6521727ee4185da27c58b6d417a8c19b7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30259662/hertz-appoints-executive-vice-president-and-chief-marketing-officer", "ord_in_thread": 0, "title": "Hertz Appoints Executive Vice President and Chief Marketing Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hertz Global Holdings, Inc.\nESTERO, Fla. , Oct. 14, 2015 /PRNewswire/ -- Matthew ( Matt) Jauchius is joining Hertz Global Holdings, Inc. (NYSE:HTZ) as executive vice president and chief marketing officer later this month. Jauchius will lead marketing strategy for the Hertz, Dollar, Thrifty and Firefly brands, including customer experience, e-commerce, loyalty program, customer relationship management, social media and ancillary revenue generation efforts worldwide. Jauchius has nearly 20 years of marketing experience in senior and executive roles at Nationwide Mutual Insurance Company and McKinsey & Company.\n\"Matt brings to Hertz significant expertise across many marketing disciplines with a strong track record of leading successful integrated brand strategies,\" said Jeff Foland , senior executive vice president and chief revenue officer. \"He is an ideal fit to lead our continued brand architecture work and reinvigorate activity around our loyalty programs and customer experience offerings. We will be leaning heavily on his leadership and experience in these areas as we bolster our brands and develop a strong, differentiated customer experience for each of them.\"\nMost recently, Jauchius served as executive vice president and chief marketing officer at Nationwide Mutual Insurance Company, where he directed a substantial integrated marketing program that included brand marketing, media, advertising, digital marketing, social media, research & analytics, public relations, communications and customer advocacy functions. There he also led a rebranding effort, strengthened the company's business partnership marketing effort and launched Nationwide's cause-related marketing efforts.\nPrior to Nationwide, Jauchius was an associate principal at McKinsey & Company, working with client marketing organizations across a number of business sectors. He developed cross-functional expertise in corporate and business unit strategy and growth, marketing and sales, overall company turnarounds and operational cost improvements.\n\"I am excited to join Hertz at such an important time in the company's history. We will be evaluating and cultivating various strategies to ensure our iconic and valued brands capture leading positions in the industry, while building a first-class experience for our customers,\" said Jauchius. \"I look forward to helping with these important efforts.\"\nJauchius has a Bachelor of Science degree in Business Administration from The Ohio State University and a Master of Business Administration from the University of Michigan .\nAbout Hertz Global Holdings, Inc.\nHertz Global Holdings, Inc. operates the Hertz, Dollar, Thrifty and Firefly car rental brands in more than 10,300 corporate and licensee locations throughout approximately 150 countries in North America, Europe, Latin America, Asia, Australia, Africa, the Middle East and New Zealand. Hertz Global Holdings, Inc. is the largest worldwide airport general use car rental company with more than 1,600 airport locations in the U.S. and more than 1,300 airport locations internationally. Product and service initiatives such as Hertz Gold Plus Rewards, NeverLost®, Carfirmations, Mobile Wi-Fi and unique vehicles offered through the Adrenaline, Dream, Green and Prestige Collections set Hertz Global Holdings, Inc. apart from the competition. Additionally, Hertz Global Holdings, Inc. owns the vehicle leasing and fleet management leader Donlen Corporation and sells vehicles through its Rent2Buy program. The Company also owns Hertz Equipment Rental Corporation (\"HERC\"), one of the largest equipment rental businesses with more than 350 locations worldwide offering a diverse line of equipment and tools for rent and sale. HERC primarily serves the construction, industrial, oil, gas, entertainment and government sectors. For more information about Hertz Global Holdings, Inc. , visit: www.hertz.com .\nPhoto - http://photos.prnewswire.com/prnh/20151014/276800\n releases/hertz-appoints-executive-vice-president-and-chief-marketing-officer-300159621.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://photos.prnewswire.com/prnh/20151014/276800", "https://photos.prnewswire.com/prnvar/20151014/276800", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/hertz-appoints-executive-vice-president-and-chief-marketing-officer-300159621.html", "http://www.hertz.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY27994&Transmission_Id=201510141123PR_NEWS_USPR_____NY27994&DateId=20151014"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T21:34:28.890+03:00", "highlightTitle": ""}