{"organizations": [], "uuid": "ca5985c4338022fec8b557b8a45b1f8a57bed6f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/IMEX-AMERICA.jpeg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/imex-america-partner-events-help-to-bring-meetings-industry-together-in-las-vegas/", "country": "US", "title": "IMEX America partner events help to bring meetings industry together in Las VegasTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "IMEX America partner events help to bring meetings industry together in Las VegasTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca5985c4338022fec8b557b8a45b1f8a57bed6f4"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/imex-america-partner-events-help-to-bring-meetings-industry-together-in-las-vegas/", "ord_in_thread": 0, "title": "IMEX America partner events help to bring meetings industry together in Las VegasTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IMEX America partner events help to bring meetings industry together in Las Vegas\nWhen IMEX America takes place in Las Vegas on October 13-15, it will again bring the US and global meetings industry together to do business, to learn and to network.As well as the three-day exhibition, there will be a vast range of co-located events organized by industry partner associations that will create more superb education and networking opportunities.\nCo-Located Events\nFirst is the SITE Young Leaders Conference starting on Sunday October 11th and continuing on to Monday. This is an important event for industry professionals under 35 and complements the IMEX-MPI-MCI Future Leaders Forum also taking place in Las Vegas later in the week.\nSmart Monday, powered by MPI, is a day packed with learning and networking events, kicking off with MPI’s first key note of the week with Lee Papa, and also featuring the PCMA Business School and the Association Focus, designed by IMEX together with ASAE and ICCA.\nAdditional Smart Monday co-located events include:\n• The CEIR Golf Classic, at Rio Secco Golf Club and sponsored by the Las Vegas Convention and Visitors Authority, a great opportunity to network with industry colleagues in a relaxed but gently competitive environment while raising funds for industry research.\n• Association Evening, sponsored by and located at SLS Las Vegas in its spectacular Foxtail Nightclub, which brings together Association Focus delegates with exhibitors who are members of one of the organizing associations .\n• SITE Nite North America, at the brand new Omnia Nightclub, Caesars Palace, is where 1200 SITE members and industry professionals get together for a superb evening of conversation and connections.\nOn Tuesday, October 13:\n• CIC Hall of Leaders&Pacesetter Awards, at the MGM Grand, honors the industry’s outstanding leaders and innovators and for its 20th anniversary event will feature a new cocktail reception format.\n• DMC Network and Ovation Talent Search, is where industry members will take the stage at the Marquee in the Cosmopolitan hotel and share their talents for a chance to win a 7-day European vacation from Starwood and 2 First Class tickets on United .\nTaking place on Wednesday, October 14, is:\n• The MPI Foundation Rendezvous, co-sponsored by Caesars&IMEX, offering a superb night of socializing and dancing to a top DJ at the spectacular Drai’s Beach Club and Nightclub at the Cromwell Boutique Hotel and Casino while raising money for the MPI Foundation.\nSource:-IMEX", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T17:11:52.680+03:00", "highlightTitle": ""}