{"organizations": [], "uuid": "170b221a064cc0f38d418c359d199d6a2e27a31c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-55ef669c/turbine/sc-trav-0908-trouble-20150902", "site_section": "http://www.chicagotribune.com/lifestyles/travel", "section_title": "Travel - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/lifestyles/travel/sc-trav-0908-trouble-20150902-column.html", "country": "US", "title": "Renter takes photo of pre-existing car damage, still gets charged", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Renter takes photo of pre-existing car damage, still gets charged - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-09-06T17:56:00.000+03:00", "replies_count": 0, "uuid": "170b221a064cc0f38d418c359d199d6a2e27a31c"}, "author": "Christopher Elliott", "url": "http://www.chicagotribune.com/lifestyles/lifestyles/travel/sc-trav-0908-trouble-20150902-column.html", "ord_in_thread": 0, "title": "Renter takes photo of pre-existing car damage, still gets charged", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Q: I need your help with a rental-car damage claim. Enterprise Rent-A-Car says that I scratched the bottom of the front fender of a car I recently rented.\nAt the time of rental, I mentioned a small scratch on the front bumper to the representative; he said it was \"normal wear and tear\" and not to worry about it. I took a photo anyway.\nUpon returning the car, the representative wrote up the scratches and asked me to sign a form acknowledging the damage, but I declined to sign it. I later received a notice followed by an invoice for more than $800.\nIn the photos taken by the damage-recovery personnel, it looks to me like they intentionally caused additional damage to the bumper. This seems bordering on fraudulent, unless it is just a camera angle.\nAnyway, the long and short of it: I didn't cause this damage. Additionally, a co-worker was with me at all times when the car was driven over two days, and he will attest to the same.\nIf you can help me resolve this, I would really appreciate it. Note that I didn't purchase the additional insurance that is offered at the time of rental, although I am an insured driver through my normal car policy.\n— Alex Silverstein, Ballston Spa, New York\nA: If you flagged the damage to your car and have a photo to prove it, then this should have been a slam-dunk case. When you returned the car, you should have shown the rental employee the image of the scratched-up front.\nScratch that. When you were handed the keys to a scratched-up car, you shouldn't have taken snapshots. You should have politely asked for a different vehicle. I know, the representative told you it was \"normal wear and tear,\" but could you show me the definition of what that means? I'll wait while you look.\nAnd please, don't let them start talking about quarters. I hear a lot about \"quarter-size dents or less\" in the damage claims that cross my desk. As in, \"If it's a quarter-size dent or less, it's normal wear and tear.\" Trust me, they have no idea. Don't let anyone give you a car with dents or scratches — ever.\nThe damage claim you refused to sign referred to a \"gash\" in the front bumper with the vague observation that \"customer was aware.\"\nThis is a strange case, because you had photographic evidence of the damage taken at the start of your rental. Enterprise came after you anyway. The damage looked worse in the picture it sent you. Personally, after reviewing both photos, I believe Enterprise is trying to charge you for the same damage.\nThe odds of your car being scratched in the same place during your rental are infinitesimally small. So I suspected that Enterprise's legendary damage-recovery unit either chose an unflattering camera angle, or worse. It looks as if you tried to appeal this to Enterprise, with no luck. By the way, I list the executives in charge of customer service on my site ( www.elliott.org/company-contacts/enterprise ).\nI contacted Enterprise on your behalf to get its side of the story. It reviewed your file and dropped the claim.\nChristopher Elliott is the ombudsman for National Geographic Traveler magazine and a co-founder of the Consumer Travel Alliance, a nonprofit organization that advocates for travelers. Because of a backlog of cases, your story may not be published for several months. Read more tips at www.elliott.org , or email chris@elliott.org .\n ", "external_links": ["http://www.elliott.org/company-contacts/enterprise", "http://www.trbimg.com/img-55ef669c/turbine/sc-trav-0908-trouble-20150902"], "published": "2015-09-06T17:56:00.000+03:00", "crawled": "2015-10-02T09:16:39.903+03:00", "highlightTitle": ""}