{"organizations": ["Myths About Air Travel"], "uuid": "07c9f6fb37272cbe4729706d70a443ca86610a07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "airtravel.about.com", "main_image": "http://f.tqn.com/y/airtravel/1/S/h/H/TR003805.jpg", "site_section": "http://z.about.com/6/o/m/airtravel_t2.xml", "section_title": "About.com Air Travel: What's Hot Now", "url": "http://airtravel.about.com/od/travelindustrynews/a/airmyth.htm", "country": "US", "title": "10 Air Travel Myths You Need to Stop Believing", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "10 Air Travel Myths You Need to Stop Believing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T14:02:00.000+03:00", "replies_count": 0, "uuid": "07c9f6fb37272cbe4729706d70a443ca86610a07"}, "author": "", "url": "http://airtravel.about.com/od/travelindustrynews/a/airmyth.htm", "ord_in_thread": 0, "title": "10 Air Travel Myths You Need to Stop Believing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Arlene Fleming"], "text": "Top 10 Myths About Air Travel and Airports By Arlene Fleming Sign Up for our Free Newsletters Thanks, You're in! Health Tip of the Day Sign up There was an error. Please try again. Please select a newsletter. Please enter a valid email address. Did you mean ? Expert Videos Jack Hollingsworth/Photodisc/Getty Images \nSo you aren't really sure about what happens if you arrive late at the airport or if the weather keeps you from flying. It's time to wade through some of the myths and confusion surrounding air travel. Top 10 myths of air travel 1. You will be compensated if your flight cancels - If it is a mechanical issue, crew is unavailable, or some other reason where the airline is at fault, compensation is definitely a possibility! However weather-related issues, or other acts of god (aog) like civil disruptions mean the airline does not owe you compensation - no hotel, meals, transportation, etc.. And if you happen to hear force majeure (another way of saying aog) being bandied about in conversation amongst airline personnel then it is something beyond the airline's control. 2. If you miss your flight you will be booked on the next one out - Not necessarily, and not necessarily for free. It depends on why you missed your flight. Did the public transit go on strike? Then an airline might waive a fee for going on the next flight out. If you are connecting and your flight in was late, an airline may have already protected you on the next flight (and hopefully advised you when you arrived from your previous flight). But if you just showed up late at the airport, the airline is in no way obligated to put you on the next flight, or any flight without charging you a fee. Sometimes you may luck out and go fee-free but it is not guaranteed.3. If your flight is cancelled because of a force majeure you will be booked on the next flight - When a flight is cancelled because of something beyond an airline's control they will book you on the next available flight. This does not mean the next flight out, but the next one that has space on it. People who are originally booked on the next flight out are not bumped because your flight cancelled. If space isn't available on the next flight you can certainly request to standby and take your chances.4. Flights hold for people who check in late - Not a chance unless you own or run the airline. When I worked in reservations, I received at least 3 or 4 phone calls a week from a passenger in some other city than where I was located telling me to get them to hold the plane as they were stuck in traffic. If you are allowed late check in flights don't hold as luggage can be removed within minutes. So if you check in late, get yourself to the gate!5. If your flight cancels you will be booked on the next available flight regardless of airline - Not so if you are on a low cost airline , and it is more difficult to get this to happen now that tickets are usually electronic, and definitely not if a force majeure caused the cancellation.6. If an airline goes bankrupt you will be protected on another airline, or be able to get your money back - Wish this could be true but it usually isn't. You may or may not get a refund eventually from an airline that has stopped operating completely. If the airline that went under had agreements with other airlines then you may be accommodated, most often on a space-available basis.7. You are more likely to be upgraded if you ask at check-in or at the gate - Let's be frank, airline agents are not thrilled when passengers on a 99 cent ticket come up asking/demanding to be upgraded. For the major airlines, there is usually a list of candidates to upgrade first should it be required such as top tier frequent flyers and passengers who are holding full fare tickets. Sometimes, every so often, if a flight is full and you volunteered to give up your seat then a much bigger, better one up front may be yours.8. It's okay to bring lighters in your carry-on luggage - Say buh-bye to your Bic if you try this, although airports in the US now generally permit lighters through airport security.9. You are more likely to get bumped up if you check in late - Most airlines, including the one I work for will bump off the latest checked in if a flight is full and we can't get volunteers. Some travel journalists advocate this, because I work for an airline and see what happens on a more frequent basis I would say this is a very, very bad strategy for trying to get upgraded.10. If you make a group booking, with your family, or a travel companion, you will be seated together - It would be nice if this was automatically true. If you can book your seat numbers in advance then things will usually work out, but if not don't panic. The gate agent will try and get those seats together and you can also ask the flight attendant to help you. Related Articles", "external_links": [], "published": "2015-10-10T14:02:00.000+03:00", "crawled": "2015-10-10T20:36:47.709+03:00", "highlightTitle": ""}