{"organizations": [], "uuid": "6e8c3a73e36ef02a948640244dd29fcf5b0984c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/cia/large/140613053345FLEX.jpg", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Halal_tourism_completely_underserviced-GN_18102015_191042/", "country": "AE", "title": "Halal tourism 'completely under-serviced’", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Halal tourism 'completely under-serviced’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:16:00.000+03:00", "replies_count": 0, "uuid": "6e8c3a73e36ef02a948640244dd29fcf5b0984c5"}, "author": "", "url": "http://www.zawya.com/story/Halal_tourism_completely_underserviced-GN_18102015_191042/", "ord_in_thread": 0, "title": "Halal tourism 'completely under-serviced’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Reuters/Ayman Saidi"], "text": "Photo Credit:Reuters/Ayman Saidi. \nSunday, Oct 18, 2015 \nAbu Dhabi - Despite a growing Muslim population across the world, which now stands at an estimated 1.8 billion people, the Halal tourism sector is still “completely under-serviced” with growing urgency for quicker investments. \nAccording to Andy Buchanan, event manager of the World Halal Travel Summit, there are many untapped markets where supply is low including India, China, and Europe \n“I believe that hotels, hospitality brands, and countries not currently looking into this space will be fast realizing they have to…So many of the worldwide hospitality brands that we’ve spoken to just were not aware in the commercial sense of the opportunities. I think what’s going to happen is that the need will outpace the availability,” Buchanan said. Speaking to Gulf News by phone, he said the hospitality industry will have to invest quicker than it currently is in order to meet the growing demand for Halal tourism.\n“What’s really interesting is that globally, there is a generic oversupply of hospitality but the reason that all eyes are on Halal tourism is because it’s completely under-serviced; there aren’t enough hotels or destination management companies providing products to this market,” he said. Halal tourism packages must adhere to Islamic beliefs and practices, which include offering Halal food and non-alcoholic drinks, and having separate swimming pools and spa facilities for men and women.\nToday, the sector is worth $140 billion a year, with the figure expected to reach $250 billion by 2020, marking a 6.5 per cent annual growth rate - almost twice as much as the 3.5 per cent growth rate in other travel categories. The figures do not include the $130 billion around Hajj and Umrah. \n“A Halal traveler tends to travel more often, stays for longer, and travels with more family members, and therefore, by default is a better tourism proposition than another tourist,” Buchanan said. \nHalal tourists also tend to spend more money during their trips, which has a knock-on impact on retailers, dining brands, and the agriculture sector. \nThe World Halal Travel Summit is taking place from October 19-21 at the Abu Dhabi National Exhibition Centre (Adnec), with over 270 international exhibitors expected to participate. \n“The reason that we’ve had so many delegates [registering] for the event is because the market is so untapped and so available for opportunities. In terms of the UAE, it’s a huge growth market…Across the UAE, it’s a huge investment [of about] $185 million in the next three years to develop hospitality projects to attract this sector,” Buchanan said. \nHe added that all hotels in the UAE are already on the Halal tourism curve as they serve Halal food, so promoting Halal packages would be easier. \n“The UAE has put major efforts to [attract] tourists from India and China, but up until now, no specific products have actually been created to attract the Muslim residents of these countries, and that is a huge opportunity,” Buchanan said. \nWhile Middle Eastern countries present the largest source markets for Halal tourism, there is also growth from European countries like the UK and Germany that are home to large Muslim populations. \nAs for destination markets, the largest historically have been Turkey and Malaysia, closely followed by the GCC, particularly the UAE. \n“The market now is changing, and many markets that weren’t aware of the opportunities many years ago like Canada, Japan, and Australia are waking up to the revenue opportunities. \nAs an example, Barcelona and Málaga have now created business units within their tourism departments to specifically cater to Gulf and North African Muslim travelers. The UK has a division within Visit Britain to do the same,” Buchanan said. \nBy Sarah Diaa Staff Reporter \nGulf News 2015. All rights reserved. © Copyright Zawya. All Rights Reserved.", "external_links": [], "published": "2015-10-19T07:16:00.000+03:00", "crawled": "2015-10-19T09:03:26.792+03:00", "highlightTitle": ""}