{"organizations": [], "uuid": "08ad262a7d92f7e7ad019e81f981a7c93640e106", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Foodie-Town-of-Ireland.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/derrylondonderry-scoops-second-in-foodie-town-competition/", "country": "US", "title": "Derry~Londonderry scoops second in Foodie Town competitionTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Derry~Londonderry scoops second in Foodie Town competitionTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "08ad262a7d92f7e7ad019e81f981a7c93640e106"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/derrylondonderry-scoops-second-in-foodie-town-competition/", "ord_in_thread": 0, "title": "Derry~Londonderry scoops second in Foodie Town competitionTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Derry~Londonderry scoops second in Foodie Town competition Published on : Friday, October 16, 2015\nThe city was just pipped at the post in a close fought battle for the title of Foodie Town of Ireland, as the Burren emerged top of the list of ten shortlisted food destinations. The judges introduced a special runners up category recognising Derry’s performance and the closeness of the final decision.\nThe city emerged second out of ten of the island’s best known food tourism hotspots including Kinsale and West Cork in the running for the Foodie Town title, and secured a top position on the fine food map; with a total of 30 towns applying for the coveted title this year.\nThe Mayor of Derry City and Strabane District, Councillor Elisha McCallion, said she was delighted that the city had been among the front runners to win the coveted title. “I think we put in a fantastic effort and to be placed second is a great endorsement of Derry as an exciting new food tourism destination and one that will really raise the city’s profile in terms of the quality of our restaurants and our local produce.\n“Council has been working closely over the past few years with food industry professionals and suppliers to significantly raise the standards of what’s on offer locally to meet the growing expectations of our international visitors. Securing second in the Foodie Town of Ireland is a huge step towards securing our goal of being one of the best locations in terms of food provenance and culinary talent.”\nTourism Officer with Derry City and Strabane District Council, Mary Blake, led in the city’s bid for the title, and was there for the announcement at a special reception in Dublin. “I was absolutely thrilled when Derry was singled out for the runner up prize for the first time in the competition, especially given the profile of the entrants,” she declared.\n“I know that our local restaurants and producers are delighted at the acknowledgement and it reflects a significant shift in the food tourism market north of the border, with both Derry and Belfast hitting the headlines in the past month. We have been working hard to build the city’s profile through events such as the Legenderry Food Festival and the Flavours of the Foyle Seafood Festival, as well as our newly launched SAINT programme, and those efforts are clearly paying off.\n“I want to thank everyone who voted and congratulate all those who have been working so hard to create new and exciting food experiences here in the North West.”\nThe outcome of the competition was decided by both an online public vote and the Restaurants Association judges, both having equal weighting in the final decision.\nFollowing the awards the Restaurants Association paid tribute to the local campaign tipping the city as a big contender for next year’s awards, and saying that Derry had gained the biggest number of public votes in the competition.\nThis is the second year of the Foodie Town of Ireland competition which recognises the efforts of towns and cities who actively promote themselves as food destinations through trails, markets and festivals dedicated to food tourism.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T07:42:32.110+03:00", "highlightTitle": ""}