{"organizations": [], "uuid": "c1ffb3173eac44838b107eec051d1a35c0b41772", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/wyndham-logo.png", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/wyndham-sets-sail-for-barbados-unveils-plans-for-islands-newest-five-star-multi-million-dollar-resort/", "country": "US", "title": "Wyndham Sets Sail for Barbados, Unveils Plans for Island's Newest, Five-Star, Multi-Million Dollar ResortTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Wyndham Sets Sail for Barbados, Unveils Plans for Island's Newest, Five-Star, Multi-Million Dollar ResortTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "c1ffb3173eac44838b107eec051d1a35c0b41772"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/wyndham-sets-sail-for-barbados-unveils-plans-for-islands-newest-five-star-multi-million-dollar-resort/", "ord_in_thread": 0, "title": "Wyndham Sets Sail for Barbados, Unveils Plans for Island's Newest, Five-Star, Multi-Million Dollar ResortTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wyndham Sets Sail for Barbados, Unveils Plans for Island’s Newest, Five-Star, Multi-Million Dollar Resort Published on : Wednesday, October 14, 2015\nHighlighting strong and growing interest in its portfolio of upscale brands in the Caribbean, Wyndham Hotel Group, the world’s largest hotel company, today announced plans for further global expansion with the development of the 450-room Sam Lord’s Castle Barbados, A Wyndham Grand Resort.Located in the parish of St. Philip at the former site of Sam Lord’s Castle–a spot renowned for pirates in the 19th century and one that carries great historical significance in the Caribbean today–the all-new construction resort is being developed with Barbados Tourism Investment, Inc. and will be managed by Wyndham Hotel Group. In addition to spacious, elegantly appointed guest-rooms, the resort will offer three on-site restaurants, 20,000 square-feet of state-of-the-art meeting space as well as an expansive luxury spa and fitness center. It will be the first Wyndham branded resort in Barbados.\n“The famous buccaneer Sam Lord settled in this area for its beauty and mystique. Today, we believe he selected the perfect location for our continued growth in the Caribbean,” said Paulo Pena, president and managing director, Latin America and the Caribbean for Wyndham Hotel Group. “This new hotel’s spectacular design will surely become an icon for guests in search of unique 5-star offerings and amenities.”\n“Each year Barbados hosts more and more visitors as it continues to position itself as a top vacation spot in the Caribbean. The development of Sam Lord’s Castle Barbados, A Wyndham Grand Resort, will offer guests the beauty of our beaches and access to our distinctive history, merged with the luxurious experience that the Wyndham Grand brand offers to travelers around the world,” said Everton Walters, chairman of Barbados Tourism Investment Inc.\nSam Lord’s Castle Barbados, A Wyndham Grand Resort will be situated along the gorgeous beaches of Long Bay by Sam Lord’s Castle. The site was a beautiful Georgian mansion built in 1820 by Samuel Hall Lord, known as ‘Sam Lord’. It is said that the notorious buccaneer used to hang lanterns on palm trees to attract merchant ships whose captains mistakenly thought the place was a safe harbor.\nWhen it opens in 2018, the hotel will be Wyndham Hotel Group’s 13th property in the Caribbean, with a portfolio which includes The Bahamas, Cayman Islands, Dominican Republic and Puerto Rico, under the Wyndham Grand® Hotels and Resorts, Wyndham Hotels and Resorts®, Wyndham Garden® Hotels, Ramada® and Howard Johnson® brands. The company is also scheduled to introduce the first TRYP by Wyndham hotel in Isla Verde, Puerto Rico later this year.\nSource:-Wyndham", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T03:51:58.352+03:00", "highlightTitle": ""}