{"organizations": [], "uuid": "3b0ea73824201d4106ebf1d1497778d0f0f6d477", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151003Afghanistan01.jpg", "site_section": "http://www.ticotimes.net/categories/topics/crime", "section_title": "Crime Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/03/possible-us-airstrike-hits-doctors-without-borders-hospital-in-afghanistan-at-least-19-dead", "country": "US", "title": "Possible US airstrike hits Doctors Without Borders hospital in Afghanistan; at least 19 dead -The", "performance_score": 0, "site": "ticotimes.net", "participants_count": 2, "title_full": "Possible US airstrike hits Doctors Without Borders hospital in Afghanistan; at least 19 dead -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:37:00.000+03:00", "replies_count": 1, "uuid": "3b0ea73824201d4106ebf1d1497778d0f0f6d477"}, "author": "Tim Craig | The Washington Post", "url": "http://www.ticotimes.net/2015/10/03/possible-us-airstrike-hits-doctors-without-borders-hospital-in-afghanistan-at-least-19-dead", "ord_in_thread": 0, "title": "Possible US airstrike hits Doctors Without Borders hospital in Afghanistan; at least 19 dead -The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KABUL, Afghanistan – U.S. forces may have mistakenly bombed a hospital in northern Afghanistan on Saturday, killing at least 19 people, including three children, in an incident that will likely raise new questions about the scope of U.S. involvement in the 14-year war.\nIn a statement, Doctors Without Borders said an airstrike “partially destroyed” their trauma hospital in Kunduz, where the Afghan military has been trying to drive Taliban fighters from the city.\nThe airstrike killed at least 12 Doctors Without Borders staff members, the group said. Three children were also reportedly killed. At least 37 other people were seriously injured, including 19 staff members and 18 patients and caretakers. Officials warned the death toll could rise as dozens of people remain unaccounted for.\n“This attack is abhorrent and a grave violation of International Humanitarian Law,” Meinie Nicolai, the group’s president, said in a statement. “We demand total transparency from Coalition forces. We cannot accept that this horrific loss of life will simply be dismissed as ‘collateral damage.'”\nHospital bombing: \"We cannot accept that this horrific loss of life will simply be dismissed as 'collateral damage'.\" http://t.co/GGvrAfvM2r\n— Doctors w/o Borders (@MSF_USA) October 3, 2015\n“We are deeply shocked by the attack, the killing of our staff and patients and the heavy toll it has inflicted on Kunduz,” said Bart Janseens, director of operations for the hospital. “We do not yet have final casualty figures, but our medical teams are providing first aid and treating injured patients and … accounting for the deceased.”\nDefense Secretary Ashton Carter issued a statement saying: “While we are still trying to determine exactly what happened, I want to extend my thoughts and prayers to everyone affected. A full investigation into the tragic incident is underway in coordination with the Afghan government.”\nThe United Nations’ top human rights official called for an independent investigation, while equating the airstrike on the hospital to a war crime.\n“This event is utterly tragic, inexcusable, and possibly even criminal,” Zeid Ra’ad al-Hussein, the U.N. High Commissioner for Human Rights, said in a statement.\n“This deeply shocking event should be promptly, thoroughly and independently investigated and the results should be made public,” he said. “The seriousness of the incident is underlined by the fact that, if established as deliberate in a court of law, an airstrike on a hospital may amount to a war crime.”\nIn this undated photo released by Medecins Sans Frontieres (MSF) on Oct. 3, 2015, Afghan MSF medical personnel treat civilians injured following an offensive against Taliban militants by Afghan and coalition forces at the MSF hospital in Kunduz.\nAFP/MSF\nOver the past week, U.S. military jets have conducted numerous airstrikes in Kunduz after the Taliban overwhelmed Afghan security forces on Monday. U.S. Special Operations troops and on-the-ground military advisers from the NATO coalition also have been assisting Afghan forces.\nDoctors Without Borders was one the last remaining international relief organizations in Kunduz. The United Nations and several other relief groups evacuated their staffers on Monday as the Taliban advanced into the city.\nKunduz resident Mirza Langhmani has counted 30 to 35 airstrikes in the area over the past five days. U.S. forces conducted 12 of them, including the one suspected of striking the hospital on Saturday, a coalition spokesman said. Afghan forces are also carrying out strikes.\nIn a statement, the U.S.-led coalition confirmed it carried out an airstrike about 2 a.m. Saturday in response to “individuals threatening the force.”\n“The strike may have resulted in collateral damage to a nearby medical facility,” said Col. Brian Tribus, a coalition spokesman. “This incident is under investigation.”\nA U.S. military official, speaking on condition of anonymity to speak freely, said U.S. special forces soldiers were on the ground advising Afghan special forces. The official said that the U.S. troops detected incoming fire from the Taliban, so an AC-130 gunship was authorized to return fire, at an area that was apparently close to the hospital.\nThe official said a high-ranking officer is on the way to lead the investigation.\nA file photo of the U.S. Air Force’s AC-130 gunship.\nU.S. Air Force/AFP\nOnly functional hospital in the area The AC-130 gunship, commonly known as the Spectre, is a favorite of special operation forces. It has an ability to stay above a target for long amounts of time and carries a number of weapons, including a 105mm cannon that is specially mounted to be fired from the air.\nAs well as a large number of weapons, the gunship has infrared sensors that allows it to see targets at night. Because of its size, low-altitude flight pattern and vulnerability to ground fire, AC-130s rarely fly air support during daylight hours.\nThe Doctors Without Borders facility was the only functional hospital in that part of Afghanistan. The organization posted photographs on Twitter showing part of the hospital was engulfed in flames shortly after the attack.\n#MSF #Kunduz trauma center aflame after aerial attack this morn. Staff tending to patients, each other, in aftermath pic.twitter.com/o6toDwivym\n— Doctors w/o Borders (@MSF_USA) October 3, 2015\nAs the Afghan army battled Taliban fighters in the streets of Kunduz this week, the hospital has been struggling to treat hundreds of patients. At the time of Saturday’s airstrike, 105 patients and more than 80 doctors and nurses were inside the hospital, according to Doctors Without Borders.\nIn recent days, Doctors Without Borders issued frequent updates to the media detailing the strain of trying to cope with the influx of patients. The hospital was also reportedly running low on supplies.\nOfficials with the relief group repeatedly informed the U.S.-led coalition of the hospital’s precise GPS coordinates over the past few months, hospital officials said. The location of the hospital was last conveyed to the international coalition three days ago, officials added.\nOnce the airstrike began on Saturday, hospital officials immediately reached out to U.S. military officials in Kabul and Washington, according to Jason Cone, executive director of Doctors Without Borders in the United States.\n“The bombing continued for more than 30 minutes after American and Afghan military officials in Kabul and Washington were first informed,” the organization said in a statement.\nBombing continued for 30+ minutes after #MSF informed US, Afghan military officials that Kunduz hospital was hit. http://t.co/m1j70KDgAV\n— Doctors w/o Borders (@MSF_USA) October 3, 2015\nOn Saturday morning, the Taliban accused the U.S.-led coalition of “savagery” and a “barbaric act.”\nThe International Red Cross also condemned the bombing.\n“This is an appalling tragedy,” said Jean-Nicolas Marti, director of Red Cross operations in Afghanistan. “Such attacks against health workers and facilities undermine the capacity of humanitarians to assist the Afghan people.”\nIn a separate statement, the U.S. Embassy in Kabul said it “mourns for the individuals and families affected by the tragic incident.”\n“Doctors Without Borders performs terrific work throughout the world, including Afghanistan, and our thoughts and prayers are with their team at this difficult moment,” the embassy said. “We remain deeply concerned about the ongoing violence in Kunduz and the difficult humanitarian situation faced by its residents.”\nOn Saturday morning, Doctors Without Borders circulated photographs showing the aftermath of the bombing. In one photo, a health-care worker in blood-stained scrubs huddled in a corner with another man. Another photograph showed doctors and nurses operating on a patient in an undamaged section of the hospital.\nHospital officials are trying to evacuate critically wounded patients to another facility two hours away, a risky undertaking as fierce fighting continues across swaths of northeastern Afghanistan.\nConcerns about civilian casualties in Kunduz, Afghanistan’s sixth largest city, have been mounting all week.\nAbdul Qahar Aram, spokesman for the Afghan Army’s 209th Corps in northern Afghanistan, on Saturday said Taliban fighters are now hiding in “people’s houses, mosques and hospitals using civilians as human shields.”\nAfghan President Ashraf Ghani on Thursday said those concerns were one reason Afghan security forces were being cautious in their efforts to retake the city.\nAfghan soldiers were battling militants near the Doctors Without Borders hospital when Saturday’s airstrike took place, said Laghmani.\n“The Taliban are taking and evacuating their wounded fighters to the hospital for treatment,” said Laghmani, who said the militant group still controls most of the city. “It was the only advanced hospital, and it was operating under good, foreign leadership.”\nSultan Arab, a local police commander in Kunduz, said the hospital came under an airstrike, “because the Taliban had shifted their command center inside the hospital.”\nIn a statement, the Taliban denied any of its fighters were at the hospital at the time of the airstrike.\nA Doctors Without Borders spokeswoman declined to comment on the allegations, but noted the organization “treats every patient irrespective of whether they are military or civilian.” In 1999, the organization was honored with the Nobel Peace Prize for its work.\nLanghmani said Kunduz faces a deepening humanitarian crisis.\n“The dead bodies are lying on the streets, both the Taliban and also civilians, and no one is allowed to pick up the bodies,” Langhmani said. “There is also an electricity shortage, a water shortage plus a bread shortage.”\nOver the past decade, U.S. airstrikes have been controversial in Afghanistan because of the risk of civilian causalities and so-called friendly fire incidents.\nDuring his final years in office, former Afghan president Hamid Karzai repeatedly accused the United States military of being reckless in how it carried out airstrikes. After Ghani replaced Karzai last year, relations between the Afghan government and coalition officials improved dramatically.\nBut in July, a coalition airstrike killed 10 Afghan soldiers, local officials said. Last month, Afghan officials accused the international coalition of killing 11 counternarcotic officers during an airstrike in Helmand Province.\nCoalition officials initially denied involvement. But they issued another statement a day later retracting that denial, saying the matter was now under investigation.\nA Kunduz official wants the air campaign to continue despite local residents’ anger about the strike that damaged the hospital.\n“I believe it is impossible to push back the Taliban from the city without airstrikes,” local police commander Sultan Arab said. “Airstrikes have been so efficient in Kunduz.”\nLanghmani said he and many other Kunduz residents also still want the U.S. military’s help against the Taliban.\n“But we want precise airstrikes,” Langhmani said. “If there is another like the one that at (the hospital), the people might rise up against both the government and the Taliban.”\nMohammad Sharif in Kabul, and Missy Ryan and Thomas Gibbons-Neff in Washington contributed to this report.\n© 2015 , The Washington Post", "external_links": ["http://www.doctorswithoutborders.org/article/afghanistan-msf-demands-explanations-after-deadly-airstrikes-hit-hospital-kunduz", "https://twitter.com/hashtag/MSF?src=hash", "https://twitter.com/MSF_USA/status/650157608276467713", "http://t.co/o6toDwivym", "https://twitter.com/hashtag/Kunduz?src=hash", "https://twitter.com/MSF_USA/status/650260071608397824", "http://t.co/GGvrAfvM2r", "http://t.co/m1j70KDgAV", "https://twitter.com/MSF_USA/status/650389344184856576"], "published": "2015-10-04T03:37:00.000+03:00", "crawled": "2015-10-04T03:32:53.286+03:00", "highlightTitle": ""}