{"organizations": [], "uuid": "8dc91f4d02bfeee0088fb153ac504a4cd2f27a7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/TT01-corcovadofromabove.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/10/18/brooklyn-yoga-studio-plans-fundraiser-to-protect-costa-rican-rain-forest", "country": "US", "title": "Brooklyn yoga studio plans fundraiser to protect Costa Rican rain forest", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Brooklyn yoga studio plans fundraiser to protect Costa Rican rain forest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T19:26:00.000+03:00", "replies_count": 0, "uuid": "8dc91f4d02bfeee0088fb153ac504a4cd2f27a7c"}, "author": "Amanda Zuniga", "url": "http://www.ticotimes.net/2015/10/18/brooklyn-yoga-studio-plans-fundraiser-to-protect-costa-rican-rain-forest", "ord_in_thread": 0, "title": "Brooklyn yoga studio plans fundraiser to protect Costa Rican rain forest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new initiative seeks to preserve lands surrounding Corcovado National Park. Lindsay Fendt/The Tico Times \nWillingness to look after Costa Rica’s natural beauty can be found far outside this country’s borders. The Yoga Sole Studio in Brooklyn, New York, aims to save Costa Rican rain forest land by joining forces with the White Hawk Foundation for a fundraising event at the Brooklyn Botanic Garden on Nov. 16th. \nThe event seeks to raise money to purchase and protect as much as possible of a biodiverse section of land in danger of development in the Carate River Valley on the Osa Peninsula, home of Corcovado National Park. While the park, like the majority of the Osa Peninsula, is protected by the Costa Rican government, some of the private owners of lands surrounding the park, such as the territory the upcoming fundraiser seeks to preserve, are selling those lands to developers. \nEvalena Leedy, owner of Yoga Sole, was teaching a free community yoga class in Brooklyn’s Prospect Park when a red-tailed hawk sat on a high branch and observed the session. Seeing the hawk inspired her to bring her yogis on a rainforest retreat, which led to her current quest to help save white-tailed hawks and other animals in Corcovado. \n“The air we breathe in New York is dependent upon places like the rain forests of Costa Rica,” Leedy said in a statement. \nLeedy then found Lana Wedmore, owner of Luna Lodge, a hotel near the park, and the creator of the White Hawk Foundation, whose mission is to preserve the rainforest surrounding her bucolic retreat. Leedy decided to support Wedmore’s plan to buy 12 farms surrounding her property and keep them forever wild. \nCorcovado’s virgin rainforest Lindsay Fendt/The Tico Times \nThe Brooklyn event will feature a one-hour yoga class with Merav Ben-Horin and live music by Yotam Silberstein, followed by reception, a White Hawk Foundation Presentation and then an exciting live Art and Experience Auction curated and led by local artists Rene Lynch and Julian Jackson, who were participants in the fateful Prospect Park yoga class which was visited by the red-tailed hawk, and the subsequent Osa retreat. The auction will feature environmentally conscious fine art, and wellness and cultural experiences. \nThere are various ways to help the cause: five different packages for the event are available, each including different activities. Find more information and tickets at the White Hawk Foundation Website . Contact Amanda Zuniga at azuniga@ticotimes.net", "external_links": [], "published": "2015-10-18T19:26:00.000+03:00", "crawled": "2015-10-18T20:23:13.214+03:00", "highlightTitle": ""}