{"organizations": [], "uuid": "942330acee6ebbb8de5945a594f0d8558f18e193", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03233/oxford_alamy_3233954k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-12.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/education/universityeducation/11927212/Do-bankers-deserve-their-bonuses-Oxford-reveals-interview-questions.html", "country": "US", "title": "'Do bankers deserve their bonuses?' Oxford University reveals interview questions", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "'Do bankers deserve their bonuses?' Oxford University reveals interview questions - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T02:21:00.000+03:00", "replies_count": 1, "uuid": "8b3d05616d970ddaf334bceacfcd06a700fc78f4"}, "author": "Javier Espinoza , Education Editor", "url": "http://www.telegraph.co.uk/education/universityeducation/11927212/Do-bankers-deserve-their-bonuses-Oxford-reveals-interview-questions.html#post-0", "ord_in_thread": 0, "title": "'Do bankers deserve their bonuses?' Oxford University reveals interview questions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Do bankers deserve their bonuses? Can archaeology prove or disprove the Bible? These are the types of questions Oxford University asks interview candidates looking to study at the prestigious institution. The university has released its annual sample of questions as part of a continuing bid to demystify its admissions process \"Interviews are designed to give candidates a chance to show their real ability and potential\" Samina Khan, Oxford's director of admissions Oxford 's director of admissions Samina Khan said that the interviews are mainly an \"academic conversation\" between tutors and a candidate and they relate to the course the student has applied for. Dr Khan said students looking to excel at an interview should look beyond just \"reciting\" what they already know. She said the questions \"are designed to give candidates a chance to show their real ability and potential\". These year's questions - published just days before the deadline for students to submit an application to begin their studies next autumn - include a conundrum for would-be economics and management students on whether bankers deserve their bonuses and whether the government should take any action to limit how much they receive. Interviewer Brian Bell of Lady Margaret Hall said: \"A simple answer might be that since banks are generally private firms and workers are free to work where they wish, then the pay they receive is just the outcome of a competitive labour market. \"In this story, bankers earn a lot because they are very skilled and have rare talents. It is hard to see a reason for government intervention in this case - though on equity grounds one may want to have a progressive income tax system that redistributes some of this income. \"A good candidate would wonder why it is that seemingly equivalently talented people can get paid so much more in banking than in other occupations. Do we really believe that bankers are so much better than other workers in terms of skill? \"The key point about this question is trying to get candidates to think about the economics of pay rather than just whether they think it is fair or not.\" Alison Salveson of Mansfield College said she may ask someone applying for Oriental Studies whether they think archaeology can prove or disprove the Bible. Magdalen College, Oxford: if you want to get in here you?d better know your fragaria from your subligacula Photo: ALAMY Ms Salveson said: \"For this particular question I would be looking for an answer that showed the candidate could appreciate that the Bible was a collection of documents written and transmitted over several centuries, and containing important traditions that have a bearing on history, but that academic study of the Bible means that it has to be examined carefully to see when and where these traditions had come from and for what purpose they had been written,\" she said. This isn't the first time Oxford publishes similar questions . Students have been asked to elaborate on the consequences of the extinction of tigers, to describe a cactus and to explain why many animals have stripes. The Oxford questions Q: Why is income per head between 50 and 100 times larger in the United States than in countries such as Burundi and Malawi? Interviewer: The question is focused on perhaps the most important economic question there is: why are some countries rich and some countries poor? As with most economics questions, there is no simple or unique answer. Candidates need to think about all the potential reasons why such income gaps exist. Q: Why is sugar in your urine a good indicator that you might have diabetes? Interviewer: This question builds on general knowledge and material studied at school in biology and chemistry to assess how students approach a clinically-relevant problem. It’s commonly known that diabetes is associated with sugar (glucose) in the urine; this question asks students to think about why this occurs. Q: Imagine that 100 people all put £1 into a pot for a prize that will go to the winner of a simple game. Each person has to choose a number between 0 and 100. The prize goes to the person whose number is closest to 2/3 of the average of all of the numbers chosen. What number will you choose, and why? Interviewer: I like this as a question for experimental psychology because answering it brings in a range of skills relevant to the subject. Partly it involves numerical and analytical skills: the question implies that the answer will be 2/3 of some other number, but which one? Some people's first guess is 2/3 of 100, i.e., 66 or 67, in which case I'd ask them what numbers everyone else would have to pick for them to win. In this case, everyone else would have to choose 100, which is unlikely. More often people first guess 2/3 of 50 (= 33), which seems intuitively more likely. At this point, and usually without prompting, the recursive nature of the solution becomes clear: If there is good reason for me to choose 33, then maybe everyone else will choose 33 too, in which case I should choose 2/3 of 33... but then everyone will think this and choose 2/3 of 33 too, so I should choose 2/3 of that number.. and so on. Assuming everyone thinks like this, then everyone will eventually settle on 0 as their choice – this is the formal ‘game theory’ solution. At this point, I'd ask questions that bring out the candidate's broader reasoning skills in terms of thinking how we could define what it is rational to do in this game. Q: Place a 30cm ruler on top of one finger from each hand. What happens when you bring your fingers together? Interviewer: This would never be the opening question in an interview - we usually start with a first question that gives the candidate an opportunity to get comfortable by discussing something familiar. We then ask more technical questions based on material in the GCSE and A-level syllabi. This question would come later in the interview, when we present candidates with an unfamiliar scenario and ask them to use what they know about familiar concepts (such as friction) to explain something. telegraph.co.uk", "external_links": [], "published": "2015-10-13T02:21:00.000+03:00", "crawled": "2015-10-12T21:29:14.148+03:00", "highlightTitle": ""}