{"organizations": [], "uuid": "01f103efd0ea97ccb2b16e0ba2a69a195361d2db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/mauritius-08oct15.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mauritius-named-golf-destination-of-the-year-africa-gulf-states-indian-ocean/", "country": "US", "title": "Mauritius named Golf Destination of the Year – Africa, Gulf States & Indian OceanTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Mauritius named Golf Destination of the Year – Africa, Gulf States & Indian OceanTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "01f103efd0ea97ccb2b16e0ba2a69a195361d2db"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mauritius-named-golf-destination-of-the-year-africa-gulf-states-indian-ocean/", "ord_in_thread": 0, "title": "Mauritius named Golf Destination of the Year – Africa, Gulf States & Indian OceanTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mauritius named Golf Destination of the Year – Africa, Gulf States & Indian Ocean\nThe Indian Ocean island of Mauritius has been honoured as one of the world’s best golf destinations.\nIt was named 2016 Golf Destination of the Year for the Africa, Gulf States and Indian Ocean region in the prestigious annual IAGTO Awards, the golf tourism industry’s “Oscars”, at a gala dinner on the final day of the International Golf Travel Market in Tenerife.\nIt is the second time Mauritius has won the coveted award, which is voted for by golf tour operator members of IAGTO (International Association of Golf Tour Operators). It previously won the honour in the 2008 IAGTO Awards.\nMauritius Golf Tourism Association President Michael Geerdharry said that prior to the opening of the Suez Canal, Mauritius was for two centuries the key of the Indian Ocean for the continents of Europe, Asia and Africa.\n“Today, through the AfrAsia Mauritius Open, the first-ever tri-sanctioned golf event by the European, Asian and Africa Sunshine Tours, the island of Mauritius has reaffirmed its past role as the key of the Indian Ocean, this time for the promotion of the game of golf on the three continents,” he continued.\n“Our golf business model is centred on our guests’ satisfaction in terms of service quality, innovation and value for money.\n“Everybody involved in the golf tourism industry in Mauritius is very honoured that the island has been named Golf Destination of the Year for Africa, the Gulf States and the Indian Ocean. To have won this prestigious accolade, which is voted for by tour operators, is very gratifying and shows that our hard work is paying off.”\nMauritius offers a collection of world-class golf courses by renowned golf designers, in tropical settings and with perfect, year-round golf weather. The inaugural AfrAsia Bank Mauritius Open was held at the Heritage Golf Club in May 2015. The 2016 event will be held from 12-15 May, 2016, at the Four Seasons Golf Club Mauritius at Anahita and will have a purse of €1 million.\nSource:- IAGTO", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T06:10:21.606+03:00", "highlightTitle": ""}