{"organizations": [], "uuid": "dc7e74c9f977a03f715e249fe02111c618e3ca7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30327542/kia-soul-wins-active-lifestyle-vehicle-of-the-year-award", "country": "US", "title": "Kia Soul Wins Active Lifestyle Vehicle Of The Year Award", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Kia Soul Wins Active Lifestyle Vehicle Of The Year Award - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "dc7e74c9f977a03f715e249fe02111c618e3ca7e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30327542/kia-soul-wins-active-lifestyle-vehicle-of-the-year-award", "ord_in_thread": 0, "title": "Kia Soul Wins Active Lifestyle Vehicle Of The Year Award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Kia Motors America\nSoul Takes Top Honors in Urban Category for Fourth Straight Year\n- 2016 Soul praised for spacious cabin, spirited performance and superb styling\n- Kia's iconic urban passenger vehicle combines form and function to support active lifestyles\nIRVINE, Calif. , Oct. 22, Kia Motors America's (KMA) fun, funky and functional urban passenger vehicle, the 2016 Soul, was named a winner at the 12 th annual Active Lifestyle Vehicle (ALV) of the Year awards held recently in Chandler, Arizona. For the fourth consecutive year, a panel of local media and athletes rated the Soul best in the Urban category.\n\"We're thrilled that the Soul has been recognized at ALV for the fourth consecutive time thanks to its many attributes and amenities,\" said Orth Hedrick , vice president of product planning, KMA. \"Combining an iconic design, refined interior, numerous tech features and impressive cargo volume, our urban runabout is a true standout for those seeking a vehicle that supports an active and athletic lifestyle.\"\nWith a starting MSRP of just $15,690 1 (excluding destination charges of $825 ), the Soul is an exceptional value that combines eye-catching style, practicality and youthful character in a small package. Not surprisingly, the Soul is one of KMA's top-selling models, and this year's ALV entry came in the form of a \"Red Zone\" Special Edition Soul, featuring an exterior body kit and spoiler and interior flourishes such as brush metal pedals and red trim/stitching.\n\"It is unprecedented for a vehicle to win the ALV award for four years in a row,\" said Nina Russin , founder Active Lifestyle Vehicle program. \"The fact that the Soul has consistently won top honors in the Urban category is testimony to its widespread appeal among young buyers who need a stylish-yet-versatile vehicle that is small enough to navigate crowded urban areas, and spacious enough to hold multiple passengers and a variety of gear.\"\nAbout Kia Motors America\nKia Motors America (KMA) is the marketing and distribution arm of Kia Motors Corporation based in Seoul , South Korea. KMA proudly serves as the \"Official Automotive Partner\" of the NBA and LPGA and set an all-time annual sales record in 2014, surpassing the 500,000 unit mark for the third consecutive year. KMA offers a complete line of vehicles, including the rear-drive K900 2 flagship sedan, Cadenza premium sedan, Sorento CUV, Soul urban passenger vehicle, Soul Electric Vehicle 3 Sportage compact CUV, Optima midsize sedan, Optima Hybrid, the Forte compact sedan, Forte5 and Forte Koup, Rio and Rio 5-door subcompacts and the Sedona midsize multi-purpose vehicle, through a network of more than 765 dealers across the United States. Kia's U.S. manufacturing plant in West Point, Georgia , builds the Optima* and Sorento* and is responsible for the creation of more than 15,000 plant and supplier jobs.\nInformation about KMA and its full vehicle line-up is available at www.kia.com . For media information, including photography, visit www.kiamedia.com . To receive custom email notifications for press releases the moment they are published, subscribe at www.kiamedia.com/us/en/newsalert .\n* The Sorento and Optima GDI (EX, SX & Limited and certain LX Trims only) are assembled in the United States from U.S. and globally sourced parts.\n1 MSRP excludes destination and handling, taxes, title, license fees, options and retailer charges. Actual prices set by retailer and may vary.\n2 K900 available in select trims and in select markets with limited availability.\n3 Soul EV in select markets with limited availability.\nPhoto - http://photos.prnewswire.com/prnh/20151022/279697\n releases/kia-soul-wins-active-lifestyle-vehicle-of-the-year-award-300164849.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=LA36112&Transmission_Id=201510221340PR_NEWS_USPR_____LA36112&DateId=20151022", "https://photos.prnewswire.com/prnvar/20151022/279697", "http://www.xmlnews.org/ns/", "http://www.kia.com/", "http://www.prnewswire.com/news-releases/kia-soul-wins-active-lifestyle-vehicle-of-the-year-award-300164849.html", "http://www.kiamedia.com/us/en/newsalert", "http://photos.prnewswire.com/prnh/20151022/279697"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T22:48:13.218+03:00", "highlightTitle": ""}