{"organizations": [], "uuid": "ee6ffebabe4b2e60dc44324385d485b13d4bfa85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/download-117.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/take-the-plunge-romantic-immersion-at-viceroy-zihuatanejo/", "country": "US", "title": "Take the Plunge: Romantic Immersion at Viceroy ZihuatanejoTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Take the Plunge: Romantic Immersion at Viceroy ZihuatanejoTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee6ffebabe4b2e60dc44324385d485b13d4bfa85"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/take-the-plunge-romantic-immersion-at-viceroy-zihuatanejo/", "ord_in_thread": 0, "title": "Take the Plunge: Romantic Immersion at Viceroy ZihuatanejoTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Take the Plunge: Romantic Immersion at Viceroy Zihuatanejo Published on : Friday, October 16, 2015\nCool and inviting, the infinity-edge plunge pools in the luxurious suites at Viceroy Zihuatanejo set the stage for a stylish new amenity for couples seeking the ultimate sensual experience: ‘Romantic Immersion with Mezcal and Designer Chocolates.’\nThe setting for romance is staged with candles surrounding the plunge pool, romantic music on an iPod, mouthwatering chocolates from famous Mexico City chocolatier QueBo and a self-guided mezcal tasting – enjoyed while immersed in your plunge pool and nibbling irresistible chocolates, which have long been considered an aphrodisiac.\n“The Romantic Immersion marries sensual elements with today’s hottest trends – the soaring popularity of Mexico’s smoky, distinctive mezcal and the country’s premier confectioner,” said Martin Kipping, General Manager of the Viceroy Zihuatanejo.“Viceroy Zihuatanejo is evolving into a very popular romance destination,” added Kipping. “We are hosting more honeymooners, couples and destination weddings every year and the infinity-edge plunge pools, with their beautiful views and soothing waters, are an ideal setting for a romantic experience.”\nFor the mezcal tasting, three brands of highly rated mezcal are presented, and which will vary throughout the year, along with an instruction card describing how to do the tasting.\nNestled on one of the country’s most beautiful beaches, and known for its gourmet dining and special services and amenities, Viceroy Zihuatanejo is a paradise for couples on Mexico’s Pacific coast. Enchanting two-story adobe-inspired casitas house 48 luxurious suites and guestrooms are tucked in gentle hills above the picturesque fishing village of Zihuatanejo. The garden landscape is rich with coconut trees, rainbow-hued bougainvillea and vibrant hibiscus. The resort’s exquisite white-sand beach stretches for 600 feet along a gorgeous coastline.Two gourmet restaurants – La Villa, featuring Pacific-Mexican cuisine prepared with the freshest locally caught seafood, and La Marea, serving Mediterranean and Mexican fare – are complemented by the friendly sanctuary of the Coral Bar offering ceviche tastings and the mixologists’ special concoctions. Guests enjoy massages and treatments at an intimate spa in a lush tropical setting, fitness center, yoga program and an array of activities from water sports to cooking classes.\nSource:- Viceroy Hotel Group", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T04:31:45.330+03:00", "highlightTitle": ""}