{"organizations": [], "uuid": "33c63451889f4e05e9b8cb12791d7601f8ea57af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/05/reliance-s-re1.jpg", "site_section": "http://www.financialexpress.com/section/lifestyle/travel-tourism/", "section_title": "Travel News:Travel and Tourism,Latest Travel News,Tourism News Today,Latest Travel News Articles | The Financial Express", "url": "http://www.financialexpress.com/article/fe-columnist/what-should-reliance-industries-pay-if-it-turns-out-it-drilled-ongcs-gas/147764", "country": "IE", "title": "What should Reliance Industries pay if it turns out it drilled ONGC’s gas?", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "What should Reliance Industries pay if it turns out it drilled ONGC’s gas? | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:21:00.000+03:00", "replies_count": 0, "uuid": "33c63451889f4e05e9b8cb12791d7601f8ea57af"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/what-should-reliance-industries-pay-if-it-turns-out-it-drilled-ongcs-gas/147764", "ord_in_thread": 0, "title": "What should Reliance Industries pay if it turns out it drilled ONGC’s gas?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles If Congress and BJP both want Aadhaar, why not back it by law? Editorial: Losing the Aadhaar plot Editorial: Less taxing solutions Most will accuse Reliance Industries (RIL) of theft if the D&M study on the RIL-ONGC reservoir in the KG Basin shows RIL has been drilling gas that belonged to ONGC. According to a report in The Economic Times , ONGC says that of the 58.67 bcm of gas that RIL has drilled till March 2015, 11.95 bcm was from ONGC’s 98/2 field – at $4.2 per mmBtu, that’s around $1.6 bn we’re talking about. Elegant as that sounds, it misses the picture entirely. Indeed, if ONGC is awarded such damages, this will be its best investment ever since it has not spent much on developing the field while RIL spent Rs 40,000 crore a decade ago.\nBefore getting into issues of ‘pilferage’, it is important to note that such leakages of oil/gas from one field to an adjoining one are not uncommon, and joint development of a field is one way to resolve such issues. This is important since, in most such cases, even the authorities that bid out the fields often do not know that the reservoirs are interlinked. In this particular case, ONGC was awarded the IG block in 1997 and it bought 3D seismic data a few years later on the field and for part of the area that is Reliance Industries’ KG Basin. At this point, it would appear, no one pointed out the reservoirs were interlinked. A few years later, Cairn Energy was awarded 98/2 – another block next to the RIL field, and in 2001, Cairn announced some discoveries; in 2003, it sold the block to ONGC which announced a new discovery there some months later. Which means that, for several years, neither ONGC nor the regulator knew that the reservoir was a common one – had this been known, the government would not have awarded the fields to two different operators or would have pushed for joint development.\nOf course, ONGC not reporting the matter to the regulator is not its fault either since it may not have studied the data carefully at that point. Nor is it germane that ONGC did not develop these two fields for so many years since it is possible that, unlike RIL, ONGC did not think the economics justified the high costs and risks of exploration. The issue of compensation, at the end of the day, has to depend upon the investments made. After all, if ONGC had also invested Rs 40,000 crore – its current draft investment plan for one part of the field is in the region of $7 bn – to develop the field, what would matter is the profit it would have made per unit of gas after netting out the cost of capital and various royalties to be paid to the government. Since RIL argues it has not made profits on its investment so far, the resolution is going to be that much tougher for the ministry.\nThe report will also have another side effect – since it will quantify the gas in the reservoir, this will play a big role in resolving the dispute between RIL and the government on whether the former is hoarding gas. The government has withheld $2.5 bn of payments to RIL so far on essentially these grounds – but if the report confirms there is not much gas, the government will probably have to release these payments to RIL. What complicates matters is that any resolution of the ONGC-RIL dispute that doesn’t suit either side will head for the courts – indeed, even if both sides agree, it is always possible a third party could file a PIL in the matter!\nFirst Published on October 08, 2015 11:21 am", "external_links": [], "published": "2015-10-08T19:21:00.000+03:00", "crawled": "2015-10-08T11:21:59.250+03:00", "highlightTitle": ""}