{"organizations": [], "uuid": "9a232ff490f87db52421f46868d6d05805b064ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-56002f07/turbine/sc-trav-0922-trouble-20150914", "site_section": "http://www.chicagotribune.com/lifestyles/travel", "section_title": "Travel - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/lifestyles/travel/sc-trav-0922-trouble-20150914-column.html", "country": "US", "title": "Airline apology: Now you see it, now you don&apos;t", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Airline apology: Now you see it, now you don&apos;t - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T13:00:00.000+03:00", "replies_count": 0, "uuid": "9a232ff490f87db52421f46868d6d05805b064ad"}, "author": "Christopher Elliott", "url": "http://www.chicagotribune.com/lifestyles/lifestyles/travel/sc-trav-0922-trouble-20150914-column.html", "ord_in_thread": 0, "title": "Airline apology: Now you see it, now you don&apos;t", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Q: I recently experienced a 23-hour delay when flying from Buenos Aires, Argentina, to San Francisco on American Airlines. I spent nine hours at Dallas/Fort Worth International Airport and around 36 hours without sleep because of this issue and also spent extra money on the rental car due to the late pickup. Finally, I missed two important business meetings that were the original reason for this trip.\nI contacted American customer-relations representatives about 15 times (both on the phone and through email), and long story short, I initially was offered 12,000 miles in compensation. Then I got an apologetic email giving me just 6,000 miles, which most likely was sent to every person that had been on the same flight as me, as a generic response.\nThen I contacted customer relations again, and they issued a $500 e-voucher. But to my surprise, they canceled it later, and now they are telling me that all I will get as a gesture of goodwill are those 6,000 miles.\nI've contacted an American representative on LinkedIn, asking the company to do the right thing. After several exchanges, the representative said my only option was to file a complaint through American's online form. She also said, \"If you contact me again, I will file with AA Corporate Security on a business and personal level.\"\nI'd like American to do what it promised. Can you help?\n— Alan Estrebou, Ituzaingo, Argentina\nA: American should have gotten you to San Francisco as scheduled, not a day later. When it couldn't do so, it should have at least followed through with its full promised compensation.\nLet's take a closer look at the compensation. American offered you a grand total of 12,000 miles as an apology for being delayed by a day. If you were flying in other parts of the world, such as Europe, you would have been entitled to cash for the trouble. As an admitted mileage skeptic, I'm not sure how valuable (or sincere) the miles were, but something is better than nothing.\nThe e-voucher was a little better, but bear in mind that airline scrip, or credit, can have limits, and it expires, so that apology was a limited-time offer.\nIt's not clear why American withdrew its original offer. When it did, you should have filled out its online form, and if that didn't work, appealed to one of American's executives. I list their names, numbers and emails on my site ( www.elliott.org/company-contacts/american-airlines ).\nI'm not sure if contacting an American employee through LinkedIn was the best course of action. LinkedIn is used for career development, not customer-service issues, although I'm surprised you got the reaction you did. Even so, asking for help is no crime, and there's nothing American's \"Corporate Security\" department can do to protect an employee from a customer with a question.\nIn your case, it appears American was under no legal obligation to offer you anything. But it obligated itself when it offered you miles and a voucher. It should honor its word.\nI contacted American on your behalf. It reversed course and issued the 12,000 miles, as promised.\nChristopher Elliott is the ombudsman for National Geographic Traveler magazine and a co-founder of the Consumer Travel Alliance, a nonprofit organization that advocates for travelers. Because of a backlog of cases, your story may not be published for several months. Read more tips at elliott.org , or email chris@elliott.org .\n American Airlines", "external_links": ["http://www.trbimg.com/img-56002f07/turbine/sc-trav-0922-trouble-20150914", "http://www.elliott.org/company-contacts/american-airlines"], "published": "2015-09-27T13:00:00.000+03:00", "crawled": "2015-10-02T09:02:21.850+03:00", "highlightTitle": ""}