{"organizations": [], "uuid": "2e872995daf3c51da86c03a1e0f741c3713356c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03460/torquilhouse_3460173k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-01.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/cottages/11848456/Torquil-Daymer-Bay-Cornwall-review.html", "country": "US", "title": "Torquil, Daymer Bay, Cornwall: review", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Torquil, Daymer Bay, Cornwall: review - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:23:00.000+03:00", "replies_count": 0, "uuid": "2e872995daf3c51da86c03a1e0f741c3713356c2"}, "author": "Cathy Stebbings", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/cottages/11848456/Torquil-Daymer-Bay-Cornwall-review.html", "ord_in_thread": 0, "title": "Torquil, Daymer Bay, Cornwall: review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Telegraph expert rating: 8/10 This delightful country house is within a stone’s throw of the lovely Daymer Bay, in the village of Trebetherick, Cornwall . Beyond the tall surrounding hedge, the sound of gently lapping waves and a crisp sea breeze are constant reminders of the close proximity of the popular family beach beyond. The poet Sir John Betjeman spent many happy summers here, calling it “That more than summer residence” – and it is! It sleeps 11 in 6 bedrooms. Location: 8/10 Once you have negotiated the often busy single-track Daymer Lane, there is no need to leave again. The house is within walking distance of the beach, the internationally renowned St Enedoc Golf Course and coastal paths that take you towards Rock and the Camel Estuary in one direction, and the Greenaway and the surfing beach of Polzeath in the other. It is perfectly situated for bracing picnics in the sand dunes, early morning swims and fishing at high tide from the rocks. Style & character: 8/10 This much-loved family home, passed down through generations since 1911, is unpretentious, comfortable and ingeniously renovated to offer high-spec facilities without losing touch with its past. The house is all about family: there’s a huge kitchen table for family feasts, a sizeable drawing room with a grand piano and an open fire, and a separate snug. Televisions and mod cons are incidental. This much-loved family home is unpretentious and comfortable There is space for late-night revelry and quiet contemplation upstairs and down, inside and out. A rambling oak staircase branches three ways to the six large, comfortable bedrooms, with thick floral curtains, tiled fireplaces and classic rugs on wooden floors. Beautiful bathrooms feature claw-foot baths and generously sized showers maintain traditional grandeur with modern efficiency. Facilities: 8/10 Whenever you visit, whatever the weather, the house offers all one could wish for: there is plenty to do inside, including games and books, and there is plenty of space to talk, play and relax. The bright kitchen is well-equipped for large groups, with lots of room to cook and talk, so that even clearing up is a pleasure. The bright kitchen is well-equipped for large groups Outside, a long swing hangs from an old pine tree, there is a comfortable area for al fresco dining, and a barbecue for cooking the day’s catch. An outside shower removes sand from surfers and a yoga deck offers a retreat. The house is so close to the beach and fantastic coastal runs, making the well-equipped gym seem superfluous, but with sauna, jacuzzi and shower room, it’s a bonus in wet weather. Value for money: 8 /10 House from £1,285 per week in low season; rising to £4,400 in high. There is an additional weekly charge of £250 for use of the gym, sauna and hot tub. Family Friendly: 9/10 Exceptionally good for families of all ages. No dogs. Eating Besides the beach café, the Mowhay Restaurant and St Moritz Hotel are both within walking distance. Trebetherick has a shop. For good independent food shops, pubs and fine restaurants, Rock is a five-minute drive, or a 30-minute walk. Rick Stein’s restaurants are a short ferry trip from Rock to Padstow. Access for guests with disabilities? No Details Daymer Lane, Trebetherick, Cornwall, PL27 6SA www.johnbraycornishholidays.co.uk Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-10-02T01:23:00.000+03:00", "crawled": "2015-10-01T22:39:32.623+03:00", "highlightTitle": ""}