{"organizations": [], "uuid": "93047c79fee1e734d599af347e2302ddc46a2010", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03481/HP_man_woman_looki_3481079a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-23.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/business-tips/11950569/red-tape-regulations-you-need-to-know.html", "country": "US", "title": "Red tape regulations you need to know", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Red tape regulations you need to know - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:30:00.000+03:00", "replies_count": 0, "uuid": "93047c79fee1e734d599af347e2302ddc46a2010"}, "author": "Deborah Cicurel", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/business-tips/11950569/red-tape-regulations-you-need-to-know.html", "ord_in_thread": 0, "title": "Red tape regulations you need to know", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Businesses in the UK are facing fresh bureaucratic challenges to keep on top of many new rules and regulations. First up is auto-enrolment, in which every company with at least one employee must enrol those who are eligible into a workplace pension scheme, and contribute towards it. Then, over the next year, the Small Business, Enterprise and Employment Act (SEEBA) will come into force, bringing with it a sharp increase in paperwork, while the new small business commissioner will aim to make it easier for small companies to get paid on time. And the Enforcement of New Living Wage regulations will unleash a new team of HM Revenue & Customs compliance officers with the powers to charge penalties on companies that fail to keep sufficient paperwork. Most SMEs do not have the infrastructure to keep on top of red tape as effectively as they should The Consumer Rights Act will aim to elucidate the law, empowering consumers and resolving disputes, while new regulations mean the minimum wage will rise to £9 an hour by 2020. There are also changes to existing regulations to look out for, such as amendments to travel and subsistence expenses for some workers, changes to the already complicated IR35 tax legislation – relating to people working for a client through an intermediary – and new dividend tax rules that will restrict tax-free dividends to £5,000. Regulations are there to protect the consumer and create a level playing field among businesses – but many SMEs are concerned that while large companies are equipped to deal swiftly and effectively with red tape, the administrative and economic burden can be significant for small businesses, and often time-consuming, inflexible and costly. James Poyser, co-founder of inniAccounts, believes that red tape is restrictive to the growth of small companies. “Just recently we’ve seen a raft of red tape come in,” he says. “While some things are needed to address socioeconomic problems like pension shortfalls, on the whole the legislation is aimed at big businesses that would otherwise skirt around legislation. The economic burden of dealing with red tape can be costly for SMEs “The consequence of needing to put in such measures is that small businesses are inadvertently ensnared – the smallest of businesses now have to get over these hurdles just to start up,” he says. “I'd rather see sweeping exemptions that help small businesses get started – for example, not applying these rules for the first two years, or until you reach a certain turnover.” Ed Cottrell, head of growth and acquisition finance at Investec, also thinks that small businesses are frequently disproportionately affected by red tape. \"Industry needs regulation in order to function properly, but it needs to work with business and not against it,” he says. Sue Goble, chief executive of the cloud division at IRIS Software, agrees: “The Government has continued to make pledges to support growing small businesses, but these have simply not worked. Small businesses should be the growth engine of the UK economy, yet red tape continues to add pressure and is leaving business owners unable to focus on growing their company.” Not only the costs of putting regulations into place but also the time element worry small business owners. From reading thick tomes on regulations to filling out endless piles of paperwork, most SMEs do not have the infrastructure to keep on top of red tape as effectively as they should. Over the next year the Small Business, Enterprise and Employment Act (SEEBA) will come into force, bringing with it a sharp increase in paperwork Bill Monty, auto-enrolment specialist at Sable Wealth, says: “Most SMEs will need professional advice to be able to cope with changes. “Small firms that do not have payroll departments will struggle the most, while the complexity of the process also means that it will be easy to break the rules by accident and incur hefty fines. There is arguably a certain level of unfairness in this for small businesses that don’t have the capacity to deal with these changes.” However, while many SME owners are negative about the impact of red tape on their businesses, there is certainly a sense for others that the bureaucratic tides could be turning in their favour, especially after Sajid Javid, the Business Secretary, announced this year that the Government plans to cut at least £10bn of red tape over the next five years. With Mr Javid, at heart a Thatcherite, at the helm of the Department for Business for the foreseeable future, regulations will no doubt come, go and change, but in five years’ time the perception of red tape could be very different. The test for the Government will be how exactly its stated intention to reduce the burden of regulation on businesses has been translated into reality by the time of the next election. • For more advice on preparing your business for the tech challenges of the future, visit HP BusinessNow You may also be interested in: • Should small businesses borrow money to grow? • A first sight of the Small Business Saturday 100 • How to pitch to a Silicon Valley Venture Capitalist • Set your people free with the ultimate in flexible working • Confessions of a crowdfunder • MPs unaware of Government help for small businesses", "external_links": [], "published": "2015-10-24T00:30:00.000+03:00", "crawled": "2015-10-23T19:10:30.048+03:00", "highlightTitle": ""}