{"organizations": ["Tripadvisor", "Tourism Group", "New York Times Square", "Chengdu Tourism Bureau and Chengdu Culture", "Chengdu Municipal Tourism Administration", "Facebook", "UNESCO", "Giant Pandas", "Temple of Marquis"], "uuid": "79e3ed8f4c51c96af004c0dc4f9ba7ea9316fcd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_2_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13327972/1/cometochengducom-makes-us-debut.html?cm_ven=RSSFeed", "country": "US", "title": "Cometochengdu.com Makes US Debut", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Cometochengdu.com Makes US Debut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T05:00:00.000+03:00", "replies_count": 0, "uuid": "79e3ed8f4c51c96af004c0dc4f9ba7ea9316fcd6"}, "author": "", "url": "http://www.thestreet.com/story/13327972/1/cometochengducom-makes-us-debut.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Cometochengdu.com Makes US Debut", "locations": ["San Francisco", "SAN FRANCISCO", "USA", "Chengdu Hot Pot", "US", "Silicon Valley", "Dujiangyan", "Chengdu", "Chengdu Diaoyutai", "San Francisco International Airport"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mount Qingcheng", "YoYochengdu"], "text": "Reprint SAN FRANCISCO , Oct. 16, 2015 /PRNewswire/ -- On October 15, 2015 , Cometochengdu.com, the official English website for tourists to Chengdu, made its debut at an event in Silicon Valley after a one -year trial run. A series of promotional events about tourism to Chengdu is also under way across the US. Jointly developed by the Chengdu Tourism Bureau and Chengdu Culture and Tourism Group, www.cometochengdu.com will provide tourism information and services in and around Chengdu for tourists around the world. The website CometoChengdu is developed with the participation of global advisors and overseas teams to circumvent the misunderstandings caused by the traditional method of simple Chinese-English translation. It also makes groundbreaking efforts to connect to the background data of Tripadvisor, the largest travel site in the world, to let visitors get more true and useful reviews. The website is in both English and traditional Chinese and follows a simple 4-block layout: Discover Chengdu, Event Calendar, Things to Do and Traveler Information, making it easy for users to find the information they need. The website arranges three stages for tourists, namely, information searching before the tour, information services during the tour and social network sharing after the tour. Before the trip, tourists can use the site to plan a detailed itinerary for the Chengdu tour. During the trip, visitors can get the most specific touring news via the website app, and after the trip, visitors can share their tour experience via Facebook, Youtube and other social network platforms and also interact with YoYochengdu, the official account of Chengdu tourism on Facebook . S ince October 14, the brand new advertising video for Chengdu tourism has been played on the electronic screens both in the New York Times Square and the international departures and arrivals of San Francisco International Airport. The advertising video, themed as \" Chengdu Can do \", displays a number of Chengdu elements and cultural heritages, including Giant Pandas , Chengdu Hot Pot , Dujiangyan Irrigation System, Mount Qingcheng, and the Temple of Marquis . Therefore, the image of Chengdu tourism that perfectly integrates natural ecology, historic culture and urban development has been vividly visualized to a world-wide audience. The advertising video will be on continuous play in Times Square and at San Francisco International Airport for a week. Two 3D promotional pictures have also been made, focusing on the Panda Park in Chengdu and the UNESCO heritage site at Dujiangyan . Meanwhile visitors to the Facebook page who answer questions about Chengdu can win round-trip tickets between San Francisco and Chengdu as well as two nights accommodation in Chengdu Diaoyutai Boutique Hotel. Chengdu Municipal Tourism Administration has highlighted the USA as one of its key markets for attracting tourists to Chengdu and hopes that Che ngdu's new image will allow more American tourists to appreciate the Chinese culture in Chengdu . Photo - http://photos.prnewswire.com/prnh/20151016/277615 To view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/cometochengducom-makes-us-debut-300161684.html SOURCE Chengdu Culture & Tourism Copyright 2011 PR Newswire. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-10-19T05:00:00.000+03:00", "crawled": "2015-10-19T05:17:35.507+03:00", "highlightTitle": ""}