{"organizations": [], "uuid": "69c3a1c1d2e27aa4bb900760ff7d82979e83e964", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/29313-moevenpick-hotels-resorts-steps-up-african-expansion-with-three-new-sub-saharan-properties", "country": "US", "title": "Mövenpick Hotels & Resorts steps up African expansion with three new sub-Saharan properties", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Mövenpick Hotels & Resorts steps up African expansion with three new sub-Saharan properties", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:30:00.000+03:00", "replies_count": 0, "uuid": "69c3a1c1d2e27aa4bb900760ff7d82979e83e964"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/29313-moevenpick-hotels-resorts-steps-up-african-expansion-with-three-new-sub-saharan-properties", "ord_in_thread": 0, "title": "Mövenpick Hotels & Resorts steps up African expansion with three new sub-Saharan properties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mövenpick Hotels & Resorts steps up African expansion with three new sub-Saharan properties Mövenpick Hotels & Resorts steps up African expansion with three new sub-Saharan properties Details Category: Hotel Created on Tuesday, 13 October 2015 10:30 Swiss hospitality brand accelerates growth in both East and West Africa after signing upscale hotels in Kenya, Nigeria and Cote d’Ivoire Mövenpick Hotels & Resorts will debut in three new African markets over the next four years as its plan to establish a presence in key cities across the continent’s thriving Sub-Saharan region come to fruition. \nIn a move that will take its Africa portfolio to 28 properties strong, the Swiss hospitality brand will open three upscale hotels across Kenya in East Africa and Nigeria and Cote d’Ivoire in West Africa, between 2016 and early 2019. The expansion will commence with the opening of the 223-key Mövenpick Hotel & Residences Nairobi in mid-2016, followed by the 212-key Mövenpick Hotel Abidjan in early 2018, rounding off with the 250-key Mövenpick Hotel and Conference Centre Abuja in 2019. “Sub-Saharan Africa is forecast to be the fastest growing region in the world over the next five years with a projected GDP growth rate of 4.8% from 2014 to 2018, according to research by Deloitte,” said Alan O’Dea, Senior Vice President Africa, Mövenpick Hotels & Resorts. “It is therefore crucial we get a strong foothold in this market, which is undergoing a trade and investment boom right now, and our three new properties are well positioned to capitalise on the economic growth projected across both East and West Africa.” Mövenpick Hotel & Residences Nairobi is a 15-storey property owned by prominent regional real estate developer, Golf Course Hotel (K) Ltd., situated in the Kenyan capital’s sought-after Westlands district with stand out features including a revolving tower with panoramic downtown views, plus extensive dining, leisure and meetings facilities. Mövenpick Hotel Abidjan is located in the centre of Cote d’Ivoire’s largest city, adjacent to the corporate and government district and offering guests an impressive range of business, MICE and leisure amenities. Its ownership model is a joint venture between land owner Société Abidjanese de Promotion Industrielles et Immobilières (SAPRIM), a private company that owns the office complex and mall next to the property and French listed construction firm Bouygues Batiment International. Mövenpick Hotel and Conference Centre Abuja, owned by Queen Amina Garden Ventures Ltd., a wholly owned subsidiary of Urban Shelter Ltd. in conjunction with Occel Engineering Ltd., will take advantage of Nigeria’s status as Africa’s largest economy. Located in the capital’s upmarket Jabi Lake district and a part of a stunning leisure and hospitality master development, the property’s highlights will include five food and beverage outlets, a dedicated conference centre and spa and fitness facilities. “Our new properties are strategically located in Sub-Saharan Africa’s most economically prosperous cities,” said O’Dea. “But this is just the start of our ambitious expansion campaign and we will continue to look for growth opportunities across the region as its rapid transformation takes shape.” Mövenpick Hotels & Resorts’ African portfolio currently comprises 23 hotels, resorts, and cruise ships spanning five countries including Egypt, Tunisia, Morocco, and Ghana. The company will open its third property in Morocco, the Mövenpick Hotel Mansour Eddahbi & Palais des Congrès, Marrakech, in mid-2016 and has inked a management deal for a third hotel in neighbouring Tunisia - the Mövenpick Hotel Les Berges du Lac Tunis, scheduled for completion in 2016. Related articles", "external_links": [], "published": "2015-10-13T12:30:00.000+03:00", "crawled": "2015-10-13T12:38:37.849+03:00", "highlightTitle": ""}