{"organizations": [], "uuid": "08ab25be5c9f377ad9e467d834f2465a5f074899", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30325028/rideshare-startup-vugo-continues-growth-challenges-nyc-ban-on-advertising-in-rideshare-cars", "country": "US", "title": "Rideshare Startup Vugo Continues Growth, Challenges NYC Ban on Advertising In Rideshare Cars", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Rideshare Startup Vugo Continues Growth, Challenges NYC Ban on Advertising In Rideshare Cars - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "08ab25be5c9f377ad9e467d834f2465a5f074899"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30325028/rideshare-startup-vugo-continues-growth-challenges-nyc-ban-on-advertising-in-rideshare-cars", "ord_in_thread": 0, "title": "Rideshare Startup Vugo Continues Growth, Challenges NYC Ban on Advertising In Rideshare Cars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Vugo, Inc.\nVugo Launches Federal Lawsuit Defending Freedom Of Speech in NYC\nNEW YORK , Oct. 22, Vugo has sued New York City over its ban on rideshare advertising, alleging that the ban violates the startup's freedom of speech in a federal lawsuit filed on October 20th, 2015 ( Full Complaint Here ).\nPhoto - http://photos.prnewswire.com/prnh/20151022/279560\nPhoto - http://photos.prnewswire.com/prnh/20151022/279559\nVugo is a Minneapolis, Minnesota -based technology startup that delivers targeted advertisements and video content in rideshare vehicles based on a passenger's intent. The company's patent-pending TripIntent Technology uses trip signals to determine the most relevant advertisements and content for a passenger, and has seen significant growth in major US markets, including requests from drivers and businesses to advertise in NYC .\nVugo enables drivers of rideshare companies like Uber and Lyft to earn additional income through advertising on tablet devices mounted on their vehicle headrests. While driving, passengers are presented with streaming video content and advertisements that are relevant to a passenger's immediate trip.\nVugo's competitive advantage over other in-vehicle advertising solutions, outside of having a more valuable demographic of mobile savvy passengers, is their proven TripIntent technology. Vugo has published a report detailing the demographics of rideshare passengers .\nThe TripIntent technology uses trip information to deliver only relevant content and advertisements to passengers of ridesharing services like Uber. Drivers benefit by collecting the majority of revenue generated from ads displayed on the trips.\nSince launching in May, Vugo has grown its network to include thousands of drivers across the country with strong concentrations in major metropolitan areas San Francisco , Minneapolis , Dallas , Miami , Orlando and Los Angeles . Advertisers are able to start and manage ad campaigns and view analytics on Vugo's platform using the company's Ad Portal .\nVugo hasn't been able to operate in New York City because Taxi and Limo Commission Rules prohibit advertising in \"for-hire vehicles,\" a category which includes vehicles dispatched by applications like Uber and Lyft.\nVugo's lawsuit seeks a declaration that the TLC advertising ban violates the First Amendment to the United States Constitution, and an injunction barring the City from enforcing the ban.\nVugo is represented by Chad Snyder and Michael Frasier of the Minneapolis law firm Rubric Legal LLC, and Mount Laurel, N.J. attorney John Cinti of Reger, Rizzo and Darnall LLP.\nContact:\nJames Bellefeuille\nVugo, Inc\n(800) 618-1424\nEmail\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/rideshare-startup-vugo-continues-growth-challenges-nyc-ban-on-advertising-in-rideshare-cars-300164639.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=PH35632&Transmission_Id=201510220819PR_NEWS_USPR_____PH35632&DateId=20151022", "http://www.xmlnews.org/ns/", "http://advertise.govugo.com/", "http://photos.prnewswire.com/prnh/20151022/279560", "http://www.prnewswire.com/news-releases/rideshare-startup-vugo-continues-growth-challenges-nyc-ban-on-advertising-in-rideshare-cars-300164639.html", "http://www.govugo.com/wp-content/uploads/2015/10/Filed-Complaint.pdf", "http://www.govugo.com/rideshare-passenger-demographics/", "http://photos.prnewswire.com/prnh/20151022/279559", "http://pressreleaseheadlines.com/contact?pid=293031"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T16:34:58.973+03:00", "highlightTitle": ""}