{"organizations": ["New Donner"], "uuid": "e95e3c5d17dc399b98df1beb5e238894788d43ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://www.kentucky.com/mistatic/images/facebook/HeraldLeader.jpg", "site_section": "http://www.kentucky.com/163/index.rss", "section_title": "Kentucky.com -- Travel", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/05/4072094_best-way-to-see-the-bluegrass.html", "country": "US", "title": "New Donner visitors center is a feast for history lovers", "performance_score": 0, "site": "kentucky.com", "participants_count": 0, "title_full": "New Donner visitors center is a feast for history lovers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T11:00:00.000+03:00", "replies_count": 0, "uuid": "e95e3c5d17dc399b98df1beb5e238894788d43ea"}, "author": "", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/05/4072094_best-way-to-see-the-bluegrass.html", "ord_in_thread": 0, "title": "New Donner visitors center is a feast for history lovers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["SAM MCMANIS"], "text": "New Donner visitors center is a feast for history lovers By SAM MCMANIS The Sacramento Bee October 5, 2015 Updated 3 hours ago 2015-10-05T12:18:02Z Order a reprint of this story \nTRUCKEE, Calif. — Sometimes AutoCorrect, bane of our digital existence, unintentionally makes the perfect and perfectly ridiculous word choice that serves both as cogent commentary and comic relief. \nTake the other day. I was stopped at a traffic light in Truckee, heading toward a certain state park visitors center, and received a text from a loved one asking my whereabouts. Quickly, before the light changed, I punched in \"donn ...\" and, before I could finish, AutoCorrect had changed it to \"dinner.\" \nPrecisely! Such an old joke - \"Paging Donner, party of six\" - seemingly never gets tiresome because the tragic pioneer saga of the ill-fated Donner Party's demise, and documented cannibalism, continue to fascinate 169 years after the fact. If, when chugging up Interstate 80 on the way to Tahoe, you don't think, even fleetingly, of the Donner Party and its horrible death by starvation, then you have no sense of imagination. \nSince June, travelers can do more than just crack wise as they breeze pass the Donner Pass Road exit and motor on. A new visitors center at Donner Memorial State Park - nearly 10,000 square feet in size and $9.6 million in cost - charts, in detail, the successes and failures of pioneer families blazing a trail through the Sierra. It also sketches the original settlement by the Washoe tribe, details the Chinese construction of the railroad tunnel through the pass, and the advent of Interstate 80 and ease of motor traffic over the summit. \nIt's a fine monument to all forms of travel and the innately American yen for exploration and adventure. But, be honest, it's the Donner Party and the C-word (not sensationally featured in museum displays and literature but duly noted in the aptly titled \"Desperation\" display) that drew the healthy crowd of tourists I encountered roaming the halls one recent afternoon. \nPeople lingered over the life-size cardboard cutouts of women and children huddled in threadbare blankets, accompanied by a broken wagon wheel half buried in fake snow. They stared at the exploded text stenciled on the wall: \"STARVING, they ate the bodies of dead companions.\" \nNow, museum exhibits tend to lend themselves to quiet contemplation in even the most buoyant of galleries, but no one said a word here for minutes at a time as they read display boards with unsettling headings such as \"Trapped by Snow,\" \"A Fateful Decision,\" \"Death and Banishment\" and \"Terrible News.\" \nFinally, as if seeking to lighten everyone's psychic load, a woman in a sleeveless red polka-dotted blouse and khaki shorts turned to a stranger beside her and said, in a deep Southern drawl, \"Always stay on the trail.\" Then she shook her head and repeated the admonition, wise words even today. The guy next to her nodded, but kept staring at a landscape painting of people with walking sticks trudging through snow drifts high as cabin chimneys. \nWhat Michele Sides, of Hillsboro, Texas, pointed out with her \"Always stay on the trail\" refrain is that, at its most basic, the Donner Party story is just a family (actually, multiple families) road trip gone horribly awry. \nAnd haven't we all been there? Our GPS sent us the wrong way, or we misheard Siri's instructions, and we wind up out in the middle of a whole lot of nothing and see our culinary options are reduced to scrounging the gaps in the seat cushions for stray french fries from yesterday's lunch and maybe an odd lozenge or two. \nAs presented at the visitors center, the Donner Party tragedy also is a cautionary tale about patience, or lack thereof. Rather than traveling by the established route, the Reed and Donner men were hellbent on taking this 300-mile shortcut an explorer named Lansford Hastings swore would get them there. As Jesse Quinn Thornton wrote in an 1848 account of the trek, \"Mrs. George Donner was ... gloomy, sad and dispirited ... that her husband and others could think for a moment of leaving the old road.\" \nCan't you just picture George, a pioneer version of Chevy Chase's Clark Griswold, clutching a hastily sketched map and swearing that this was the right way to go as the 89-person wagon train pushed on heedlessly into the Sierra? \nThough the cannibalism angle is basically glossed over, we do get a good idea of the entrees upon which the Donner Party feasted: a thin soup of boiled animal hides and bones, bark and pine twigs, dirt. Many in the party stayed alive on such a diet until rescued. (About three dozen people perished.) One of the more popular displays bears the heading, \"Why Did Women Survive?\" Answer: \"Women's smaller bodies give them an advantage because they need fewer calories than men. With more body fat, women have more energy reserves.\" \nThis pleased a visitor from San Rafael, Calif., who declined to give her name, who turned to me and commented on the resilience of women, crowing, \"That speaks volumes.\" \nThe rest of the visitors center is decidedly more upbeat, extolling the wonders of the road, with exhibits titled \"The Freedom of Travel\" and \"Open Road Adventures,\" and \"From Dirt to Asphalt: Transforming Donner Pass\" - perfect for tourists wanting affirmation that they are partaking in a grand tradition of travel. \n\"This is really nice,\" said visitor Steve Overhoff, with his wife, Bethany. \"We didn't expect to see all the stuff about the train tunnels and old Highway 40.\" But he admitted they came for the Donner Party. \n\"Everybody thinks of the cannibalism story, but in reality it was the don't-take-a-short-cut-that's-not-proven story and how easy it was to mislead everybody,\" Overhoff said. \"Google maps can mislead you, too.\" \nThe two were soon done perusing the aisles and back in their car. But other travelers kept streaming in to what already has proved to be a popular state-park stop. \nOne thing to know, though, before making the long trek up the mountain: Bring your own provisions, because they don't sell food at the Donner visitors center. \nIF YOU GO \nDonner Memorial State Park visitors center \nWhere: 12593 Donner Pass Road, Truckee \nHours: 10 a.m.-5 p.m., daily \nCost: Free, but $8 for parking \nMore info: www.parks.ca.gov; 530-582-7892", "external_links": [], "published": "2015-10-05T11:00:00.000+03:00", "crawled": "2015-10-05T18:09:38.586+03:00", "highlightTitle": ""}