{"organizations": ["SONY", "Airwheel M3 Electric Skateboard for Teenagers A Special Client of Airwheel M3 Electric Skateboard for Teenagers People"], "uuid": "c57e0adb3286ef7bea21f27209320501a3ffb3f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/a_special_client_of_airwheel_m3_electric_skateboard_for_teenagers/", "country": "US", "title": "A Special Client of Airwheel M3 Electric Skateboard for Teenagers", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "A Special Client of Airwheel M3 Electric Skateboard for Teenagers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T04:22:00.000+03:00", "replies_count": 0, "uuid": "c57e0adb3286ef7bea21f27209320501a3ffb3f1"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/a_special_client_of_airwheel_m3_electric_skateboard_for_teenagers/", "ord_in_thread": 0, "title": "A Special Client of Airwheel M3 Electric Skateboard for Teenagers", "locations": ["USA", "Airwheel"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex"], "text": "A Special Client of Airwheel M3 Electric Skateboard for Teenagers People used to relate CEOs with limos and luxury cars. The expensive cars may highlight their noble status. However, there is such a young CEO Alex who gets off the beaten track. He used to ride an intelligent self-balancing scooter to work. At the introduction of Airwheel electric skateboard M3, he couldn’t wait to buy one and try the new product. USA, 21 October 2015 -- People used to relate CEOs with limos and luxury cars. The expensive cars may highlight their noble status. However, there is such a young CEO Alex who gets off the beaten track. As a typical young elite, he advocates a green and healthy lifestyle. The sedans with large displacement and high emission do not conform to his concept of energy conservation and emission reduction. He would not drive unless on very formal occasions or on business trips. He lives only 15 minutes’ walking distance from his company. Therefore, he used to ride an intelligent self-balancing scooter to work. At the introduction of Airwheel electric skateboard M3, he couldn’t wait to buy one and try the new product. Alex runs an IT company. He could absolutely represent the passionate young generation with strong sense of social responsibility. They are creative and liable to accept new innovative things. Why could the motorized skateboard M3 attract such a young elite? How comes it’s different from an ordinary skateboard? It’s time to unveil the product.M3 is powered by SONY battery. It is inserted with two intelligent chips which work alongside with a remote control to realize infinitely variable speeds. Unlike intelligent unicycle which requires rider’s body movement to get moving, M3 is controlled by the remote control to go back and forth. Therefore, it is much easier to operate than the electric unicycles. In all modesty, riders of M3 could achieve the same feelings of surfing on land. M3 has a modular design. Even when one module breaks down, the whole system still works efficiently. This is the most creative feature of M3. The maximum speed of M3 could reach 18 km/h, a safe speed in city. For short distance commuters like Alex, M3 is a perfect company. No wonder it has received such a success during such a short time of launching. # # #", "external_links": [], "published": "2015-10-21T04:22:00.000+03:00", "crawled": "2015-10-21T17:35:48.845+03:00", "highlightTitle": ""}