{"organizations": [], "uuid": "e55c09963a8e1dec75bcd32aa415fbd004b05cc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.egyptindependent.com", "main_image": "", "site_section": "http://www.egyptindependent.com/rss-feed-term/154/rss.xml", "section_title": "Egypt Independent: Travel", "url": "http://www.egyptindependent.com//news/video-filmmaker-uses-trendy-technique-make-short-film-cairo", "country": "US", "title": "VIDEO: Filmmaker uses trendy technique to make short film on Cairo", "performance_score": 0, "site": "egyptindependent.com", "participants_count": 1, "title_full": "VIDEO: Filmmaker uses trendy technique to make short film on Cairo", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T13:15:00.000+03:00", "replies_count": 0, "uuid": "e55c09963a8e1dec75bcd32aa415fbd004b05cc6"}, "author": "Leita Boucicaut", "url": "http://www.egyptindependent.com//news/video-filmmaker-uses-trendy-technique-make-short-film-cairo", "ord_in_thread": 0, "title": "VIDEO: Filmmaker uses trendy technique to make short film on Cairo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new short film made by a Swiss-Egyptian filmmaker captures Cairo through the lens of the timelapse technique. Hisham Moll's \"Cairolapse\" is a labor of love created over a period of approximately one month. Originally from Egypt, Moll, 21, who has a Swiss father and an Egyptian mother, has been living in Tampa, Florida for the last three years where he is studying Film & Media Arts. Despite his move abroad, Moll's heart is still with Cairo. \"Egypt is home to me,\" says Moll. \"Growing up there, I was exposed to the livelihood of Cairo. Its people, culture and heritage are what inspired this project.\" Though many other cities in the world have been labeled \"the city that never sleeps,\" Moll is convinced that Cairo takes the prize. \"Cairo is by far the busiest city I have ever seen. To me it IS the city that never sleeps. There is beauty in every corner and I wanted to show that through 'CairoLapse'.\" Moll's project led him to areas in Cairo he had never been to, such as the Cairo Tower. \"Everyday I would drive by it [Cairo Tower], but never thought to visit. When I went up there to film, I saw a whole new perspective of Cairo and I wanted to project that in my film. Everyone is always in a rush and hurry, we Egyptians take our country’s beauty for granted and never take a moment to just take it in.\" His dreams for this film are simple and straightforward. \"What I hope to gain from 'CairoLapse' is exposure to Egypt; for people domestically and internationally to see Cairo in a new light and perspective.\" Moll made this film using the timelapse technique, a photography technique that demonstrates, in a few seconds, the movement or evolution of a subject that would normally take several minutes or hours to occur, such as the blossoming of a flower or the setting of the sun. He then took timelapse to another level by also using hyperlapse. \"This is the first ever hyperlapse film of Cairo. Hyperlapse is a timelapse camera technique that puts timelapse in motion,\" he says. Essentially, this technique involves moving the camera to present different perspectives. Traditional timelapse requires the camera to be stationary. When asked about the time he spent at each location, Moll said it varied. \"Most of the city shots took 20 minutes of shooting time, but the timelapse of the stars took just over 2 hours for one shot. Even though the stars don’t look like they move, they move! Just really slowly.\" Moll's biggest struggle, however, was actually getting to the shooting locations. \"Location scouting easily took a big time slot in this project because there were so many places to see and some places were hard to get to. But I did what I had to do, to get the shot.\" The three-minute film shows various scenes from Cairo's cityscape and Moll hopes to help Cairenes rediscover their city, as well as encourage others who are not as familiar with the city, to see it through his eyes.", "external_links": [], "published": "2015-10-14T13:15:00.000+03:00", "crawled": "2015-10-14T14:24:30.214+03:00", "highlightTitle": ""}