{"organizations": [], "uuid": "c54c695ed334eaa2eb065c707cf0b0962c61988e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/scotland/29309-2m-investment-brings-in-200m", "country": "US", "title": "£2m investment brings in £200m", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "£2m investment brings in £200m", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T11:10:00.000+03:00", "replies_count": 0, "uuid": "c54c695ed334eaa2eb065c707cf0b0962c61988e"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/scotland/29309-2m-investment-brings-in-200m", "ord_in_thread": 0, "title": "£2m investment brings in £200m", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "£2m investment brings in £200m £2m investment brings in £200m Details Created on Tuesday, 13 October 2015 09:10 Scottish economy boosted by conference fund A fund set up in 2012 to attract association conferences to Scotland has helped to boost the country’s economy by £200m. The VisitScotland Conference Bid Fund has helped to secure dozens of events throughout the country – in venues ranging from the Borders up to Shetland and in all seven cities – with some conferences booked for as far ahead as 2022. \nThe Bid Fund money awarded is based on match-funding subvention either by a destination organisation or local authority. The conferences must also tie in with Scottish Government target sectors, including aerospace, defence and marine; Business Processing Operations (BCO); chemical sciences; creative industries; education; energy; financial services; food and drink; ICT and electronic technologies; life sciences; textiles and tourism. Attendance at the supported events has ranged from 80 to 5,000 delegates. The predicted £200m economic boost has been achieved through less than £2m of investment from the Fund, with a total of 97 conferences already secured. Demonstrating the broad geographical spread and range of industries to have benefited, conferences secured through the Bid Fund include: Viking Congress – Shetland, 2013; Creative Orkney – 2014; Scottish Mountain Biking Conference: International Edition – Peebles, 2014: Environmental Interactions of Marine Renewables – Stornoway, Scottish Tourism Minister Fergus Ewing says: Business Tourism is a growing and important contributor to the Scottish economy, which creates jobs and reinforces Scotland’s credentials on the world stage across a range of key industries. As such I warmly welcome today’s news that, since its launch in 2012, VisitScotland’s Conference Bid Fund has shown excellent outcomes from our investment, helping attract conferences to Scotland. ‘The conferences, which are attracted by the work of the Business Events team and local authorities to bring more business tourism to Scotland, are expected to support the Scottish economy by up to £200m. The estimated gross spend is 100 times more than the Conference Bid Fund which is around £2 million. This predicted rate of return is one of the most successful we have seen and has successfully supported conferences from Shetland to Peebles and Skye to Perth and I look forward to welcoming more business visitors to Scotland over the coming years.’ Neil Brownlee, Head of Business Events at VisitScotland, says: ‘To boost the Scottish economy by £200m from less than £2m of investment is a remarkable achievement and demonstrates the huge importance of the VisitScotland Conference Bid Fund in attracting business events to this country. These are fixed, contracted conferences with specific delegate numbers that move around the world - we know what they are and what they bring and it is great to have such business ‘on-the-books’ so far out. “The business events industry is a key sector which supports not only conference centres and hotels throughout Scotland, but also hundreds of other operators not normally associated with tourism, such as AV companies, independent caterers and unique venues. “These events also create important links between industries, and these opportunities are key to driving even more business events to Scotland alongside agencies, trade shows and strategic partnerships. Scottish delegates attending events overseas can also play their part in securing a future conference for Scotland. ‘As well as supporting major conferences in the cities, the Bid Fund has also helped to bring events to every corner of the country, which will continue to boost regional economies in the years ahead.” Related articles", "external_links": [], "published": "2015-10-13T11:10:00.000+03:00", "crawled": "2015-10-13T11:19:30.184+03:00", "highlightTitle": ""}