{"organizations": [], "uuid": "cdc40d9c2dd29fe474df97c94cf3898cef89555e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30262688/canadian-pacific-holiday-train-ready-to-brighten-communities-warm-hearts-for-17th-year", "country": "US", "title": "Canadian Pacific Holiday Train ready to brighten communities, warm hearts for 17th year", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Canadian Pacific Holiday Train ready to brighten communities, warm hearts for 17th year - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "cdc40d9c2dd29fe474df97c94cf3898cef89555e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30262688/canadian-pacific-holiday-train-ready-to-brighten-communities-warm-hearts-for-17th-year", "ord_in_thread": 0, "title": "Canadian Pacific Holiday Train ready to brighten communities, warm hearts for 17th year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nCALGARY , Oct. 14, 2015 /PRNewswire/ - The Canadian Pacific (CP) Holiday Train will be traveling across Canada and the United States again this November and December raising money, food and awareness for food banks and hunger issues. Since its launch in 1999, the program has raised more than C$10.6 million and 3.6 million pounds of food for North American food banks and shelves.\n\"Year after year, the Holiday Train brings great talent and memorable experiences to families across our network while raising money for local food banks and food shelves,\" said E. Hunter Harrison , CP Chief Executive Officer. \"Regardless of circumstances, everyone should have access to healthy, nutritious food. The Holiday Train plays an integral role in broadening the conversation around food and hunger issues across North America .\"\nAgain this year, the Holiday Train program is encouraging people attending events to bring heart healthy donations. Heart health education and awareness is a tenet of CP's community investment program, CP Has Heart, which focuses on improving the heart health of men, women and children in communities across North America .\n\"CP's train of lights provides a platform to speak about the needs of North American food banks. This is why we are challenging all our event attendees to reach into their cupboards and donate quality nutritious food items to help raise food for those who need it most this holiday season,\" said Katharine Schmidt , Executive Director, Food Banks Canada.\nThe two brightly lit trains will kick off in the Montreal area on November 27 and 28 on their way to visit approximately 150 communities. The \"Canadian Train\" travels west across Canada finishing its journey in Port Coquitlam, British Columbia . The \"US Train\" visits communities across the U.S. Northeast and Midwest, and returns back to Canada for shows in Saskatchewan and Alberta .\nMontreal / Winnipeg band Chic Gamine will kick the tour off from the boxcar stage, with Francophone performances in Quebec . Holiday Train veteran and award-winning country singer Kelly Prescott will then take the reins on the Canadian Train with Devin Cuddy , and CP's famed Holiday Train band.\nOnce the Canadian train completes its journey across the prairies and arrives in Calgary , Devin Cuddy will reunite with his father, Canadian song-writing legend Jim Cuddy of Blue Rodeo and continue the trip with Kelly and the band until they reach the west coast.\nThe U.S. Train, which also makes stops in Southern Ontario , will showcase one of Canada's brightest young country music stars, Kira Isabella . Kira will rock the stage with chart topping jack-of-all-trades Wes Mack , until the Doc Walker country legends come aboard in Chicago .\nThe online schedule is now live at www.cpr.ca/holiday-train and lists which performers are stopping where and when.\nEach year, fans of the Holiday Train follow its journey over social media, posting spectacular images of the trains in various cities and landscapes. Those who capture the spirit of the train, holiday entertainment and the spirit of giving are encouraged to enter the \"Capture the Spirit\" photo contest for the chance to win an exclusive ride on next year's train. Details about the contest will be available closer to the start of the program on the Holiday Train Facebook page .\nTo help make this year the best yet for local food banks, the Holiday Train asks fans new and old to follow the train on social media, invite their friends and family and spread the message about the importance of heart-healthy donations by using #HealthyDonations.\nFacebook /HolidayTrain\nTwitter @CPHolidayTrain\nInstagram @CPHolidayTrain\nUse #CPHolidayTrain and #HealthyDonations\nFor additional information, photos, a route map, and downloadable pictures of the two trains, visit: www.cpr.ca .\nNote to editors:\nFor additional information, photos, a route map, broadcast b-roll, and downloadable pictures of the two trains, visit: cpr.ca .\nAbout the Canadian Pacific Holiday Train\nCanadian Pacific's annual Holiday Train program is a rolling fundraising event that travels across Canada and the United States raising money, food, and awareness for food banks and hunger issues, hosting free holiday concerts along the way. Since 1999 the program has raised over C$10.6 million and 3.6 million pounds of food. Each Holiday Train is about 1,000 feet in length with 14 rail cars decorated with hundreds of thousands of technology-leading LED lights and a modified boxcar that has been turned into a traveling stage for performers.\nAbout CP Has Heart\nAt CP, we know that a railroad may serve as the arteries of a nation, but at its heart is community. That's why, through CP Has Heart, we've already committed more than $6 million dollars to help improve the heart health of men, women and children across North America . And along the way, we're showing heart whenever we can. Find out more on www.cpr.ca or @CPhasHeart .\nAbout Canadian Pacific\nCanadian Pacific (TSX:CP)(NYSE:CP) is a transcontinental railway in Canada and the United States with direct links to eight major ports, including Vancouver and Montreal , providing North American customers a competitive rail service with access to key markets in every corner of the globe. CP is growing with its customers, offering a suite of freight transportation services, logistics solutions and supply chain expertise. Visit cpr.ca to see the rail advantages of Canadian Pacific.\nSOURCE Canadian Pacific\nImage with caption: \"Canadian Pacific Holiday Train (CNW Group/Canadian Pacific)\". Image available at: http://photos.newswire.ca/images/download/20151014_C9992_PHOTO_EN_44312.jpg\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=TO701&Transmission_Id=201510141720PR_NEWS_USPR_____TO701&DateId=20151014", "http://www.xmlnews.org/ns/", "http://www.facebook.com/holidaytrain", "http://www.cpr.ca/holiday-train", "http://photos.newswire.ca/images/download/20151014_C9992_PHOTO_EN_44312.jpg", "http://www.twitter.com/CPhasHeart", "http://www.cpr.ca/en/community/holiday-train"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T01:48:39.278+03:00", "highlightTitle": ""}