{"organizations": [], "uuid": "652d1372cec08d75be43c1e8530bdebb6e83c1e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30310087/poopourri-launches-business-product-line-with-restroom-caddy", "country": "US", "title": "Poo~Pourri® Launches Business Product Line with Restroom Caddy", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Poo~Pourri® Launches Business Product Line with Restroom Caddy - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "652d1372cec08d75be43c1e8530bdebb6e83c1e2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30310087/poopourri-launches-business-product-line-with-restroom-caddy", "ord_in_thread": 0, "title": "Poo~Pourri® Launches Business Product Line with Restroom Caddy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Poo~Pourri\nProduct brings new relief to employees and guests\nDALLAS , Oct. 20, 2015 /PRNewswire/ -- Poo~Pourri, the award winning before-you-go toilet spray that is proven to stop toilet odors before they begin, is launching a business product line for commercial and retail spaces. The new product line will feature a professional caddy that is designed with a retractable lanyard, which serves as a theft deterrent.\nThe professional caddy can be installed in public restrooms to eliminate bathroom odors for businesses and public venues. Research has found that eliminating odor before it begins can help improve the business environment. In fact, 89% of customers say restroom odor is a primary sign of uncleanliness in a business (source: Cintas).\nThe caddy is simple to install on a variety of surfaces and holds an eight-ounce bottle of Poo~Pourri, which contains up to 400 uses.\n\"This new product line will help business and facility managers keep their restrooms smelling clean without the use of aerosol sprays and other chemicals that simply cover up the smell because unlike alternatives, Poo~Pourri eliminates the odor altogether,\" says Suzy Bátiz, CEO and Founder of Poo~Pourri.\nBátiz continued, \"The work environment continues to be one of the most sensitive places for people 'to do their business.' Research has shown that people are embarrassed to go to the bathroom at work. Offering a commercial product line gives relief to customers and employees so they can get 'going' without anyone knowing.\"\nThe new commercial product uses the same 100% natural and earth-friendly ingredients as the widely used and well-known product that individuals have been using at home and at the office for years.\nThe retail price of the professional caddy alone is $24.95 , or $39.95 with an eight-ounce bottle of Poo~Pourri included. Additional refills sold separately.\nThe new professional caddy will be on display at the 2015 ISSA/INTERCLEAN Tradeshow in Las Vegas October 20-23 . ISSA is the leading trade association for the cleaning industry worldwide. More than 16,000 cleaning-industry leaders and 700 exhibitors will be in attendance at the conference.\nSince 2007, Poo~Pourri Before-You-Go Toilet Spray has been stopping bathroom odor before it begins so you can leave the bathroom smelling better than you found it. With over 125 million combined YouTube views and over 10 million bottles sold, Poo~Pourri has become a pop culture sensation and start-up success. Poo~Pourri is sold in over 9,000 retail locations nationwide including CVS, Bed Bath & Beyond, Ulta, QVC and Amazon.com. Poo~Pourri earned the Good Housekeeping Seal of Approval in 2013 and an Edison award in 2014. The company was also ranked on Inc.'s 5000 Fastest Growing Companies. To learn more, visit www.poopourri.com .\n releases/poopourri-launches-business-product-line-with-restroom-caddy-300163397.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/poopourri-launches-business-product-line-with-restroom-caddy-300163397.html", "http://www.poopourri.com/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA33899&Transmission_Id=201510201724PR_NEWS_USPR_____DA33899&DateId=20151020"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T06:14:25.531+03:00", "highlightTitle": ""}