{"organizations": ["Northeast"], "uuid": "cfdabacfef0cd3fad3ccaae5636abb94c260cd1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/dcx/2015/10/22/1311800.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/739200/boat-racing-in-the-northeast", "country": "TH", "title": "Boat racing in the Northeast", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Boat racing in the Northeast", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:26:00.000+03:00", "replies_count": 0, "uuid": "cfdabacfef0cd3fad3ccaae5636abb94c260cd1a"}, "author": "", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/739200/boat-racing-in-the-northeast", "ord_in_thread": 0, "title": "Boat racing in the Northeast", "locations": ["Muang", "Laos", "Mukdahan", "Thailand", "Indochina", "Mekong River"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boat racing in the Northeast 22 Oct 2015 at 03:26 147 viewed 0 comments NEWSPAPER SECTION: LIFE | WRITER: PICHAYA SVASTI - + From Saturday until Oct 27, Thailand and Laos will host an annual boat race on the Mekong River in front of Indochina market in Muang district, Mukdahan province. \nThe traditional Thai-Lao boat race. \nHighlights will be boat racing and the Tee Chang Nam Nong ceremony for worshipping the Goddess of Water in the Mekong River. Visitors can also watch local performances, taste local food and buy products at the Indochina Fair. Call the Mukdahan City Municipality on 042-611-027 or the TAT Call Center 1672. Thailand-China friendship caravan \nFrom Nov 16 to Dec 13, the TAT and the Embassy of China will host the \"15,000 Miles From Altai To Suvarnabhumi\" Thai-Sino culture and tourism friendship caravan on the Silk Road from China to Thailand via Laos. \nThe event marks the 40th anniversary of diplomatic relations between Thailand and China and the 60th birthday of Her Royal Highness Princess Maha Chakri Sirindhorn. \nThe 31-day trip will cover the Silk Road by starting from China around the Altai Mountains, to Xishuangbanna past Laos, entering Thailand via Chiang Rai and exploring the 19 provinces in Thailand. \nThe caravan will tour the Altai Golden Mountain, five-coloured lake, and Kelamayi, the largest black oil well in Xinjiang, and Gansu's Tomb of Emperor Harmi and dunes of Mingshashan, Buddha images cave and Danxia Landform Geological Park. \nIn Shanxi, the group will visit Jizan Cave and the Tomb of Emperor Qin. Next will be Xichuan's Wu Zetian Temple and the historic battle route during the Three Kingdoms period as well as Chengdu's Giant Panda Conservation Centre and Guan Xai Xiang Guan ancient city. The trip in China will conclude in Yunnan with visits to the Million Years Stone Park in Kunming. \nThe caravan will continue on to Laos and enter Thailand through Chiang Rai and visit Wat Rong Khun and more. They will then travel through Phayao and Phrae, visit Lop Buri's Phra Prang Sam Yot temple, Narai Ratchaniwet Palace and Phra Kan Shrine and worship the Buddha's Footprint at Wat Phra Phutthabat. Other destinations include Angthong's Wat Muang, Suphan Buri's Dragon Village, the Ayutthaya Historical Park and Nonthaburi's Mangkorn Kamalawat 2 Temple. \nIn Chachoengsao, they will pay respect to Luang Phor Sothon, the revered Buddha image at Wat Sothonwararam, and the giant Ganesh statue at Wat Saman Rattanaram. Next stops will be Samut Prakan's Ancient Siam, Ban Bang Phlub Community Learning Centre, King Rama II Memorial Park and Bang Kung Camp. They will travel to Kanchanaburi to see the Bridge over the River Kwai, enjoy rafting, visit a temple and Krasae Cave. They will travel to Bangkok to see the Grand Palace and Temple of the Emerald Buddha before a gala dinner party and a certificate presentation at the Chinese Cultural Centre in Bangkok. Visit www.tiewpakklang.com . Candle Fest in Sakon Nakhon \nFrom tomorrow until Oct 27, the annual Sakon Nakhon Wax Castle Festival and Long Boat Racing will take place at the Ming Muang field, the Princess Mother Srinakarin Memorial Park and the Sakon Nakon Municipal Office in Muang district, Sakon Nakhon province. \nVisitors will be amazed by the wax candle parade and able to taste local delicacies at the food fair and watch long boat racing and traditional performances at the park. Call the Sakon Nakhon City Municipality on 042-733-168. Tour de Thailand in Phuket \nThroughout this month, the Tour de Thailand, a cycling series throughout Thailand, will take place at Phuket. Participants can choose from numerous choices of cycling, not racing, and experience Thailand's rich and diverse culture with Phuket's breathtaking scenery. Call the TAT Call Centre 1672. if you have any news to share.   0 people liked / 0  ", "external_links": [], "published": "2015-10-21T23:26:00.000+03:00", "crawled": "2015-10-22T12:03:30.955+03:00", "highlightTitle": ""}