{"organizations": [], "uuid": "d03118e6c8404873c78fdd1d6ac2b485eedab396", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gocentralamerica.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/150127577.jpg", "site_section": "http://z.about.com/6/o/m/gocentralamerica_t2.xml", "section_title": "About.com Central America Travel: What's Hot Now", "url": "http://gocentralamerica.about.com/od/costaricaguide/tp/Costa-Rica-Souvenirs.htm", "country": "US", "title": "Top Eight Souvenirs from Costa Rica", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Top Eight Souvenirs from Costa Rica", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:07:00.000+03:00", "replies_count": 0, "uuid": "d03118e6c8404873c78fdd1d6ac2b485eedab396"}, "author": "", "url": "http://gocentralamerica.about.com/od/costaricaguide/tp/Costa-Rica-Souvenirs.htm", "ord_in_thread": 0, "title": "Top Eight Souvenirs from Costa Rica", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Articles and Resources \nEver have that sinking feeling when you buy a beautiful, chiseled wood piece from a tropical enclave in the Caribbean, only to turn it over and have the words ‘Made in China’ stare back at you? It’s an easy mistake for a novice traveler and it sometimes gets the better of the more experienced voyagers. \nTo avoid moments like these – and to ensure the keepsakes you take home have significance to Costa Rica – take a minute to look over the list of must-buy Costa Rican souvenirs. You can find many of them at the artisan market at Plaza de la Democracia in downtown San José or in the tourist towns that line the coasts. 1. Café Britt or Dota Coffee \nI see many tourists make the mistake of wandering into the grocery store and clearing the shelves of local coffee brands. Little do they know, the coffee they will be hand-carrying back to their home country didn’t qualify as exportation grade. More than 90 percent of Costa Rica’s coffee is shipped out and only the lower grades remain in the country. There are a few coffee brands offering boutique coffee, which haven’t exported their top-of-the-line beans to northern markets. To ensure you are bringing home only the best, look for Café Britt or Dota. Coffee Cooperative of Dota (Coopedota) recently introduced the first carbon neutral coffee in the Americas. \nApproximate cost: $7-$9 2. Banana Paper \nThe waste product in the banana industry – banana leaves – have long-clogged the country’s river ways, polluting communities and fragile ecosystems. A few years ago, a handful of savvy entrepreneurs decided to collect this waste product and turn it into recycled paper, which is sold as reams for printing paper and greeting cards in the United States. In Costa Rica, you can find these greeting cards in the artisan market and in many souvenir shops. \nApproximate cost: $5-$6 More » 3. Sibú Chocolate \nFirst harvested by the indigenous on the Caribbean coast, the chocolate bean, which comes from the cacao tree, has a long history in Costa Rica. Sibú Chocolate has harnessed the country’s experience in producing chocolate, refining it into flavors that rival the best tastes of Europe. The small company works with a Rainforest Alliance certified farm on Costa Rica’s Atlantic slope, which ensures fair wages and dignified living conditions. Chocolates include carmel-infused fresh ginger and coconut, organic vanilla bean milk chocolate, a signature spicy truffle with nutmeg and cinnamon and a Tarrazú cappuccino milk chocolate, among others. You can find Sibú Chocolate at these locations . \nApproximate cost: $8-$25 More » 4. Pachuco T-Shirts \nCosta Rica’s underground language of Pachuco has made it onto to a t-shirt brand. These high-quality, fashionable t-shirts, which retail for anywhere from $10-$15, can now be found in most tourist shops. With fun words such as “Pura Vida” (Pure Life), “Mae” (Man) and “Tuanis” (Too nice or too cool), these shirts are ones that won’t be confined to the back of the closet. \nApproximate cost: $10-$15 5. Aromas para el Alma \nBath products from the women-run Aromas para el Alma are designed to help users relax, energize or detoxify. Made with natural raw materials and packaged with reusable packaging, these products are good for your health and good for the environment. The company claims to be carbon neutral, offsetting its footprint by investing in programs such as Programa Aliados Cambio Climatico . Look for lotions, oils or sprays at these specialty stores . \nApproximate cost: $10-$20 More » 6. Mango Wood Candle Holders \nThese mango wood pieces are always a popular gift among family and friends. Carved from local mango trees, they make the perfect table display in a living room or kitchen. Look for them in souvenir shops or at the artisan market. \nApproximate cost: $15-$20 7. Recycled Coffee Bags \nMade by a women’s co-op in the at-risk community of La Carpio, these multi-purpose bags tout both social and environmental responsibility. In collaboration with the Humanitarian Foundation , women stitch together recycled coffee packaging to form a patterned To-Go bag. Only on sale at Café Britt stores in Heredia and the airport. \nApproximate cost: $15 8. Deli Sweet Jelly \nThis particular brand of jelly may be a little hard to find, but jellies are a great way to take home the richness of the country’s tropical fruit. After a few years spent sampling the different local jellies, this brand tops the list in terms of quality. Made by producers in the western suburb of Santa Ana, Deli Sweet jelly sells for $4.50 at the AutoMercado in the Multiplaza in Escazú. \nApproximate cost: $4.50", "external_links": [], "published": "2015-10-14T14:07:00.000+03:00", "crawled": "2015-10-15T12:02:39.961+03:00", "highlightTitle": ""}