{"organizations": [], "uuid": "000c7795b1ed1785b98ac7b6e89121a0d9c6520d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03462/England_s-coach-St_3462815k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-05.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sport/rugbyunion/11911204/The-game-goes-on.html", "country": "US", "title": "The game goes on", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The game goes on - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:00:00.000+03:00", "replies_count": 0, "uuid": "000c7795b1ed1785b98ac7b6e89121a0d9c6520d"}, "author": "Telegraph View", "url": "http://www.telegraph.co.uk/sport/rugbyunion/11911204/The-game-goes-on.html", "ord_in_thread": 0, "title": "The game goes on", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "England’s failure in the Rugby World Cup arouses strong feelings, and invites questions about the team’s tactics and leadership. Is new management needed? What about the structure of domestic rugby , and the way the sport is run at grass-roots level? More widely, is there something wrong in English sport? This is the third time the nation has suffered ejection at the group stages of a World Cup – football, cricket and now rugby. These are questions for another day, however, for the tournament continues with glorious pace and intensity. Some pundits have suggested that the English failure will deprive the rest of the contest of public interest, implying that without English involvement, England fans will turn away. That is too pessimistic. Everyone who is English is also British, part of the awesome family of nations that make up the United Kingdom of Great Britain and Northern Ireland. The other home nations remain in the competition; the Welsh are already through to the next round . Home interest in this tournament is not over – some English fans will bring themselves to cheer on their cousins from elsewhere in these islands. Others may shout for the noble underdogs who remain; Japan’s defeat of South Africa continues to inspire. The English rugby fan’s love of England is great, but it is at least matched by passion for the game itself The English rugby fan’s love of England is great, but it is at least matched by passion for the game itself. The World Cup has offered numerous examples of the skill, athleticism and courage required by rugby at the highest level, and more such triumphs surely await. Saturday’s result was heartbreaking, but the game goes on. England will watch and marvel, and dream of games to come. Telegraphsportpage Follow @telegraphsport", "external_links": [], "published": "2015-10-05T14:00:00.000+03:00", "crawled": "2015-10-05T08:33:23.573+03:00", "highlightTitle": ""}