{"organizations": ["PTI", "CNW Telbec", "STM", "Agglomeration of Montréal"], "uuid": "236b67aeec4bf802e69791a8a021ff4a1050e646", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newswire.ca", "main_image": "", "site_section": "http://rss.newswire.ca/en/newswire/rls_tra_en.xml?0E4CAE8E599E11E2B9D5B34A46C71D46", "section_title": "CNW :  Travel Industry", "url": "http://www.newswire.ca/news-releases/stms-2016-2018-three-year-capital-expenditures-program---28b-to-improve-the-customer-experience-535237181.html", "country": "CA", "title": "STM's 2016-2018 three-year capital expenditures program - $2.8B to improve the customer experience", "performance_score": 0, "site": "newswire.ca", "participants_count": 0, "title_full": "STM's 2016-2018 three-year capital expenditures program - $2.8B to improve the customer experience", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:58:00.000+03:00", "replies_count": 0, "uuid": "236b67aeec4bf802e69791a8a021ff4a1050e646"}, "author": "", "url": "http://www.newswire.ca/news-releases/stms-2016-2018-three-year-capital-expenditures-program---28b-to-improve-the-customer-experience-535237181.html", "ord_in_thread": 0, "title": "STM's 2016-2018 three-year capital expenditures program - $2.8B to improve the customer experience", "locations": ["Canada", "Montréal", "Québec"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Philippe Schnobb", "Luc Tremblay"], "text": "Français MONTRÉAL, Oct. 21, 2015 /CNW Telbec/ - The Société de transport de Montréal (STM) has tabled its three-year capital expenditures program (PTI) valued at more than $2.8B that details its planned capital expenditures for 2016-2018. Those investments are needed to upgrade or replace equipment and infrastructure that have or will reach the end of their service life in the next few years. « The STM is investing to maintain its assets so that it can increase the reliability, punctuality and accessibility of transit services while improving customer information. That represents a huge challenge because, over the last decades, the company has cumulated a $4.3B deficit with asset maintenance. As a result, of the $2.8B , 73% will be invested in our equipment and installations over the next three years. Therefore, the STM is choosing to refurbish its installations, an underlying condition to offering quality service », declared Philippe Schnobb , chairman of the STM board of directors. The 2016-2018 PTI outlines 43 projects, with 17 of them taking up 97% of overall investments totalling more than $2.7B . Several of these will contribute directly to improving the transit experience for customers. As such, the STM will invest over $1.1B to purchase the new AZUR cars, thereby increasing the métro's passenger capacity by 8% once the old cars are replaced. It will also move forward with métro station renovations, earmarking over $277M for that program, including $36M for the ongoing refurbishment of Berri-UQAM station. The reliability of the métro and its stationary equipment will not be overlooked, with investments of nearly $415M directed specifically to phases III and IV of the Réno-Systèmes program. For bus services, priority is given to renewing the fleet through the acquisition of 258 hybrid drive buses, worth $254M . As for bus preferential measures (MPB), the STM expects to expand reserved lanes on the island of Montréal from 210 kilometres to 375 kilometres, for $43M . Furthermore, the iBUS project with a total investment of $155M will start rolling out gradually in 2016, providing transit users with real-time information and increasing their safety. The Governments of Québec and Canada along with the Agglomeration of Montréal are funding 79% of the STM's capital expenditures, or some $2.2B . The ministère des Transports du Québec (MTQ) is shouldering 65% of that amount, with the other 11% funded by the federal government. Together, the STM and the Agglomeration of Montréal are covering the difference, 21%, for a total of $594M . « Over a lifetime, companies go through cycles, and the STM is no exception. The directions outlined in the 2016-2018 three-year capital expenditures program mark the beginning of a new cycle for our company, one in which we strive for a better balance between improving the customer experience and increasing ridership. Thanks to the unwavering support of our partners, namely the Agglomeration of Montréal, the ministère des Transports du Québec, the Governement of Canada , and our employees, we begin this new cycle confident that we can further improve the transit experience for our customers and further expand our services, » added Luc Tremblay , STM's chief executive officer. The capital expenditures (PTI) document is available (in French only) on the STM website by clicking on: http://www.stm.info/sites/default/files/pdf/fr/pti_16-18.pdf \nSOURCE Société de transport de Montréal \nFor further information: Isabelle A. Tremblay, Affaires publiques, 514 280-4940, isabelle.tremblay@stm.info RELATED LINKS", "external_links": [], "published": "2015-10-21T23:58:00.000+03:00", "crawled": "2015-10-22T01:44:03.317+03:00", "highlightTitle": ""}