{"organizations": [], "uuid": "ce1ec5134cab923162027490816fe27df3acb7ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30274911/lf-logistics-scores-a-double-at-the-2015-frost-sullivan-asia-pacific-best-practices-awards", "country": "US", "title": "LF Logistics Scores a Double at the 2015 Frost & Sullivan Asia Pacific Best Practices Awards", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "LF Logistics Scores a Double at the 2015 Frost & Sullivan Asia Pacific Best Practices Awards - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "ce1ec5134cab923162027490816fe27df3acb7ae"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30274911/lf-logistics-scores-a-double-at-the-2015-frost-sullivan-asia-pacific-best-practices-awards", "ord_in_thread": 0, "title": "LF Logistics Scores a Double at the 2015 Frost & Sullivan Asia Pacific Best Practices Awards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Frost & Sullivan\nSINGAPORE , Oct. 16, LF Logistics (a Li & Fung Company) has scored a double by picking up the Asia Pacific Regional Logistics Service Provider of the Year and Asia Pacific Warehouse Service Provider of the Year awards.\nThe awards were presented to LF Logistics at the 2015 Frost & Sullivan Asia Pacific Best Practices Awards banquet held at the Conrad Centennial Singapore yesterday.\nMr. Zainal Izham , Research Analyst, Asia Pacific at Frost & Sullivan said that LF Logistics offers a complete package when it comes to its service offerings and experience in logistics handling in Asia Pacific .\n\"Their dependable supply chain management capabilities, incorporating inter-modal transportation, supply chain network design and cross-docking among others, have produced reliable services for its customers,\" he added.\nHe also said that LF Logistics' esteemed efficiency is boosted by the development of distribution centers across the region. The company's aggressive expansion into China , Hong Kong , Korea, Taiwan , Singapore , Thailand , Indonesia , Malaysia and Dubai enables them to facilitate high density storage of bonded and general cargo, offering value added services to the market.\n\"Future plans to expand their market coverage into Japan and India are well-received by their customers, mostly from the retail sector. Having had a stellar year in 2014, LF Logistics is poised to continue its positive momentum in the years to come,\" Mr. Zainal said.\nMr. Joseph Phi , President of LF Logistics said that the company is honored to be presented with two prestigious awards by Frost & Sullivan.\n\"Our real competitive strength lies in our people. This recognition is a tribute to all of our team members who always go the extra mile to make things happen and get things done. This also is a testament to our dedication to form partnerships with our customers who value our comprehensive suite of customized and innovative logistics solutions covering both in-country logistics and global freight management,\" he said, adding that the awards will spur LF Logistics to continue providing its customers with value optimization and service excellence.\nThe Frost & Sullivan Asia Pacific Best Practice awards have identified and honored best-in-class companies that have demonstrated excellence in their respective industries.\nThe recipients of the 2015 Frost & Sullivan Asia Pacific Best Practices Awards were identified based on an in-depth research conducted by Frost & Sullivan's analysts. The award categories offered each year are carefully reviewed and evaluated to reflect the current market landscape and include new emerging trends.\nThe short-listed companies were evaluated on a variety of actual market performance indicators which include revenue growth; market share and growth in market share; leadership in product innovation; marketing strategy and business development strategy.\nAbout Li & Fung Limited\nLi & Fung (SEHK: 494), the Hong Kong -headquartered multinational group, is the world's leader in consumer goods design, development, sourcing and logistics. It specializes in responsibly managing supply chains of high-volume, time-sensitive goods for leading retailers and brands worldwide, in more than 300 offices across 40 economies.\nFor more information, please visit www.lifung.com\nAbout Frost & Sullivan\nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants.\nFor more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organization prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies?\nContact Us: Start the discussion\nMedia Contact:\nCarrie Low\nCorporate Communications – Asia Pacific\nPhone: +603.6204.5910\nEmail: carrie.low@frost.com\nMelissa Tan\nCorporate Communications – Asia Pacific\nPhone: +65.6890.0926\nEmail: melissa.tan@frost.com\n releases/lf-logistics-scores-a-double-at-the-2015-frost--sullivan-asia-pacific-best-practices-awards-300161029.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DA30202&Transmission_Id=201510160100PR_NEWS_USPR_____DA30202&DateId=20151016", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Contact", "http://www.lifung.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/lf-logistics-scores-a-double-at-the-2015-frost--sullivan-asia-pacific-best-practices-awards-300161029.html"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T08:50:33.706+03:00", "highlightTitle": ""}