{"organizations": ["Boeing", "Atlas Air, Inc", "Transportation Security Agency", "United Services Organization", "Millionth Military Passenger Atlas Air, Inc", "Atlas Air Worldwide Holdings", "Atlas Air, Inc.", "Department of Defense"], "uuid": "4997cc96024686a33dc1f60b8edcc1835fc39e10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_6_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13330214/1/atlas-air-inc-celebrates-one-millionth-military-passenger.html?cm_ven=RSSFeed", "country": "US", "title": "Atlas Air, Inc. Celebrates One Millionth Military Passenger", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Atlas Air, Inc. Celebrates One Millionth Military Passenger", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:00:00.000+03:00", "replies_count": 0, "uuid": "4997cc96024686a33dc1f60b8edcc1835fc39e10"}, "author": "", "url": "http://www.thestreet.com/story/13330214/1/atlas-air-inc-celebrates-one-millionth-military-passenger.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Atlas Air, Inc. Celebrates One Millionth Military Passenger", "locations": ["N.Y.", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Thurgood Marshall Airport"], "text": "Atlas Air, Inc. Celebrates One Millionth Military Passenger By GlobeNewswire | 10/20/15 - 09:00 AM EDT Reprint PURCHASE, N.Y., Oct. 20, 2015 (GLOBE NEWSWIRE) -- Atlas Air Worldwide Holdings, Inc. (Nasdaq:AAWW) today announced that its Atlas Air, Inc. unit celebrated the flying of its one millionth military passenger on Tuesday, October 13. The lucky service member checked in to board a flight from Baltimore/Washington International Thurgood Marshall Airport to a military base in Germany aboard one of the company's eight passenger aircraft. The service member and his family received a first-class welcome and several mementos commemorating the flight. In honor of the occasion, all 250 Department of Defense service members, civilians and family members on Tuesday's flight, representing all branches of the military, received a commemorative coin and several other special items. Many travelers on the flight said this was the first time they had witnessed such an event and they were especially happy to see a deserving young soldier receive this special recognition. The lucky passenger, who is outbound to his first overseas assignment, remarked that he was very surprised and somewhat concerned when an Air Mobility Command representative pulled his family out of the check-in line. Upon learning about his special recognition he quickly said, \"Wow, what an honor it is to be the millionth passenger!\"At Tuesday's celebration, the Atlas team received outstanding support from the Air Mobility Command airport staff and contractors. In addition, the United Services Organization (USO), the BWI Marshall Airport and the Transportation Security Agency provided generous assistance. Atlas Air, Inc. began passenger operations in May 2010 and flew its first military passenger mission on May 17, 2011. Atlas's passenger fleet includes four Boeing 747-400s, two of which are custom-configured VIP aircraft with 189 business class seats. The company also operates three Boeing 767-300ERs and one VIP-configured 767-200. The airplanes, flown on a charter basis, transport sports teams, touring bands, film shoots, heads of state, and private parties, in addition to our servicemen and women, DoD civilians, and their families. 1 of 2", "external_links": [], "published": "2015-10-20T16:00:00.000+03:00", "crawled": "2015-10-20T16:06:02.562+03:00", "highlightTitle": ""}