{"organizations": [], "uuid": "250ac6a74c3b514101034dee35d30998d0c7d43f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03480/HP_abstract_printe_3480986a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-23.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/tech-guides/11950409/smarter-office-technology-fight-cybercrime.html", "country": "US", "title": "Smarter office technology can help fight cybercrime", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Smarter office technology can help fight cybercrime - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:29:00.000+03:00", "replies_count": 0, "uuid": "250ac6a74c3b514101034dee35d30998d0c7d43f"}, "author": "Hugh Wilson", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/tech-guides/11950409/smarter-office-technology-fight-cybercrime.html", "ord_in_thread": 0, "title": "Smarter office technology can help fight cybercrime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You’re a small business leader who takes cyber security seriously. All your company’s computers run up-to-date antivirus and anti-malware software. Your network is protected by a firewall. You regularly brief staff about the need to keep the personal devices they sometimes use for work similarly secure. And then you remember that in late 2013 US retailer Target was hit by one of the biggest data breaches in history, carried out by criminals who bypassed frontline security and accessed the company’s networks via a heating, ventilation and air conditioning (HVAC) contractor. You recall too that last year’s Home Depot attack, also in the US, which compromised 56 million payment card details and collected 53 million email addresses, was achieved through malware planted mainly in payment systems in the self-checkout lanes at retail stores. And what begins to dawn is that companies large and small are still more vulnerable to cybercrime than anyone likes to admit. Seeing the front door slammed shut and soundly bolted, criminals have taken to sneaking around the back, searching for vulnerabilities that nobody, as yet, takes seriously as such. Target’s HVAC attack reminded everyone in business that no network is safe if any part of it – however obscure – remains unprotected. The humble office printer might be gearing up to be a new front line in the war against cybercrime The numbers involved in the Target attack, and others like it, are frightening. A report by Ponemon Research estimated the cost of a data breach at upwards of US$194 (around £128) per compromised record, and the Target attack involved the theft of 40m credit-card details. Then stir a couple of further statistics into the mix. It’s estimated that there will be 25 billion connected devices in the world by 2020 which, for organised and sophisticated cybercriminal gangs, represent billions of potential creaky back doors. And cybercrime is proving lucrative, as a 48pc year-on-year growth in cyber-attacks suggests. So where might your company’s vulnerabilities lie? After all, you don’t have retail payment terminals or an HVAC contractor. Your online payments are handled securely by a trusted third party. Your security policy is regularly updated as new risks come to light. As you ponder all this, the familiar buzz and whirr of a printer cranking into action interrupts your chain of thought. A few years ago your printers were connected to the PCs that served them with thick physical cables and nothing else. Today, your printers and multi-purpose devices (printers, scanners and copiers in one) are effectively fully fledged computers on your network, accepting instructions both from a secretary on the other side of the office working on a company laptop and a sales executive on the other side of the continent sending data from his personal mobile phone. IT professionals predict an increase in printer-related security breaches And that should give you pause for thought. If you’re beginning to see your printer fleet as a potential back door into sensitive company information and customer details, you’re not alone. New research by Ponemon has found that a majority of IT professionals now agree that “printer security is an overlooked security risk”. A majority of them think their printers are already likely to be infected with malware, and most predict an increased risk of printer-related security breaches in the next 12 months. At the same time, 56pc of enterprise companies ignore printers in their endpoint security strategy. “People don’t think of the printer as a nefarious actor in their network,” says Patricia Titus, a distinguished fellow of the Ponemon Institute, “but printers are now just like PCs.” It seems that the humble office printer might be gearing up to be a new front line in the war against cybercrime, a backdoor vulnerability that criminals are starting to explore seriously, if they haven’t already. One printer manufacturer has recognised this risk and acted to address it. HP’s new generation of printers combines sleek good looks and sector-leading performance with a suite of state-of-the-art security measures. In short, the latest HP printers are the most secure in the world. 56pc of enterprise companies ignore printers in their endpoint security strategy “Protecting against security breaches is one of the biggest challenges our customers face,” says Tuan Tran, HP’s vice president and general manager for its LaserJet and Enterprise Solutions business. “HP is helping customers secure their devices, documents and data by defending our enterprise printers with the strongest protection in the industry.” That’s no idle claim. The new MFP 500 series models which are hitting the market in October and November feature multiple levels of security that reach deep into the printer architecture, protecting its memory and operating system with technology that is currently unique to HP printers. “There’s a growing concern around printer security specifically,” says Mr Tran. “We hope that now a lot more printer companies will step up and talk about the problem.” That’s for the future. For now let’s see exactly how HP’s latest Enterprise printers help to make your network more secure – and more efficient. Gold-standard security Computers and printers are vulnerable when they first start up, and cybercriminals can exploit weaknesses in the boot cycle to load malicious malware into systems. HP Sure Start technology has been protecting the company’s Elite PCs from just such a possibility since 2013, and in response to the diversifying security landscape Sure Start now comes as standard on new HP LaserJet Enterprise and multi-function printers (MFPs). Sure Start checks the BIOS – the boot instructions used to load fundamental hardware components and initiate the printer’s operating system – every time the printer boots up. If it detects something amiss, it restarts the printer from a safe “golden” copy of the BIOS. In effect, the printer heals itself, protecting sensitive data and saving businesses considerable time and agitation. Intrusion detection The price of network security is eternal vigilance, and HP’s Run-time Intrusion Detection widens that concept to printer operations. It is your HP Enterprise printer’s always-alert lookout, constantly monitoring the device memory for malicious attacks. Developed in partnership with embedded device security experts Red Balloon Security, Run-time Intrusion Detection helps protect devices while they are operational and connected to the network, the time when most attacks occur. If it detects an anomaly during firmware or memory operations Run-time Intrusion Detection acts instantly and decisively, ordering the printer or MFP to automatically reboot. A backdated security solution Enterprise-class HP print devices feature FutureSmart firmware. Like a PC’s operating system, firmware coordinates hardware functions, runs the control panel, determines what features are available when printing, scanning, or emailing, and provides network security. Compromised firmware could open your device and network to attack. Whitelisting helps ensure only authentic, known-good HP code that has not been tampered with is loaded into memory. If an anomaly is detected, the device reboots to a secure, offline state. The new security features will be standard on new HP LaserJet Enterprise printers and new OfficeJet Enterprise X printers with PageWide Technology, but HP’s commitment to printer security goes beyond the latest generation of printers. Businesses that can’t afford to replace their entire printer fleet will not be left open to attack. Instead, two of the three security features – Whitelisting and Run-time Intrusion Detection – will be made available to businesses running many of the existing HP Enterprise-class printers launched since 2011 through an HP FutureSmart service pack update. Smarter, safer, more efficient HP’s new 500 series LaserJet Enterprise printers have taken printer security to a new level, but that’s not all they’ve done. The HP 500 series joins the recently announced 400 series and 200 series (introduced in March) and includes the benefits delivered by HP’s new HP Original Toner cartridges with JetIntelligence, allowing SMEs to work smarter for less. The HP LaserJet Enterprise M506 series, for example, boasts a 25pc smaller footprint and dual-sided monochrome print speeds up to 71pc faster than its predecessor. Its MFP counterpart, the HP LaserJet Enterprise MFP M527 series, features single-pass, two-sided scanning and class-leading first-page-out speeds – the time it takes from sleep to a single printed page – up to 33pc faster than its predecessor. The M527’s colour counterpart, the M577, produces a first page from sleep up to 43pc faster than the machines it will replace. On top of it all, HPs new generation of printers are smaller, sleeker, more aesthetically pleasing machines. “These are wonderful designs,” says Michael Smetana, vice president of HP’s LaserJet and Enterprise Solutions (LES) business in Europe. “These are the most beautiful printers on the planet.” • For more advice on preparing your business for the tech challenges of the future, visit HP BusinessNow You may also be interested in: • Should small businesses borrow money to grow? • A first sight of the Small Business Saturday 100 • How to pitch to a Silicon Valley Venture Capitalist • Set your people free with the ultimate in flexible working • Confessions of a crowdfunder • MPs unaware of Government help for small businesses", "external_links": [], "published": "2015-10-24T00:29:00.000+03:00", "crawled": "2015-10-23T19:13:05.549+03:00", "highlightTitle": ""}