{"organizations": [], "uuid": "39091c2d44d7a873c6cdf7ec5807aff2eef82660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/11766d02-745d-11e5-b18f-7ddd8da15963-474x711.jpg", "site_section": "http://seattletimes.com/rss/ricksteveseurope.xml", "section_title": "The Seattle Times » Sections » Travel", "url": "http://www.seattletimes.com/life/outdoors/10-favorite-hikes-for-fall-or-other-seasons/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_travel", "country": "CH", "title": "10 favorite hikes for fall (or other seasons)", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "10 favorite hikes for fall (or other seasons) | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:31:00.000+03:00", "replies_count": 0, "uuid": "7c0acdcb86292877e56070b4a90c77c9fe307095"}, "author": "Seattle Times staff", "url": "http://www.seattletimes.com/life/outdoors/10-favorite-hikes-for-fall-or-other-seasons/", "ord_in_thread": 0, "title": "10 favorite hikes for fall (or other seasons)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fall is a favorite time for many in Washington to go hiking, breathing the crisp, cool air as they explore the landscape painted with reds and purples of the changing season. Karen Daubert, executive director of Washington Trails Association, shares an updated list of favorite hikes, including some well-suited to fall. Descriptions are Daubert’s:\nChelan Lakeshore Trail 17 miles one-way from Prince Creek to Stehekin or 8 miles from Moore Point to Stehekin. 1,600 feet of elevation gain. Best time to go: April-June or September-October. \nThis is a great fall backpack involving a scenic boat ride three-quarters of the way up Lake Chelan and a hike to the town of Stehekin along shimmering waters and snowy peaks.\nEasy Pass Off North Cascades Highway. 7 miles round trip; 2,800 feet gain. Best time to go: Late-July through October. \nMost Read Stories Seahawks’ Derrick Coleman arrested for investigation of hit, run 7 Juanita football players told police of hazing, attacks Boom times in Bothell as McMenamins hotel, entertainment complex opens Zomato shuts Seattle office, lays off employees across U.S. Can’t sleep? Don’t be too quick to blame modern life Unlimited Digital Access. $1 for 4 weeks. It isn’t easy but it’s absolutely beautiful. Forget about your uphill toils with high alpine views punctuated by vivid wildflowers in summer and golden larches in fall.\nSkyscraper Pass Mount Rainier National Park. 8.5 miles round trip; 1,078 feet gain. Best time to go: Late-July through September. \nStarting at Sunrise, this hike follows the Wonderland Trail, which circles the mountain, to Skyscraper Pass. Typically, in late summer Mount Rainier is framed in masses of purple lupine and in the fall red huckleberry bushes color the landscape. It’s an easy scramble up a clear trail to Skyscraper Mountain with even better views.\nSourdough Mountain North Cascades National Park. 11 miles roundtrip; 5,085 feet gain. Best time to go: fall \nGet views like those Jack Kerouac enjoyed at Desolation Peak, without the extra-long trail approach. With more than 5,000 feet of elevation gain, you’ll have to work for the fantastic views, but once you’re at the top, the 360-degree panorama simply can’t be beat!\nHarry’s Ridge Mount St. Helens National Volcanic Monument. 8 miles round trip; 200 feet gain. Best time to go: May through October \nWe have a volcano in our own backyard! The best way to understand what happened at Mount St. Helens in 1980 is to walk in the path of the blast. This trail takes hikers from the Johnston Ridge Observatory to a view of Spirit Lake, the blast zone, and its dramatic regrowth.\nEsmeralda Basin Teanaway/east of Cle Elum. 7 miles round trip; 1,750 feet gain. Best time to go: May through October. \nThis trail heads gradually north, passing the turnoff to Ingalls Lake and little Lake Ann — eventually reaching a ridge looking north into the heart of the Alpine Lakes Wilderness. From the top, views of Mount Stuart are amazing, as a 2015 WTA youth trail maintenance crew discovered when they helped clear this trail for your next adventure.\nCedar Butte North Bend. 3.5 miles round trip; 900 feet gain. Best time to go: anytime \nThis is one of those short, shady hikes ideal for before or after work any time of year. The trail starts near the Rattlesnake Ledge parking lot and the first part includes the Iron Horse Trail. It then heads up to peek-a-boo views of the Snoqualmie Valley.\nHorseshoe Basin North Central Washington. 12 miles round trip; 1,550 feet gain. Best time to go: July through September. \nThis is high, rolling country near the Canadian border with numerous peaks to walk up and lakes to lounge by. Hikers will want to backpack into this spectacular area and stay for a while.\nMount Townsend Olympic Peninsula. 8.2 miles round trip; 3,010 feet gain. Best time to go: July through September. \nThis trail takes hikers from old growth and Pacific rhododendrons to a lofty pass with views of Puget Sound, the Seattle skyline and the Cascade mountains, as well as a front-row seat into the wilderness of the Olympic mountains.\nOzette Triangle Olympic National Park coastline. 9.4 miles round trip; 300 feet gain. Best time to go: Year-round \nI can’t end a list of favorites without talking about our magnificent coast. While it’s extremely popular in the summer, I prefer it in late fall when there are dramatic storms, spectacular surf and no crowds — and it can be done as a loop! Whether you start at Cape Alava or Sand Point, of the loop offers spectacular beach combined with ancient petroglyphs.\nIf you go Get details on these hikes, including driving directions, at the WTA website . Always go prepared for any kind of weather, including rain or snow, and carry the 10 Essentials; see wta.org/hiking-info/basics/ten-essentials Karen Daubert is executive director of Washington Trails Association.", "external_links": [], "published": "2015-10-16T19:31:00.000+03:00", "crawled": "2015-10-17T03:38:22.568+03:00", "highlightTitle": ""}