{"organizations": [], "uuid": "6bdb942efd12c66b6dd63e7382768c86e6a8c5a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buffalonews.com", "main_image": "http://www.buffalonews.com/storyimage/BN/20151011/LIFE02/151019991/AR/0/AR-151019991.jpg&exactW=1000&exactH=1000&AlignV=middle&Q=80", "site_section": "http://www.buffalonews.com/section/rssGen?profileID=1072&profileName=Travel", "section_title": "The Buffalo News - Travel", "url": "http://www.buffalonews.com/life-arts/one-tank-trips/its-all-about-the-glass-on-a-visit-to-corning-20151011", "country": "US", "title": "It’s all about the glass on a visit to Corning", "performance_score": 0, "site": "buffalonews.com", "participants_count": 1, "title_full": "It’s all about the glass on a visit to Corning - Travel - The Buffalo News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T08:01:00.000+03:00", "replies_count": 0, "uuid": "6bdb942efd12c66b6dd63e7382768c86e6a8c5a2"}, "author": "buffalonews", "url": "http://www.buffalonews.com/life-arts/one-tank-trips/its-all-about-the-glass-on-a-visit-to-corning-20151011", "ord_in_thread": 0, "title": "It’s all about the glass on a visit to Corning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I’ve visited the Corning Museum of Glass a number of times over the years and every time I go there I always see something new.\nThe museum, which opened its doors more than 60 years ago, is always changing and adding to its collections. Located about 2½ hours from Buffalo, it is one of the most popular attractions in New York. Plan on spending at least four hours there, although you could easily spend the entire day or more; your admission ticket is good for two consecutive days, so take your time.\nOn our most recent visit a few months ago, my family and I had the opportunity to check out the new 26,000-square-foot Contemporary Art and Design wing at the museum, which opened earlier this year. The white walls, along with the all skylight ceiling, are the perfect backdrop for the more than 70 pieces displayed here, including a number of large-scale works.\nSome of the more intriguing pieces include “Continuous Mile” by Liza Lou, which is made of glass beads, cotton and thread. It took Lou, along with a group of Zulu women in Durban, South Africa, more than a year to create this sculpture, which is a coiled stacked rope, over a mile in length, made up of 4.5 million black beads. The sculpture illustrates that many hands can create a piece that couldn’t be made by one person alone. Another piece, titled “Glass Sticks,” by Jun Kaneko, is made with 102 stacked glass bars, which seem to change color from pink to red depending on how you look at it.\nOne of my favorites is “Forest Glass,” by Katherine Gray. I didn’t figure out what the design was until I viewed it from a distance. Up close the piece looks like a jumble of mismatched clear, brown and green drinking glasses stacked on glass shelves. However, when viewed from across the gallery, you can see three trees.\nA must-see at the museum is the hot glass show, which takes place in its new 500-seat amphitheater. Visitors can watch master glassblowers at work creating vases, bowls and other blown glass objects. In the past, the artists used to make glass objects and then destroy them at the end of the show, which to me always seemed like such a waste of effort. Now they actually give away one of their creations at the end of the show to an audience member who can show the most enthusiasm. My 13-year-old son showed them so much enthusiasm that he won a nice blue vase for us to take home.\nYou’ll also want to explore the museum’s collection of 35 centuries of glass, which tells of the art, history, culture of glassmaking from ancient times until the present day. Included are examples of glassmaking from different parts of the world. I’ve been to the museum several times over the past decade or so and I still discover new items I’ve never noticed before. You could easily spend hours looking at and reading about all the exhibits.\nOne of our favorite parts of the museum is the Studio, where visitors to the museum can try their hand at glassmaking by participating in the Make Your Own Glass Project. Of course you don’t actually make the glass all by yourself, the staff of the museum assists you every step of the way and do all the steps that would be dangerous for someone without specialized training to do, such as putting the glass into the furnace to heat it.\nThe Make Your Own Glass Project is a popular activity, so sign up for it ahead of time, either online before your visit or in person when you first arrive at the museum. The fee ranges from $12 to $29, depending on the project. My daughter chose to make a glass flower, which she also did the last time we visited. This time I decided to make a blown glass grape ornament; the last time I made a pendant using the flame-work technique. My son made a sandblasted glass both times, while my husband was content to observe us and take photos of our efforts. If you’re planning a visit this fall, you can make your own glass pumpkin until Nov. 30. Cost is $29 for a blown glass pumpkin or $20 for a flame-work glass pumpkin pendant.\nThe glass items need to cool overnight, so if you’re not planning an overnight stay in Corning you can make arrangements to have your items shipped home. After making your creation, be sure to check out the Frederick Carder Gallery, located next to the Studio. This gallery features thousands of pieces created by Frederick Carder, who managed the Steuben Glassworks from 1903-1932. There is also a special exhibit about Pyrex, which is celebrating 100 years in 2015, in the museum’s Rakow Research Library, just around the corner from the Studio. The Pyrex exhibit runs through March.\nNo visit to the museum would be complete without browsing through the Glass Market, one of the largest museum gift shops in the country. This huge shop features original works by glass artists, along with everyday items for the home, like glassware and Pyrex items. The shop also has jewelry, ornaments, holiday decorations, toys, games, books and more. The world’s largest glass pumpkin, which was recently made at the museum, is on display in the shop until Nov. 1.", "external_links": [], "published": "2015-10-11T08:01:00.000+03:00", "crawled": "2015-10-11T13:55:14.751+03:00", "highlightTitle": ""}