{"organizations": [], "uuid": "d490a32bbbfb532d84e8d2f0f5a19f4cf0166e35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.byronnews.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/10/01/SHWE_03-10-2015_WE_TRAVEL01_01_enhanced%20Travel%20MAL%20waterfall%202%20peter%20chapman_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/ByronnewscomauTravel", "section_title": "byronnews.com.au: Travel", "url": "http://www.byronnews.com.au/news/Five-parts-of-Malaysia-travellers-cant-ignore/2793376/", "country": "AU", "title": "Five parts of Malaysia travellers can't ignore", "performance_score": 0, "site": "byronnews.com.au", "participants_count": 0, "title_full": "Five parts of Malaysia travellers can't ignore", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T17:00:00.000+03:00", "replies_count": 0, "uuid": "d490a32bbbfb532d84e8d2f0f5a19f4cf0166e35"}, "author": "", "url": "http://www.byronnews.com.au/news/Five-parts-of-Malaysia-travellers-cant-ignore/2793376/", "ord_in_thread": 0, "title": "Five parts of Malaysia travellers can't ignore", "locations": ["Malaysia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Peter Chapman"], "text": "Five parts of Malaysia travellers can't ignore Peter Chapman | 4th Oct 2015 3:00 PM Peter Chapman Editor   \nO NE of South-East Asia's favourite holiday destinations, Malaysia is a country where \"something for everyone'' is more of a daily itinerary than a promise. \nPacked with attractions, experiences and activities to meet every traveller's needs, it is truly the ideal holiday destination. From its postcard white sandy beaches, UNESCO World Heritage sites, national parks, eclectic cities, adventure activities and rainforests abundant with nature, it is a bubbling melting pot of cultures, ethnicities and religions. \nThrow friendly and welcoming people into the mix, along with some of the best cuisine on the planet, and the Malaysian experience is hard to beat. \nBut where to start? \nHere is a shortlist of the top things to see and do in Malaysia. \nPenang a foodie paradise \nPenang has long been regarded as one of Malaysia's favourite tourism spots. The island boasts an enviable range of historical and cultural attractions, not to mention an abundance of beautiful beaches and some excellent shopping for those after a little retail therapy. \nAnd, of course, there is the cuisine. Penang's multicultural heritage, with its strong Chinese, Indian and Portuguese influences, has produced a thriving local foodie scene characterised by myriad tantalising flavours - with the result that the city is now regarded as one of the world's top food destinations. Lankayan Island Resort is just one of many places you should explore when visiting Malaysia. Photos CONTRIBUTED \nNature in Taman Negara \nTaman Negara, which means national park in Malay, is one of the oldest tropical rainforests in the world. It features massive trees, waterfalls, jungle treks of various duration and the world's longest canopy walkways. Taman Negara is also a haven for endangered species such as the Asian elephant, tigers, leopards and rhinos, along with some spectacular birdlife, small deer, lizards, snakes and perhaps even a tapir. \nCast away on Pilau Tioman \nThis tiny island located off the east coast of peninsular Malaysia is a frequent inclusion on travellers' lists of the world's most beautiful places. \nCuddle up to an orangutan \nNo visit to Malaysia is complete without a visit to Sabah's Sepilok Orang Utan Rehabilitation Centre. \nOpened in 1964 for rescued orphaned baby orangutans from logging sites, plantations and illegal hunters, for over half a century the centre has successfully trained its charges to survive in the wild and releases them as soon as they are ready to do so. \nGet batty in the Mulu Caves \nTo some people the simultaneous exodus of millions of bats from a cave might send chills down the spine - especially one big enough to accommodate 40 Boeing 747 airplanes. The evening exit of the enormous colony of Wrinkle-lipped bats in the nearby Deer Cave exit almost every evening in search of food is a spectacular exodus. \nLaze away the days in Langkawi \nMalaysia's best-known holiday destination, Langkawi is an archipelago of 99 islands in the Andaman Sea. Fringed with long, white beaches and with an interior of jungle-covered hills and craggy mountain peaks, it's easy to see why this is a honeymooners' delight. \nMalaysia \nMalaysia Airlines has two flights a day to Kuala Lumpur out of Sydney. \nThe flight takes around eight hours.", "external_links": [], "published": "2015-10-03T17:00:00.000+03:00", "crawled": "2015-10-05T01:37:41.151+03:00", "highlightTitle": ""}