{"organizations": [], "uuid": "cb9ac0ac40885d4915573f29d0f66720dfc99624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/09/Alaska-Airlines-300x133.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/alaska-airlines-partners-with-honor-flight-to-take-veterans-to-memorials-in-wash-d-c/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Alaska Airlines Partners with Honor Flight to take Veterans to Memorials in Wash. D.C.Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Alaska Airlines Partners with Honor Flight to take Veterans to Memorials in Wash. D.C.Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "4b2947dcb07d2ff6e5a629e22e442be77610dc2f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/alaska-airlines-partners-with-honor-flight-to-take-veterans-to-memorials-in-wash-d-c/", "ord_in_thread": 0, "title": "Alaska Airlines Partners with Honor Flight to take Veterans to Memorials in Wash. D.C.Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alaska Airlines Partners with Honor Flight to take Veterans to Memorials in Wash. D.C.  \nTwenty-three veterans from the state of Alaska are traveling to Washington, D.C., today to view their memorials for the first time, thanks to a partnership between Alaska Airlines and Last Frontier Honor Flight program.\n \n \nThe veterans who served their country during World War II, the Korean War and through the Alaska Territorial Guard will enjoy a four-night, five-day tour to visit many of the national monuments, compliments of Alaska Airlines and Honor Flight. This is the second Honor Flight departing from the state of Alaska this year. From Anchorage, the group connects in Portland, Ore. to join fellow veterans from Oregon for the flight to Washington Reagan National Airport.\n \n \nThey are scheduled to return to a hero’s welcome at the Ted Stevens Anchorage International Airport on Saturday, Oct. 17. A reception for the veterans, their family members, the public and members of the media is scheduled for 12:30 p.m. Alaska time, at Ted Stevens Anchorage International Airport, near TSA before security.\n \n \n“Alaska Airlines is a proud supporter of all past and present members of our military,” said Marilyn Romano, Alaska Airlines’ regional vice president – Alaska. “Through our continued partnership with the Last Frontier Honor Flight, we have had the privilege of flying nearly 160 brave men and women to Washington over the past four years, honoring the sacrifices they have made for our country.”\n \n \nSince 2012, Alaska Airlines has donated nearly $200,000 in free air travel and discounted companion travel to the Last Frontier Honor Flight program, annually providing the opportunity for 50 Alaska veterans and their guardians to view the nation’s memorials that are dedicated in their honor. Alaska is the only airline to operate Honor Flights for veterans in the state of Alaska.\n \n“We work continually throughout the year to make these flights happen and we deeply appreciate our partners at Alaska Airlines,” said Ron Travis, president of Last Frontier Honor Flight. “When a veteran who is in their 90s looks at us with tears in their eyes to say thank you, we are honored to do it.”\n \nVeterans in the state of Alaska are selected for Honor Flights by age and can apply for the program by visiting the Last Frontier Honor Flight’s. The program is offered to veterans free of charge, and the Last Frontier Honor Flight is funded completely by contributions from the community.\n \nThe Last Frontier Honor Flight program is an Honor Flight Network regional hub in the state of Alaska. Honor Flight Network is a national organization working to transport America’s veterans to visit memorials in Washington, D.C., dedicated to honor their service and sacrifices.\n \nAlaska Airlines, a subsidiary of Alaska Air Group (NYSE: ALK), together with its partner regional airlines, serves more than 100 cities through an expansive network in the United States, Canada and Mexico. Alaska Airlines ranked “Highest in Customer Satisfaction Among Traditional Carriers in North America” in the J.D. Power North America Airline Satisfaction Study for eight consecutive years from 2008 to 2015. Alaska Airlines’ Mileage Plan also ranked “Highest in Customer Satisfaction with Airline Loyalty Rewards Programs” in the J.D. Power 2014 and 2015 Airline Loyalty/Rewards Program Satisfaction Report.\n \nSource:- Alaska Airlines", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T19:26:50.404+03:00", "highlightTitle": ""}