{"organizations": [], "uuid": "03b44af7f4ee01eb8e32963e1105b54799915585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/05/Tourism-northern-ireland-300x164.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/northern-ireland-positive-indicators-for-tourism-in-year-to-date/", "country": "US", "title": "Northern Ireland: Positive indicators for tourism in year to dateTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Northern Ireland: Positive indicators for tourism in year to dateTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "03b44af7f4ee01eb8e32963e1105b54799915585"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/northern-ireland-positive-indicators-for-tourism-in-year-to-date/", "ord_in_thread": 0, "title": "Northern Ireland: Positive indicators for tourism in year to dateTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Northern Ireland: Positive indicators for tourism in year to date Published on : Friday, October 9, 2015\nNewly released accommodation statistics indicate that Northern Ireland’s tourism performance has been strong in the first eight months of the year.\nNorthern Ireland Statistics and Research Agency (NISRA) figures for serviced accommodation show the number of hotel rooms sold during January to August 2015 increased by 5% to 1,314,794, the highest figure for the period since records began.\nHotel bed-spaces sold were up by 14% to 2,251,867, also the highest recorded, with an additional 272,200 bed-spaces sold in Northern Ireland compared to January to August 2014.\nAverage hotel room occupancy also increased by four percentage points to 70%, while bed-space occupancy increased by seven percentage points to 53%.\nThe guesthouse, guest accommodation and B&B sector recorded a marginal decrease, down 1% in both room and bed-space occupancy in the first eight months of the year.\nElsewhere, figures from a three-year review of Titanic Belfast show that approximately one in 30 people visiting the island of Ireland visit Northern Ireland’s leading attraction.\nThe Deloitte review for the Titanic Foundation also indicated that in its first three years Titanic Belfast generated £103 million in additional tourism spend for the Northern Ireland economy and sustained around 876 jobs each year in the wider economy.\nCommenting on these results, John McGrillen, Tourism NI Chief Executive, said: “The accommodation figures are certainly very positive, and indicate that January to August 2015 was the best ever for our hotels, so this is very good news despite a slight dip in the guesthouse sector. It highlights the need for Tourism NI to continually work with guesthouse and B&B providers to assist them to understand and respond to the needs of an increasingly discerning and digitally engaged customer base.”\n“Sentiment is also generally optimistic among our tourism industry partners, and as the period from October to December normally yields a good percentage of the annual tourism business there is every reason to anticipate further positive results for the whole year.\n“As a five-star visitor attraction winning national and international awards, the success and quality of Titanic Belfast and its contribution to Northern Ireland as a tourism destination is undisputed. Its future priority, and Northern Ireland’s, will be to increase out of state visitors from mainland Europe, GB, North America, Asia, Australia and provide reasons for repeat visits for domestic and Republic of Ireland visitors, boosting our accommodation sector and the tourism economy still further.”", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T06:03:15.833+03:00", "highlightTitle": ""}