{"organizations": [], "uuid": "85a4b1121fcb62b43972dec25362c3ad210d0356", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03473/Northern-Lights-Re_3473779k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-26.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11934121/The-cost-of-your-bucket-list-revealed.html", "country": "US", "title": "The cost of your bucket list revealed", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The cost of your bucket list revealed - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T14:00:00.000+02:00", "replies_count": 0, "uuid": "85a4b1121fcb62b43972dec25362c3ad210d0356"}, "author": "Eleanor Doughty", "url": "http://www.telegraph.co.uk/goodlife/11934121/The-cost-of-your-bucket-list-revealed.html", "ord_in_thread": 0, "title": "The cost of your bucket list revealed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Many of us have a bucket list , a list of the ultimate activities that we want to achieve in our lifetimes. These lists can range from the completely bonkers to the eminently manageable, a veritable feast of fun stuff to do, a list as long as your arm of exciting things to get yourself stuck into. While naturally everyone’s dream has a price tag attached, would you know the cost price of your ultimate bucket list? Photo: Alamy Research conducted by over 50s insurance and travel specialist Staysure has revealed the top 50 things that the over 50s want to experience in their lifetime, and has offered up a price tag. Topping the list is the typical travel ambitions: over half of those surveyed placed seeing more of the world as number one on their to-do list. The Northern Lights are a popular specific travel destination, and further down the list include the most modern of all ambitions, taking a selfie with a celebrity . Getting a tattoo, reading 50 Shades of Grey , and quitting Facebook also feature. Photo: AP Staysure’s research found that almost 80 per cent of those surveyed are confident that they will fulfil their bucket list ambitions, whatever they be may. All of this dreaming comes at a price, and Staysure have calculated what this is likely to be. Working with an average top 10, an estimated cost comes in at £16,285. Survey respondents had another view, and believed that for the average person to achieve their bucket list dreams it would cost just £8,191. This updated bucket list reflects our modern times. At 22 on the list is going on holiday alone , a pursuit that once held a potentially embarrassing stereotype. Experiences including ‘glamping’ and going to music festivals also reflect how the over 50s refuse to stay true to stereotype – and how these activites are not limited to the younger generation. Photo: Somerset Yurts You might well ask why anyone would put a bucket list together. The answer is simple, according to the survey’s respondents: 40 per cent say that they are driven by not wanting to be left with regrets. Others believes that it’s their time now, having spent time caring for others, while a further 30 per cent are keen to experience more than their parents’ generation. Chris Rolland from Staysure said: “Whether it’s travelling solo in your 60s, living abroad in your 70s, falling in love or getting a tattoo in your 80s – we live in a time where people should live their lives to the full and experience things that maybe previous generations did not. There’s no better time to book that solo holiday, make new friends, reconnect with old friends or simply invest in quality life experiences – whatever your age.” 50 over 50: your bucket lists revealed Travel to an exotic destination Fly first class See the Northern Lights Visit 5 continents Dine in a world class restaurant Go on a cruise Spend time living abroad Learn about your family tree Fall in love Learn a new language Buy a house Tell someone you love them Go on a hot air balloon Get married Go to a casino in Las Vegas Reconnect with a childhood friend Go to a music festival Learn how to play a musical instrument Write a novel Drive a racing car Raise money for charity Go on holiday by yourself Climb a mountain Change career Sleep on the beach Stay out all night Go scuba diving Go skinny dipping Have sex in a public place Go on a roller coaster Have a one night stand Forgive someone you’ve held a grudge against Go skydiving Bear all on a nudist beach Go glamping Eat sushi Take a selfie with a celebrity Have a ménage à trois Get a tattoo Watch the original ‘Star Wars’ trilogy Do karaoke Watch ‘The Godfather’ trilogy Run in a big race Quit Facebook Read ’50 Shades of Grey’ Go to the Tomatina festival Experiment with illegal drugs Do stand-up comedy Run with the bulls in Pamplona Take part in a triathlon telegraph.co.uk", "external_links": [], "published": "2015-10-26T14:00:00.000+02:00", "crawled": "2015-10-26T10:37:19.071+02:00", "highlightTitle": ""}