{"organizations": [], "uuid": "74d09fec137952a441b5f56b0a5104567355e6b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.byronnews.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/10/08/SHWE_10-10-2015_WE_TRAVEL02_01_enhanced%20SHWE101015lead_1__fct766x575x88.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/ByronnewscomauTravel", "section_title": "byronnews.com.au: Travel", "url": "http://www.byronnews.com.au/news/cruise-the-day-away/2801202/", "country": "AU", "title": "Holland America cruise dilemma: fitting it all in", "performance_score": 0, "site": "byronnews.com.au", "participants_count": 0, "title_full": "Holland America cruise dilemma: fitting it all in", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:00:00.000+03:00", "replies_count": 0, "uuid": "74d09fec137952a441b5f56b0a5104567355e6b5"}, "author": "", "url": "http://www.byronnews.com.au/news/cruise-the-day-away/2801202/", "ord_in_thread": 0, "title": "Holland America cruise dilemma: fitting it all in", "locations": ["Holland America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cars For Sale \nIT'S all about the choices. And there are many. \nShould I eat Italian in Canaletto restaurant? Or go for Asian at the Tamarind? A steak would work, and they don't come any better than the big beauties in the Pinnacle Grill. \nThen there is the tempting a la carte menu in the Manhattan dining room, and a wood-fired pizza on the aft deck with my name on it. \nThis is the way it is on a Holland America cruise. \nThere is much to do, a lot to eat, even more to drink. But there is also the option of doing nothing, and eating light (if you must). \nOn board the graceful Nieuw Amsterdam on a Mediterranean cruise recently, mixing it up was the way to go. \nAn early morning stretch class in the Fitness Centre, a cooking demonstration in the Culinary Arts Centre, a photography lesson in the Digital Workshop, an outdoor movie on deck...a lot to fit in in a morning...but it had to be because there was free champagne in the Ocean Bar at 1pm during an art auction and no dedicated cruiser was going to miss that. \nHow to squeeze everything into your day could be your dilemma on board, especially with the duty-free shops having a jewellery sale on the already ridiculously cheap prices. Still, a quick jewellery browse would leave time for the signature cocktail sampling in the Crow's Nest Bar before an early dinner and a show in the two-tiered theatre and later a flutter in the casino, followed by a late-night song in the Piano Bar with resident pianist Jeremy. \nYou see, much to do. \nFortunately, it is a simple matter to get around Nieuw Amsterdam. Elevators whiz you up and down decks so you can plan your day at sea with military precision. \nEverything is micro-managed on Nieuw Amsterdam so despite the other 2000 guests on board there is no waiting to disembark in ports, no lining up at the front desk to book shore excursions (all done online before you sail, ditto for a super speedy embarkation), no queues at the food stations, no waiting at bars, no long lines to get into the theatre. \nIt is a seamless operation run by a surfeit of crew who all know your name within minutes of you embarking - and all who seem extraordinarily pleased to see you. \nCabin stewards smile broadly when they fill your state room ice-bucket and place little chocolates on your pillow. \nBar stewards remember your favourite tipple, dining crew herald your arrival as though you were Kate and William coming in on the red carpet. \nIt all makes you feel pampered more than you deserve (even though you do). \nAll this and the pleasure of unpacking just the once in your spacious state room with its airy sitting area and private veranda and wide screen user-friendly television and its spacious bathroom stocked with Elemis products. \n\"I really do love this cruising lark,'' will be your last thought each evening as your head hits the soft pillow and you snuggle under crisp white linen. \nThen there is the thrill of a new port each day, guaranteed to be a place of allure and interest. \nOn our trip, we sailed from Venice to Dubrovnik, Corfu, Naples, Rome, Florence, St Tropez, Monaco and Barcelona. \nCould there be any more romantic ports? \nEach shore excursion was managed with the same friendly efficiency we had become used to on board. \nAfter each exciting day out in some of the world's most desirable locations (more about them another time), the smiling crew were always there, waiting at the gangway with cold towels and bottled water, more smiles and more love. \nThe writer was a guest on board Nieuw Amsterdam. \nCruise itineraries, prices and information at hollandamerica. com. \nFOODIES' DELIGHT \nEating is arguably the number one priority on a cruise and Nieuw Amsterdam offers so many options you will never be bored. \nThe Manhattan dining room is an elegant two-level space where an a la carte menu presents regional specialities and classic favourites. \nDive In Grill on the Lido Deck (beware it's addictive) offers giant hamburgers and hot dogs with a variety of piquant sauces and the best fries we've had anywhere. \nThe pizza - the prosciutto and gorgonzola pizza, thin crusted, authentic, late night...heaven on a pizza. \nSpeciality restaurants where a small fee is applicable are: \nPinnacle Grill with a steak and seafood menu in an intimate setting. \nCanaletto where the Italian word spartien (sharing) means small plates of exquisite Italian food to share with others. \nTamarind, sublime Asian cuisine presented with impeccable service. \nSignature Beverage Packages give you a bargain with a variety of wine, beer, spirits, soft drinks, coffee and cocktails available. ann rickard", "external_links": [], "published": "2015-10-10T16:00:00.000+03:00", "crawled": "2015-10-11T01:46:34.004+03:00", "highlightTitle": ""}