{"organizations": [], "uuid": "1d63aed6ed1246bc6c81079b49100cc1c53fc6c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mirror.co.uk", "main_image": "http://i4.mirror.co.uk/incoming/article6619417.ece/ALTERNATES/s1200/sat-travel.jpg", "site_section": "http://www.mirror.co.uk/lifestyle/travel/", "section_title": "Travel: late deals &amp; bargains, holiday news and advice - Mirror Online", "url": "http://www.mirror.co.uk/lifestyle/travel/british-breaks/llangollen-canal-narrowboat-trip-cheshire-6641080", "country": "US", "title": "Llangollen Canal narrowboat trip from Cheshire to North Wales is plain sailing - eventually", "performance_score": 0, "site": "mirror.co.uk", "participants_count": 1, "title_full": "Llangollen Canal narrowboat trip from Cheshire to North Wales is plain sailing - eventually - Mirror Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T14:00:00.000+03:00", "replies_count": 0, "uuid": "1d63aed6ed1246bc6c81079b49100cc1c53fc6c4"}, "author": "Amber Graafland", "url": "http://www.mirror.co.uk/lifestyle/travel/british-breaks/llangollen-canal-narrowboat-trip-cheshire-6641080", "ord_in_thread": 0, "title": "Llangollen Canal narrowboat trip from Cheshire to North Wales is plain sailing - eventually", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After an Acme course in canal cruising and narrowboat ­maintenance Mark, the man from Drifters boat hire base, asked: “Any questions?”\nTrying to sound nonchalant, I replied: “Er, how do we know if we’re going too fast?” With a furrowed brow, he replied: “You’ll see waves. You don’t want waves.”\nWell that told me then. Setting off along the Llangollen Canal from Cheshire towards North Wales, all I could think about was how I hadn’t really taken in much of what I had just been told. And I couldn’t shake off the uncomfortable feeling that I probably should have taken a lot more information on board (see what I did there?).\nHow hard can it be, I naively wondered. Anyway, with a month’s supply of food and enough tea to sink a ship (you drink a LOT of tea on a canal trip), we were off.\nWe were late so the sun was setting and the light really was beautiful. We had a blissful one-and-a-half hours of no locks, and as we headed towards the Wrexham border with the Pontcysyllte Aqueduct ahead of us, the world was our oyster.\nThe crew of the 66ft six-berth Yellow Legged Gull barge, me and Justin and the kids Rudy and Georgia, were happy and everything was tranquil. What we had forgotten, of course, was the million or so locks and lifting bridges ahead of us.\nThings got more interesting when we checked the map and realised it was going to be pretty impossible to reach our target of the three-chamber staircase lock at Grindley Brook by nightfall.\nUp top: Georgia and Rudy survey the canal\nThanks to tonsillitis and a Holy Communion party we were a day late. Mark, if you’re reading this, we only made waves for this first stretch and it was kind of an emergency.\nI had been told by friends who had barge form that the holiday would be very relaxing. They explained the slowness of the journey (speed limit 4mph) would impart a sense of calm. ‘’Who’s heard of canal rage?” they joked. Well, all I can say is that there was mutiny on our boat from day one.\nAfter that peaceful initial period we began to ‘lock back in anger’. To start, we passed the first boat we met on the wrong side (I am ­positive we were told to stay left). Then we crashed, then nearly hit another boat.\nAt Grindley Brook I was relieved to learn the slightly daunting three-chamber staircase has a lock keeper. This lock can get busy – expect traffic jams – and is tricky to navigate.\nThanks to the Great Canal Journeys TV series we were pretty clued up on all things canal-related. But sadly, Timothy West and Prunella Scales we weren’t. These two acting legends made it look so easy. I’d like to know their secret – I suspect it was wine.\nThanks to eight-year-old Rudy, who had just completed canals as part of his school project, we were regaled with canal facts.\nDid you know the canals were brought back from the brink, and the rebirth of the canals as highways for leisure is one of the quiet success stories of modern Britain?\nAnd did you know that this was done by volunteers who, over half a century, surrendered evenings and weekends to rebuild collapsed banks and clear junk from choked locks?\nThe result is a network of waterways more than 2,000 miles long and home to 35,000 licensed craft and visited by 200,000 people a year.\nPassing through the Chirk Tunnel was a highlight for the kids. It’s 1,380ft long so pretty spooky, damp and smelly. It’s only designed for a single narrow boat so it takes a bit of planning. Not our strong suit.\nObviously the most important thing is to moor up and check no one is coming from the other side. When the coast’s clear it’s a scramble for the entrance, with your light on (very exciting) so your boat can be seen by another at the other end.\nIt all sounds simple enough but this, not surprisingly, is the point where things are most likely to go wrong. Thankfully, and even more surprisingly, it was a doddle for us.\nOur main aim was to reach the spectacular Pontcysyllte Aqueduct on day three and we made up for lost time and did it.\nSheer drop: Pontcysyllte Aqueduct\nAt 1,008ft long and with 18 pillars it carries the canal 126ft above the River Dee near Chirk. If you’re scared of heights it’s not ideal as one side has no barriers and there’s a sheer drop. The view is spectacular but you feel very exposed, as if you could quite simply fall off the side. Breathtaking views but a very strange experience.\nThis is a very pretty part of the canal and we moored at Froncysyllte for lunch. If you have time, visit Chirk Castle.\nAt this point we turned around. I’d like to apologise now to the couple who were having a quiet lunch and witnessed this.\nThe trouble started when we got the barge stuck trying to turn. MY FAULT apparently, although I’m sure I was making lunch when it happened (the galley is excellent, as are the bathrooms and bedrooms).\nTurning is not to be taken lightly and you’d be well advised to only attempt this at an official turning point: 66ft boat + canal less than 66ft wide = domestic discord.\nHowever, the silver lining in the canal cloud is that by the time you DO turn round and head for home, you’ll have got the hang of it.\nIt was pretty much plain sailing all the way back to the Cheshire boatyard and, thanks to Georgia, 12, we made light work of the locks and lifting bridges. The way back was relaxing and the kids said (thanks to less shouting) they loved it.\nMy advice to Drifters: it wouldn’t be a bad idea to put the number of a good relationship counsellor in the manual... more useful than the number for a pump-out station.\nAnd my advice to anyone thinking of booking: pack a very warm coat and lots of tea.\nGet there Drifters Waterway Holidays has more than 500 canal boats for hire from 38 bases across England, Scotland and Wales. Prices for 2016 short breaks (3 or 4nts) on a boat for 4 start at £505; 7nt hires start from £720.\nThe Drifters Llangollen Canal base at Wrenbury, Cheshire, is around 30 miles from the M6 J15/16. Wrenbury station is on the Crewe-Shrewsbury line. drifters.co.uk 0844 984 0322\nTourist info: visitcheshire.com - wrexham.gov.uk - canalrivertrust.org.uk\nBest time to go: Try a narrow escape on the Llangollen Canal next spring\nDailyMirror\n<div", "external_links": ["http://wrexham.gov.uk/", "http://drifters.co.uk/", "https://www.facebook.com/DailyMirror", "https://twitter.com/AmberMirrorFash", "https://canalrivertrust.org.uk/", "https://twitter.com/DailyMirror", "https://plus.google.com/u/0/+Mirror/posts", "http://www.visitcheshire.com/"], "published": "2015-10-17T14:00:00.000+03:00", "crawled": "2015-10-17T18:56:06.448+03:00", "highlightTitle": ""}