{"organizations": [], "uuid": "2f1d8ff9e522c92dd6ba545e5b5faaee5487e1cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gocaribbean.about.com", "main_image": "http://f.tqn.com/y/gocaribbean/1/S/t/5/-/-/KeyLargoBird_555_3662.jpg", "site_section": "http://z.about.com/6/o/m/gocaribbean_t2.xml", "section_title": "About.com Caribbean Travel: What's Hot Now", "url": "http://gocaribbean.about.com/od/thefloridakeys/tp/Floridakeysattractions.htm", "country": "US", "title": "12 Places to Stop On Your Drive Through the...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "12 Places to Stop On Your Drive Through the...", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T14:07:00.000+03:00", "replies_count": 0, "uuid": "2f1d8ff9e522c92dd6ba545e5b5faaee5487e1cd"}, "author": "", "url": "http://gocaribbean.about.com/od/thefloridakeys/tp/Floridakeysattractions.htm", "ord_in_thread": 0, "title": "12 Places to Stop On Your Drive Through the...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Articles and Resources \nThe 150-mile, 3.5-hour drive from Miami to Key West is something that every traveler should experience at least once, but there's no need to jet straight through to Mallory Square and mile marker zero when there's so much to see along the way. Here are some of the best stops to make as you follow the Overseas Highway through the Keys , listed in the order that you will encounter them on your drive south. A Great White Heron perches on a mangrove tree at the Florida Keys Wild Bird Center in Tavernier, Fla. Open to the public, the center specializes in treating sick and injured indigenous birds in the Florida Keys. © Bob Krist/Florida Keys News Bureau • Florida Keys Wild Bird Center, Tavernier \nLocated at Overseas Highway mile marker 93.6 (bayside) in Tavernier, the Florida Keys Wild Bird Center is dedicated to rehabilitating injured birds and returning them to the wild. Visitors can visit the 'patients' along the center's boardwalk and in the nearby waterways. More » Sea lion show at Theater of the Sea in the Florida Keys. © stevendepolo via Flickr • Theater of the Sea, Islamorada \nSort of a down-home Sea World , this marine animal park offers daily performances (such as dolphin, sea lion, and parrot shows) as well as an opportunity to swim with dolphins, sea lions and stingrays. General admission covers the shows and a bottomless boat ride; \"swim-with\" activities are extra, as is the four-hour snorkel adventure tour. \nLocated at mile marker 84.5 (oceanside) in Islamorada . More » © History of Diving Museum via Facebook • History of Diving Museum, Islamorada \nIf you like diving -- and for many people, snorkeling and scuba are the main attractions on a Florida Keys visit -- then you'll love the History of Diving Museum. Exhibits include antiques and artifacts relating the story of undersea exploration -- including vintage diving helmets -- a display on the 200-year history of SCUBA, and a special focus on South Florida underwater treasure hunting. \nLocated at mile marker 83 (bayside) in Islamorada . More » Visitors to Robbie's Marina in Islamorada can hand feed tarpon right off the dock. A highly prized Florida Keys gamefish, the origin of tarpon date back to prehistoric times. © Bob Krist/Florida Keys News Bureau • Robbie's Marina, Islamorada \nFunky, 'Old Keys' style roadside stop features the Hungry Tarpon Restaurant , a flea-market, occasional art shows and other events, dive and fishing charters, tours and boat rentals, and the opportunity (for a small fee) to feed some wild tarpon off the marina dock. \nLocated at mile marker 77.5, bayside in Islamorada . More » A little girl shakes the flippers of a dolphin at the Dolphin Research Center on Grassy Key near Marathon, Fla. © Bob Krist/Florida Keys News Bureau \nNonprofit center offers dolphin encounters as well as classes on becoming a dolphin trainer or researcher. Interact with a resident population of bottlenose dolphins and California sea lions . \nLocated at mile marker 59 (bayside) in Marathon . More » Ospreys are among the birds commonly seen in the Florida Keys. © AcrylicArtist via Flickr • Crane Point Hammock, Marathon \nVisitors to this nonprofit museum and nature center can learn about Keys history, explore nature paths, and tour the Marathon Wild Bird Center . The historic Adderley House was built by Bahamian immigrants in 1903 and is the oldest surviving house in the Keys outside Key West. The museum includes a children's activity center. \nLocated at mile marker 50 (bayside) in Marathon . More » A Turtle Hospital staffer, right, shows visitors to the center a female green sea turtle that underwent treatment for intestinal ailments. © Andy Newman/Florida Keys News Bureau • Turtle Hospital, Marathon \nGuided tours introduce visitors to this working animal hospital and rehabilitation dedicated to saving sick and injured sea turtles , including loggerheads, hawksbills, green, leatherhead, and Kemp's Ridley turtles. A highlight is the 100,000-gallon turtle tank, formerly a hotel swimming pool, where you can see turtles large and small being cared for. \nLocated at mile marker 48.5 (bayside) in Marathon . More » Pigeon Key in its heyday. © Florida Keys Public Libraries via Flickr • Pigeon Key, Marathon \nOnce a work camp for Flagler Railroad workers, Pigeon Key is located under a segment of the Old Seven Mile Bridge and can be reached by walking, biking, or taking a tram from the Marathon end of the former railroad bridge. Pay-one-price admission to the small island includes museum admission, ferry rides, and tours of the railway workers' barracks. Visitors can snorkel off the island's beaches. \nLocated at mile marker 47 (bayside) beneath the Old Seven Mile Bridge near Marathon . More » Bahia Honda State Park offers outstanding amenities for vacationers as well as an excellent view of a historic railroad bridge. Bahia Honda has been voted the top U.S. beach by \"Dr. Beach.\". © Bob Krist/Florida Keys News Bureau • Bahia Honda State Park, Bahia Honda Key Key West is known for many things, but great beaches isn't one of them. Fortunately, some of the best beaches in the country is located relatively close by, at Bahia Honda State Park . In addition to sunbathing on sandy shores, the park is popular with snorkelers and campers -- it even has vacation cabins for rent. Birding, biking and boating are other options for visitors.\nLocated at mile marker 37, on Bahia Honda Key. Fee for entry based on number of people in party and vehicle type. More » Key Deer fawn. © U.S. Fish and Wildlife Service • National Key Deer Refuge, Big Pine Key \nAbout 800 diminutive Key Deer -- a stunted subspecies of white-tailed deer -- inhabit the National Key Deer Refuge on Big Pine Key, an 84,000-acre wildlife refuge that includes forest, wetlands, and other wilderness areas. Visitors can hike nature trails and observe the deer and other wildlife, including those inhabiting the Blue Hole -- a flooded former quarry -- near the park's visitor's center. \nLocated at mile marker 30 (oceanside) in Big Pine Key . More » Hovercraft tours in Key Largo, Fla. © Hover Tour • Hovercraft Tours, Key Largo Key Largo based Hover Tour offers a unique way to explore Blackwater Sound and Lake Surprise -- riding on a cushion of air. If you’re not in the Marines (who use hovercraft to land troops on beaches), this is a rare chance to ride one of these unique land/sea vehicles while enjoying the natural beauty of the Upper Keys. Cruising at up to 32 knots, the 20-passenger Lady Hawke hovercraft can also get into shallow area where boats dare not venture, getting you up close with the reeds and residents of the island shoreline. Tours run anywhere from 15 minutes to two hours.\nTours leave from near the Caribbean Club at Mile Marker 104. Visit http://www.hover-tour.com/ or call 305-904-3833 for reservations and information. More » Bogart and Hepburn in The Africa Queen. © Wikipedia • The African Queen, Key Largo \nAfter a $60,000 renovation, the famous African Queen riverboat from the 1951 Bogart/Hepburn movie of the same name is steaming again, this time not as a movie prop but as a tour boat operating out of Key Largo . A national historic site, the 1912 river steamer has been docked in Key Largo since 1983 but only recently has started taking passengers again. \nThe African Queen runs daily, two-hour canal cruises of Key Largo as well as dinner cruises and charters for private events. For reservations, call 305-451-8080 or visit http://www.calypsosailing.com More » Related Articles", "external_links": [], "published": "2015-10-21T14:07:00.000+03:00", "crawled": "2015-10-22T03:01:37.794+03:00", "highlightTitle": ""}