{"organizations": [], "uuid": "6ea1d28036e4d133e4f949b0789b18960766c66a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30261635/the-cordish-companies-xfinity-live-philadelphia-unveils-new-concepts-and-renovated-spaces-during-grand-reopening", "country": "US", "title": "The Cordish Companies' XFINITY Live! Philadelphia Unveils New Concepts And Renovated Spaces During Grand Reopening", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Cordish Companies' XFINITY Live! Philadelphia Unveils New Concepts And Renovated Spaces During Grand Reopening - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "6ea1d28036e4d133e4f949b0789b18960766c66a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30261635/the-cordish-companies-xfinity-live-philadelphia-unveils-new-concepts-and-renovated-spaces-during-grand-reopening", "ord_in_thread": 0, "title": "The Cordish Companies' XFINITY Live! Philadelphia Unveils New Concepts And Renovated Spaces During Grand Reopening", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Cordish Companies\nPhiladelphia Chef Jason Cichonski of Ela, The Gaslight, and Bravo TV's \"Top Chef\" Creates New Dining Experience with Brand New 1100 Social; Expansion has added 75 new permanent jobs\nPHILADELPHIA , Oct. 14, Capitalizing on a highly successful first three years of operation, The Cordish Companies' XFINITY Live! Philadelphia recently completed an expansion and renovation to the dining and entertainment district. The new improvements at XFINITY Live! include:\n1100 Social\nTransformation of the existing Spectrum Grill into an all-new dining experience, 1100 Social is an eatery by Philadelphia Chef Jason Cichonski , owner and head chef of Ela and The Gaslight. 1100 Social is a new eatery offering shareable plates influenced by Mexican and Asian flavors. 1100 Social features new finishes, furniture and décor and includes an interior bar facing the NBC Sports Arena as well as a new outdoor patio with multiple fire pits, covered and heated intimate dining areas and lush landscaping.\n\"Spectrum Grill has been a very successful restaurant for the district, but the ability to add Chef Cichonski with a dynamic new concept to the XFINITY Live! line-up was too good of an opportunity to pass up,\" said Tony Monaco , Chief Operating Officer of XFINITY Live!\n\"I am incredibly excited to bring my commitment to high-quality and innovative cuisine to XFINITY Live!,\" said Cichonski. \"American cuisine is a melding of many cultures and influences, and with 1100 Social, I intend to celebrate the flavors and influences that have long inspired me. I can't wait to share this exciting new concept with Philadelphia .\"\nVictory Beer Hall\nExpansion of Victory Beer Hall, with the addition of an architecturally stunning glass and steel building that opens to an exterior beer garden, outdoor seating, and fire-pit area.\n\"Our beer hall at XFINITY Live! is a very important part of the growth of our brand, and this expansion clearly demonstrates our commitment to the City of Philadelphia and our loyal patrons,\" stated Steve German , Vice President of Sales and Marketing of Victory Brewing Company.\nGeno's Steaks\nArrival of one of Philadelphia's most famous cheesesteak stops, Geno's Steaks brings a popular addition to the already vast collection of food and drink options.\nGeno's Steaks is now open next to Victory Beer Hall. Patrons can order their steak with Whiz, American or provolone, and, of course, \"wit or witout\" onions. Geno's Steaks is located in the Philly Marketplace inside XFINITY Live!\n\"I am very excited to be a part of XFINITY Live! To be able to bring Philadelphia's No. 1 Cheesesteak to Philadelphia's No.1 Sports Bar is great fit for the city and all of its sports fans,\" said Geno Vento , owner of Geno's Cheesesteaks.\nPBR Bar and Grill\nPBR Bar and Grill now features a brand new 3,000 sq. ft. covered patio with fire pits, TV's and an indoor/outdoor bar.\nA new VIP area with soft seating and lighting was added to the interior.\nThe Terrace\nThe Terrace, a 4,000 sq. ft. addition is the new elevated private event space adjacent to 1100 Social.\nThe covered open-air space features a beautiful wood teak wall accent, 9 ft. in diameter ceiling fans with views overlooking Lincoln Financial Field and Citizens Bank Park, creating the ultimate gathering space for groups and clients.\nExtensive enhancements to the exterior finishes, signage, lighting and landscaping creates a new and improved pedestrian experience in and around the district.\nWith this expansion, XFINITY Live! now boasts 52,000 sq. ft. of outdoor space. Improvements to the concert and event stage include state-of-the-art audio and visual enhancements.\nSeventy-five new permanent jobs were created by this expansion, including servers, hostesses, chefs, security and managers.\nUpcoming events to celebrate the Grand Re-Opening of XFINITY Live! include: Oktoberfest Live! ( Saturday, October 17 ) and Nightmare on Broad Street Halloween Bash ( Saturday, October 31 ).\nAbout XFINITY Live! Philadelphia\nXFINITY Live! Philadelphia is a dining and entertainment district centered in the heart of the South Philadelphia Sports Complex. The one-of-a-kind venue features over a dozen restaurant and entertainment choices, including six main venues: Broad Street Bullies Pub, PBR Bar & Grill (Professional Bull Riders), Philly Market Place , 1100 Social, Victory Beer Hall and the first-ever NBC Sports Arena. XFINITY Live! Philadelphia is Philadelphia's No. 1 Sports Bar, as voted by Philadelphia Magazine.\nAbout Victory Brewing Company\nVictory Brewing Company is a craft brewery headquartered in Downingtown, PA. Founded by childhood friends, Bill Covaleski and Ron Barchet , Victory officially opened its doors in February of 1996. Victory serves fans fully flavored beers in 36 states with innovative beers melding European ingredients and technology with American creativity. To learn more about Victory Brewing Company visit www.victorybeer.com .\nAbout Chef Jason Cichonski\nChef Jason Cichonski is one of Philadelphia's most exciting young, star chefs. His creative, boundary-pushing presentations at his highly respected Queen Village restaurant, Ela, have earned him accolades from press and public alike. Cichonski showcases his wide-range of skills with his down-to-earth bar, The Gaslight. He had the opportunity to display his incredible cooking skills on a national level as a contestant on the popular Bravo TV cooking competition, \"Top Chef.\" Now he adds innovative cuisine to his repertoire, combining Mexican and Asian flavors for the high-quality 1100 Social. Cichonski was born in Northeast Philadelphia and grew up in Churchville , Bucks County , graduating from Council Rock High School. He studied culinary arts at the Restaurant School in University City at Walnut Hill College .\nAbout The Cordish Companies\nThe Cordish Companies' origins date back to 1910 and encompass four generations of privately-held, family ownership. During the past ten decades, The Cordish Companies has grown into a global leader in Real Estate Development, Gaming & Hospitality, Entertainment Management and International Urban Planning & Development. One of the largest and most respected developers in the world, The Cordish Companies has been awarded an unprecedented seven Urban Land Institute Awards for Excellence for public-private developments that are of unique significance to the cities in which they are located. Prime examples are The Cordish Companies' prominent role in the redevelopment of Baltimore's world famous Inner Harbor; Philadelphia, PA ; Atlantic City, NJ ; Charleston, SC ; Houston, TX ; Louisville, KY ; Kansas City, MO and St. Louis , MO. In addition, The Cordish Companies has developed and operates multiple highly acclaimed entertainment destinations throughout the United States which welcome over 50 million visitors per year and are the most visited destinations in their respective regions. Over the generations, The Cordish Companies has remained true to the family's core values of quality, entrepreneurial spirit, long-term personal relationships and integrity. As a testimony to the long-term vision of its family leadership, The Cordish Companies still owns and manages virtually every business it has created. For more information visit www.cordish.com .\n\"The Cordish Companies,\" \"The Cordish Company\" and \"Cordish\" are trademarks used under license by independent corporations, legal liability companies and partnerships (\"Cordish Entities\"). Each Cordish Entity is a separate, single-purpose legal entity that is solely responsible for its obligations and liabilities. No common operations or financial interdependency, and no intermingling of assets or liabilities of the Cordish Entities exists, or should be deemed to exist, as a result of the potential common reference to multiple independent entities operating under the names \"Cordish,\" \"The Cordish Companies\" or \"The Cordish Company\" here or elsewhere.\nPhoto - http://photos.prnewswire.com/prnh/20151014/276933\n releases/the-cordish-companies-xfinity-live-philadelphia-unveils-new-concepts-and-renovated-spaces-during-grand-reopening-300159798.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151014/276933", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/the-cordish-companies-xfinity-live-philadelphia-unveils-new-concepts-and-renovated-spaces-during-grand-reopening-300159798.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH28376&Transmission_Id=201510141514PR_NEWS_USPR_____PH28376&DateId=20151014", "http://www.cordish.com/", "https://photos.prnewswire.com/prnvar/20151014/276933"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T01:19:22.029+03:00", "highlightTitle": ""}