{"organizations": [], "uuid": "5a905ceeb138c8bb08140565744d7ba73b916bb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/images5-300x53.png", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/honeywell-offers-latest-navigation-technology-for-a320-and-a330-to-enhance-safety-and-efficiency/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Honeywell Offers Latest Navigation Technology For A320 And A330 To Enhance Safety And EfficiencyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Honeywell Offers Latest Navigation Technology For A320 And A330 To Enhance Safety And EfficiencyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba2c46992ca300e847cde388e6df922de87c0e03"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/honeywell-offers-latest-navigation-technology-for-a320-and-a330-to-enhance-safety-and-efficiency/", "ord_in_thread": 0, "title": "Honeywell Offers Latest Navigation Technology For A320 And A330 To Enhance Safety And EfficiencyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Honeywell Offers Latest Navigation Technology For A320 And A330 To Enhance Safety And Efficiency  \nHoneywell Aerospace’s latest navigational technology will be available as an option on Airbus A320 and A330 aircraft in early 2018. The new Integrated Multi-Mode Receiver will offer Airbus customers access to the latest precision navigation capabilities — a cost-effective solution that increases airport traffic capacity while decreasing weather-related delays, noise and operating costs through more efficient routing and improved navigation performance.\n \nHoneywell’s Integrated Multi-Mode Receiver navigation receiver will enable airline operators to take advantage of the latest in satellite-based navigation such as Honeywell’s SmartPath Ground-Based Augmentation System , which allows more accurate approach and landing access than today’s land-based systems. The new navigation receiver will also offer expanded capabilities for landing in very-low-visibility weather conditions.\n \n“We work closely with Airbus to ensure that our mutual customers have the most advanced technology so they fly the safest and most efficient flights possible,” said John Bolton, president, Air Transport and Regional, Honeywell Aerospace. “Honeywell’s latest Integrated Multi-Mode Receiver was designed to help airlines meet current industry navigation mandates and prepare for future capabilities through simple software upgrades.”\n \nThe Next Generation of Navigation Technology: Honeywell’s IMMR \n \nThe Honeywell IMMR is the industry’s only all-digital navigation radio that integrates multiple navigation functions into a single receiver, while reducing size and weight up to 50 percent compared with current solutions. This makes it easier for pilots to fly more complex and precise flight paths and approaches by using GPS satellites to pinpoint the aircraft’s location with extreme precision. Latest procedures and systems supported by the IMMR include satellite-based augmentation system, Required Navigation Performance-Authorization Required and GPS Landing System (GLS) Category I.\n \nThe IMMR is also designed with future growth in mind and is software upgradeable to support safe and successful GBAS GLS Category III approaches and landings that enable pilots to fly and land the aircraft in poor weather conditions and low visibility. The solution is also provisioned to support multiple satellite-based navigation solutions beyond GPS in the future.\n \nSource:-Honeywell", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T19:31:32.937+03:00", "highlightTitle": ""}