{"organizations": [], "uuid": "0a3a3010d7430825137b98b37be7b23c59e0d6d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Crystal-cruise.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/enchanting-adventures-on-the-adriatic-coast-set-for-crystal-esprit/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Enchanting Adventures On The Adriatic Coast Set For Crystal EspritTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Enchanting Adventures On The Adriatic Coast Set For Crystal EspritTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "ae3bc292347e5c1f77a6e02780ddc33d6a82a34a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/enchanting-adventures-on-the-adriatic-coast-set-for-crystal-esprit/", "ord_in_thread": 0, "title": "Enchanting Adventures On The Adriatic Coast Set For Crystal EspritTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Enchanting Adventures On The Adriatic Coast Set For Crystal Esprit  \nJust months after its idyllic maiden voyage through the Seychelles , Crystal Yacht Cruises’ Crystal Esprit will spend the spring, summer and fall of 2016 cruising some of the Adriatic Coast’s most coveted locales. Each of the seven-day voyages aboard the 62-guest yacht can be combined with the following one to create expanded vacations without repeating ports. From the end of March through October of 2016, more than 30 itineraries will cruise to destinations, many of which are only accessible by smaller vessels, captivating guests with the destination’s beauty, charm and historical significance.\n \n“Crystal Esprit’s Mediterranean and Adriatic Coast voyages reflect the yacht itself – sailing in a region that has long been beloved by Crystal guests and travelers the world over, but also exploring destinations in an entirely new way,” says Crystal president and CEO, Edie Rodriguez . “These itineraries perfectly blend some of Western Europe’s most famously bustling cities with other, more remote and quaint spots.”\n \nWith a focus on intimate access and active experiences, the sailings will offer new perspectives on currently favored destinations visited by the line’s ocean-going ships, Crystal Symphony and Crystal Serenity. All of the itineraries have been carefully crafted to heavily explore several destinations within one or two countries, allowing guests a more immersive cultural experience. Some of the yacht’s Mediterranean locales include:\n \nPiran, Slovenia – Set at the very tip of the Slovenian peninsula, which is the heart of what is affectionately known as the world’s outdoor playground, but also boasting a beautifully-preserved historic Old Town. Here, Crystal guests can enjoy the bounty of natural adventures and meandering walkways between seafood restaurants.\n \nKotor, Montenegro – A tradition-rich town that blends imposing walled fortresses with welcoming piazzas. Set at the base of a dramatically sloped mountain, Kotor is loved by history buffs and travelers with a taste for striking architecture and rich cuisine. The spectacular Kotor Fjord that surrounds the destination is, in itself, a “must see” for travelers.\n \nLimassol, Cyprus – Truly a playground for virtually every type of traveler, with its storied past (look for Byzantine castles, Venetian walls and conflicting Greek and Turkish influences); outdoor escapes (with rugged landscapes that beckon hikers and explorers and waters that scuba divers find irresistible); and a vast menu of foods that reflect the many cultural influences on the island.\n \nKas, Turkey – Where divers will find more than exotic sea life, but also centuries-old shipwrecks to explore in the famously inviting waters. Besides the plethora of outdoor adventures for which Kas is ideal, the town is also populated with ancient walls, theaters and rock tombs that help tell its fabled history.\n \nWhile Crystal Esprit’s itineraries along the Adriatic Coast and throughout the world will venture to new sites for the world’s most awarded luxury cruise line, what will remain is Crystal’s commitment to a superior standard of luxury for its globetrotting guests. Besides the vessel’s all-suite design that boasts a distinct atmosphere of sailing aboard one’s own private yacht, Crystal Esprit will be well appointed with elegant amenities; high-end finishes, modern technology and outfitted for adventure. This includes a two-passenger submarine, two 10-passenger zodiacs for special excursions and a 12-passenger Wider 32-foot super yacht tender for special boating adventures. Additionally, at the guests’ fingertips are water skis, wake boards, kayaks, jet skis, fishing, and snorkel equipment.\n \nSource: Crystal Cruises", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T19:40:17.166+03:00", "highlightTitle": ""}