{"organizations": [], "uuid": "5cc8ce430f4db26ed44d123053ce6056ecc29700", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/Etihad-Airways-300x166.png", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-signs-us700-million-technology-services-cloud-collaboration-with-ibm-to-transform-global-operations/", "country": "US", "title": "Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global OperationsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global OperationsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "5cc8ce430f4db26ed44d123053ce6056ecc29700"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-signs-us700-million-technology-services-cloud-collaboration-with-ibm-to-transform-global-operations/", "ord_in_thread": 0, "title": "Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global OperationsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etihad Airways Signs US$700 Million Technology Services, Cloud Collaboration with IBM to Transform Global Operations\nEtihad Airways and IBM today announced a ten-year technology services agreement worth approximately US$700 million. This will allow the airline to enhance guest experience, develop world-class infrastructure and security, and improve efficiency.\nThe transformational agreement, one of the most important strategic collaborations by Etihad Airways, will provide access to the latest cloud-based technologies and services for the airline, its group companies and equity partners. Etihad Airways, one of the fastest-growing airlines in the world, carried 14.8 million passengers in 2014, and serves 113 passenger and cargo destinations.IBM will deliver a range of secure and efficient technology services, allowing Etihad Airways and its partners to transform their IT infrastructure into global, flexible and agile cloud-based platforms to better serve their guests and employees.\nThe agreement includes plans for the creation of a new cloud data center in Abu Dhabi. The center, to be developed and operated by IBM, will be one of the most sophisticated technology facilities in the Middle East.\nJames Hogan, Etihad Airways’ President and Chief Executive Officer, said: “This is a long-term, strategic partnership which will allow Etihad Airways and its partners to harness the latest technologies as we deliver our award-winning services. This is a game-changing agreement for Etihad Airways, for our partners and employees, and for Abu Dhabi.”\nIBM was selected due its global reach, its experience and alignment with Etihad Airways’ technology and innovation strategy of deploying cloud-first initiatives to simplify its technology systems, while offering greater capabilities for lower operational costs. The cloud, analytics, mobile, security and cognitive technologies will drive increased efficiencies and effectiveness for all Etihad Airways businesses, as well as for the Etihad Airways Partners.\nSource:-Etihad Airways", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:07:10.420+03:00", "highlightTitle": ""}