{"organizations": [], "uuid": "fad027638c37fbd07281c369dc5b7439fbf42224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/10/lufthansa-300x65.jpeg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/lufthansa-to-launch-new-san-jose-usa-service/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Lufthansa to launch new San Jose (USA) serviceTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Lufthansa to launch new San Jose (USA) serviceTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "a9c829f2a13595bf96289197aee9e8e5feeae4a6"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lufthansa-to-launch-new-san-jose-usa-service/", "ord_in_thread": 0, "title": "Lufthansa to launch new San Jose (USA) serviceTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lufthansa to launch new San Jose (USA) service  \nLufthansa is to introduce a new non-stop service between Frankfurt and San Jose, California (USA). The new service, which will commence on 29 April 2016, will be the first non-stop flights to the state’s Silicon Valley from a European airport. The five-times-weekly service will be operated using Airbus A340-300 equipment.\n \n \nThe new westbound LH 488 service will operate on Mondays, Wednesdays, Fridays, Saturdays and Sundays, departing from Lufthansa’s Frankfurt hub in the morning and arriving in San Jose in the early afternoon after a 12-hour flight. The corresponding eastbound LH 489 service will operate as a night flight, leaving San Jose in the afternoon and arriving in Frankfurt the following morning. The schedules have been designed to provide the best possible connections with other Lufthansa services from and to Germany, Europe, Asia and Africa at the Frankfurt hub.\n \n \nThe San Jose metropolitan region has a population of around 3.3 million and lies in the heart of Silicon Valley, the major site of high-tech start-ups and corporations. Alongside many of the most famous names in the internet world, the area is also home to several leading companies in the biotech, pharmaceuticals and medical sectors. And a number of major car manufacturers have their research labs there, too.\n \n \nSan Jose is also an attractive tourist destination, serving as an ideal starting point to explore Northern California. Big Sur, Yosemite National Park, Lake Tahoe and other key attractions are all close by, making San Jose a genuine travel alternative to San Francisco, which is just 70 kilometers away.\n \n \nLufthansa is the first airline in Europe to offer non-stop service to San Jose, whose airport is increasingly developing into an international hub. Since its new international terminal was completed, the airport has welcomed new non-stop services to various destinations, including Tokyo and Beijing.\n \nLufthansa travellers to and from San Jose will have three seating classes to choose from: Business Class, Premium Economy and Economy. And a round-trip ticket will be available for as little as EUR 899. For further information and/or bookings visit LH.com or call the Lufthansa Service Center on +49 69 86 799 799. Flights can also be booked via Lufthansa’s travel agency partners and at any Lufthansa airport sales desk.\n \nThe new service at a glance Frankfurt-San Jose (California, USA) Airports/three-letter codes/time zones (summer) – Frankfurt Airport, Terminal 1 (FRA); UTC + 2 hours\n– Norman Y. Mineta San Jose International Airport (SJC); UTC – 7 hours Schedule (all times local; summer time) NEW from 29 April 2016 Mondays, Wednesdays, Fridays, Saturdays and Sundays \nLH 488 dep Frankfurt 10:40 – arr San Jose 13:40 \nLH 489 dep San Jose 15:20 – arr Frankfurt 11:35 (the next day) Average flight length 12 hours Distance 9,132 kilometers (4,931 nautical miles) Aircraft type Airbus A340-300 Source:- Lufthansa", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T19:39:51.930+03:00", "highlightTitle": ""}