{"organizations": [], "uuid": "5c8a61389fe92cb26122f62f7eb439137a23e5b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03233/oxford_alamy_3233954k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/education/universityeducation/11918904/Oxbridge-graduates-earn-double-200000-Russell-Group-premium.html", "country": "US", "title": "Oxbridge graduates 'earn double £200,000 Russell Group premium'", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 3, "title_full": "Oxbridge graduates 'earn double £200,000 Russell Group premium' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T08:01:00.000+03:00", "replies_count": 3, "uuid": "46e5eb408d6c31e3460e029bb97fb5ec2aa093b3"}, "author": "Josie Gurney-Read , Online Education Editor", "url": "http://www.telegraph.co.uk/education/universityeducation/11918904/Oxbridge-graduates-earn-double-200000-Russell-Group-premium.html#post-0", "ord_in_thread": 0, "title": "Oxbridge graduates 'earn double £200,000 Russell Group premium'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Graduates from the Universities of Oxford and Cambridge can expect to earn over £400,000 more during their lifetime than peers in other higher education institutions - double the £200,000 earning premium afforded to other members of the elite Russell Group. The figures suggest that students at the two ancient institutions will earn an average £1.8 million over a lifetime, compared with £1.39 million earned by those with a non-Russell Group degree. Meanwhile, graduates with qualifications from fellow Russell Group institutions , can expect £1.6 million over a lifetime. \"The report lays to rest the myth that equality of opportunity and effort results in equality of outcome in 21st century Britain.\" Pam Tatlow The numbers, calculated by management consultancy, the Boston Consulting Group, highlight the \"significant\" premium to a graduate's earning potential from attending a top institution. In terms of an annual average, this equates to £45,850 for Oxford and Cambridge graduates, compared with £40,960 for graduates from Russell Group institutions - over a 10 per cent difference. The calculations, published in a new report from education charity, the Sutton Trust, relect figures published last December that highlighted the earning advantages enjoyed by students from the elite institutions. Data taken from Sutton Trust and the Boston Consulting Group According to the research, graduates from Oxford and Cambridge enjoyed starting salaries approximately £7,600 (42 per cent) higher per year, on average, than graduates from new post-1992 universities. That equates to £25,600 after six months, compared with £18,000 for those graduating from the former polytechnics. However, while the premium still remains for Russell Group universities, the advantage decreases, with male students reporting salaries 10 per cent higher than those from modern institutions and female students earning just three to four per cent more. Oxbridge students will earn an average £1.8 million over a lifetime Photo: ALAMY Writing in the report at the time, Sir Peter Lampl, chairman of the SuttonTrust, said the differences in salary were \"significant\" and that \"not all degrees were created equal.\" \"At a time when the average student is graduating with around £44,000 of debt, it is more important than ever to recognise that fact,\" he said. \"It may not surprise anyone that an Oxbridge graduate on average commands a higher salary than someone from a newer university, but a £7,500 difference, which only falls to just under £5,000 allowing for social background and prior attainment, is a bigger difference than many might have expected.\" He added: \"At £3,300, the salary advantage of Oxbridge graduates over even graduates from other elite universities is also significant.\" Data taken from Sutton Trust and the Boston Consulting Group Today's report comes as record numbers of students won places at university this year, a three per cent increase on last year, according to the Universities and Colleges Admissions Service (Ucas). Of the total number of entrances in 2013, some 130,000 went to Russell Group universities, while around 6,500 went to the Universities of Oxford and Cambridge, raising concerns that many top graduates are failing to secure the long term earning advantages seen by a minority of students. However, Pam Tatlow, chief executive of the university think-tank, million+, warned against the findings, saying that lifetime earnings are \"affected by a range of factors, not least social background\". \"It's important to assess candidates on their ability to demonstrate the behaviours needed to do the job well and progress.\" Richard Irwin, PwC \"It is wrong to cherry pick a very small group of universities with a low number of undergraduates and compare the lifetime earnings of their students. \"[These students] overwhelmingly enter university and then the labour market with great advantages in terms of family income and networks, with those of the majority of graduates. However, the report does lay to rest the myth that equality of opportunity and effort results in equality of outcome in 21st century Britain.\" Richard Irwin, head of student recruitment at PwC, said: \"Given the historical dominance of Oxbridge and Russell Group universities in the top professions the difference the report highlights is not surprising. \"The important point is to ensure it changes - something we're seeing in our own firm where now only around 10 per cent of our intake is from Oxbridge and over 30 per cent is from outside the Russell Group. He added: \"It's important to assess candidates on their ability to demonstrate the behaviours needed to do the job well and progress, rather using the university they attended or the degree they studied as a proxy for this.\" telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-10-09T08:01:00.000+03:00", "crawled": "2015-10-09T02:47:10.985+03:00", "highlightTitle": ""}