{"organizations": ["Balancing Electric Unicycle Personal Transport Fosjoas V2 Balancing Electric Unicycle", "SONY", "Ltd", "UK Moben Global Inc.", "Electronic Science& Technology Building", "Fosjoas Technology Co.", "Moben Global Inc.", "Moben Technology Co."], "uuid": "0c9685872ffd228509cef6f76ca40bf9543e9fb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/personal_transport_fosjoas_v2_balancing_electric_unicycle/", "country": "US", "title": "Personal Transport Fosjoas V2 Balancing Electric Unicycle", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Personal Transport Fosjoas V2 Balancing Electric Unicycle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "0c9685872ffd228509cef6f76ca40bf9543e9fb1"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/personal_transport_fosjoas_v2_balancing_electric_unicycle/", "ord_in_thread": 0, "title": "Personal Transport Fosjoas V2 Balancing Electric Unicycle", "locations": ["Shenzhen", "Shennan Middle Rd.", "Guangdong", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Personal Transport Fosjoas V2 Balancing Electric Unicycle , 23 October 2015 -- Comparatively speaking, young girls particularly need a type of exclusive personal transport.Comparatively speaking, young girls particularly need a type of exclusively personal transport. Besides going to work and school, they often appear at many different occasions, such as girls’ date or party, shopping mall or beauty salon and so on. As the traffic jam is more and more serious, private car is not the first choice for girls, because being stuck on the halfway totally makes girls crazy. Riding a bicycle will make them sweat like a pig if for a long time. Briefly speaking, the transport that’s fitted for girls should be small in size, light in weight, fashionable in appearance and relaxing in riding. According to current market, the only one that can satisfy all above features is Fosjoas V2 twin-wheeled electric scooter. Small figure of Fosjoas V2 leaps to the eyes in the very first place. Girls even can put it in bag when taking the public transport or arriving at the destination. Then, the fashionable appearance totally captures girls’ hearts. The line of V2 self-balancing scooter is quite smooth and every detail is designed exquisitely. The twin-wheeled design is much more concise and fashionable than other scooter types. The king-size silicon protection pads on two flanks offer better protection. Meanwhile, color choices of V2, grass green and sky blue, give people a strong sense of freshness and passion. On the back of scooter, there is a LED atmosphere light, which is full of individuality. Besides, the adopted aerospace attitude control theory, fuzzy software algorithm and gyroscope system pave the way for relaxing riding. In addition, the adopted SONY lithium-ion battery is able to support as long range as 20km. That is to say, Fosjoas V2 can cover all short-distance travels in daily life. All in all, Fosjoas V2 can be hailed as the exclusively personal transport for girls. About: Fosjoas Technology Co.,Ltd was founded by UK Moben Global Inc. in 2010. In accordance with the pragmatic style of Moben Global Inc. and supported by a competitive tech team, Moben Technology Co.,Ltd launched its first electric unicycle product, which soon became a best-seller and was well-received among customers. Consequently Moben Technology Co.,Ltd will be dedicated to developing cutting-edge transport means as well as better user experience. Media Contact Company Name: Fosjoas Technology Co.,Ltd Contact Person: Jason Phone: +86-755-83777600 Address: Room 707, Block A, Electronic Science& Technology Building, No. 2070, Shennan Middle Rd., Shenzhen, Guangdong, China E-Mail:", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T11:30:08.320+03:00", "highlightTitle": ""}