{"organizations": [], "uuid": "93b20b623ad43bb6598fd1e3e9b76fe3d249a8dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/travel_20151005_germany_Oktoberfest_2015.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/german-border-controls-sobering-on-oktoberfest", "country": "MY", "title": "German border controls sobering on Oktoberfest", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "German border controls sobering on Oktoberfest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:08:00.000+03:00", "replies_count": 0, "uuid": "93b20b623ad43bb6598fd1e3e9b76fe3d249a8dc"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/german-border-controls-sobering-on-oktoberfest", "ord_in_thread": 0, "title": "German border controls sobering on Oktoberfest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "German border controls sobering on Oktoberfest Monday October 5, 2015 Print Article \nOktoberfest 2015, colourful as ever, but down 400,000 visitors from last year to 5.9 million revellers, the lowest level since 2009, on German border controls with the Europe-wide refugee crisis, and cool weather. — AFP pic BERLIN, Oct 5 — Attendance slipped at the world’s biggest beer party, the annual Oktoberfest in Germany, as border controls imposed to stem the flow of refugees complicated rail travel, organisers said yesterday. \nAs the 16-day event wrapped up in the southern city of Munich, Oktoberfest chief Josef Schmid told reporters that damp, cool weather had led some 400,000 fewer visitors to attend this year’s festival. \nThe total fell to 5.9 million revellers, the lowest level since 2009. \nSchmid said the checks at the frontier to manage a record migrant influx had likely also kept some tourists from neighbouring countries from travelling to Munich, national news agency DPA reported. \nBeer consumption fell as well, to 7.3 million litres, or 400,000 large glass mugs fewer than in 2014. \nBut crime was also down, with police recording 9 per cent fewer mobilisations this year. \nLocal authorities were at pains to keep beer-drinking partygoers and refugees apart, particularly at Munich’s main railway station where some 20,000 migrants arrived on each of the first two weekends of September. \nPolice said yesterday their efforts had been successful, after many asylum seekers were picked up at the border and put on buses and trains to other regions of Germany. \n“No disturbances were reported” between refugees and revellers, they said in a statement. \nOverwhelmed by a record migrant influx, and seeking to register asylum seekers as they enter the country, Germany on September 13 temporarily reintroduced border controls. \nAs a result, German rail operator Deutsche Bahn suspended key services to and from Austria and Hungary. \nGermany, Europe’s top economy, is expecting to receive up to one million asylum seekers this year, five times more than in 2014. \nAlthough Oktoberfest began 205 years ago, this year marked the 182nd edition as the party was cancelled during two world wars, two outbreaks of cholera, Napoleon’s invasion of Bavaria, and the hyperinflation of the 1920s. \nThe event was originally held in October — as the name suggests — to celebrate a royal wedding but was brought forward by one month to take advantage of better weather. — AFP-Relaxnews", "external_links": [], "published": "2015-10-05T06:08:00.000+03:00", "crawled": "2015-10-05T08:11:26.323+03:00", "highlightTitle": ""}