{"organizations": [], "uuid": "98282955ee4bdc4619da2c68e5c0d1c9f6e2fc95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/09/Carnival-Cruise-Lines.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/carnival-corp-will-deploy-next-cruise-ship-to-china/", "country": "US", "title": "Carnival Corp will deploy next cruise ship to ChinaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Carnival Corp will deploy next cruise ship to ChinaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "98282955ee4bdc4619da2c68e5c0d1c9f6e2fc95"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/carnival-corp-will-deploy-next-cruise-ship-to-china/", "ord_in_thread": 0, "title": "Carnival Corp will deploy next cruise ship to ChinaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carnival Corp will deploy next cruise ship to China\nThe Chinese market for cruising is hot that Caribbean-focused Carnival is sending a ship there. Cruise industry giant Carnival Corp. Announced on Tuesday that the “fun ship” brand would deploy a new vessel to the country in 2017 that will be specifically aimed at the local market.\nFurthermore, Carnival Corp.-owned Aida Cruises, a German brand, will also devote a new ship to the China market in 2017, the company said. The two brands are joining sister line Princess Cruises, which has already announced plans to devote its next ship to the China market in 2017.\nCarnival Corp. (CCL) is the parent company of Carnival, Aida, Princess and seven other cruise brands that together account for nearly half of the worldwide cruise business.\nThe moves are a blow to North American cruisers who are accustomed to getting the latest-and-greatest ships from North America-based lines in their home markets. But the cruise industry increasingly is looking to Asia for growth, and a growing number of lines are concluding the secret to success in the region is in the deployment of new vessels.\nCarnival Corp. has been a pioneer in cruises aimed at the China market since its Costa Cruises brand first deployed a ship to the region in 2006. Three Costa ships are currently based in China with another heading to the region in 2016.\nThe deployment of a Carnival vessel to China is an unusual move for a line that is about as North America-focused as they come. Aimed at travellers looking for an affordable cruise, Carnival seldom ventures too far beyond North America, with the majority of its sailings departing from U.S. ports to the Bahamas, Caribbean, Mexico and Alaska.\nCarnival Corp. said it expected more than 500,000 passengers in China this year, an increase of 43% from 2014.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:05:03.182+03:00", "highlightTitle": ""}