{"organizations": ["Coast Guard Beach"], "uuid": "edf5f81fa98e2c970a65ba071631e1fb8c1f62e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/riding_an_airwheel_mini_mobility_electric_self_balancing_scooter_enjoying_b/", "country": "US", "title": "Riding an Airwheel mini mobility Electric Self-balancing Scooter, Enjoying Beach Sight", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Riding an Airwheel mini mobility Electric Self-balancing Scooter, Enjoying Beach Sight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T02:27:00.000+03:00", "replies_count": 0, "uuid": "edf5f81fa98e2c970a65ba071631e1fb8c1f62e6"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/riding_an_airwheel_mini_mobility_electric_self_balancing_scooter_enjoying_b/", "ord_in_thread": 0, "title": "Riding an Airwheel mini mobility Electric Self-balancing Scooter, Enjoying Beach Sight", "locations": ["United States", "Delnor-Wiggins Pass State Park", "Cape Cod", "Cape Hatteras", "South Carolina", "U.S", "Hawaii", "Oahu", "Cape Florida State Park", "Florida", "Kiawah Island", "St. George Island State Park", "Maui", "Waimanalo Bay Beach Park", "Naples", "U.S.", "Massachusetts", "Key Biscayne", "Outer Banks", "Santa Barbara", "North Carolina", "East Beach", "Bonita Springs", "Hamoa Beach"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Beach"], "text": "Riding an Airwheel mini mobility Electric Self-balancing Scooter, Enjoying Beach Sight Recently, the top 10 lists of U.S beaches attracted people’s attention. Riding an Airwheel electric-self-balancing scooter will become a fresh traveling tool for beach tourist. United States, 12 October 2015 -- Beaching traveling is gaining an increasing number of fans all over the world. With the development of materials life, young peopletend to spend their summer holiday in a beach and enjoy the sea scene. Recently, the top 10 list of U.S beaches attracted people’s attention. Riding an Airwheel electric-self-balancing scooter will become a fresh traveling tool for beach tourist. For instance, with miles of white sand and turquoise waters perfect for swimming, body boarding and sailing, Hawaii's Waimanalo Bay Beach Park topped Dr. Beach's 25th annual top 10 lists of U.S. beaches, released Thursday. Here is the list of the top 10 beaches in U.S and which one is your favorite? 1. Waimanalo Bay Beach Park, Oahu, Hawaii 2. Barefoot Beach Preserve County Park, Bonita Springs, Florida 3. St. George Island State Park, Florida 4. Hamoa Beach, Maui, Hawaii 5. Cape Hatteras, Outer Banks, North Carolina 6. Cape Florida State Park, Key Biscayne, Florida 7. Coast Guard Beach, Cape Cod, Massachusetts 8. Beachwalker Park, Kiawah Island, South Carolina 9. Delnor-Wiggins Pass State Park, Naples, Florida 10. East Beach, Santa Barbara, California.No wonder someone noticed that there are some people riding the particular self-balancing scooters rambling along the beach. Airwheel electric self-balancing scooter is super easy to catch, especially the classic unicycle X-series, which just weights 11.1kilograms! Just putting it into their package, beaching traveling is added to more fun and conveniences. After a long semester, it is time to award a cozy beach traveling and carry an Airwheel M3 electric skateboards to assistant. Without energy consumption, they are blessed with more personal free time to do other entertainment activities such as beach barbecue or sunbath. It is annoying that in the past people will spend much energy and time rambling along the coastline and when they come back, they have no time to prepare a fluent barbecue dinner. Airwheel, to some extent, helps to tackle this problem. # # #", "external_links": [], "published": "2015-10-12T02:27:00.000+03:00", "crawled": "2015-10-12T11:42:46.603+03:00", "highlightTitle": ""}