{"organizations": [], "uuid": "60506ecdfdcf383e635a332666518ae68f19bc6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/jumeirah-group-sirius-ek-offer-hero.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/jumeirah-offers-emirates-skywards-members-25-discount-on-hotel-rates/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Jumeirah offers Emirates Skywards members 25% discount on hotel ratesTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Jumeirah offers Emirates Skywards members 25% discount on hotel ratesTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "abf8ab230408d47034bf07bb0d6e6a1b656ef14f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/jumeirah-offers-emirates-skywards-members-25-discount-on-hotel-rates/", "ord_in_thread": 0, "title": "Jumeirah offers Emirates Skywards members 25% discount on hotel ratesTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jumeirah offers Emirates Skywards members 25% discount on hotel rates  \nJumeirah Group, the global luxury hotel company, and member of Dubai Holding, has launched an exclusive offer providing Emirates Skywards members 25% off the Jumeirah Flavours rate at participating Jumeirah Hotels and Resorts in Dubai.\n \nIn addition, guests can take advantage of daily complimentary breakfast and an invitation to dine at over 50 participating restaurants with complimentary lunch or dinner every day of the holiday. Leisure benefits include complimentary access to Wild Wadi Waterpark™, Sinbad’s Kids Club, The Hub and complimentary wi-fi access around the resort.\n \nAlison Broadhead, Chief Commercial Officer, said: “We are proud to unveil this special offer in partnership with Emirates. For a limited time, Emirates Skywards members around the world will be offered exclusive rates on stays at seven of Jumeirah’s luxurious hotels and resorts in Dubai, the Maldives, Istanbul and Rome. The collaboration provides greater brand visibility for the Jumeirah Group and connects our participating properties to the loyal customers of one of the world’s leading airlines.”\n \nThe offer is available on all stays at the following participating hotels: Jumeirah Beach Hotel, Jumeirah Creekside Hotel, Jumeirah Emirates Towers, Jumeirah Zabeel Saray, Jumeirah Al Qasr, Jumeirah Dar Al Masyaf and Jumeirah Mina A’Salam in Dubai, Jumeirah Vittaveli and Jumeirah Dhevanafushi in the Maldives, Pera Palace Hotel Jumeirah in Istanbul and Jumeirah Grand Hotel Via Veneto in Rome. To avail the offer and add a different flavour to your holiday, simply make a booking between 1 September 2015 and 15 November 2015 and enjoy 25% off on the Jumeirah Flavours rate on stays from 1 October 2015 until 30 September 2016.\nSource:- Jumeirah", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T19:25:10.414+03:00", "highlightTitle": ""}