{"organizations": [], "uuid": "1393acba212cd7a4f3311280a8fb3e38fdf57314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64632/airline-airport-travel-and-tourism-groups-urge-congress-ground-r", "country": "US", "title": "Airline, airport, travel and tourism groups urge Congress to ground revenue diversion plan", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Airline, airport, travel and tourism groups urge Congress to ground revenue diversion plan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:26:00.000+03:00", "replies_count": 0, "uuid": "1393acba212cd7a4f3311280a8fb3e38fdf57314"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64632/airline-airport-travel-and-tourism-groups-urge-congress-ground-r", "ord_in_thread": 0, "title": "Airline, airport, travel and tourism groups urge Congress to ground revenue diversion plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airline, airport, travel and tourism groups urge Congress to ground revenue diversion plan   \nOct 08, 2015 eTN   \nWASHINGTON, DC - A coalition of organizations representing the travel, tourism, airport and airline industries as well as the traveling public are joining forces, urging leaders in the House and Senate to not divert $9.2 billion collected for aviation security, to pay for the highway trust fund or any other purpose not related to air travel. \nIn a letter to the bipartisan leadership of the Senate Finance Committee and the House Ways and Means Committee, Airlines for America (A4A), Airports Council International – North America (ACI-NA), the Global Business Travel Association (GBTA), The International Air Transport Association (IATA), Travelers United and the U.S. Travel Association, opposed a revenue diversion provision in the U.S. Senate-approved highway bill. Under that bill, funds that airline passengers pay to the Transportation Security Administration (TSA) and Customs and Border Protection (CBP) for security would be diverted to replenish the highway trust fund. \n“Airline passengers should not be used as a piggy bank to pay for highway investments that benefit highway users,” the letter stated. “Additionally, using TSA security fees to offset the deficit in the Bipartisan Budget Act was a misguided policy choice that redirected important security funds away from their intended and needed use. To charge travelers more without an increase in service or benefit cannot and should not become a common practice for policy makers.” \nThe coalition noted its support for a long-term highway bill that enables and encourages infrastructure investment, while rejecting any suggestion that highway funding unfairly be generated via an increase in the aviation passenger’s CBP fees. \n“We share your goal of reaching a compromise to provide healthy highway funding, but we urge you to ensure that basic principles of fairness are upheld,” the group said. “We appreciate the funding challenges that face our nation, but the burden to fund all aspects of the federal government should not fall on the shoulders of aviation passengers.”", "external_links": [], "published": "2015-10-08T23:26:00.000+03:00", "crawled": "2015-10-09T00:49:02.213+03:00", "highlightTitle": ""}