{"organizations": [], "uuid": "c7019d76ff7685cf14025a13c17fa4a927a05d6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/arenas-and-conference-centres/29470-kuala-lumpur-convention-centre-continues-to-support-educational-platform-for-culinary-industry", "country": "US", "title": "Kuala Lumpur Convention Centre continues to support educational platform for culinary industry", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Kuala Lumpur Convention Centre continues to support educational platform for culinary industry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T13:30:00.000+03:00", "replies_count": 0, "uuid": "c7019d76ff7685cf14025a13c17fa4a927a05d6c"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/arenas-and-conference-centres/29470-kuala-lumpur-convention-centre-continues-to-support-educational-platform-for-culinary-industry", "ord_in_thread": 0, "title": "Kuala Lumpur Convention Centre continues to support educational platform for culinary industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kuala Lumpur Convention Centre continues to support educational platform for culinary industry Kuala Lumpur Convention Centre continues to support educational platform for culinary industry Details  30 Marking a decade in business, the Kuala Lumpur Convention Centre (the Centre) is proud to continue supporting the country’s premier educational platform for culinary development as venue sponsor for Culinaire Malaysia, Malaysia’s finest culinary challenge to recognise the best in culinary arts and food & beverage service skills. Culinaire Malaysia 2015 was the fifth consecutive edition of the biennial event hosted at the Centre since 2007. \n“As the country’s premier convention facility and one that considers food & beverage (F&B) a key component of the products and services that we offer, Culinaire Malaysia provides an opportunity for the Centre to contribute to the culinary industry in so many ways,” said General Manager, Alan Pryor. Organised by the Malaysian Association of Hotels (MAH) and Malaysian Food and Beverage Executives Association (MFBEA), this year’s Culinaire Malaysia 2015 saw a record-breaking 1,296 contestants from 14 countries vie for 26 awards, all of which are internationally recognised by the World Association of Chefs Societies (WACS). According to the Centre’s Executive Chef, Richmond Lim, it is especially gratifying to be able to ‘grow’ with Culinaire Malaysia as the event size and programme has gotten bigger with each edition. Lim explained that to cater to the large number of contestants and endeavor to cut down on food waste this year, the venue devised a cabinet trolley refrigerated container system to store unused ingredients which were later recycled for other purposes, such as committee meals. “The system’s effectiveness was seen in the 60% decrease in food waste collected in 2015 compared with Culinaire Malaysia 2013.” This year also saw the Centre collaborate with MAH on a new team challenge category, the Malaysia Junior Tiger Cup, in line with the Centre’s commitment to talent development. The team challenge is aimed at stimulating young chefs and chefs-to-be to use their creativity, and work in a team of four, to innovate and create three dishes; appetiser, main course and dessert that exemplify today’s modern and refined cuisine. “The response to this inaugural event was tremendous,” said Lim, “with participants from not only Malaysia but Taiwan, South Korea, Indonesia, Hong Kong, United Arab Emirates, Thailand and Singapore.” Another new activity which the Centre supported was the final of SPICE (Special People in Culinary Excellence), a cooking competition for OKUs (Orang Kurang Upaya) or People with Disabilities organised by Food Aid Foundation in collaboration with MAH and the WACS’ World Chefs without Borders. SPICE promotes the opportunity to empower OKUs to explore all possibilities to achieve their full potential in living skills with one of the expected outcomes being to give them equal opportunity in the culinary industry. Culinaire Malaysia 2015 was held from 29 September to 2 October in conjunction with the 13th Malaysia International Exhibition of Food, Drinks, Hotel, Restaurant & Foodservice Equipment, Supplies, Services & Related Technology (FHM 2015). Held at the Centre since the facility’s opening in 2005, the biennial FHM has also grown in leaps and bounds, from 650 exhibitors from 30 countries (at FHM 2005) to 1,200 participating companies from 47 nations this year. Latest news", "external_links": [], "published": "2015-10-21T13:30:00.000+03:00", "crawled": "2015-10-21T14:15:52.569+03:00", "highlightTitle": ""}