{"organizations": ["Leeds Castle"], "uuid": "877b72b260c5634d6be499ee2cb0812cd58424f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oxfordmail.co.uk", "main_image": "http://www.oxfordmail.co.uk/resources/images/4322355/", "site_section": "http://www.oxfordmail.co.uk/life/travel/rss/", "section_title": "Oxford Mail | Travel", "url": "http://www.oxfordmail.co.uk/life/travel/13847522.Festival_of_flowers_in_the_Garden_of_England/?ref=rss", "country": "GB", "title": "Festival of flowers in the Garden of England", "performance_score": 0, "site": "oxfordmail.co.uk", "participants_count": 0, "title_full": "Festival of flowers in the Garden of England", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:52:00.000+03:00", "replies_count": 0, "uuid": "877b72b260c5634d6be499ee2cb0812cd58424f0"}, "author": "", "url": "http://www.oxfordmail.co.uk/life/travel/13847522.Festival_of_flowers_in_the_Garden_of_England/?ref=rss", "ord_in_thread": 0, "title": "Festival of flowers in the Garden of England", "locations": ["England"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Festival of flowers in the Garden of England: Leeds Castle in Kent puts on a blooming great show Palatial splendour: A stunning Art Deco inspired floral display at the entrance to Leeds Castle \n/ Travel Share \nOn his travels to Kent, the Garden of England, Abingdon Horticultural Chairman David Bingley drops into the Festival of Flowers at Leeds Castle \nFor the flower fan, it's hard to think of a more beautiful setting for a display of blooms than a castle inthe very heart of the Garden of England. \nThe Festival of Flowers at Leeds Castle is everything you'd expect from one of the country's top horticultural events. \nLast month's floral celebration had an Art Deco theme, with the castle rooms, the cellar and court yard embellished by professional florists, flower arrangers and floral designers under the guidance of the castle's own resident florists. \nThe designers drew their inspiration for the floral decadence from the glamorous age of high society and grand country house parties of the 1930s. There was also a strong influence from the last custodian of the castle, Lady Baillie, whose passion for birds greatly influenced many of the floral displays. \nCelebrity garden designer Diarmuid Gavin officially opened the event and followed up with a specialist talk on the history of garden design which was amusing and well received by castle visitors. Promoted stories \nA visit to the festival gives visitors the opportunity to observe the floral design techniques of a number of award winning national and international floral artists including Gold medal winners from the Chelsea and Hampton Court Flower shows. Students from Kent's own Hadlow college this year showed their maturity of design skills alongside established floral designers, with great success. \nThe Queen's bedroom decorations exemplified the bird passion of Lady Baillie; the Peacock floral sculptures were exquisite in both form and colour and showed the hours of work needed by the artists to provide visitors with an insight into their craft. \n\nGreen star: Diarmuid Gavin officially opening the festival \nThe floral peacocks were each constructed with their own colour palette by Angela Merryfield, who in the past has won at world shows in Japan, USA and Ireland. \nIn the Queen's Gallery the Dutch designer, Dennis Kneepkens, used over 300 stems of fragrant lilies to create a colourful and aromatic display using only one variety. The addition of gold leaf on the smaller table decorations added a magical touch. \nFull flight: One of the Amanda Coghill Peacock displays \nThe castle is managed by the Kent Castle Trust and is used for a wide variety of functions to support the upkeep of such a vast building and surrounding estate. The largest room in the castle is the Henry V111 Banqueting Hall and the castle's own florists have dressed the banqueting table to demonstrate their skills in the way they would for a wedding or private dining event. \n* Leeds Castle is open for woodland walks and more this autumna nd winter. Next year it also hosts The Chelsea Fringe (May 21 - June 12) with some incredible floral displays expected. Share article \nFor more information, visit leeds-castle.com/events", "external_links": [], "published": "2015-10-14T19:52:00.000+03:00", "crawled": "2015-10-14T22:35:06.671+03:00", "highlightTitle": ""}