{"organizations": [], "uuid": "be628ea4fabbb40eb87cd4cd6c425a6e4bbac969", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30252427/dana-named-2016-automotive-news-pace-awards-finalist-for-long-two-sided-chip-cooling", "country": "US", "title": "Dana Named 2016 Automotive News PACE Awards Finalist for Long® Two-Sided Chip Cooling", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Dana Named 2016 Automotive News PACE Awards Finalist for Long® Two-Sided Chip Cooling - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "be628ea4fabbb40eb87cd4cd6c425a6e4bbac969"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30252427/dana-named-2016-automotive-news-pace-awards-finalist-for-long-two-sided-chip-cooling", "ord_in_thread": 0, "title": "Dana Named 2016 Automotive News PACE Awards Finalist for Long® Two-Sided Chip Cooling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Dana Holding Corporation\nMAUMEE, Ohio , Oct. 13, 2015 /PRNewswire/ -- Dana Holding Corporation (NYSE: DAN) announced today that its Long ® two-sided chip cooling technology has been selected as a finalist for the 2016 Automotive News PACE Awards. The integrated cooling plate offers superior heat transfer, temperature management, and cooling abilities within a lightweight, compact, and cost-effective design.\nDana's two-sided aluminum cooling technology enhances the heat transfer of power inverter devices, accommodating the high-power and high-heat demands of electric and hybrid vehicles. The cooling technology delivers smooth, efficient heat transfer and also is exceptionally clean and flux-free, which minimizes coolant contamination. Through its efficient attributes, the two-sided chip cooling improves the ability to transfer high power between batteries and motors.\n\"Dana is proud to again have been named a finalist for the PACE Awards, marking the fifth consecutive year that our leading technologies have been recognized by the most prestigious honor in our industry,\" said Dwayne Matthews , president of Dana's Power Technologies Group. \"It is a true testament to the expertise and collaborative spirit of our world-class engineering team and their unwavering efforts to develop cutting-edge solutions for our global customers.\"\nThe annual Automotive News PACE Awards recognize superior innovation, technological advancement, and business performance among automotive suppliers, and serves as a benchmark award program for automotive innovation.\nAbout the Automotive News PACE Awards\nThe Automotive News Premier Automotive Suppliers' Contribution to Excellence (PACE) Awards is recognized around the world as the industry benchmark for automotive innovation. The 2016 Automotive News PACE Awards will be presented on April 11, 2016 , at the Max M. Fisher Music Center in Detroit . The award is presented by Automotive News , Ernst & Young, and Transportation Research Center Inc. (TRC Inc.).\nAbout Dana Holding Corporation\nDana is a global leader in the supply of highly engineered driveline, sealing, and thermal-management technologies that improve the efficiency and performance of vehicles with both conventional and alternative-energy powertrains. Serving three primary markets – passenger vehicle, commercial truck, and off-highway equipment – Dana provides the world's original-equipment manufacturers and the aftermarket with local product and service support through a network of nearly 100 engineering, manufacturing, and distribution facilities. Founded in 1904 and based in Maumee, Ohio , the company employs approximately 23,000 people in 25 countries on six continents. In 2014, Dana generated sales of $6.6 billion . For more information, please visit dana.com.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/dana-named-2016-automotive-news-pace-awards-finalist-for-long-two-sided-chip-cooling-300159066.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CL27288&Transmission_Id=201510131635PR_NEWS_USPR_____CL27288&DateId=20151013", "http://www.prnewswire.com/news-releases/dana-named-2016-automotive-news-pace-awards-finalist-for-long-two-sided-chip-cooling-300159066.html", "http://www.xmlnews.org/ns/"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T01:42:34.061+03:00", "highlightTitle": ""}