{"organizations": [], "uuid": "c075f46edbf2870611211621b5360f49b20b565f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vvdailypress.com", "main_image": "http://www.vvdailypress.com/storyimage/VV/20151018/NEWS/151019762/AR/0/AR-151019762.jpg", "site_section": "http://www.vvdailypress.com/entertainment/travel?template=rss&mime=xml", "section_title": "TRAVEL - VVdailypress.com", "url": "http://www.vvdailypress.com/article/20151018/NEWS/151019762/13007/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Migrating your RV to warmer destinations", "performance_score": 0, "site": "vvdailypress.com", "participants_count": 1, "title_full": "Migrating your RV to warmer destinations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T05:54:00.000+03:00", "replies_count": 0, "uuid": "c075f46edbf2870611211621b5360f49b20b565f"}, "author": "RUSS AND LORI TICE", "url": "http://www.vvdailypress.com/article/20151018/NEWS/151019762/13007/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Migrating your RV to warmer destinations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ROLLIN' WITH RUSS AND LORI Migrating your RV to warmer destinations Comment By RUSS AND LORI TICE VVdailypress.com By RUSS AND LORI TICE Posted Oct. 18, 2015 at 12:01 AM By RUSS AND LORI TICE Posted Oct. 18, 2015 at 12:01 AM » Social News Seems like only last month we were looking for shade to camp under for most of the time. The season is changing. As winter slowly moves in, many campers that live outside of California migrate south for a warmer climate. These folks are known as \"snowbirds.\" The southwest is very inviting to those who choose to camp in our vast and beautiful Golden State, where folks RV camp for even months at a time. We will explore some of these warmer California destinations that can keep your RV rollin’ all year round. One of the most popular snowbird destinations in the country is Quartzsite. Not far from the California/Arizona border, this normally small town expands to see hundreds of thousands of RV folks arrive every winter for the largest rock hound exposition in the United States. There is every type of camper from weekender to full-timers. It is an extremely friendly atmosphere with many Bureau of Land Management camping areas available. FREE is a great camping word, right? In as much, you don’t hear it very often. In the BLM areas, you can camp for free for up to 14 days. If you are a long-term camper, the cost is $180 to stay from September through April! Keep in mind that this is dry camping and your rig must be fully self-contained. In Palm Springs, you can RV in large and luxurious RV sites within campgrounds that have all sorts of amenities. Palm Springs is east of Los Angeles on Interstate 10 in the Coachella Valley. Known for Olympic sized pools, tennis courts, and 107 golf courses within 45 miles, this is truly upscale RV camping with prices that are not too bad. There are many RV parks to choose from. Snowbird camping generally has a quieter, relaxed feel to it, but there are always activities and adventures close by or even a part of most of these RV facilities. The Palm Springs Oasis RV Resort is very centrally located. The city name is actually shown as Cathedral City, yet it is still in the same geographical area. Palm Springs Oasis RV Resort has wide paved roads, restrooms, showers, and laundry facilities. There are 140 full hookup sites with patios. The park is very handicap friendly with access done very well to accommodate power scooters and such. They have a heated spa, pool, shuffleboard, horseshoes, and a recreation hall with varied activities. A favorite Palm Springs area RV park for Russ and Lori is the Sands RV and Golf Resort. This is a premier luxury resort and admittedly, Russ and Lori are not golfers. Still, this is a beautiful and richly landscaped destination that is also pet friendly. They offer two leash-free dog parks for your canine family members to really have a blast. Something completely different in the California camping experience is the Pechanga RV Resort. It is just minutes from the Temecula Wine Country. The Pechanga RV Resort offers 24 hour opportunities for relaxing, excitement, casino action, and great food at reasonable prices. Historic Old Town is a perfect day trip for some unique sight-seeing and shopping opportunities. Head east to Pirate Cove RV Resort in Needles for some great \"on the water\" winter camping. Right on the Colorado River, this park is 12 miles east of Needles. It is off of Interstate 40 & historic Route 66 at exit 153. All of the RV resorts and parks we have mentioned are literally just a few hours’ drive from each other or less. Even San Diego is a relatively short travel hop from any of these locations. All are in very desirable California winter climates. You don’t have to be retired or full time RV enthusiast to enjoy what the snowbirds enjoy. Take a break and visit one or more of these locations. Meet new friends that are there for exactly the same reasons you are. So, Let’s Get Rollin’! To contact Russ and Lori Tice, email them at Russ.Lori.Rollin@gmail.com . By RUSS AND LORI TICE VVdailypress.com By RUSS AND LORI TICE Posted Oct. 18, 2015 at 12:01 AM » Comment or view comments \" data-width=\"650\" data-numposts=\"20\" data-colorscheme=\"light\"> » STAY INFORMED", "external_links": [], "published": "2015-10-18T05:54:00.000+03:00", "crawled": "2015-10-18T11:20:28.240+03:00", "highlightTitle": ""}