{"organizations": [], "uuid": "1641ccd590ec1138152b5ac65b64f96a9283ed1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/1/h/b/i/6/image.related.StuffLandscapeSixteenByNine.620x349.17ly7q.png/1445394451127.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/europe/73247606/Russia-A-country-that-is-as-baffling-as-it-is-brilliant", "country": "AU", "title": "Russia: A country that is as baffling as it is brilliant", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Russia: A country that is as baffling as it is brilliant", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T05:27:00.000+03:00", "replies_count": 0, "uuid": "1641ccd590ec1138152b5ac65b64f96a9283ed1b"}, "author": "Ben Groundwater", "url": "http://www.stuff.co.nz/travel/destinations/europe/73247606/Russia-A-country-that-is-as-baffling-as-it-is-brilliant", "ord_in_thread": 0, "title": "Russia: A country that is as baffling as it is brilliant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Police investigating death of a man in Kaitaia supermarket carpark Russia: A country that is as baffling as it is brilliant BEN GROUNDWATER Last updated 05:00, October 22 2015 Supplied \nRussia. A brilliant yet baffling nation. \nThe Russians have a saying: \"Love is as sweet as a carrot.\" \nAh. Isn't that beautiful? Love is as sweet as … wait, what? A carrot? Seriously? That's the best they could do? All of the beauty and passion that goes into love, all of the poetry and lust and splendour, and the best they could do is compare it to a root vegetable? \nI don't understand Russia. I mean, I love it. But I don't understand it. It baffles me. It confounds me. It generally makes no sense. \nI've been to Russia twice now, and it's still \"a riddle, wrapped in a mystery, inside an enigma\". (Thanks Mr Churchill.) It's a strange land that manages to work its way under your skin without ever revealing its secrets. \nRussia, as a whole, is a bit like the Cyrillic alphabet. It's obviously foreign, but it also seems vaguely familiar, and you think you'll probably be able to understand it. Very soon, however, you realise it makes no sense whatsoever. \nThe Cyrillic alphabet only takes a few weeks to get used to. You could spend a whole lifetime in Russia, however, and still not have a proper handle on the place. \nThere's so much I don't understand. Why, for instance, is borscht a popular dish? Why don't people say hello to me in shops? Why are there still USSR signs and hammers and sickles all over the place? Why would anyone live in Siberia, a place so cold that it's said each year Siberians live with nine months of anticipation, and three months of disappointment? \nI have no idea. But that's exactly what makes travel in this huge land so great. Who wants to go somewhere you already understand? Those places are nice enough for a holiday, I guess, but they're not anywhere near as much fun as going somewhere that will both confuse and amuse you, that will shatter some expectations while confirming more than a few. \nYes, Russians drink a lot of vodka. If they order a bottle at a restaurant it's considered fairly natural to sit there at the table drinking shots until the whole thing is gone. \nYes, they're introspective, occasionally maudlin people. I had a guide in Moscow recently who was the personification of the word \"glum\", a middle-aged guy who looked permanently like his dog had died. But Dmitry was a man of many layers. It turned out he was a huge AC/DC fan. He'd been to see Metallica twice. And he spent his downtime reading classical Russian literature and walking in the forest looking for wild mushrooms and nettle leaves to make soup. Ad Feedback \nWhen Dmitry and I parted he didn't shake my hand, but gave me a raised fist salute and recommended I read Bulgakov​. \nYou see? Russia is different. It's odd. The good news, however, is that for every day you spend in the country, another small part of it begins to make sense. \nREAD MORE: \n*10 off-the-radar European countries worth visiting \nThe people gradually reveal themselves as being the kind, warm souls those who know the country insist they can be. If you judged Russians by what you saw on the news you'd think they were a bunch of homophobic warmongers – and maybe that is true in some instances. But spend time in the country and you find that behind those glum looks and wary greetings lies a people willing to do anything for a good friend, a spiritual, intellectual bunch who can engage on a much broader range of topics than last weekend's footy scores and who's going to win The Bachelorette . \nThe first Russian person that pops into your head might be a shirtless, tiger-bothering Vladimir Putin, but when you're actually in the motherland you remember that this is also the home of Tolstoy and Dostoyevsky​, of Tchaikovsky and Baryshnikov​. There's far more to Russia than the macho posturing of its leader. It's complicated, yes. It's strange as well. But it begins to make sense. \nSpend time in Russia and you come to realise that borscht, done well, can taste amazing. You find that the weather in Siberia might be cold, but the people are not – and at worst, the vodka warms you up. You realise there's a strong sense of history in Russia, and that just because Lenin is dead and communism is finished, it doesn't mean their monuments will automatically be torn down. \nAnd you find out something else: that in a cold, harsh environment, root vegetables are highly prized. That a carrot, freshly plucked from the earth, can be as sweet as honey. And that comparing it to love is high praise indeed.", "external_links": [], "published": "2015-10-21T05:27:00.000+03:00", "crawled": "2015-10-22T01:03:35.736+03:00", "highlightTitle": ""}