{"organizations": [], "uuid": "5b3f83ed76246a01752424d9d9bfea5c22df3267", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03465/Fischer_Sports_fra_3465546k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-19.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/snowandski/features/ski-interviews/11903913/Franz-Klammer-interview-Ski-racing-is-my-life-and-I-wanted-to-do-it-no-matter-what.html", "country": "US", "title": "Franz Klammer interview: 'Ski racing is my life and I wanted to do it no matter what'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Franz Klammer interview: 'Ski racing is my life and I wanted to do it no matter what' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:37:00.000+03:00", "replies_count": 0, "uuid": "5b3f83ed76246a01752424d9d9bfea5c22df3267"}, "author": "Graham Bell", "url": "http://www.telegraph.co.uk/travel/snowandski/features/ski-interviews/11903913/Franz-Klammer-interview-Ski-racing-is-my-life-and-I-wanted-to-do-it-no-matter-what.html", "ord_in_thread": 0, "title": "Franz Klammer interview: 'Ski racing is my life and I wanted to do it no matter what'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A yellow flash on the edge of control races down an impossibly bumpy and icy downhill course, lined top to bottom with fans, some hanging from trees or leaning over the safety fence for a better view. The noise of cowbells, horns and cheering is deafening. Arms windmilling, knees pumping and skis carving, the man wearing number 15 is risking everything for speed. This was the 1976 Winter Olympic Games in Innsbruck – the men’s downhill, the blue riband event – and the yellow flash was Franz Klammer, Austrian national hero and pre-race favourite. Innsbruck 1976 was the first Winter Olympics to be broadcast live on television. In the previous decade, ski racing had undergone a technological revolution, with hard-shell boots, Lycra race suits and improved ski design dramatically increasing the speeds – and thereby the danger. Downhill racing was the winter sports version of Formula 1, and the risks were no less great, something that Klammer would learn all too harshly a year later. Klammer’s rise to the top was remarkable. He comes from Carinthia in southern Austria, an area not really known for Alpine skiing. “I grew up in a small village of 10 houses with no ski lifts, so I started skiing by hiking up the pasture at the back of my house.” “I was eight years old when I first got to ride a ski lift in my nearest resort, Bad Kleinkirchheim .” Klammer started racing very late in comparison to his contemporaries, entering his first race at 14. Kids in the neighbouring Alpine regions of Tirol or Salzburgerland would have started at eight years old. But from that late start, his rise was meteoric and there was no questioning his dedication. “I left school at 14 and worked on the family farm in the summer, and ski raced in the winter. My parents didn’t have any money and I had to buy all my own equipment; but I thought, ski racing is my life, and I wanted to do it no matter what.” Klammer made his World Cup debut in 1972 at 19 years old, on the Saaslong downhill in Val Gardena, Italy. He was up against the world’s best, including the dominant Swiss team that boasted Bernard Russi and Rolland Collombin, who had taken gold and silver respectively at the Sapporo Winter Olympics in Japan just weeks before. “In the timed training run I skied into 9th position, up there with all these great skiers, but in the race I was so nervous that I only managed 32nd.” The Austrian risked everything for speed Photo: Sports Illustrated In December 1973, Klammer was back in Val Gardena, for the start of his first full season on the World Cup tour. He came fifth, and his first podium came shortly after with a second place in the Arlberg Kandahar downhill in St Anton , Austria. At the time Klammer was also an accomplished giant slalom skier and he recorded his one and only podium in this discipline with a third place in Mount Ste Anne, Canada, in that first season. The next season, at just 20 years old, Klammer recorded his first World Cup win in Schladming , Austria, and followed it up with a silver medal in February at the St Moritz World Championships in Switzerland. In the following season, 1974/75, Klammer became almost unbeatable – nine World Cup downhills, eight victories and one failure to finish after a binding pre-release. So what was Klammer doing that no one else could? “I was the first downhill skier who carved through the whole turn,” he says. “If you look at the old technique of, say, Karl Schranz and Jean-Claude Killy, they would start the turn with a skid, then try to carve out of it. My technique was kind of rugged and my upper body was really unstable, but if you looked at my skis they were carving on their edges much earlier in the turn. Don’t ask me how I came up with the technique, it just came naturally.” The fact that Klammer started skiing so late in his backyard, and was not schooled at an established Alpine racing club, might well have been the key to his success. Like so many truly great sportsmen who suddenly raise the bar, Klammer broke with convention and created a new way of winning. It was not just technically that he had the upper hand over his opponents; his farm work as a child had made him strong as an ox, and he trained hard to increase that strength. Psychologically he was intimidating too: “When you start winning, you give off this aura in the starting corral and the others are almost beaten already.” Going into the Innsbruck 1976 Olympics, Klammer had won 12 out of the last 14 World Cup downhill races, including consecutive wins on the toughest of them all, the Hahnenkamm in Kitzbühel, Austria. The expectation was enormous, but Klammer thrived on the pressure. “I never did very well in races that did not matter so much, but in the big races when there was a lot of pressure on me, that’s when I performed the best.” Klammer with fellow skier Bernhard Russi (right) Photo: Sports Illustrated Klammer’s starting draw of 15 was the worst possible – the world’s best 15 were selected at random for the early start numbers, on a track thatwas set to deteriorate with every racer because of warm weather conditions. The reigning Olympic champion Bernard Russi had set an impressive time from start number 3, and at first it didn’t look like Klammer would be able to better it. Too much air on the top jump cost him some time and he trailed the Swiss for much of the course. But he pulled out one of his signature full-carve turns on the last right-hand bend, and it was enough to see him overhaul Russi by .33 of a second and steal gold. It was and still remains the most iconic downhill run in skiing history, and it earned Klammer his nickname The Kaiser. The Austrian national hero became an instant worldwide star. “People identified themselves with me and my success. I won the Olympics for my own sake, but I also won it for Austria. Everybody admired me.” The level of adulation was extraordinary, but Klammer remained humble and never let it go to his head. The girl he later married was not won over by fame. “I met Eva on a beach in Tunisia in 1975. I was there with the Austrian ski team on a fitness camp, but she wasn’t into skiing and had never heard of me. Eva plays a big role in my life; she helps keep my feet on the ground and takes care of me.” Post Olympics, Klammer was flying high and the winning streak continued into the 1976/77 season – but after his third straight Hahnenkamm win, news broke that Klammer’s 16-year-old brother Klaus had crashed during a junior downhill race and been paralysed from the waist down. “I never thought that could happen in ski racing, it was a big shock to me.” Klammer went on to set up the Franz Klammer Foundation for seriously injured sportsmen. Despite the devastation of his brother’s injury, Klammer was still able to wrap up a fourth consecutive World Cup downhill title in 1978. Then, however, everything changed. Whatever triggered Klammer’s catastrophic loss of form, when it came it hit hard. Plummeting from unbeatable champion to also-ran, for three seasons Klammer failed to make the podium. “When I was winning I had so much confidence. When I lost it, I said, ‘Whoopla, this is a different world,’ and it took me quite a while to get out of it. “Lots of people tried to help – my wife, my family, my trainers, other racers – but there is only one person who can help you, and that’s yourself.” People identified themselves with me and my success Franz Klammer The constant speculation in the Austrian press as to the reasons behind their national icon’s troubles didn’t help – his marriage to Eva, Klaus’s injury and a move from Fischer to Kneissl skis were all blamed. The last straw came when Klammer was dropped from the Austrian team for the 1980 Olympics. Klammer celebrates victory at the 1976 Olympics Photo: Getty Images The results drought finally ended in December 1981, with a win in the Première Neige World Cup race in Val d’Isère. Such was the national relief that fellow Austrian Niki Lauda reportedly cried tears of joy. The pressure release of no longer being Olympic Champion and an enforced move to Blizzard after Kneissl went bust had certainly contributed. But there was new competition now – as well as the old rivalry between the Alpine nations, the arrival of Ken Read and Steve Podborski from Canada, nicknamed the Crazy Cannucks, made it truly international. At 30 years old, Klammer was considered a veteran, but he was still the man to beat when the course was tough and icy. He won the World Cup downhill title for a record fourth time in 1983, and Austria dared wonder, could the Kaiser win a second Olympic title in Sarajevo 1984? Just one month before the Sarajevo Olympics, Bill Johnson, a brash, loud American, started to distinguish himself on the racing circuit. A superb glider who loved the soft snow conditions typical of California, he won his first World Cup in Wengen in 1984, after nearly crashing off the course. Comparisons were quickly drawn with Klammer. There is only one person who can help you, and that's yourself Franz Klammer He was none too happy with the association and described Johnson in the press as a “nasenbohrer”, Austrian slang for “rookie”. The less flattering literal translation of “nose-picker” only served to fuel the controversy between the two. Fired up by the argument, the Klammer of old returned at the following downhill in Kitzbühel, resulting in what he describes as the finest victory of his career – a record fourth Hahenkamm win. “It was so special because I had not won there in seven years, but the old feeling was back – in the start hut it was just like at the 1976 Olympics. There was no doubt in my mind, I knew I would win, all I had to do was reach forward and attack the course.” The 1984 Olympics, three weeks later, did not go Klammer’s way. Sarajevo was covered in a blanket of new snow, and the powdery Bjelasnica course was just not tough enough for him to shine. The conditions suited Johnson better and he became the first American to win the Olympic downhill title. Klammer’s win in Kitzbühel proved to be the last of his career. The following season, at 32 years old, he decided to retire. “The morning of my last race, I had no idea that I was going to retire, but in the starting corral I looked about and thought, ‘This is not where I want to be anymore,’ so after the race I just walked away. I was happy to leave that way and I have never looked back.” Since retiring, Klammer has never been without job opportunities, promoting the region of Carinthia and Head skis; but he has also put his fame to good use as a United Nations ambassador. When Bill Johnson, aged 40, crashed after an ill-advised come-back in 2001, the Franz Klammer Foundation offered immediate support for the traumatic brain injury Johnson suffered. Now 61, Klammer enjoys golfing trips to Ireland and Scotland and organises a small cycling event in Carinthia known as the Tour de Franz, but his love of skiing remains. “When you’re on top of the mountain on a blue-sky powder day, nothing can beat that feeling.\" How ski racing works There are three main ski racing competitions: the Winter Olympic Games held every four years, the FIS Alpine World Championships held biennially and the World Cup, which takes place every season.The World Cup is made up of about 70 races each season, held across 25 countries. The overall winner is the skier with the most points at the end of the season. There are five race disciplines, each with its own sub-title to be won: downhill, giant slalom, slalom, super-G and combined (downhill and slalom). Although an Olympic medal is considered by many to be the biggest prize in sport, most ski racers consider a World Cup title to be a more satisfying prize – winning it confirms a skier’s claim as the best in the world that season. Telegraphtravel", "external_links": [], "published": "2015-10-19T23:37:00.000+03:00", "crawled": "2015-10-19T18:40:05.497+03:00", "highlightTitle": ""}