{"organizations": [], "uuid": "9fcf80a93f877664a82e7e5af457649eb1bf1c5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30215419/rocketrip-expands-partner-network-to-sharing-economy-and-travel-30-companies", "country": "US", "title": "Rocketrip Expands Partner Network to Sharing Economy and Travel 3.0 Companies", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Rocketrip Expands Partner Network to Sharing Economy and Travel 3.0 Companies - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9fcf80a93f877664a82e7e5af457649eb1bf1c5d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30215419/rocketrip-expands-partner-network-to-sharing-economy-and-travel-30-companies", "ord_in_thread": 0, "title": "Rocketrip Expands Partner Network to Sharing Economy and Travel 3.0 Companies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Rocketrip\nNEW YORK , Oct. 8, 2015 /PRNewswire/ -- Rocketrip , a platform that rewards employees for saving money on business travel, today expanded its partner network. All Rocketrip users can now redeem exclusive deals from HotelTonight, Breather, FoundersCard, LoungeBuddy, Uber, and more. By introducing perks from companies that reduce the costs of travel, and by rewarding travelers for using these cost-effective options, Rocketrip has become the de facto rewards platform for the sharing economy and travel 3.0 companies.\n\"When employees are rewarded for saving money on travel, they want to find services that will help them cut costs. Through our partner network, they can now find exclusive deals from companies that provide the best values and experiences in the industry,\" said Emily Hurd , Rocketrip's VP Business Development and Marketing. \"The more travelers use our partners' services, the more money they will save, and the more reward points they will accrue. Our customers and partners both win in that scenario.\"\nAfter signing its first partnership with Virgin America in September, Rocketrip sought out additional partnerships that focus on other areas of travel. From the Rocketrip dashboard, users can now click \"Get Perks\" to access the new deals from HotelTonight, Breather, FoundersCard, LoungeBuddy, Uber, and more. The perks include credits, discounts and free services.\n\"Rocketrip perks provides HotelTonight a great opportunity to help business travelers save time and money by booking a room from seven days in advance, all the way up to the last minute,\" said Amanda Richardson , vice president of Product at HotelTonight. \"By booking with HotelTonight, business travelers not only get a great value, but also a fantastic room at top-notch hotels across the globe.\"\nAbout Rocketrip\nRocketrip is the first commercially available travel management platform that rewards employees for saving money on business travel. Rocketrip's algorithms integrate a company's travel policy with real-time trip pricing and availability to create a personalized Budget to Beat for each trip. Employees book using their favorite travel websites or a travel management company, and they receive a percentage of the savings when they book under budget. Rocketrip also provides employers with insights and analytics on company spending, savings and employee travel behavior, giving them the ability to optimize their travel policy and rewards program.\nRocketrip is based in New York City and has received funding from Canaan Partners, Genacast Ventures, Crunchfund, Y Combinator and angel investors.\n releases/rocketrip-expands-partner-network-to-sharing-economy-and-travel-30-companies-300153253.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CG17432&Transmission_Id=201510080901PR_NEWS_USPR_____CG17432&DateId=20151008", "http://www.prnewswire.com/news-releases/rocketrip-expands-partner-network-to-sharing-economy-and-travel-30-companies-300153253.html", "http://www.xmlnews.org/ns/", "http://www.rocketrip.com/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T19:51:09.182+03:00", "highlightTitle": ""}