{"organizations": [], "uuid": "343440a4dc47f5686bbdb1d8c86ba7db438bb9da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/9e9d8ece0b95a32bcbadc95398cc8211", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/eight-airline-reward-myths-debunked/story-fn6yjmoc-1227552323142?from=public_rss", "country": "IL", "title": "Airline reward myths debunked", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Airline reward myths debunked", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T06:44:00.000+03:00", "replies_count": 0, "uuid": "343440a4dc47f5686bbdb1d8c86ba7db438bb9da"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/eight-airline-reward-myths-debunked/story-fn6yjmoc-1227552323142?from=public_rss", "ord_in_thread": 0, "title": "Airline reward myths debunked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE travel industry is full of misconceptions, and this is particularly true when it comes to the confusing world of frequent flyer points. \nHere are 8 things you need to know when it comes to airline miles and points. \n1. “Premium cabin fares are always significantly more expensive than economy fares.” \nEven though it’s logical to think that is the case, there are instances in which the difference in fare between economy class and premium cabin will be extremely small. Sometimes there will even be no difference at all. \nThis happens often when economy class is close to selling out or when you’re looking to travel on super peak dates, such as around the holidays. \nAnother instance where this is common is for travel within Southeast Asia, Africa and South America, where the difference between economy class and business class can often be around $70 or even less. \n2. “I will never be able to earn enough miles to be able to book an award.” \nIf you only travel once or twice a year, it will take you forever to be able to earn enough miles to be able to book an award. \nHowever, you can earn enough miles for a long-haul business class round trip with as few as two credit card sign-up bonuses. Not interested in travelling that far? Depending on the credit card, one might be enough. \n3. “Low-cost carriers are always cheaper.” \nThe fare will most likely be. However, when you add the checked baggage fee, the carry-on bag fee, the seat assignment fee, the toilet use fee (kidding, although I am sure some airlines would love to add such a fee) and whatever you have to pay for food, you might be shocked by what your reservation ends up costing. \nDo your research about add-on fees for the corresponding low-cost carrier before purchasing anything. \n4. “Airline miles are worthless because there’s never award availability.” \nThis is a common thought from those who know very little about miles and points. Some rewards currencies are worth more than others, but few are actually worthless, even if availability is not easy to find. \nIf you are having trouble finding the award availability you are looking for, there are numerous award booking services that can assist you. Don’t worry, those points are actually worth something. Source: Getty Images \n5. “You have to be rich to fly in premium cabins.” \nNo, you just have to be savvy about points and miles. As mentioned before, you can easily earn enough miles for a long-haul business class round trip with as few as two credit card sign-up bonuses. \nWhen you implement an intelligent credit card application strategy you can easily end up with more miles than you can actually redeem and, hence, splurge yourself with international business and first class travel which would otherwise be unattainable whenever you travel. \n6. “The best strategy is to earn all my miles/points with the same rewards program.” \nThis is a very common misconception even for those who are knowledgeable about points and miles. \nWhile you definitely don’t want to spread yourself out too much, diversifying your miles/points is extremely important if you want to come out ahead in this game. \nTwo rewards programs should be the minimum, and at least one of those programs should have a flexible rewards currency. \n7. “It only makes sense to redeem miles for long-haul travel.” \nGenerally, yes. However there are a few exceptions to this rule, so make sure to check out your airline’s rewards system. \n8. “Applying for numerous credit cards will destroy my credit score.” \nAs long as you pay your bills on time, have a low credit utilisation ratio and spread out your applications, your credit score is more likely to go up than to down by having numerous credit cards.", "external_links": [], "published": "2015-10-01T06:44:00.000+03:00", "crawled": "2015-10-01T07:03:52.120+03:00", "highlightTitle": ""}