{"organizations": [], "uuid": "3a0d8a2305cdc8cb43ce7c7c2407a6a7a671402d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30200011/musical-instrument-museum-to-host-special-exhibition-stradivarius-origins-and-legacy-of-the-greatest-violin-maker-opening-jan-16", "country": "US", "title": "Musical Instrument Museum to Host Special Exhibition \"Stradivarius: Origins and Legacy of the Greatest Violin Maker\" Opening Jan. 16", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Musical Instrument Museum to Host Special Exhibition \"Stradivarius: Origins and Legacy of the Greatest Violin Maker\" Opening Jan. 16 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a0d8a2305cdc8cb43ce7c7c2407a6a7a671402d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30200011/musical-instrument-museum-to-host-special-exhibition-stradivarius-origins-and-legacy-of-the-greatest-violin-maker-opening-jan-16", "ord_in_thread": 0, "title": "Musical Instrument Museum to Host Special Exhibition \"Stradivarius: Origins and Legacy of the Greatest Violin Maker\" Opening Jan. 16", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Musical Instrument Museum\nPhoenix Museum Will Welcome Treasures from the Master Violin Makers of Cremona, Italy\nPHOENIX , Oct. 6, 2015 /PRNewswire-USNewswire/ -- This January the Musical Instrument Museum (MIM) in Phoenix celebrates the violin. The internationally beloved instrument will be the star of a new exhibition that showcases 10 exceptional historic and modern examples from the string family, including a 1728 Stradivarius violin on public display for the first time in the United States .\nOpening Jan. 16, 2016 , \"Stradivarius: Origins and Legacy of the Greatest Violin Maker\" introduces the story of how early violin makers from the modest Italian city of Cremona shaped global music from the 16th century onward. MIM will explore how the workshops of the Amati, Guarneri and Stradivari families produced and perfected the look and sound of instruments in the string family. The exhibition will show why their legacy continues to inspire instrument makers and audiences today. Guests will hear and see the instruments on display through audio and video technology and will experience the violin as never before.\nMIM is the only location in the world hosting this one-of-a-kind exhibition. It will feature five historic instruments made from the 16th to the early 19th century by the so-called masters of Cremonese violin making. Additionally, five award-winning modern instruments from European and American makers represent the ongoing legacy of the Cremonese violin-making method. Highlights include:\nThe \"Carlo IX\" violin, ca. 1566, by Andrea Amati – Andrea Amati is often referred to as the founding father of the violin. This is one of only around 20 of his instruments known to survive. This particular violin was made for King Charles IX of France , son of the powerful Catherine de ' Medici. The \"Artôt-Alard\" violin, ca. 1728, by Antonio Stradivari – As the most widely imitated violin maker, Stradivari arguably has the most familiar name among all instrument makers. The deep color tones and refined craftsmanship of this instrument represent the late-period work of this master. The \"Prince Doria\" violin, ca. 1734, by Bartolomeo Giuseppe Guarneri \"del Gesù\" – Approximately 200 instruments by the maker known as \"del Gesù\" are known to survive. They are prized by musicians the world over and often fetch equal or higher prices on the auction block as those of Stradivari. In addition to instruments, the exhibition will feature a selection of tools and designs from the workshop of Antonio Stradivari. These precious artifacts are rarely on display outside of Cremona.\n\"Stradivarius: Origins and Legacy of the Greatest Violin Maker\" is a collaboration between MIM and two Cremona-based institutions, the Museo del Violino and the Friends of Stradivari .\n\"The name Stradivarius has, for good reasons, become synonymous with 'the best' in many contexts. This exhibition will give insight into the man and his world, including the master craftsmen who influenced him and his continued importance to modern violin makers and musicians,\" said Kathleen Wiens , PhD, MIM's curator for Europe . \"The story of Stradivari has something for everyone, such as those with interests in music, design, craftsmanship, natural resources, science, lawsuits and fraud, or even the fascinating history of European royalty. Stradivarius is the ultimate human interest story.\"\nSimilar to exhibits in MIM's permanent galleries, \"Stradivarius: Origins and Legacy of the Greatest Violin Maker\" will include high-quality audiovisual content, such as musical performances from the concert stage, science experiments in progress and interviews that explore the unique nature of the musician-instrument relationship.\nThe exhibition, which will be on display in MIM's Target Gallery, runs from Jan. 16, 2016 , through June 5, 2016 . Information about supplemental programing, including special events, concerts at the MIM Music Theater and educational opportunities, will be announced in the coming months.\nAdmission\n$10 for \"Stradivarius: Origins and Legacy of the Greatest Violin Maker\" exhibition only\n$7 when purchased with general museum admission\nThe Musical Instrument Museum is located at 4725 E. Mayo Boulevard in Phoenix (corner of Tatum and Mayo Boulevards, just south of Loop 101). For general museum information and a full schedule of events, visit MIM.org or call 480.478.6000.\nAbout MIM\nThe Musical Instrument Museum (MIM) enriches the world by collecting, preserving and making accessible a wide variety of musical instruments and performance videos from every country in the world. MIM offers guests a welcoming and fun experience, incomparable interactive technology, dynamic programming and exceptional musical performances. MIM also fosters appreciation of diverse cultures around the globe by showing that we all innovate, adapt and learn from each other to create music-the language of the soul.\n releases/musical-instrument-museum-to-host-special-exhibition-stradivarius-origins-and-legacy-of-the-greatest-violin-maker-opening-jan-16-300155166.html\n ", "external_links": ["http://www.mim.org/", "http://www.xmlnews.org/ns/", "http://www.museodelviolino.org/en/", "http://www.friendsofstradivari.it/home-en/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC21473&Transmission_Id=201510061515PR_NEWS_USPR_____DC21473&DateId=20151006", "http://www.prnewswire.com/news-releases/musical-instrument-museum-to-host-special-exhibition-stradivarius-origins-and-legacy-of-the-greatest-violin-maker-opening-jan-16-300155166.html"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T23:54:38.222+03:00", "highlightTitle": ""}