{"organizations": [], "uuid": "4208bcd695079e479c2fce4dfa78feca02bed805", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/10/20/12/0D47C17E00000578-0-image-a-13_1445342165851.jpg", "site_section": "http://www.dailymail.co.uk/travel/articles.rss", "section_title": "Travel Articles | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3280711/The-things-didn-t-know-ask-plane-definitely-shouldn-t-request.html", "country": "GB", "title": "The things you didn't know you could ask for on a plane", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 3, "title_full": "The things you didn't know you could ask for on a plane | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:28:00.000+03:00", "replies_count": 2, "uuid": "4208bcd695079e479c2fce4dfa78feca02bed805"}, "author": "Naomi Leach For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3280711/The-things-didn-t-know-ask-plane-definitely-shouldn-t-request.html", "ord_in_thread": 0, "title": "The things you didn't know you could ask for on a plane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1\nView\ncomments\nFlying can test the patience of even the calmest passenger\nBut as the frustration levels caused by a screaming baby, drunken stag do and a seat reclining on to your lap begins to rise, did you know there are hidden perks airlines offer to enhance your journey?\nRather than sitting (and seething) in silence, MailOnline Travel rounds up the things you didn't know you could ask for on a plane, as well as the things you definitely shouldn't request.\nBasic medicine and bandages\nMost airlines are equipped with basic medicine and bandages to help you with any sudden health problems\nIf your ticket gave you a paper cut or you have a throbbing migraine it's best to ask if the cabin crew can help.\nMost air stewards will be happy to dig out a plaster to stop you bleeding all over the upholstery.\n Next From mesmerising golden domes to halls with kaleidoscopic... A mini Roman Holiday: How to see the Eternal City in a day,... 'We do have quite a well stocked first aid kit although we're not a pharmacy so don't be asking us for paracetamol just to try and cure your hangover,' Dan Air from Confessions of a Trolley Dolly told MailOnline Travel.\nTo move seats\nAlways be polite: If you ask rather than just moving, an air steward will help you to find a new, available seat\nJust ask politely and most cabin crew will try to help you.\n'Don't just move or we will probably make you move back.\n'We will bend over backwards for you and sort out any 'reasonable' requests, if you are polite and friendly to us,' said Dan Air.\nSeconds and snacks\nPlease sir can I have some more? On board a well stocked service don't be afraid to ask for seconds\nAs long it's not a budget carrier where you have to buy your meals, on a well stocked full service airline, cabin crew will be more than happy to offer you seconds or extra snacks on a long journey.\nHowever, asking for leftovers from First Class isn't likely to be greeted warmly\n'To be honest all the good things to ask for such as upgrades or amenity kits from first class or food doesn't happen as much anymore because it's just not possible for us to do it. Airlines have really cut back with the amount they load onboard anyway so we have very little spare.'\nBA in Club (business) has a kitchen in the galley called the ‘Club Kitchen’ which offers treats , snacks and drinks all the way through the flight so passengers can creep in and help themselves if they want a midnight snack.\nKids' entertainment and temporary babysitting\nGulf Air offers a free Sky Nanny service arranging convenient dining times for the children to leave you free to enjoy your own meals. They're also onboard to reassure nervous young flyers of landing procedures and ease ear pressure.\nMost other airlines will also temporarily look after your child for you if you need to stretch your legs or use the facilities.\nEmirates have a ‘Fly with Me Monsters’ initiative offering free blankets for young travellers and a special rucksack - complete with a Fly With Me Monster magazine filled with puzzles, cartoons and colouring in – so they can take them with them on their onward journey.\nBritish Airways also provides a Skyflyer puzzle and entertainment pack for children.\nA birthday cake\nWith a little notice, Emirates airline offer passengers a free cake to celebrate any special occasions\nIf a passenger is celebrating a special occasion Emirates flight they can pre-order a cake from the in flight concierge team who can make it themed with birthday, wedding anniversary, welcome, congratulations, honeymoon or a bon voyage decorations.\nThese celebration cakes are provided complimentary and can be ordered at the time of booking or a minimum of 24 hours before departure.\nA will\nAccording to Wander Luxe your pilot is qualified to write you a will, should the necessity arise.\nSanitising wipes\nAircrafts are notoriously filthy, carrying a host of international germs from fellow passengers despite thorough cleaning, so if you'd like to perform your own personal clean up of your arm rests and tray table just ask for wipes.This hidden perk was revealed by Smarter Travel in 2013.\nCockpit Tours\nContrary to what many believe, passengers can still ask for a cockpit tour while the plane is on the ground\nThe days of being able to see the cockpit are not in fact over.\nWith British Airways, before or after flights you can ask if the crew and pilots have time to show you around.\nThe end of the flight is usually better as the team will be less busy.\nHairbrush and travel adaptors\nForgotten something? Just ask for a range of toiletries on board to enjoy some inflight grooming\nPassengers often forget their hair brushes, razors, moisturisers, mouthwash and adaptors.\nOn board Singapore Airlines aircrafts crew are happy to provide these forgotten items so you can enjoy mid-air grooming, reports Stylist .\nPlaying cards\nBored beyond belief and modern technology not cutting it? Singapore Airlines has playing cards, collectible postcards and other classic entertainment on board, according to Stylist.\nChocolate\nThe Swiss are rightly proud of their chocolate which is given out on SwissAir. Fancy a bit extra? If you ask you may just be given more, according to Stylist.\nWater bottle refills\nIf you like to keep hydrated during your flight don't be too timid to ask for water bottle refills. Cabin crews are happy to keep refiling your bottle.\nThe whole can\nThirsty? Just because an air steward has poured a drink out for you into a convenient small cup doesn't mean you can't ask to have the whole drink, Smarter Travel revealed in 2013.\nTravel tips and advice\nAs cabin crew are often well travelled they might be able to help you unpick your itinerary and recommend highlights. For instance a BA crew reveal that if a Brit goes to New York and shows their passport in some of the big stores, they can get a discount.\nAND WHAT NOT TO ASK FOR... Just a glass of ice\n'We will immediately know that you have brought your own alcohol onboard and will be watching you like a hawk ready to take that litre of vodka or whiskey off you and keep it until the end of the flight, Dan Air from Confessions of a Trolleydolley told MailOnline Travel.\nTo turn around if you've forgotten something\n'Don't ask us if we can go back because you've left something in the terminal, or you've left something at home, or you've left the iron on. We can't turn a 747 round just for you,'adds Dan.\nDon't ask if we can call you a taxi during descent\n'Can you point out the equator (insert other landmarks here) when we fly over it?'\nDon't ask if we can do anything about the delay if it's weather related or a technical issu e with the aircraft\n'No I can't clear the fog or stop the snow and I would much rather the aircraft be broken on the ground than at 35,000 feet.'\nDon't ask where we keep our parachutes\n'As much as I would love to eject myself from the aircraft to escape daft questions like these on a daily basis sadly we don't have parachutes.'\nRead more: Confessions of a Trolley Dolly | Take a peek behind the galley curtain for all your cabin crew and aviation news, gossip and hilarious tales of life as a trolley dolly as we attempt to bring the glamour back to 39,000 feet! Confessions of a Trolley Dolly | Take a peek behind the galley curtain for all your cabin crew and aviation news, gossip and hilarious tales of life as a trolley dolly as we attempt to bring the glamour back to 39,000 feet! The free perks you didn't know about for long-haul economy flights | Stylist Magazine The Truth About Flying: What Airlines Don't Tell You 10 Things You Didn't Know You Could Ask for on a Plane - SmarterTravel.com", "external_links": ["http://dailym.ai/1MB9KGc", "http://www.stylist.co.uk/travel/how-to-make-your-long-haul-flight-a-bit-more-pleasant-for-free-weve-compiled-ten-of-the-top-airlines-hidden-perks", "http://www.smartertravel.com/photo-galleries/editorial/10-things-you-didnt-know-you-could-ask-for-on-a-plane.html?id=427", "http://confessionsofatrolleydolly.com/", "http://wanderluxe.theluxenomad.com/the-truth-about-flying-airlines-tell/", "http://www.confessionsofatrolleydolly.com/"], "published": "2015-10-20T20:28:00.000+03:00", "crawled": "2015-10-20T16:15:43.570+03:00", "highlightTitle": ""}