{"organizations": ["OMVS", "Inc.", "Inc", "Amazon"], "uuid": "ee12195618d427db3b3242bbe6c247abc51af2d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_2_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13320998/1/omvs-forecast-predicts-courier-services-to-be-fastest-growing-shared-economy-segment.html?cm_ven=RSSFeed", "country": "US", "title": "OMVS: Forecast Predicts Courier Services To Be Fastest Growing Shared Economy Segment", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "OMVS: Forecast Predicts Courier Services To Be Fastest Growing Shared Economy Segment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:00:00.000+03:00", "replies_count": 0, "uuid": "ee12195618d427db3b3242bbe6c247abc51af2d1"}, "author": "", "url": "http://www.thestreet.com/story/13320998/1/omvs-forecast-predicts-courier-services-to-be-fastest-growing-shared-economy-segment.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "OMVS: Forecast Predicts Courier Services To Be Fastest Growing Shared Economy Segment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert Wilson"], "text": "Reprint One noted technology website foresees five types of on-demand services set to shortly explode and the one expected to grow fastest is same-day, shared economy couriers - a business now under development by On the Move Systems ( OMVS ). The website VentureBeat predicts shared economy courier services will enjoy robust times ahead because retailers are feeling intense pressure from Amazon to offer fast delivery to online customers. Sticking to traditional delivery methods risks not only losing customers to competitors, but threatens business viability as well. \"Companies like Amazon have not only changed retail, but the delivery industry as well,\" said OMVS CEO Robert Wilson. \"Now retailers and couriers must be flexible and nimble - able to change and adapt at a moments' notice. Customers no longer want to wait. With our shared economy business model, we'll be able to respond quickly to market demands, and do it at a competitive price. This article shows our plans are pointed in the right direction for ultimate success.\" Economists have previously speculated the shared economy represents a $450 million total market , but that figure may be obsolete as the market continues to grow with more and more varied on-demand services popping up . Some are predicting the shared economy's total market value will double in coming months, particularly as the concept has been well embraced by the so-called Millennial generation, who are now entering the marketplace in force. For more information on OMVS, please visit www.onthemovesystems.com . About On the Move Systems, Inc. On the Move Systems, Inc. (OMVS) is focused on the development of cutting-edge technology across a broad spectrum of industries. The company is currently exploring new online tools to reduce costs and increase convenience in the tourism and travel industry and exploring new opportunities in trucking. For more information, please visit our website at www.onthemovesystems.com . Notice Regarding Forward-Looking Statements Safe Harbor Statement under the Private Securities Litigation Reform Act of 1995: This news release contains forward-looking information within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements that include the words \"believes,\"\"expects,\"\"anticipates\" or similar expressions. Such forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause the actual results, performance or achievements of the company to differ materially from those expressed or implied by such forward-looking statements. In addition, description of anyone's past success, either financial or strategic, is no guarantee of future success. This news release speaks as of the date first set forth above and the company assumes no responsibility to update the information included herein for events occurring after the date hereof. 1 of 2", "external_links": [], "published": "2015-10-13T12:00:00.000+03:00", "crawled": "2015-10-13T12:38:15.772+03:00", "highlightTitle": ""}