{"organizations": [], "uuid": "85b294ce61907d4a5c197eae0cd619de5c966931", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/family-holiday-insurance-faqs.html", "country": "US", "title": "Family Holiday Insurance - FAQs", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Family Holiday Insurance - FAQs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T09:53:00.000+03:00", "replies_count": 0, "uuid": "85b294ce61907d4a5c197eae0cd619de5c966931"}, "author": "Lisa Jeeves-2015-10-01T07:53:55-0400", "url": "http://www.articlesfactory.com/articles/travel/family-holiday-insurance-faqs.html", "ord_in_thread": 0, "title": "Family Holiday Insurance - FAQs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | October 1, 2015 \nThe subject of family holiday insurance continues to generate questions. Here, some of the more common FAQs are answered. \nFamily holiday insurance isn’t something that you should consider taking chances with. It should be a vital component to build into the costs and planning of any trip away from home. \nHowever, it is certainly a minefield when it comes to understanding. Here some common FAQs are answered. \nHow can I save money on my cover? \nYou may have a number of options here, but by far the most important is to shop around carefully for your family holiday insurance. Be clear though: this isn’t just about finding the cheapest policy you can. It is about taking the time to look carefully at what is being offered, how much you are going to pay for it, and what options you might have for keeping your costs down by accepting reduced cover in certain areas (for example).In other words, take the time to look and think about the policy you are considering and compare it to others. \nWhat about package holidays that include insurance? \nIt’s probably true to say that there is an obvious attraction here in terms of one-stop shopping. However, you should offset your considerations of the benefits of that by considering whether or not a specialist provider of family holiday insurance might actually be able to offer you better cover at a more attractive price than something tacked onto the end of a holiday quotation. Yet again, read before you leap! \nWill I be able to get cover for elderly relatives? \nAlmost certainly yes, although you may be asked to pay a slightly higher premium and your policy might also exclude certain risks for the very elderly. \nWhy would I need holiday insurance if I am only travelling to a UK destination? \nIt's just as easy to have your luggage stolen or need to stay in a hotel in order to keep a family member company should they be hospitalised whether at home or abroad. There are, in fact, many reasons why family holiday insurance should be considered even on domestic holidays. \nCan I get ‘go anywhere I wish’ cover? \nIn principle, yes. Some providers may offer monthly or even annual cover that is, broadly speaking, valid for any destination. It is worth noting, though, that some policies may exclude certain countries perceived to be too dangerous to visit, or restrict their cover to countries that are not on the government’s travel advisory warning list. \nWill I be able to participate in white-knuckle sports? \nYou will need to ask your policy provider a specific question about your individual sport.Some policies may exclude named sports or pastimes, while others may be willing to cover them subject of the payment of an additional premium. This area can vary considerably between insurers. \nWhat would I need to support a claim for the theft of a valuable watch? \nIndividual insurance providers will have different claims procedures. Typically, you will be expected to provide a crime report from the local police showing that you reported the crime to them. You might also be asked to make available a copy of your original purchase receipt showing the full purchase price of the watch concerned. It is worth noting that some policies may have a specified maximum individual item limit in terms of cover. Of course, the above basic principles would apply to any claim for the theft of a valuable object under family holiday insurance cover and not just watches. \nWhile there are many questions that arise from the purchase of holiday insurance, a good provider will be more than happy to answer them should you wish to gain clarification beyond these FAQs.   \nPatrick Chong is the Managing Director of Insuremore. We provide low cost travel insurance and offer a range of policies including family holiday insurance , annual, multi-trip and single-trip insurance. For all your travel cover needs, Insuremore can help you in the quickest and most cost-efficient way.", "external_links": [], "published": "2015-10-01T09:53:00.000+03:00", "crawled": "2015-10-03T06:02:08.621+03:00", "highlightTitle": ""}