{"organizations": ["Lane", "Xintiandi North Block", "North Block", "House", "Inc.", "Shanghai Trio", "Shanghai Tang"], "uuid": "f74b0d5624b120574ea598b04d745ce44b3a9a66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gochina.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/480298179.jpg", "site_section": "http://z.about.com/6/o/m/gochina_t2.xml", "section_title": "About.com China Travel: What's Hot Now", "url": "http://gochina.about.com/od/shoppinginshanghai/tp/SH_BestShops.htm", "country": "US", "title": "Best of Shanghai's Unique Shops", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Best of Shanghai's Unique Shops", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:08:00.000+03:00", "replies_count": 0, "uuid": "f74b0d5624b120574ea598b04d745ce44b3a9a66"}, "author": "", "url": "http://gochina.about.com/od/shoppinginshanghai/tp/SH_BestShops.htm", "ord_in_thread": 0, "title": "Best of Shanghai's Unique Shops", "locations": ["Julu Road", "Taicang Road", "Fumin Road", "Huai Hai Middle Road", "Shanghai", "Huai Hai Zhong Road", "Taikang Road", "Pudong", "Xintiandi", "Tai Cang Road", "About.com", "Changle Road", "Mao Ming Road", "Wukang Road", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mao", "Sara Naumann", "Lane", "Miao"], "text": "Description : Hand-embroidered clothing and soft-furnishings by Miao tribeswomen. Address : Room 118, No. 3, Lane 210 Taikang Road Opening hours : daily 9am-6pm Comments : The Miao tribe is famous for their intricate embroidery and hand-crafted silver ornaments that decorate their traditional dress - clothing that may take a woman many years to complete. The store helps support the ancient tradition; you'll likely see a few of the beautiful long-haired Miao women busily embroidering as you browse their collection. Madame Mao's storefront. © 2007 Sara Naumann, licensed to About.com, Inc. 3. Madame Mao's Dowry Description : Everything Mao (memorabilia) as well as porcelain, clothing and soft furnishings. Address : 207 Fumin Road, near Julu Road Comments : These days Madame Mao does a lot more clothing. Sizes are teeny tiny so keep that in mind. She's still got all kinds of fun curios and you can find my favorite Paper Tiger wrapping items there. Dig through piles of black & white photography of China's past, Cultural Revolution propaganda posters and original note cards made with old Chinese ads. There's a line of revolutionary-inspired enamelware with modern slogans that might make your kitchen table rather unique. © Photo courtesy of Platane, Shanghai. 4. Platane Description : Funky collection of Chinese-inspired gifts and modern soft furnishings. Address : 2 locations: 156 Taikang Road | 田子坊泰康路156号（近似南路）; smaller store 439 Wukang Road near Huai Hai Middle Road | 武康路439号, 近淮海中路 Opening hours : Open Tue-Sat: 11am-7pm; Sun: 12-7pm Comments : Platane offers original, hard to find, casual Chinese-inspired porcelain, fun girlie gifts such as hand-made small bags as well as gorgeous leather Australian handbags, Luxe guides and one-of-a-kind home accents. 5. Shanghai Tang Description : Luxurious and fabulous collection of Chinese-inspired clothing, home accessories and gifts. Address : 1) 59 Mao Ming Road (between Huai Hai Zhong Road and Changle Road); 2) 15 Xintiandi North Block, Lane 181 Tai Cang Road; 3) Shangri-La Hotel, 33 Fu Cheng Road, Pudong. Opening hours : daily 10am-10pm Comments : With bargains to be found at so many shops and markets, it's difficult to stomach the price tags at Shanghai Tang. That said, you won't find more beautiful designs, quality gifts and darling kids' things. If there's a special gift you need to bring home from Shanghai, Shanghai Tang is worth a stop. Shanghai Trio Logo. Shanghai Trio logo owned by Shanghai Trio. All rights reserved. 6. Shanghai Trio Description : A small silk bag for every need. Address : 1) Unit 5, House 1, North Block, Xintiandi, Lane 181 Taicang Road; 2) Workshop/Showroom at No. 6, Lane 37 Fuxing Xi Road Opening hours : 1) daily 10am-10pm; 2) M-F 10am-6pm Comments : A perfect spot to pick up last minute gifts, Shanghai Trio's designs use traditional cotton and silk fabrics for the modern need such as a cell-phone case or jewelry bag. There's also an adorable line of children's things and funky jewelry.", "external_links": [], "published": "2015-10-22T14:08:00.000+03:00", "crawled": "2015-10-23T09:37:31.416+03:00", "highlightTitle": ""}