{"organizations": [], "uuid": "6a2e1ac899044587c78e6b19f37ae68508191eeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03472/Alan-Sugar-94_3472509k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-14.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/finance/enterprise/11930889/How-wealthy-is-Lord-Sugar-A-billionaire-thanks-to-clever-property-investments.html", "country": "US", "title": "How wealthy is Lord Sugar? A billionaire, thanks to clever property investments", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "How wealthy is Lord Sugar? A billionaire, thanks to clever property investments - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T02:00:00.000+03:00", "replies_count": 1, "uuid": "6a2e1ac899044587c78e6b19f37ae68508191eeb"}, "author": "Elizabeth Anderson", "url": "http://www.telegraph.co.uk/finance/enterprise/11930889/How-wealthy-is-Lord-Sugar-A-billionaire-thanks-to-clever-property-investments.html", "ord_in_thread": 0, "title": "How wealthy is Lord Sugar? A billionaire, thanks to clever property investments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lord Sugar famously started his entrepreneurial career shifting aerials and electrical goods from the back of a van. Nowadays the tycoon and presenter of The Apprentice, which returns to TV tonight , does most of his wheeling and dealing in the property market, offloading commercial buildings for profits in the region of tens of millions of pounds. Current estimates put his wealth at £1.4bn, making him a billionaire for the first time and ranking him 101st among the UK’s mega-rich in the Sunday Times Rich List 2015 . His personal fortune is higher than the Queen's but lower than Richard Branson's. Lord Sugar started out as a tech entrepreneur, but most of his fortune has been accumulated from clever property investments through his company, Amsprop. Amsprop has a substantial commercial property portfolio across London and Essex. Daniel Sugar, Lord Sugar's son, who is managing director of Amsprop Estates, recently said the company is \"sitting on a major cash pile\" and intends to spend millions of pounds in the coming years purchasing prime London offices and shops. Last month, Amsprop sold the Sugar Building - a 40,000 sq ft office development near St Pauls - for £80m, landing the company a £50m profit. Earlier this year, the firm sold Burberry’s old flagship store on London’s Haymarket for £65m to a Qatari investor, more than double the £31.5m it paid in 2013. Amsprop also owns a number of plush residential apartments in Mayfair, including five apartments in Bennett House, a development just round the corner from the Ritz, where flats in the building could sell for between £7m and £10m each. Lord Sugar now apparently advises other aspiring entrepreneurs to \"do business for fun\" and to make real money by investing in property . Alan Sugar poses with Amstrad equipment in 1984 Photo: Telegraph Lord Sugar's rise is one of the UK’s most well-known rags to riches stories. Alan Sugar grew up on an East End housing estate in the 1950s, the youngest of four children. His father, who worked as a tailor, had to feed the family on £13 a week. Families in 1950s poverty-stricken Hackney would struggle to find a shilling for the electric meter, Lord Sugar recently said, when questioning whether “poor\" people today with mobile phones, microwave ovens and large TVs truly understood the meaning of poverty. He left school at 16 and, after a brief spell in the civil service, started a business aged 21 selling electrical knick-knacks from a van. In 1968, he launched Amstrad - Alan Michael Sugar Trading – which sold products including cigarette lighters, aerials, car radios and hi-fi systems. Amstrad was once a market leader but failed to keep ahead of competition Photo: Phil Coburn By the 1980s, the company was among the market leaders in consumer electronics. Amstrad launched its version of the home computer in 1984 at the height of the British microcomputer boom, selling the benefits of a word processor for everyone from students to companies. The company floated on the Stock Exchange soon after, and at one point in 1986 its value soared to £1.2bn. Lord Sugar - then around 40 years old - was worth about £600m. But the stock market crash of 1987 wiped millions off Amstrad's value. Tottenham Hotspur fans call for the chairman of the football team, Alan Sugar, to resign before a match against Liverpool in 2000 Photo: Reuters A series of unsuccessful product launches followed, including the Amstrad GX4000 games console that struggled to compete with Nintendo and Sega, and a combined telephone and email device called the e-m@iler that failed to win over the British public. \"I’m not an actual boffin. I don’t understand the intricacies of the software and electronics...but where I had some success was in getting them to apply their skills in a commercial way, using the principles I’d learned working on market stalls as a boy,\" he later admitted in his autobiography. • The Apprentice 2015: Meet the candidates Lord Sugar also had a troubled stint as chairman of Tottenham football club in the 1990s. His relationship with Spurs fans soured after he sacked manager Terry Venables, and he sold his shares in the club in 2001. Alan Sugar unveils his new Amstrad 'e-m@iler plus', an e-mail-enabled home phone, in 2002 Photo: EPA Amstrad, which had moved into designing and developing set-top boxes, was sold to BSkyB in 2007 for £125m. On selling the company for a fraction of its former value, Lord Sugar told a BBC documentary in 2009: \"I'm realistic. I mean what can you do? You can't keep crying in your beer.\"", "external_links": [], "published": "2015-10-15T02:00:00.000+03:00", "crawled": "2015-10-15T02:17:16.956+03:00", "highlightTitle": ""}