{"organizations": [], "uuid": "a479ec8497e6a2924791ed3cd296b8d1cc0ef0f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bootsnall.com", "main_image": "", "site_section": "http://feeds.bootsnall.com/bna/articles/", "section_title": "BootsnAll Travel Articles", "url": "http://www.bootsnall.com/articles/15-10/worldwide-wellness-finding-rejuvenation-on-the-road.html", "country": "US", "title": "Worldwide Wellness: Finding Rejuvenation on the Road", "performance_score": 0, "site": "bootsnall.com", "participants_count": 1, "title_full": "Worldwide Wellness: Finding Rejuvenation on the Road", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T11:03:00.000+03:00", "replies_count": 0, "uuid": "a479ec8497e6a2924791ed3cd296b8d1cc0ef0f6"}, "author": "admin", "url": "http://www.bootsnall.com/articles/15-10/worldwide-wellness-finding-rejuvenation-on-the-road.html", "ord_in_thread": 0, "title": "Worldwide Wellness: Finding Rejuvenation on the Road", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Worldwide Wellness: Finding Rejuvenation on the Road By Vickie Lillo on October 21st, 2015 Wellness vacationing has only recently become a fashionable trend, but my husband, teenage son, and I have been going on ‘wellness’ holidays for the last ten years or so. For most travelers, ‘wellness’ means a week of pampered solitude in a pricey off-the-beaten path luxury spa resort.\nAnd it’s true – that is a fabulous haven for unwinding and finding your personal Zen. But that’s just the tip of the iceberg. Any destination offering daily fitness, healthful eating, anxiety-free relaxation, spiritual cleansing, and/or adrenaline-pumping excitement can be considered a wellness retreat. “As long as you are on the path to improving your mental and physical health… that’s a ‘wellness’ break.” Melt into a hammock for a week-end, shifting your focus away from the stress at the office; instead, savor the time spent with your family. Go biking and hiking and canoeing in a remote wilderness and end each evening curled up in front of a roaring fire with a good book.\nLeave all the greasy, fried foods at home; opt for nutty snacks, ripe-off-the-vine vegetables from roadside markets and strange, unfamiliar fruits. Maybe even vow to taste vegan tofu. \nAs long as you are on the path to improving your mental and physical health, even if only for a few days at a time, that’s a ‘wellness’ break. And those sanctuaries of pleasure and adventure can be found anywhere, and everywhere, around the globe. Need help with your route planning? Iceland Reykjavík and beyond: Delight in nature’s purity, from the unpolluted air…to the organic food and the glacier-fed bottled water…to the thermic heat, borne of the island’s volcanic core, that warms every Icelandic home for pennies. \nThis year, for spring break, instead of taking a tropical island vacation to sizzle in the sun like a strip of frying bacon, my family and I go for a therapeutic simmer in the milky, turquoise waters of the Blue Lagoon. \nRather than slathering on the baby oil for that golden, baked-to-a-crisp tan, I scrub my face and body with naturally-softening silica mud. I smear it on thick and let it coagulate – like cement – for ten minutes. Afterwards, my skin feels supple as a baby’s behind. This evening, I dine on free-roaming lamb while my husband Gustavo and son Nicolas opt for fish plucked right from the sea. We down pure glacial water with our meal, topped off with a vodka martini made from that same nature-made H2O. “I scrub my face and body with naturally-softening silica mud… Afterwards, my skin feels supple as a baby’s behind.” While our friends are flopping on a chaise lounge at the beach, under a scorching sun, we are relaxing with the Icelanders in one of the many thermal swimming pools in Reykjavík, joining in the local gossip. As for sand and ocean waves… we stroll across the black grains at Vik and watch North Atlantic breakers crash into the shore.\nPlus, we’re able to witness the power of Mother Earth at Strokkur, the famed geyser, and the thundering waterfall at Gullfoss. For adrenaline-pumping adventure, we can barely decide between snowmobiling at Vatnjaküll or glacier trekking with crampons at Sólheimajaküll . Motorized excitement wins out. Besides, tomorrow we’ll be tramping through alternating fields of solidified lava beds and mossy-green meadows on the backs of hardy Icelandic horses, whose lineage has been unbroken since the arrival of Norse settlers in the 9 th and 10 th centuries. \nWe return home rejuvenated in spirit, cultured in both art and maritime history, and full of that pure, shameless Viking pride. Aside from all the other quaint souvenir trinkets, I have a shiny golden buccaneer’s cap with blond braids (for princesses) hanging from our bedpost… in case I want to be a Scandinavian pirate warrior like my man. Cali to Tayrona Natural National Park Follow nature’s ‘fitness’ routine. \nAs the travel planner for my family, I strive for the ‘active’, and adventurous, vacation lifestyle. That means I try to incorporate as much well-being and fitness into our daily itinerary as possible. Exploring northern Colombia is the perfect way to maintain our vim and vigor, while enjoying a newfound, and colorful, culture. \nWe won’t need Zumba classes here. Cali is the official salsa capital of the world. We learn to blend African and European rhythms with the ‘spicy’ Spanish music that originated in the Latin countries of the Caribbean. The best part? Getting my husband out of his chair and working up a lather together, trying to master a few basic steps of this sensual dance. “Cali is the official salsa capital of the world.” Once we get to Cartagena, we find no need for cardio work-outs or spinning classes either. Instead, we canter at a brisk pace along the sidewalks from our hostel in Bocagrande to the city center – a two-mile jaunt – and follow it with an hour of sightseeing, on bicycles, inside the walled castle of San Felipe de Barajas.\nThe next morning, we leave the fortress, cruising 30 minutes down the coastal autopista next to the ocean before heading inland for another thirty; soon, we arrive at an anthill-shaped volcano, Volcán de Lodo el Totumo. No need for that moisturizing herbal wrap or a softening sugar glow here. Not with the opportunity for a full-body mud bath. \nStripped down to bathing suits and skivvies, the three of us slowly descend down a wooden ladder, into the pit. Into the nutrient-rich muck where we wallow for half-an-hour. After a thorough dousing and scrubbing by the local colombiana women in the lake at the bottom of the hill, we pull on our clothes, jump back in our rental car and drive in the direction of Tayrona National Natural Park . \nWith well-maintained trails through rainforest thickets, rock, and unforgiving sand (I can vouch for that mid-calf burn), hiking inside this gorgeous national park is plenty strenuous…no need for a Stairmaster here. Sweat pours down our faces and glistens atop the hair on our arms – this is Mother Nature’s own steam room, drawing out those toxins from our pores. At day’s end, Gustavo, Nicolas and I fall asleep to the caress of the Caribbean Sea, just outside our screened-in room at Barlovento . Rocking us into a deep, meditative slumber. Colorado – Pagosa Springs Resort in Pagosa Soak away your ailments in the world’s deepest geothermal hot spring. \nMy husband warns, “Be careful, this one’s scalding.” He points to the signpost. Lobster Pot, it reads, 106°F. Hotel personnel have already told us that that’s a bit of an underestimate. In all honesty, at the more-realistic and scorching 114°F, getting in up to my ankles is enough to convince me that I am indeed a giant red crustacean being dropped into a cauldron of boiling water, and expected to simmer until I am poached. I stew in the thermic waters here at Pagosa Springs Resort for less than ten seconds before I decide that I am sufficiently fricasseed. \nSweating, I grab for my towel and step out. ‘Whew,” I perspire. “I can’t stand it any longer in there. I’m going back to Serendipity.” I skitter down the zigzagging concrete pathway towards the thermal pool with the light cascade from the overhanging terrace of Riverbend . Both tubs register at 103°, but it feels like a hundred degrees of temperature difference to me. “The natives of the American Southwest have revered these natural hot springs for hundreds of years,” I stick my toe in gingerly, and then slowly, my swimsuit and I ease into the balmy brew. My husband quickly joins me, his skin crimson-colored and mottled from his soak. As we settle into the tepid warmth together, and look out toward the distant mountain range, we both nod our heads in agreement. Luxuriating here in these 17 distinct pools – from the moderate bathwater in the low 90°’s at Twilight to the searing heat of Lobster Pot – is a delicious experience, winter or summer. Only one thing better – to ‘top off’ our visit with an icy dip in the San Juan River. “It wasn’t until the mid-1800’s, when white settlers created bath-houses for cooling the water, that the general public was able to appreciate its curative powers.” The natives of the American Southwest have revered these natural hot springs for hundreds of years, naming them Pag-Osah, for ‘stinking waters’, or perhaps more aptly, ‘healing waters’, in the Ute language. The translation still remains under debate to this day. The ‘stench’, more than likely the mineral mix fueled by sulfur brume, emanates from over 1002-ft. below ground, bubbling out of the earth at over 140°F in the main spring.\nIt wasn’t until the mid-1800’s, when white settlers created bath-houses for cooling the water, that the general public was able to appreciate its curative powers. Whether you journey to Pagosa Springs to steep in its medicinal waters, drink from this fount of good health, or satisfy your curiosity about this ‘sacred’ spring touted for its miraculous sanative powers, you’re sure to get your money’s worth. Utah – Sundance Mountain Resort Entertain your inner chakra through the arts. Commune with your natural environment. And lastly, according to the inspiration of Robert Redford, its owner and visionary, come to Sundance and let the exquisite natural surroundings ‘meet your needs and your dreams’. \nNothing is left to chance at Sundance. Not the ecologically-friendly lodges melded into the woodland, or the local, all-organic vegetables and free-range meats served in the restaurants, or the wellness programs at the luxurious spa. Yoga sessions, intimate ‘walks in the woods’, native American Indian-inspired treatments – it is the perfect excuse to leave your monotonous go-to-work, go-home, and go-to-bed existence behind. “Nothing is left to chance at Sundance.” We check into our luxury suite here at the 5000-acre resort, right at the base of 12,000-ft. Mt. Timpanogos, in the heart of the Wasatch Mountain Range. From our window, we can see the lower slopes, dappled with conifers and verdant green forest. Tomorrow, we’ll consider hiking one of the many trails throughout the property, but today, we’re going to try our hand at fly-fishing in the brisk Provo River.\nOur guide helps me mold myself into an unflattering dark-grey one-piece waterproof coverall and a pair of wading boots. Unattractive and unfeminine, I look identical to my husband and son, each likewise squeezed into his own fishing apparel. As I stagger into the fast-flowing current, I understand the necessity of the waders and neoprene booties—it won’t take long for the chilliness of the river to permeate my gear and cause my feet to go numb. “…what Robert Redford describes as ‘a community of people who appreciate the beauty of nature and feel the responsibility to preserve it’” With expert instruction, we are able to learn how to throw the line with only the snap of our wrist, and accurately sail our artificial ‘beadhead’ nymph into the churlish flow. Gustavo feels an almost immediate tug and he yanks back on his rod and reel. \n“Wow, these fish really pull,” he acknowledges, struggling to wrench the rainbow trout from the frigid water. Our leader races over with the net just as the fish manages to wrangle off of the tiny hook. My husband hangs his head, in dismay. No matter, it won’t be the only one to get away today. By late afternoon, though, each of us has snagged at least one brown or rainbow trout from the riffles of the river; we are ecstatic. \nWe return to Sundance for a delightful dinner of buffalo burgers and freshly-caught salmon. The reddish glaze of sunset bathes the escarpment of Mt. Timpanogos in a muted ruby-red glow. Nighttime descends on what Robert Redford describes as ‘a community of people who appreciate the beauty of nature and feel the responsibility to preserve it’. We drop into our beds, weary yet exuberant, and drift into dreamland to the soothing sounds of nature that seem to penetrate our eco-lodge cabin door. Peru Cuzco and beyond Discover spiritual cleansing and wellness through cultural studies at Machu Picchu and other ceremonial Incan sites throughout the Sacred Valley. \nWe amble along the cobbled streets of Cuzco, towards the church of Santo Domingo. A Christian cathedral and Dominican monastery constructed atop the pagan foundations of the Koricancha, an Incan temple dedicated to their sun god, Inti. The Spanish conquistadores integrated many of the original walls of the ancient temple into the convent; inlays of smelted gold are still visible between the joints of the gargantuan granite blocks. \nOur shoes clatter noisily over the courtyard stones – almost irreverently – as we pass through one of the ornate arches leading to a hallway decorated with colonial paintings. We admire this gallery of artwork adorned by gilded frames. In spite of the multitude of tourists and their guides, clustered here and there amongst the golden cloisters, little sound disturbs the peaceful quiet of this hallowed shrine. “…little sound disturbs the peaceful quiet of this hallowed shrine.” We flock back to the shuttle van and resume our quest to the Sacred Valley, to the town of Ollantaytambo, a living history of Incan culture. Occupied continually since the 13 th century, it is the location of the greatest Incan military victory over the conquering Spaniards.\nWe climb its spiraling stone steps, higher and higher, almost to the clouds. At this altitude, the wind whips through our hair and chaps our faces; I pull the knitted cap down over Nicolas’ head and ears, cuddling him in his newly-purchased alpaca-wool poncho. He looks just like the little Peruvian boys leading their llamas along the steep agricultural ledges stippling the hillsides. In spite of idolatrous beginnings, this Incan fortress offers a christianly sense of inner peace and amity, a sensation of being one with the universe. \nYesterday, we had ventured to the masterpiece of the Incan empire and assuredly, Peru’s crown jewel – Machu Picchu. With an early arrival at the town of Aguas Calientes, we departed by train for the serene ride to the famed archeological site. We ascended 2460-meters above sea level, into high jungle; for a while, we clattered over the steel track alongside the meandering Urubamba River. “An ethereal place in the cosmos, Machu Picchu truly earns its place as one of the new Seven Wonders of the World.” Eventually, the sound of rushing waters gave way to the gentle hum of the rainforest—the whir of hummingbird wings, the trill of crickets, the rustle of leaves and flowering Wakanki orchid blooms swaying in the morning breeze. A bleat of the locomotive’s horn announced the time for our disembarkation and we gleefully leaped from the train.\nThe citadel, in all her Incan glory, stretched in front of us, like some mystical world of legend…terraces of perfect symmetry cut into the Andean mountains; massive boulders of polished granite, deftly transported up the side of the cliff, and forged by master masons to fit together with exacting precision. In some places, the stones were wedged so tightly at the seams that even a knife blade wouldn’t fit through. An ethereal place in the cosmos, Machu Picchu truly earns its place as one of the new Seven Wonders of the World. Santa Cruz and Isla Isabela Become one with nature by getting up-close-and-personal with the resident wildlife. \nSprawled in a trio of hammocks under a shade tree, the three of us watch as a pair of stick-legged oyster catchers forages in the sand for tiny mollusks. They peck too close to an outcropping of lava rock and a disturbed red-blue-and-yellow Sally Lightfoot crab scuttles out from under a ridge of ebony stone. \nA few yards away, a juvenile spike-crested marine iguana agilely rides the surf into the shore and all 2 ½ -ft. of him – from tail to snout – emerges from the retreating foam; with two voracious snorts, he blows sea salt from his nostrils. He has feasted to the point of gluttony in the chilly tidal waters, consuming as much red algae as he can hold, and now is relegated to a sluggish tread across the beach. Fearful of predator hawks which might be circling overhead, scouting for food, he scurries as fast as possible to the terrace of our hotel, the Caleta Iguana, where at least two dozen of his reptilian relatives are lazing in the sun. Unfazed as they absorb heat from the warming rays. ” Nothing gives the spirit a healthier dose of ‘feel-goodness’ than being in such close proximity to God’s perfectly-adapted creatures.” An hour or so of this fabulous free entertainment passes: we spend it watching a dive-bombing piquero azul (blue-footed booby) scoop a fish dinner right out of the waves, while two lusty male fragatas (frigate birds) with bloated, bright-red gular sacs try to attract a mate. Nothing gives the spirit a healthier dose of ‘feel-goodness’ than being in such close proximity to God’s perfectly-adapted creatures. Chile Osorno – Termas de Puyehue Enjoy body rejuvenation through strenuous activities followed by gentle relaxation…from hiking, biking, horseback riding, kayaking and rafting to pump up the heart, succeeded by the calming catharsis from simmering in thermal waters – indoor and out – and a plethora of soothing, de-stressing spa treatments. \nI shove the last stragglers of brown hair inside this unappealing blue swim cap and wade into the delicious thermic waters here in Puyehue. Nicolas is still relaxing on one of the sunflower-yellow lounge chairs, checking out the text messages on his cell phone. He hasn’t decided if he wants to put on the required ‘blue cap’. Gustavo and I are already languishing in the heated water, having just experienced a delightful massage by one of the spa’s expertly-trained masseuses. “I didn’t want it to end,” I confide to my husband. “Her fingers were sheer magic.” “I didn’t want it to end,” I confide to my husband. “Her fingers were sheer magic.” Just about everything IS ‘magical’ about this first all-inclusive spa and wellness resort in Chile, not far from the town of Osorno and its namesake volcano. Located at Lake Puyehue, a crystal-clear lago that offers kayaking and rafting in the summer months, Termas is a year-round vacation destination. It’s early October now – springtime below the equator – and we are rambling along the lovely trails that serpentine through Puyehue National Park, sitting at the foothills of snowy Volcán Casablanca, whose last registered eruption was around 230 years before the birth of Christ.\nIn the morning, we plan to saddle up and go horseback riding on a guided tour. Afterwards, I intend to follow up with another session at the spa. With over 40 treatment options to select from, I’m not sure if I’m going for an all-over body scrub or the heated rock therapy. But for the moment, I’m quite content just lolling in the toasty Jacuzzi, breathing in the therapeutic steam. Nicolas has decided to weather our inner sanctum; he pulls on the ugly bathing cap and nudges me out of the way as he strides across the pool. Ready to plan your RTW trip?   Other Options Now, if you can’t commit to a full-blown, week-long fitness regime like some of the ones listed above, at least try to channel one or two days of your vacay into a wellness retreat. In Egypt , try to ‘go vegetarian’ with a staple diet of the meatless national dish, koshary – a filling mixture of chick peas, macaroni, lentils, rice, and browned onions in a tangy tomato-vinegar sauce.\nMaybe for the duration of your holiday, check out the Netherlands , and ‘try to adopt a cycling lifestyle’ like a true Amsterdammer. Pedal alongside the magnificent canals in special biking lanes, with traffic lights just for cyclists. \nGet a healthy dosing of the sun’s Vitamin D , without overdoing it, on the beaches of Grand Bahama . Learn to commune with the islanders —at festivals, religious celebrations, and day-to-day routines–through their ’people-to-people’ experience of cultural immersion. \nOr take after the French in Paris , and ‘escape from your worries’. Stroll arm in arm along the glowing banks of the River Seine at twilight or just before dusk, with a light dinner of fresh bread and aged cheese in a picnic basket bundled under your arm. Don’t forget the licorice-flavored aperitif, Pastis, to settle your stomach after your meal. Lose yourself in the moment…cast out those ‘stress demons’ that threaten your happiness, and share some quality time with those you hold dear. \nRead More:", "external_links": [], "published": "2015-10-21T11:03:00.000+03:00", "crawled": "2015-10-21T19:50:50.540+03:00", "highlightTitle": ""}