{"organizations": [], "uuid": "36b0a9be0a20f11a3a8b7dfd0b309114b15336d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/09/Hamburg-Airport.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/europe-travel-news/", "section_title": "Europe Travel News - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hamburg-airport-presents-winter-timetable-2/", "country": "US", "title": "Hamburg Airport presents winter timetableTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Hamburg Airport presents winter timetableTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "36b0a9be0a20f11a3a8b7dfd0b309114b15336d2"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hamburg-airport-presents-winter-timetable-2/", "ord_in_thread": 0, "title": "Hamburg Airport presents winter timetableTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hamburg Airport presents winter timetable Published on : Monday, October 26, 2015\nThe new winter timetable comes into effect at Hamburg Airport on 25 October, 2015. It is valid until 26 March, 2016 . Around 60 airlines fly to 120 destinations. On average, they carry 38,500 passengers per day to and from Hamburg in the winter – around 270,000 passengers every week. “Once again, together with the airlines, we can present a wide and varied range of services with more flights to popular destinations for this winter season,” says Michael Eggenschwiler, CEO of Hamburg Airport. “The commitment of our many partners enables us to offer an attractive and diverse timetable. Whether it’s a beach break or a skiing vacation, a city trip or business travel, our passengers have a wide selection of destinations to choose from.” Two airlines are currently expanding their commitment to Hamburg Airport by adding services to destinations, new for them, already served by other airlines. This is giving passengers a wide choice of airlines to bring them quickly and comfortably to their chosen destination.\nTo sunny Spain with Ryanair\nRyanair is expanding its services from Hamburg. Starting from 26 October, the airline is flying to Alicante every Monday , Thursday , and Saturday. The port city on the Costa Blanca is just 3 hours from Hamburg and offers the choice of total relaxation on beautiful beaches or a journey of discovery through historical attractions. Also starting on 26 October is Ryanair’s new service to Málaga, flying every Monday , Wednesday , and Friday. After a flight of under 3.5 hours, passengers can savour Andalusia’s outstanding wines in the region’s second-biggest city. And Ryanair is flying to two other Spanish destinations this winter: Madrid, starting on 4 November , and Barcelona from 9 November . The Spanish capital and the country’s second-largest city attract passengers on city trips all year round, with countless sights and attractions. The airline is flying to both destinations daily.\nSunExpress connecting Hamburg with Hurghada\nIf Hamburg gets to cold this winter, why not take refuge in the milder climate of Egypt’s Red Sea coast? It’s an easy option now with the new SunExpress service to Hurghada, on offer twice weekly ( Wednesday and Saturday) as a full-charter service from tour operator FTI starting on 28 October . Hurghada is a genuine paradise for divers but also for lovers of history and exotic cultures who can enjoy the vibrant old town with its authentic bazaars or use the city as a starting point for trips to the temples of Luxor and the pyramids of Giza.\nNon-stop to the snowfields\nAfter the hot summer of 2015, the skiiers are in the starting blocks. Ten airlines fly direct from Hamburg to the snowfields, and some of them don’t charge extra to carry skiing equipment. There are 15 destinations to choose from as starting points for the perfect winter vacation: Friedrichshafen, Munich, and Memmingen in Germany; Salzburg, Innsbruck, Vienna, and Klagenfurt in Austria; Basel, Bern, Zurich, and Geneva in Switzerland; Oslo in Norway; Helsinki in Finland; Milan and Venice in Italy. The skiing resorts are never far away. Geneva and Salzburg are two especially popular destinations. For an elegant city lifestyle with variety-filled miles of ski slopes, take easyJet or Germanwings to Geneva, the best airport for a ski trip to the French and Swiss Alps. This is one of the world’s largest contiguous skiing regions, with eight French and four Swiss resorts on offer. And on the other side, behind Montreux, the Glacier 3000 area guarantees snow and skiing fun as early as October. Meanwhile, from Salzburg, it is just a short trip to the slopes of the famous skiing regions in Salzburger Sportwelt Amadé (e.g. Filzmoos and Wagrain), Hochkoenig, and Schladming. Air Berlin and easyJet both fly non-stop to Salzburg, the birthplace of Mozart. Some of the ski resort hotels meet their passengers directly at Salzburg Airport.\nSummer outlook\nHambur Airport’s route network will expand further at the start of the 2016 summer timetable season: the Romanian airline Blue Air is launching a new service between Hamburg and Bucharest on 29 March, 2016 . There will then be two flights per week, on Tuesday and Friday, from Hamburg to the Romanian capital. The service represents two premieres at once for Hamburg Airport. First, Blue Air is a brand new airline for Hamburg. Second, this is another new eastern European destination for the airport’s route network. Germania is also continuing to expand its Hamburg services. The airline is launching a new weekly service to Bordum in Turkey on 7 May, 2016 . This is the perfect destination for sun lovers. Frequencies are also being added to the airline’s Rhodes and Beirut routes, and a new service to Madeira is being launched in the summer. SunExpress will launch a new service to Bodrum in the summer, too. Ryanair is adding another Spanish destination next year, with five flights per week to Palma de Mallorca starting on 28 March, 2016 . Diverse cultural experiences, warm weather, and long beaches await!\nSource:- Hamburg Airport", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T06:30:28.942+02:00", "highlightTitle": ""}