{"organizations": ["Vancouver Sun"], "uuid": "a7437f42c127de137ef79934fb5cf90f82ae528f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestarphoenix.com", "main_image": "http://www.thestarphoenix.com/cms/binary/11443516.jpg", "site_section": "http://rss.canada.com/get/?F7888", "section_title": "The StarPhoenix - Travel", "url": "http://www.thestarphoenix.com/travel/engulfed+rhythm+blues+africa+comes+mozambique+with+music/11443504/story.html", "country": "CA", "title": "'Africa comes at you' in Mozambique with music, friendly folks", "performance_score": 0, "site": "thestarphoenix.com", "participants_count": 0, "title_full": "'Africa comes at you' in Mozambique with music, friendly folks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T21:36:00.000+03:00", "replies_count": 0, "uuid": "a7437f42c127de137ef79934fb5cf90f82ae528f"}, "author": "", "url": "http://www.thestarphoenix.com/travel/engulfed+rhythm+blues+africa+comes+mozambique+with+music/11443504/story.html", "ord_in_thread": 0, "title": "'Africa comes at you' in Mozambique with music, friendly folks", "locations": ["Mozambique", "Inhambane"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel Wood"], "text": "By Daniel Wood, Vancouver Sun A troupe of dancers wears white face and raffia hair for a cultural festival in Inhambane, Mozambique. Photograph by: Daniel Wood , Vancouver Sun \nYou see why it’s so unique to be … Upon the beach of sunny Mozambique . \n– Bob Dylan, Mozambique \nI’ve seen fishing dhows with red patchwork sails adrift on an azure sea. I’ve heard the east wind moaning in beachside casuarina trees and coconuts fall far too close for comfort. I’ve seen dump trucks full of church-bound Seventh-day Adventists singing full volume the glory of the Lord. I’ve seen roadside bushes hung with thousands of vendors’ plastic bags of cashews. I’ve seen minuscule tropical islets – with no cartoon castaway in sight – and white-sand beaches that run for 50 kilometres, deserted. \nI’ve studied dreadlocks and braided pink-beaded hair-extensions, and I’m sure the great art form of Africa is coiffure. And now, seated atop a 100-metre dune on Mozambique’s Bazaruto Island , I have Zimbabwe to my far right and Madagascar to my far left, and – after a month’s driving – nearly 1,000 kilometres of wave-washed African coast behind me. \nMy morning had begun in Vilanculos, an oceanside town that serves as a base for both local fishermen and adventurers setting out for Bazaruto Archipelago Marine National Park , a string of islands and reefs in the turquoise Mozambique Channel between the African continent and Madagascar. I could have booked a stay at one of the islands’ all-inclusive resorts, but – with helicopter flights and a charge of $2,500 per night – it was beyond my means. I booked a $65 speedboat trip for a day of sun, snorkelling and a grilled barracuda lunch on Bazaruto. (Those who opt for a classic dhow ride to the islands, 30 km from Vilanculos, face a painfully slow journey, good in retelling, but hard on the derrière.) \nMy four speedboat companions and I snorkelled above Two Mile Reef, noted for its corals and incandescent fish, but my attention was quickly drawn to the approach of a metre-long prehistoric-looking green sea turtle. I resisted the temptation to grasp its carapace for a free ride underwater and instead kept pace, each of us eyeing the other across millions of years of diverging evolution. \nThe month-long journey had started, as most Mozambique journeys do, in Maputo , the country’s pleasantly rumpled capital. Two friends and I had a rental car, a map, 72 recently purchased bottles of South African wine to consume, and a vague sense that adventure lay along the 2,300-kilometre coastline that stretched northward to Tanzania. \nI’d heard all the cautionary tales about African travel: beware the possibilities of malaria, of crime, of sickness, of snakebites, of Africa in general. So, for the record: I saw two mosquitoes during my Mozambican month, encountered not an iota of threat or worry, ate locally without a single problem (perhaps attributable to the effects of the wine) and met zero snakes. It is probably the safest place in Africa. \nBut unlike travels in much of the western world, a road trip through Mozambique also reveals this: Africa comes at you. It is visceral – the gregarious people, the bombardment of street music, the vibrant colours of the women’s sarongs and turbans; the smells of tropical fruit and dried fish. Makeshift sidewalk stalls spill onto streets with produce and cheap clothing. Overloaded minivans disgorge circus-loads of people. A stop to purchase guavas or a bag of cashews produces a gathering of onlookers, drawn to the occasion by a European face in an African world. \nIt wasn’t until I was approaching the town of Xai-Xai , 200 km north of Maputo, that I got my first glimpse of something familiar. The country’s EN1 highway curves across a vast marsh, and there ahead a sign reads: Limpopo River. One should be of a certain age – and I am – to know the Just So Stories , written by Rudyard Kipling over a century ago. \nIn his famous children’s book, Kipling describes how the elephant acquired its long trunk. The tale involves a too-curious young elephant with a stubby snout, a toothy, unyielding crocodile and a lot of painful nose-stretching. This encounter occurs, Kipling writes, on “the banks of the great, grey-green, greasy Limpopo River all set about with fever trees.” \nIt’s one of the most famous lines in children’s literature. And suddenly, there it is: the real Limpopo River, flowing out of the heart of Africa and into the Indian Ocean. In unison, the three passengers in the car spontaneously recite Kipling’s alliterative words and laugh, a childhood artifact dredged from memory. \nAlong the two-lane highway, the reality of rural Mozambique becomes clear. The people are largely poor subsistence farmers. (The average national income is $1 a day.) Small patches of corn and cassava, some goats, a cluster of round, thatched-roofed huts, a few trees in a swept-dirt compound with families gathered in their shade – a scene repeated ten thousand times as the northbound hours pass. Side roads on the west lead toward the upland jungle where the big African animals are; side roads on the east lead to tropical beaches and an indigo sea. \nAlmost 500 km north of Maputo, one of these side roads leads to Tofo , the country’s leading destination for ocean adventurers and those inclined to horizontal enjoyment of sun. For me, the lure of Tofo was this: its waters regularly have one of the largest concentrations of whale sharks in the world. Moving in pods of five or 50, swimming slowly as they filterfeed plankton, these docile, 14-metre creatures – the largest fish on Earth – can be joined by snorkellers or scuba-divers without fear. Thousands do this every year. \nTofo – like several other coastal villages of southern Mozambique – is a place that hasn’t yet been overwhelmed by modern tourism. The operative word is yet. \nIn Tofo, there’s precisely one concrete hotel. Most of the resorts are composed of round thatchedroofed buildings – mimicking the local architecture but loaded with modern amenities. These are strung along Tofo’s spectacular seven-km palm-lined beach, while, just offshore, surfers ride curling Indian Ocean waves. \nThe town is a place that adventure travellers have discovered, the type of people who made it – say, 35 years ago – to Thailand’s Phuket when facilities there were also mostly thatched. \nBut as it turns out, my arrival coincides with the departure of the whale sharks. I’m offered a view of a promotional whale shark video. I decline. It feels like my being told at a fancy restaurant the lobster has just sold out, but I can look at a photo of one on the maître d’s iPhone. \n(Whale sharks annually appear off Tofo between September and February.) \nMy consolation is languid beach walks, body surfing, and – each evening – an onshore breeze and the oceanside consumption of immodest amounts of wine. \nOne of my travelling companions is a music ethnologist who uses stops on the northward drive to buy African CDs. He tells me about Venancio Mbande, one of Mozambique’s greatest musicians, who – he has just learned – lives somewhere along the EN1 highway ahead. \nAt an obscure village called Helene, we turn into a dirt driveway where an old man sits outdoors eating porridge beneath some sheltering trees. “Venancio Mbande?” I ask. “That is me,” he replies. Niceties, a discussion about traditional marimba music (marimbas are massive, wooden Mozambican xylophones), and an offer from 19-year-old Domingo, one of Mbande’s 15 children from his two wives, to perform. Amid conical thatched huts, red beans drying on mats, darting chickens and a wife grating cassava nearby, Mbande sits smiling as his youngest child’s hands become a blur, and rhythm fills the warm afternoon air. This, it turns out, is merely overture. We hear there’s an African music festival in Inhambane, an old Portuguese colonial port to the north. It is here that Vasco da Gama arrived in 1498, outbound for India. It’s here the Portuguese later came to trade in ivory and slaves. The quaint 19th-century section of the city, painted in peeling, tropical pastels, reflects the faded glory of Inhambane, but it is the distant music along Avenida da Independência that draws me toward downtown. Several thousand people line sidewalks. Speakers blast music at near-Krakatoan volume. And from crammed dump trucks and minivans, bizarrely costumed figures, drawn from surrounding villages, are appearing. \nThey file into performance units, practise dance steps, laugh and take selfies in preparation for a boisterous dancing parade. \nMore zombie-walk than sexy Carnival, hundreds of people have appropriated the spirits and demons of their African heritage to celebrate Mozambique culture. \nThere are walking straw haystacks and masked men wearing huge cow horns. There are lumpy mud-faced men with red raffia hair and black women, all in ghostly whiteface, with white ribbon hair and white dresses, singing about peace. There’s a watermelonheaded saxophone player in a jiving brass band, and a woman wearing a T-shirt which reads: “Creativity is intelligence having fun.” \nThe music goes all afternoon, and onward through the evening. And when I finally stagger back to my hotel room, exhausted after the assault of bands and drum-propelled street-dancing, I fall asleep to the rhythms of Africa still pulsing through the night air. © Copyright (c) Postmedia Network Inc.", "external_links": [], "published": "2015-10-16T21:36:00.000+03:00", "crawled": "2015-10-20T08:17:13.574+03:00", "highlightTitle": ""}