{"organizations": [], "uuid": "e06e02e56b8b1a4b39785924b709b11ad6ffedfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bootsnall.com", "main_image": "", "site_section": "http://feeds.bootsnall.com/bna/articles/", "section_title": "BootsnAll Travel Articles", "url": "http://www.bootsnall.com/articles/10-12/how-to-travel-very-lightly.html", "country": "US", "title": "Ultralight Weight Travel and No Baggage Fees", "performance_score": 0, "site": "bootsnall.com", "participants_count": 1, "title_full": "Ultralight Weight Travel and No Baggage Fees", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T11:03:00.000+03:00", "replies_count": 0, "uuid": "e06e02e56b8b1a4b39785924b709b11ad6ffedfb"}, "author": "admin", "url": "http://www.bootsnall.com/articles/10-12/how-to-travel-very-lightly.html", "ord_in_thread": 0, "title": "Ultralight Weight Travel and No Baggage Fees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ultralight Weight Travel and No Baggage Fees By Simone Cannon de Bastardo on October 6th, 2015 To our friends and family, my husband and I are freaks of nature. We can travel for three months at a time sharing one medium sized backpack and two small daypacks between us. This is unfathomable to most people, who cannot conceive of leaving their house without half their closet, the entire contents of their bathroom cabinets, and their complete collections of gadgets. Ready to plan your RTW trip? Sign up for the free 30 day e-course > I have had my own luggage dilemmas. While traveling alone for four months through Southeast Asia , I decided to err on the side of caution and plan for every eventuality. I took much more luggage than the average human would ever need. After a month of schlepping my heavy bags from planes, to trains, to the tops of buses, to boats, to hostels, I’d finally had enough when, after spending 30 minutes hauling my bags to the top of the steep stairs of a hostel in Thailand , they slipped from my grasp and slid all the way back to the bottom in less than 10 seconds. As I sat defeated and on the verge of tears at the top of the stairs, I vowed to lighten my load. The next day, I gave away or shipped home three quarters of what I’d brought and was a much happier, lighter traveler. “The next day, I gave away or shipped home three quarters of what I’d brought and was a much happier, lighter traveler.” I decided that, from then on out, I’m done packing for every possible scenario. I vowed to start traveling lightly and never pay another baggage fee again. \nLuckily, my husband is the original light packer and multi-tasker, so we are the perfect travel team. After traveling together for five years, Luis and I finally have packing down to a science. We started with a full backpack each and several daypacks and smaller bags, but after many misadventures running, fully-loaded and off-balance, through the driving rain and wind to make last-minute bus connections in the remote pampas of Argentina , or having to ferry our belongings back and forth multiple times between customs and immigration offices on the back of a rickety scooter at a rooster-infested Bolivian border crossing, we got smart. Why it’s important to travel lightly Traveling should be about freedom, enjoying new adventures, experiencing other cultures and a change of scenery, but for many people it is about anxiety, insecurity and fear of the unknown. They compensate by taking as many things as they can carry (and often much more than they can carry), but as the traditional aboriginal saying goes, “The more you know, the less you need.” \nClever packing allows travelers to truly enjoy trips, free of the worry of having to carry and keep track of many pieces of luggage and from having to plan an elaborate wardrobe . The less to carry, the better: the weight of luggage seems to increase exponentially as travel wears on. “Traveling should be about freedom, enjoying new adventures, experiencing other cultures and a change of scenery, but for many people it is about anxiety, insecurity and fear of the unknown.” When traveling in developing countries or when trekking, it is necessary to carry your own luggage or hoist it yourself on to the top of trucks, 4x4s, or buses. On the Alternate Inca Trail Trek to Machu Picchu, for example, horses carry your luggage for the first three days while you trek through the Andes, but on the fourth and final day, when most travelers can barely walk themselves, they have no choice but to carry their own backpacks, as the final stretch of the terrain is too steep for the horses. If you can’t lift and carry your own bags, you’re bringing too much.\nAside from the benefit of saving money (as most carriers now charge for extra luggage and weight), carrying less frees you from having to keep track of many pieces of luggage, which is especially useful when traveling long-term, rushing to make travel connections, or traveling in less than secure areas. It is much easier to keep an eye on one bag than four or five. It is also much less likely that you will be confused or easily distracted by thieves and scam artists, or that your luggage will be lost. \nWant to take it to the extreme when it comes to packing lightly? See how Rolf Potts traveled the world with NO bags in the No Baggage Challenge. Why you don’t need all that stuff Just like at home, you will find yourself wearing the same comfortable clothes again and again. It can be tedious and repetitive at times, and you will probably want to burn every item of travel clothing in a flaming sacrificial bonfire when you return home, but the trade-off is worth it. When you are traveling and recycling clothing, nobody in the different places that you visit will notice that you’re wearing the same blue t-shirt for the fourth time . \nOnce you figure out which clothes work for you when traveling, it can be freeing: packing takes almost no time at all, dressing is simple and you will feel great when you realize how very little you really need to survive. “Once you figure out which clothes work for you when traveling, it can be freeing: packing takes almost no time at all, dressing is simple and you will feel great when you realize how very little you really need to survive.” In general, the length of the trip and the climate are unimportant. By taking the right clothing and shoes, you can layer, mix and match, and be prepared for almost anything, from one week to one year. Taking multi-purpose items and hand-washing can extend your options forever (in developing countries, it’s also quite cheap to just send you clothes out to be laundered).\nObviously there are exceptions, but much of this gear can be rented when you arrive at your destination. And if you forget something or find that you need something that you didn’t bring, remember that no matter where you are, from New York City, to Kathmandu, to a small town in Russia, people there need to wear clothes, bathe, and live, so you will be able to find what you need while on the road. Will you have the same choices as home? Of course not, but you’re not traveling to get the same comforts of home, right? \nLearn how to pack for a RTW trip with no luggage at all How to do it Clothing and footwear technology has changed everything. Today’s materials run the gamut from lightweight, durable, warming, cooling, breathable, windproof, waterproof, water-resistant, wrinkle-resistant, stain-resistant, fast-drying, reversible, multi-pocketed and convertible to any combination thereof. \nLightweight hiking pants can be converted to shorts in seconds; sleeves and linings can be added and removed quickly as the climate changes. The wide variety of super-functional lightweight fabrics make it easy to avoid taking heavy cotton, wool or polyester clothing, which take forever to wash and even longer to dry. \nRead How to Pack for a Long-Term Trip , complete with his and hers packing lists and recommendations for clothes and gear. Bring the basics • Take a couple of sturdy, plastic bags to use for keeping your dirty clothes separate. Bring some plastic clothes pins and a lightweight, flexible laundry line with a loop at each end (a string works just fine as well, just make sure you know how to tie a good knot). Keep clothes clean by washing them yourself in a sink, and when in developing areas, you can send your laundry out to be done for minimal costs. A small can of Febreze for removing odors can also be useful when there is no time to wash and dry your clothes, and can also be used to freshen sleeping bags, towels, or bedclothes.\n• Don’t take new clothes or clothes that you seldom wear at home. Make sure that every item is something that you are comfortable wearing repeatedly. If you find that the new pair of pants that you brought is uncomfortably tight in the crotch, you will never wear them, and they will become dead weight. Some people like travel-specific clothing, and that’s what they stock up on for travel. Others like to wear what they wear at home – jeans, t-shirts, etc., and wouldn’t be caught dead in a pair of zip-off pants – you have to bring what you’re comfortable wearing. Just know the pros and cons of each. \n• Keep clothes in neutral, solid, non-running colors. This serves two purposes: it will be easier to mix and match outfits, and you will be able to wash everything together or at least in only two loads. If you tend to be messy, you may want to stick to darker colors that hide stains better. \n• Shoes should be lightweight, comfortable and waterproof. Almost every hiking shoe, walking shoe or sneaker is available with Gore-Tex or a similar waterproofing agent. Flip-flops can be worn in the shower to avoid picking up nasty things like athlete’s foot, at the beach, when walking across stony creeks or rivers, on boats, for sightseeing in warmer climate cities, or as bedroom slippers. It’s not necessary to take both hiking boots and sturdy sneakers unless you are doing some serious mountain trekking. Wear your bulkiest shoes in transit to save the room and the weight in your backpack. You may also want to bring a lightweight pair of flat shoes, such as ballet flats for women or loafers or topsiders for men, just in case you need something a little more formal. Make items do double-duty Think creatively about the possible multiple uses of every item that you add to your backpack.\n• Toiletries: Shampoo can also be used to hand-wash your clothes or as bodywash. Perfume doubles as air or fabric freshener. Cotton pads soaked in alcohol and sealed in a Ziploc bag can be used to clean oily skin, disinfect cuts and scrapes, remove ink stains from skin and clothing, clean glasses, and sanitize things in hotel rooms or hostels (toilets, TV remotes, phones, etc). Baby wipes are great for this as well, plus they can work as your “shower” for the day when in a pinch (hey, no one said travelers are the cleanest people around). \n• A sarong: A sarong or pareo has multiple uses and can serve as a towel, a swimsuit cover-up, a beach blanket, a scarf, a wrap for keeping warm on buses or planes, a skirt, a shawl for covering shoulders, legs or head when visiting places of worship, a makeshift tote, or a tablecloth for picnicking. A large microfiber travel towel can serve many of the same purposes in a pinch. \n• A nylon cord: A thin nylon cord can be used as a laundry line, for securing backpacks or camping gear, hanging food from trees when sleeping outdoors, last-minute repairs, or emergency shoelaces. \n• Duct tape: Duct tape can be used to prevent blisters by wrapping feet before hiking, supporting sprains and minor fractures in an emergency, to secure backpacks, make minor repairs, seal holes in tents or screens, and seal gaps in hotel windows and doors. \n• Cotton bandanas: Bandanas can serve as scarves, head covers, napkins, facecloths, mini towels, wraps (sandwiches, delicate items), and can be tied into small bags for carrying souvenirs, etc. Technology Technology has changed travel forever, for better or worse (we think the pros far outweigh the cons). Aside from the incredible improvements in clothing and shoes, portable electronic devices such as iPods, iPads, smart phones, and E-books allow a traveler to carry massive amounts of music, information, and reading material without adding much to the weight of luggage.\n• Music players: Devices such as the iPod allow you to take your entire music collection, audio books and travel guides, and every podcast that you ever wanted to hear. They also have room for photo storage. \n• E-readers: E-readers like the Amazon Kindle are a godsend. With an e-reader, you can download hundreds of books before you leave home. They also save room and the weight of carrying around bulky guidebooks, which can also be downloaded, either in complete book form or by chapter. Lonely Planet, for example, allows buyers to purchase and download individual chapters or regions of their guidebooks, instead of the whole book. E-readers can also store Word and PDF documents, maps, music, and photos. \n• Netbook, iPad, and Smart Phones: Extra storage and wireless internet access can be a lifesaver. A small Netbook, iPad, or cell phone with internet access will allow you to stay in touch with your friends and family, book airline and hotel reservations, download travel information, and update your blog without having to go to an internet café. It also keeps your data secure and uninfected by avoiding PCs used by thousands of travelers and locals, which often harbor unseen spyware or viruses. \n• Flashdrive: A pendrive or flashdrive takes up almost no room and can be useful in storing emergency information/contacts, photos and documents such as copies of passports and credit cards, travel reservations, and maps. \nRead Choosing Gadgets for your Long-Term Trip Sharing saves space If you have a travel partner, one of best tricks for packing lightly is to share things. Clothing, shoes, toiletries, iPods, laptops, travel towels and books can all be shared and will save an enormous amount of room and weight. “If you have a travel partner, one of best tricks for packing lightly is to share things. “ If you are the same clothing size as your travel partner, you can double your wardrobe. Even if you are not the same size, looser items like sweaters, rain ponchos, scarves, gloves and hats can still be put to double use. To be honest, gender isn’t even that important anymore, most of the clothes, especially for adventure travel, camping and hiking, are androgynous.\nYou don’t need two bottles of shampoo, conditioner, toothpaste, sunscreen, or insect repellent. If you can agree on a brand or type, one bottle of each will be plenty. If you run out, you can buy pretty much anything locally, and international brands can be really, well, interesting, to say the least. Packing One of my pet peeves about many backpacks is that the items inside can be so inaccessible, so I had our local tailor install a heavy-duty zipper around the periphery of the bag so that I could just open it up like a sardine can, easily and quickly adding or removing items. It is also helpful and time-saving when coming through international customs, as the officers can do a much quicker search. Many of the new backpacks already have zippers on the bottom, top and sides, making life much easier for travelers, so keep that in mind when shopping for luggage for your trip.\n• Use structured net bags or packing cubes. These light, washable bags come in various sizes and colors and can be packed with individual categories of items, making things much easier to organize and find. I use one bag for underwear, one for socks, one for toiletries, one for t-shirts, etc. Carry a light, quick-drying laundry bag to keep dirty clothing separate from clean (this can also double as a pillow case if needed). \n• Don’t take unnecessary items that you will regret having to carry later. Hair dryers, curling irons, electric shavers, heavy books or guides, expensive (or expensive-looking; thieves don’t know the difference) jewelry or watches, a full-size laptop, or large pillows or blankets will make your life miserable in short order. When it comes to clothing, everyone has an opinion, and you ultimately have to do what’s right for your situation. For traveling super light, clothing items you may want to avoid are items that can be worn with only one other thing, heavy boots, high-heeled or dress shoes, heavy cotton or wool items such as jeans or bulky sweaters. \n• Roll clothing to avoid wrinkles and to save space. Rolled items can also be tucked into small spaces, such as shoes, outer pockets or daypacks. When using packing cubes, more items can be squeezed in when rolled and rolling also helps to keep more of the surface of a garment clean. Wrap shoes in individual plastic bags to protect other clothing. Always tuck in a few extra plastic grocery bags; they take up almost no room, weigh nothing, and can be used for storing wet towels and bathing suits, as a laundry bag, for wrapping shampoo bottles to prevent leakage, or for food storage. A collection of ziploc bags are also really nice to have. “Always tuck in a few extra plastic grocery bags…” • Choose a piece of luggage that you can live with for a long time. The ever-popular backpack is still widely available and popular, but newer versions are much lighter, more durable, and with much more functionality than backpacks in the past. Wheels will add weight to your luggage, but can make life easier in the long run. If you don’t want to spring for new luggage, you can inexpensively update your existing gear with heavy-duty zippers, waterproofing, or added pockets. It’s also a good idea to have the zippers, straps, cords, and clips replaced regularly to avoid wear and tear. A backpack is only as good as its fasteners.", "external_links": [], "published": "2015-10-06T11:03:00.000+03:00", "crawled": "2015-10-06T18:08:16.429+03:00", "highlightTitle": ""}