{"organizations": [], "uuid": "1d43aeedabb797810058362b4b40c8796a1bea2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "airtravel.about.com", "main_image": "http://f.tqn.com/y/airtravel/1/S/t/Q/Bose.jpg", "site_section": "http://airtravel.about.com/", "section_title": "Here's your ultimate guide for all thing Air Travel.", "url": "http://airtravel.about.com/od/travelindustrynews/tp/Noise-Canceling-Headphones-Bringing-Bliss-to-Your-Flight.htm", "country": "US", "title": "Noise-Canceling Headphones: Bringing Bliss to Your Flight", "performance_score": 0, "site": "about.com", "participants_count": 1, "title_full": "Noise-Canceling Headphones: Bringing Bliss to Your Flight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "1d43aeedabb797810058362b4b40c8796a1bea2d"}, "author": "Benet Wilson", "url": "http://airtravel.about.com/od/travelindustrynews/tp/Noise-Canceling-Headphones-Bringing-Bliss-to-Your-Flight.htm", "ord_in_thread": 0, "title": "Noise-Canceling Headphones: Bringing Bliss to Your Flight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "All my friends know that one of the must-haves for me when I travel is noise-canceling headphones. Flying is stressful enough without having to hear screaming children, loud passengers and the constant hum of an aircraft engine.\nReally good noise-canceling headphones can shut out these sounds, allowing for a blissful flight. I received my first pair, from Sharper Image , back in 2006 as a gift. These were good, but the technology that makes these headphones has progressed rapidly since I got that first pair, so I decided it was time to upgrade and spring for a new pair.\nThere are many manufacturers of noise-canceling headphones, but below are the four sets that are considered the best for air travelers. Read my review of each before deciding which pair you will buy. I ended up choosing the Bose QuietComfort 25 .\nPhoto courtesy of Amazon.com 1. Bose QuietComfort 25 Bose are considered the gold standard of noise-canceling headphones. They have padded ear cups that are soft and comfortable even during long flights. You can listen to music or just listen to quiet. There’s an inline mic and remote that handles volume and allows you to control your music or answer your smartphone. The noise control operates with a single AAA battery that lasts approximately 35 hours. If the battery dies, you lose the headphones’ noise-canceling ability, but the sound is still pretty good. The headphones come with a carrying case and an adapter for airlines’ inflight entertainment systems. They come in black, triple black and white. Buy from Amazon »\nPhoto courtesy of Amazon.com 2. Sennheiser PXC 450 I had never even heard of Sennheiser until I went to the EAA AirVenture air show in 2011. I was hanging out with a group that had this Wedemark, Germany -based headphone manufacturer as a sponsor, so their RV was full of the company’s products, including noise-canceling models. The noise canceling operates with two AAA batteries that last for around 21 hours, but can still be used even if the battery dies. The silver-colored headphones come with a carrying case and an adapter for airlines’ inflight entertainment systems. Buy from Amazon »\nPhoto courtesy of Amazon.com 3. Beats by Dr. Dre Studio 2.0 I tried these out because a member of my family has a pair and loves them. One, you can really feel the bass in these headphones. Two, unlike its competitors, these over-ear headphones have a built-in rechargeable battery that powers the noise cancelation and lasts for 20 hours. It also includes a gage that shows how much power is left in the battery. The headphone cushions were quite comfortable, and they also feature an in-line mic and remote to control calls, volume, and music. The headphones include a hard carrying case, a USB 2.0 charging cable for the battery, a USB power adapter and an L-shaped 3.5mm audio cable. The headphones come in black, white, red and seven other colors. Buy from Amazon »\nPhoto courtesy of Amazon.com 4. Sony ZX770BN Noise Canceling Bluetooth Headphones Although Sony makes a quality headphone, its noise-canceling entry can get lost in the shuffle among the larger manufacturers. But I gave them a test run because I really liked my smaller Sony headphones. These headphones are Bluetooth, so there’s no wires to worry about, and they connect to smartphones for audio and phone calls. Once the noise canceling button is pushed, the function automatically adjusts to the surrounding sounds. The headphones are over-ear and quite comfortable. The built-in battery lasts for about 13 hours, and takes about two hours to recharge. The headphones come in blue or black. Buy from Amazon »", "external_links": ["http://pinterest.com/pin/create/button/?url=http://airtravel.about.com/od/travelindustrynews/tp/Noise-Canceling-Headphones-Bringing-Bliss-to-Your-Flight.htm?utm_source=pinterest&utm_medium=social&utm_campaign=shareurlbuttons_nip&media=http://f.tqn.com/y/airtravel/1/S/t/Q/Bose.jpg&description=Silence", "http://pinterest.com/pin/create/button/?url=http://airtravel.about.com/od/travelindustrynews/tp/Noise-Canceling-Headphones-Bringing-Bliss-to-Your-Flight.htm?utm_source=pinterest&utm_medium=social&utm_campaign=shareurlbuttons_nip&media=http://f.tqn.com/y/airtravel/1/S/u/Q/Sennheiser.jpg&description=Silence", "http://pinterest.com/pin/create/button/?url=http://airtravel.about.com/od/travelindustrynews/tp/Noise-Canceling-Headphones-Bringing-Bliss-to-Your-Flight.htm?utm_source=pinterest&utm_medium=social&utm_campaign=shareurlbuttons_nip&media=http://f.tqn.com/y/airtravel/1/S/w/Q/Sony.jpg&description=Silence", "http://f.tqn.com/y/airtravel/1/L/v/Q/Beats-Dr.-Dre.jpg", "http://www.amazon.com/exec/obidos/ASIN/B00TA4HRUI", "http://pinterest.com/pin/create/button/?url=http://airtravel.about.com/od/travelindustrynews/tp/Noise-Canceling-Headphones-Bringing-Bliss-to-Your-Flight.htm?utm_source=pinterest&utm_medium=social&utm_campaign=shareurlbuttons_nip&media=http://f.tqn.com/y/airtravel/1/S/v/Q/Beats-Dr.-Dre.jpg&description=Silence", "http://f.tqn.com/y/airtravel/1/L/t/Q/Bose.jpg", "http://f.tqn.com/y/airtravel/1/S/u/Q/Sennheiser.jpg", "http://www.sharperimage.com/", "http://f.tqn.com/y/airtravel/1/S/v/Q/Beats-Dr.-Dre.jpg", "http://f.tqn.com/y/airtravel/1/S/w/Q/Sony.jpg", "http://www.amazon.com/exec/obidos/ASIN/B00E9262IE", "http://f.tqn.com/y/airtravel/1/L/u/Q/Sennheiser.jpg", "http://f.tqn.com/y/airtravel/1/L/w/Q/Sony.jpg", "http://www.amazon.com/exec/obidos/ASIN/B000R2PC2M", "http://www.amazon.com/exec/obidos/ASIN/B00M1NEUKK", "http://www.eaa.org/en/airventure/features-and-attractions/eaa-airventure-air-show", "http://f.tqn.com/y/airtravel/1/S/t/Q/Bose.jpg"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T17:44:03.880+03:00", "highlightTitle": ""}