{"organizations": [], "uuid": "4cf766d0b58a4e92e495ea15062e5a1c4987a6c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/mike-arkus/headshot.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/mike-arkus/canadas-wondrous-kluane-n_b_7882506.html", "country": "US", "title": "Canada's Wondrous Kluane National Park: The Yukon/Klondike Gold Rush Trail on the Looney Front, Part 5", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Canada's Wondrous Kluane National Park: The Yukon/Klondike Gold Rush Trail on the Looney Front, Part 5", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:37:00.000+03:00", "replies_count": 0, "uuid": "4cf766d0b58a4e92e495ea15062e5a1c4987a6c6"}, "author": "Mike Arkus", "url": "http://www.huffingtonpost.com/mike-arkus/canadas-wondrous-kluane-n_b_7882506.html", "ord_in_thread": 0, "title": "Canada's Wondrous Kluane National Park: The Yukon/Klondike Gold Rush Trail on the Looney Front, Part 5", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nKluane National Park, 100 miles west of Whitehorse, contains Canada's loftiest peak, 19,551-foot Mt. Logan, and as a joint UNESCO World Heritage Site along with Wrangell-St Elias and Glacier Bay national parks in Alaska and Tatshenshini-Alsek park in British Columbia, is part of the largest preserve in the world. \nPronounced kloo-wah-nee, it also contains what some call the world's largest non-polar multi-glacier ice field and what is generally accepted as North America's most genetically diverse grizzly bear population. You generally need to fly into the glaciers by small plane to view the ice field and Mt. Logan, but no such expense is needed to watch the grizzlies. \nKluane National Park \nWe've barely entered the park's confines when not even I can miss a golden brown grizzly munching grass about 50 feet from the roadside. And no, as pointed out before, you don't get out and call 'Come here kitty, kitty, kitty, or bruin, bruin, bruin.' You stay firmly put behind closed doors, ready to tear off if it approaches lest it tear you up in turn with its massive claws and teeth. \nRoadside grizzly \nBut it just looks up and around dismissively and continues munching a medley of grasses, shoots and flowers. As if that's not close enough, another golden grizzly is giving us a reprise 40 miles further on about 30 feet from the roadside. \nSecond roadside grizzly \nThe guide on this mid-June trip, Teena, is superb. Her husband is a Dickson, grandson of a Canadian Mountie who came to the Yukon early last century, fell in love with a local and, as fraternisation between His Majesty's Mounties and the 'natives' was very much verboten, left the force to father 13 children with his beloved. \nThere are now some 300 Dicksons who are holding a family reunion in a few days' time in the tiny settlement of Champagne. Teena was involved in the logistics two weeks back of the rescue of two climbers who were stranded on Mt. Logan in a total white-out with winds gusting at 100 mph during a climb which can take 30 to 35 days. \nChampagne \nHub cap corner - from hubcaps flying off cars flying round the corner \nWhen a helicopter eventually took them out, one of the climbers who had been on Everest seven times said he'd never seen such weather, the other had frostbite to seven fingers, and Teena fulfilled her logistical part - handing them hot pizzas and cold beer. \nChampagne's mileage on Alaska Highway \nVeterinarian Michelle Oakley from nearby Haines Junction, the park's headquarters, is the star of yet one more in that endless acne of reality shows afflicting TV, Yukon Vet on NatGeo, and there are half a dozen films crews cruising round the neighbourhood here. \nThey're taking all the photogenic scenic shots they need to wet viewers' appetites as the vet rushes around treating eagles, muskoxen, caribou, sled dogs, a cow and a yak, among many others. \nKluane views \nThe views are indeed superb with endless banks of incredibly fluorescent purple flowers lining the road. \nFlower-garlanded road \nStill lakes mirror the multi-serrated mountain wall of stark ice-streaked peaks and folds, and lush green carpets the lower slopes. \nOne of the teams is photographing one such beautiful location, Kathleen Lake. Another, several miles away, is fiddling around with a red-flashing, buzzing-bee camera drone. He said he once buzzed a grizzly with it but the bear just looked at it and walked away, probably thinking it was just a swarm of bees. \nKathleen Lake views \nI think he insults the magnificent beast's known intelligence - no way is it going to try to get honey out of that silly little buzzing thing with the flashing red lights and four little whirring propellers. \nWe don't fork out the $250 each needed for an hour's flight over the mountain wall, and $480 each for the two hours' flight to take you to Mt. Logan. I already had that fantastic trip round the summit of Mt. Denali/McKinley courtesy of Air Alaska, the weather looks threatening over the range anyway, and there's more than enough to wonder at on the ground. \nKluane park views \nThe northern border of the park runs along the Alaska Highway built in eight months during WWII. The government then declared everything south of the park a no-hunting zone. \nThis might sound a welcome move from the point of view of saving wildlife but it made a perfect mockery of the Champagne, Aishihik and other First Nations who had been hunting here sustainably for centuries, totally disrupting their lives and livelihoods. And people ask why they get drunk! \nFollowing land settlement agreements with Canada's native peoples, the locals now manage the park together with Parks Canada, and some native hunting is allowed. \n[Upcoming blog on Thursday: Way beyond the Arctic Circle in Canada's Northwest Territory] \nMore Kluane views", "external_links": [], "published": "2015-10-18T20:37:00.000+03:00", "crawled": "2015-10-18T20:49:54.714+03:00", "highlightTitle": ""}