{"organizations": ["Rutherford B. Hayes Presidential Center"], "uuid": "44ff562ef42dd0e66b81e93f29e531fbf48eb38f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/10/19/hayes-library.jpg", "site_section": "http://www.dispatch.com/content/syndication/lae_travel.xml", "section_title": "The Columbus Dispatch Travel Feed", "url": "http://www.dispatch.com/content/stories/local/2015/10/19/hayes-presidential-center-to-get-overhaul.html", "country": "US", "title": "Overhaul set for Rutherford B. Hayes Presidential Center in Fremont", "performance_score": 0, "site": "dispatch.com", "participants_count": 0, "title_full": "Overhaul set for Rutherford B. Hayes Presidential Center in Fremont", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T15:39:00.000+03:00", "replies_count": 0, "uuid": "44ff562ef42dd0e66b81e93f29e531fbf48eb38f"}, "author": "", "url": "http://www.dispatch.com/content/stories/local/2015/10/19/hayes-presidential-center-to-get-overhaul.html", "ord_in_thread": 0, "title": "Overhaul set for Rutherford B. Hayes Presidential Center in Fremont", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overhaul set for Rutherford B. Hayes Presidential Center in Fremont Rutherford B. Hayes \nThe Dispatch public affairs team talks politics and tackles state and federal government issues in the Buckeye Forum podcast. Your Right to Know Dispatch file photo A room on display at the Rutherford B. Hayes Presidential Center \nFREMONT, Ohio — The first presidential library in Ohio is gearing up for its centennial celebration with a $1.3 million overhaul to upgrade its exhibits and make the facility a must-see destination for history buffs and casual visitors. \nThe Rutherford B. Hayes Presidential Center in Fremont is getting set to undergo an extensive redesign, including a new front entrance that will improve accessibility to the facility. \n“Basically, the whole museum is going to be different,” spokeswoman Kristina Smith said. \nThe museum, which opened 35 years after Hayes left office, is working with the Ohio History Connection on the changes. Smith said parts of the museum will remain, including the rotunda and the interactive display on Hayes’ travels during the Civil War, but there will also be additions to the facility. \nA replica of the Resolute Desk — a gift from England’s Queen Victoria to Hayes — will be placed in the president’s gallery, as well as a lectern where visitors can practice their own presidential speeches. \nImprovements will also be made to the gallery’s lighting. \nSmith said plans for the museum redesign and new entrance came about after the center surveyed 400 people in 2014 about their thoughts on the facility and what they’d like to see at the center. The survey was developed as part of the center’s 2012 strategic plan. \nAll of the construction and changes are scheduled to be complete by the 2016 Memorial Day weekend, when the Hayes Center will host its centennial celebration.", "external_links": [], "published": "2015-10-19T15:39:00.000+03:00", "crawled": "2015-10-19T16:05:14.689+03:00", "highlightTitle": ""}