{"organizations": [], "uuid": "d6ef664204b9d7f6f8d8d6d2dacdc3893f63649e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thesatellite.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/10/23/hotel_anonymous_ks-61p2ortzs74xdvxi2l2_ct300x300.JPG", "site_section": "http://feeds2.feedburner.com/ThesatellitecomauTravel", "section_title": "thesatellite.com.au: Travel", "url": "http://www.thesatellite.com.au/news/8-secrets-hotel-staff-wont-tell-you/2816894/", "country": "AU", "title": "8 secrets hotel staff won't tell you", "performance_score": 0, "site": "thesatellite.com.au", "participants_count": 0, "title_full": "8 secrets hotel staff won't tell you", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:00:00.000+03:00", "replies_count": 0, "uuid": "d6ef664204b9d7f6f8d8d6d2dacdc3893f63649e"}, "author": "", "url": "http://www.thesatellite.com.au/news/8-secrets-hotel-staff-wont-tell-you/2816894/", "ord_in_thread": 0, "title": "8 secrets hotel staff won't tell you", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "8 secrets hotel staff won't tell you Rose Troup Buchanan | 23rd Oct 2015 9:00 AM Cars For Sale \nANONYMOUS hotel workers have revealed eight secrets they will never tell their clients. \nWriting on Quora and Reddit, staff also explained how to get the best deal out of hotels. \n1. Deaths \nAmong the most frequently mentioned secrets is the number of people who die in hotel rooms. One user. who worked in a hotel during his university holidays, recounted how a guest hanged himself in one of their rooms and had been found by a cleaner. \n\"The police arrived with the appropriate people, took away the body, without any guest having the faintest idea what was going on. It never even appeared in local news.\" \nHotels keep this information tightly controlled to both prevent bad publicity and \"dark tourism.\" \n2. Celebrities \nChances are you may have already stayed in a hotel at the same time as a major celebrity. \"As a guest, unless you happen to glimpse the celebrity, you'll never know they're there,\" Stacey Jean said. \n\"I was at a hotel that hosted a popular baseball team - yes, the entire team! - and not a soul was the wiser.\" \n3. Relationships and Affairs \nThey usually know exactly who is there for an affair. \"Yes, we know who you are. No, we don't really care!\" \nGloria Londono added: \"If you're travelling with your spouse/significant other, we can tell almost from the moment you walk in, whose [sic] the decision maker of the two of you.\" \n4. Police \nAlmost all hotels - good or bad - have a strong relationship with the local police force. It is nothing against their customers, staff explained, just \"where lots of people congregate, problems do arise.\" \nThey claim officers are usually happy to go with the staff's interpretation of events as \"workers are generally pretty good judges of when the police need to be involved with a situation.\" \n5. Cleanliness \nIn all the threads, every member of staff warned guests against ever, ever, touching the \"coverlet\", duvet or remote. They are never washed. \nStaff warned clients away from the glasses by the sink (also never washed), to always check the seals on bottles, and advised people to never check under the bed or hard to reach places as they are never cleaned. \n\"Use a towel or sheet on the chairs or sofa, a LOT of people sit on them naked. It's nasty but there is often a brown streak on the desk chair that no one think[s] about,\" Reddit user Roslagen claimed. \nFinally: \"Bed bugs are more common than you think.\" \n6. Cancellations \nIf you want to cancel last minute, but don't want to lose your deposit, ring the hotel's desk and move your booking to a few days later. Wait a few hours, then ring back and ask to cancel the reservation. \n\"The cancellation fee will be bypassed because there's now a new cancellation time on the new date,\" Reddit user druumer89 said. \n7. Booking \nNever book through a third-party. The walk-in rate is usually cheaper, especially depending on the time of day (later is better) and booking directly is nearly always cheaper. Staff added guest's special requests are often missed if they don't book directly. \n8. Freebies \nBe nice to staff, particularly the doorman. \"I can give you free water bottles, tampons, valet parking, tours, shuttle rides, reservations, dry cleaning, hell even an upgrade to a better room if you just ASK ME. But no one ever does because they think I'm just a doorman.\" \nFor upgrades, always ask when the member of staff \"is not busy checking in a lot of guests. You are setting up the agent to say no cause the last thing they want is a line of guests all asking for upgrades.\" editors picks", "external_links": [], "published": "2015-10-22T17:00:00.000+03:00", "crawled": "2015-10-23T20:59:31.801+03:00", "highlightTitle": ""}