{"organizations": [], "uuid": "9c49a49e8286fc8fb2d59dc1b8e55d72445566c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03458/lyonsdown_FTI_3458210a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-05.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/business-reporter/11901179/acquisition-and-restructuring.html", "country": "US", "title": "100-day plan: acquisition and restructuring", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "100-day plan: acquisition and restructuring - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:18:00.000+03:00", "replies_count": 0, "uuid": "9c49a49e8286fc8fb2d59dc1b8e55d72445566c8"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/business-reporter/11901179/acquisition-and-restructuring.html", "ord_in_thread": 0, "title": "100-day plan: acquisition and restructuring", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The early days following a change of ownership or restructuring are vital when it comes to preserving or enhancing the value of a business . A 100-day plan is a key tool that experienced advisers use to galvanise a team, prioritise actions and drive quick wins. Michael Vivian, managing director at FTI Consulting, says that it is vital to make sure the firm is delivering change every single day. “Speed is of the essence, not only for companies facing insolvency, but also for a company that has been taken over by private equity owners in a vanilla acquisition,\" he says. \"The first 100 days are about the new owner taking control, getting ‘under the bonnet’ and developing a granular view of the plan developed during the investment case. Quickly set the energy and reinforce the daily tempo from the top down.” Part of the skill of 100-day planning is finding leaders who inspire and drive change, and then co-ordinating their energy According to Vivian, plans should focus on three main areas: cash, change and communication. In more stressed acquisitions, cash is inevitably the first area of focus, to ensure that the business has a stable platform to build from. “Underperforming companies frequently prioritise revenue growth targets, but quickly need to switch their mindset towards cash and profit.” In more difficult engagements this may involve detailed 13-week cash forecasting. In others there may be a more strategic piece of working capital improvement. Implementation of rapid change is also essential in a 100-day plan. The plan may involve delivering quick wins identified prior to acquisition, or quickly developing a deep understanding of the processes or systems that must change. In either case, the key is getting the right people focused on the task. Vivian adds: “Some people thrive in a high-change environment – they are intuitive thinkers who can work with imperfect data. Part of the skill of 100-day planning is finding leaders who inspire and drive change, and then co-ordinating their energy.” The best communication style is inclusive but honest – even if there are tough messages – to get people on board and willing to be part of the change One of the trickiest yet most important elements of the plan is communication. “It’s essential to multiply the efforts of the project team, so everyone is pulling in the same direction and buys into the turnaround efforts,” says Vivian. Prior to deal completion, typically only senior management are actively involved, and the majority of the team may have experienced the exhaustion of “deal fatigue”, or at least feel uncertain of the future and therefore become disengaged. Vivian adds: “Our experience shows that the best communication style is inclusive but very honest – even if there are tough messages – to get people onboard and willing to be part of the change.” Communication is also about getting the right information to the right decision makers. One of the first things FTI ensures is that the company’s reporting and management information is fit for purpose and drives action. Vivian says: “Underperforming companies often have too little information hidden in too much data. Our skill lies in identifying the key levers for rapid improvement.” Ultimately, 100- day plans are used to establish stability, speed and to create the platform for the business to move forward successfully. • The FTI Consulting corporate finance team provides comprehensive financial and operational restructuring services to corporates and their sponsors, including private equity and distressed investors. Michael Vivian is a managing director in the team focusing on providing operational support for investors deploying capital. • This article was originally produced and published by Business Reporter. View the original article at www.business-reporter.co.uk", "external_links": [], "published": "2015-10-06T00:18:00.000+03:00", "crawled": "2015-10-05T18:41:26.864+03:00", "highlightTitle": ""}