{"organizations": [], "uuid": "7ed67858b2e8b6615ab8b96238c48590c30da588", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Chinese-at-malawi.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/malawi-extensively-targets-chinese-market/", "country": "US", "title": "Malawi extensively targets Chinese market - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Malawi extensively targets Chinese market - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "7ed67858b2e8b6615ab8b96238c48590c30da588"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/malawi-extensively-targets-chinese-market/", "ord_in_thread": 0, "title": "Malawi extensively targets Chinese market - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malawi extensively targets Chinese market Published on : Monday, October 12, 2015\nSeven key influential Chinese Tour operators from Beijing, Shanghai and Shenzhen were hosted by The Malawi Department of Tourism in September.\nThe customized educational trip, underwritten and promoted by South African Airways and Elite Travel Connection, focused upon educating Chinese travel professionals on the unique attributes of Malawi as a new and pristine destination as a stimulus to packaging high quality Malawi tour packages to China’s rapidly expanding outbound African tourism market.\nThe group visited a variety of locales in the Southern part of Malawi, including Lilongwe, Blantyre, Zomba, Mangochi, Majete Wildlife Game Reserve, Liwonde National Park and Lake Malawi National Park where they saw wildlife such as lions, hippos, elephants, nyala, wildbeasts, warthogs, impala, etc. The group also attended the Lake of Stars Music Festival held from September 25th to 27th.\nMalawi Department of Tourism organized a celebratory dinner at the newly-built convention hotel in Lilongwe, drawing many representatives of reputed tour operators in Malawi, such as Sunrise Ground Tours, The Travel Centre, Malawian Style, Memory Momba. For the Chinese group that had traveled half way around the world to see amazing wildlife including elephants literally at the entrance too their bedroom, there was palpable excitement in the air as they met and got to know their Malawian hosts and discussed exciting travel packages for Chinese tourists eager to experience the primal habitats of Malawi.\nAfter introductory comments by both Chinese and Malawian representatives, the Malawian peers introduced their company profiles and the diversified products they can offer to Chinese tourists. The function served as a platform for the Chinese and Malawian tourism professionals to meet and establish business and strategic partnerships.\nSosten Lingwalanya, Deputy Director of Tourism (Marketing) of Malawi Ministry of Information, Tourism, Culture and Civic Education said, the main goal of the educational tour was to impress Chinese tour operators with Malawi’s compelling tourism resources, encouraging them to bring more Chinese travellers to Malawi.\nTo streamline logistics the Government of Malawi (through the Ministry of Home Affairs and Internal Security) has just introduced a new visa regime effective from October 1st, reducing the visa fee for Chinese citizens from RMB 1000 to RMB 700. Travellers are required to obtain their visas well in advance at Malawi Embassy in Beijing, China.\nThe Malawi Department of Tourism China office has launched an online training system (linked to www.visitmalwi.cn) earlier this year to build an elite network of specialist travel agents professionally trained to sell high quality Malawi tour packages to the Chinese travellers.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T12:37:18.284+03:00", "highlightTitle": ""}