{"organizations": [], "uuid": "424620655737c11261d733a37018d11660bec6de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30282731/sino-global-appoints-new-acting-chief-financial-officer", "country": "US", "title": "Sino-Global Appoints New Acting Chief Financial Officer", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Sino-Global Appoints New Acting Chief Financial Officer - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "424620655737c11261d733a37018d11660bec6de"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30282731/sino-global-appoints-new-acting-chief-financial-officer", "ord_in_thread": 0, "title": "Sino-Global Appoints New Acting Chief Financial Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Sino-Global Shipping America, Ltd.\nROSLYN, N.Y. , Oct. 16, 2015 /PRNewswire/ -- Sino-Global Shipping America, Ltd. (NASDAQ: SINO) (\"Sino-Global\" or the \"Company\"), a Virginia company engaged in shipping, chartering, logistics and related services, today announced the appointment of Ms. Tuo Pan as the Company's new Acting Chief Financial Officer (\"Acting CFO\"). Ms. Pan, a certified public accountant, currently serves as director of the Company's subsidiary, Sino-Global Shipping Australia Pty Ltd.\nThe appointment, effective October 15, 2015 , is a result of the Company's decision to expand its management team and realign its internal resources and priorities. Ms. Pan will replace Mr. Anthony S. Chan who served as the Company's Acting CFO, Director and Executive Vice President since October 31, 2013 . Mr. Chan is stepping down only as Acting CFO and will remain on the Board of Directors and retain his position as Executive Vice President to focus on assisting the Company in implementing its strategic and business plan and growing its logistics network in the United States .\nMr. Lei Cao, Chief Executive Officer of Sino-Global, stated, \"We are indebted to Anthony for his hard work and contributions over the past two years as our Acting CFO. Under his leadership, Sino-Global has improved its margins, returned to profitability and reported two consecutive years of net profit. Working closely with me on strategic and operating issues, Anthony is a trusted professional and has implemented effective cost control procedures as we restructured and turned-around our shipping agency business. In light of our business plan for fiscal year 2016, we have decided to expand our management team so that Ms. Pan could look after the finance and accounting functions while Anthony could spend more time with me on strategy development and the business development front. Ms. Pan is a seasoned CPA and her experience and tenure with the Company since 2008 make her an excellent candidate for the Acting CFO. We are confident that she will make a positive contribution to the Company as our new Acting CFO.\"\nSince 2008, Ms. Pan has overseen the finance and accounting functions of Sino-Global Shipping Australia Pty Ltd. Ms. Pan holds a certified public accountant qualification in Australia and received her bachelor's degree in Accounting and Finance and a master's degree in Advance Accounting from the Curtin University of Technology in Western Australia . From August 2007 to July 2008 , Ms. Pan worked as Project Manager of Baker Tilly China Ltd.\nAbout Sino-Global Shipping America, Ltd.\nFounded in the United States in 2001, Sino-Global Shipping America, Ltd. is a company engaged in shipping, chartering, logistics and related services. Headquartered in New York , Sino-Global has offices in Mainland China, Australia , Canada and Hong Kong . Our current service offerings consist of shipping agency services, shipping and chartering services, inland transportation management services and ship management services. Additional information about Sino-Global can be found on the Company's corporate website at www.sino-global.com .\nForward Looking Statements\nAny statements and/or other information contained in this release that relate, directly and/or indirectly, to future plans, events or performance of the Company are forward-looking statements that involve risks, and uncertainties some of which are identified in Sino-Global's filings with the Securities and Exchange Commission. Actual results, events or performance of the Company and such other about mentioned events may differ materially. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as the date hereof. Sino-Global undertakes no obligation to publicly release or otherwise disclose the results of any revisions to these forward-looking statements that may be made to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.\nCONTACT:\nThe Equity Group Inc.\nTerry Downs\nAssociate\n(212)-836-9615 / tdowns@equityny.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/sino-global-appoints-new-acting-chief-financial-officer-300161420.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CN30883&Transmission_Id=201510161640PR_NEWS_USPR_____CN30883&DateId=20151016", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/sino-global-appoints-new-acting-chief-financial-officer-300161420.html"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T02:19:43.582+03:00", "highlightTitle": ""}