{"organizations": [], "uuid": "d6b3b8496d2fc20529676a78850da3b8ed469ce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vogue.com", "main_image": "http://www.vogue.com/wp-content/uploads/2015/10/12/wedding-selfie-stick.jpg", "site_section": "http://www.vogue.com/living/", "section_title": "Living: Weddings, Interior Design, Food, Travel, and Parties - Vogue", "url": "http://www.vogue.com/13359978/weddings-selfie-stick-reem-acra", "country": "US", "title": "Is the Selfie Stick the New Must-Have Wedding Accessory?", "performance_score": 0, "site": "vogue.com", "participants_count": 1, "title_full": "Is the Selfie Stick the New Must-Have Wedding Accessory? - Vogue", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:00:00.000+03:00", "replies_count": 0, "uuid": "d6b3b8496d2fc20529676a78850da3b8ed469ce2"}, "author": "Brooke Bobb", "url": "http://www.vogue.com/13359978/weddings-selfie-stick-reem-acra", "ord_in_thread": 0, "title": "Is the Selfie Stick the New Must-Have Wedding Accessory?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Friday last week, the now-ubiquitous and highly controversial selfie stick popped up in an unexpected place: on the runway at Reem Acra’s Fall 2016 bridal show . Models were sent down the runway wearing bedazzled headphones—an unexpected sartorial statement in and of itself—but it was the rhinestone-and-floral-appliqué-adorned selfie stick that really turned heads. “The bridal selfie stick and headphones were a way for me to communicate a bride’s desire to tune out the rest of the world and simply have fun,” says Acra.\nPoint taken. But what happens when the bride accidentally smacks her groom in the face trying to turn and get a picture with the bridesmaids in the background? Should the couple leave some out for guests to use? Will they become a distraction during the ceremony or the speeches? Should the selfie stick replace the bouquet entirely? Here’s the bigger question: Are selfie sticks really appropriate for a wedding at all?\nThe evolution of wedding photography closely mirrors our growing need to capture—and share—every precious (and mundane) moment. Wedding photographers snapping some formal shots gave way to days-long reportage-style affairs, HD video, Hollywood-style “trailers,” drones, and GoPros (it turns out attaching one to a bottle of Fireball whiskey yields some amusing reception footage ). And that list excludes the fact that just about every guest will be snapping away with his or her phone, hashtagging the night away. While the age of the selfie stick may be only natural in this age of tech- (and self-) obsession, some are vehemently against the phenomenon when it comes to tying the knot. “Frankly, I never think a selfie stick is right for a wedding, or for that matter, anytime,” says event planner David Stark. “It’s the extreme opposite of chic—the fanny pack of photography. Why not just ask a friend to take a picture of you?” Acra, on the other hand, obviously disagrees: “Posed pictures can look formal and serious, and the selfie stick will give everyone something to smile about.” Whether you’re laughing with it in your own hand or at it in someone else’s, Acra’s right in saying that the selfie stick will most likely always provoke a smile, even if it’s one that comes with a big eye roll.", "external_links": ["http://www.youtube.com/watch?v=_Pb4nN7ykHc"], "published": "2015-10-13T16:00:00.000+03:00", "crawled": "2015-10-13T20:05:08.086+03:00", "highlightTitle": ""}