{"organizations": [], "uuid": "e9d30f2932666dc8a7980274f73cf68f09fe412f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/ccca6dadc8610b771149fdf40de429525f11c84a/c=0-1880-5026-4720&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/09/USATODAY/USATODAY/635799976197182821-15.015.22.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/travel/hotels/2015/10/11/hotels-power-breakfasts-loews-knickerbocker/73660834/", "country": "US", "title": "Power breakfast, the most productive meal of the day", "performance_score": 0, "site": "usatoday.com", "participants_count": 1, "title_full": "Power breakfast, the most productive meal of the day", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T02:02:00.000+03:00", "replies_count": 1, "uuid": "6aa849588382da556a60feeb05041cd5ed72c1a9"}, "author": "", "url": "http://www.usatoday.com/story/travel/hotels/2015/10/11/hotels-power-breakfasts-loews-knickerbocker/73660834/#post-0", "ord_in_thread": 0, "title": "Power breakfast, the most productive meal of the day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The new Knickerbocker Hotel in New York City caters to the power breakfast crowd. Its restaurant, Charlie Palmer at the Knick, is designed with chain mail partitions to provide privacy for meetings. (Photo: Paul Warchol)\n24 CONNECT 58 TWEET 7 LINKEDIN 1 COMMENT EMAIL MORE The power breakfast keeps gathering steam.\nHotels across the country cater to travelers and locals who want to conduct business over eggs and coffee. They try to appeal to the lucrative business clientele by offering free Wi-Fi, USB ports, healthier breakfast items and private areas for morning meetings.\nLoews Hotels and Resorts, which started the power breakfast tradition at its Loews Regency in New York City in 1975, will offer a version at its new Loews Regency San Francisco early next year.\nThe new Knickerbocker Hotel in New York City touts itself as the power breakfast destination in Times Square. Its restaurant, Charlie Palmer at the Knick, is designed with chain mail partitions to provide privacy for meetings. Coffee, pastries and juices are delivered in a breakfast caddie with a charging port that fits most USB devices.\nAt TRIO at the Four Seasons Hotel Austin, nearly 40% of midweek breakfast comes from local professionals and politicians, and the lounge is often filled with people waiting for their host to finish a first breakfast meeting and move on to a second one.\nAbout 40% of hotel guests travel for business, according to the American Hotel and Lodging Association, making them a lucrative group of people to appeal to. Many businessmen and -women say morning meetings are more effective.\n\"I prefer to conduct major meetings and discussions during early morning hours,\" says Fred Mwangaguhunga, a media entrepreneur whose go-to breakfast spot is the Breslin at the Ace Hotel in New York. \"This allows you to be the first thing the person you're meeting with will digest and think about. The mind is fresh and at its peak in the earlier hours of the day.\"\nThe term \"power breakfast\" was coined by Preston Robert Tisch, who co-founded the Loews hotel chain and was a longtime chairman of the New York Convention and Visitors Bureau. Tisch and city leaders needed a place to gather for breakfast to discuss ways to save the city from bankruptcy.\n\"They said, 'where should we meet?' and my father, being generous and I will say a little selfish, said, 'We have a dining room in the hotel. Let's just meet there, and all I have to do is take the elevator down,' \" his son Jonathan Tisch, chairman of Loews Hotels, recalls.\nFrom 1975 on, the Loews dining room was packed each morning with politicians, celebrities, socialites and business leaders. On a recent Monday, Tisch spotted House Minority Leader Nancy Pelosi, D-Calif., having breakfast at the hotel.\nWhat makes a good power breakfast?\n\"It really is the mix of people plus good service and good food,\" Tisch says. \"You need to be attentive but not intrusive and make sure the meal is happening in a timely manner.\"\nFrom 2013 to 2014, the Loews Regency closed down for an extensive renovation. Tisch moved the power breakfast to a nearby restaurant, but other hotels in New York saw the opportunity to start promoting their own power breakfasts. The idea has spread outside New York.\nAt the newly revamped Carlyle Dupont, a Kimpton property in D.C., the Riggsby restaurant was designed with the business traveler in mind. The restaurant offers Wi-Fi and outlets at each of the bar seats. Dining room booths are spaced in a way to allow for private conversations. The décor was inspired by mid-century supper clubs.\n\"The environment is subdued, we've got nice big tables for people to work, it's well-lit and comfortable,\" general manager Daniel Lobsenz says.\nThe restaurant has become popular with embassy employees, government workers and politicians.\nAcross the country, the Luxe Sunset Boulevard Hotel's On Sunset restaurant in Los Angeles is often filled with celebrities and studio executives in the morning.\n\"A lot of hotels have gone to grab-and-go breakfast, and we still have the traditional restaurant with tables and chairs that allow people to dine,\" says Michael Lorenz, senior vice president of sales and marketing for the hotel. \"Grab-and-go is great, but then they're not giving people an option to sit and talk. They assume the guest wants to leave, but people still want to meet at 8 or 8:30.\"\nBreakfast is the most popular meal at most Omni Hotels and Resorts, says Ann Tramer Brownlee, Omni's vice president for corporate communication.\n\"I like meeting when people are at their freshest and unencumbered by surprises or stresses that rise later in the day,\" she says. \"Things have a tendency to slide uphill, meaning as issues arise throughout the day, there is more work to complete in a short window of afternoon time. Mentally, there's something liberating about having a power breakfast.\"\n24 CONNECT 58 TWEET 7 LINKEDIN 1 COMMENT EMAIL MORE Read //usat.ly/1RBodGq TOP VIDEOS", "external_links": ["http://usat.ly/1RBodGq", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1RBodGq&mini=true", "http://www.gannett-cdn.com/-mm-/c2e58d197411c936aefd96cbe9f4e2c156840214/r=304x400/local/-/media/2015/10/09/USATODAY/USATODAY/635799976197182821-15.015.22.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1RBodGq&text=Power%20breakfast%2C%20the%20most%20productive%20meal%20of%20the%20day&via=usatoday", "http://www.gannett-cdn.com/-mm-/18b96b6ca8471cf2244fabeba2931044823607fa/c=38-0-4988-6600&r=537&c=0-0-534-712/local/-/media/2015/10/09/USATODAY/USATODAY/635799976197182821-15.015.22.jpg", "http://www.gannett-cdn.com/media/2015/10/09/USATODAY/USATODAY/635799976197182821-15.015.22.jpg"], "published": "2015-10-12T02:02:00.000+03:00", "crawled": "2015-10-12T21:33:40.879+03:00", "highlightTitle": ""}