{"organizations": [], "uuid": "0020ab04de4a1102dab1027e1febfa4a642d848c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30253003/renaissance-hotels-premieres-the-revitalized-renaissance-santo-domingo-jaragua-hotel-casino-in-the-dominican-republic", "country": "US", "title": "Renaissance Hotels Premieres the Revitalized Renaissance Santo Domingo Jaragua Hotel & Casino in the Dominican Republic", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Renaissance Hotels Premieres the Revitalized Renaissance Santo Domingo Jaragua Hotel & Casino in the Dominican Republic - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "0020ab04de4a1102dab1027e1febfa4a642d848c"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30253003/renaissance-hotels-premieres-the-revitalized-renaissance-santo-domingo-jaragua-hotel-casino-in-the-dominican-republic", "ord_in_thread": 0, "title": "Renaissance Hotels Premieres the Revitalized Renaissance Santo Domingo Jaragua Hotel & Casino in the Dominican Republic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Renaissance Hotels\nBETHESDA, Md. , Oct. 13, 2015 /PRNewswire/ -- Renaissance Hotels, the global lifestyle hotel brand recognized for helping guests discover unusual travel experiences, announced the reintroduction of the Renaissance Santo Domingo Jaragua Hotel & Casino in Santo Domingo , Dominican Republic.\nThe property underwent a yearlong $40 million renovation that began in 2014 to completely revamp the property's interior and amenities, making the Renaissance Santo Domingo Jaragua Hotel & Casino the leading lifestyle hotel in Santo Domingo . As the property plays a prominent role in the cultural history of Santo Domingo , much detail and effort went into the preservation of the hotel's historic aspects and blending them with ultra-modern design elements.\n\" Santo Domingo is a historic city in the Caribbean with rich tradition and a vibrant local culture. We are incredibly excited to unveil the renovated Renaissance Santo Domingo Jaragua Hotel & Casino and invite our guests to discover the local flavor of Santo Domingo ,\" said Dan Vinh , Vice President Marketing, Renaissance Hotels.\nBuilt in 1942, the hotel has played a role in Santo Domingo culture for 73 years. The property recaptures the spirit, culture, and design elements that made the Santo Domingo Jaragua hotel an icon. The Renaissance Santo Domingo Jaragua Hotel & Casino features a Navigator – the hotel's lifestyle concierge -- who provides guests with an exotic, alluring and vibrant experience that will transform any trip into an inspiring journey.\nLocated in the heart of the oldest city in the New World, the Renaissance Santo Domingo Jaragua Hotel & Casino features 300 guest rooms and suites, executive lounge, a sprawling outdoor pool, casino, tennis club and a state-of-the-art fitness center and spa. The property includes ten meeting spaces equipped with the latest technology and boasts the La Fiesta theater which hosts up to 1,200 guests.\nThe Renaissance Santo Domingo Jaragua Hotel & Casino is the third hotel in Marriott International's Dominican Republic portfolio following the 2014 opening of the JW Marriott Hotel Santo Domingo and the Courtyard Santo Domingo.\nRENAISSANCE HOTELS:\nRenaissance Hotels believes in defying business travel conventions for guests who crave unexpected experiences. At Renaissance Hotels, It's Business Unusual . Each of the brand's 160 hotels, located in over 35 countries around the world, is unique and every stay offers unconventional programs that help business travelers discover rich, local experiences. We promise to feed the curiosity, fuel the imagination and excite the senses of our guests who see their business trip as an exciting opportunity for new, interesting, and sharable experiences. We understand their desire to make the most out of every moment and we offer signature events in our lobbies, bars and lounges designed to showcase emerging talent in music, the arts, mixology, gastronomy and more. Renaissance Navigators are neighborhood experts who are ready to assist guests in discovering true local flavors and activities. R.E.N. Meetings offers groups an experience beyond a traditional meeting, rooted in creative sensory meeting design and custom-curated local Navigator excursions and networking events. At Renaissance Hotels, we work to ensure that every trip is transformed into an eye-opening, unforgettable journey. To discover more visit www.renhotels.com . For upcoming events visit www.renhotels.com/events .\nLike us on Facebook www.facebook.com/RenHotels .\nFollow us on Twitter www.twitter.com/RenHotels .\nLike us on Instagram www.instagram/RenHotels .\nFollow us on YouTube www.youtube.com/RenHotels .\nMarriott International, Inc . (NASDAQ: MAR) is a global leading lodging company based in Bethesda, Maryland , USA, with more than 4,300 properties in 81 countries and territories. Marriott International reported revenues of nearly $14 billion in fiscal year 2014. The company operates and franchises hotels and licenses vacation ownership resorts under 19 brands. For more information or reservations, please visit our website at www.marriott.com , and for the latest company news, visit www.marriottnewscenter.com .\nPhoto - http://photos.prnewswire.com/prnh/20151013/276558\nLogo - http://photos.prnewswire.com/prnh/20140515/88139\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/renaissance-hotels-premieres-the-revitalized-renaissance-santo-domingo-jaragua-hotel--casino-in-the-dominican-republic-300159091.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.xmlnews.org/ns/", "http://www.marriottnewscenter.com/", "http://www.instagram/RenHotels", "http://www.renhotels.com/events", "https://photos.prnewswire.com/prnvar/20151013/276558", "http://photos.prnewswire.com/prnh/20140515/88139", "http://www.news.marriott.com/company-information.html", "http://www.marriott.com/hotels/travel/sdqgw-renaissance-santo-domingo-jaragua-hotel-and-casino/", "http://www.twitter.com/RenHotels", "http://www.marriott.com/", "http://www.renhotels.com/", "http://photos.prnewswire.com/prnh/20151013/276558", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH27291&Transmission_Id=201510131652PR_NEWS_USPR_____PH27291&DateId=20151013", "http://www.youtube.com/RenHotels", "http://www.prnewswire.com/news-releases/renaissance-hotels-premieres-the-revitalized-renaissance-santo-domingo-jaragua-hotel--casino-in-the-dominican-republic-300159091.html", "http://www.facebook.com/RenHotels", "http://photos.prnewswire.com/prnvar/20140515/88139"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T01:40:15.188+03:00", "highlightTitle": ""}