{"organizations": [], "uuid": "1054dcbd52869967521d5d858c8651c435da7880", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/h/p/x/w/image.related.StuffLandscapeSixteenByNine.620x349.17hps5.png/1445227327288.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/73050053/Ask-an-expert-Booking-accommodation-without-breaking-the-bank", "country": "AU", "title": "Ask an expert: Booking accommodation without breaking the bank", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 0, "title_full": "Ask an expert: Booking accommodation without breaking the bank", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T19:00:00.000+03:00", "replies_count": 0, "uuid": "1054dcbd52869967521d5d858c8651c435da7880"}, "author": "", "url": "http://www.stuff.co.nz/travel/73050053/Ask-an-expert-Booking-accommodation-without-breaking-the-bank", "ord_in_thread": 0, "title": "Ask an expert: Booking accommodation without breaking the bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ask an expert: Booking accommodation without breaking the bank Last updated 05:00, October 25 2015 SRDJAN ZIVULOVIC \nTourists kiss on the tower of Ljubljana Castle. \nQ. We are a family of four travelling to Europe in July 2016. We are going to a wedding in Slovenia but want to see some of Europe while we are there. We are planning to travel from London to Paris, then Rome, Florence, Vienna and Ljubljana. The problem is accommodation! Looking online is mind-boggling, there are so many options, all of which seem really expensive! Airbnb looks like a great option, but I was wondering if you had any ideas of the best ways to know we are getting the best deals. Any help would be amazing, we are really excited about our trip but also don't want it to break the bank. \nA. Europe in July – how exciting! The internet is an awesome tool for researching ideas for places to stay and getting a feel for other people's experiences with various accommodation types, but it can be really overwhelming. We find self-contained apartments and villas are the best bet for families, as they offer a self-catering option which can cut down on costly extras. \nWhen you're booking your accommodation, it's also important to look at location and weigh up whether the cost of being in a main centre is more efficient than staying further out and paying less for accommodation but more for transport. You've picked some big city centres, so transport can be very costly. \nWe've been booking travel for Wellingtonians for 24 years, so we have a pretty good idea of what is a good deal! Feel free to pop in for a chat and we can have a look at some different options for you. \n- Petra Otte, House of Travel On Hunter, Wellington \nGot a travel question? We can help. Email your name, address and phone number to escape@star-times.co.nz with Expert in the subject line. House of Travel is giving away a $100 voucher, redeemable in store, for the best question each month.", "external_links": [], "published": "2015-10-24T19:00:00.000+03:00", "crawled": "2015-10-24T19:25:37.823+03:00", "highlightTitle": ""}