{"organizations": [], "uuid": "240dfd58521656f32f22984450e72ceddabafe9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3401812/images/r-WOMAN-LAUGH-VINTAGE-600x275.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/heath-padgett/six-reasons-why-you-shoul_2_b_8359728.html", "country": "US", "title": "Six Reasons Why You Should Live in an RV During Your 20s", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Six Reasons Why You Should Live in an RV During Your 20s", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:31:00.000+03:00", "replies_count": 0, "uuid": "240dfd58521656f32f22984450e72ceddabafe9f"}, "author": "Heath Padgett", "url": "http://www.huffingtonpost.com/heath-padgett/six-reasons-why-you-shoul_2_b_8359728.html", "ord_in_thread": 0, "title": "Six Reasons Why You Should Live in an RV During Your 20s", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSome days living in an RV drives me crazy. It's a small space, dishes pile up after a single meal, and you have to constantly dump your own... well, you know. \nHowever, on the better days of living in an RV I feel grateful. I feel gratitude because I \"own my home\" at 24 years old. I don't have a mortgage and living in an RV provides one less payment we have to make at the end of the month. I also feel grateful because of how much of the country I've been able to see in such a short amount of time. It wouldn't have been possible without living in an RV. \nMost 20-something people would never think of buying an RV, none the less living in one. We, speaking of the millennial crowd, are on great terms with \"living a simple life\" and we love tiny houses for their cool, sleek style, but not RVs. \nRVs are for older folks and retirees who want to go to Yellowstone, they aren't a feasible option for a young professional, certainly not a classy option. \nWrong. \nAn RV could be the greatest asset to your career and happiness in your life, especially if you're in your twenties. \nHere is why: 1. RV's can be extremely affordable. \nOur RV cost $11,500 and came in pretty good shape. The average rent where we used to live in Austin (for a one bedroom apartment) is $1,124/month according to rentjungle.com. \nThis means one year's rent in Austin will cost you $13,488, without factoring in the cost of utilities and such. By living in an RV for a few years after college, you could drastically save money on one of your largest expenses. And then when you are tired of living in an RV, you can sell it (if it's still in decent shape). RV's can hold their value well if you keep them out of bad weather and don't have any leaks. 2. Flexibility A photo posted by Heath Padgett (@heathpadgett) on Aug 30, 2015 at 2:25pm PDT \nApartment leases and home mortgages keep you stuck to the same spot, whether you like it or not. \nHaving an RV offers flexibility. For example, when my wife and I finished our 48 state road trip last December, I had a mentor ask me to help him launch his upcoming book and build some online products. The only problem? He lived in San Jose, California, one of the most expensive places to live in the country. \nBecause we had the flexibility of our RV, we were easily able to pick up and move out there for a couple months without breaking the bank. Sure, RV rent in San Jose is astronomically high compared to the rest of the country. But our two month stay was extremely cheap compared to if we would've had to find a sublet or short term apartment lease. We also didn't feel the pressure to stay longer than we needed to. \nRVing allows you to go where you find new opportunities or jobs without having to be tied down to any particular location. 3. It opens up your world if you can work remote. \nRemote working employees now account for over 3 million workers throughout America. Many traditional office-style jobs can now be transferred to virtual positions, meaning you can work from literally anywhere with Wifi. \nIf you're young and wanting to see the world, why not see more of the country instead of staying in one place? You can log into your work during the week, and on the weekends pack up and go to your next destination down in the Florida Keys. 4. It's a freaking awesome tool for paying off student debt. A photo posted by Heath Padgett (@heathpadgett) on Sep 1, 2015 at 3:04pm PDT \nThis past January my wife and I kicked out a crazy goal for 2015 called \"The Year of RV VS. Student Loan Debt\". I graduated from Concordia University Texas with $27,000 in student loans. Last year while traveling to 48 states we did not accrue any additional debt, but we didn't exactly rapidly pay it off either ( click here to see a breakdown of exactly how much it costs to drive to 48 states). \nNow that our travels aren't as crazy, living in an RV is our tool for paying off student debt. This year alone we've already been able to pay off over $14,000 in debt while living in our RV. We own the RV, so payments are not an issue. Our monthly \"RV park\" rent in Austin is $360/month (plus, it's lakefront). \nThe average student graduating from college right now is leaving with $34,000 of debt. The only thing worse than our country's acceptance of letting students graduate with ridiculous amounts of debt is when young people embrace their debt and go sign up for a mortgage or a nice apartment lease after receiving their diploma. \nWhile there are plenty of awesome case studies out there of people who paid off crazy amounts of debt, I feel the norm tends to lean towards people who are much older, now have kids, and are still attempting to pay off student loans. \nAs sad as this is, by leaving your comfort zone of a cushy apartment for a few years and living in an RV, you can easily save more money and kills these loans before they kill you, financially that is. Sallie Mae isn't a part of the mafia (that I know of). 5. More opportunities to connect with people you admire. A photo posted by Heath Padgett (@heathpadgett) on Aug 3, 2013 at 12:02pm PDT \nLast year while traveling across the country Alyssa (my wife) and I met with so many authors and influencers we had admired over the years. It seemed like all of a sudden it became so easy to connect with people we looked up to the most. How? We made ourselves much more accessible. \nWe were able to attend conferences like World Domination Summit in Portland, Oregon which boasts thousands of attendees each year and stop at random workshops throughout the country. When we'd stop, we would even offer up our film services to be more involved during these events. At World Domination Summit in particular we were able to stay in Portland over a week and interview all of the speakers and presenters. \nIf we had bought a plane ticket or only were able to take a few days off work to join the conference, this wouldn't have been an option. However, we did end up boon docking in a school parking lot for a few days while we were in Portland. It was a bit hot at night, but the relationships we made from the conference were well worth it. \nThe point I'm trying to make is this, it's much easier to connect with someone when you can email them and say, \"I'm going to be in town next week from Monday-Thursday. I love your work and it would be great to grab a cup of coffee together.\" \nPeople are much more likely to say yes if you're coming in from out of town and would like to meet with them, compared to if you already live in their town or send them an email asking for a phone call. Therefore, an RV is a great asset we've been able to use to meet people we admire. \nPlus, people love that we travel in an RV. It makes for a great story. We enjoy giving tours as well. 6. RVing teaches you to value experiences, reconnect with nature, and get rid of the crap you don't need. A photo posted by Heath Padgett (@heathpadgett) on Dec 4, 2014 at 5:27am PST \nI know I just sounded like a hippie, oh well. RVing this past year has caused us to be extremely aware of all of our belongings. We don't buy things we don't need, mostly because there would be literally nowhere to put it. Our clothes are pretty minimal, which isn't easy for a guy who used to own his own clothing line. I'm kind of a girl when it comes to my clothes, well, I was. \nRVing has helped me replace stuff with experiences . We would much rather spend a week in a national park than go out for a couple expensive dinners. It's been a huge blessing to break out of the consumer-like habit at a young age. The most detrimental thing to someone who's trying to pay off debt is to constantly be spending their money, RVing has helped me kick this habit (for the most part) and replace it with something better, a love for the outdoors and adventure. \nLiving in an RV during your twenties might seem unconventional, but it's also extremely practical. If you're trying to pay off debt and are barely making a starting salary, why in the heck would you spend all of your money on rent? It doesn't make sense. \nChoose a form of living that can benefit you in the long run, even if means sacrificing a bit of comfort. \nFollow Heath Padgett on Twitter: www.twitter.com/heathpadgett More:", "external_links": [], "published": "2015-10-23T00:31:00.000+03:00", "crawled": "2015-10-23T00:59:43.027+03:00", "highlightTitle": ""}