{"organizations": [], "uuid": "2efe715a55489ad9032040869a68b707e63617d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/199cc7a6e01ae97520f3588fa84983ea", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-ideas/united-palace-theatre-the-story-behind-one-of-the-fanciest-cinemas-in-the-world/story-fnjpj945-1227577700749?from=public_rss", "country": "IL", "title": "‘Palace of Versailles for regular folk’", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "‘Palace of Versailles for regular folk’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T14:22:00.000+03:00", "replies_count": 0, "uuid": "2efe715a55489ad9032040869a68b707e63617d0"}, "author": "", "url": "http://www.news.com.au/travel/travel-ideas/united-palace-theatre-the-story-behind-one-of-the-fanciest-cinemas-in-the-world/story-fnjpj945-1227577700749?from=public_rss", "ord_in_thread": 0, "title": "‘Palace of Versailles for regular folk’", "locations": ["Versailles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email a friend \nBEFORE the perks of modern day technology, before the existence of television and before we could binge on Netflix, people went to the cinema. Not just to catch the latest chick flick, but as an escape from the harsh reality of life. It was truly a social occasion. \nBy 1929 the world’s economy was coming to a grinding halt. The Great Depression saw the end of opulence and cracks were developing in global relationships that would eventuate in World War Two. \nBut for 25-35 cents, one could step into an alternate, affluent world. A world where life was celebrated and where the possibilities seemed endless. It was an affordable escape into Hollywood with all the luxuries only one could previously dream of. \nMovie palaces, according to Curbed , “in all their ostentatious, air-conditioned glory, were the Palaces of Versailles for regular folks”. It was “where the rich rubbed elbows with the poor”. \nFrom 1926-1930, theatre chain Loews opened five opulently designed movie “palaces” in and around New York City, operating as the brand’s flagship theatres. These venues, from Manhattan, Brooklyn, Queens, the Bronx and Jersey City, were a true marvel of modern design; stepping into a Wonder Theatre was like stepping into a King’s Palace. \nThat was no doubt the aim of Marcus Loew, founder of the eponymous chain and of Metro-Goldwyn-Mayer (MGM). “We sell tickets to theatres, not movies,” he said. Picture: Keri Megelus Source: Supplied Picture: Google Maps Source: Supplied \nPerhaps, this is where dreams were born. Here, Frank Sinatra saw Bing Crosby sing, Stanley Kubrick saw his first film at and Barbra Streisand and Sylvester Stallone worked as ushers. \nWhile Loews theatres can still be found in various locations across North America today after merging with AMC Theatres in 2006, you won’t find any as grand as its ‘Wonder Theatres’. \nThe last to be built, Loews 175th Street Theatre, was designed by one of New York’s greatest theatre architects of his time, Thomas Lamb. In his prime he designed over 300 complexes worldwide. \nBut his most elaborate creation was by far the 3400-seat Loew’s 175th Street Theatre in the uptown New York neighbourhood of Washington Heights, described as “a monument to eclectic orientalia with a Moorish/Rococo influence”. Picture: Keri Megelus Source: Supplied Picture: Keri Megelus Source: Supplied \nAt the time of its design the West’s fascination with exotic lands and cultures was at its peak, so it comes as no surprise the New York Times’ David W. Dunlap compared it to a “Byzantine-Romanesque-Indo-Hindu-Sino-Moorish-Persian-Eclectic-Rococo-Deco” in his 1990 book, On Broadway: A Journey Uptown Over Time. Clearly, Mr Lamb didn’t want to miss a cultural reference, or three. \nSo gaudy is its design, other critics have been less than impressed, with another New York Times writer describing the building as a “kitchen-sink masterpiece”. \nBut it was all a very deliberate design by Mr Lamb, who wrote that “Exotic ornaments, colours and scenes are particularly effective in creating an atmosphere in which the mind is free to frolic and becomes receptive to entertainment.” Picture: Keri Megelus Source: Supplied Picture: Keri Megelus Source: Supplied \nWithin these filigreed walls you’ll find ceilings enhanced with rich decor including authentic Louis XV and XVI furnishings that span the building’s entire city block. \nAccording to Cinema Treasures , “the perforated walls are embellished in an Indochinese decoration, while the foyer features a palatial staircase leading to a grandiose, aurora borealis headed by a goddess decoration, all in the style of a gaudy Hindu temple”. \nThe complex would spend close to four decades entertaining New Yorkers through film and live vaudeville until its closure in 1969, when the age of grand movie theatres was coming to a close. \nMiddle-class families moved to the suburbs, and as numbers declined, so did seats in the Wonder Theatres. Selling 3000 tickets to a movie became increasingly difficult after the advent of television, and so the multiplex was born, the final nail in the Wonder Theatres’ grandiose coffin. Picture: Keri Megelus Source: Supplied \nThat same year, on the verge of demolition, the venue was rescued by well-known TV evangelist Reverend Frederick J. Eikerenkoetter II, known to many as “Reverend Ike”. He spent over half a million dollars, and transformed it into a church, which still stands today as headquarters of the United Church Science of Living Institute. It is now known as the United Palace Theatre, or by some locals as “Reverend Ike’s Prayer Tower”. \nThankfully the complex still resembles its former self, except an addition of a prayer tower in the 1970s in the building’s northeast corner. \nWhile it no longer serves as a movie cinema, the United Palace Theatre is no stranger to a show, with the likes of Bob Dylan, Adele, John Legend, Björk, and Neil Young taking to its gilded stage. \n“This was built as the place for the neighbourhood to congregate,” Mike Fitelson, executive director of the United Palace of Cultural Arts, told the New York Times . \n“We’re just beginning to drag this beauty into the 21st century.” \nYou can discover New York’s historic jewels through Untapped Cities, who host tours through various sites across the city. Find more information here . The Fabulous Loews Wonder Theaters Holiday Picks", "external_links": [], "published": "2015-10-21T14:22:00.000+03:00", "crawled": "2015-10-21T14:31:49.494+03:00", "highlightTitle": ""}