{"organizations": [], "uuid": "87fdc40f0b459e76e4c1bcd5b8c178f61d8195e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/10/jawbone-up3-S.jpg", "site_section": "http://www.financialexpress.com/section/lifestyle/travel-tourism/", "section_title": "Travel News:Travel and Tourism,Latest Travel News,Tourism News Today,Latest Travel News Articles | The Financial Express", "url": "http://www.financialexpress.com/article/industry/tech/jawbone-up3-show-off-your-wrist/147511", "country": "IE", "title": "At Rs 14,999, Jawbone UP3 is among the best smartbands in the market", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "At Rs 14,999, Jawbone UP3 is among the best smartbands in the market | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T08:06:00.000+03:00", "replies_count": 0, "uuid": "87fdc40f0b459e76e4c1bcd5b8c178f61d8195e2"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/tech/jawbone-up3-show-off-your-wrist/147511", "ord_in_thread": 0, "title": "At Rs 14,999, Jawbone UP3 is among the best smartbands in the market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Reliance Communications-MTS merger likely by month end Deutsche Bank expects $7 billion loss for 3rd quarter Reliance Infrastructure to sell cement business to cut debt I have had the good fortune of trying out and testing quite a few wearable devices over the past couple of years. I have seen everything from the subtle to the absurd, and let me tell you there is a market and demand for everything. And India is among the newer markets where these devices are becoming a rage. That is why the top global players are making a beeline for India, the latest being Jawbone with a cross section of its smart bands.\nJawbone has been one of the earlier entrants in the smartband market and hence has some serious brand equity. Their USP is offering a significant style quotient with their bands, which are also simple and easy to use. The Jawbone UP3 is the latest in most popular UP range and looks a bit like its predecessors, though it goes ahead in technology. It retails for Rs 14,999.\nWhat is good?\nThe Jawbone UP3 is the lightest and smallest smartband I have used. It is there on your wrist the whole day, but you will forget about it soon after you have worn it. It is like a bangle that becomes part of yourself, and not a lot of wearables can claim to blend in this much.\nThe UP3 is really simple to use, for there is almost nothing on the band. You can set it to send you an alert if you have been idle for too long or have achieved your goals, and these can be dismissed with a single double tap. But that is it, there is nothing else the band will bother you with as everything else is on the smartphone app. See, not having a display can be a good thing at times.\nThe UP3 uses multi-sensor technology to track more than your steps and calorie burn. So this band collects comprehensive heart rate data, which when combined with other data gives a good idea of how your day has been. All of us are active, but only a small fraction of this activity actually translates to fat burn. Once you get a hang of this, you start pushing yourself a bit further.\nWatch the review video here\nThe UP app is among the better ones out there, right along with the Fitbit app. It tells you upfront what matters to you and it a percentage format. So it is not 3,330 step, but 33% of your goal that stands out and this bit adds to the motivation factor. Also, the app gives you the best sleep analytics, one that will be an eye opener really. I for instance got to know that my six-hours of sleep hardly has any deep sleep periods. The Jawbone UP app lets you push this data to a lot of other apps that you might be used to like RunKeeper. And this is something none of other other bands I have tried let you do. This is a good feature.\nWhat is not that good?\nWell, to start with I would not be comfortable wearing most of the UP3 band colours. There is one that is okay, and there are a couple that are passable. An office going, sober minded person is not really in Jawbone’s target audience I guess.\nThe new UP3 band strap is a bit complicated to master. It is a good thing that you don’t really have to take it out more often or you would be tied up in knots for a bit. I struggled the first week and even now I do get stuck with the buckle once in a while. The UP3 has a charger of its own, so it is another charger cable to add to your list while travelling. It is a good thing that the battery lasts a week, but still it is better to buy a couple of extra cables. Since there is not LED on the band, you will invariably end up wearing a watch to keep track of time. Are you game for two things on your wrist?\nVerdict\nThe Jawbone UP3 is among the best smartbands in the market, especially for those who tend to need a bit of style on their wrist. In fact, I would go a step further and say this is the best wearable for women.\n** Estimated street price: Rs 14,999\nFirst Published on October 08, 2015 12:06 am", "external_links": ["http://www.youtube.com/embed/5eITDCjZf04"], "published": "2015-10-08T08:06:00.000+03:00", "crawled": "2015-10-08T11:40:08.885+03:00", "highlightTitle": ""}