{"organizations": [], "uuid": "f86c8428d0d15e8b8462a74e28877dde0a54d819", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/new-Cycle-Sperrins.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tourism-ni-chairman-praises-new-cycle-sperrins-cluster-collaboration/", "country": "US", "title": "Tourism NI Chairman praises new Cycle Sperrins cluster collaborationTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Tourism NI Chairman praises new Cycle Sperrins cluster collaborationTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "f86c8428d0d15e8b8462a74e28877dde0a54d819"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tourism-ni-chairman-praises-new-cycle-sperrins-cluster-collaboration/", "ord_in_thread": 0, "title": "Tourism NI Chairman praises new Cycle Sperrins cluster collaborationTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourism NI Chairman praises new Cycle Sperrins cluster collaboration Published on : Friday, October 16, 2015\nThe chairman of Tourism NI has said cluster collaborations like Cycle Sperrins is key to supporting the region’s global agenda.\nTerence Brannigan was speaking at the launch of Cycle Sperrins – a tourism led initiative involving a group of small businesses in the Sperrins Cycle Consortium whose aim is to attract touring cyclists from across the globe to the rustic Sperrin Mountains.\nThe consortium was brought together by Far and Wild, the adventure company behind Cycle Sperrins, which provides bike hire and guides for the 160km multi-day cycle route.\nMr Brannigan, who was speaking to an audience of speciality food producers, farm businesses, tearooms and quality accommodation providers based along the world-class four day cycle route, said a cluster such as this plays a vital role in telling the story of the Sperrins.\nMr Brannigan said: “It often takes a combination of vision, enthusiasm and commitment to get things done in tourism – I can see this in abundance here from many individuals and organisations.\n“The fact that the Cycle Sperrins project has come to fruition so proficiently highlights the importance of the consortium approach and goes to show that working in partnership and with stakeholders yields positive results.\n“I really like the key idea behind Cycle Sperrins which is that each business passes on customers to the next point along the route. And that’s because tourism is everyone’s business. We are all in tourism together, and, the more we work together, the more we will prosper together.”\nMr Brannigan highlighted that activity tourism, of which cycling and mountain biking is part, is estimated to be worth around £100million to the Northern Ireland economy.\nHe said: “Cycling is also a key part of Tourism NI’s product development strategy, which over the past couple of years, has included investments of over £2.2 million in projects for mountain biking trails, off-road cycling, multi-use cycling and walking trails.\n“The local knowledge from each operator in the Cycle Sperrins will encourage visiting cyclists to encounter the local people and experience the many flavours and hidden gems they might miss if they go it alone.”\nMr Brannigan, who was at the launch in Broughderg, described Cycle Sperrins as “a powerful example of collaboration, clustering and partnership working”.\nHe said: “If 10 small experiential tourism businesses can do it so can many others who share a strong interest in working together to promote a top-quality product to the rest of the world.\n“We will always want and need initiatives like this – initiatives which let visitors experience the welcome, taste the food, enjoy the company and get out on their bikes to explore the history and myth of the Sperrins hills.”\nLawrence McBride, of Far and Wild, said: “Cycle Sperrins is really a wonderful cycling route that takes in the length and breadth of the Sperrins, sticking to minor roads and by-ways that get you into the true heart of the countryside.\n“For tourists it reveals the gems in this region – plentiful fresh air, lovely people, superb and unique small businesses. It is a credit to all 10 consortium partners who have the vision to work as one group with the same interest, increasing the tourism footfall in this delightful heart of Northern Ireland.”", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T07:49:04.600+03:00", "highlightTitle": ""}