{"organizations": [], "uuid": "357bea05650cc0da72e952efa33546fc46525d61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30166165/thor-announces-increased-regular-quarterly-dividend", "country": "US", "title": "Thor Announces Increased Regular Quarterly Dividend", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Thor Announces Increased Regular Quarterly Dividend - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "357bea05650cc0da72e952efa33546fc46525d61"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30166165/thor-announces-increased-regular-quarterly-dividend", "ord_in_thread": 0, "title": "Thor Announces Increased Regular Quarterly Dividend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Thor Industries, Inc.\nMarks More Than $1 Billion Returned To Shareholders\nELKHART, Ind. , Oct. 1, 2015 /PRNewswire/ -- Thor Industries, Inc. (NYSE:THO) today announced that its Board of Directors approved, at their October 1, 2015 meeting, an increase in the amount of Thor's regular quarterly dividend to $0.30 per share from $0.27 per share, an increase of 11%.\nThe regular dividend is payable on October 30, 2015 , to shareholders of record at the close of business on October 16, 2015 .\n\"The latest increase to our regular quarterly dividend marks the sixth consecutive annual increase in our quarterly dividend and more importantly, represents a significant milestone as Thor has now returned more than $1 billion in cash to shareholders in the form of dividends and share repurchases,\" said Peter B. Orthwein , Thor Executive Chairman. \"Just a few weeks ago, we celebrated the 35 th anniversary of Thor's purchase of Airstream, and the start of Thor. When Wade Thompson and I founded the Company back then, we couldn't have imagined that this business would grow to $4 billion in annual sales and return such a significant amount of cash to our shareholders. These accomplishments illustrate the strength of our business and the great team of people who have made this possible.\"\nAbout Thor Industries, Inc.\nThor is the sole owner of operating subsidiaries that, combined, represent one of the world's largest manufacturers of recreational vehicles.\nThis release includes certain statements that are \"forward looking\" statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward looking statements are made based on management's current expectations and beliefs regarding future and anticipated developments and their effects upon Thor Industries, Inc., and inherently involve uncertainties and risks. These forward looking statements are not a guarantee of future performance. We cannot assure you that actual results will not differ from our expectations. Factors which could cause materially different results include, among others, raw material and commodity price fluctuations, material or chassis supply restrictions, legislative and regulatory developments, the costs of compliance with increased governmental regulation, legal issues, the potential impact of increased tax burdens on our dealers and retail consumers, lower consumer confidence and the level of discretionary consumer spending, interest rate fluctuations and the potential economic impact of rising interest rates, restrictive lending practices, management changes, the success of new product introductions, the pace of obtaining and producing at new production facilities, the pace of acquisitions, the potential loss of existing customers of acquisitions, the integration of new acquisitions, the impact of the divestiture of the Company's bus business, the availability of delivery personnel, asset impairment charges, cost structure changes, competition, the potential impact of the strengthening of the U.S. dollar on international demand, general economic, market and political conditions and the other risks and uncertainties discussed more fully in ITEM 1A of our Annual Report on Form 10-K for the year ended July 31, 2015 . We disclaim any obligation or undertaking to disseminate any updates or revisions to any forward looking statements contained in this release or to reflect any change in our expectations after the date of this release or any change in events, conditions or circumstances on which any statement is based, except as required by law.\n releases/thor-announces-increased-regular-quarterly-dividend-300152889.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DE17556&Transmission_Id=201510011615PR_NEWS_USPR_____DE17556&DateId=20151001", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/thor-announces-increased-regular-quarterly-dividend-300152889.html"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T05:30:36.890+03:00", "highlightTitle": ""}