{"organizations": [], "uuid": "a4468680109073d52a7f7ccc2de63f2dafe6435c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Washington.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/metamorphosis-of-washington-into-destination-cool/", "country": "US", "title": "Metamorphosis of Washington into Destination CoolTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Metamorphosis of Washington into Destination CoolTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "a4468680109073d52a7f7ccc2de63f2dafe6435c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/metamorphosis-of-washington-into-destination-cool/", "ord_in_thread": 0, "title": "Metamorphosis of Washington into Destination CoolTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Metamorphosis of Washington into Destination Cool Published on : Saturday, October 3, 2015\nFirst-tier travel destinations like Washington, D.C. have the huge benefit of attracting overnight visitors based on their iconic attractions embedded in the public consciousness over decades in the making, but there’s always the danger of devolving into a collection of cliches.\nIf a destination becomes a victim of its own success because it’s too stuck to its legacy identity, the visitor economy flat lines and the average age of visitors grows older. The tourism tax base shrinks, hotel occupancy and rate stagnate, and it’s harder to drive increased attendance at conventions. All kinds of bad things happen.\nA decade ago, Washington, D.C. was flirting a bit too closely with that scenario because the city had plateaued as a tourism destination known almost solely for its museums, monuments and memorials. But then a propitious marketing collaboration presented itself that would have a significant impact on the city’s identity for both leisure and group travelers.\nIn 2012, the National Portrait Gallery approached the Destination DC marketing organization to discuss a potential partnership to promote an upcoming black and white photography exhibit called “American Cool.” The imagery profiled legendary entertainment figures from Muddy Waters to Steve McQueen to Madonna who all personified the very definition of cool.\nAround that time, the nation’s capital was midway through its long transition from a 9-to-5 city full of policy wonks to an emerging center of globally-infused hipness.\nBeginning around President Obama’s inauguration, the metamorphosis was driven in part by the city’s re-engagement with its arts and music heritage, the multicultural diversity, the ongoing gentrification of historic neighbourhoods, new design hotels, and a disproportionate number of ethnic restaurants.\nIn 2012, Elliott Ferguson, president and CEO of Destination DC, decided it was time to try and capitalize on that positive buzz to attract a broader and younger visitor base.\nHe and his team started batting around the idea of developing a new marketing campaign called “DC Cool,” inspired by the Portrait Gallery’s American Cool show. Then they imagined co-opting the same soulful black and white visual narrative of the photography exhibit to give the city something of a more sexy, film noir-ish nighttime vibe.\nThe DC Cool campaign officially kicked off in August 2013 with a dark and slinky YouTube video describing the most happening spots around town. The DCcool.com microsite launched soon after with a judicious mix of black and white imagery infused with full color social media visuals. Complementing that, the lifestyle content clearly targeted the educated, affluent traveler attracted to hip urban experiences, especially after the sun goes down.\nA year later in 2014, Forbes anointed Washington, D.C. with its “Coolest City in America” designation, which is perhaps something of a dubious honour. Houston had won in 2012.", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-03T04:09:35.556+03:00", "highlightTitle": ""}