{"organizations": [], "uuid": "84ddecf437dd2c8a8c369c736233804cea4b2680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/10/21/article-urn:publicid:ap.org:c76a5f7c1e6045dda2e98ea270629887-41wHZHzzPY76e40e15e438086992-571_636x382.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3282987/Barcelonas-Sagrada-Familia-begins-work-immense-towers.html", "country": "GB", "title": "Work begins on immense towers of Barcelona's Sagrada Familia", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 3, "title_full": "Work begins on immense towers of Barcelona's Sagrada Familia | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:44:00.000+03:00", "replies_count": 2, "uuid": "84ddecf437dd2c8a8c369c736233804cea4b2680"}, "author": "Ted Thornhill for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3282987/Barcelonas-Sagrada-Familia-begins-work-immense-towers.html", "ord_in_thread": 0, "title": "Work begins on immense towers of Barcelona's Sagrada Familia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1\nView\ncomments\nWork on Barcelona's breathtaking La Sagrada Familia Basilica, designed by visionary architect Antoni Gaudi, has entered its final phase of raising six immense towers that will make it Europe's tallest religious building, surpassing Germany's Ulm Minster.\nPresenting the project on Thursday, chief architect Jordi Fauli said the central 'Tower of Jesus Christ,' the tallest of the six, will make the architectural marvel that draws millions of visitors each year one for the record books when it is finished in a little over a decade.\n'The central tower of 172.5 meters (566 feet) will make it the tallest cathedral in Europe, because the tallest tower in Europe is Ulm, at 162 meters (531.5 feet),' Fauli said.\nA model of the Sagrada Familia Basilica designed by architect Antoni Gaudi is displayed at the Sagrada Familia Basilica in Barcelona\nChief architect Jordi Fauli speaks during a news conference explaining the progress of the work at the Basilica Sagrada Familia\nA view of the Sagrada Familia Basilica, designed by architect Antoni Gaud\nSt. Peter's Basilica in Rome will still have the tallest interior.\nThe Sagrada Familia, an emblematic fixture of the Barcelona skyline and a major tourist site, had its first stone laid in 1882. It is 70-percent complete and currently tops out at 112 meters (367 feet).\n Next End of the inflight movie? Screens set to be axed from... They've got the look! The world's best clothes... Could IRAN be the top tourism destination of 2016? Country... Crime novels, Ingrid Bergman and Bronze Age rock carvings:... Now that's a wild cat: The incredible pictures of Burma the... Give your holiday the X Factor: Inside the luxurious judges'... Fauli said the plan to have the towers and most of the church's structure completed in 2026 for the 100th anniversary of Gaudi's death is still on schedule. He said there will still be some elements left to finish, such as decorations.\n'It's difficult to predict but we can say that it will be completed by 2030, 2032,' he said.\nThe 'Tower of Jesus Christ' will be crowned by a cross and tightly surrounded by five other towers, one dedicated to Mary and four slightly shorter ones for the four evangelists.\nGaudi won the patronage of some of Barcelona's wealthiest industrialist and upper-crust families, who commissioned him to build gorgeous homes and other daring buildings and parks that have helped make Barcelona a leading tourist destination\nPresenting the project on Thursday, chief architect Jordi Fauli said the central 'Tower of Jesus Christ,' the tallest of the six, will rise 172.5 meters (566 feet) high\nGaudi, who died in 1926 after being struck by a trolley, never expected the cathedral to be completed in his lifetime. Only one facade was finished when he died\nFauli said the plan to have the towers and most of the church's structure completed in 2026 for the 100th anniversary of Gaudi's death is still on schedule. He said there will still be some elements left to finish, such as decorations\nThe monument received more than 3.2 million visits in 2014, making it one of the biggest tourist sites in Spain\nFauli unveiled the next phase of the construction in a newly finished chamber that formed a small amphitheater, perched 60 meters (196 feet) above the floor of the church from where hundreds of visitors gazed at the church's stained glass windows and arching ceilings.\nThe tower will rise directly above the chamber, which is designed to support the weight of the towers and channel sunlight into the building.\nA mere 15 years ago, there was no roof on the inner part of the church as it stood between the two beautiful facades with eight bell towers that leave spectators overcome with awe, one side looking like a sand castle and the other a work of art inspired by cubist painting.\nGaudi won the patronage of some of Barcelona's wealthiest industrialist and upper-crust families, who commissioned him to build gorgeous homes and other daring buildings and parks that have helped make Barcelona a leading tourist destination.\nA fervent Catholic, Gaudi largely dedicated his life to the project, incorporating both Christian symbolism and organic forms into a unique aesthetic.\nGaudi, who died in 1926 after being struck by a trolley, never expected the cathedral to be completed in his lifetime. Only one facade was finished when he died.\nFauli took over as the chief architect in 2012. He inherited the charge of carrying on the task of making Gaudi's drawings, some of which were only rough sketches, into the massive monument that is now reaching its conclusion.\nThe monument received more than 3.2 million visits in 2014, making it one of the biggest tourist sites in Spain.\nThe entrance fees of 15-20 euros ($17-22) finance the construction budget of 25 million euros ($28.38 million) a year.\nFauli took over as the chief architect in 2012. He inherited the charge of carrying on the task of making Gaudi's drawings, some of which were only rough sketches, into the massive monument that is now reaching its conclusion\nA fervent Catholic, Gaudi largely dedicated his life to the project, incorporating both Christian symbolism and organic forms into a unique aesthetic\nThe Sagrada Familia, an emblematic fixture of the Barcelona skyline and a major tourist site, had its first stone laid in 1882. It is 70-percent complete and currently tops out at 112 meters (367 feet)", "external_links": ["http://dailym.ai/1OIe0tv"], "published": "2015-10-22T00:44:00.000+03:00", "crawled": "2015-10-22T14:04:29.731+03:00", "highlightTitle": ""}