{"organizations": [], "uuid": "380f41aecd3f59be4db194222453cba12fd9ae44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03478/clearing-out-desk_3478924k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-23.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/women/womens-business/11945462/Work-bullying-Lost-my-job-because-of-my-boss.html", "country": "US", "title": "'I was bullied out of the job I loved'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "'I was bullied out of the job I loved' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T14:00:00.000+03:00", "replies_count": 0, "uuid": "380f41aecd3f59be4db194222453cba12fd9ae44"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/women/womens-business/11945462/Work-bullying-Lost-my-job-because-of-my-boss.html", "ord_in_thread": 0, "title": "'I was bullied out of the job I loved'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "She and I had never got along very well. She thought I was stroppy, I thought she was lazy – and neither of us made much of an attempt to disguise our opinions. But we could be civil – tolerating one another was a perfectly manageable part of a job that I otherwise loved. But I hadn’t counted on quite how much my boss disliked me . From the moment she arrived in our marketing office, my manager began her subtle campaign to undermine me. It became the norm for my ideas to be met with an eye roll so understated I’d wonder if I had imagined it. Sarcastic comments in the monthly meeting I chaired were all too frequent – enough for me to look that bit less authoritative in front of my team, but just jokey enough to be laughed off had I questioned her about them afterwards. 'She light-heartedly told a room full of people that something I’d said earlier that day made her want to vomit' There were evening work events she didn’t tell me about, only asking the next day why I hadn’t been there; important planning meetings that she would ‘forget’ to invite me to until five minutes before, meaning I had no time to prepare for them. As isolated occurrences, they were harmless; I’d have sounded petty had I kicked up a fuss when she light-heartedly told a room full of people that something I’d said earlier that day made her want to vomit. The problem with this type of bullying is that there is no single incident that would stand up in an HR meeting as evidence of victimisation. It’s a slow and steady chipping away at your confidence and authority. But put the long list of incidents together and it all looks less innocent. From the moment she arrived in our marketing office, my manager began her subtle campaign to undermine me. Photo: Getty She didn’t like the fact that I had noted her sly ability to always have a handy ‘meeting’ booked at 4pm on a Friday – and then not come back. Or that, after a junior had worked tirelessly on a project, I spoke up when my boss accepted all the praise for it. She’d carved out a cosy, well-paid niche for herself, where she did as little as possible while taking as much credit as she could . I was wise to her, which made me a threat. Most of our colleagues stayed neutral, but a few took her side, and would stop talking when I came into the room. At this stage of my career, the insecurities of my 20s had long gone. I was in my mid-30s, confident, able, respected in my industry. But suddenly I felt like a child at a new school, wondering if anyone would be my friend. 'Suddenly I felt like a child at a new school' I began to lose my grip on the one certainty that I had always been able to cling to: that I was good at my job. Slowly, some of my key responsibilities were given to other staff members, the meetings I chaired were deemed no longer necessary. The harshest insult came without warning or explanation: a new person was drafted in to oversee my work. So what did I do? I’d love to say I fought for my reputation. I didn’t. I got a new job. I never challenged my boss or told her she was wrong to doubt my skills. I just did what they wanted and left. The brutal truth is that it felt shameful to have it made clear you’re no longer needed. Six years on, I love my job, my colleagues seem to like me and my new boss rates me – she makes a point of telling me so. This should be the happy ending, right? It is, 99 per cent of the time. But even though I know I shouldn’t care, it still stings; it really stings. Has one day changed your life? Email us at stella@telegraph.co.uk or tweet us at @stellamagazine #OneDay telegraph.co.uk", "external_links": [], "published": "2015-10-23T14:00:00.000+03:00", "crawled": "2015-10-23T19:07:41.529+03:00", "highlightTitle": ""}