{"organizations": [], "uuid": "abd82b03b98d818b07c2e80801dbe3d685ee96ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/airBaltic_logo.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/airbaltic-teams-up-with-lot-polish-airlines/", "country": "US", "title": "airBaltic Teams Up with LOT Polish AirlinesTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "airBaltic Teams Up with LOT Polish AirlinesTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "abd82b03b98d818b07c2e80801dbe3d685ee96ff"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/airbaltic-teams-up-with-lot-polish-airlines/", "ord_in_thread": 0, "title": "airBaltic Teams Up with LOT Polish AirlinesTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "airBaltic Teams Up with LOT Polish Airlines\nLatvian airline airBaltic has concluded a cooperation agreement with LOT Polish Airlines, known in the industry as code-share agreement. This cooperation will offer convenient connections to southeastern Europe for airBaltic customers, while LOT Polish Airlines passengers will benefit from better access to northern Europe.\nChristophe Viatte, Chief Commercial Officer of airBaltic: “As we reinforce links between Riga and other hubs, our customers benefit immediately from better connectivity with regions where direct flights are unavailable. A strong family of partner airlines with whom we code-share ensures smooth and seamless travel for airBaltic customers via these points. Current code- share partners include most of the major European airlines. We are very pleased to add LOT Polish Airlines to this growing family, which has now reached a total of 20 airlines. It is a very symbolic number that has been achieved this month, when airBaltic celebrates its 20th anniversary.”\nMichał Nowak, Strategy, Partnerships and Alliances Executive Director: “LOT consequently builds its hub in Warsaw, offering convenient and wide network to growing number of passengers. We are happy that thanks to the partnership with airBaltic even more travellers from Latvia will connect at Chopin Airport for LOT’s flights. At the same time we are delighted to offer our passengers new destinations served by airBaltic. I strongly believe this partnership will bring additional value and even more comfortable and hassle free journey to many customers of both airlines.”\nairBaltic and LOT offers together up to twice daily flights on the Riga – Warsaw route. The new partnership will allow LOT Polish Airlines to offer their passengers convenient connections between Warsaw and Oslo (Norway), and between Warsaw and Helsinki (Finland). At the same time, airBaltic will offer its passengers two new and convenient destinations – Sofia (Bulgaria) and Belgrade (Serbia).\nairBaltic serves over 60 destinations from its home base in Riga, Latvia. From every one of these locations, airBaltic offers convenient connections via Riga to its network spanning Europe, Scandinavia, CIS and the Middle East. In addition, airBaltic also offers new direct flights from Tallinn and Vilnius.", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T05:44:13.097+02:00", "highlightTitle": ""}