{"organizations": [], "uuid": "f8e3390a8ad95be4fb894bd025883fa5d1507a7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gocalifornia.about.com", "main_image": "http://f.tqn.com/y/gocalifornia/1/S/k/v/2/IMG_8434-a.jpg", "site_section": "http://z.about.com/6/o/m/gocalifornia_t2.xml", "section_title": "About.com California Travel: What's Hot Now", "url": "http://gocalifornia.about.com/od/casfmenu/a/Alcatraz-Facts.htm", "country": "US", "title": "12 Things You Probably Didn't Know About Alcatraz", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "12 Things You Probably Didn't Know About Alcatraz", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T14:07:00.000+03:00", "replies_count": 0, "uuid": "f8e3390a8ad95be4fb894bd025883fa5d1507a7f"}, "author": "", "url": "http://gocalifornia.about.com/od/casfmenu/a/Alcatraz-Facts.htm", "ord_in_thread": 0, "title": "12 Things You Probably Didn't Know About Alcatraz", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Betsy Malloy"], "text": "Expert Videos Cells were smaller than a closet. ©2014 Betsy Malloy Photography. Used by Permission. \nAlcatraz was the \"super max\" federal prison of its day, a far cry from its modern, heavily fortified equivalent in Florence, Colorado, with its multitude of motion detectors and cameras, 1,400 remote-controlled steel doors., pressure pads and twelve-foot-tall razor wire fences. These are a few of the most interesting facts about \"The Rock\" The name means \"strange birds\" or pelican, according to the Bureau of Prisons website. In 1775, Spanish explorer Lt. Juan Manuel de Ayala (who first mapped the San Francisco Bay) named it the island \"de los alcatraces\". Cells were smaller than a closet: In B & C blocks, the cells were 5 feet by 9 feet, with a toilet and small sink (cold running only). Today's walk-in closets are about 6 feet by 6 feet, or bigger. Alcatraz has great gardens: When Alcatraz was an active prison, its officers and their families planted gardens. The hardy plants they chose survived decades of neglect until 2003, when Gardens of Alcatraz partnered with the National Park Service to restore and maintain them. They offer guided tours of the gardens a few days a week, taking visitors to Officers’ Row and the Rose Terrace, which are off limits to other visitors. Get the current schedule . Some of its earliest prisoners were protesters: In 1895, nineteen Hopi Indians were imprisoned on Alcatraz because they refused to farm the way the government told them to and were against their children's forced education in government boarding schools.. Read more about it here . Alcatraz is a birdwatcher's bonanza: In other places, you'd have to peer at nesting seabirds with binoculars, but on Alcatraz, it's easy to get much closer. Among the species you'll see are cormorants, orange-footed pigeon guillemots, snowy egrets and black-crowned night herons - and Western Gulls, the island's most numerous bird species. More info is here . It wasn't always a prison: It was originally a fort, declared a military reservation in 1850 by President Millard Fillmore. In 1859 (two years before the Civil War began), troops moved in to defend the Bay Area. In 1907, Alcatraz became an official U.S. military prison and remained one until 1933, when the facility transferred to the Bureau of Prisons. Families lived on Alcatraz during its prison years: The guards and officers lived on the island with their spouses and children. There's even an Alumni Association for folks who grew up there. Prisoners actually did escape from Alcatraz - but when it was a military post, not during its tenure as a federal prison. According to the National Park Service history of Alcatraz , imprisoned soldiers on work assignments at mainland army posts sometimes just walked away. Site SF Genealogy says another enterprising inmate simply forged a transportation permit, got on a boat and left. It Was Never Full: The average number of prisoners was 260, but as few as 222 and as many as 320. Alcatraz Didn’t have a “Death Row” nor any facilities for executing the death penalty, but a few prisoners did die while imprisoned there. Some were murdered by other inmates, a few committed suicide and others died of natural causes. Alcatraz might be haunted: Check out this resource which details some of the reported paranormal occurrences, including one that suggest Al Capone might be among its \"haunts.\" It has a lighthouse: In fact, it was the first West Coast lighthouse, activated in 1854. It helped guide ships in the San Francisco Bay until the early 1900s when a new building on the island blocked it from the view of arriving ships. More about Alcatraz lighthouse . \nIf you can't get enough of facts like this, you might enjoy The Secrets of Alcatraz by Susan Sloate. Related Articles", "external_links": [], "published": "2015-10-15T14:07:00.000+03:00", "crawled": "2015-10-15T20:58:18.199+03:00", "highlightTitle": ""}