{"organizations": [], "uuid": "f7bd5132107ba1a0842c8a98599c3490ebfdb854", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64956/yas-island-rotana-and-centro-yas-island-abu-dhabi-new-appointmen", "country": "US", "title": "Yas Island Rotana and Centro Yas Island, Abu Dhabi: New appointment", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Yas Island Rotana and Centro Yas Island, Abu Dhabi: New appointment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T22:05:00.000+03:00", "replies_count": 0, "uuid": "f7bd5132107ba1a0842c8a98599c3490ebfdb854"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/64956/yas-island-rotana-and-centro-yas-island-abu-dhabi-new-appointmen", "ord_in_thread": 0, "title": "Yas Island Rotana and Centro Yas Island, Abu Dhabi: New appointment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yas Island Rotana and Centro Yas Island, Abu Dhabi: New appointment   \nOct 18, 2015 Ina Boneva, Yas Island Rotana and Centro Yas Island, Abu Dhabi: eTN   \nYas Island Rotana & Centro Yas Island, Abu Dhabi, announced the appointment of Ina Boneva as the new Director of Human Resources. \nThis key position in Rotana is vital in overseeing functions of the company’s dedication in cultivating dynamic and exceptional workforce and talents to provide unparalleled quality in hospitality service, and building winning culture through strategic leadership and direction as a leading multi-national hospitality company in UAE. \nIna brings over 5 years of hospitality experience, significantly handling key roles in human resources from other hotel companies in Abu Dhabi. One of which being the previous Assistant Director of Human Resources in Rotana’s flagship hotel - Beach Rotana, Abu Dhabi. With her excellent skills and knowledge in the field, Ina’s appointment is imperative to achieving remarkable results for Yas Island Rotana and Centro Yas Island. \nIna holds a Bachelor’s degree with distinction in Business Administration in Hotel Management with Entrepreneurship from Bluche Switzerland, and certifications in other hospitality industry from countries like France and Hong Kong. Her appointment is believed to solidify talent programs and define the strategies that will help drive Yas Island Rotana and Centro Yas Island to new levels of excellence. \nYas Island Rotana is located in close proximity to the Abu Dhabi Airport, Yas Marina Circuit, Yas Links Golf Club, Ferrari World Abu Dhabi, Yas Mall and Yas Beach.", "external_links": [], "published": "2015-10-18T22:05:00.000+03:00", "crawled": "2015-10-19T00:58:43.053+03:00", "highlightTitle": ""}