{"organizations": [], "uuid": "ab1c1171a575ec2bc4f7220a6b64ba25adf317dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64425/yvr-welcomes-national-airlines-vancouver", "country": "US", "title": "YVR welcomes National Airlines to Vancouver", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "YVR welcomes National Airlines to Vancouver", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T04:26:00.000+03:00", "replies_count": 0, "uuid": "ab1c1171a575ec2bc4f7220a6b64ba25adf317dd"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64425/yvr-welcomes-national-airlines-vancouver", "ord_in_thread": 0, "title": "YVR welcomes National Airlines to Vancouver", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "YVR welcomes National Airlines to Vancouver   02, 2015 eTN   \nRICHMOND, BC, Canada - Today, Vancouver Airport Authority announced the upcoming arrival of National Airlines to Vancouver International Airport (YVR). Starting January 20, 2016, the twice weekly scheduled service will operate between Orlando-Sanford International Airport (SFB) and YVR. \n\"We are delighted to welcome a new carrier to YVR which will boost tourism and provide greater selection for travelers when headed to sunny Florida,\" said Craig Richmond, President and CEO, Vancouver Airport Authority. \"This new service increases YVR's overall capacity to Orlando and provides a direct link to the city's second airport.\" The new service will create 45 new jobs, $1 million in new taxes and $3.2 million in Gross Domestic Product for British Columbia. With more than 24,000 people working on Sea Island, YVR continues to be a key jobs creator for the province and a significant economic driver. \n\"Vancouver is one of Canada's premier cities with a diverse international population base. We are honored to be providing the Vancouver community with timely, direct service to Orlando that will facilitate additional opportunities for those residents to experience all South Florida has to offer,\" said Ed Davidson, National Airlines President and COO. \nNational Airlines will operate a Boeing 757-200 aircraft on the route. Flights will depart SFB on Wednesdays and Saturdays at 18:45 and arrive in YVR at 22:15. The aircraft will turn around and leave YVR at 23:55 and arrive in SFB at 08:30 the following morning. The airline, headquartered in Orlando, Florida has a strong international cargo operation. Sanford International Airport is located midway between Orlando's world class attractions and Daytona Beach; both at 50 minutes or less.", "external_links": [], "published": "2015-10-02T04:26:00.000+03:00", "crawled": "2015-10-02T04:48:33.304+03:00", "highlightTitle": ""}