{"organizations": [], "uuid": "020a8836a2340c105838aa77d1841877f4e0cb1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.egyptindependent.com", "main_image": "", "site_section": "http://www.egyptindependent.com/rss-feed-term/154/rss.xml", "section_title": "Egypt Independent: Travel", "url": "http://www.egyptindependent.com//news/awards-name-best-luxury-value-and-dining-cruise-lines", "country": "US", "title": "Awards name best luxury, value and dining cruise lines", "performance_score": 0, "site": "egyptindependent.com", "participants_count": 1, "title_full": "Awards name best luxury, value and dining cruise lines", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:17:00.000+03:00", "replies_count": 0, "uuid": "020a8836a2340c105838aa77d1841877f4e0cb1a"}, "author": "AFP", "url": "http://www.egyptindependent.com//news/awards-name-best-luxury-value-and-dining-cruise-lines", "ord_in_thread": 0, "title": "Awards name best luxury, value and dining cruise lines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Awards name best luxury, value and dining cruise lines On Shopping for a cruise holiday? Experts at one of the biggest online cruise sites have released their picks in categories that cover all budgets and needs. In the eighth edition of the Cruise Critic Editors' Picks Awards, judges named Crystal Cruises the best luxury brand, while giving Carnival Cruises the award for best value for money. Other big winners include Viking Star, which was named best new ship of 2015. Editors compared the ship with a boutique hotel and praised the inclusive package for offering complimentary WiFi, alcoholic beverages at meal times, and a free shore excursion in every port. New this year, the awards have been expanded to include river cruises. Best New Ship: Viking Star (Viking Ocean Cruises) Best Ship Refurbishment: Star Breeze (Windstar Cruises) Best for Luxury: Crystal Cruises Best for Families: Royal Caribbean International Best Itineraries: Azamara Club Cruises Best for Adventure: Un-Cruise Adventures Best Value-for-Money: Carnival Cruise Line Best Dining: Celebrity Cruises Best Entertainment: Royal Caribbean International Best Suites: Royal Caribbean International Best Inside Cabins: Disney Cruise Line Best Standard Cabins: MSC Cruises Best Shore Excursions: Azamara Club Cruises Best for Romance: Windstar Cruises Best Nightlife: Norwegian Cruise Line Best North American Homeport: Port Canaveral 2015 Cruise Critic Editors' Picks Awards (River) Best River Cruise Line: Uniworld Boutique River Cruise Collection Best New River Ship: SS Maria Theresa (Uniworld Boutique River Cruise Collection) Best Dining: AmaWaterways Best Enrichment: Grand Circle Cruise Line Best Shore Excursions: Uniworld Boutique River Cruise Collection Best for Active Cruisers: AmaWaterways Best Itineraries: Viking River Cruises Best Value-for-Money: Emerald Waterways.", "external_links": [], "published": "2015-10-08T16:17:00.000+03:00", "crawled": "2015-10-08T17:18:15.025+03:00", "highlightTitle": ""}