{"organizations": [], "uuid": "396e1434e60c7b30012485a66093a5f50ab73638", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theplanetd.com", "main_image": "http://theplanetd.com/images/solo-traveller.jpg", "site_section": "http://theplanetd.com/feed/", "section_title": "The Planet D: Adventure Travel Blog", "url": "http://theplanetd.com/solo-traveller-confessions-amusement-and-self-discovery-in-kyoto/", "country": "US", "title": "Solo Traveller Confessions – Amusement and Self Discovery in Kyoto", "performance_score": 0, "site": "theplanetd.com", "participants_count": 1, "title_full": "Solo Traveller Confessions – Amusement and Self Discovery in Kyoto", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T12:00:00.000+03:00", "replies_count": 0, "uuid": "396e1434e60c7b30012485a66093a5f50ab73638"}, "author": "Dave and Deb", "url": "http://theplanetd.com/solo-traveller-confessions-amusement-and-self-discovery-in-kyoto/", "ord_in_thread": 0, "title": "Solo Traveller Confessions – Amusement and Self Discovery in Kyoto", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted By Dave and Deb • 7 Comments » • Guest Posts , Solo Travel Tips \nThe other day my mom asked me if I liked traveling alone . My immediate answer was a very loud YES. As an introvert, traveling by myself is the ultimate deal. I’m on my own schedule, there’s no need for small talk, and there’s absolutely no pressure to watch a show that involves audience participation. I have had to do all of these things while on family trips, and it was horrible. However, though I love the independence and freedom that comes with traveling alone, I’ll be the first to say that being a solo traveller can get lonely sometimes. Sometimes, one really is the loneliest number. For me, that ‘sometimes’ was in Kyoto. Solo Traveller Confessions from Kyoto \nMaking friends when you’re traveling by yourself is extremely easy. Especially if you’re staying at a hostel. Whether it’s while sharing your life stories over a drink or brushing your teeth at the same sink, striking up conversations within a hostel is very easy. Yes, even for an introvert. And as an introvert, I usually have a game plan on how to make friends/strike up conversations. First is finding someone else who is traveling by themselves. Once found, invite said person or persons for a drink. Then, sit back and let the socializing and life-lasting friendships happen. \nInterested in solo travel: Read how being a female solo traveller made Jessica Festa Stronger \nFirst thing I noticed when I got to my hostel in Kyoto was that there were absolutely no solo travelers. Everyone was part of a big group. Huh—my game plan didn’t take this variable into account. Okay, there might have been other solo travelers there but maybe they felt the same vibe and did exactly what I did, which was hide. With the realization I may not make any friends, the wheels of the loneliness train I call Ole Anxiety were oiled. Left: Awesome hostel bunk. If you’re short like my I highly recommend asking for the lower bunk. Right: Groups of people, definitely not solo travelers. \nBeing alone and feeling lonely are two completely different things. One can feel loneliness while in a room full of people. One can also be alone and not feel loneliness. For me, it was a double whammy. I was alone and I felt lonely. \nWorried solo travel? read: 8 Myths of Solo Travel and What Really Happened to me \nThe climax of this loneliness happened my first night in Kyoto while I was walking to a ramen place I found on TripAdvisor. It was late, it was dark, I was alone. This reads like the start of a horror/thriller story. It’s not. But the half-mile walk from the subway station to the ramen joint, partnered with my 40mph walking speed, made for a lot of internal monologue time. Boy, do I love internal monologues. \nBy this point I had been in Japan for four days. Not too long, but long enough for me to miss my family. And Mexican food. I also missed conversations in my native tongue. I missed the ocean breeze of home and the game of “will I stop by In N Out at 1am for a shake or won’t I?” I always did. When I was younger I would spend my summers with my dad in Northern California. I was fine the first couple days, but by the fourth day, always the fourth day, I would be crying and begging my dad to send me back to my mom and brother because I missed them so much. I thought I had outgrown that. Apparently not. Only now, I miss my mom, brother, and Mexican food. \nI made it to the ramen place. Ordered with my signature smile and awkward pointing to the photo of ramen they had on their menu. It was delicious. When I was done eating, I sat there, already dreading the walk back to the station. Dreading the loneliness. On my way out of the restaurant I turned back with the intention of snapping a photo. But I didn’t. I was feeling so down I didn’t even want to take a photo. That’s how I knew it was bad. But then the woman who worked there came to the glass door and gave me the most genuine smile and hand wave ever. It hit me then. I could be alone and choose to let the feelings of loneliness and missing home overwhelm me, or I could be alone and enjoy the company of the new and exciting world around me. Wouldn’t it be great if I chose the latter? That would have made a great blog post. Yeah, I definitely didn’t do that. I definitely had myself a pity party all the way to the subway station. But then I took a photo of a McDonald’s and posted it to Facebook with the caption “eating authentic Japanese food”. And then I laughed because I’m HILARIOUS. Side Note: If I was the headmaster of a wizarding school I would give Social Media 10 points. Having family and friends (and that one guy from high school I never talk to) comment and like my post gave me a small sense of the familiarity I was missing. Social media, if used correctly, is a great tool. \nYes, I was lonely. And yes, I chose to wallow in it for a bit. But during my trip I was also amused, excited, scared, cautious, tired, and a bunch more adjectives I can’t think of because Thesarus.com isn’t working right now. I experienced a multitude of feelings while in Japan and I wallowed in every single one of them. \ncheck out: Solo Travel in India – Tips from an Indian Female Traveller \nGrowing up we are constantly told to be happy but not too happy. You can be sad but not sad enough that it makes other people sad. We’re taught to control our feelings. Not necessarily a bad thing. But should we have to control our feelings when we’re with ourselves? Should we have to censor ourselves to ourselves? I don’t think so, and this trip to Japan was a big lesson in that. I hate to use the word ‘self discovery’ because it sounds like something they would say in a trailer for a Hallmark movie, but, man, I can’t think of a better word (Thesaurus.com is still down). Okay, how about this. This trip wasn’t really about me discovering myself, but instead me realizing there was a ‘self’ to discover. Kind of like, “Oh, wow, adult Sam is very different from ten years ago Sam. Hi, it’s nice to meet you”. And maybe a little bit of “Hey, it’s been awhile. I’ve missed you”. I bet some of you who are reading this (Hi Mom!) can relate. \nTraveling is awesome. That’s not an opinion; that’s a fact. I spent thousands of dollars to go to grad school, so you can trust me on that. Traveling is awesome. Traveling by yourself is life-changing. But, with our world full of Instagram accounts and blog posts full of the excitement and adventure found in traveling, it’s easy to overlook the emotions on the other end of the spectrum. Fear, loneliness, anxiety, tiredness. All that plus more is experienced when traveling. Isn’t it great, though, that we can experience all that? That’s what makes traveling the absolute best. You can live so much in such a short amount of time. Go out there and live! \nMuch Love. Always \n-Sam \nSamantha Jeet is an aspiring travel photographer, writer, and storyteller. She was raised on islands in the Pacific and currently resides in San Diego, California where she works as cartographer and lifestyle photographer. Samantha holds a B.S. in Health Care Administration and an M.S. in Geographic Information Sciences. She promised her mom she would mention that. \nCheck out her website samanthajeet.com or follow her on Instagram @samjeet", "external_links": [], "published": "2015-10-16T12:00:00.000+03:00", "crawled": "2015-10-18T05:47:31.482+03:00", "highlightTitle": ""}