{"organizations": [], "uuid": "636544cc3444a34973838b3685221b02ae1fad2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151009080642-china-communist-park-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/10/08/travel/china-wuhan-communist-party-theme-park/index.html", "country": "US", "title": "China opens Communist Party theme park", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "China opens Communist Party theme park - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T12:16:00.000+03:00", "replies_count": 0, "uuid": "636544cc3444a34973838b3685221b02ae1fad2d"}, "author": "Shen Lu", "url": "http://edition.cnn.com/2015/10/08/travel/china-wuhan-communist-party-theme-park/index.html", "ord_in_thread": 0, "title": "China opens Communist Party theme park", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Wuhan in Central China has opened a theme park dedicated to the Communist Party The aim is to highlight key figures and events related to the country's only and ruling party Web users don't seem to appreciate the government project (CNN) Who needs Disneyland when you can have a theme park for youngsters to declare their loyalty to China's Communist Party?\nThat's what Wuhan government officials seem to think anyway.\nThe capital city of China's central Hubei province has just opened a Communist Party theme park dedicated to China's homegrown heroes.\nOpened to the public on September 28, it's located inside the 300,000-square-meter South Lake Happiness Bay Water Park.\nIt's just one of six parks the city has planned to promote patriotism and party ideals.\nRead More 'Red benefit' for Wuhan citizens\nThe focus of this particular park will be on the people of the Communist Party .\nDescribed by state media as an enjoyable \"red benefit\" for the city's residents, the new attraction's the biggest communist-themed park in Central China.\nThe park's dotted with the faces and stories of 29 \"excellent party figures\" on bronze plates and 23 artworks highlighting significant moments from Chinese Communist Party history between 1921 and 2014.\nThe events are depicted in installations inspired by the traditional Chinese art form of paper-cutting.\nRed tourism is big business in China. Here, tourists dress up as Red Army soliders during an educational tour in Jinggangshan, the birthplace of the Chinese revolution. The park consists of four display areas with different highlights and mini-themes.\nAnd it isn't shy about its purpose of indoctrinating the young with communist ideology.\nOne of the attractions is a square where students and youngsters can take an oath to join the Communist Youth League or become party members.\nThe children's playground features adorable cartoon figures of Red Army soldiers, while the ground is decorated with a map of the party's famous Long March.\nThe Long March was a military retreat led by Mao and his Communist army in order to evade suppression of the Nationalist Party army in the 1930s.\nThe park's aim is to promote core socialist values -- including prosperity, democracy, civility, harmony, freedom, equality, justice, rule of law, patriotism, dedication and integrity.\n'I hope nobody will go!'\nUnfortunately, Chinese netizens don't seem to buy the idea .\nOn China's microblogging site Weibo, user Minghezaitian1983 says, \"Schools and work units probably will organize trips there, brainwashing kids and enhancing employees' sense of identity with the party.\"\nQuanjiushiyi thinks it's just an attempt by the Wuhan government to please Beijing. \"I hope nobody will go! It's an advanced brown-noser.\"\nYuanyuanzhong sums up the mood with: \"It could be a theme park you least want to go.\"", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/151009082643-china-red-army-full-169.jpg", "http://weibo.com/1618051664/CCW4ZolOi?type=comment#_rnd1444302314570", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009082643-china-red-army-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009082643-china-red-army-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009082643-china-red-army-medium-plus-169.jpg", "http://www.wh.gov.cn/whszfwz/xwxx/whyw/201509/t20150929_39091.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009082643-china-red-army-large-169.jpg", "http://news.xinhuanet.com/politics/2015-09/29/c_128276900.htm", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009082643-china-red-army-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151009082643-china-red-army-small-11.jpg"], "published": "2015-10-09T12:16:00.000+03:00", "crawled": "2015-10-09T08:29:38.187+03:00", "highlightTitle": ""}