{"organizations": [], "uuid": "c8bc68ed89d39cbc2f8aee3a7c5c6e0909d1aee3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/international/20151017-lede.ece/BINARY/original/LEDE", "site_section": "http://www.dallasnews.com/lifestyles/travel/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/international/20151017-from-alberobello-to-gallipoli-puglia-has-it-all-for-travelers.ece", "country": "US", "title": "From Alberobello to Gallipoli, Puglia has it all for travelers", "performance_score": 1, "site": "dallasnews.com", "participants_count": 1, "title_full": "From Alberobello to Gallipoli, Puglia has it all for travelers | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T00:12:00.000+03:00", "replies_count": 0, "uuid": "c8bc68ed89d39cbc2f8aee3a7c5c6e0909d1aee3"}, "author": "AMY LAUGHINGHOUSE", "url": "http://www.dallasnews.com/lifestyles/travel/international/20151017-from-alberobello-to-gallipoli-puglia-has-it-all-for-travelers.ece", "ord_in_thread": 0, "title": "From Alberobello to Gallipoli, Puglia has it all for travelers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“Puglia? Where’s that ?” My friend Vicki furrowed her brow, trying in vain to pinpoint Puglia on her mental map. Now, Vicki is one of the most adventurous explorers I know, having once driven across isolated swaths of Albania, breaking down in the middle of nowhere with no one in sight, save for a shepherd with a machine gun.\nSo when I realized that even she hadn’t heard of this 7,500-square-mile region running from the spur of Italy’s “boot” to the southern tip of its heel, I knew I was bound for the road less traveled.\nPuglia — also known as Apulia — promises medieval hilltop towns, Baroque churches, rambling castles and Roman ruins. It offers acres of olive groves, where twisted trunks writhe as if trying to wrestle free from the soil, and a 500-mile-long coastline, where craggy cliffs alternate with sandy crescents, lapped by the Adriatic and Ionian seas. All it lacks are hordes of international tourists.\n“With Italians, Puglia has always had a reputation for beautiful beaches, but when you get into the small towns, you may be the only [non-Italian] tourist around,” observes Rossella Beaugié, a native Sicilian who founded the Thinking Traveller luxury villa rental company with her British husband, Huw, nearly 15 years ago. The Beaugiés began by offering villas throughout Sicily and the Greek isles, expanding into Puglia in 2009 at the urging of their clients, who were looking for someplace authentic and, well, just a bit different.\n“If you want to go beyond the obvious destination,” smiles Beaugié, “Puglia is the genuine place.”\nMy husband/boy-toy/chauffeur and I recently spent a week in Puglia, based in the Thinking Traveller’s bucolic Trullo Terra Dolce near Ostuni. Driving from the fecund plains of the Valle d’Itria in the middle of Puglia to the sunny beaches of the Salento peninsula in the south, we were greeted by friendly locals, fattened by fresh pasta, and perpetually surprised by the rich diversity of a region that deserves a moment in the spotlight.\nAlberobello\nIn Alberobello’s old town of Rione Monti, hundreds of pointy-topped circular stone structures squat low upon a hill, a curious crop of man-made mushrooms. With their gnome-size entrances and cavelike interiors, this could be Hobbiton, Italian-style.\nThese unique buildings, collectively called “trulli,” dot the countryside throughout the Valle d’Itria, but only UNESCO-listed Alberobello boasts such a concentration. Traditionally, they sheltered farmers and animals, but most trulli in the Rione Monti now house souvenir shops and restaurants.\nStep into Enoteca Tholos (Via Monte San Michele 20) to sample local wine, olive oil, food stuffs and liqueurs, including a Smurfy-blue drink called Viagri, which endeavors to perk you up with a creamy blend of chile and aniseed. For lunch, drink in the views with a refreshing brew on the terrace at La Locanda Del Gallo (Via Monte San Michele 79). Try the ear-shaped orecchiette, a Puglian pasta made without eggs, and creamy burrata cheese with prosciutto.\nFor a gander at trulli where folks still live today, wander along Rione Aia Piccola, east of Rione Monti. Some have been grandly renovated; others are crumbling and abandoned, as if waiting for Frodo’s return.\nOstuni\nFrom a distance, gleaming white Ostuni appears as a dusting of snow on the hilltops. Closer up, it’s reminiscent of one of M.C. Escher’s eye-popping sketches, with precariously perched buildings cascading down the slopes.\nThe Gothic-Romanesque cathedral, fronted by a bustling cafe, is Ostuni’s main attraction. But we enjoyed simply wandering the undulating cobblestone lanes, stocking up on ruby red Primitivo wine at Vineria Parisi (Via Cattedrale 8), and relaxing over a spicy pizza and caprese salad at Garibaldi Ristorante on Piazza Liberta, served by a gregarious waiter with an uncanny resemblance to Vladimir Lenin. In mid-September, this central square was so devoid of tourists that a dog found the sun-warmed stones the perfect place for an undisturbed afternoon nap.\nOn the second Sunday of the month, a sprawling antiques market fills the streets around leafy Parco Rimembranze. Whether you’re looking for a battle-scarred helmet, ornate Nativity scene, colorfully painted ceramics or carved olive wood souvenirs, you’ll find them here.\nLecce\nLecce is definitely a “more is more” kind of place, with towering triumphal arches, vast squares and Baroque carvings lavished upon its palazzi and churches, including the famously fevered facade of the Basilica di Santa Croce. Toss in the ruins of a Roman amphitheater and a 16th-century castle, and it’s hardly surprising that Lecce is one of the most renowned cities in an otherwise largely unknown region.\nA wheeled “train,” like a kiddie carnival ride, ferries visitors through the streets, and upscale boutiques line the polished stone pavements. For a special souvenir, head to La Cartapesta (Via Vittorio Emanuele 27), where three brothers fashion fine papier-mâché figures in a workshop, keeping this traditional handicraft alive.\nLocal university students help fuel a culture of al fresco cafes like Mamma Lupa (Via degli Acaja 12), just steps from the amphitheater. By the time we saddled up for lunch here, I was so hungry I could eat a horse — so I did, tucking into “polpette di cavallo al sugo.” I know there will be “neigh” sayers among you, but I’m ashamed to admit this equine Puglian specialty, which I dubbed gourmet gelding meatballs, was delicious.\nGallipoli\nTucked away on a little island jutting into the Ionian Sea, the old walled fishing village of Gallipoli — not to be mistaken for the site of the bloody World War I battle in Turkey — appeared unassuming and in need of paint. Laundry flapped on racks on the sidewalk, and a colony of stray cats groomed themselves on wave-licked rocks. Elderly men and women leaned on balconies and in shady doorways, their wizened faces turning toward passers-by like fading flowers tracing the arc of the sun. The whole city appeared worn and weathered, but beloved, like a stone-and-mortar Velveteen Rabbit. It was, far and away, our favorite destination.\nSure, there were plenty of touristy shops along Via Antonietta de Pace, flogging floaty beach dresses, strappy sandals and straw hats, or proffering samples of olives and savory biscuits. But we watched a funeral procession part the crowds on this same street, with sweating, solemn men shouldering a flower-draped wooden coffin. When we ducked into a few of its many churches, whether it was the elaborate 17th-century Cattedrale di Sant’Agata or a humble chapel, there was always someone there, head bowed in quiet reflection or prayer.\nGallipoli felt gritty and real, a place where people live, die and savor the moments in between, playing on a golden beach embraced by a curving city wall. As the sun sank into the sea, we settled into front row seats at Cafe Del Mar (Via Nazario Sauro 7) on a cliff above the sandy crescent, toasting a city that won’t stay our little secret for long.\nAmy Laughinghouse is a freelance writer in London.\nWhen you go Getting there: Puglia is served by two airports, Brindisi and Bari. The most popular times to visit are May through October, with July and August being the busiest.\nWhere to stay: The Thinking Traveller offers approximately 40 well-appointed villa rentals around Puglia, encompassing one to eight bedrooms. Stay in a seafront villa, a stately masseria or a chicly converted trullo, a dry-stacked, domed structure unique to Puglia. We stayed at Trullo Terra Dolce, a four-bedroom stylishly renovated trullo filled with eclectic treasures from around the world, with a swimming pool in the midst of gardens and olive groves. The Thinking Traveller can arrange anything from home-cooked meals to boat trips and visits to private lidos, like the exclusive Coccaro Beach Club near Monopoli. Whether you want a fully stocked fridge or a grand piano installed in your villa, these folks will arrange it with a smile. They also provide area guides listing local shops, beaches and suggested excursions. Villas from around $2,200 per week. thethinkingtraveller.com .\nTourism information: viaggiareinpuglia.it/hp/en", "external_links": ["http://viaggiareinpuglia.it/hp/en"], "published": "2015-10-18T00:12:00.000+03:00", "crawled": "2015-10-19T07:04:26.795+03:00", "highlightTitle": ""}