{"organizations": ["Cadbury World"], "uuid": "2574efdc6a035f8f945c526096535c4d7fbd1336", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oxfordmail.co.uk", "main_image": "http://www.oxfordmail.co.uk/resources/images/4358122/", "site_section": "http://www.oxfordmail.co.uk/life/travel/rss/", "section_title": "Oxford Mail | Travel", "url": "http://www.oxfordmail.co.uk/life/travel/13889507.No_gold_ticket_needed_for_this_chocolate_factory____/?ref=rss", "country": "GB", "title": "No gold ticket needed for this chocolate factory....", "performance_score": 0, "site": "oxfordmail.co.uk", "participants_count": 0, "title_full": "No gold ticket needed for this chocolate factory....", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:08:00.000+03:00", "replies_count": 0, "uuid": "2574efdc6a035f8f945c526096535c4d7fbd1336"}, "author": "", "url": "http://www.oxfordmail.co.uk/life/travel/13889507.No_gold_ticket_needed_for_this_chocolate_factory____/?ref=rss", "ord_in_thread": 0, "title": "No gold ticket needed for this chocolate factory....", "locations": ["Birmingham"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eddie", "Danny Hughes"], "text": "'No gold ticket needed for this chocolate factory....': Sugar-coated fun at Cadbury World, Birmingham Sweet teeth: Eddie and Danny Hughes get stuck in \nTim Hughes , Features and Music Editor / / Travel Share 0 comments \nTim Hughes risks the wrath of the health fascists by visiting the home of British chocolate making \nI admit I felt a bit like Willy Wonka when I announced to my two sweet-mad children that I was taking them to a chocolate factory. And, keeping their side of the bargain, they humoured me with a suitably enthusiastic display of jumping around – like a pair of proper Charlies finding their own golden tickets. \nOf course no golden tickets are needed to visit Britain’s cathedral of chocolate. Cadbury’s Factory, in the leafy Birmingham suburb of Bournville, is among the country’s biggest tourist attractions, its towering Victorian edifice attracting hordes of hyperactive kids each year – and a good number of equally-smitten adults who ought to know better. \nClearly Jamie Oliver’s rants on sugar consumption have fallen on deaf ears – very much, one would imagine, to the relief of Cadbury, which, while now under American ownership, has almost two centuries of history in Brum. \nNow, you don’t have to like chocolate to visit Bournville, but it certainly helps. And, to be fair, you’d have a pretty miserable time if you didn’t – or are one of those foodie fascists who dismiss Dairy Milk, and its like, as not being proper chocolate at all. Promoted stories \nCadbury World is a temple not just to chocolate, but to the company itself – and the sugar-coated indoctrination begins as soon as you enter and are handed a bundle of Crunchies, Curly Wurlies and other naughty delights. The attraction consists of a series of ‘experiences’ all geared to convincing you that Cadbury’s chocolate is the nectar of the gods and its philanthropic founding fathers saintly figures who saved us all from a life devoid of sweetness. \nThere’s an enjoyable 4D cinema Chocolate Adventure movie; a rather fun Aztec Jungle, where we learn how a bitter Mexican ceremonial drink left the rainforest and evolved, ultimately, into Flakes; and a reconstruction of Victorian Birmingham, in which the voice of founder John Cadbury tells us how his Quaker family business led to the establishment of a workers’ paradise in Bournville. \nThere are also displays on packaging and advertising, with some nostalgic figures from the past, such as the Phil Collins-drumming gorilla, and a few interactive exhibits, which went down very well with the lads, Eddie and Danny. However we were forced to ditch Cadabra – a 'Bean car' ride through a Cadbury fantasy world because the wait was well over 30 minutes. \nThe best bit is a tour of the factory itself (barely a human to be seen, it being staffed by machines) – after which you can watch a demonstration of choc making and tuck into a pot of the runny stuff. Share article \nThe self-promotion can grate, as can the queues, but if you are partial to a munch of Milk Tray, you’ll love it. Cadbury World, Linden Rd, Birmingham. Pre-book tickets (£15.44 adults, £11.35 kids) to guarantee entry. Call 0844 880 7667 or visit cadburyworld.co.uk Promoted Stories 'No gold ticket needed for this chocolate factory....': Sugar-coated fun at Cadbury World, Birmingham Sorry, an error occurred. Please sign in or register to leave a comment Remember that you are personally responsible for what you post on this site and must abide by our site terms . Do not post anything that is false, abusive or malicious. If you wish to complain, please use the 'Report' link underneath the comment. Post comment Sign in or Register to get comment alerts. Keep in touch with local news", "external_links": [], "published": "2015-10-22T15:08:00.000+03:00", "crawled": "2015-10-22T15:58:56.014+03:00", "highlightTitle": ""}