{"organizations": [], "uuid": "5d86446e8ca3788b7873674b2d6881faac3efebc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03321/graphoftheweek_3321301k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-12.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/finance/investor/investing-news/11926007/Our-precision-guide-to-investing-your-first-10000.html", "country": "US", "title": "Our precision guide to investing your first £10,000", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Our precision guide to investing your first £10,000 - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T18:16:00.000+03:00", "replies_count": 0, "uuid": "5d86446e8ca3788b7873674b2d6881faac3efebc"}, "author": "Ed Monk , Investment Editor", "url": "http://www.telegraph.co.uk/finance/investor/investing-news/11926007/Our-precision-guide-to-investing-your-first-10000.html", "ord_in_thread": 0, "title": "Our precision guide to investing your first £10,000", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You’re debt free, on the housing ladder and have built up a pot of cash savings. But what comes next? While those fortunate enough to be in this position are generally aware of the need to put their money to work beyond simply having some cash savings, taking the first step can be daunting. Financial advice will suit some, particularly as it gives you the potential to seek redress from watchdogs if investments turn out not to have been suitable. It comes at a price, however, and some may balk at the cost if it immediately swallows a sizeable chunk of their money. Although many people in this position will be relatively young and still years from retirement, is not unusual for older people to be novice investors following windfalls from an inheritance or a property sale. Here’s our precision guide to help those at the start of their investment career, whatever their age. We’ll lay out how the first £10,000 can be invested sensibly, with suggestions of specific funds that should get the job done. As always, there is a firm focus on cost. Unless a you need the money back in the next ten to fifteen years, I would suggest 100pc equities We’ve sought the help of leading two independent financial advisers: Philippa Gee, of Philippa Gee Wealth Management, and Martin Bamford, of Informed Choice. The best course of action will depend on how willing you are to monitor your investments and move money if necessary to maintain the appropriate split of assets. Where to put your money if you want a hands-off approach For younger investors with time to ride our market movements, Ms Gee said shares should be the favoured assets. “Unless a thirty-something is looking to take the money back out in the next 10 to 15 years or has a cautious approach to risk, I would suggest they consider putting all their money into the stock market,” she said. Ms Gee suggested doing this via a special type of fund called an investment trust, many of which have long track records and low costs. “I would be inclined to opt for one of globally diversified investment trusts, such as Scottish Mortgage , Alliance Trust or Witan ,\" she said. Scottish Mortgage recently featured on our list of the five best cheap funds and has an annual fee (the \"ongoing charge figure\" or OCF) of just 0.48pc. This compares with 0.69pc for Alliance Trust and 0.87pc for Witan. Investment trusts work differently from ordinary funds and it is important to understand how before you invest. For those who feel more comfortable with ordinary funds, Ms Gee recommended Fundsmith Equity (OCF 1.11pc) or Artemis Global Growth (0.87pc). With funds there is an additional complication - the existence of multuple varieties called \"share classes\". For Fundsmith you want the \"T\" share class, whereas for the Artemis fund it's the \"I\" class. You could also opt for a fund that uses reinvested dividends as a way to boost growth. One option is Invesco Perpetual Global Equity Income (0.92pc, Z share class). Not everyone is comfortable having all their money invested in shares. More cautious savers can add exposure to less volatile investments by choosing a \"multi-asset\" fund, Ms Gee said. These funds also suit anyone who does not want to monitor their portfolio frequently because they are \"rebalanced\" regularly to maintain the split of assets. Ms Gee recommended the L&G Multi-Index range , which offers funds run to suit various risk profiles. Option 5 (0.5pc, F share class) has around 70pc in shares from around the world, with the rest invested in bonds, which are normally seen as less risky, and property. This fund, she said, could be paired with the Vanguard LifeStrategy 60pc Equity fund (0.24pc), which is split 60-40 between shares and bonds and is cheaper than the L&G fund, but rebalanced less frequently. It has paid to invest in shares over the long term. Where to invest if you are happy to get involved For those willing to choose a variety of funds themselves, and rebalance as the need arises, Mr Bamford suggested that 65pc should be in shares – 30pc in the UK and 35pc spread globally. He suggested that \"tracker\" funds - which simply replicate the performance of a stock market index such as the FTSE 100 - could do much of the work and picked out the Fidelity UK Index fund (0.07pc, P share class) for the UK element. For international shares he chose Fidelity US Index (0.07pc, P share class) and two \"actively managed\" funds: Jupiter European (1.06pc, I share class) and First State Asia Pacific Leaders (0.86pc, B share class). The, for the bond element, Mr Bamford suggested putting 15pc in \"investment grade\" UK corporate bonds, the safest category of bonds issued by companies. He recommended Royal London Sterling Credit (0.51pc, M class). Mr Bamford added that 5pc could go into high-yield bonds, a riskier type that pays better rates of interest, recommending Baillie Gifford High Yield Bond (0.38pc, B share class), with a further 5pc each to gilts, bonds issued by the British Government, and global high-yield bonds via the BlackRock UK Gilts All Stocks Tracker fund (0.16pc, D share class) and the CanLife Global High Yield Bond fund (1.39pc, C share class) respectively. Mr Bamford said: \"This mix would give the opportunity for growth with reasonable protection from the threat of rising interest rates, which can be expected to hit gilts and investment-grade bonds but not high-yield, while also providing useful diversification within the portfolio.\" Ms Gee was more cautious about bonds and said they should be a consideration for younger investors only if their tolerance of risk was very low. She said: “I would not include a bond or gilt element, as I assume these investors' risk tolerance wouldn’t demand it. This is particularly so because these savers will see an interest rate rise in their first few years of investing, which, given the 'bond bubble' worries, could create a major headache for some.” • Newsletter: Get a weekly round-up of our investment ideas Get the right tax breaks Investing inside tax-efficient \"wrappers\", namely an Isa or \"self-invested personal pension\" (Sipp), is a no brainer. But which one should you choose? Anyone who gets pension contributions from their employer to save inside a workplace pension should take full advantage of this – it amounts to free money. Beyond that, investing inside an Isa means that gains and withdrawals are tax free and you can get at your money if you need it, whereas a pension will deny you access until about 10 years before your state pension age. Money invested in pensions is tax-free on the way in and taxed on the way out, however, which means there is an advantage versus an Isa if your tax rate in retirement ends up being lower than your rate as a worker. The future of this advantage, however, is uncertain, with tax relief on pensions currently subject to a government consultation that could see it cut. In truth, it is difficult to prescribe the correct split between Isas and pensions as it will depend on when you might need the money and your tax position. Both our experts said the flexibility of Isas could prove valuable for those uncertain about how their circumstances might change. Get the right investment shop Investing through a \"platform\" - an online service where you can select investments and view your portfolio - is often the easiest and best way. There is a cost, and you'll have to choose from the 20 or more platforms that exist. Their charging structures vary; some will be cheap for some investors but not others. Ensure you choose one that is competitive for your level and frequency of investing. The Telegraph has launched its own DIY investment service, designed with simple pricing. The annual cost is capped at £300 for all your Isas and general investment account, but based on an annual fee of 0.3pc, making it good for first-time fund investors and those with large fund portfolios. Alongside this, our team of investment journalists will produce an ever-greater stream of analysis on investments, aiming to help savers make the right choices. • Find out more about Telegraph Investor Transfer to Telegraph Investor and we'll welcome you with up to £400 cashback. Terms apply - cashback depends on transfer value The Telegraph Investor £10 to trade shares and no charge to buy & sell funds Open an account »", "external_links": [], "published": "2015-10-12T18:16:00.000+03:00", "crawled": "2015-10-12T13:36:11.324+03:00", "highlightTitle": ""}