{"organizations": [], "uuid": "b6d6b4d2d02374bb3f7043c9814d74e6870809fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02701/BritChinaFlag_2701900a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-17.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/finance/newsbysector/epic/stan/11937360/Britain-shows-the-US-how-to-court-China-says-Standard-Chartered.html", "country": "US", "title": "Britain shows the US how to court China, says Standard Chartered", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 5, "title_full": "Britain shows the US how to court China, says Standard Chartered - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T04:00:00.000+03:00", "replies_count": 4, "uuid": "b6d6b4d2d02374bb3f7043c9814d74e6870809fe"}, "author": "Tim Wallace", "url": "http://www.telegraph.co.uk/finance/newsbysector/epic/stan/11937360/Britain-shows-the-US-how-to-court-China-says-Standard-Chartered.html", "ord_in_thread": 0, "title": "Britain shows the US how to court China, says Standard Chartered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American politicians have displayed a “churlish” attitude towards Beijing, while George Osborne has been more successful, Standard Chartered said ahead of premier Xi Jinping’s visit to the UK this week. George Osborne has showed an admirable passion for China and has worked hard to arrange more deals with the world's second-largest economy, while the bank argues the US' approach is less productive . “[The US] decided not to participate in the Asian Infrastructure Investment Bank which I think was a bit churlish of them,\" said Standard Chartered's European chief executive Richard Holmes. Xi Jinping visited the US last month \"I think the US is struggling with the notion that China is going to overtake them in many ways, so they have got a bit of an identity crisis.\" \" Europe more generally is keen to do more business with China .\" This should help cement London's place as the main centre for trading and transacting in renminbi outside of China, he said, while it can also enhance Britain's ability to strike more deals. \"In financial services the City of London still has an edge, I cannot see how renminbi FX is suddenly going to shift to a different financial centre,\" Mr Holmes said. Chancellor George Osborne visited China last month, where he was praised by local media for deciding not to raise the issue of human rights Photo: Stefan Rousseau/PA In particular he praised Chancellor George Osborne's personal attitude. \"George has a genuine passion for China, one of his kids is learning Mandarin … he seems to have a personal, emotional sort of connection to China. Having the government aligned with business is a good place to be,\" he said. Meanwhile his colleague, senior economist Jinny Yan, said she believes investment flows from China into the UK are greater than the government realises. While official figures estimate foreign direct investment from China from 2004 to 2013 amounted to $8bn, Ms Yan’s studies of mergers, acquisitions and joint ventures indicate that the total is closer to $50bn, indicating the enormous scale of flows into the UK. She believes the British government is on an increasingly strong footing in its negotiations with China and that the relationship can be improved further in this week's visit. “The UK needs to sound like it really knows China, and I think this is exactly what George Osborne is trying to portray,” she said. “They know China much much better now compared to say five years ago. We’ve got more Chinese people here, buying here, investing here, we know China much better.”", "external_links": [], "published": "2015-10-18T04:00:00.000+03:00", "crawled": "2015-10-18T16:43:31.069+03:00", "highlightTitle": ""}