{"organizations": [], "uuid": "3bdd82344546c6b29986afd762776d48f7f52489", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/65061/canada-winter-forecast-el-nino-promote-one-warmest-winters-recor", "country": "US", "title": "Canada winter forecast: El Nino to promote one of warmest winters on record", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Canada winter forecast: El Nino to promote one of warmest winters on record", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:25:00.000+03:00", "replies_count": 0, "uuid": "3bdd82344546c6b29986afd762776d48f7f52489"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/65061/canada-winter-forecast-el-nino-promote-one-warmest-winters-recor", "ord_in_thread": 0, "title": "Canada winter forecast: El Nino to promote one of warmest winters on record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click here for information and nomination Canada winter forecast: El Nino to promote one of warmest winters on record \nThe winter of 2015-2016 could end up as one of the warmest winters on record for Canada as a whole, as a strong El Niño persists into the upcoming season. \nWell Above-Normal Temperatures to Envelope Western Canada \nWestern Canada residents should expect another winter with above- to well above-normal temperatures, as a prevailing westerly flow delivers milder Pacific air across the region. \nCompared to last winter, there will be more snow across the coastal mountains of western British Columbia, which includes the Whistler Blackcomb ski resort, host of the 2009-2010 Winter Olympics. \nFarther east in the Rockies of eastern British Columbia and western Alberta, snowfall will underachieve this winter. The majority of the snow in this region will fall during the first half of the winter before a drier pattern sets up during January and February. \nDry, Mild Conditions to Dominate Season in the Prairies \nDrier and milder weather will be a dominant theme across the Prairie region this winter as the Polar jet stream gets displaced farther to the north. \nThis pattern will greatly limit the amount and duration of Arctic air masses that normally impact the region. \nAverage temperatures could be as much as 3 degrees Celsius (5.5 degrees Fahrenheit) above normal this winter in cities such as Edmonton, Calgary and Regina. \nSignificant snowfall events will be few and far between across the region as the primary storm track will generally remain farther south across the central and southern U.S. \nIncreased Risk for Ice Storms in Ontario, Quebec \nThis coming winter will not be nearly as cold as last winter thanks in part to El Niño. \nThis should lead to a noticeable difference in heating bills compared to last year. \nUnfortunately, the winter pattern will also favor an increased risk of ice storms, especially from eastern Ontario to southern Quebec, including the cities of Ottawa and Montreal. \nMuch of Ontario, including the lake-effect snow belts will have less snowfall compared to normal, as the main storm track shifts to the south and east during January and February. \nAs the storm track shifts toward the East Coast later in January and February, there will be an increased risk for significant snowfall events across eastern Quebec, including the Gaspe Peninsula. \nStormy but Mild Conditions Forecast for Most of Atlantic Canada \nThe combination of a strong El Niño and warmer-than-usual sea-surface waters surrounding the region will lead to slightly higher temperatures compared to normal this winter. \nThe winter could turn snowy again from New Brunswick to Prince Edward Island, especially the second half of the winter. \nThe milder conditions will favor a greater tendency for storms that initially bring snow, but change to ice or rain, especially across Nova Scotia. \nMuch of Newfoundland will experience a milder winter with a reduced number of major storms. Oct 21, 2015", "external_links": [], "published": "2015-10-21T19:25:00.000+03:00", "crawled": "2015-10-22T01:01:59.225+03:00", "highlightTitle": ""}