{"organizations": [], "uuid": "4c244de34ac26fcb547ed2d82e4230099d352e5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03474/totvu-arct-GettyIm_3474583k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-16.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/artsandculture/10547973/Travel-programmes-on-TV.html", "country": "US", "title": "Travel programmes on TV", "performance_score": 10, "site": "telegraph.co.uk", "participants_count": 14, "title_full": "Travel programmes on TV - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:00:00.000+03:00", "replies_count": 13, "uuid": "4c244de34ac26fcb547ed2d82e4230099d352e5b"}, "author": "Simon Horsford", "url": "http://www.telegraph.co.uk/travel/artsandculture/10547973/Travel-programmes-on-TV.html", "ord_in_thread": 0, "title": "Travel programmes on TV", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Friday October 16 Great Continental Railway Journeys (BBC Two, 9.00pm) Armed with his trusty 1913 Bradshaw's Continental Railway Guide, Michael Portillo travels east through the Balkans along the most exotic section of the Orient Express. His journey begins in Sofia, capital of Bulgaria, and includes stops in the ancient city of Plovdiv, the region of Rumelia, and former capital of the Ottoman Empire Edirne. Arriving in Istanbul, Portillo takes a trip on the Bosphorus - a much-coveted stretch of water - finds out about Turkish delight. and travels along the Marmaray metro line, which connects European and Asian Istanbul via a tunnel beneath the Bosphorus. • World's best rail journeys: in pictures Tuesday October 20 Grand Tours of the Scottish Islands (BBC Two, 7.00pm) Paul Murton returns to visit more islands off the coastline, beginning with the Outer Hebrides. He resumes his journey on Eriskay, where he discovers how the remote location helped preserve a unique way of life for centuries - and also allowed locals to hide thousands of bottles of whisky from the excise men when a ship laden with the thirst-quenching cargo ran aground in 1941. Yellowstone: Unnatural Histories (BBC Four, 8.00pm) Yellowstone National Park is the focus of a programme on BBCFour this week Photo: Getty Investigates the history of Yellowstone National Park , and how the area has come to represent the American ideal of an unspoilt natural wilderness - despite once being home to several Native American tribes. The programme looks back at the foundation of the park in 1872, and reveals how its creation was driven by a desire to redefine the country's relationship with nature. Repeat. Timeshift: The People's Liners - Britain's Lost Pleasure Fleets (BBC Four, 9.00pm) The history of the steamers, which were once a common sight on rivers and coastal waters around Britain and were a highlight of seaside holidays from the 1820s until the early 1960s, providing the adventure and trappings of an ocean voyage without venturing out of sight of land. Wednesday October 21 Grand Tours of the Scottish Islands (BBC Two, 7.00pm) Paul Murton explores the Isle of Mull and its satellite islands to discover why they have become boltholes from the hustle and bustle of the modern world. He begins on the tidal island of Erraid, which inspired famous Scottish writer Robert Louis Stevenson, then hops over to Ulva, the final resting place of Lachlan MacQuarrie, one of the first governors of New South Wales. He then explores Mull itself, being given a whistlestop tour of the island by rally driver Louise Thomas. • Britain's tiny islands Life on Scotland's islands Photo: Getty Restoring Britain's Landmarks (Channel Four, 8.00pm) The team explore the extraordinary time capsule Llywn Celyn Farm, which is to undergo a three million pound restoration after surviving almost unchanged for almost 550 years. Plus, John Evetts continues working on Hougoumont Farm on the Waterloo battlefield in preparation for its opening by Prince Charles. At Belmont House, Lyme Regis, the programme oversees the reconstruction of a 250-year-old veranda and discovers why author John Fowles made it his home for 40 years Alexander Armstrong in the Land of the Midnight Sun (ITV1, 9.00pm) The presenter continues his epic 800-mile journey halfway around the Arctic Circle deep in mid-winter. He embarks on the second leg beginning in Iceland before travelling to the icy wilderness of Greenland. Along the way, Armstrong snorkels over a vast underwater crevasse separating two continental landmasses and wrestles with a female Viking. Thursday October 22 Grand Tours of the Scottish Islands (BBC Two, 7.00pm) Paul Murton visits the Inner Hebrides islands of Gigha and Jura, which are respectively lush and rugged before exploring a string of islands near Oban. Chris Tarrant: Extreme Railway Journeys (Five, 9.00pm) Christ Tarrat visits Cuba this week Photo: Getty Chris Tarrant attempts to cross the length of Cuba, the only island in the Caribbean to boast an extensive railway network, starting in Havana in the west. This proves to be a major challenge given the unreliability of the service and the old trains regularly used, but makes for a fascinating journey to Tarrant's ultimate goal, the American naval base at Guantanamo Bay Disappearing Britain (More4, 9.00pm) Maureen Lipman and Larry Lamb discover Dover’s rich military past and Michael Buerk visits the Hovercraft Museum in Gosport. Friday October 23 Great Continental Railway Journeys (BBC Two, 9.00pm) In Vienna, Michael Portillo encounters a pre-Cold War spy and learns about the concert that caused a riot in 1913. He then travels the Hapsburg imperial line across the Semmering Pass, a line blasted through the Alps. In Graz, the former politician ventures underground at the Lurgrotte Caves to find out about a famous rescue operation of the past, then in Slovenia discovers how an earthquake in Ljubljana prompted its citizens to assert their national identity in architecture and art. Telegraphtravel", "external_links": [], "published": "2015-10-16T20:00:00.000+03:00", "crawled": "2015-10-16T16:49:36.636+03:00", "highlightTitle": ""}