{"organizations": [], "uuid": "f57a76275c3bc01097dd062278eac889210dab91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/39C6F0B3-CF9B-FB02-5F951A40D7314D1D.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-kahala-hotel-resort-debuts-new-health-and-wellness-series/", "country": "US", "title": "The Kahala Hotel & Resort Debuts New Health and Wellness SeriesTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "The Kahala Hotel & Resort Debuts New Health and Wellness SeriesTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "f57a76275c3bc01097dd062278eac889210dab91"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-kahala-hotel-resort-debuts-new-health-and-wellness-series/", "ord_in_thread": 0, "title": "The Kahala Hotel & Resort Debuts New Health and Wellness SeriesTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Kahala Hotel & Resort Debuts New Health and Wellness Series\nThe Kahala Hotel & Resort, Hawai‘i’s premier oasis of luxury and elegance, is debuting a new health and wellness program series titled The Kahala Life , aimed to promote greater overall well-being for visitors and kama‘āina. Each month, the resort’s director of spa & recreation, Spring Chang, along with her team of experts and instructors will lead sessions on different topics in the areas of nutrition, fitness and life balance to help participants achieve optimal well-being and a healthier lifestyle.\nThe Kahala Life kicks off with a Stand Up Paddle (SUP) Yoga experience at sunrise on Sunday, Oct. 25 and will be followed by a session on Mudras, Mandras and Mandalas in November and Moonlight Meditation in December. For a limited time only, participants who sign up for The Kahala Life sessions will receive a 20 percent off coupon to use for any of the treatments and services available at the award-winning Kahala Spa.\nThe Kahala Life: Sunrise SUP Yoga\nSunday, Oct. 25 at 6 a.m. (Sunrise at 6:32 a.m.)\nKahala Beach (Check in at CHI Fitness Center)\n$50 per person (includes board rental, light breakfast and parking)\nStrengthen your core and test your balance through Stand Up Paddle (SUP) Yoga at sunrise at The Kahala Hotel & Resort. This unique yoga activity is quickly gaining popularity throughout the islands, but there’s no place to do it in Honolulu without disruption than the pristine and calm waters of Kahala. Start your day early with an invigorating activity while floating in the Pacific Ocean and reward yourself with a magnificent sunrise over Koko Head.\nThe Kahala Life: Mudras, Mantras and Mandalas\nSunday, Nov. 22 from 10 a.m. to 2 p .m.\n$75 per person (includes lunch and parking)\nKahala O Ke Kai\nTransform your emotional state and activate the senses of sight, sound and touch through this interactive session featuring mudras, mantras and mandalas. Start off the morning with a mudra session, also known as hand yoga, which is believed to improve your physical, mental and spiritual well-being. The journey continues with a mantra session using your own voice sound vibrations to awaken the body and mind. A healthy lunch is served before the day ends with an inspirational and therapeutic session where you will draw your own mandala to connect your inner world with outer reality.\nThe Kahala Life: Moonlight Meditation\nThursday, Dec. 10 at 6:30 p.m.\n$5 per person (includes parking)\nKoko Head Lawn\nSurrender your mind, body and soul with an hour-long meditation under the moon and stars. This rejuvenating activity will test your patience and ability to focus your mind as you listen to only the waves crashing on to the pristine white sand beach of Kahala and feel the evening’s breeze against your skin.\nSource:- Kahala Hotel & Resort", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T17:21:38.814+03:00", "highlightTitle": ""}