{"organizations": ["Duke", "W Singapore Sentosa", "CNN"], "uuid": "7c648f09c06c6bf3c41d891eecab418f98c9c078", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150930164552-singapore-extravagant-hotel-w-bath-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss\r", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/10/04/hotels/singapore-extravagant-suites/index.html?eref=rss_travel", "country": "US", "title": "From Raffles Singapore to Marina Bay Sands, Singapore's luxury hotel suites offer rock-star fittings and VIP service fit for the Duke and Duchess of Cambridge.", "performance_score": 1, "site": "cnn.com", "participants_count": 0, "title_full": "From Raffles Singapore to Marina Bay Sands, Singapore's luxury hotel suites offer rock-star fittings and VIP service fit for the Duke and Duchess of Cambridge.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T05:24:00.000+03:00", "replies_count": 0, "uuid": "7c648f09c06c6bf3c41d891eecab418f98c9c078"}, "author": "", "url": "http://edition.cnn.com/2015/10/04/hotels/singapore-extravagant-suites/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "From Raffles Singapore to Marina Bay Sands, Singapore's luxury hotel suites offer rock-star fittings and VIP service fit for the Duke and Duchess of Cambridge.", "locations": ["St. Regis", "Lion City", "St. Regis Singapore", "Capella Singapore", "Singapore", "Beverly Hills", "Colonial Manor", "Cambridge", "Versailles", "Sentosa", "Marina Bay Sands"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gillian Rhys"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Singapore's 6 most outrageous hotel suites By Gillian Rhys, for CNN Updated 0225 GMT (0925 HKT) October 5, 2015 15 photos: W Singapore Sentosa Cove – Marble and purple are all the rage in W Sentosa's Extreme Wow Suite, where everything from the lighting to the DJ booth is designed to make the ultimate statement. There's also a pretty gorgeous marina view for anyone who can tear their eyes away from the interiors. Hide Caption 1 of 15 15 photos: Bathe like a rock star – Guests at W Singapore Sentosa's Extreme Wow Suite don't have to choose between those two hotel necessities: a circular bath under a striking chandelier or a designer exercise bike. Hide Caption 2 of 15 15 photos: Purple party palace – The vibe is nightclub meets playboy crash pad at W Sentosa's Extreme Wow Suite. Hide Caption 3 of 15 15 photos: The St. Regis Singapore – From the Presidential Suite's wraparound terrace there's a panoramic view of the Botanic Gardens -- and a hand-polished brass swing from which to enjoy it. Hide Caption 4 of 15 15 photos: Beverly Hills meets Versailles – The Presidential Suite's decadent furnishings include custom-made crystal chandeliers and elaborate statement artworks. Hide Caption 5 of 15 15 photos: Workout anyone? – After a session at the suite's gym, guests in St. Regis's Presidential Suite can choose between a Jacuzzi, a jet shower, a marble steam chamber or all three. Hide Caption 6 of 15 15 photos: Capella Singapore resort and spa – Colonial Manor is one of two presidential suites in the Capella, located on Singapore's resort island of Sentosa. Traditional British on the outside, inside it's furnished with modern Asian art and antique artifacts. Hide Caption 7 of 15 15 photos: Private charm – The Colonial Manor has two stories and three bedrooms. Each suite comes with its own garden, pool and resident peacocks. Hide Caption 8 of 15 15 photos: Marina Bay Sands – Marina Bay Sands' VIP guests are put up in the Chairman Suite, where a night's stay is strictly by invitation only -- the hotel won't even reveal what it costs. Hide Caption 9 of 15 15 photos: His 'n Hers – With multiple bedrooms, bathrooms and living rooms, there's no shortage of space for the elite high-rollers and celebs invited to stay at Marina Bay Sands's enormous Chairman Suite. Hide Caption 10 of 15 15 photos: Movie Night – Marina Bay Sands's Chairman Suite has all the makings of a great night in: a media room, karaoke and a baby grand piano. Hide Caption 11 of 15 15 photos: Shangri-La Hotel Singapore – Shangri-La Suite guests have the luxury of their own exclusive entrance and private elevator. Sitting 17 floors up, they can bask in the expansive views of the city and call on their dedicated butler to deliver whatever they desire, around the clock. Hide Caption 12 of 15 15 photos: Getting personal – Personalized bathrobes, pillowcases and stationery are all part of the service at the Shangri-La Suite. Hide Caption 13 of 15 15 photos: Raffles Singapore – The Raffles' Sarkies Suite bedroom has high ceilings, a four-poster bed and a vast veranda overlooking the gardens. Hide Caption 14 of 15 15 photos: The Grand old Dame – The super-exclusive Sarkies Suite at Singapore's Raffles Hotel is classic and refined: posh enough, in fact, for the Duke and Duchess of Cambridge. Hide Caption 15 of 15 CNN Travel's series often carries sponsorship originating from the countries and regions we profile. However, CNN retains full editorial control over all of its reports. Read the policy . Singapore (CNN) In a city filled with gleaming skyscrapers, designer stores and sophisticated travelers, Singapore 's luxury hotels have a lot to live up to. But with rock-star bath tubs, private chefs and service fit for royalty, the Lion City's most lavish definitely doesn't disappoint. Extreme Wow Suite, W Singapore Sentosa Cove Who needs the hotel bar when you've a DJ booth in your suite? The W Sentosa 's Extreme Wow Suite lives up to its name with an abundance of marble and purple furnishings. And that's just the start of it. It's filled with bold statements -- from the eye-catching lighting and wall design, to the half-circle sofa and standalone bar. Particularly stunning is the bathroom, where an elaborate chandelier hangs over a circular bath, plush daybed and designer exercise bike. The overall feel is a cross between a nightclub and a playboy crash pad, right down to the DJ booth and inside and outside hot tubs. Priced from SGD 12,000 ($8,430) a night, plus taxes. \nW Singapore Sentosa Cove , 21 Ocean Way, Sentosa Island 098374 Singapore; +65 6808 7288 Chairman Suite, Marina Bay Sands Marina Bay Sands ' VIP guests (they're not naming names, but we're guessing celebrities and high-rollers visiting the adjacent casino) are put up in the Chairman Suite. With two living rooms and four bedrooms and bathrooms -- all with Jacuzzis -- it's a biggie. As well as panoramic views over the bay and South China Sea, there's more than enough to keep a seen-it-all celeb happy: a baby grand piano, media room and karaoke, plus a massage room, fitness room with steam and sauna facilities, and hair salon (perfect for those impending media appearances). Unfortunately though, it's only available by invitation. Rates: Priceless \nMarina Bay Sands , 10 Bayfront Avenue, Singapore 018956 Singapore; +65 6688 8888 Sarkies Suite, Raffles Singapore The Sarkies Suite: Good enough for the Duke and Duchess of Cambridge. All the rooms at Raffles are suites -- there's nothing so humdrum as a mere room -- but not all suites are created equal. Spiffiest of all is the Sarkies (U.K. royals William and Kate stayed there). Named after the original owners, it's in prime position in the main building, overlooking the famous driveway. Inside is a 1930s handwoven Iranian carpet as well as Tiffany & Co silverware and china, for banqueting at the antique dining table. The master bedroom's vast veranda has a view of the gorgeous Palm Court, the hotel's expansive garden lined with tall palm trees. All in all, fit for a princess. Rates from SGD 10,000 ($7,200) per night, plus taxes. \nRaffles Hotel Singapore , 1 Beach Road, Singapore 189673 Singapore; +65 6412 1180 Shangri-La Suite, Shangri-La Hotel Singapore Not only do Shangri-La Suite guests arrive at the Valley Wing entrance -- more exclusive than the main hotel lobby -- they also have their own personal entryway. Then it's a private elevator ride to the vast Shangri-La suite. His and hers dressing rooms, a gym and sauna await, as well as personalized bathrobes, pillow cases and stationery. Butler service is available around the clock. Want gourmet cuisine or hawker food (Singapore street food) served on fine china at the walnut dining table? No problem. In addition to the master bedroom, there's an en-suite twin -- usually occupied by guests' security detail. From SGD 8,800 ($6,180) a night, plus taxes. Presidential Suite, The St. Regis Singapore This is just the dressing room of the St. Regis Presidential Suite. St. Regis 's Beverly Hills-meets-Versailles vibe is writ large in its Presidential Suite. Lavish furnishings include hand-painted silk panels and a wall fountain water feature. There's also a baby grand piano and original works by big-name artists. Outside on the wraparound terrace a private chef will whip up dinner on the grill for guests, or -- if they prefer -- inside in the more genteel 12-seater dining area. And to cap it off there's the option of complimentary daily massages for two, in suite. From SGD 12,450 ($8,745) a night. \nThe St. Regis Singapore , 29 Tanglin Road, Singapore 247911 Singapore; +65 6506 6888 Colonial Manor, Capella Singapore resort and spa The two presidential suites at this luxury Sentosa Island hideaway are actually historic standalone houses. The two-story, three-bed manors -- all perfectly preserved white columns and shutters -- are so special they have conservation status. And while the houses look 19th-century colonial on the outside, they've been furnished with a mix of tasteful shades of greige (gray-beige, a hot trend in decor) and antique Asian artifacts. Each manor also comes with its own private garden and swimming pool -- and we're not talking plunge-pool size. In addition to human guests, Capella Singapore also has resident peacocks. Guests are picked up from the airport by complimentary Mercedes. From SGD 8,000 ($5,620) plus taxes. \nCapella Singapore , 1 The Knolls, Sentosa Island 098297 Singapore; +65 6377 8888 Gillian Rhys is a freelance lifestyle journalist based in Singapore. She is the editor of Luxe City Guide Singapore and chopstixandthecity.com . Tweet her at @GillianRhys More from Hotels", "external_links": [], "published": "2015-10-05T05:24:00.000+03:00", "crawled": "2015-10-05T05:44:55.399+03:00", "highlightTitle": ""}