{"organizations": ["Kansas Department of Wildlife, Parks & Tourism Kentucky", "Longaberger Company", "Greater Newark Convention & Visitors Bureau New Mexico", "Tourism Oregon", "Chamber of Commerce", "Mutter Museum", "Alabama Tourism Department Alaska", "Department of Parks and Tourism California", "Cosmos Mystery Area", "Christian Science Center", "Nebraska Tourism Nevada", "Iowa Tourism Office Kansas", "Colorado Gators Reptile Park Connecticut", "South County Tourism Council", "Kate Glicksberg Fullscreen North Carolina", "Virginia Tourism Corporation Washington", "USAT Texas", "Matt Morgan Vermont", "Massachusetts Office of Travel & Tourism Michigan", "Arizona Office of Tourism Arkansas", "Scott Fairbanks/Montana Office of Tourism Nebraska", "Texas Tourism Utah", "Travelnevada.com New Hampshire", "Cadillac Ranch", "Explore Minnesota Tourism Fullscreen Mississippi", "Maine Office of Tourism", "Emmis Publishing Iowa", "SD Department of Tourism Fullscreen Tennessee", "Coral Castle Inc", "Bureau of Information", "KFC", "Wigwam Motel"], "uuid": "7dda75421a2b6c0d6210dfe5966b278060f4991f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "experience.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/1d3775de9229d2ddb15a0508374ac63d4213dd1d/r=500x375&r=400x400&c=400x400/local/-/media/2015/10/16/USATODAY/ExperienceAmerica/635806003661698171-Connecticut---Wild-Bill-s-Nostalgia.jpg", "site_section": "http://rssfeeds.usatoday.com/UsatodaycomTravel-TopStories", "section_title": "USATODAY - Travel Top Stories", "url": "http://experience.usatoday.com/america/story/best-of-lists/2015/10/19/50-state-road-trip-quirky-america/74073024/", "country": "US", "title": "50 state road trip: America the beautifully quirky", "performance_score": 2, "site": "usatoday.com", "participants_count": 0, "title_full": "50 state road trip: America the beautifully quirky", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:00:00.000+03:00", "replies_count": 0, "uuid": "7dda75421a2b6c0d6210dfe5966b278060f4991f"}, "author": "", "url": "http://experience.usatoday.com/america/story/best-of-lists/2015/10/19/50-state-road-trip-quirky-america/74073024/", "ord_in_thread": 0, "title": "50 state road trip: America the beautifully quirky", "locations": ["Cuba", "South Carolina", "Rhode Island", "Holbrook", "Moab", "Albuquerque", "Black Hills", "Waikiki Spam Jam", "Florida", "Alabama", "Galloway Totem Pole Park", "Mosca", "Nostalgia Delaware", "South County", "Seattle", "Waikiki Spam Jam Fullscreen Idaho", "Lavaca", "Middletown", "Tuscumbia", "San Luis Valley", "Baltimore Massachusetts", "Wonderful West Virginia Wisconsin", "Great Falls", "W.V.", "Louisiana", "Memphis", "West Virginia", "Ohio", "Monty Rand Maryland", "Virginia", "Texas", "Portland", "Nyberg Park", "Mississippi Missouri", "West Orange", "Chester", "Amarillo", "New York City", "New Jersey", "Maine", "Tinkertown Museum New York", "Gaffney", "Foyil", "Cottonwood", "Boston", "Salem Sue", "Iowa", "Cawker City", "Hayward", "North Dakota", "Baltimore", "Indiana", "N.J.", "New Orleans", "Haines", "Frankenmuth", "Minnesota", "Newark", "North Dakota Tourism Ohio", "R.I.", "Philadelphia", "Franklin", "Killackey Colorado", "Williamstown", "Hawaii", "Clarksdale", "St. Louis", "Bangor", "Montana", "Oklahoma", "Ind.", "America", "USA", "Oregon Pennsylvania", "Arizona", "Alaska", "Georgia", "New Salem", "South Dakota"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robb", "Stephen King", "Jack Gruber", "Elvis", "Rich", "Wild Bill", "Sarah Sekula", "Steve Shaluta/Wild", "Earl Harris", "Sarah Hauser", "Henry", "Ken Nyberg", "Paul Stafford", "Robert Johnson", "Clark", "Lusk", "Frank Stoeber", "Lori Duckworth/Oklahoma", "Marietta", "Nancy Barnett", "Marie Laveau", "Peter Frank Edwards/DiscoverSouthCarolina", "Albert", "Samuel J. Bent-Ellis", "Leggett", "Albert Szukalski", "Charlie Schuck", "Sarah Luebbert/Missouri", "Kat Robinson/Arkansas", "Milton", "Ed Leedskalnin", "Paul Bunyan", "Bronner"], "text": "50 state road trip: America the beautifully quirky by Sarah Sekula, Special for USA TODAY | Published on October 19, 2015 Alabama - More than 185 coon dogs have been laid to rest in the Coon Dog Memorial Graveyard in Tuscumbia since the first coon dog was buried here in 1937. Alabama Tourism Department Alaska - The Hammer Museum in Haines, Alaska, is a volunteer-run nonprofit dedicated to preserving the history of man's first tool. State of Alaska/Brian Adams Arizona - At the Wigwam Motel in Holbrook, constructed in 1950, visitors can still book a Wigwam room for the night. Arizona Office of Tourism Arkansas - Earl Harris, Sr., was a local farmer and beer distributor in Lavaca who loved Budweiser so much he painted one of his silos to look like a giant can circa 1975-1976. Kat Robinson/Arkansas Department of Parks and Tourism California – Drive your car through the Chandelier Tree,a 315-foot tall redwood tree,in Leggett's Drive-ThruTree Park. Visit California/Ryan Killackey Colorado - The Colorado Gators Reptile Park in the San Luis Valley town of Mosca offers gator wrestling and reptile-handling classes. Colorado Gators Reptile Park Connecticut - Wild Bill’s Nostalgia store in Middletown offers an endless supply of memorabilia. The property also features a walk through a fun house and the world’s largest jack in the box. Wild Bill's Nostalgia Delaware - Enjoy a tour and a tasting at Milton's Dogfish Head Brewery, home to the now-famous “off-centered ales for off-centered people” and the iconic Steampunk Treehouse. VisitDelaware.com Florida - Ed Leedskalnin built his Coral Castle in secret in Homestead, leaving scientists, engineers and scholars baffled since 1923. No one knows how he excavated, carved and placed 1,100 tons of coral. Coral Castle Inc. Georgia - “The Big Chicken” is a well known Marietta landmark that is visible from miles away. The 56-foot-tall bird was built in 1963 and now rises above a KFC restaurant. Historic Marietta Square Hawaii - Each year, 30,000 people gather to celebrate SPAM luncheon meat in Hawaii at the Waikiki Spam Jam. Waikiki Spam Jam Fullscreen Idaho - At the Dog Bark Park Inn B & B in Cottonwood, guests retire for the evening inside this friendly beagle and awake to freshly baked pastries and homemade granola. The gift shop features canine carvings made by the innkeepers, who are chainsaw artists. Dog Bark Park Illinois - Route 66 is home to more of the quirky and offbeat Americana than anywhere else. In Staunton, Henry’s Ra66it Ranch pays homage to owner Rich’s love of all things hare. EnjoyIllinois.com Indiana - The Nancy Barnett gravesite is right in the middle of the road in Franklin, Ind.. Emmis Publishing Iowa - Albert the Bull in Audubon, Iowa, was constructed in 1964. Albert weighs 45 tons, stands 30 feet tall and spans 15 feet from horn to horn. Iowa Tourism Office Kansas - Frank Stoeber started the World's Largest Ball of Twine in 1951 and gave it to Cawker City in 1961. Visitors are encouraged to add twine to the ball. Kansas Department of Wildlife, Parks & Tourism Kentucky - Dinosaur World features 150 life-size replicas of dinosaurs on a 20-acre park just a few miles from Mammoth Cave National Park. www.kentuckytourism.com Louisiana - The tomb of Marie Laveau, the famous voodoo priestess of New Orleans, is located in St. Louis Cemetery No. 1, though her body is rumored to be buried elsewhere. New Orleans CVB Maine - Featured in Stephen King's 'It,' this 31-foot statue of legendary lumberjack Paul Bunyan still stands tall over Bangor, which was once known as the Lumber Capital of the World. Maine Office of Tourism - Monty Rand Maryland - The American Visionary Art Museum in Baltimore is the only museum in the country dedicated to works by untrained artists. Dean Ray/Visit Baltimore Massachusetts - The Mapparium at the Christian Science Center in Boston is a spherical stained glass room that visitors enter to view a map of the world dating from 1935. Massachusetts Office of Travel & Tourism Michigan - Located in Frankenmuth, Bronner’s CHRISTmas Wonderland is the world’s largest Christmas store with more than 90,000 square feet of holiday trim, gifts and collectible. Bronners CHRISTmas Wonderland Minnesota - The tiny town of Vining has been transformed by the industrious creativity of one man, Ken Nyberg, a 70-year-old resident who has built and installed more than two dozen large sculptures in and near Nyberg Park. Paul Stafford, Explore Minnesota Tourism Fullscreen Mississippi - The Devil’s Crossroads, located at the corner of Highways 61 and 49 in Clarksdale, is the location where Robert Johnson is said to have sold his soul to the devil in exchange for the ability to play the guitar. Visit Mississippi Missouri - Towering at 42 feet, 1 inch tall, the World’s Largest Rocking Chair in Cuba is a sight to see. Sarah Luebbert/Missouri Division of Tourism Montana - A long-time local favorite, visitors to the Sip ’n Dip Lounge in Great Falls can enjoy cocktails poolside, or sit at the bar and watch mermaids swim by. Scott Fairbanks/Montana Office of Tourism Nebraska - Carhenge in Alliance is a unique roadside attraction of 38 vehicles placed to mimic the size and structure of Stonehenge. Nebraska Tourism Nevada - “The Last Supper” by Albert Szukalski is a sculpture at the Goldwell Open Air Museum adjacent to Rhyolite ghost town. Travelnevada.com New Hampshire - The Wolfman has been a popular attraction at Clark’s Trading Post in Lincoln for decades. Clark's Trading Post New Jersey - The Animodules sculptures located at the Turtle Back Zoo in West Orange, N.J., serve as large-scale peace ambassadors. Greater Newark Convention & Visitors Bureau New Mexico - The Tinkertown Museum in Albuquerque is a folk art museum, constructed using more than 50,000 glass bottles and other recyclable materials. Tinkertown Museum New York - The only museum of its kind in the country, New York City's MoMath features interactive exhibits that demonstrate connections between math and our everyday interactions. Kate Glicksberg Fullscreen North Carolina - The World’s Largest Chest of Drawers, standing 40 feet tall, was built in 1926 to call attention to High Point as the Furniture Capital of the World. It originally housed the Chamber of Commerce and was dubbed the Bureau of Information. VisitNC.com North Dakota - Get a picture with the World’s Largest Holstein Cow, Salem Sue, near New Salem. North Dakota Tourism Ohio - Located near Newark, Ohio, the Longaberger Company headquarters is located in the world’s largest basket; it rises seven stories and has handles weighing approximately 150 tons. EscapetoLickingCounty.com Oklahoma - The Ed Galloway Totem Pole Park, located in Foyil, is a Route 66 icon and home of \"The World's Largest Concrete Totem Pole.\" Lori Duckworth/Oklahoma Tourism Oregon - The tallest freestanding cuckoo clock in America is located in Portland’s International Airport atrium. Travel Oregon Pennsylvania - Since the 1860s, the Mutter Museum has served as a riveting storehouse for the anatomically strange in Philadelphia, with more than 20,000 provocative items designed to give a beneath-the-surface perspective of what physicians study. Mutter Museum Rhode Island - The Fantastic Umbrella Factory in South County, R.I., is a community of artists featuring a collection of animals, a bamboo forest, gardens and a café. South County Tourism Council - Samuel J. Bent-Ellis South Carolina - The Peachoid is a 135-feet-tall water tower in Gaffney that offers an interesting roadside stop for travelers. Peter Frank Edwards/DiscoverSouthCarolina.com South Dakota - Gravity shifts, heights change and water flows uphill at the one-of-a-kind Cosmos Mystery Area in the Black Hills of South Dakota. SD Department of Tourism Fullscreen Tennessee - Elvis’ Graceland in Memphis gives visitors an inside look on how the King of Rock n’ Roll lived. Fans from around the world flock to the attraction every August to celebrate Elvis Week with concerts, competitions and a candlelight vigil. Jack Gruber, USAT Texas - Cadillac Ranch is an iconic public art installation made up of 10 Cadillacs half-buried in a field west of Amarillo, Texas. Visitors are encouraged to leave their mark with graffiti or spray paint. Texas Tourism Utah - Carved out of a huge rock just outside of Moab, Hole N\" The Rock is a 5,000- square-foot home, gift shop, trading post and exotic zoo. Matt Morgan Vermont - The Spider Web Farm in Williamstown is an art studio and retail outlet for an artist who uses spider webs to produce one-of-a-kind art. VermontVacation.com Virginia - Dinosaur Land in White Post is home to more than 50 fiberglass prehistoric creatures ranging in height from three to 30 feet tall and as long as 90 feet. Sarah Hauser, Virginia Tourism Corporation Washington - Located under the world-famous Pike Place Market in Seattle, the Gum Wall is covered in chewed gum of all colors. Charlie Schuck West Virginia - The World’s Largest Teapot was brought to Chester, W.V., in 1938. Steve Shaluta/Wild, Wonderful West Virginia Wisconsin - The largest building in the town of Hayward is a 4½ story-fiberglass musky, which houses the Freshwater Fishing Hall of Fame. Robb Fischer/TravelWisconsin.com Fullscreen Wyoming - The Mother Featherlegs Memorial is said to be the only monument in the USA dedicated to a prostitute. It’s definitely off the beaten path about 10 miles outside of Lusk, and can only be accessed from the back roads. Wyoming Office of Tourism Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-19T14:00:00.000+03:00", "crawled": "2015-10-19T17:57:51.572+03:00", "highlightTitle": ""}