{"organizations": [], "uuid": "be60e0508b401184977b4792068523202b29501e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/12/southwest-airlines-300x44.png", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/southwest-airlines-brings-transfarency-to-airline-industry/", "country": "US", "title": "Southwest Airlines Brings Transfarency To Airline IndustryTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Southwest Airlines Brings Transfarency To Airline IndustryTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "be60e0508b401184977b4792068523202b29501e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/southwest-airlines-brings-transfarency-to-airline-industry/", "ord_in_thread": 0, "title": "Southwest Airlines Brings Transfarency To Airline IndustryTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Southwest Airlines Brings Transfarency To Airline Industry\nSouthwest Airlines premiered its latest advertising campaign today during an exclusive event inside the new international concourse at William P. Hobby airport in Houston. The campaign—called TransfarencySM—includes multiple TV advertisements, print and digital elements, as well as a microsite focused on the industry’s competitive landscape.\n“Transfarency is a unique approach to treating Customers the way they expect and deserve to be treated. Being a low-fare airline is at the heart of our brand, and the foundation of our business model, so we’re not going to nickel and dime our customers,” said Kevin Krone, Southwest’s Vice President and Chief Marketing Officer. “Southwest continues to lead the pack as the only airline that offers low fares and an inclusive approach to travel. Transfarency is not a new chapter for us, but another tone to the bell that we’ve been ringing for more than 44 years.”\nThe initial ad that debuted today will begin airing this evening as the Texas Rangers, who Southwest proudly sponsors, fight to advance in the baseball playoffs. It continues to run Sunday, Oct. 11, in conjunction with existing placements airing during NFL Sunday Football. Working with agency of record, GSD&M, in Austin, Texas, this campaign includes a heavy focus on the Company’s low-fare philosophy with no unexpected bag fees, change fees, or hidden fees.\nThe Transfarency campaign features a heavy emphasis on the unique philosophy created by Southwest Airlines. Transfarency is where Customers are treated honestly and fairly, and low fares actually stay low—with no unexpected bag fees, change fees, or hidden fees. The Transfarency philosophy was created by and is practiced exclusively by Southwest Airlines.\n“Transfarency rose to the top for us,” said Marianne Malina, president of GSD&M. “In one word you get the idea; you get the playfulness from it. It has smart humor that Southwest can own, and it elevates the idea beyond just inclusive pricing. It’s about transparency and being honest.”\nIn addition to the TV advertisements, campaign elements include print and digital components as well as a microsite focused on the industry’s competitive landscape. The microsite includes videos and quizzes focused on Southwest’s unique philosophy. A “Fee or Fake” quiz provides tips for travelers to avoid pervasive fees from other airlines.\nThe 30-second initial advertisement that debuted today will begin airing Sunday, Oct. 11, during NFL games on NBC, CBS, and FOX NFL programming. It highlights the bold new look one year after its initial launch and verbalizes the airline’s low fares and 86 U.S. destinations.\nThe ads will run nationally for 15 weeks. Following the Oct. 11 launch, Southwest is scheduled to release three additional ads in the coming months. The airline also plans to roll out digital extensions on Facebook and Twitter surrounding the new campaign.\nInternational Concourse\nToday’s rollout of the new campaign comes as Southwest gets ready to open a new, $156 million international concourse at William P. Hobby Airport in Houston. On Oct. 15, Southwest will begin operating flights to six international destinations across Latin America and the Caribbean. The new era in air travel will provide Southwest’s Houston Customers a low-fare choice to reach destinations that have been not been reachable through Hobby airport in decades.", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T07:03:57.780+03:00", "highlightTitle": ""}