{"organizations": [], "uuid": "10901df9ff124a9f5a7a9818e2fde5750cc2990b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30241667/magellan-explorist-trx7-provides-complete-off-road-navigation-solution-to-consumers-at-aimexpo-2015", "country": "US", "title": "Magellan eXplorist TRX7 Provides Complete Off-Road Navigation Solution to Consumers at AIMExpo 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Magellan eXplorist TRX7 Provides Complete Off-Road Navigation Solution to Consumers at AIMExpo 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "10901df9ff124a9f5a7a9818e2fde5750cc2990b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30241667/magellan-explorist-trx7-provides-complete-off-road-navigation-solution-to-consumers-at-aimexpo-2015", "ord_in_thread": 0, "title": "Magellan eXplorist TRX7 Provides Complete Off-Road Navigation Solution to Consumers at AIMExpo 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Magellan\nCloud-Connected Unit Provides Users With The Most Comprehensive Trail Data Base, Enhanced Driver Safety, Ability To Record And Share Trail Data, Augment Community-Enhanced Maps With Personal Notes And Pictures, And More\nSANTA CLARA, Calif. , Oct. 12, Magellan announces its new off-road vehicle navigation solution, the eXplorist TRX7, for the 4x4 and Powersports vehicle consumer markets at the AIMExpo in Orlando, Florida from October 15-18 . Designed specifically for the off-roading enthusiast, this navigation device offers improved driver safety, a superior user experience including detailed 3D maps and community generated trail data, all at an exceptional value right out of the box. It will be demonstrated during the AIMExpo in the Magellan Booth, #1085.\nThe eXplorist TRX7 allows users to plan, track and save trail rides and add pictures and comments to share with friends, family, or the larger off-road and outdoor communities.\n\"Magellan's new eXplorist TRX7 is the most fully-loaded, affordable and purpose-built off-road navigator for adventuring,\" commented Stig Pedersen , associate vice president of product management for Magellan. \"Whether you want to navigate the classic trails, or want to create your own adventures, the Magellan eXplorist TRX7 stands ready to help you traverse some of the most rugged terrain.\"\nThe Device\nThe Magellan eXplorist TRX7 features a weatherproof 7\" LCD touchscreen display, along with Wi-Fi and Bluetooth connectivity. Meeting IP67 standards, this ruggedized device is water and dust proof. It comes with a Marine-grade pogo-pin mount and Genuine RAM® Rail Mount, ideal for 4x4 vehicles as well as ATV, UTV and side-by-sides.\nThe eXplorist TRX7 packs a lot of maps, trails and POI's on board. Magellan designed the TRX7 with a powerful Dual Core Cortex-A9 processor, and 1G Mobile DDR2 memory, running on Android™ 4.2, to ensure a fast and smooth off-road navigation experience. In addition, with 16GB onboard memory and a 64GB MicroSD card expansion slot, TRX7 has the storage to accommodate new outdoor maps as they are developed.\nThe Maps\nThe device comes preloaded with over 44,000 trails, making it the most comprehensive outdoor trail maps available for off-road enthusiasts.\nMagellan's detailed off-road maps feature:\nHigh resolution 3D Terrain 2D Topo base map & contour elevation lines National and State Parks and Recreational Vehicle Areas National and State service roads and trails Ever expanding crowd-sourced Trails Food, Gas, Lodging, and General Service POIs 3rd Party Trail Guides The Magellan off-road vehicle platform's trail maps are cloud based, dynamic, and will continue to grow and be improved by both Magellan and through crowd-sourced additions from the TRX7 user community.\nShare the Ultimate Off-Road Experience\nOutdoor enthusiasts have incredible stories to save and share. The Magellan TRX7 gives off-roaders, campers, and anyone enjoying the outdoors on a vehicle the tools to plan, experience, and capture their activities in a story format that they can keep or share. With seamless integration to social media sites such as Twitter, users are able to post their greatest trail adventures. The device also provides users with an online trip-planning and trail-sharing site. Members of Magellan's dedicated off-road vehicle online community earn achievement badges for posting and sharing \"dirt miles\" traveled and total number of trails posted.\nImproved Off-Road Safety\nUsers can confidently plan safe and fun trail rides by filtering trails on multiple criteria including: Difficulty, Length (Dirt Miles), Duration, Terrain, Technical Obstacles, and Awesomeness. Additionally, save important waypoints to trail rides, such as campsites, aid stations, and water, so users can easily navigate to those locations. TRX7 users know they will never be lost with Magellan's Backtrack feature. The TRX7 automatically marks the location of the beginning of a trail ride, and with one touch safely navigates back to the starting point.\nAvailability and Pricing\nThe Magellan eXplorist TRX7 will be available in October with an MSRP of $599.99 . Additional information about Magellan's navigation products is available at www.magellangps.com .\nAbout Magellan\nHeadquartered in Santa Clara, CA , MiTAC Digital Corporation, manufacturer of the Magellan ( www.magellangps.com ) brand of portable GPS navigation devices, is a wholly-owned subsidiary of MiTAC International Corporation. Magellan, the industry leader for innovative GPS navigation devices since 1986, globally markets award-winning products in multiple categories including auto, RV, commercial, outdoor, fitness and mobile. Continuing its spirit of innovation, Magellan is developing new cloud-based technologies, wearables, OEM and B-to-B solutions to meet the changing needs of today's consumers.\nFollow Magellan on Facebook , Twitter and YouTube .\nMedia Contact:\nAndrew Wille & Rita Lee\nCopernio\nmagellan@copernio.com\n714.891.3660\nAll products/services and trademarks mentioned in this release are the properties of their respective companies.\n© 2015 MiTAC Digital Corp. All rights reserved.\nPhoto - http://photos.prnewswire.com/prnh/20151012/276080\nLogo - http://photos.prnewswire.com/prnh/20150409/197633LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/magellan-explorist-trx7-provides-complete-off-road-navigation-solution-to-consumers-at-aimexpo-2015-300158042.html\n ", "external_links": ["http://www.magellangps.com/", "http://photos.prnewswire.com/prnh/20151012/276080", "http://www.xmlnews.org/ns/", "https://www.facebook.com/MagellanGPS", "http://www.youtube.com/user/magellanvideo/featured", "https://twitter.com/magellangps", "http://www.prnewswire.com/news-releases/magellan-explorist-trx7-provides-complete-off-road-navigation-solution-to-consumers-at-aimexpo-2015-300158042.html", "http://photos.prnewswire.com/prnvar/20150409/197633LOGO", "http://photos.prnewswire.com/prnh/20150409/197633LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA25886&Transmission_Id=201510121420PR_NEWS_USPR_____LA25886&DateId=20151012", "https://photos.prnewswire.com/prnvar/20151012/276080"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T22:58:17.564+03:00", "highlightTitle": ""}