{"organizations": [], "uuid": "ae1ae363e278091d2f546d31a34865ce65d4b32c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64353/taste-waldorf-astoria-prepares-second-course", "country": "US", "title": "Taste of Waldorf Astoria prepares for second course", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Taste of Waldorf Astoria prepares for second course", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:16:00.000+03:00", "replies_count": 0, "uuid": "ae1ae363e278091d2f546d31a34865ce65d4b32c"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64353/taste-waldorf-astoria-prepares-second-course", "ord_in_thread": 0, "title": "Taste of Waldorf Astoria prepares for second course", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Taste of Waldorf Astoria prepares for second course     \nMCLEAN, VA - Following the program’s 2014 debut, today Waldorf Astoria Hotels & Resorts announces the second year of Taste of Waldorf Astoria, a global culinary program in partnership with the James Beard Foundation (JBF), the United States’ foremost culinary arts organization. This fall, the search for the next iconic dish continues with a fresh group of five hand-selected JBF Rising Star Semi-Finalist chefs dispatching to five new participating Waldorf Astoria destinations around the globe, including Amsterdam, New Orleans, Beijing, Jerusalem, and Orlando. \n“We are thrilled to be partnering with the James Beard Foundation for a second year on Taste of Waldorf Astoria, a program that celebrates and nurtures our culinary heritage,” said John T.A. Vanderslice, global head, Waldorf Astoria Hotels & Resorts. “Waldorf Astoria is committed to culinary excellence at each of the brand’s more than 140 world-class bars, lounges, and specialty restaurants worldwide.” \nTaste of Waldorf Astoria will host five chef experiences at the following properties: \nThe Roosevelt New Orleans, A Waldorf Astoria Hotel September 28 – October 1, 2015 \nWaldorf Astoria Master Chef: Mark A. Majorie, Jr., Chef de Cuisine at Fountain Lounge Restaurant \nJBF Rising Star Semi-Finalist Chef: Jeremy Wayne, Chef de Cuisine at La Folie (San Francisco, CA) \nA native of New Orleans, Chef Majorie joined The Roosevelt, A Waldorf Astoria Hotel, in 2014 after stints at Royal Sonesta New Orleans, Trump Sonesta Miami and several restaurants abroad, including August in La Provence. Chef du Cuisine at La Folie since 2013, Chef Wayne got his start at Bohemian Club, before moving to respected San Francisco institution La Folie under Chef Roland Passot. \nWaldorf Astoria Orlando November 1 – 4, 2015 \nWaldorf Astoria Chef: Bernard Fiemeyer, Executive Chef at Waldorf Astoria Orlando \nJBF Rising Star Semi-Finalist: Jamilka Borges, Chef de Cuisine at Bar Marco and Founder of Swing Truck (Pittsburgh, PA) \nWith experience in the kitchens of Japan, Thailand, France and the US, Chef Bernard Fiemeyer brings his passion for international cuisine to his current position as executive chef at Waldorf Astoria Orlando and Hilton Orlando Bonnet Creek. Chef Borges’ Pittsburgh restaurant has been on bon apétit’s Best New Restaurant list and has received national press not just for the outstanding cuisine, but also for its no tipping policy. \nWaldorf Astoria Amsterdam November 9 – 12, 2015 \nWaldorf Astoria Master Chef: Sidney Schutte, Executive Chef at Restaurant Librije’s Zusje Amsterdam (two Michelin Stars) \nJBF Rising Star Semi-Finalist Chef: Grae Nonas, Co-Executive Chef at Olamaie \nGaining recognition and experience working for renowned star chefs such as Roger Soeveryns of Scholteshof (Belgium), Jonnie Boer of De Librije Zwolle (The Netherlands), and Richard Ekkebus of Amber at The Landmark Mandarin Oriental Hotel (Hong Kong), Executive Chef Schutte has been managing the kitchen at Waldorf Astoria Amsterdam since the opening in May 2014. Chef Schutte was awarded with two prestigious Michelin stars for Restaurant Librije’s Zusje Amsterdam, only 7 months after opening. After working alongside star chefs such as Mario Batali, and Jon Shook and Vinny Dotolo of animal and Son of a Gun, Food & Wine “Best New Chef” Grae Nonas is Co-Executive Chef at Olamaie, a beloved new garden southern restaurant in Austin, TX. \nWaldorf Astoria Jerusalem November 29 – December 3, 2015 \nWaldorf Astoria Master Chef: Itzik Mizrachi Barak, Executive Chef at King’s Court and Palace Restaurants \nJBF Rising Star Semi-Finalist Chef: Joseph “JJ” Johnson, Executive Chef at The Cecil and Minton’s (New York, NY) \nExecutive Chef Itzik Barak, one of Israel’s most renowned chefs, brings his roots in traditional Israeli cuisine paired with global fine dining experience to his contemporary Mediterranean cuisine at Waldorf Astoria Jerusalem’s two signature restaurants. Included in both Zagat and Forbes’ “30 Under 30” lists, Chef Johnson is Executive Chef at The Cecil and Minton’s, both based in the Harlem Neighborhood of New York City, a burgeoning culinary hotspot. Chef Johnson specialized in bringing together global flavors through an African and Asian lens. \nWaldorf Astoria Beijing \nWaldorf Astoria Master Chef: Benoit Chargy, Executive Chef at Waldorf Astoria Beijing \nJBF Rising Star Semi-Finalist Chef: Erik Bruner-Yang of Toki Underground, Maketto and Honeycomb (Washington, D.C.) \nWaldorf Astoria Beijing Executive Chef Benoit Chargy leads three on-property restaurants, combining his background in classical French cuisine with a global sensibility to create a world-class dining experience. Washington, D.C.-based Chef Bruner-Yang is chef and owner of Maketto, Honeycomb and Toki Underground, which won the 2012 Eater award for DC’s “Restaurant of the Year.” Other accolades for his inventive pan-Asian cuisine include a finalist for the 2014 James Beard Foundation Award for Rising Star Chef of the Year and Food & Wine finalist for People’s Choice Best Chef (Mid-Atlantic). \n“In the spirit of founder James Beard, a champion of American cuisine, we are delighted to once again partner with Waldorf Astoria Hotels & Resorts, an iconic brand that has made numerous notable contributions to America’s culinary heritage,” says Susan Ungaro, president, James Beard Foundation, \"We are looking forward to giving our Rising Star Chefs semifinalists a global perspective, collaborating with Waldorf Astoria’s Master Chefs worldwide to create a contemporary iconic dish.” \nThe JBF chefs will visit their selected property for one week, spending time with the Waldorf Astoria Master Chef inside and outside the kitchen, visiting local markets and producers, restaurants or off-the-beaten-path locations for inspiration. \nEach participating chef will prepare their recipes in New York on February 24, 2016, for a panel of culinary luminaries, who will ultimately decide the winning dish. The final Taste of Waldorf Astoria will be featured at each of the brand’s 25 hotels and resorts worldwide, joining its storied culinary legacy with a modern classic for today’s luxury traveler. \nLast year, Taste of Waldorf Astoria winners Heinz Beck, Waldorf Astoria Master Chef, at La Pergola at Rome Cavalieri, Waldorf Astoria Hotels & Resorts, and David Posey, formerly Executive Chef at Blackbird in Chicago, were awarded top honors with their Celery Root Risotto alla Waldorf. The dish was a reinvention of the iconic Waldorf Salad, using an innovative technique replacing the traditional rice base of risotto with celery root. \nEach Waldorf Astoria Hotel & Resort now offers a curated 3-course dinner for guests to enjoy their own Taste of Waldorf Astoria, served in a distinct location on property.", "external_links": [], "published": "2015-09-30T23:16:00.000+03:00", "crawled": "2015-10-01T00:12:19.352+03:00", "highlightTitle": ""}