{"organizations": [], "uuid": "b919a71c2fd5e3ce873911ffd1a00c733050f330", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297248413348_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.calgarysun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.calgarysun.com/2015/10/08/kate-winslet-refuses-to-join-virgin-galactic-space-trip", "country": "CA", "title": "Kate Winslet refuses to join Virgin Galactic space trip [Photos]", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "Kate Winslet refuses to join Virgin Galactic space trip [Photos]", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T07:00:00.000+03:00", "replies_count": 0, "uuid": "b919a71c2fd5e3ce873911ffd1a00c733050f330"}, "author": "", "url": "http://www.calgarysun.com/2015/10/08/kate-winslet-refuses-to-join-virgin-galactic-space-trip", "ord_in_thread": 0, "title": "Kate Winslet refuses to join Virgin Galactic space trip [Photos]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Winslet"], "text": "Monday, October 12, 2015 10:00 PM MDT 10 celebrities going to space Previous Next \nSir Richard Branson and his Virgin Galactic team suffered a major setback on the road to space tourism when in late October 2014, his space ship, the SpaceShipTwo, crashed during a test run . The billionaire Brit still hopes the first suborbital journey will take place in 2015, saying in a statement that \"space is hard - but worth it. We will persevere and move forward together.\"Some of the future first passengers include celebrities who have paid $200,000 or more for 15 minutes in space. Branson's pals, ranging from Leonardo DiCaprio to Tom Hanks, have already booked their tickets for a trip into space. Discover what other celebs have booked a ticket to space in our gallery. (Postmedia Network photo illustration) \nSarah Brightman: The Phantom of the Opera star and her ex-husband Andrew Lloyd Webber have joined forces to write an original song Brightman plans to perform in space. The British soprano, who is preparing for blast off on a Russian Soyuz rocket on Sept. 1, 2015, will spend 10 days aboard the International Space Station, where she’ll perform a new track. (WENN.com) \nVictoria Principal: Actress Victoria Principal of Dallas fame bought herself a ticket for the Virgin Galactic space flight. \"I’m a passenger on something that is pioneering,\" she said. (QMI Agency) \nRussell Brand & Katy Perry: Brand's ex-wife, singer Katy Perry, bought the funnyman a ticket on the Virgin Galactic space trip as a gift and reportedly bought one for herself, too. Hopefully they aren't sitting next to eachother! (WENN.com) \nKate Winslet: Richard Branson gave actress Kate Winslet a ticket for the Virgin Galactic SpaceShipTwo flight as a wedding present after after she saved his mother from a fire at his Necker Island resort. (WENN.com) \nStephen Hawking: It's been reported that Richard Branson invited famed physicist and cosmologist Stephen Hawking to join him on the Virgin Galactic space flight free of charge as his guest. (WENN.com) \nAngelina Jolie & Brad Pitt: A-list couple Brangelina have reportedly signed up for one of Virgin Galactic's space flights. (WENN.com) \nTom Hanks: Tom Hanks was reportedly among the first celebrities to book a flight on the Virgin Galactic space journey. (WENN.com) \nAshton Kutcher: Ashton Kutcher was the 500th person to sign up for a flight to space with Virgin Galactic. Reports say he'll also be buying girlfriend Mila Kunis a ticket. (WENN.com) \nJustin Bieber: The Biebs and his manager, Scooter Braun, have booked their tickets for the Virgin Galactic flight. The singer even tweeted \"I wanna do a concert in space\" after making his reservation. (WENN.com) \nLeonardo DiCaprio: Leo will be on board the Virgin Galactic ship when it heads to space. The actor even auctioned off the seat next to him on the space flight for charity. (WENN.com) \nRichard Branson: As the founder of the Virgin Galactic group, Branson will be on the first flight to space when his ship blasts off in 2014. (WENN.com)", "external_links": [], "published": "2015-10-13T07:00:00.000+03:00", "crawled": "2015-10-13T07:17:26.411+03:00", "highlightTitle": ""}