{"organizations": [], "uuid": "29c97c99286a2c9d6ca7555ba3d81fda8a6c3db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/10/74274e98b87c450fa524f6e94b5ca0db-474x711.jpg", "site_section": "http://seattletimes.com/rss/travel.xml", "section_title": "The Seattle Times » Sections » Travel", "url": "http://www.seattletimes.com/nation-world/oddities/sleeping-idaho-hunter-wakes-up-to-black-bear-biting-his-head/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_travel", "country": "CH", "title": "Sleeping Idaho hunter wakes up to black bear biting his head", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Sleeping Idaho hunter wakes up to black bear biting his head | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:00:00.000+03:00", "replies_count": 0, "uuid": "518f25a285a816d824f612aa624ec14ba64ff3bf"}, "author": "KEITH RIDLER", "url": "http://www.seattletimes.com/nation-world/oddities/sleeping-idaho-hunter-wakes-up-to-black-bear-biting-his-head/", "ord_in_thread": 0, "title": "Sleeping Idaho hunter wakes up to black bear biting his head", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOISE, Idaho — A hunter asleep in the remote Idaho wilderness woke up when he felt something tugging on his hair. Then he heard the black bear breathing.\nStephen Vouch, 29, reached behind his head and felt it was wet. He yelled when he realized a bear was biting at his head.\n“He got a hold of my head, and that’s what woke me up,” the Boise resident said Wednesday, who was in the rugged area hunting bighorn sheep with friends. “That’s when I kind of freaked out. That’s when I could hear the bear breathing on me.”\nHis scream startled the bear, which jumped and hit the tarp above where they were sleeping. The tarp tumbled, entangling the animal and the hunters around 2 a.m. Friday.\nMost Read Stories Amid drought, Rattlesnake Lake reveals its roots Probe of 777 engine’s explosive failure pinpoints its origin Seattle-area teen loved football, says grieving father SEC adds millions to developer’s alleged fraud in Seattle Lloyd McClendon’s status is at the top of the new Mariners GM’s list Unlimited Digital Access. $1 for 4 weeks. “That’s when my buddy’s gun went off,” Vouch said.\nRelated Stories Scotland Yard's macabre Crime Museum goes on public display That hissing sound under the dryer? The missing king cobra Cops: Man stabbed at funeral, suspect tries to flee in limo Man charged for setting up fake job interviews in Florida Hamburgers might be on the menu for Russian cosmonauts Denali name change trickles down to fast-food burger The bear, wounded by a shot from the .45-caliber handgun, scrambled into a nearby tree. Vouch, cut but not seriously injured, shot and killed it.\nVouch said he and his friends were prepared with medical supplies for emergencies but didn’t have a satellite phone, so he didn’t receive medical care for three days.\nThe hunting group patched him up, then rafted downstream before flying out of the remote Frank Church River of No Return Wilderness on Sunday. Vouch was treated Monday at a hospital for cuts to his head and released.\nIdaho Fish and Game officials estimate that the male bear was about 3 to 7 years old and weighed 200 to 275 pounds. Jon Rachael, state wildlife manager with the department, said it’s not clear why the bear entered the camp because the hunters had stored their food properly.\nOne possibility is the bear may have become accustomed to finding food from the many rafters that float the Middle Fork of the Salmon River each summer, he said.\nOr the bear may have never encountered people, and out of curiosity, chomped on what may have appeared to be fur, Rachael said. If the bear intended to kill, the attack would have been much more violent, he said.\nIt’s the second time this year that someone sleeping outdoors in Idaho has been attacked by a black bear. In early September, state officials trapped and killed a black bear near McCall in west-central Idaho that bit a sleeping firefighter who had been battling blazes in the region.\nRachael said it’s been a tough year for bears because destructive wildfires and drought have made for an exceptionally bad berry season, a key food source.\nIn bear country, Rachael recommends bear spray rather than guns because of the danger of accidentally shooting fellow campers while trying to fend off a bear.\nVouch said he plans to return to the area within the next several weeks to continue hunting for bighorn sheep. In Idaho, the opportunity to hunt Rocky Mountain bighorn sheep is rare — hunters are allowed to harvest only one in a lifetime.\nKEITH RIDLER", "external_links": [], "published": "2015-10-08T11:00:00.000+03:00", "crawled": "2015-10-08T18:40:59.468+03:00", "highlightTitle": ""}