{"organizations": ["St. Lucia Tourism Board Fullscreen Morne Coubaril Estate", "Belle Mont Farm Fullscreen", "Rabot Estate", "Belle Mont Farm", "St. Lucia Tourism Board", "Dominican Republic Ministry of Tourism Fullscreen Alleta", "La Dauphine Estate", "St. Lucia Tourism Board Fullscreen Visitors", "Tobago Tourism Development Company", "Puerto Rico Tourism Company", "Tobago Cocoa Estate", "Dominican Republic Ministry of Tourism Fullscreen", "Tobago Tourism Development Company Fullscreen"], "uuid": "91b3d8776e2e41d33b0e9cbb916acc234c94f8be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/e2a62e279b08edc40e3ff364b384684560472d01/c=4-0-1916-1080&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390720706706-Hacienda-Tres-ngeles-Worker-and-Woman-Talking-Puerto-Rico-Tourism-Company.png", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/best-of-caribbean/2015/10/15/farm-caribbean-best-agricultural-tours/73948006/", "country": "US", "title": "Farm to traveler: The Caribbean's best agricultural tours", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "Farm to traveler: The Caribbean's best agricultural tours", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:01:00.000+03:00", "replies_count": 0, "uuid": "91b3d8776e2e41d33b0e9cbb916acc234c94f8be"}, "author": "", "url": "http://www.usatoday.com/story/best-of-caribbean/2015/10/15/farm-caribbean-best-agricultural-tours/73948006/", "ord_in_thread": 0, "title": "Farm to traveler: The Caribbean's best agricultural tours", "locations": ["Ponce", "Bonaire", "Curacao", "Caribbean", "St. Kitts", "Jayuya", "Hacienda Tres Ángeles", "Saint Lucia", "Kittitian Hill", "Rio Blanco", "Puerto Rico", "Dominican Republic", "Paramin", "Trinidad"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lucero", "Alleta", "Joe Colon", "Café Lucero", "Nativo"], "text": "Three of Puerto Rico's most important agricultural tours are coffee plantations: Hacienda Tres Ángeles, in Adjuntas; Café Nativo, in Jayuya; and Café Lucero, in Ponce. Joe Colon, Puerto Rico Tourism Company Fullscreen Visitors can observe various steps in the cultivation of coffee plants, processing of coffee beans, and packaging of the final product. Joe Colon, Puerto Rico Tourism Company Fullscreen At Café Lucero, participants can kick back with a cup of some of the freshest coffee they’ll likely ever have, made from Lucero’s 100 percent Arabica beans. Puerto Rico Tourism Company Fullscreen In the Dominican Republic, a pair of full-day agricultural tours are offered by Explora Ecotour. The Rio Blanco Rainforest and Coffee Tour combines a rainforest hike with a visit to the rural community of Rio Blanco. Dominican Republic Ministry of Tourism Fullscreen The Guaconejo Rainforest and Cacao Plantation Tour takes participants into the Loma Guaconejo Scientific Preserve, a tropical rain forest. The Dominican Republic Ministry of Tourism Fullscreen In addition to soaking up the natural surroundings, which includes waterfalls and rivers, travelers are treated to a look at sustainable organic cacao farming. Dominican Republic Ministry of Tourism Fullscreen Alleta’s Goat Farm on Bonaire has a tour that showcases milking of the goats and cheese making, and of course provides a chance to mingle with the goats. The tour finishes with an ice tea and cheese tasting. Alleta’s Goat Farm Fullscreen Curacao recently saw the opening of its first winery, called simply Curacao Winery. Vineyard tours are available, and for particularly thirsty travelers there’s a wine terrace and B&B. Curacao Winery Fullscreen Ever since the colonial days, Saint Lucia has been known for its heritage of producing first-rate cacao and chocolate. St. Lucia Tourism Board Fullscreen There are numerous plantations and estates where visitors can witness various stages of the chocolates making process. St. Lucia Tourism Board Fullscreen Visitors can do everything from observing cacao bean fermentation and polishing of the beans, to sampling boutique chocolate. St. Lucia Tourism Board Fullscreen Morne Coubaril Estate, La Dauphine Estate, and the Fond Doux Holiday Plantation tour offer comprehensive tours. Hotel Chocolat Fullscreen For an immersive experience, travelers can book The Chocolate Decadence Tour from Island Routes Caribbean Adventures, which begins with a catamaran ride to Rabot Estate at Hotel Chocolat, where guests make their own chocolate and then enjoy a chocolate-themed lunch. Hotel Chocolat Fullscreen A visit to the village of Paramin in Trinidad is as much a community tour as an agricultural tour. Local residents serve as guides, accompanying visitors through the mountainous village, where farmers grow a wide range of vegetables, fruits and herbs. Trinidad and Tobago Tourism Development Company Fullscreen Crops range from chives to chadon beni, a leafy green similar to cilantro. During the tour, visitors meet the farmers, who discuss their growing methods and offer up a taste of their fresh produce. Trinidad and Tobago Tourism Development Company Fullscreen For travelers with a sweet tooth, the Tobago Cocoa Estate is located in the southeastern region of the island. Trinidad and Tobago Tourism Development Company Fullscreen Driving can be tricky along narrow roads, so a guide is recommended. Trinidad and Tobago Tourism Development Company Fullscreen A tour of the estate focuses on cocoa production, with a few sidesteps along the way to observe the fruits, vegetables and herbs grown on the estate, which include mangoes, soursop, and the spice, achiote. Trinidad and Tobago Tourism Development Company Fullscreen For an ultra-luxe agricultural experience, travelers can head to Belle Mont Farm on Kittitian Hill in St. Kitts. Belle Mont Farm Fullscreen While this is an upscale 400 acre spread of villas, a spa, restaurants, and an “edible” golf course, the area is also a sustainable development. Belle Mont Farm Fullscreen Guests staying at Belle Mont Farm are provided with baskets and are encouraged to forage for the freshest produce imaginable, self-picked from the stem or vine. Belle Mont Farm At Café Lucero, participants can kick back with a cup of some of the freshest coffee they’ll likely ever have, made from Lucero’s 100 percent Arabica beans. (Photo: Puerto Rico Tourism Company)\n2 CONNECT 19 TWEET LINKEDIN COMMENT EMAIL MORE There’s a type of Caribbean-bound traveler who wants more than a sea and sun getaway. They want to experience a deeper connection with their vacation destination. One of the ways they can accomplish this is to take an agricultural tour to a working farm or plantation. Agricultural tours focus on a variety of produce, including cacao, coffee, and coconuts. One island even has its own fledgling winery. These tours are growing in number throughout the Caribbean, providing an off-resort activity that combines a dash of history, an up close look at island agriculture, and a chance to meet the locals.\nPuerto Rico\nPuerto Rico has made the biggest plunge into the agricultural tourism scene, and last year even established an Agrotourism Certification Program. Currently there are a handful of plantations travelers can visit. Puerto Rico has the added appeal of being easily explored by rental vehicle, since driving is on the right, signs are bilingual and highways are well-maintained.\nThree of Puerto Rico's most important agricultural tours are coffee plantations: Hacienda Tres Ángeles, in Adjuntas; Café Nativo, in Jayuya; and Café Lucero, in Ponce. Visitors can observe various steps in the cultivation of coffee plants, processing of coffee beans, and packaging of the final product. At Café Lucero, participants can kick back with a cup of some of the freshest coffee they’ll likely ever have, made from Lucero’s 100 percent Arabica beans.\nDominican Republic\nIn addition to soaking up the natural surroundings, which includes waterfalls and rivers, travelers are treated to a look at sustainable organic cacao farming. (Photo: Dominican Republic Ministry of Tourism)\nIn the Dominican Republic, a pair of full-day agricultural tours are offered by Explora Ecotour. The Rio Blanco Rainforest and Coffee Tour combines a rainforest hike with a visit to the rural community of Rio Blanco. The community has struggled economically and has gotten a real boost from the inauguration of an organic coffee plantation. The Guaconejo Rainforest and Cacao Plantation Tour takes participants into the Loma Guaconejo Scientific Preserve, a tropical rain forest. In addition to soaking up the natural surroundings, which includes waterfalls and rivers, travelers are treated to a look at sustainable organic cacao farming.\nBonaire\nAlleta’s Goat Farm on Bonaire has a tour that showcases milking of the goats and cheese making, and of course provides a chance to mingle with the goats. The tour finishes with an ice tea and cheese tasting. (Photo: Alleta’s Goat Farm)\nThe Dutch island of Bonaire is well-known for the quality of its homemade goat cheese. Visitors to the island can experience this firsthand at Alleta’s Goat Farm, where tours are given Mondays, Wednesdays and Fridays. The tour showcases milking of the goats and cheese making, and of course provides a chance to mingle with the goats. The tour finishes with an ice tea and cheese tasting. Aletta's Semper Kontentu Goat Cheese, Goat Yoghurt and Goat Milk are sold at local stores throughout the island.\nCuracao\nCuracao recently saw the opening of its first winery, called simply Curacao Winery. Vineyard tours are available, and for particularly thirsty travelers there’s a wine terrace and B&amp;B. (Photo: Curacao Winery)\nIt’s not every day that a traveler gets a chance to tour a vineyard in the Caribbean. Curacao recently saw the opening of its first winery, called simply Curacao Winery. The winery is conveniently located near Curacao’s international airport. The winery will produce Dutch wine, and is run by the Visscher Family. Vineyard tours are available, there’s a wine terrace and B&B, and even a crowdfunding effort underway, to expand the winery from 2.5 to 25 acres.\nSaint Lucia\nMorne Coubaril Estate, La Dauphine Estate, and the Fond Doux Holiday Plantation tour offer comprehensive tours. (Photo: Hotel Chocolat)\nEver since the colonial days, Saint Lucia has been known for its heritage of producing first-rate cacao and chocolate. There are numerous plantations and estates where visitors can witness various stages of the chocolates making process, from observing cacao bean fermentation and polishing of the beans, to sampling boutique chocolate. Morne Coubaril Estate, La Dauphine Estate, and the Fond Doux Holiday Plantation tour offer comprehensive tours. For an immersive experience, travelers can book The Chocolate Decadence Tour from Island Routes Caribbean Adventures, which begins with a catamaran ride to Rabot Estate at Hotel Chocolat, where guests make their own chocolate and then enjoy a chocolate-themed lunch.\nTrinidad & Tobago\nCrops range from chives to chadon beni, a leafy green similar to cilantro. During the tour, visitors meet the farmers, who discuss their growing methods and offer up a taste of their fresh produce. (Photo: Trinidad and Tobago Tourism Development Company)\nA visit to the village of Paramin in Trinidad is as much a community tour as an agricultural tour. Local residents serve as guides, accompanying visitors through the mountainous village, where farmers grow a wide range of vegetables, fruits and herbs. These range from chives to chadon beni, a leafy green similar to cilantro. During the tour, visitors meet the farmers, who discuss their growing methods and offer up a taste of their fresh produce.\nThe Tobago Cocoa Estate is located in the southeastern region of the island. Driving can be tricky along narrow roads, so a guide is recommended. A tour of the estate focuses on cocoa production, with a few sidesteps along the way to observe the fruits, vegetables and herbs grown on the estate, which include mangoes, soursop, and the spice, achiote.\nSt. Kitts\nWhile this is an upscale 400 acre spread of villas, a spa, restaurants, and an “edible” golf course, the area is also a sustainable development. (Photo: Belle Mont Farm)\nFor an ultra-luxe agricultural experience, travelers can head to Belle Mont Farm on Kittitian Hill in St. Kitts. While this is an upscale 400 acre spread of villas, a spa, restaurants, and an “edible” golf course, the area is also a sustainable development. Guests staying at Belle Mont Farm are provided with baskets and are encouraged to forage for the freshest produce imaginable, self-picked from the stem or vine. All guests have to do is follow the “Pick Me” signs.\n2 CONNECT 19 TWEET LINKEDIN COMMENT EMAIL MORE Read //usat.ly/1RJM5Yw MORE STORIES", "external_links": ["http://www.gannett-cdn.com/-mm-/db6b76ab53ff632bf738d16e13092b9b6630e8fc/c=272-0-4814-3415&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402723032580-Tobago-Cocoa-Pod-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/-mm-/69c8ab0b079a16c81b080d9f02530ac1dadbc730/c=6-0-4602-3456&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804397892118646-CuracaoWinery1-Curacao-Winery.jpg", "http://www.gannett-cdn.com/-mm-/e234615332a256f9cc3886df52d5dbde50163ea6/c=242-0-1678-1080&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390720706706-Hacienda-Tres-ngeles-Worker-and-Woman-Talking-Puerto-Rico-Tourism-Company.png", "http://www.gannett-cdn.com/-mm-/9cd287268ef4916b27614d36e5957ae3ca1a2f14/c=241-0-4012-2835&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804406914026310-1-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/e84b354ccd6b2c178952a77b097668a0e2ef34d0/c=272-0-4814-3415&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402723032580-Tobago-Cocoa-Pod-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/-mm-/ba071e57bcf57fc07c178a5d328805244d4026eb/c=242-0-1678-1080&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390720706706-Hacienda-Tres-ngeles-Worker-and-Woman-Talking-Puerto-Rico-Tourism-Company.png", "http://www.gannett-cdn.com/-mm-/f7f51dc08965628f62dad90760db4ec587ac2c2d/c=0-616-2760-4296&r=1083&c=0-0-1080-1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390805415792-Hacienda-Tres-ngeles-Plantation-and-Region-01-Puerto-Rico-Tourism-Company.jpg", "http://www.gannett-cdn.com/-mm-/bda0c10afef8bab47d345bcc6f169e54810d8d2c/c=381-0-2626-1688&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390852060390-Hacienda-Tres-ngeles-Harvest-01-Puerto-Rico-Tourism-Company.jpg", "http://www.gannett-cdn.com/-mm-/9713dd34ae643d48170c4e5e84cbc40ebe8cb9a7/c=381-0-2626-1688&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390852060390-Hacienda-Tres-ngeles-Harvest-01-Puerto-Rico-Tourism-Company.jpg", "http://www.gannett-cdn.com/-mm-/d2e40dbeabeb16d6618bcda419e796a4fc3ccfff/c=0-309-6016-3708&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804407032431828-2-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/33d97f8a03d5ea06baca0f7a30eca34c8bd87643/r=500x281/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390720706706-Hacienda-Tres-ngeles-Worker-and-Woman-Talking-Puerto-Rico-Tourism-Company.png", "http://www.gannett-cdn.com/-mm-/b5fde72ef9f2051309f25c75af8391d7106ca9d5/c=241-0-4012-2835&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804406914026310-1-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/c9c1045ad1f8269166a18eaaf35c8660c7e2acfe/c=0-616-2760-4296&r=383&c=0-0-380-510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390805415792-Hacienda-Tres-ngeles-Plantation-and-Region-01-Puerto-Rico-Tourism-Company.jpg", "http://www.gannett-cdn.com/-mm-/155b45d96f61cd06a0e5f4223095a0f7309449de/c=0-1715-3670-3788&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400459287558-Saint-Lucia-ChocolateMaking2-HotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/aa14c1a40866aedf108094af370703ff90e0fe99/c=38-0-2513-3300&r=1083&c=0-0-1080-1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804399781302866-Saint-Lucia-CocoaBeanEgg-PhotoCredHotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/0c4f615b72563dab277830177607bdec6d430756/c=0-81-3552-2752&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804399915308584-Saint-Lucia-CocoaBeans-Saint-Lucia-Tourism-Board.jpg", "http://www.gannett-cdn.com/-mm-/95a42ab969f59cc51e0631858f3d50fc2b79f50d/c=326-0-5433-3840&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402941279378-Tobago-Cocoa-Estate-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/-mm-/2f4f3898f23cc62e5a199e2824609cf5c463d513/c=0-305-3670-5198&r=1083&c=0-0-1080-1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400459287558-Saint-Lucia-ChocolateMaking2-HotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/155b45d96f61cd06a0e5f4223095a0f7309449de/c=0-1715-3670-3788&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400446339392-Saint-Lucia-ChocolateMaking1-PhotoCredHotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/8d44780191ac99635c7a0bcd6e17617068ca85b4/c=38-0-2513-3300&r=383&c=0-0-380-510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804399781302866-Saint-Lucia-CocoaBeanEgg-PhotoCredHotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/11393f4fce58f0b96a4bb326f20f0a5901448a1f/c=0-3-500-379&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393902991504-cacao-producesGuaconejo-Rainforest-and-Cacao-Plantation-Tour-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/95c4a3d16fbd0dc184e0bbfa964cc55113cae4e2/c=0-3-500-379&r=x408&c=540x405/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393902991504-cacao-producesGuaconejo-Rainforest-and-Cacao-Plantation-Tour-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/3307523b34b02895455a562c5b00ee141c0f716f/c=5-0-3963-2976&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804395809491946-BONAIRE-ALETTA-S-GOATS-Alleta-s-Goat-Farm.JPG", "http://www.gannett-cdn.com/-mm-/f4e9e7dc7e6ff292fdc18961066cac60dddac650/c=0-367-3968-2609&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804395809491946-BONAIRE-ALETTA-S-GOATS-Alleta-s-Goat-Farm.JPG", "http://www.gannett-cdn.com/-mm-/dcc8c8d6b19f611d8cf6121ecfaf2cf72de1cdc4/c=0-49-500-331&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393902991504-cacao-producesGuaconejo-Rainforest-and-Cacao-Plantation-Tour-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/61b65b9452ee1b2920610ed21cbe5d1743064b57/c=4-0-1916-1080&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390720706706-Hacienda-Tres-ngeles-Worker-and-Woman-Talking-Puerto-Rico-Tourism-Company.png", "http://www.gannett-cdn.com/-mm-/2f4549f95d40a72f01550fcda8659144b77f4311/c=5-0-3963-2976&r=x408&c=540x405/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804395809491946-BONAIRE-ALETTA-S-GOATS-Alleta-s-Goat-Farm.JPG", "http://www.gannett-cdn.com/-mm-/b6367e7c8c4d18ba88fd5f1f6ef52a761359666a/c=414-0-6947-4912&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804406564893834-3-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/a07cad0c4a6286a1a163cd58a93c0019672f0ed3/c=278-0-4884-3463&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402789645434-Tobago-Cocoa-Estate-Cocoa-Pod-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390720706706-Hacienda-Tres-ngeles-Worker-and-Woman-Talking-Puerto-Rico-Tourism-Company.png", "http://www.gannett-cdn.com/-mm-/cd7ae611113f82f77802c4766ca33aaac645e7eb/c=161-0-5251-6787&r=383&c=0-0-380-510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400755535356-SaintLucia-coupleplantation-Saint-Lucia-Tourism-Board.jpg", "http://www.gannett-cdn.com/-mm-/ce482eec30151ba18a26b1057e3ac4a570cc625d/c=0-426-4608-3029&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804397892118646-CuracaoWinery1-Curacao-Winery.jpg", "http://www.gannett-cdn.com/-mm-/4fc3a446846f7aecf5cbfe1d1adb2289fe4d7805/c=0-305-3670-5198&r=183&c=0-0-180-240/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400459287558-Saint-Lucia-ChocolateMaking2-HotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/8ee429c7d9adf87fd45a4f784c90e6099ff0a628/c=6-0-4602-3456&r=x408&c=540x405/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804397892118646-CuracaoWinery1-Curacao-Winery.jpg", "http://www.gannett-cdn.com/-mm-/6a6408a708b108c604df2416b4a4d10cbda14a98/c=337-0-5678-4016&r=x408&c=540x405/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804407032431828-2-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/9e44e06ba86943bf1dd0b0eb9b40e9291f45f00c/c=3-0-2046-1536&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393935595922-Guaconejo-Rainforest-and-Cacao-Plantation-Tour-2-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/99ba4def9a9b19db1c4adf4a2a057b42f03378f0/c=199-0-3306-2336&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402924275160-Paramin-2Trinidad-Tobago-Tourism-Development-Company.jpg", "http://www.gannett-cdn.com/-mm-/feb2b5c61d722557afffb6171806a6a2007ee90c/c=0-0-604-454&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393903147506-Guaconejo-Rainforest-and-Cacao-Plantation-Tour-3-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/8bc0955893e9d11a7da9ec48e5741dc3dda3c37e/c=0-305-3670-5198&r=383&c=0-0-380-510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400446339392-Saint-Lucia-ChocolateMaking1-PhotoCredHotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/043b912d3f20d0930b2c67c1cd5902cc669871a3/c=0-293-5760-3547&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402941279378-Tobago-Cocoa-Estate-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/-mm-/8bc0955893e9d11a7da9ec48e5741dc3dda3c37e/c=0-305-3670-5198&r=383&c=0-0-380-510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400459287558-Saint-Lucia-ChocolateMaking2-HotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/8cba716f44566dbbac3df136bdd4232b0489caf6/c=199-0-3306-2336&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402877630562-Paramin-1Trinidad-Tobago-Tourism-Development-Company.jpg", "http://www.gannett-cdn.com/-mm-/9e3bff266982469a700bebacaefc86fdaa29e89c/c=242-0-1678-1080&r=x404&c=534x401/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390720706706-Hacienda-Tres-ngeles-Worker-and-Woman-Talking-Puerto-Rico-Tourism-Company.png", "http://www.gannett-cdn.com/-mm-/547d9c40df362ea309eff5b188cd7143c83ee249/c=337-0-5678-4016&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804407032431828-2-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/cd480b45780d6fababc295d1b435b32632390dbd/c=326-0-5433-3840&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402941279378-Tobago-Cocoa-Estate-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/-mm-/3ff431cfc8743bdc9cb8ac0e7f29c2f133ba6629/c=0-273-5162-3189&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402789645434-Tobago-Cocoa-Estate-Cocoa-Pod-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/-mm-/8cba716f44566dbbac3df136bdd4232b0489caf6/c=199-0-3306-2336&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402924275160-Paramin-2Trinidad-Tobago-Tourism-Development-Company.jpg", "http://www.gannett-cdn.com/-mm-/100b169af899c3a27a8dd9083eed8be5c9607ca5/c=0-1865-5412-4923&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400755535356-SaintLucia-coupleplantation-Saint-Lucia-Tourism-Board.jpg", "http://www.gannett-cdn.com/-mm-/7d442a271f6a51e677bb00b6b811479a9ac2d844/c=161-0-5251-6787&r=1083&c=0-0-1080-1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400755535356-SaintLucia-coupleplantation-Saint-Lucia-Tourism-Board.jpg", "http://usat.ly/1RJM5Yw", "http://www.gannett-cdn.com/-mm-/b1ac472f25d68a0ba325804babf8ea9abdd1a5ac/c=337-0-5678-4016&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804407032431828-2-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/86db3e201d3967776019f9a06251a1eb4ba3cf74/c=0-271-5086-3144&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402723032580-Tobago-Cocoa-Pod-Trinidad-Tobago-Tourism-Company.JPG", "http://www.gannett-cdn.com/-mm-/4bffb6b08269842dd925ae87085c8ac4a6909a82/c=0-56-604-397&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393903147506-Guaconejo-Rainforest-and-Cacao-Plantation-Tour-3-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/10724dabeed9f8f0993bcadf670cd42b834df065/c=6-0-4602-3456&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804397892118646-CuracaoWinery1-Curacao-Winery.jpg", "http://www.gannett-cdn.com/-mm-/2f4f3898f23cc62e5a199e2824609cf5c463d513/c=0-305-3670-5198&r=1083&c=0-0-1080-1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804400446339392-Saint-Lucia-ChocolateMaking1-PhotoCredHotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/878165bc6da23d1d1635927a4da4b201e02bb07b/c=278-0-4884-3463&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402789645434-Tobago-Cocoa-Estate-Cocoa-Pod-Trinidad-Tobago-Tourism-Company.JPG", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1RJM5Yw&text=Farm%20to%20traveler%3A%20The%20Caribbean%27s%20best%20agricultural%20tours&via=usatoday", "http://www.gannett-cdn.com/-mm-/34a6d00086dacf0c14f6dd101c7ffa8da89fb7e5/c=0-377-7360-4535&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804406564893834-3-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/f4524b815f90e8054071b5db6966545f6d2abf42/c=0-178-3504-2158&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402877630562-Paramin-1Trinidad-Tobago-Tourism-Development-Company.jpg", "http://www.gannett-cdn.com/-mm-/d3ef31bc14caf302c812123acdd840dda742a43f/c=0-3-500-379&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393902991504-cacao-producesGuaconejo-Rainforest-and-Cacao-Plantation-Tour-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/0e5950d90101c3f02abd82ff8e287ce85e005132/c=0-413-3552-2420&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804399915308584-Saint-Lucia-CocoaBeans-Saint-Lucia-Tourism-Board.jpg", "http://www.gannett-cdn.com/-mm-/c2542c90ae71d15fc8c07cdf9954673efd4c5c59/c=3-0-2046-1536&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393935595922-Guaconejo-Rainforest-and-Cacao-Plantation-Tour-2-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/98cfa27d5bb8df0d7a89026e1df813590eda0f6f/c=10-0-2998-1688&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390852060390-Hacienda-Tres-ngeles-Harvest-01-Puerto-Rico-Tourism-Company.jpg", "http://www.gannett-cdn.com/-mm-/21b9cd65189c0aaa7f51ef9998dff1d63f0e2cc6/c=0-930-2550-2371&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804399781302866-Saint-Lucia-CocoaBeanEgg-PhotoCredHotelChocolat.jpg", "http://www.gannett-cdn.com/-mm-/f4524b815f90e8054071b5db6966545f6d2abf42/c=0-178-3504-2158&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402924275160-Paramin-2Trinidad-Tobago-Tourism-Development-Company.jpg", "http://www.gannett-cdn.com/-mm-/99ba4def9a9b19db1c4adf4a2a057b42f03378f0/c=199-0-3306-2336&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402877630562-Paramin-1Trinidad-Tobago-Tourism-Development-Company.jpg", "http://www.gannett-cdn.com/-mm-/0a15aa297c9291098f11a70f221b170b73cdc376/c=0-216-4252-2618&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804406914026310-1-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/323b2cdc245dee750e79379072329dfa12fb0726/c=5-0-3963-2976&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804395809491946-BONAIRE-ALETTA-S-GOATS-Alleta-s-Goat-Farm.JPG", "http://www.gannett-cdn.com/-mm-/a180a16ced7e6fae6b746db3fb80a54aca1608f2/c=414-0-6947-4912&r=x1443&c=1920x1440/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804406564893834-3-Belle-Mont-Farm.jpg", "http://www.gannett-cdn.com/-mm-/f8c6faf0a3d4e39712a7ee4eab3f5d5cd9cf6218/c=0-189-2048-1346&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393935595922-Guaconejo-Rainforest-and-Cacao-Plantation-Tour-2-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/062b7ed9ed6cda05e2568483e7a036368894d12a/c=0-81-3552-2752&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804399915308584-Saint-Lucia-CocoaBeans-Saint-Lucia-Tourism-Board.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1RJM5Yw&mini=true", "http://www.gannett-cdn.com/-mm-/d4a71030510b8c8a5c4f84c485eea53e37e522be/c=199-0-3306-2336&r=x408&c=540x405/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804402924275160-Paramin-2Trinidad-Tobago-Tourism-Development-Company.jpg", "http://www.gannett-cdn.com/-mm-/f69a85f1fe4c5556109b0d05ee4ca7840c589bff/c=0-0-604-454&r=x513&c=680x510/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804393903147506-Guaconejo-Rainforest-and-Cacao-Plantation-Tour-3-Dominican-Republic-Ministry-of-Tourism.jpg", "http://www.gannett-cdn.com/-mm-/003fae1c1f2f1c08a8617fb192064c2884e40169/c=0-1676-2760-3235&r=x48&c=80x45/local/-/media/2015/10/14/USATODAY/ExperienceCaribbean/635804390805415792-Hacienda-Tres-ngeles-Plantation-and-Region-01-Puerto-Rico-Tourism-Company.jpg", "http://www.gannett-cdn.com/media/"], "published": "2015-10-15T15:01:00.000+03:00", "crawled": "2015-10-15T16:30:10.375+03:00", "highlightTitle": ""}