{"organizations": [], "uuid": "4b7772e2897922adfc05c4af4373c2656b2e2f2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/eb0a40b2bfd35c44295f55cd259b01ed56f8455d/c=0-26-5753-3276&#038;r=x329&#038;c=580x326/local/-/media/2015/10/22/USATODAY/USATODAY/635811168202860647-AP-United-Airlines-Carry-on-Bags.jpg", "site_section": "http://www.rocketnews.com/category/travel/feed/", "section_title": "» Travel", "url": "http://www.rocketnews.com/2015/10/united-tinkers-with-boarding-coffee-seating-to-improve-service/", "country": "US", "title": "United tinkers with boarding, coffee, seating to improve service", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "United tinkers with boarding, coffee, seating to improve service", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:25:00.000+03:00", "replies_count": 0, "uuid": "4b7772e2897922adfc05c4af4373c2656b2e2f2c"}, "author": "Travel News Headlines - Yahoo! News", "url": "http://www.rocketnews.com/2015/10/united-tinkers-with-boarding-coffee-seating-to-improve-service/", "ord_in_thread": 0, "title": "United tinkers with boarding, coffee, seating to improve service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted on October 22, 2015 by Travel News Headlines - Yahoo! News Article Attribution and Read More at: Article Source \nThis photo from May 8, 2013, shows United passengers in separate boarding lanes at Chicago O’Hare International Airport. (Photo: M. Spencer Green, AP) \nUnited Airlines will be testing new boarding procedures at Chicago’s O’Hare airport this week, part of a broader effort to improve service. \nJim Compton, United’s vice chairman and chief revenue officer, told analysts Thursday he couldn’t say precisely how the process might change, but said customers should expect changes through the end of the year. \n“We’re always looking at the boarding process,” Compton said. “It’s one of the things we hear a lot about.” \nOscar Munoz, United’s CEO who was appointed Sept. 8 and is recovering from a heart attack Oct. 15, visited front-line workers and invited traveler comments as he took the helm of the company. In full-page ads in USA TODAY and other national papers, Munoz acknowledged the 2010 merger with Continental Airlines had been “rocky” and that the company needed to earn back the faith of travelers. USA TODAY New United CEO acknowledges ‘rocky’ merger, pledges ‘that’s going to change’ \nBrett Hart, the general counsel named acting CEO on Monday, said the company is pursuing Munoz’s agenda in his absence. Hart cited the boarding process, the in-flight experience and irregular operations as subjects for attention. \n“We have been focused for some time on improving customer service and focusing on where we can make a difference,” Hart said. “I think you will see changes and improvement.” \nOne priority for Hart is to complete collective bargaining agreements with flight attendants and maintenance workers, which haven’t been resolved since the merger. \n“Oscar’s focus was a renewed focus on our customers and getting our employees the tools that they need to succeed and provide excellent customer service,” Hart said. “We are using what he provided in terms of his vision as a lens for executing on his plan for the rest of this fiscal year. \nGreg Hart, chief operating officer, said the airline has made improvements this year. United canceled 30,000 fewer flights this year than in 2014, so that 2.7 million fewer travelers were affected, he said. \nOn-time performance is up 5 points, with better completion rates than competitors in New York, Chicago and Houston, he said. The airline’s mishandled bag rate is also 9% better than a year earlier, he said. \n“We are all focused on raising our performance to a level we and our customers expect,” Greg Hart said. “We should all be proud of the significant progress we have made.” USA TODAY United to end service at JFK, focus on Newark \nCompton, the airline’s revenue chief, said improvements in the pipeline include expanded Wi-Fi and reconfiguring planes with more flat-bed seats. Newark routes offering United’s “p.s.” premium service to San Francisco and Los Angeles will have 100 flat-bed seats starting Oct. 25, he said. \nEven drinks are getting attention. \n“We’re down to three choices of premium coffee,” Compton said. “That was something we heard loud and clear.” Read or Share this story: http://usat.ly/1LP6kDl Share This:", "external_links": [], "published": "2015-10-22T20:25:00.000+03:00", "crawled": "2015-10-23T20:10:09.133+03:00", "highlightTitle": ""}