{"organizations": [], "uuid": "a9ca695954e77e9d6507b73fff3703f655e134ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/have_the_best_experience_of_boys_canoe_camps_at_camp_pathfinder/", "country": "US", "title": "Have the Best Experience of Boy’s Canoe Camps at Camp Pathfinder!", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Have the Best Experience of Boy’s Canoe Camps at Camp Pathfinder!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T03:10:00.000+02:00", "replies_count": 0, "uuid": "a9ca695954e77e9d6507b73fff3703f655e134ba"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/have_the_best_experience_of_boys_canoe_camps_at_camp_pathfinder/", "ord_in_thread": 0, "title": "Have the Best Experience of Boy’s Canoe Camps at Camp Pathfinder!", "locations": ["United States", "Source Lake", "Pathfinder Island"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Have the Best Experience of Boy’s Canoe Camps at Camp Pathfinder! The author briefs about the service providers offer summer and adventure campaigns for ages 7-16. Professionals are expert in offering exciting sports, Canoe trips and other exciting activity package. United States, 26 October 2015 -- Camp Pathfinder is a classic boys' camp offer summers of adventure for ages 7-16. We arrange summer campaigns in hills, meadows, lake, river front and long trails. The camp is located on Pathfinder Island, Source Lake in world-famous Algonquin Provincial Park. We arrange summer campaigns in hills, meadows, lake, river front and long trails. There are proper arrangement of sporting and gaming activities such as courts for tennis, football, basketball, volleyball, archery, hockey and others.Camp Pathfinder is a classic boys' camp offer summers of adventure for ages 7-16. We arrange summer campaigns in hills, meadows, lake, river front and long trails. The camp is located on Pathfinder Island, Source Lake in world-famous Algonquin Provincial Park. We arrange summer campaigns in hills, meadows, lake, river front and long trails. There are proper arrangement of sporting and gaming activities such as courts for tennis, football, basketball, volleyball, archery, hockey and others. Summer camp boys offer exciting sports, awesome canoe trips, terrific counselors and great friends. They will be tasked to play games and to make friends with other teen campers. At our website, you can check out our activities. Wilderness camps also have trained filed guides and therapists. Campaigns are also organized training in drama, music, writing, cooking, serving and dance. Moreover, the parents check out the Pathfinder Experience. The camping professional will share insights about communication and coping strategies that will help your child deal with the real world. Boy’s canoe camps are organized under the supervision of professionally trained counselors and camp organizers. Along with this, camping candidates can have the basic lessons of waterfront activities such as swimming, sailing, waterskiing, kayaking, windsurfing, canoeing, fishing, and snorkeling that give water exercise experience to children and teens. Going to summer camp helps children and teenager to develop self-confidence and self-esteem, in a safe and well guided environment. Summer campaigns helps child to maintain a structured time in summer, when they don’t go to their schools. These camps are organized for kids, boys, and teens and even for families. Canoeing camps are one solution to enjoy wilderness and adventure. There are number of camp organizers, who also schedule overnight camp with proper accommodation, security and food. These packages are well designed to rejuvenate the children and teenagers. Our professionals are with the children all the time to give utmost care and security. At our website user can check out competent information about campaign package. To get more info about our campaigns and trips feel free to get in touch with us at http://www.camppathfinder.com . # # #", "external_links": [], "published": "2015-10-26T03:10:00.000+02:00", "crawled": "2015-10-26T15:29:03.875+02:00", "highlightTitle": ""}