{"organizations": [], "uuid": "b8fbdedfaed328a75cf25f79b8cb8508047bd411", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/show-previews/ibtm-world/29331-meetings-leadership-summit-connects-industry-leaders-at-ibtm-world-2015", "country": "US", "title": "Meetings Leadership Summit connects Industry Leaders at ibtm world 2015", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Meetings Leadership Summit connects Industry Leaders at ibtm world 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T11:00:00.000+03:00", "replies_count": 0, "uuid": "b8fbdedfaed328a75cf25f79b8cb8508047bd411"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/show-previews/ibtm-world/29331-meetings-leadership-summit-connects-industry-leaders-at-ibtm-world-2015", "ord_in_thread": 0, "title": "Meetings Leadership Summit connects Industry Leaders at ibtm world 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Meetings Leadership Summit connects Industry Leaders at ibtm world 2015 Meetings Leadership Summit connects Industry Leaders at ibtm world 2015 Details Created on Tuesday, 13 October 2015 09:00 Sweden’s Acclaimed Communications and Political Expert Per Schlingmann Confirmed to Headline Event ibtm world have announced that over 200 international industry leaders are confirmed to attend the Meetings Leadership Summit, an exclusive invitation only event that will be hosted at the El Born Centre Cultural, a remarkable 17th century restoration site, on the evening of Monday 16th November, ahead of the opening day of ibtm world 2015. \nPer Schlingmann, a distinguished speaker, communications expert, trend analyst, political advisor, former Swedish Secretary of State and founder of communications agency Per Schlingmann AB has been confirmed to headline this event. Schlingmann’s presentation will focus on themes from Urban Express, the acclaimed book he co-authored with respected economist Dr Kjell that “offers tools, mindset and tips for navigating the new life that is emerging.” Schlingmann will place special emphasis on the coined terms “traditional knowledge” and “wild-knowledge” from Urban Express as well as draw on his varied background in politics, communications and finance to present meeting leaders with useful strategies for navigating today’s fast changing and unpredictable world. Schlingmann comments, “There is a paradox in our time: in the era of the digital revolution experiences that cannot go digital will rise in value and importance. Unique experiences and the human factor will become more important to people. The new value creation is about combining digital solutions with real experiences. “With my experience from high level political strategy and advising business leaders I am going to draw the map of what’s happening in the world and how this affects people and business. The explosion of information and knowledge, globalization and the real blockbuster in our time – the city – changes the world and creates new opportunities for people and businesses. I´m going to present tools for how to become a winner when the Urban Express alters our way of living.” The event will also provide an opportunity for guests to network with fellow CEOs, Presidents, Vice Presidents, Senior Directors, Senior Decision Makers and Entrepreneurs and enjoy a themed dinner presented in the form of a traditional market. The evening will close with the announcement of the winner of the ibtm world 2015 Lifetime Achievement Award in recognition of services to the global events industry. ibtm world 2015 will take place from 17th – 19th November. Latest ibtm world news", "external_links": [], "published": "2015-10-13T11:00:00.000+03:00", "crawled": "2015-10-13T11:40:54.756+03:00", "highlightTitle": ""}