{"organizations": [], "uuid": "9a4cc058facce26e02bb2240216163aafb0d71cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/12/13014777/Decadence.jpeg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/2015/10/prweb13014777.htm", "country": "US", "title": "Cooper’s Hawk Celebrates 10-year Anniversary", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Cooper’s Hawk Celebrates 10-year Anniversary", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a4cc058facce26e02bb2240216163aafb0d71cd"}, "author": "Matt Hensler", "url": "http://www.prweb.com/releases/2015/10/prweb13014777.htm", "ord_in_thread": 0, "title": "Cooper’s Hawk Celebrates 10-year Anniversary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cooper’s Hawk Winery & Restaurants kicks off a year-long celebration to honor its ten-year anniversary with a special edition magnum bottle, Decadence. The anniversary wine is a full-bodied, exceptionally balanced California red that is being distributed as a thank-you gift to the company’s 2,500 employees over the age of 21 and an exceptional wine-of-the-month varietal for more than 150,000 Wine Club members. The rapidly expanding and highly immersive dining and retail brand produces award-winning wines exclusively for its restaurants, artisanal markets, and Wine Club members. The customer journey starts with carefully orchestrated food and wine pairings from Executive Chef Matt McMillin and Winemaker Rob Warren, and can expand to include new discoveries, experiences, and friendships through its Wine Club. Members can join fellow wine-lovers and experts on exclusive events, trips and tastings.\nCooper’s Hawk Founder and CEO, Tim McEnery, launched the anniversary festivities with a celebratory toast to all of his nineteen restaurants. “We’re so proud to reflect on these past 10 years and know that our success is directly attributed to our dedicated Wine Club members and guests,” stated McEnery. “We’re committed to a culture of excellence and community, and are passionate about celebrating life’s many joys.”\nCooper’s Hawk has won over 300 wine awards, including a recent 99-point win for its Lux Pinot Noir at the Critics Challenge International Wine Competition in San Diego, California. The company also had the honor of having its wines poured at the 2009 and 2013 Illinois Inaugural Galas in Washington, D.C., and has been listed as one of the best restaurants in Chicago in the book Food Lovers Guide to Chicago: The Best Restaurants, Markets, & Local Culinary Offerings. The company plans to open restaurants in Ashburn, Virginia, and Jacksonville and Naples, Florida within the next six months.\nABOUT COOPER’S HAWK WINERY & RESTAURANTS\nRedefining the modern casual dining experience, Cooper’s Hawk is an unparalleled combination of restaurant, winery, Napa-style tasting room, and artisanal retail market. The innovative concept partners with some of the best grape growers in the world to craft the award-winning Cooper’s Hawk wine collection. Additionally, Cooper’s Hawk boasts one of the country’s largest Wine Clubs, a life-style driven monthly affiliation offering exclusive wines, events, and privileges.\nHelmed by CEO and Founder Tim McEnery, Cooper’s Hawk was first uncorked in Orland Park, Illinois in 2005. Operations have since expanded to nineteen locations throughout Illinois, Indiana, Missouri, Ohio, Virginia, and Wisconsin, with three additional units slated for construction through early 2016.\nCooper’s Hawk has received accolades such as ‘Breakout Brand’ and ‘Hot Concept’ by Nation’s Restaurant News. In 2014, the concept was profiled by the Wall Street Journal and Tim McEnery was named Ernst & Young’s ‘Midwest Entrepreneur of the Year.’\nMORE\nWebsite: http://www.chwinery.com\nTwitter: @chwinery\nFacebook: http://www.facebook.com/coopershawk", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mYWNlYm9vay5jb20vY29vcGVyc2hhd2s=", "http://www.facebook.com/coopershawk", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5jaHdpbmVyeS5jb20="], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T10:18:00.137+03:00", "highlightTitle": ""}