{"organizations": [], "uuid": "c9da5efced988fcb8f76b76370bfece897f2a290", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/29408-church-house-hosts-the-spectator-speakers-series-with-melvyn-bragg", "country": "US", "title": "Church House hosts The Spectator Speakers Series with Melvyn Bragg", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Church House hosts The Spectator Speakers Series with Melvyn Bragg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T11:15:00.000+03:00", "replies_count": 0, "uuid": "c9da5efced988fcb8f76b76370bfece897f2a290"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/29408-church-house-hosts-the-spectator-speakers-series-with-melvyn-bragg", "ord_in_thread": 0, "title": "Church House hosts The Spectator Speakers Series with Melvyn Bragg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Church House hosts The Spectator Speakers Series with Melvyn Bragg Church House hosts The Spectator Speakers Series with Melvyn Bragg Details Category: Venues & Events Created on Monday, 19 October 2015 09:15 Church House Conference Centre played host to critically acclaimed author and broadcaster Melvyn Bragg last week during an event organised by The Spectator magazine (October 14, 2015). As part of its Speakers Series, organised by Spectator Events and held in association with King & Wood Mallesons, Bragg discussed his latest novel Now is the Time, a rich and compelling tale set in the heart of the Peasants’ Revolt of 1381. Blending fact and fiction in a tale of power and justice, religion, loyalty and ethics, Melvyn Bragg brings alive the momentous episode in English history that saw the country’s first democratic uprising. \nThe Spectator organises a range of events for both personal and professional interests, and has used Church House Conference Centre for many of these in the past, including a debate on Iraq and Syria and Stop HS2! Church House will be the host venue for another Spectator Events discussion on November 15 2015, when the audience will discuss ‘Is the BBC really a national treasure?’, chaired by Andrew Neil, Editor-in-Chief of The Spectator Magazine Group and presenter of The Daily Politics, Sunday Politics and This Week. Natalie Roberts, Events Manager of Press Holdings Media Group says: “We love working with Church House - the staff are very professional and always help us to produce seamless and smoothly run events. The whole team are very cooperative and never let us down, from the serving staff, to the AV team. We were delighted with our evening with Melvyn Bragg.” Robin Parker, General Manager of Church House Conference Centre, commented: “The events held by The Spectator are always thought provoking and cover a range of interesting topics. The evening with Melvyn Bragg was certainly no different and attracted a large audience. We are delighted to continue our relationship with Spectator Events and look forward to hosting their next event here in November.” Church House Conference Centre is situated in the heart of Westminster and is one of London’s most versatile event venues, accommodating between 2 and 664 guests. The AIM Gold venue’s 19 event spaces are supported by a team who are recognised for their commitment to service excellence throughout all areas. Related articles", "external_links": [], "published": "2015-10-19T11:15:00.000+03:00", "crawled": "2015-10-19T12:45:32.130+03:00", "highlightTitle": ""}