{"organizations": [], "uuid": "8ff510aaaffb0550e8bb1230d98b41ca0d811f04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-55f9e14b/turbine/ct-trav-0916-world-watch-20150916", "site_section": "http://www.chicagotribune.com/lifestyles/travel", "section_title": "Travel - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/lifestyles/travel/ct-trav-0916-world-watch-20150916-story.html", "country": "US", "title": "Migrant crisis in Germany likely means hassles for tourists", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Migrant crisis in Germany likely means hassles for tourists - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T00:38:00.000+03:00", "replies_count": 0, "uuid": "8ff510aaaffb0550e8bb1230d98b41ca0d811f04"}, "author": "Larry Habegger, Dani Burlison", "url": "http://www.chicagotribune.com/lifestyles/lifestyles/travel/ct-trav-0916-world-watch-20150916-story.html", "ord_in_thread": 0, "title": "Migrant crisis in Germany likely means hassles for tourists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Germany: The ongoing migrant crisis in Europe may affect border crossings along with rail and/or bus transportation, particularly along the border with Austria. Some borders may be temporarily closed or have unexpected border checks, and rail travel may be stopped or delayed with little or no warning as migrants flow into the country. Travelers should follow local media for updates on closures and delays and have appropriate identification and travel documents available at security points.\nIndonesia: The government declared a state of emergency in Riau province, where smoke and haze from forest fires have led to hazardous air pollution for several weeks. Schools in and near Kuala Lumpur, Malaysia, have been closed because of the poor air quality, and Singaporeans were advised to minimize outdoor activity. The fires are blamed on paper and palm oil companies using slash and burn practices on the islands of Sumatra and Borneo. Tourists should check air pollution levels if visiting the region and use mask filters for added protection against pollutants.\nJapan: Tourists are advised to stay away from the popular Mount Aso on the southern island of Kyushu, as the active volcano began erupting Sept. 14. At least 18 domestic flights were canceled and several others diverted while Mount Aso shot ash more than 6,500 feet into the air. Further eruptions are possible, and authorities warned that the volcano could shoot rocks as far as half a mile from the mountain.\nMaldives: Authorities announced that the threat of attacks against wealthy Western tourists has become a concern in the popular Indian Ocean destination, as radical groups associated with the Islamic State and al-Qaeda continue to grow in numbers, especially in the capital of Male. Travelers should have a personal security plan in place and be aware of surroundings at all times.\nSingapore: More than 18,000 cases of hand, foot and mouth disease have been reported so far in 2015. Although most people recover from the virus within seven to 10 days, symptoms can cause severe discomfort, including fever, painful blisterlike sores in the mouth and rashes. There is no vaccine to prevent HFMD, but travelers can reduce the risk of infection by practicing good hygiene and avoiding close contact (kissing, sharing utensils, etc.) with those who are sick.\nCompiled from news services and travel sources. For updates, check with the State Department at 888-407-4747, www.travel.state.gov .\nLarry Habegger and Dani Burlison are freelance reporters.\n Europe Asia Travel Public Transportation", "external_links": ["http://www.trbimg.com/img-55f9e14b/turbine/ct-trav-0916-world-watch-20150916"], "published": "2015-09-17T00:38:00.000+03:00", "crawled": "2015-10-02T09:00:47.676+03:00", "highlightTitle": ""}