{"organizations": [], "uuid": "3ca2b31333bf276ea4b2d413d9e5e6c5b3905736", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytelegraph.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/bc700b948062e36608e8cef3891de965", "site_section": "http://www.dailytelegraph.com.au/travel/travel-news", "section_title": "Travel News | Australian Holiday News and Travel News | dailytelegraph.com.au", "url": "http://www.dailytelegraph.com.au/travel/in-flight-wi-fi-access-on-australian-airlines-opposed-by-business-travellers-who-want-downtime/story-fni0b4w1-1227540893623", "country": "US", "title": "In-flight Wi-Fi access on Australian airlines opposed by business travellers", "performance_score": 0, "site": "dailytelegraph.com.au", "participants_count": 1, "title_full": "In-flight Wi-Fi access on Australian airlines opposed by business travellers | DailyTelegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T20:00:00.000+03:00", "replies_count": 0, "uuid": "3ca2b31333bf276ea4b2d413d9e5e6c5b3905736"}, "author": "Robyn Ironside", "url": "http://www.dailytelegraph.com.au/travel/in-flight-wi-fi-access-on-australian-airlines-opposed-by-business-travellers-who-want-downtime/story-fni0b4w1-1227540893623", "ord_in_thread": 0, "title": "In-flight Wi-Fi access on Australian airlines opposed by business travellers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTRALIAN airlines are under pressure not to install in-flight Wi-Fi from the sector that would appear to have the most to gain from the move.\nBusiness travellers are shamelessly opposing in-flight connectivity because it would rob them of valuable “downtime”.\nResearch undertaken by Corporate Travel Management (CTM) found business people typically travel with two mobile devices but 64 per cent use them for entertainment rather than work purposes (25 per cent).\nCTM Chief Marketing and Technology Officer Tom Clark said the survey supported previous feedback that business people used flights as one of their few opportunities to “unplug”.\nConstantly connected ... Rafe Berding is grateful for downtime, but would still fly with an airline that had in-flight Wi-Fi. Picture: Darren England Frequent flyer Rafe Berding said he relished the time to de-stress when “the cabin door closed”.\n“Many execs enjoy the fact they have uninterrupted time in the air, to relax or to mentally prepare for a meeting,” said Mr Berding, the Marketing and Communications exeuctive for GlobalX.\n “We work in the taxi on the way to the airport and in the lounge, so when the cabin door closes it’s a relief to switch off and listen to some music or watch a movie.”\nBut he admitted that if an Australian airline adopted in-flight Wi-Fi, he would choose to fly with it ahead of a carrier that did not have such a service.\n“Australia is a very large country and clients expect you to be available regardless of altitude,” Mr Berding said.\nNumerous airlines operating out of Australia now offer in-flight Wi-Fi including Emirates, Etihad, Singapore Airlines, Air Canada, United, American Airlines, Delta Airlines, AirAsia and Garuda Indonesia.\nDowntime ... Most business travellers relish the time to decompress flying provides. Picture: Thinkstock But Qantas and Virgin Australia have so far resisted, although they remain committed to exploring the concept .\nA Qantas spokesman said they were looking at options new satellite platforms could create, particularly on domestic flights.\n“We’re also talking with other partners to explore emerging alternative technologies,” he said.\n“No firm timeline has been set, but it’s something we’re very keen to do as soon as it becomes commercially practical, which has been the barrier before now.”\nHe acknowledged the resistance from business customers.\n“They have told us they view aircraft as a bit of a sanctuary, so we’ll have to be mindful of this in terms of how we implement it,” the spokesman said.\nWi-Fi trends... Staying connected in the air seems set to become a reality for Australian travellers. Picture: Thinkstock Virgin Australia was also working with “leading technology providers to develop a solution that best suits the needs of passengers”.\n“We’ll provide more information when it becomes available,” said an airline spokesman.\n“Our guests currently have access to our state-of-the-art wireless in-flight entertainment system, providing access to hundreds of hours of movies, TV shows and music directly to our guests’ own devices.”\nOriginally published as The unlikely travellers put off by Wi-Fi", "external_links": ["http://cdn.newsapi.com.au/image/v1/fee315e905f3554065037de0501942bf?width=650", "http://cdn.newsapi.com.au/image/v1/77d9b6f3df2e4881f21565fe26186639", "http://cdn.newsapi.com.au/image/v1/4b9458384c1b39ce1dc00c1b392718ad", "http://cdn.newsapi.com.au/image/v1/9ad1be769b5eb94b37cc926dc2f58c42", "http://cdn.newsapi.com.au/image/v1/dc7a58158ef06303c3bbed972721916b", "http://pixel.tcog.cp1.news.com.au/track/news/content/v1/?category=/section/dailytelegraph.com.au/collection/popular-content/all/24hours/&t_product=most-popular-mobile&td_standfirst=false&td_kicker=false&td_byline=false&td_resultSize=6&maxRelated=20&display:footer=true&origin=omniture&t_template=s3/chronicle-component/otherstories/templates/index&domain=dailytelegraph.com.au", "http://www.news.com.au/travel/in-flight-wi-fi-access-on-australian-airlines-opposed-by-business-travellers-who-want-downtime/story-e6frfq7r-1227540893623?sv=a93f2d8dc81714a27b59bcdaa655e578", "http://cdn.newsapi.com.au/image/v1/aa10fc681898d8504b35fcaabe0bcdeb?width=650", "http://cdn.newsapi.com.au/image/v1/fb509cbd13e5ff9c1c96fa2553068811", "http://cdn.newsapi.com.au/image/v1/1c99bb1f2999ff8678647339409be444", "http://cdn.newsapi.com.au/image/v1/30ad13949d55bfbb84c2fc51bbab759c?width=650"], "published": "2015-09-23T20:00:00.000+03:00", "crawled": "2015-10-08T22:04:30.024+03:00", "highlightTitle": ""}