{"organizations": [], "uuid": "1605b19cdaef22f13f1c88736c5ce20f16c71b0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postandcourier.com", "main_image": "http://www.postandcourier.com/storyimage/CP/20151018/PC1201/151019425/AR/0/AR-151019425.jpg", "site_section": "http://www.postandcourier.com/apps/pbcs.dll/section?Category=PC1201&template=rss", "section_title": "Arts and Travel", "url": "http://www.postandcourier.com/article/20151018/PC1201/151019425/1003&ampsource=RSS", "country": "US", "title": "Italian film festival at Sottile Theatre to present slew of features, filmmakers, actors", "performance_score": 0, "site": "postandcourier.com", "participants_count": 0, "title_full": "Italian film festival at Sottile Theatre to present slew of features, filmmakers, actors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T19:00:00.000+03:00", "replies_count": 0, "uuid": "1605b19cdaef22f13f1c88736c5ce20f16c71b0e"}, "author": "", "url": "http://www.postandcourier.com/article/20151018/PC1201/151019425/1003&ampsource=RSS", "ord_in_thread": 0, "title": "Italian film festival at Sottile Theatre to present slew of features, filmmakers, actors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Italian film festival at Sottile Theatre to present slew of features, filmmakers, actors \nBy Sybil Fix \nSpecial to The Post and Courier Oct 18 2015 11:00 am A scene from \"Black Souls\" by director Fabrizio Ferracane. (Photo provided by Vitagraph Films) × Bearing hilarity and grief, family and conviviality, a raw bite of Mafia and a good dose of meaningful existential pondering, the 9th Nuovo Cinema Italiano Film Festival opens at the College of Charleston next week with a well-balanced mix of the fun and the heavy. \nIf you go \nWHAT: Nuovo Cinema Italiano Film Festival \nWHEN: Thursday-Oct. 25 \nWHERE: Sottile Theatre, 44 George St. \nCOST: Individual tickets $6 at the box office; memberships available, starting at $40 (includes access to all screenings) \nMORE INFO: www.nuovocinemaitaliano.com. Check the website for a full schedule of screenings and movie synopses, and for information about Q&As, lectures and other special events. \nWHAT: “Guardando con Michelangelo Antonioni” (“Looking with Michelangelo Antonioni”) a photography exhibit by Renato Zacchia presented by Nuovo Cinema Italiano Film Festival \nWHEN: Monday-Nov. 8; opening reception 6-8 p.m. Tuesday \nWHERE: The Vendue Boutique Art Hotel, 19 Vendue Range \nCOST: Free \nMORE INFO: www.nuovocinemaitaliano.com/antonioni-exhibition. Zacchia will attend the exhibit opening on Tuesday. Among the feature films are “Il Nome del Figlio” (“An Italian Name”), a comedy from acclaimed director Francesca Archibugi; “Vergine Giurata” (“Sworn Virgin”), a Tribeca Film Festival Nora Ephron Prize winner about sexual identity; and “My Italian Secret: The Forgotten Heroes,” a documentary by award-winning American filmmaker Oren Jacoby, about unsung resourceful Italians who helped save the lives of thousands of Italian Jews during World War II. Six among the actors and directors of the films, including Jacoby and Archibugi, will be present for Q&As after the screenings. This year’s lineup captures recurring themes of contemporary Italian life and culture, with a full palette of ingenious, ebullient characters acting against the backdrop of a typical and oft-pervasive socio-economic malaise. In quintessential Italian style, the movies feature big dips into life’s gritty moral dilemmas and soulful explorations of friendship, family and place, all infused with love. The four-day festival is a mix of red carpet spectacle, after-parties and academic lectures — an anomaly of sorts, says Giovanna De Luca, the Neapolitan transplant and College of Charleston professor who founded it. For students of Italian language and film, the festival is required fare. For the broader public, the festival is a unique opportunity to see the most acclaimed recent Italian movies, which often convey the particular bittersweet flavor of Italian life — joyful but always conscious of something lost. While certain cultural aspects all’italiana might be lost in translation, it is, as De Luca says, “an opening, an enticement.” “Maybe you will come and you will want to dig deeper,” she said. Opening Night on Thursday, features a 7:15 p.m. screening of “Noi e la Giulia” (“Giulia and Us”) by director Edoardo Leo, a comedy about three disenchanted guys who, trying to escape professional failures in a troubled economy, attempt to start a farm-cum-B&B. Friday starts with the 12:15 p.m. showing of “Leopardi” by director Mario Martone, a dramatic biopic of beloved 19th-century Italian romantic poet Giacomo Leopardi, whose writings are a staple in the schooling of all Italians. The screening is followed by a talk by Fairfield University’s Mary Ann Carolan, professor of modern languages and literature. Among the other screenings on Friday is “Perez,” the new film from “Mozzarella Stories” director Edoardo de Angelis (who attended the festival in 2012). It tells the story of a small-time bourgeois lawyer (Luca Zingaretti) forced to action when his daughter falls in love with a member of the camorra (Marco D’Amore of “Gomorra”). Actress Simona Tabasco will attend the screening. “Il Nome del Figlio,” featuring Alessandro Gassman, spotlights an eclectic group of lifelong, now middle-aged, friends — among them a couple about to have a baby. The revelation at a dinner party of the child’s proposed name provokes a reexamination of the group’s friendships. A Q&A with Archibugi, the director, follows the screening. Saturday includes four screenings, the last being “Fino a Qui Tutto Bene” (“So Far So Good”) by Roan Johnson, it is a comedic look at five viscerally bonded university roommates about to graduate and part ways, leaving behind the best times of their lives and facing an uncertain future. Actors Paolo Cioni and Guglielmo Favilla will entertain a Q&A after the screening. On Sunday, the comedy “Se Dio Vuole” (“If God Wants It”) is followed by “My Italian Secret,” director Jacoby’s tribute to resourceful, courageous Italians who helped save the lives of persecuted Jews during the war. Among the risk-takers was Italian cyclist and sports hero Gino Bartali who ferried fake documents for Jews in the frame of his bike. Jacoby will speak after the screening. Closing the festival is “Latin Lover,” a comedy directed by Cristina Comencini. In this tribute to Italian cinema, a group of women gather in a villa to reminisce about a man, a famous actor, who had been lover to some of them and relative to others. Related Content Enlarge Director Cristina Comencini (right) on the set of “Latin Lover,” her most recent feature film. Provided/RAI \nDirector Cristina Comencini (right) on the set of “Latin Lover,” her most recent feature film. × Enlarge A scene from \"The Giulia and Us\" by director Edoardo Leo. (Photo provided by Intramovies) \nA scene from \"The Giulia and Us\" by director Edoardo Leo. (Photo provided by Intramovies) × Enlarge A scene for “Latin Lover” (2015) by Cristina Comencini. Provided/RAI \nA scene for “Latin Lover” (2015) by Cristina Comencini. × Enlarge Francesco Scianna (center) starts in “Latin Lover.” Provided \nFrancesco Scianna (center) starts in “Latin Lover.” ×", "external_links": [], "published": "2015-10-18T19:00:00.000+03:00", "crawled": "2015-10-18T18:53:22.580+03:00", "highlightTitle": ""}