{"organizations": [], "uuid": "4800a2991b811bdccf4650532fee147995bf08e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Photo-1-UAE-National-Day-at-Expo-Milan.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-celebrates-uae-national-day-with-gems-education-students-at-expo-milano-2015/", "country": "US", "title": "Etihad Airways Celebrates UAE National Day With Gems Education Students at Expo Milano 2015Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Etihad Airways Celebrates UAE National Day With Gems Education Students at Expo Milano 2015Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "4800a2991b811bdccf4650532fee147995bf08e5"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-celebrates-uae-national-day-with-gems-education-students-at-expo-milano-2015/", "ord_in_thread": 0, "title": "Etihad Airways Celebrates UAE National Day With Gems Education Students at Expo Milano 2015Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etihad Airways Celebrates UAE National Day With Gems Education Students at Expo Milano 2015\nEtihad Airways, the national airline of the UAE, today celebrated the 44 th UAE National Day at Expo Milano 2015, sharing cultural, culinary and sustainability experiences with more than 20 students from GEMS Education schools in Abu Dhabi and Dubai.\nThe celebration coincides with the day the UAE received the ‘Official Host’ status for the World Expo2020 at a handover ceremony in Milan.\nStudents, aged 14 to 17 and predominantly Emiratis, toured the Etihad Airways – Alitalia joint Expo pavilion, the UAE pavilion, and were treated to a range of interactive and entertaining activities.\nItaly’s youngest Michelin-starred chef Lorenzo Cogo and Etihad Airways Inflight Chefs hosted a live cooking session under the theme Preparing the Future Chefs. Emirati cuisine and the origin of various traditional ingredients were highlighted to instill pride in the national heritage among students while also highlighting the importance of learning from different cultures.\nThe students also had the opportunity to interact with Etihad Airways staff and senior representatives, asking questions and learning about the airline, its products and sustainability initiatives.\nHareb Al Muhairi, Etihad Airways’ Senior Vice President Corporate and International Affairs, said: “We are delighted to celebrate the momentous occasion of UAE National Day at Expo Milano with young students from Abu Dhabi and Dubai.\n“Young people are the nation’s hope for tomorrow and the catalysts for real progress and innovation. Offering them the opportunity to learn and explore at a global event such as the Expo is part of our commitment to youth education and future success.”\nDino Varkey, Group Executive Director and Board Member, GEMS Education, said: “The various activities hosted by Etihad Airways at Expo Milano 2015 for GEMS students are examples of real-world learning which will add a new dimension to our student enrichment. Such authentic opportunities have a great potential to impact the future careers and accomplishments of the young people involved. They are our future and developing an understanding of Expo’s importance is truly connecting minds, and creating the future which is the theme of the Expo 2020 Dubai.”\nNada Sultan Darwish, one of the students on the Expo Milano visit, said: “I am very proud to represent the United Arab Emirates at Expo Milano. The UAE presentation was true to our history and made a positive impression of the progress of our country today. I am even more excited about our own Expo2020 and can see now how it will impact the economy and further raise the profile of the UAE.”\nAlso today, and in line with the Expo Milano 2015 theme Feeding the Planet, Energy for Life , Etihad Airways hosted a sustainability event for more than 90 GEMS Education students at the airline’s Training Academy in Abu Dhabi.\nThe event featured interactive presentations by Andrew Ward, Etihad Airways Vice President Marketing; Wissam Hachem, Etihad Airways Vice President Learning and Development; Linden Coppell, Etihad Airways Head of Sustainability; Nicolas Cary Brown, Sustainability Manager at Masdar; and Shaikha Al Kaabi, founder of Meylas, an Emirati restaurant. In addition, students attended a live cooking demonstration by Etihad Airways Corporate Executive Chef Thomas Ulherr, and sampled sweet treats from a Meylas mobile food truck.\nMore than 284,000 guests have visited the joint Etihad Airways Alitalia Pavilion at Expo Milano 2015 in the past six months.\nSource:- Etihad Airways", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T18:42:53.670+02:00", "highlightTitle": ""}