{"organizations": [], "uuid": "a73ace0cc5706add0516c2f012526066ac8905be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/wyndham-worldwide.png", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rci-welcomes-calypso-cay-resorts-to-affiliate-network/", "country": "US", "title": "RCI Welcomes Calypso Cay Resorts to Affiliate NetworkTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "RCI Welcomes Calypso Cay Resorts to Affiliate NetworkTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "a73ace0cc5706add0516c2f012526066ac8905be"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rci-welcomes-calypso-cay-resorts-to-affiliate-network/", "ord_in_thread": 0, "title": "RCI Welcomes Calypso Cay Resorts to Affiliate NetworkTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RCI Welcomes Calypso Cay Resorts to Affiliate Network Published on : Saturday, October 17, 2015\nRCI, the worldwide leader in vacation exchange and part of the Wyndham Worldwide family of brands, recently signed an affiliation agreement to add Calypso Cay Vacation Villas at Calypso Cay Resorts to its network of approximately 4,500 affiliated resorts. Located in Kissimmee, Florida, the Caribbean-themed property is fashioned as a “personal tropical island getaway.”\n“We’re delighted to welcome Calypso Cay Vacation Villas to our vacation exchange program,” said Gordon Gurnik, president of RCI. “This beautiful property, which further expands RCI® subscribing members’ high-quality accommodation choices in central Florida, can be an excellent option for travelers looking to escape from the hustle and bustle of the real world, while also being minutes away from some of Florida’s most well-known attractions.”\nGuests staying at the Calypso Cay Vacation Villas have access to spacious and luxurious one-, two- and three-bedroom suites. For those traveling in larger groups, many of these villas can be linked to other one- or two-bedroom villas to allow for greater space and comfort. All accommodations feature large dining areas, full kitchens, entertainment centers and comfortably furnished living rooms ideal for relaxing after a long day of play.\nCalypso Cay Vacation Villas feature many renovations designed to maximize guests’ fun, including a new pool deck and full-service pool bar, a sports court and a beach volleyball court. Adding to the resort’s tropical atmosphere is a beautiful picnic area with a patio, gas grills, colorful vegetation, background music and plenty of shade and seating areas to stretch out and relax.\nA lushly-landscaped 18-hole miniature golf course, as well as a daily schedule of resort activities and events, can keep visitors active and happy. Located just seven miles away from popular local theme parks, guests can opt to make the short drive to their choice of exciting nearby attractions, and then return home to the peace and calm of their private villas.\n“We’re thrilled to join RCI’s vacation exchange network,” said Steve Bradley, managing director of Calypso Cay Resorts. “Helping ensure that our club members receive the quality vacations they deserve is at the heart of everything we do. We’re excited that RCI shares that same mission and drive to deliver fantastic, flexible and memorable vacation options, and we look forward to continuing our partnership well into the future.”\nSource:- Wyndham worldwide", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T07:55:39.895+03:00", "highlightTitle": ""}