{"organizations": [], "uuid": "b475c6c6537476e60ce009ef51b622e2b98f2062", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/African-Diaspora-Festival-1.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/10/23/afro-caribbean-cultural-festival-kicks-off", "country": "US", "title": "Afro-Caribbean cultural festival kicks off at Lincoln PlazaThe", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Afro-Caribbean cultural festival kicks off at Lincoln PlazaThe Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:20:00.000+03:00", "replies_count": 0, "uuid": "b475c6c6537476e60ce009ef51b622e2b98f2062"}, "author": "Elizabeth Lang", "url": "http://www.ticotimes.net/2015/10/23/afro-caribbean-cultural-festival-kicks-off", "ord_in_thread": 0, "title": "Afro-Caribbean cultural festival kicks off at Lincoln PlazaThe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Thursday, the XVII Festival of Flowers of the African Diaspora and Other Cultures kicked off at Lincoln Plaza with the presence of President Luis Guillermo Solís, CECC/SICA secretary general Carlos Lépiz, Afro-Costa Rican writer Quince Duncan and Chinese Ambassador Song Yanbin.\nThe national band Master Key delighted the audience with three a cappella songs, including their original “Happy Days.”\nAfterwards, organizers presented a video about the country’s Afro-Costa Rican culture.\nAfro-Costa Rican writer Quince Duncan spoke about his experience of living in a multicultural and multiethnic environment as a citizen of Costa Rica. “Beyond tolerance we have to acquire respect. We have to go through the path of comprehension; comprehend and understand each other,” Duncan said.\nMaster Key performs at the inauguration of the 2015 African Diasphora Festival.\nAlberto Font/The Tico Times\nChinese Ambassador Song Yanbin spoke of the importance of a multicultural and multiethnic Costa Rica. He mentioned that the Popular Republic of China has 56 different ethnicities and 55 of those ethnicities are minorities that have their own language.\nFestival organizer Carol Britton gave an honorary mention to former congresswoman Joycelyn Sawyers Royal, who first proposed a law declaring Costa Rica multicultural and multiethnic in 1998. Sawyers’ sister, Mavis Sawyers Royal, was there to receive the honorary mention.\nCosta Rican composer Manuel Monestel performed afterwards, playing a set of Calypso songs.\nPresident Luis Guillermo Solís noted the importance of the recent change to the country’s constitution declaring Costa Rica multicultural and multiethnic.\n“The country is on a path of unity and diversity,” Solís said.\nThe President also inaugurated a photo exhibit celebrating Costa Rica’s diversity as part of the festival.\nThe festival runs through Sunday. The schedule of events is available on the festival’s website .\nSinger Manuel Monestel performs at the inauguration of the 2015 African Diasphora Festival.\nAlberto Font/The Tico Times\nContact Elizabeth Lang at elang@ticotimes.net", "external_links": ["https://festivalfda.wordpress.com/"], "published": "2015-10-23T17:20:00.000+03:00", "crawled": "2015-10-23T18:09:14.154+03:00", "highlightTitle": ""}