{"organizations": [], "uuid": "674819e4c97da05cd3b8ff58569511e6ae6f233f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03472/BBC_SPLASH_3472407a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-15.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/promotions/11930680/bbc-good-food-shows.html", "country": "US", "title": "Save 15% on tickets to the BBC Good Food Shows", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Save 15% on tickets to the BBC Good Food Shows - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T21:05:00.000+03:00", "replies_count": 0, "uuid": "674819e4c97da05cd3b8ff58569511e6ae6f233f"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/promotions/11930680/bbc-good-food-shows.html", "ord_in_thread": 0, "title": "Save 15% on tickets to the BBC Good Food Shows", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Telegraph readers can save 15% on tickets to the BBC Good Food Show London, and the BBC Good Food Show Winter. During a visit to a BBC Good Food Show you will experience delicious food, great entertainment, and a celebrity guest list of the best chefs in the business. Discover a wide range of food, drink, appliances and gadgets, as well as a selection of local delicacies from independent and artisan producers who bring a regional flavour to each Show. BBC Good Food Show London Discover pop up restaurant experiences, sample top quality food and drink, and be inspired by world class chefs as the capital’s biggest food event comes to Olympia London from November 13-15. See live cooking demonstrations from James Martin, Mary Berry, Michel Roux Jr. and more, as well as hundreds of stands to browse and free entry to the Bakes & Cakes Show included with every ticket. BBC Good Food Show Winter The BBC Good Food Show Winter at the NEC Birmingham from November 26-29, is all about those warming flavours and tasty treats that make winter every foodie’s favourite time of year. A day at the Show is the best way to be inspired for a delicious festive season ahead, whether it’s by watching Paul and Mary create their ultimate festive treats live on stage or seeing the Hairy Bikers, Tom Kerridge or Michel Roux Jr. Plus you can stock up on all the treats and tipples you’ll need to see you through the winter. How to claim To save 15%* on tickets BBC Good Food Show London and the BBC Good Food Show Winter, click here and Quote: PAR15 when booking online or call the Box Office on 0844 581 1361. Terms and conditions *15% off valid on advance Adult and Over 65s tickets only (excluding VIP) to the BBC Good Food Show London or the BBC Good Food Show Winter only. Offer ends midnight Sunday, Novemebr 15, 2015 for London and Sunday, November 29, 2015 for Winter. Standard Supertheatre seat included with all advance Super tickets subject to availability. Upgrade to a Gold seat for £3 extra. 15% discount also available on Value tickets, which exclude Supertheatre, entry from 11am only. BBC Good Food Bakes & Cakes Show runs alongside BBC Good Food Show London and tickets include entry to both shows, subject to capacity. Prices include all transactional and admin fees. Not valid with any other offer. Not all celebrities appear on all days, check website for details. telegraph.co.uk", "external_links": [], "published": "2015-10-15T21:05:00.000+03:00", "crawled": "2015-10-15T16:54:57.635+03:00", "highlightTitle": ""}