{"organizations": ["Starbucks", "RCI", "Royal Caribbean", "Southampton", "Barcelona", "Marseille", "Southampton Royal Caribbean International", "Izumi Hibachi & Sushi"], "uuid": "8f7f4a40c3ea75a02c25dd8f45d68b5374fb95a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/135/590x/Rotterdam-cruise-612896.jpg", "site_section": "http://www.express.co.uk/posts/rss/132/travel", "section_title": "Daily Express :: Travel Feed", "url": "http://www.express.co.uk/travel/cruise/612896/cruise-news-RCIs-Harmony-seas", "country": "IE", "title": "RCIs Harmony of the seas", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "RCIs Harmony of the seas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:00:00.000+03:00", "replies_count": 0, "uuid": "8f7f4a40c3ea75a02c25dd8f45d68b5374fb95a3"}, "author": "", "url": "http://www.express.co.uk/travel/cruise/612896/cruise-news-RCIs-Harmony-seas", "ord_in_thread": 0, "title": "RCIs Harmony of the seas", "locations": ["GETTY Cherbourg", "Cherbourg", "UK & Ireland", "Southampton", "Amalfi Coast", "Civitavecchia", "Pompeii", "Italy", "France", "Livorno", "Rotterdam", "Naples", "Florence", "Majorca", "Pisa", "Rome"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steven Leven"], "text": "RCIs Harmony of the seas RCIs Harmony of the seas PUBLISHED: 00:00, Sun, Oct 18, 2015 | UPDATED: 18:00, Sun, Oct 18, 2015 GWTTY Rotterdam is the first destination on the cruise that leaves from Southampton Royal Caribbean International will offer British cruise fans a chance to sample its new ship Harmony Of The Seas before it sails from Southampton to its summer 2016 homeport Barcelona next June. The two short round-trips from Southampton will take passengers to Rotterdam in the Netherlands from May 22 to 26 and to Cherbourg in France from May 26 to 29. Harmony of the Seas will feature RCI's Oasis-class design, with the emphasis on family entertainment. GETTY Cherbourg is the second destination on the cruise Top of the bill is The Perfect Storm: three multi-storey water slides that will twist and turn over the heads of passengers sunbathing in Central Park, plus the Ultimate Abyss slide - a 10-deck drop water slide. Among the Royal Promenade's exciting mix of bars and restaurants will be the quirky Bionic Bar, with a robot bartender serving cocktails to order. And the Boardwalk neighbourhood will have a traditional carousel ride plus a new games arcade. GETTY Surfs up: the cruise had a flowrider on board A new children's climbing play area will be overlooked by a relocated Starbucks, so parents can keep an eye on youngsters over a coffee. And there will be an ice rink, rock climbing, FlowRider surf pool, zipline, RCI's biggest splash part yet and of course a huge gym and several pools. There will be the first children's theatre at sea where they can learn about theatrical productions and take part in talent shows or classes, plus an Adventure Science Lab for children to take part in supervised but fun-to-do science. Related articles Two new ships for river cruise specialist Emerald Waterways The Adventure Art studio will give children the chance to explore the world of colour, and the Workshop space is for families to create jewellery and scrapbooks. There will be children's clubs for all ages from babies to teenagers, and adult-only spaces such as the three-deck landscaped solarium with whirpools and loungers. The ship will have even more restaurants than previous new launches, such as the new Izumi Hibachi & Sushi restaurant. GETTY The cruise will leave from Southampton A new two-storey Wonderland, which specialises in unusually presented offerings and beyond-the-norm tastes, will be able to cater for more guests than on other ships and the Sabor Modern Mexican restaurant will have a new teppanyaki menu. Steven Leven, RCI's managing director, UK & Ireland, says: \"Harmony Of The Seas is a truly remarkable ship, featuring a world of adventure for any holidaymaker. \"We are thrilled to offer these additional voyages, to allow Royal Caribbean passengers the chance to experience everything that Harmony Of The Seas has to offer from Southampton.\" The ship will spend summer 2016 mostly on seven-night Western Mediterranean cruises, calling at ports such as Majorca's capital - Palma - and Marseille in the south of France as well as Italy's Livorno - for excursions to Pisa and Florence - Civitavecchia for trips to Rome, and Naples for excursions to Pompeii and the Amalfi Coast, before returning to Barcelona. For more information and details of special offers go to www.royalcaribbean.co.uk Related articles", "external_links": [], "published": "2015-10-18T02:00:00.000+03:00", "crawled": "2015-10-19T02:15:04.932+03:00", "highlightTitle": ""}