{"organizations": [], "uuid": "a031a3699eeba3da6ea9d3f644664e2491c8e95b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151005GenJohnCampbell.jpg", "site_section": "http://www.ticotimes.net/categories/global-conflict", "section_title": "Global conflict Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/06/us-military-struggles-to-explain-how-it-wound-up-bombing-a-hospital-in-afghanistan", "country": "US", "title": "US military struggles to explain how it bombed a Doctors Without Borders hospitalThe", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "US military struggles to explain how it bombed a Doctors Without Borders hospitalThe Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:30:00.000+03:00", "replies_count": 0, "uuid": "a031a3699eeba3da6ea9d3f644664e2491c8e95b"}, "author": "Thomas Gibbons-Neff | The Washington Post", "url": "http://www.ticotimes.net/2015/10/06/us-military-struggles-to-explain-how-it-wound-up-bombing-a-hospital-in-afghanistan", "ord_in_thread": 0, "title": "US military struggles to explain how it bombed a Doctors Without Borders hospitalThe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, D.C. – A heavily-armed U.S. gunship designed to provide added firepower to special operations forces was responsible for shooting and killing 22 people at a Doctors Without Borders hospital in Kunduz, Afghanistan over the weekend, Pentagon officials said on Monday.\nThe attack occurred in the middle of the night on Saturday, when Afghan troops-together with a U.S. special forces team training and advising them-were on the ground near the hospital in Kunduz, the first major Afghan city to fall to the Taliban since the war began in 2001. The top U.S. general in Afghanistan said on Monday the airstrike was requested by Afghan troops who had come under fire, contradicting earlier statements from Pentagon officials that the strike was ordered to protect U.S. forces on the ground.\nThe new details of the attack, and the continuing dispute over what exactly happened, heightened the controversy over the strike. In the two days since the incident, U.S. officials have struggled to explain how a U.S. aircraft wound up attacking a hospital run by Doctors Without Borders . On Monday, the medical humanitarian group said the United States was squarely responsible.\n“The reality is the U.S. dropped those bombs,” Doctors Without Borders’ general director Christopher Stokes said in a statement. “With such constant discrepancies in the U.S. and Afghan accounts of what happened, the need for a full transparent independent investigation is ever more critical.”\nIn this undated photo released by Medecins Sans Frontieres (MSF) on Oct. 3, 2015, Afghan MSF medical personnel treat civilians injured following an offensive against Taliban militants by Afghan and coalition forces at the MSF hospital in Kunduz.\nAFP/MSF\nThe weekend’s disastrous airstrike reinforces doubts about how effectively a limited U.S. force in Afghanistan can work with Afghan troops to repel the Taliban, which has been newly emboldened as the United States draws down its presence.\nThe strike also comes as the Obama administration is currently weighing whether to keep as many as 5,000 U.S. troops in Afghanistan beyond 2015, according to senior officials. Obama has not made a final decision on the proposal, but the recent advances by the Taliban have certainly complicated the president’s calculus.\nArmy Gen. John Campbell, the top U.S. general in Afghanistan, told reporters on Monday at a press conference that Afghan forces “advised that they were taking fire from enemy positions and asked for air support from U.S. forces.” Campbell made it clear that this differed from initial reports that said U.S. forces were under attack and called in the airstrikes for their defense.\nCampbell’s remarks differed from two previous comments, including one made by Secretary of Defense Ashton Carter on Sunday that said U.S. forces were under attack.\n“At some point in the course of the events there (they) did report that they, themselves, were coming under attack. That much I think we can safely say,” Carter told reporters Sunday.\nAbdul Qahar Aram, spokesman for Afghan army’s 209th Corps in northern Afghanistan, said he could not comment on the specifics of Saturday’s hospital bombing. But Aram said there was a “strong possibility” that Afghan forces had requested it.\nA spokesman for Afghan President Ashraf Ghani had no immediate comment to Campbell’s comment.\nOne aspect of the strike that remained unclear on Monday was the exact role played by U.S. forces accompanying the Afghans that night.\nAfter Kunduz became overrun with Taliban fighters late last month, American special operations forces were ferried in to shore up Afghan forces that were making little ground in the fight to retake the populated city-center. Together, the U.S. and Afghan forces have been able to retake nearly all of the city.\nThese “train, advise and assist” missions are a staple of U.S. special forces capabilities and have been conducted extensively in recent years. In combat situations, rather than return fire, U.S. troops on these missions are more likely to help direct communication, casualty evacuation and direct air support from an AC-130, for instance, if it’s available.\nAs a result, there has been little direct contact between U.S. troops and the Taliban since most U.S. forces have been relegated to the sidelines with official combat operations over last year.\nThe aircraft that carried out the weekend attack was an AC-130 gunship, according to Campbell. Unlike jets, the AC-130 is a unique aircraft dedicated almost entirely to supporting special operations forces.\nIn order to make sure targeting and communication from the ground to the aircraft is as seamless as possible, every AC-130 flies with a liaison officer that has spent time as a special forces soldier on the ground.\nWhile most jets streak across a target, moving quickly while dropping either bombs or firing fixed weapons like cannons or machine guns, the AC-130 essentially loiters over a target at around 7,000 feet. It then flies overhead in a circle and fires from weapon ports mounted on the aircraft’s left side.\nUnlike other military fixed-wing aircraft, an AC-130 is requested differently. While a jet requires a map coordinate to engage its target, the AC-130 relies on direction (a compass heading) and a distance to the enemy target from the friendly forces engaged on the ground. In short, it relies on visual targeting.\nThis difference might explain why the hospital was targeted even though Doctors Without Borders said it had given U.S. and Afghan forces its map coordinates before.\n“It’s a visual acuity aircraft,” said a U.S. close-air support pilot who spoke on the condition of anonymity because of his active duty status. “An AC-130 finds the friendly force then fires over their left or right shoulder.”\nThe pilot went on to add that an AC-130 does not enter enemy airspace and look for targets. It specifically has to be guided on to the target by a force on the ground and will fire only after identifying friendly and enemy forces, he said.\nA file photo of the U.S. Air Force’s AC-130 gunship.\nU.S. Air Force/AFP\nThe aircraft, because of its large profile and the fact that it operates at low altitude, only flies close air support missions at night. Since it only works in the dark, the crew of roughly a dozen uses a number of infrared sensors and night vision devices to see and engage targets on the ground.\nAccording to Pentagon Spokeswoman Navy Cmdr. Elissa Smith, there have been 12 U.S. airstrikes around the city of Kunduz since Sep. 29. The airstrike on the Doctors without Borders hospital was the second strike within the city.\nIt now ranks among one of the most high-profile U.S. strikes to result in civilian casualties in Afghanistan. In July 2002, a U.S. AC-130 fired on a wedding party, killing more than 40 and injuring more than 100 people in northern Helmand Province.\nSince the attack on Saturday, Doctors Without Borders has left Kunduz.\nTim Craig contributed to this report from Kabul.\n© 2015, The Washington Post", "external_links": ["http://www.doctorswithoutborders.org/article/afghanistan-msf-demands-explanations-after-deadly-airstrikes-hit-hospital-kunduz"], "published": "2015-10-06T16:30:00.000+03:00", "crawled": "2015-10-06T12:32:43.782+03:00", "highlightTitle": ""}