{"organizations": ["AJIS", "Park24 Co.", "All Japan Internationalization Solutions", "Wireless Co."], "uuid": "7a8c69e0fb500d0618098c4f30b7e79d16ac11be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_5_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13308088/1/free-wifi-multilingual-information-platform-japan-finder-launched.html?cm_ven=RSSFeed", "country": "US", "title": "Free WiFi Multilingual Information Platform \"Japan Finder\" Launched", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Free WiFi Multilingual Information Platform \"Japan Finder\" Launched", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T08:00:00.000+03:00", "replies_count": 0, "uuid": "7a8c69e0fb500d0618098c4f30b7e79d16ac11be"}, "author": "", "url": "http://www.thestreet.com/story/13308088/1/free-wifi-multilingual-information-platform-japan-finder-launched.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Free WiFi Multilingual Information Platform \"Japan Finder\" Launched", "locations": ["TOKYO", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Free WiFi Multilingual Information Platform \"Japan Finder\" Launched By PR Newswire | 10/01/15 - 01:00 AM EDT Reprint TOKYO , Oct. 1, 2015 /PRNewswire/ -- All Japan Internationalization Solutions (AJIS) LLC launched on Oct. 1 a multilingual information platform \"Japan Finder\" ( http://www.japan-finder.jp/ ) that allows users to get quick access to travel, gourmet, food and products, entertainment, business and other attractive information about Japan . To heighten user-friendliness, the platform highlights free \"Travel Japan Wi-Fi\" connection in conjunction with Wire and Wireless Co., smartphone tour planner and navigation system, telephone three-party interpretation, coupon delivery and other useful tools. As its near-term plan to improve the site's functions, AJIS is set to develop cross-border online shop to sell \"Made in Japan \" goods, hotel reservation system and a blog community for foreign nationals living in Japan to communicate charms of Japan . It also plans to collaborate with local governments and companies to create and offer new tour packages. The platform is one of the two pillars of the AJIS project to help Japanese local authorities as well as companies to increase foreign customers and improve hospitality services. AJIS was established in July by Park24 Co., which offers rental car, parking and other services, and seven other companies. The other pillar involves telephone three-party interpretation, making foreign-language menus and other services to Japanese companies and local authorities to help them internationalize. PR solutions will also be offered, including \"push\" delivery of coupons and information, distribution of overseas press release, arrangement of foreign press tours, publication of free papers, to contribute to increasing foreign customers. Solutions to assist startup firms and other smaller companies enter foreign markets and promote overseas business will also be promoted. As its mission, AJIS aims at contributing to \"regional revitalization and development of startups and smaller companies,\" and assisting internationalization of local authorities and companies as well as smaller businesses. 1 of 2", "external_links": [], "published": "2015-10-01T08:00:00.000+03:00", "crawled": "2015-10-01T08:41:01.590+03:00", "highlightTitle": ""}