{"organizations": [], "uuid": "94710c80a0a6771ceef4dece9ff2f0d2b7c2ed2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03451/Walking_on_clouds_3451983k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-04.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/the-elevator/11888639/business-success-stories.html", "country": "US", "title": "Business success stories reveal moment of truth", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Business success stories reveal moment of truth - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:51:00.000+03:00", "replies_count": 0, "uuid": "94710c80a0a6771ceef4dece9ff2f0d2b7c2ed2d"}, "author": "Nick Martindale", "url": "http://www.telegraph.co.uk/sponsored/business/the-elevator/11888639/business-success-stories.html", "ord_in_thread": 0, "title": "Business success stories reveal moment of truth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Building a successful business is no easy task, as any entrepreneur will testify. Yet there’s often a moment when people suddenly realise their venture will work, whether that’s confirmation of a gap in the market or a lucrative deal that provides a financial boost. This was the case for Anna Mackenzie, co-founder of luxury muesli brand Cuckoo , when the fledgling business won an order from Selfridges. “It is all very well having what we believed to be a brilliant product, but the best validation is to have people buying the range,” she says. “The day we launched at Selfridges and saw Cuckoo on the shelves made it feel very real.” For Martin Hamilton, a former farmer who had set up comestibles business Mash Direct , it was a meeting with a distributor at a food exhibition that made him realise the potential of what he had started. “We were approached by a distributor from Dubai,” he says. “We were thrilled, but quite perplexed, when he told us that mashed potato was something that would sell well in the Middle East.” The best recognition any business can receive is when the competition is taking you seriously The buyer was right, and within a few months it was appearing in a high-end supermarket, selling under a distribution arrangement while Hamilton built up the brand in the UK. “In just three years the international side of the business now accounts for 16 per cent of total sales and, at current growth, will represent £1million in sales by 2018,” he says. Aaron Darke, 24, is the owner and founder of Zymurgorium , a Manchester-based meadery and brewery which supplies bars and customers throughout the UK. His defining moment was when he won £10,000 of funding through one of the UK’s largest entrepreneurial competitions,TestTown, just under a year ago. “I had already started my business and was making a small profit, but I just didn’t have the funding to help take the business to the next level,” he recalls. “Winning the top prize meant I was able to invest in marketing the business and in a website. I’m now supplying a much wider audience and have even had to move into larger premises. It really has been the making of the business.” Perhaps the best recognition any business can receive is when the competition is taking you seriously. It’s the sign of a job done well and, more often than not, a great indication that you should keep doing things your way. That was the case for Rune Sovndahl, founder of home-maintenance firm Fantastic Services . “The moment I knew we had really made an impact was when a very large competitor contacted me offering a role at their company, plus equity,” he says. “That showed me that we were seen as a real competitor by them.” You may also be interested in: • How to make a good first impression during a pitch » • How to network, influence people and win new business » • Five ways to unlock innovation in your business »", "external_links": [], "published": "2015-10-05T03:51:00.000+03:00", "crawled": "2015-10-04T23:34:10.192+03:00", "highlightTitle": ""}