{"organizations": [], "uuid": "eca135783ea6363ecf8a8d1ba843873ea50074e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-56256e90/turbine/sc-troubleshooter-travel-1020-20151020", "site_section": "http://www.sun-sentinel.com/travel/rss2.0.xml", "section_title": "Travel - Sun Sentinel", "url": "http://www.sun-sentinel.com/travel/sc-troubleshooter-travel-1020-20151020-column.html", "country": "US", "title": "Airbnb rental canceled 6 months in advance; owner tries to keep money", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Airbnb rental canceled 6 months in advance; owner tries to keep money", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T10:00:00.000+03:00", "replies_count": 0, "uuid": "eca135783ea6363ecf8a8d1ba843873ea50074e2"}, "author": "Christopher Elliott", "url": "http://www.sun-sentinel.com/travel/sc-troubleshooter-travel-1020-20151020-column.html", "ord_in_thread": 0, "title": "Airbnb rental canceled 6 months in advance; owner tries to keep money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Christopher Elliott The Travel Troubleshooter \nQ: I am writing to express my frustration and disappointment with Airbnb. My wife and I have been loyal Airbnb users, as well as highly reviewed guests, during stays in Milan; Portland, Oregon; and Santa Monica, California. \nWe recently booked a rental in Los Angeles. Six months before we were supposed to arrive, a friend was in the area of the home, and he called us to let us know that the house was a guesthouse located in the backyard of a primary residence and not in fact a stand-alone home, as advertised and described in the listing. \nThis in no way was indicated in any photographs, nor was the property described as being adjacent to another home. I prefer the privacy of our own space. I reviewed Airbnb's refund policy, believed that we would lose no money by canceling nearly half a year in advance and pressed a single button to cancel the reservation before booking another Airbnb property for the duration of our stay. \nWe've been debited $5,283 for our canceled stay. Airbnb's resolutions center hasn't been able to help us. I view Airbnb's refusal to provide us with a refund as an act of theft. Can you help us get our money back? \n— Kevin Calaba, Brooklyn, New York \nA: You should have received a home, as advertised. But what was advertised? You carefully reviewed the listing and found that indeed, buried deep within the property listing, was an \"oh-by-the-way\" mention that it was a guesthouse. To some — including, apparently, Airbnb — that was enough to close your case. But not for me. \nYou actually don't have as many rights as you'd think. Check out Airbnb's terms ( https://www.airbnb.com/terms ), which state that Airbnb doesn't control the content in a listing and that it's not responsible for it. I'm not impressed by that kind of language, and I'll bet most people booking a home through Airbnb have no idea that such fine print exists. Well, I guess they do now. \nYou followed your steps to resolution, filing a complaint through the Airbnb \"help\" section on its website. When that failed, you could have appealed your case to one of Airbnb's executives ( http://elliott.org/company-contacts/airbnb ). I list their contact information on my site. I'm not sure how far it would have gotten you. Airbnb was interpreting its own terms correctly, yet arriving at the wrong conclusion. I believe your host intentionally misled you and then pocketed your money six months in advance, even though it's likely the room would have been resold. That's just wrong. \nI contacted Airbnb, and it processed a full refund for your rental. \nChristopher Elliott is the ombudsman for National Geographic Traveler magazine and a co-founder of the Consumer Travel Alliance, a nonprofit organization that advocates for travelers. Because of a backlog of cases, your story may not be published for several months. Read more tips at elliott.org , or email chris@elliott.org .", "external_links": [], "published": "2015-10-18T10:00:00.000+03:00", "crawled": "2015-10-21T00:50:40.278+03:00", "highlightTitle": ""}