{"organizations": ["St. George", "Maasai Mara National Reserve", "Tilikum Crossing", "Cathedral Basilica of Saints Peter"], "uuid": "245e1dc52a60b92b426a992058f07a6ac2d94ac8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151002161317-15-travel-1002-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_travel.rss", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/10/14/travel/gallery/best-travel-photos/index.html?eref=rss_travel", "country": "US", "title": "Instant vacation: The best travel photos", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Instant vacation: The best travel photos", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:49:00.000+03:00", "replies_count": 0, "uuid": "245e1dc52a60b92b426a992058f07a6ac2d94ac8"}, "author": "", "url": "http://edition.cnn.com/2015/10/14/travel/gallery/best-travel-photos/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "Instant vacation: The best travel photos", "locations": ["Portugal", "Mara River", "Cuba", "Elbe River", "Tanzania", "Mandalay", "Indonesia", "Dhaka", "Baghdad", "Florida", "Herzeliya", "Iraq", "France", "Breda", "Serengeti", "Bangladesh", "Crimean Peninsula", "Myanmar", "Zeschdorf", "Portland", "La Sierra", "Miami Beach", "Lavaur", "Michigan", "Iceland", "Sasyk-Sivash Lake", "Chongqing", "United States", "Saudi Arabia", "Almaty Lake", "Spain", "Taungthaman Lake", "Israel", "London", "Haulover Beach Park", "Vietnam", "Oregon", "Kenya", "Girona", "Netherlands", "China", "Nagoya", "Mount Sinabung", "Earth", "Dresden", "Munich", "Philadelphia", "Mecca", "Lisbon", "La Palma", "Singapore", "Richmond Park", "Kazakhstan", "New Delhi", "Mediterranean Sea", "Germany", "Hangzhou", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul", "Francis", "Amie Adelman", "Leon Keer", "Mohammed", "Mount Arafat", "Enrico Pescantini", "Krishna", "Jacob", "Fidel Castro", "Biran", "Arafat", "Raul Castro", "Mike Dalman", "Manish Kali"], "text": "Instant vacation: The best travel photos Updated 2035 GMT (0335 HKT) October 14, 2015 31 photos: Instant vacation: The best travel photos Children pose for their parents in front of Kazakhstan's Big Almaty Lake. Hide Caption 1 of 31 31 photos: Instant vacation: The best travel photos People wait for the start of a horseback riding competition in the La Sierra neighborhood of La Palma, Cuba. Hide Caption 31 photos: Instant vacation: The best travel photos People cross the U Bein Bridge over Taungthaman Lake in Mandalay, Myanmar. Hide Caption 31 photos: Instant vacation: The best travel photos Morning mist rises from the pastures of the Elbe River in Dresden, Germany. Hide Caption 31 photos: Instant vacation: The best travel photos Children play at a park in Dhaka, Bangladesh. Hide Caption 5 of 31 31 photos: Instant vacation: The best travel photos A red deer barks in the morning sun in London's Richmond Park. The park has had deer since 1529, and breeding season begins in early autumn. Hide Caption 6 of 31 31 photos: Instant vacation: The best travel photos Photographer Enrico Pescantini used a drone to capture this view of the Seljalandsfoss waterfall in Iceland. Hide Caption 31 photos: Instant vacation: The best travel photos Tourists take pictures in Girona, Spain. Hide Caption 8 of 31 31 photos: Instant vacation: The best travel photos The moon rises behind Tilikum Crossing, a bridge in Portland, Oregon. The bridge opened in early September and was named after the Chinook word for \"people.\" Hide Caption 9 of 31 31 photos: Instant vacation: The best travel photos Wildebeest are shrouded in dust as they run toward the Mara River in Kenya's Maasai Mara National Reserve. Every year, wildebeest migrate between the Maasai Mara and the Serengeti region of Tanzania. Hide Caption 10 of 31 31 photos: Instant vacation: The best travel photos A vendor dressed in Bavarian folk attire carries helium balloons on the opening day of Oktoberfest in Munich, Germany. The world's largest beer festival draws millions of visitors every year. Hide Caption 31 photos: Instant vacation: The best travel photos Lights from the Mid-Autumn Festival are seen in Hangzhou, China. Hide Caption 12 of 31 31 photos: Instant vacation: The best travel photos A vintage car crosses a railroad in Biran, Cuba. Biran is the birthplace of Cuban revolutionary Fidel Castro and his brother, President Raul Castro. Hide Caption 31 photos: Instant vacation: The best travel photos Tourists walk on a transparent cantilever bridge at a geological park in Chongqing, China. Hide Caption 14 of 31 31 photos: Instant vacation: The best travel photos Mike Dalman lifts up his 5-year-old nephew, Jacob, to look at Amie Adelman's \"Linear Motion\" piece during the ArtPrize event in Grand Rapids, Michigan. Hide Caption 31 photos: Instant vacation: The best travel photos Visitors take pictures of handcrafted lantern decorations at a Mid-Autumn Festival celebration in Singapore. Hide Caption 31 photos: Instant vacation: The best travel photos A train conductor in Nagoya, Japan, signals a clear subway platform to a colleague. Hide Caption 31 photos: Instant vacation: The best travel photos Pink umbrellas decorate a street in Lavaur, France. Hide Caption 18 of 31 31 photos: Instant vacation: The best travel photos Indian artist Manish Kali, dressed as the Hindu god Krishna, poses during a religious procession in New Delhi. Hide Caption 19 of 31 31 photos: Instant vacation: The best travel photos Muslim pilgrims pray on Mount Arafat near the holy city of Mecca, Saudi Arabia. Mount Arafat is where Islam's Prophet Mohammed is believed to have delivered his last sermon to tens of thousands of followers about 1,400 years ago. Hide Caption 20 of 31 31 photos: Instant vacation: The best travel photos People in Baghdad, Iraq, enjoy an amusement ride as they celebrate the Eid al-Adha religious holiday. Hide Caption 31 photos: Instant vacation: The best travel photos Tourists look at mist engulfing the Swiss Prealps. Hide Caption 31 photos: Instant vacation: The best travel photos Lava flows from the Mount Sinabung volcano during an eruption in Indonesia. Hide Caption 23 of 31 31 photos: Instant vacation: The best travel photos A 3-D illustration by Leon Keer is seen in Breda, Netherlands. The council of Breda commissioned the piece to raise awareness about littering. Hide Caption 24 of 31 31 photos: Instant vacation: The best travel photos Lights shine at the Cathedral Basilica of Saints Peter and Paul. Pope Francis visited the cathedral in Philadelphia on his recent trip to the United States. Hide Caption 31 photos: Instant vacation: The best travel photos People in Miami Beach, Florida, enjoy a day with their dogs at Haulover Beach Park. Hide Caption 31 photos: Instant vacation: The best travel photos The sun illuminates rice terraces in Vietnam's Mu Cang Chai district. Hide Caption 27 of 31 31 photos: Instant vacation: The best travel photos A \"super moon\" rises behind St. George's Castle in Lisbon, Portugal. A super moon is a full moon that appears larger because it's at perigee, the closest point of its orbit with Earth. Hide Caption 28 of 31 31 photos: Instant vacation: The best travel photos Ultra-Orthodox Jews pray on a hill overlooking the Mediterranean Sea as they participate in a Tashlich ceremony in Herzeliya, Israel. Tashlich, which means \"to cast away\" in Hebrew, is a practice in which Jews go to a large flowing body of water and symbolically \"throw away\" their sins by throwing a piece of bread or similar food into the water. Hide Caption 31 photos: Instant vacation: The best travel photos Salt is extracted at the Sasyk-Sivash Lake near the Crimean Peninsula. Hide Caption 31 photos: Instant vacation: The best travel photos The sun shines through the fog on the Hohenjesarscher lake in Zeschdorf, Germany. Hide Caption See the best travel photos from around the world. More from Travel", "external_links": [], "published": "2015-10-14T22:49:00.000+03:00", "crawled": "2015-10-15T00:42:23.625+03:00", "highlightTitle": ""}