{"organizations": [], "uuid": "7ebdeffb013b47e29fc812d9cbf448075ef6a9e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64741/caribbean-hotelier-inducted-2015-tourism-hall-fame", "country": "US", "title": "Caribbean hotelier inducted into 2015 Tourism Hall of Fame", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Caribbean hotelier inducted into 2015 Tourism Hall of Fame", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T22:25:00.000+03:00", "replies_count": 0, "uuid": "7ebdeffb013b47e29fc812d9cbf448075ef6a9e9"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64741/caribbean-hotelier-inducted-2015-tourism-hall-fame", "ord_in_thread": 0, "title": "Caribbean hotelier inducted into 2015 Tourism Hall of Fame", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Caribbean hotelier inducted into 2015 Tourism Hall of Fame   \nOct 12, 2015 Bermudian Hotelier/Developer John Jefferis, JP eTN   \nPAGET, Bermuda - Last Saturday, the Trinidad Hotels, Restaurants and Tourism Association inducted Caribbean Hotelier/Developer John Jefferis, JP into the Tourism Hall of Fame for 2015. He is one of only two persons ever to be inducted. The Tourism Hall of Fame recognises and honours those persons who have been outstanding performers in the hospitality and tourism industry and whose hard work, dedication and innovation make Trinidad and Tobago the destination of choice for tourists. \nJohn Jefferis is the owner of Coco Reef - Bermuda, Coco Reef - Tobago and a number of other businesses in the Caribbean region, including Cuba. He started his career as a 15-year-old pot washer at a fish and chip restaurant in London. Today, he is the Chairman and sole shareholder of the Palm Reef Hotel Development Company Limited, Coco Reef Resorts Ltd, the Caribbean Construction Company, Island Resorts International Ltd and Inflite Catering, an airline catering company with operations in both Bermuda and Tobago. \nMr. Jefferis, a past President and Chairman of the Bermuda Hotel Association, was the driving force behind Bermuda joining the Caribbean Hotel Association. He went on to become President of the Caribbean Hotel Association from 1996 to 1998 and Chairman from 1998 until 2000. During his presidency, Mr Jefferis visited nearly all of the Caribbean Association member Islands. During his speeches to the Island Hotel Associations his mantra was \"Without a vibrant and profitable hotel industry a country can never have a successful tourism industry.\" \nIn 2011, Mr. Jefferis was appointed Deputy Chairman of the Bermuda Tourism Board. He also served as Chairman of the Bermuda Tourism Board's Gaming Committee. \n\"We are proud to recognize John Jefferis' 50 years of substantial and sustained contribution to leadership, service and success in the Trinidad and Tobago hospitality and tourism industry,\" said Andrew Welch, President, Trinidad Hotels, Restaurants and Tourism Association. \"The Award Judging Committee acknowledges John's contribution to the growth of Trinidad and Tobago's hospitality and tourism sector through innovation and astute business practices. Mr Jefferis has left a positive lasting legacy within his organisation, as well as with the people with whom he has worked. Coco Reef Resorts has significantly contributed to the improvement and the recognition of Tobago as a tourism destination.\" \nMr Jefferis studied at Birmingham University where he was awarded the Hotel and Catering Institute's National Award for the top final year management student. As a result of the award he was able to secure an internship at the Savoy Hotel in London. He then moved to Bermuda where he was employed as Junior Assistant Manager at the Belmont Hotel. He was subsequently promoted to General Manager at Belmont and was the youngest person ever to hold that post. Subsequently Mr Jefferis was appointed Managing Director and a member of the Board of Directors of the Elbow Beach Hotel and Development Company. During his time at Elbow Beach, the hotel's market share and reputation increased dramatically, making it Bermuda's most successful and profitable hotel. \nMr. Jefferis was also the owner of Edgehill Manor, Roxy's Night Club and the Palm Reef Hotel, all of which he later sold. He was the major shareholder in the Haley Corporation, which was for many years, Bermuda's largest tour operator and source of tourists. \nIn 1992, Mr. Jefferis commenced the design, development plans, financing, and construction of the $82 million Coco Reef - Tobago, which became one of the Caribbean's most successful properties. A well-known leading Caribbean Tour Operator/Airline Executive stated: \"Without Coco Reef, there would not be any tourism in Tobago.\" \nAt the staff orientation meetings after the opening of Coco Reef - Tobago, the essence of Mr Jefferis' opening remarks was: \"We are in the business of theatre. My job is to spend a lot of money to create a beautiful set for our guests. You are the actors and actresses, many of you will become stars. We must always remember that we are only as good as our customers' perception of our last performance.\" His philosophy on staff recruitment was made clear by the large sign over the General Manager's office door: \"Hire for Attitude - Train for Skills.\" \nIn 2003, Mr. Jefferis acquired the Stonington Beach Hotel situated on Bermuda's most famous beach and underwent a $14.3 million reconstruction, renovation and refurbishment to open Coco Reef - Bermuda in 2004. \nIn response to his induction into the Tourism Hall of Fame, John Jefferis said: \"Having devoted my career to the hospitality and tourism industry, it is an honour to be inducted into the Trinidad Hotels, Restaurants and Tourism Association Hall of Fame. Creating new and memorable experiences and continually upgrading and redesigning my hotels for our guests is my passion and I am always humbled to be recognised for doing what I love most.\" \nMr. Jefferis has won countless accolades and awards including: Bermuda Hotel Association's first \"Bermuda Hotelier of the Year\" in 1989, The Caribbean Hotel Association's \"Caribbean Hotelier of the Year\" in 1991, Ernst and Young's \"Caribbean Entrepreneur of the Year Award\" in 2000 and Caribbean World's \"Lifetime Achievement Award in Tourism and Travel\" in 2008. Most recently, in 2014, he was named International Caribbean Life's \"Entrepreneur of the Year.\" In addition, Coco Reef - Tobago has won the World Travel Award for the \"Caribbean's Leading Hotel\" for the past 11 years.", "external_links": [], "published": "2015-10-12T22:25:00.000+03:00", "crawled": "2015-10-13T00:53:44.723+03:00", "highlightTitle": ""}