{"organizations": [], "uuid": "99b3c4c960626e47cd5530970da452d4079e7588", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/getaway-duty-free-it-really-worth-it", "country": "US", "title": "The Getaway: Duty Free: Is It Really Worth It?", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "The Getaway: Duty Free: Is It Really Worth It?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T12:00:00.000+03:00", "replies_count": 0, "uuid": "99b3c4c960626e47cd5530970da452d4079e7588"}, "author": "senh", "url": "http://www.wopular.com/getaway-duty-free-it-really-worth-it", "ord_in_thread": 0, "title": "The Getaway: Duty Free: Is It Really Worth It?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Win a getaway with Princess Cruises There is plenty to see and do while on board the 116,000-tonne vessel, with five main dining rooms, duty-free shopping and an authentic Japanese spa proving to be popular with guests. Fill out your details and tell us how a Princess cruise would make you ... 08/3/2015 - 1:00 am | View Link North East families flock to Newcastle International Airport for their summer 2015 getaway He said: “Customers shouldn’t miss our fantastic new World Duty Free store which offers fantastic value, especially when flying outside the EU. The new sunglasses section is amazing with a great range to choose from.” And Graeme Mason, planning and ... 07/17/2015 - 5:25 am | View Link Why not Guam for a Valentine’s getaway vacation? Guam offers every Filipino traveler a unique yet familiar vacation destination with its esquisite showcase of culture coupled with exotic beaches, breath-taking scenery and world-class duty-free shopping. Guam is the closest US destination from the ... 02/8/2015 - 7:00 am | View Link Norwegian Getaway Caribbean cruise is so luxurious you may not want to get off the ship If you can It’s the time of year to make a getaway to the sun. What better – warmer and sunnier – choice than the Caribbean? And is it possible to make the journey in a more appropriate way than on the cruise ship Norwegian Getaway? The largest ... 01/25/2015 - 9:04 pm | View Link Malaysia Airports offers Bali getaway in latest Indulge & Relax promotion Malaysia Airports is giving away holiday packages to Bali as part ... The Zon Perfume & Cosmetics and Khazanah Home & Deco at International Departure, Level 2; and be Duty Free and Eraman Duty Free at the Sky bridge.", "external_links": [], "published": "2015-10-05T12:00:00.000+03:00", "crawled": "2015-10-06T07:42:32.022+03:00", "highlightTitle": ""}