{"organizations": [], "uuid": "a8edc7b465bcde0ec3cb45428f54d0d0d95e55b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/25/590x/LaplandUK-613094.jpg", "site_section": "http://express.co.uk//posts/rss/132/travel", "section_title": "Daily Express :: Travel Feed", "url": "http://www.express.co.uk/travel/articles/613094/LaplandUK-tickets-pictures-Lapland-UK-Christmas", "country": "IE", "title": "Dreaming of a white Christmas? LaplandUK is everyone's wintery DREAM", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Dreaming of a white Christmas? LaplandUK is everyone's wintery DREAM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:54:00.000+03:00", "replies_count": 0, "uuid": "a8edc7b465bcde0ec3cb45428f54d0d0d95e55b1"}, "author": "", "url": "http://www.express.co.uk/travel/articles/613094/LaplandUK-tickets-pictures-Lapland-UK-Christmas", "ord_in_thread": 0, "title": "Dreaming of a white Christmas? LaplandUK is everyone's wintery DREAM", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dreaming of a white Christmas? LaplandUK is everyone's wintery DREAM Dreaming of a white Christmas? LaplandUK is everyone's wintery DREAM WHILE many will be keeping their fingers crossed for a white Christmas, there's one place in the UK guaranteed for snow. PUBLISHED: 15:54, Mon, Oct 19, 2015 | UPDATED: 16:04, Mon, Oct 19, 2015 LaplandUK LaplandUK is a magic winter wonderland fit for the whole family \nWe all know Father Christmas lives in the North Pole - for most of the year - but in the run up to Christmas this year he's enjoying a mini break in Ascot. \nRunning from the 21st November to Christmas Eve, LaplandUK is making children's dreams come true. Related articles Beautiful 'badass' girl gains THOUSANDS of followers with... \nLaplandUK is the UK’s top immersive theatrical Christmas experience for all the family - with snow covered forests, real reindeer and even the chance to talk to the big man himself. \nDid you know there's less than 100 days to go before Christmas day? Tickets to visit Father Christmas’ mythical Arctic homeland on the Windsor Estate are already available. \nThe brainchild of Mike and Alison Battle, the family run LaplandUK was born in 2006 out of personal frustration at the lack of good quality Christmas experiences. LaplandUK Snow-covered trees, husky dogs and even reindeer make the day complete LaplandUK The stunning setting is decked out to look like real Lapland - but in Windsor \nSince it first opened its doors, the husband and wife team have worked tirelessly every year with their team of critically acclaimed stage managers, set designers, production assistants, and actors to offer families a truly captivating experience to keep the Christmas magic alive. \nSpeaking about the experience, Alison said: \"We are absolutely thrilled to be opening our snowy Christmas home in Ascot again this year. \n\"Every year the LaplandUK experience becomes more and more captivating as we develop new characters, and this winter we look forward to welcoming even more children to Father Christmas’ snowy UK homeland so they can share in the Christmas magic with us.\" \nLaplandUK offers a truly unique and enchanting experience, one that children will never forget. \nPersonal invitations from Father Christmas will be delivered to children requesting their help at his secret Elf Toy Factory at his Arctic wonderland. Once arrived, visitors will be handed their LaplandUK passports and will have the chance to get their hands on some Elf Jingles (LaplandUK currency). LaplandUK There's a Toy Factory where children can help the Elves make the toys \nFamilies can then meander through the beautiful snowy woodland pathways and stop off at the Toy Factory, where children can help the Elves get the toys ready to be delivered across the world on Christmas Eve. \nAfter, families will have the opportunity to meet Mother Christmas in her kitchen to lend a hand at decorating delicious gingerbread, before gathering for a traditional story. \nAdults and children will then be able to visit the Elves’ Village, meet LaplandUK’s resident huskies and reindeer and get their skates on to enjoy the festive Ice Rink. \nTo top off the experience, every child will enjoy a personalised meeting with Father Christmas in his snowy woodland home and take away a luxury husky soft toy. Pure Christmas magic! \nLaplandUK is situated in the Whitmoor Forest on the Windsor Estate. To see the magic for yourself, book tickets using the below information. Related articles", "external_links": [], "published": "2015-10-19T17:54:00.000+03:00", "crawled": "2015-10-19T18:19:52.007+03:00", "highlightTitle": ""}