{"organizations": [], "uuid": "b3fa8e833a708036c076a870120941e3010d5107", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151019IVF.jpg", "site_section": "http://www.ticotimes.net/categories/topics/health", "section_title": "Health Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/19/rights-in-vitro-what-costa-ricas-ivf-struggle-means-for-democracy", "country": "US", "title": "Rights in vitro: what Costa Rica's IVF struggle means for democracy -The", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Rights in vitro: what Costa Rica's IVF struggle means for democracy -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T16:05:00.000+03:00", "replies_count": 0, "uuid": "b3fa8e833a708036c076a870120941e3010d5107"}, "author": "Tomás Quesada-Alpízar", "url": "http://www.ticotimes.net/2015/10/19/rights-in-vitro-what-costa-ricas-ivf-struggle-means-for-democracy", "ord_in_thread": 0, "title": "Rights in vitro: what Costa Rica's IVF struggle means for democracy -The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Recommended: President Solís legalizes IVF despite doubts from the Caja\nA total of 15 years have passed since Costa Ricans lost the right to access modern medical techniques in hopes of becoming parents. While that situation may soon change, the way that change is taking place does democracy no favors, and reflects poorly on many of the central protagonists.\nThe recognition of rights is one of the quintessential and perpetual processes of modern liberal democracies. Costa Rica has one of the most advanced human rights records of any nation in the world. This has happened in two ways. First, the State – represented by the government – has been an eager signatory of international treaties on human rights. Second, the Constitutional Chamber of the Supreme Court, popularly known as the Sala IV , has expanded the scope of enforcement of those treaties domestically. In 2000, the court decided that international treaties on human rights bestowing greater guarantees to citizens than those contained in Costa Rica’s Constitution, even those not ratified by the State, are enforceable in the country. Legal academics and practitioners consider that this decision placed Costa Rica in a privileged position regarding the protection of human rights. When it comes to the recognition and enforcement of human rights, State authorities can no longer claim that the Constitution is the limit.\nDespite these expansive judicial interpretations on human rights, the Sala IV has been ambivalent regarding the recognition of certain rights: for example, gay marriage. This, however, would be a topic for another column. Today, I would like to address the recognition the right of access to medical techniques to procreate when natural means are impossible (known as In Vitro Fertilization – IVF). The topic is an old one but has gained fresh relevance in Costa Rica, as Congress is currently debating a bill in the wake of the decision of the Inter-American Court of Human Rights allowing the technique. The bill’s passage is not without controversy, as it has been eagerly opposed by the so called “Christian parties” in Congress, altering the political agenda. Moreover, just a few days ago, the Sala IV suspended a new Executive Decree trying to regulate IVF in accordance with the Inter-American Court’s decision. (The court has since thrown out several challenges to the degree, but another challenge is still pending .)\nCosta Rica is the only democracy in the Western hemisphere that has banned this technique. Of course, this in itself is not an argument to support it. But discussion of IVF in Costa Rica should not be limited only to the question of whether we should have it or not, but also how we get access to it or not. The topic is as much about procedure as it is of substance. Unfortunately, the way in which Costa Rica has decided to ban or allow IVF has been one of the saddest episodes of our contemporary democratic history: one characterized by a lack of open and inclusive debate in the legislature, and of citizens having not only their reproductive rights denied for decades, but also their basic rights of democratic participation and opinion.\nSee also: Documentary on Costa Rica’s IVF battle airs on Sunday\nIn the year 2000, the Sala IV declared IVF unconstitutional because it opined that the procedure violated the right to life of embryos. The court also insisted that this type of practice should be regulated by only law and not by executive decree. It was up to Congress to decide the terms of IVF. However, one phrase in the same decision invalidated the latter argument: “Since this procedure [IVF], in and of itself infringes the right to life, express record must be made that, not even by law would it be possible to legitimately authorize its application, at least, the Court insists, while its scientific development remains in its current state.”\nThis decision triggered a long saga of judicial fights, political irresponsibility, and unfulfilled rights for couples wishing to access IVF. There have been two main consequences of the decision of 2000. Firstly, for almost 15 years Costa Rica has remained silent on the issue of reproductive rights and IVF. This is not healthy for any democracy. How can a court impose silence on a legislature for so long? Is this the best way to protect rights in a democracy? I doubt it. Moreover, while in 2012 the Inter-American Court reversed the Constitutional Court’s decision and declared that the IVF was in accordance with the American Convention of Human Rights, Costa Rica went from forbidding the IVF by order of a domestic court to allowing it by order of an international court. Supporters and detractors of IVF may have had different opinions, but neither had any opportunity to present their ideas in a legislature, or debate the recognition of reproductive rights. That was the work of courts.\nSecondly, as the judges of the Inter-American Court said, couples seeking access to IVF saw their rights to have a family and to fulfil their life goals violated for a long time; moreover, the banning of the technique was an arbitrary intrusion of the State into their private lives, affecting their psychological integrity. Furthermore, and this is not in the decision of the Inter-American Court, couples seeking access to IVF were treated as second-class citizens, since their right of participation to fight for their reproductive rights in Congress was seriously restricted.\nThese couples finally found justice in an international court. That should not make our democratic institutions proud. Our Constitutional Court has been a pioneer of human rights, yet cases like this one should raise awareness not only of the moral and political – in the broad sense – nature of the Sala IV, but also of the limits of its powers.\nOn the other hand, Congress should stop renouncing its duty to debate human rights. It has become a common practice for legislators – mainly those opposing legislation – to bring issues for the Sala IV to decide, particularly regarding rights of deep moral disagreement. If they fear to debate and make decisions about rights, they should not have run for office in the first place. Moreover, minority parties should have the same right as majority parties to propose, discuss, and oppose legislation, but not to avoid debate with dilatory techniques. They can even negotiate with the government which official bills to support: that is their legitimate political capital, but they should not use it to block initiatives that have the support of a majority of legislators. In the end, that only continues to erode the confidence of citizens in the legislature, and translating it to other institutions, such as courts. The internal rules of Congress should be amended not only to speed up the approval of laws but also to avoid the foreclosure of debate.\nIt has been argued that courts are the best place to protect rights. As this case has shown, judges also differ in the content of moral rights. On other hand, with increasing intervention of courts in political and moral debates, our Congress has become somewhat indolent of its role, repeating mechanically what courts say. Today, a new bill on IVF is being rushed for approval due to the pressure of the ruling of the Inter-American Court condemning the State. At the same time, minority Christian parties are using whatever legal and political tools they can to avoid the discussion and approval of the new law.\nThis is a poor way to debate our rights. We should be aware that the interests, projects, and aspirations of citizens are at stake. The recognition of rights is not a matter of courts, political factions, or confined spaces. The recognition of rights belongs to Congress following open and public debates. This is how we build stronger democratic societies. This is how we respect and make possible what Jeremy Waldron, a political theorist, has called “the right of rights” – that is, the right to participate and to be heard by others.\nRead more Politic(o)s columns here .\nTomás Quesada-Alpízar is pursuing his doctoral degree in politics at the University of Oxford. In the monthly column “Politic(o)s,” he explores current events and political issues in Costa Rica and around the world. He welcomes reader questions and comments at politicostt@gmail.com .", "external_links": [], "published": "2015-10-19T16:05:00.000+03:00", "crawled": "2015-10-19T12:26:58.879+03:00", "highlightTitle": ""}