{"organizations": [], "uuid": "8a5b4a08571a5081bcede037cc94d14c37a63f8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64681/florida-panthers-and-eastern-air-lines-team-provide-cargo-recove", "country": "US", "title": "Florida Panthers and Eastern Air Lines team up to provide cargo recovery flight for the Bahamas", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Florida Panthers and Eastern Air Lines team up to provide cargo recovery flight for the Bahamas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T06:00:00.000+03:00", "replies_count": 0, "uuid": "8a5b4a08571a5081bcede037cc94d14c37a63f8d"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64681/florida-panthers-and-eastern-air-lines-team-provide-cargo-recove", "ord_in_thread": 0, "title": "Florida Panthers and Eastern Air Lines team up to provide cargo recovery flight for the Bahamas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Florida Panthers and Eastern Air Lines team up to provide cargo recovery flight for the Bahamas   10, 2015 eTN   \nNASSAU, The Bahamas - The Florida Panthers and Eastern Air Lines, working in partnership with The Bahamas Ministry of Tourism, today flew a joint mission to the island of Exuma. The mission was led by the Ministry of Tourism’s Director General, Joy Jibrilu, to bring supplies purchased and donated in South Florida donated by Bahamian tourism sector partners as well as donors in Nassau and Grand Bahama Island, wanting to contribute to the Hurricane relief effort. From Exuma, smaller aircraft will distribute the supplies to some of the islands most heavily impacted by Hurricane Joaquin, which brought Category 4 winds to much of The Bahamas chain of islands. \nThe Flight originated from Miami International Airport, where over 5 tons of supplies were loaded aboard Eastern’s 737-700, The Spirit of the American Soldier, which is used primarily by the Florida Panthers for their road trips. \n“We are fortunate to be able to team with Eastern on this flight. The Panthers are an important part of Broward and Miami-Dade Counties, where many Bahamians maintain homes, and many of them are Panthers fans. We felt this was an excellent way to give back to the community which supports us” said Peter Luuko, Chairman of the Board of the Panthers. \n“The Bahamas has always been a special place for Eastern and its employees over the past 70 years, and will be a prominent part of our plans for the future,” said Ed Wegel, Eastern’s President and CEO. “Like the Panthers, we feel a great obligation to give back to those who have supported us so well over so many years, and we greatly appreciate the Panthers providing use of the aircraft for today’s flight.” \nVolunteers from both the Panthers and Eastern will be on the flight to provide assistance on the ground including loading and offloading of supplies. \n“We are indeed very fortunate to have great friends in both the Panthers and Eastern organizations, who foresaw our needs and quickly volunteered to donate their time and resources to assist in our relief efforts. We thank both teams for their work for The Bahamas today,” said Minister Obediah Wilchcombe, Minister of Tourism for The Bahamas.", "external_links": [], "published": "2015-10-10T06:00:00.000+03:00", "crawled": "2015-10-10T07:11:31.757+03:00", "highlightTitle": ""}