{"organizations": [], "uuid": "df25ecd7a259ecc4ed93b16d1e9bcf57d1def7b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/29346-oakwood-worldwide-announces-executive-promotions-expanded-roles", "country": "US", "title": "Oakwood Worldwide announces Executive Promotions; expanded roles", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Oakwood Worldwide announces Executive Promotions; expanded roles", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:30:00.000+03:00", "replies_count": 0, "uuid": "df25ecd7a259ecc4ed93b16d1e9bcf57d1def7b2"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/29346-oakwood-worldwide-announces-executive-promotions-expanded-roles", "ord_in_thread": 0, "title": "Oakwood Worldwide announces Executive Promotions; expanded roles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oakwood Worldwide announces Executive Promotions; expanded roles Oakwood Worldwide announces Executive Promotions; expanded roles Details Category: Appointments   14:30 Oakwood Worldwide®, the global leader in corporate housing and serviced apartment solutions, has announced two promotions within its executive team. “This is an incredibly exciting time for Oakwood Worldwide,” said Howard F. Ruby, chairman, founder and CEO, Oakwood Worldwide. “I’m thrilled that we had talented leaders that allowed us to make these changes as we continue to expand our global presence.” \nMarina Lubinsky, previously Senior Vice President, Chief Information Officer and interim Human Resources Lead, has been promoted to Senior Vice President, Shared Services and Chief Information Officer. Lubinsky, who joined the company nine years ago, will continue to lead Oakwood Worldwide’s global IT and Human Resources organizations and will now oversee the global sales and service center operations in Phoenix, Ariz., bringing all of Oakwood Worldwide’s shared services under the direction of one leader. Chris Brenk, previously interim Chief Financial Officer, has been promoted to Senior Vice President, Financial Services and Chief Financial Officer. Brenk is a 26-year veteran of Oakwood Worldwide and is focused on leading the global finance team; guiding the organization through budgeting and forecasting; enhancing Oakwood Worldwide’s global pricing and payment system, which expands multi-currency billing to clients; and mitigating risk. “Both Marina and Chris have been instrumental in Oakwood’s growth and success over the years. Their innovative ideas, leadership perspective and extensive company knowledge will help us as we continue to evolve as an organization,” said Ruby. “We are confident that they will be even more effective in their new roles as Oakwood Worldwide continues to lead in corporate housing and serviced apartment solutions around the globe.” Related articles", "external_links": [], "published": "2015-10-14T16:30:00.000+03:00", "crawled": "2015-10-14T21:26:05.983+03:00", "highlightTitle": ""}