{"organizations": [], "uuid": "d2906a7acb802251c7443967021fcad4c9e8dca0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.middletowntranscript.com", "main_image": "http://www.middletowntranscript.com/storyimage/ZZ/20151002/NEWS/151009974/AR/0/AR-151009974.jpg", "site_section": "http://www.middletowntranscript.com/lifestyle/travel?template=rss&mime=xml", "section_title": "Travel - Middletown Transcript", "url": "http://www.middletowntranscript.com/article/ZZ/20151002/NEWS/151009974/2010/LIFESTYLE?rssfeed=true", "country": "US", "title": "Book early, be flexible to fly cheap at holidays", "performance_score": 0, "site": "middletowntranscript.com", "participants_count": 1, "title_full": "Book early, be flexible to fly cheap at holidays", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:46:00.000+03:00", "replies_count": 0, "uuid": "d2906a7acb802251c7443967021fcad4c9e8dca0"}, "author": "Steve Stephens, The Columbus Dispatch", "url": "http://www.middletowntranscript.com/article/ZZ/20151002/NEWS/151009974/2010/LIFESTYLE?rssfeed=true", "ord_in_thread": 0, "title": "Book early, be flexible to fly cheap at holidays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Book early, be flexible to fly cheap at holidays Comment By Steve Stephens, The Columbus Dispatch Middletown Transcript By Steve Stephens, The Columbus Dispatch Posted Oct. 2, 2015 at 10:46 AM By Steve Stephens, The Columbus Dispatch Posted Oct. 2, 2015 at 10:46 AM The time to book a cheaper holiday trip was probably a day earlier. “If you want a good scare, wait until the day after Halloween and go looking for a holiday airline ticket,” said Brian Ek of Priceline.com . “The sooner you can book, the better,” he said. “By Halloween, it’s all over but the shouting.\" There is no magic time to find holiday-travel bargains, said Elizabeth Blount McCormick of Uniglobe Travel Designers in Columbus, Ohio. But the sooner, the better, she agreed. “Instead of buying expensive gifts, a lot of families nowadays are traveling during the holiday season,” she said. That means a lot of competition — and high rates — for airfares, hotel rooms and rental cars. “And just like a Broadway show, the best seats go first,” said George Hobica with AirfareWatchdog, a website that tracks airfares. “If you are picky about the flight time, nonstop versus connecting, or want to sit with your companions, you’ll have to pay the price,” Hobica said. Being flexible can mean savings, though. If you can schedule a trip close to but not necessarily encompassing Thanksgiving, Christmas or the New Year’s holiday, you can save money, McCormick said. “People need to be ready to travel before, after, or pony up the cash,” McCormick said. Traveling on the holiday also can be a good choice, she said. Airports usually are less crowded, and fares can be lower, she said. “I’ve traveled on the actual holiday, and it’s much less hectic” at the airport than just before or after, McCormick said. “If you don’t mind opening your gifts early on Christmas and then flying out later that day, you can save some stress and money. “The Sunday after Thanksgiving is the most crowded, stressful day to travel that there is. So try to travel on that Monday, instead. If you make a little adjustment in your schedule, you’ll find it’s not so hectic.” Hobica also recommends flying on the holiday to save money. “For Christmas, fares go up for travel on (Dec.) 14th and later,” he said. “But if you travel on the 23rd, 24th or 25th, you might save some money.” Those who can go on their vacation or holiday visit in early December can find the real bargains, though, Hobica said. “From Dec. 1st to 14th, fares go way down, especially for Tuesday and Wednesday travel. It’s a great way to save.” Page 2 of 2 - Hobica also recommends comparing ticket prices at nearby airports — Baltimore as an alternative to Washington, D.C., for example. Research by Priceline shows that the most-expensive Thanksgiving airfares will be for travel on the weekend before the holiday and the weekend after. And the day before Thanksgiving — Nov. 25 this year — is the most expensive and crowded day of the year to fly. Christmastime fares also will be more expensive the weekend before and the weekend after the holiday, according to Priceline. Travelers might pay twice as much to fly on peak travel days as on days just before or after, Priceline research shows. Travelers willing to fly outside the peak business-travel times of 8 to 10 a.m. and 5 to 7 p.m. also can save on airfares, Priceline says. The average domestic airfare for Thanksgiving travel is $408 round trip, with an average range from $207 to $476. Average Christmas airfare is $485, ranging from $351 to $557. sstephens@dispatch.com By Steve Stephens, The Columbus Dispatch Middletown Transcript By Steve Stephens, The Columbus Dispatch Posted Oct. 2, 2015 at 10:46 AM", "external_links": [], "published": "2015-10-02T18:46:00.000+03:00", "crawled": "2015-10-05T04:52:23.140+03:00", "highlightTitle": ""}