{"organizations": [], "uuid": "09864a41083cc4be4a927091c62d1e8196a4db79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sooperarticles.com", "main_image": "", "site_section": "http://www.sooperarticles.com/rss/category/travel-21.xml", "section_title": "Travel Articles - Sooper Articles", "url": "http://www.sooperarticles.com/travel-articles/some-major-places-one-should-visit-trip-asia-1451939.html", "country": "US", "title": "Some Major Places One Should Visit on a Trip to Asia", "performance_score": 0, "site": "sooperarticles.com", "participants_count": 0, "title_full": "Some Major Places One Should Visit on a Trip to Asia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:36:00.000+03:00", "replies_count": 0, "uuid": "09864a41083cc4be4a927091c62d1e8196a4db79"}, "author": "", "url": "http://www.sooperarticles.com/travel-articles/some-major-places-one-should-visit-trip-asia-1451939.html", "ord_in_thread": 0, "title": "Some Major Places One Should Visit on a Trip to Asia", "locations": ["Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Some Major Places One Should Visit on a Trip to Asia Some Major Places One Should Visit on a Trip to Asia 0 \nAsia's top travel spots are described below. They are mix of culture, adventure and ancient history. If you are not visiting these places, then you are missing world of discovery. \nBali: There are luxury hotel, ancient temples and sandy shores. For long time, this place attracted visitors. For nature lovers/adventure seekers there is rugged interior. It is synonymous with heaven. There are Pagodas along coast lines. Many temples are sacred Hindu sites. Visit Monkey forest park at Ubud village. \nHong Kong: It consists of multiple islands. There are lush parklands and dense skyscrapers. There are rugby pitches and sandy beaches. Full of fresh air. It is a world class metro polish. Main attractions for Hong Kong are Ocean Park and Disney land. Ocean Park is good for teenagers. Disney land is obvious choice of under 10's. Young kids like ride and animals. Ocean Park and Disney land, both are affordable. Visit Ngong Ping village to see traditional Chinese architecture. Go to top of Victoria peak by using tram. Lantau Island is known for rural life of Hong Kong. \nSingapore: In Asia, Singapore is an obvious choice as a family holiday destination. You may like Universal Studios Singapore. There is a fabulous zoo and world's largest aquarium. There are many cultural attractions also. \nBangkok: It is a blend of West and East, old and new. There are porcelain -laid spires, golden palaces, floating markets etc. Grand Palace consists of many palaces and temples. In Grand Palace, there is sculpture of Emerald Buddha. It is made of jade. You may visit Dusit for European style garden, Pratunam for shipping or Siam square. There is Wat Pho temple at Phra Nakhon. It is famous for reclining Buddha. \nKatmandu: This is capital of Nepal. Surrounded by a valley. There are many historic attractions including seven UNESCO world heritage sites. Bauddhanath and Swayambhu are the famous stupas. Durbar square consists of Bhaktpur, Hanuman Dhoka and Patan. Changu Narayan and Pashupati Nath are Hindu temples. Mountain trekkers can go to Thamel District. \nPhuket: It is the largest province of Thailand. For centuries, it has attracted tourist. Between China and India, it is a major trading route. This is premier vacation destination. Patong Beach is very popular. There are fifteen major beaches. You may enjoy glorious sunset. \nBorneo Island: It is the third largest island in the world. You will have opportunities to view wildlife. There is amazing jungle trekking. Island is surrounded by beautiful marine life. \nBoracay: It is known tourist place in Philippines. Entry and exit is from Cagban beach. Buladog beach and white beach are popular beaches at Boracay. Visitors relax here. There is a backdrop of clear water, coconut trees and white sand. \nHo Chi Minh City: It is the largest city of Vietnam. In Vietnam this is the best place to visit. Formerly, it was known as Saigon. Yu may visit war remnant museum and floating market on Saigon river. \nTaipei: It is capital of Taiwan. It is cultural, economic and political hub. It is famous for its night markets. Main sights are National Palace Museum, Chiang Kai-shek Memorial Hall, Maokong gondola etc. Kiran Sharma hails from Delhi and is a renowned vasthu consultant who has been contributing some of her valuable works for indiaproperty.com . Rate this Article", "external_links": [], "published": "2015-10-20T20:36:00.000+03:00", "crawled": "2015-10-21T03:20:32.379+03:00", "highlightTitle": ""}