{"organizations": [], "uuid": "7f5913eb31e98d60fe04263416fc24850a04e2ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jewishnews.co.uk", "main_image": "http://www.jewishnews.co.uk/wp-content/uploads/2015/10/ConghamHall_NEW-exterior_hires.CROP_.jpg", "site_section": "http://www.jewishnews.co.uk/category/features/travel/", "section_title": "Travel Archives - Jewish News", "url": "http://www.jewishnews.co.uk/a-weekend-in-the-country-at-congham/", "country": "GB", "title": "A weekend in the country at Congham", "performance_score": 0, "site": "jewishnews.co.uk", "participants_count": 1, "title_full": "A weekend in the country at Congham - Jewish News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "7f5913eb31e98d60fe04263416fc24850a04e2ea"}, "author": "jewishnews.co.uk", "url": "http://www.jewishnews.co.uk/a-weekend-in-the-country-at-congham/", "ord_in_thread": 0, "title": "A weekend in the country at Congham", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zuzana Kasparova\nZuzana Kasparova takes in historic Congham Hall..\nThere are many fine ways to start the day, but sitting in a hot tub watching rabbits hoppity-skip across the manicured lawn of a Georgian manor house has to be in everyone’s top ten.\nIt is certainly in mine as I experienced it first-hand during a well-earned recharge mini-break at Congham Hall in Norfolk.\nCongham Hall\nCongham Hall is privately owned,close to the Queen’s Sandringham Estate and only 110 minutes by train from King’s Cross which is really convenient if you are heading there after work on a Friday.\nThe welcome at the house is a warm one and we were charmed by the size and elegance of our room which like all of the rooms at the hotel is individually furnished with hand-picked items.\nYou really can see the thought and attention that has been paid to each individual detail and I particularly liked the paintings created by local Norfolk artists.\nOur bedroom opened out to a small terrace over-looking the famous hotel herb gardens, which were surprisingly lush for the autumnal months.\nThere are also apple orchards and the kitchen garden supplies the 2AA rosette restaurant with all its seasonal vegetables (turnips, chard and salads while all the other food is sourced locally.\nThe following morning we started the day as one should on a recharge weekend -with a full body massage at the spa which is in the very heart of the garden with the herbs and flowers used to make Elemental Herbology, the unique oils that are used in the signature treatments which include facials, express hand and feet rituals and the full muscle melt massages (my favourite).\nFor the more energetic there is a 12 m swimming pool, sauna, steam room and the outdoor hot tub I mentioned earlier.\nAs I am a morning person I went for a 7am swim and then into the hot tub which is when I saw the rabbits, but evidently the view is just as exquisite at sunset\nThe owner of Congham Nicholas Dickinson who began his career at Chewton Glen and Le Manoir aux Quat’Saisons before co-developing Luxury Family Hotels and then Alias Hotels was kind enough to show us around the property and its grounds and share the rich history of the building.\nIf you like walking, the hotel has number of suggested routes in the local area and we really went for it when we chose the 8.2 mile walk which took us through green woods and fields to the ruins of St James’ Church.\nBack for more wonderful food and pool time, it was clear the hardest part of our weekend would be leaving Congham Hall. But the memory of rabbits viewed from the hot tub will get me through until my next visit in the spring.\nCongham hall bookings Recharger Breaks are £399 to £670 per room on 27 and 28 December 2015, including two nights dinner, bed and breakfast.\nYou can extend your stay to include 29 December for just £150 per room, including dinner, bed and breakfast plus one complimentary “file and polish” from the Leighton Denny range or a bottle of “bubbly”.\nTel: 01485 600250, Conghamhallhotel.co.uk", "external_links": ["https://twitter.com/JewishNewsUK"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T02:26:16.536+03:00", "highlightTitle": ""}