{"organizations": [], "uuid": "6289723b257c85a8bb8fb4fb1a46cfb81e08deef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "honestcooking.com", "main_image": "http://honestcooking.com/wp-content/uploads/2015/10/Screen-Shot-2015-10-16-at-3.24.39-PM.png", "site_section": "http://honestcooking.com/category/culinary-travel/feed/", "section_title": "Honest Cooking » Culinary Travel", "url": "http://honestcooking.com/the-delicious-food-pop-ups-of-nyc/", "country": "US", "title": "The Delicious Food Pop-Ups of NYC", "performance_score": 0, "site": "honestcooking.com", "participants_count": 1, "title_full": "The Delicious Food Pop-Ups of NYC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T16:00:00.000+03:00", "replies_count": 0, "uuid": "6289723b257c85a8bb8fb4fb1a46cfb81e08deef"}, "author": "Andrew Asistin", "url": "http://honestcooking.com/the-delicious-food-pop-ups-of-nyc/", "ord_in_thread": 0, "title": "The Delicious Food Pop-Ups of NYC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Testing The Delicious Food Pop-Ups of NYC \nMad. Sq. Eats has come and gone for another season, but head on over to Broadway Bites for a new taste. The UrbanSpace pop-ups feature some of the most delicious food from amazing vendors. Stop by until mid-November. By Andrew Asistin \nA delicious Lobster Roll from Red Hook Lobster Pound in Brooklyn. \nMadison Square Park, for the 8th year in a row, has played host to the lovely UrbanSpace popup. A gathering of the cities most delicious and unique food trucks and/or restaurants descended on the Flatiron district in full force, bringing a melange of flavors and aromas to tickle the taste-buds and nostrils of anyone passing through. Mad. Sq. Eats is regarded as a beloved dining destination and an innovative use of public space. \nA lot of familiar names were here from the last event in the Garment District; Arancini Bros. , Gelato Ti Amo , and Sigmund’s . All wonderful places with equally delicious items to try and sample. It was the perfect storm of savory and sweet flavors, with distinct aromas and delicacies punctuating the crowd. Here’s a rundown on specific vendors that really stood out. \nA Spicy Pork Taco from the fine folks at Fire Belly Korean BBQ . \nFire Belly Korean BBQ absolutely lived up to their name. Their specialty, a spicy pork taco, was to die for. The flavors were spot-on and it was quite filling. Fair warning, have a refreshing drink nearby. You’ll need it. Their fleet of food trucks and popup restaurants are located all over New York, serving up the best, and hottest, Korean style street food. From BBQ to Kimchi, be sure to check out Fire Belly wherever they come up! \nAn amazing Lobster Roll. \nRed Hook Lobster Pound located in Brooklyn has made quite the splash (no pun intended) in bringing a taste of Maine into the heart of New York City. Everything about it tasted fresh . The lobster was delicious, the ingredients tasted great. The dusting of Old Bay, while maybe a bit heavy handed, was a great touch nonetheless. And it’s been that way since 2008 when they opened up! Nothing’s changed and that is a very good thing. Pay them a visit next time you’re in Brooklyn! \nThe Katsu Krunch Corndog from Asiadog . Amazing. \nTake one look at the Asiadog menu and you’ll want to try everything on it. At their core, they hot dogs with Asian-inspired toppings. Born from a love of NYC, they really push the limits of one of most street foods by adding their own twist with super-fresh ingredients. Their Katsu Krunch Corndog especially embodied this unique twist. It’s like a corndog turned up way past eleven. Breaded in the same way as Japanese Katsudon and served with the same sauce, it’s a match made in heaven. The crunch, the flavors. Exquisite! If there is only one place to track down, make it Asiadog. \nThough this the fall season of Mad. Sq. Eats has come and gone, be sure to check it out when it comes back next year! A similar group of vendors, also put on by UrbanSpace, will be at 33rd Street and Broadway until November 13th. There’s food and experiences that await. Where else can you find such great and unique food vendors from all over NYC? \nBroadway Bites until November 13th In Greeley Square Park Andrew Asistin \nCombining a love of writing and food, Andrew's culinary journey has walked many paths. From university, to the Culinary Institute of America, to the restaurants of NYC. Now finally settled in as an editorial intern at Alimentari, the next step of his journey can begin. \n  19,  ", "external_links": [], "published": "2015-10-19T16:00:00.000+03:00", "crawled": "2015-10-19T20:33:26.553+03:00", "highlightTitle": ""}