{"organizations": [], "uuid": "3dfac83d690d1713a9682b98c2105b18f3587ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/IMG_0938.jpg", "site_section": "http://www.ticotimes.net/categories/topics/crime", "section_title": "Crime Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/08/costa-rica-takes-down-suspected-drug-trafficker-macho-coca-on-the-deas-radar-for-years", "country": "US", "title": "Costa Rica takes down suspected drug trafficker ‘Macho Coca,’ on the DEA’s radar for years", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rica takes down suspected drug trafficker ‘Macho Coca,’ on the DEA’s radar for years -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:04:00.000+03:00", "replies_count": 0, "uuid": "3dfac83d690d1713a9682b98c2105b18f3587ae0"}, "author": "Álvaro Sánchez", "url": "http://www.ticotimes.net/2015/10/08/costa-rica-takes-down-suspected-drug-trafficker-macho-coca-on-the-deas-radar-for-years", "ord_in_thread": 0, "title": "Costa Rica takes down suspected drug trafficker ‘Macho Coca,’ on the DEA’s radar for years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LIMÓN – The name “Macho Coca” is well-known in Costa Rica’s Caribbean port city of Limón. His real surname is Bell, and for many years locals quietly gossiped about his suspected involvement in drug trafficking. Macho Coca also was a target of a long investigation by the U.S. Drug Enforcement Administration.\nEarly on Thursday morning, Costa Rican authorities paid Macho Coca, 52, a visit, raiding one of his luxury properties in Limón – which includes its own private dock – and arresting him on charges of cocaine possession with intent to distribute in Costa Rica and international trafficking. Costa Rica’s Organized Crime Unit at the Prosecutor’s Office is heading up the case.\nDozens of law enforcement agents participate in seven raids across Costa Rica targeting a suspected drug trafficker on Thursday, Oct. 8, 2015.\nThe Tico Times\nAuthorities also are charging Macho Coca with bribing public officials, alleging that he paid off Traffic Police officers to avoid being detained while running his cocaine shipments on the Braulio Carrillo Highway between Limón and Costa Rica’s capital, San José.\nTwo of Bell’s alleged associates also were detained – two brothers surnamed Valerio – along with three Traffic Police officers.\nAuthorities conducted a total of seven raids on Thursday across the country. Participating in the raids was the Special Tactical Response Unit’s (SERT) new armored vehicle, nicknamed “ The Protector ” (formerly known as “The Beast”). In a home in Moravia, a suburb northeast of San José, police seized ¢30 million ($57,000) in cash. They also seized $9,000, E3,000 and several vehicles.\nCosta Rica’s new crime-fighting machine, known as “The Protector,” was used in Thursday’s raid.\nThe Tico Times\nBoth the DEA and the Costa Rican Prosecutor’s Office had been after Macho Coca for several years, but had been unable until now to prove his involvement in drug trafficking, authorities said. That changed following a year’s worth of telephone wiretaps that revealed the alleged network that shipped cocaine from Limón to the capital, according to Judicial Investigation Police (OIJ) Acting Director Gerald Campos.\nThe cocaine shipments allegedly arrived in Limón by boat and were unloaded at the suspect’s multiple properties, authorities allege.\nBell also is under investigation for illegally building a private dock in Limón estimated at a cost of $2 million.\n“The investigation is ongoing, and we’re expecting more information that will help us build our case against the suspects,” Mayra Campos, acting chief public prosecutor, told The Tico Times.\nA sign outside suspected drug trafficker “Macho Coca’s” property reads: “Private property. … Crazy owner, crazy dog.”\nThe Tico Times\nLuxury properties and death threats Also participating in Thursday’s raids were agents from OIJ’s Money Laundering Unit, who are investigating Macho Coca’s large properties in Moín, north of Limón city, Río Blanco, and the center of Limón.\nThose properties are valued at more than $2 million. Also registered under Bell’s name are several boats and vehicles. A $2 million private dock recently was ordered closed by Judge Reynaldo Araya, citing illegal construction and a lack of permits. Araya told The Tico Times he received death threats after issuing his ruling.\nBell’s attorney, Juan José Picado, said his client is innocent of the charges.\nOne of drug trafficking suspect “Macho Coca’s” many properties raided on Thursday. This one is valued at more than $1.2 million.\n(Screengrab from Telenoticias)", "external_links": [], "published": "2015-10-09T03:04:00.000+03:00", "crawled": "2015-10-09T01:46:10.928+03:00", "highlightTitle": ""}