{"organizations": [], "uuid": "890f2c2b4750c37cc93a0dae3e437d86568380f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/863c9d9efb3341282161f88de12cff1b", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/how-tyson-the-naked-traveller-travels-the-world-on-30-a-day/story-fnndib5x-1227577468232?from=public_rss", "country": "IL", "title": "‘How I travel on $30 a day’", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "‘How I travel on $30 a day’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:19:00.000+03:00", "replies_count": 0, "uuid": "890f2c2b4750c37cc93a0dae3e437d86568380f1"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/how-tyson-the-naked-traveller-travels-the-world-on-30-a-day/story-fnndib5x-1227577468232?from=public_rss", "ord_in_thread": 0, "title": "‘How I travel on $30 a day’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email a friend \nIF I was to tell you it’s possible to travel the world for less than $30 per day, you’d probably think I was crazy. \nThe truth is, travelling on a budget is not only exhilarating, but it opens you up to a world of new experiences which otherwise would have never been possible. \nMy name is Tyson Mayr and I’m known as The Naked Traveller. In 2009, I took my first trip overseas. In my first 12 months of travel, I visited 28 different countries, through 6 different continents, all for a budget of under $10,000. \nNow while I do recognise that the way in which I travel might not be suitable or enjoyable for everyone, hopefully there are parts of what I do that you can implement to your own travel plans. \nHere are my five top tips that allow you to travel anywhere in the world on $30 a day, all while opening you up to new & exciting experiences: \n1. COUCH SURF \nWhat is Couchsurfing? Couchsurfing.org is a website with over 10 million members world wide. It acts as a global community, through 200,000 different cities where you can make contact with other locals, ask them for advice, arrange to meet or request to stay with them. Did I mention its all for free? \nThis doesn’t just save you money, but it will change the way you travel. Imagine arriving to a city & having a local show you around, tell you about their favourite spots, cook you local food or take you to their friend’s parties. It would be a much different experience then following the advice you get from your hotel or tourism store. Couchsurfing and learning to cook Chilli Relleno in Cancun, Mexico. Picture: Tyson Mayr. Source: Supplied \nBasically think of it like this. A network of other travellers, who may not be in a position to travel at that very moment, but showing guests around their city or hearing their stories allows them to continue that connection. \nYou can save anywhere from $30-300 a night simply on accommodation while Couchsurfing, however the true value is in the local knowledge and experiences you will get while staying with a local. \n2. EAT MORE FOR LESS \nFood is why some people travel. But while it’s important to take part in local traditions & experience local meals, eating out for every single meal can be your biggest money killer! By replacing 2 of your meals each day with a supermarket alternative, you can potentially save hundreds of dollars each week and still get your local, cultural fix. \nWhat works for me: \nBreakfast — Carry a container of oats with you. $2 can get you breakfast for a week & they are great for you. \nLunch — Pop into a supermarket, pick up some chicken or canned tuna, find a fresh baguette, a little salad & make yourself a healthy lunch. \nAlternatively, don’t be afraid to simply ask a local where you can find good, local, ‘cheap’ food. Do you think the local people of Cusco in Peru still pay $25 for lunch? Find out where they eat & do as the locals do! Eat like the locals do. Picture: Tyson Mayr. Source: Supplied Or have fish and chips on the beach. Better than any fancy restaurant. Picture: Tyson Mayr. Source: Supplied \n3. LEARN TO BUDGET \nWrite out a budget so you know exactly how far your money will take you. If you are planning on doing Europe for 3 months and you only have $6,000 — don’t just say you will ‘travel cheap’, because we all know how quickly a blow out weekend can put a dent in your plans. \nFigure out your main expenses and then break that down to a monthly, weekly and daily figure. There will still always be blow outs or unexpected expenses, however keeping an eye on your money, will allow for you to compensate when needed. On the Europe example above: \n$6,000 x 3 months \n$500 x 1 week \n$70 x 1 Day \nIf you plan on $30 per night for accommodation (average price of hostels) and $20 for food and $20 for entertainment, any money you save from either Couchsurfing or supermarket food can go towards more booze or tourist attractions. Win, win. \n4. WALK, WALK, WALK Use public transport or walk every opportunity you can. Taxis will quickly add up, even in cheaper countries, so why not use your foot falcon whenever you can. Not only are you getting exercise, you are getting a much greater feel for where you are. And let’s face it, you’re probably not going to the gym, so opt to walk every chance you can and kill two birds with one stone. A hike you can do just 30 minutes from Ipanema Beach in Rio de Janeiro. Picture: Tyson Mayr Source: Supplied \n5. RESEARCH \nWhile I love nothing more than travelling with the wind, a little research can go a long way. Flights & hotels can be significantly cheaper at certain times of the year so a little extra research certainly can go a long way. Subscribe to websites known for travel specials and spend a little time researching the destination or route you are visiting. There is always a cheaper alternative and there are always a number of activities that you can find for free! Cooking steak on Lava as it flows from a Volcano — A plan Tyson’s couchsurfing host in Hawaii organised for free. Source: Supplied \nMy first time visiting Machu Picchu cost me $120 to arrive, travelling by the train from Cusco. Two years later, I did a little research with locals on Couchsurfing (once again one of the best research tools — ask a local directly) and found a route where you travel by local bus to three different villages and walk for the last two hours along the Inca trail. Not only did I travel with the local people and see villages and parts of the jungle that aren’t riddled with tourists, I did the entire trip for just under $12. \nMind you, there was a political protest that day and we may have ended up travelling with an angry protest mob for part of that, but all part of the adventure, hey. \nUltimately, travel is unique to each individual. As long as you are respectful to others, there is no right way of doing it. For me I have always experienced my richest travel experiences when travelling on a budget, as there is far more opportunity for the unexpected and I find pushing myself out of my comfort zone often allows me to learn more about myself and the world around me. Don’t get me wrong, I still love a cocktail on a white sand beach, but in my opinion, we all need a little adventure in our life. \nSafe travels, and remember, real life experiences over material possessions. Who needs material possessions, or even shirts, when you can experience places like this. Picture: Tyson Mayr. Source: Supplied \nTyson Mayr is an award winning travel blogger. Follow Tyson on Twitter and Instagram .", "external_links": [], "published": "2015-10-22T09:19:00.000+03:00", "crawled": "2015-10-22T12:22:53.332+03:00", "highlightTitle": ""}