{"organizations": [], "uuid": "ee892bbe5ce028d83c5b3f6eb97c8ccc17e38d9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64667/international-visitors-injected-nearly-590-million-day-us-econom", "country": "US", "title": "International visitors injected nearly $590 million a day into US economy in August", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "International visitors injected nearly $590 million a day into US economy in August", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:46:00.000+03:00", "replies_count": 0, "uuid": "ee892bbe5ce028d83c5b3f6eb97c8ccc17e38d9c"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64667/international-visitors-injected-nearly-590-million-day-us-econom", "ord_in_thread": 0, "title": "International visitors injected nearly $590 million a day into US economy in August", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "International visitors injected nearly $590 million a day into US economy in August     \nWASHINGTON, DC - The US Department of Commerce recently announced that international visitors spent an estimated $18.2 billion on travel to, and tourism-related activities within, the United States during the month of August, a decrease of 2 percent when compared to August 2014. The decline is largely attributable to a 19 percent decline in passenger air transportation exports combined with an ever-so-slight downturn in travel spending (-0.6%) for the month. \n• Travel Receipts: Purchases of travel and tourism-related goods and services by international visitors traveling in the United States totaled $11.3 billion during August, a decrease of less than 1 percent when compared to last year. These goods and services include food, lodging, recreation, gifts, entertainment, local transportation in the United States, and other items incidental to foreign travel. Travel receipts accounted for 62 percent of total U.S. travel and tourism exports during August 2015. \n• Passenger Fare Receipts: Fares received by U.S. carriers from international visitors totaled $3.1 billion for the month, a decrease of more than 19 percent when compared to August 2014. Passenger fare receipts accounted for 17 percent of total U.S. travel and tourism exports during August. \n• Medical/Education/Short-Term Worker(1): Â Expenditures for educational and health-related tourism, along with all expenditures by border, seasonal, and other short-term workers, totaled $3.8 billion in August, an increase of more than 9 percent when compared to the same period last year. Medical tourism, education, and short-term worker receipts accounted for 21 percent of total U.S. travel and tourism exports during August 2015. \nYear-to-date international visitor spending totaled $145.4 billion (January through August 2015), a decrease of 1 percent when compared to the first eight months of 2014. Conversely, U.S. resident spending abroad is up more than 7 percent during the same period, having spent $102.7 billion on imported travel and tourism-related goods and services, resulting in a $42.7 billion trade surplus for travel and tourism year to date. \nAnnual Revisions \nOn June 18, 2015 the Bureau of Economic Analysis (BEA) released annual revisions of the U.S. international transactions data, of which travel and tourism-related spending are a part; as a result, we have revised annual international visitor spending data for 2012, 2013, and 2014. \nIn 2014 international visitors spent $220.8 billion (revised) experiencing the United States, an increase of 3 percent when compared to the previous year. Â These travel and tourism exports accounted for 31 percent of all U.S. services exports and 9 percent of all U.S. exports, goods and services alike. \nUnfortunately, the National Travel and Tourism Office is no longer able to report annual travel and tourism export figures (international visitor spending in the United States) by country until October of each year. The National Travel and Tourism Office relies on data provided by BEA (e.g., spending by visitors from China on U.S. flag carriers) to report these country-specific data. \nPreviously, BEA released these preliminary data in March; now, however, BEA will not publish these data until late October. As a result, the National Travel and Tourism Office will necessarily alter its reporting schedule accordingly.", "external_links": [], "published": "2015-10-09T23:46:00.000+03:00", "crawled": "2015-10-10T00:41:52.896+03:00", "highlightTitle": ""}