{"organizations": [], "uuid": "fe9c699a6089b68724574c43ad69f29c410ceacd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/download-210.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/siloam-hospitals-bags-2015-frost-sullivan-indonesia-hospital-of-the-year-award/", "country": "US", "title": "Siloam Hospitals Bags 2015 Frost & Sullivan Indonesia Hospital of the Year AwardTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Siloam Hospitals Bags 2015 Frost & Sullivan Indonesia Hospital of the Year AwardTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe9c699a6089b68724574c43ad69f29c410ceacd"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/siloam-hospitals-bags-2015-frost-sullivan-indonesia-hospital-of-the-year-award/", "ord_in_thread": 0, "title": "Siloam Hospitals Bags 2015 Frost & Sullivan Indonesia Hospital of the Year AwardTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Siloam Hospitals Bags 2015 Frost & Sullivan Indonesia Hospital of the Year Award\nSiloam Hospitals has been honored with the 2015 Frost & Sullivan Indonesia Hospital of the Year award for the fourth time at the Indonesia Excellence Awards banquet.Siloam previously received the Frost & Sullivan Indonesia Hospital of the Year award in 2010, 2012 and 2014.\nMs. Nur Hani Azran, Research Associate at Frost & Sullivan said that Siloam has been aggressively expanding its hospital network rapidly since 2011 to cater to the growing population in Indonesia. She added that the company has opened 3 new hospitals and acquired one hospital in 2014.\nMs. Nur Hani also said that Siloam is the clear leader in the hospital industry in Indonesia as it operates the largest private hospital network with the latest technologies and excellent quality care for its patients.\nShe added that Siloam’s growth strategy and implementation excellence is portrayed in its financial growth. She noted that Siloam registered a strong double digit growth in its fiscal year ended June 2014, as its new hospitals became profitable sooner-than-expected due to state-of-the-art infrastructures and facilities.\n“We are honored with the recognition presented by Frost & Sullivan for the fourth time, a reputable global consulting firm,” said Mr. Romeo F. Lledo, President Director of Siloam Hospitals Group.\n“The award is significant as it proves that Siloam Hospitals Group is on the right track. We will continue to deliver our best to our stakeholders and clients,” he added.Mr. Romeo also said that Siloam has piloted a public-private hospital format in the form of Siloam General Hospital (SGH) to offer treatments for lower-income patients. He added that SGH has participated in Indonesia’s national health insurance program, Jaminan Kesehatan National (JKN) and the number of outpatients at its hospital has more than doubled since the start of the year.\n“Besides hospitals, we also have plans to build health clinics across Indonesia in order for us to better serve the Indonesian public,” he said.The recipients of the 2015 Frost & Sullivan Indonesia Excellence Awards were identified based on an in-depth research conducted by Frost & Sullivan’s analysts. The short-listed companies were evaluated on a variety of actual market performance indicators which include revenue growth; market share and growth in market share; leadership in product innovation; marketing strategy and business development strategy.\nSource:-Siloam Hospitals", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T17:18:01.836+03:00", "highlightTitle": ""}