{"organizations": ["Real Southern India"], "uuid": "63fa1e8191a19e3b2bfb6ddb8afccd47b2468ba2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sooperarticles.com", "main_image": "", "site_section": "http://www.sooperarticles.com/rss/category/travel-21.xml", "section_title": "Travel Articles - Sooper Articles", "url": "http://www.sooperarticles.com/travel-articles/discover-real-southern-india-21-day-tour-1449087.html", "country": "US", "title": "Discover The Real Southern India with this 21-day tour", "performance_score": 0, "site": "sooperarticles.com", "participants_count": 0, "title_full": "Discover The Real Southern India with this 21-day tour", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T18:08:00.000+03:00", "replies_count": 0, "uuid": "63fa1e8191a19e3b2bfb6ddb8afccd47b2468ba2"}, "author": "", "url": "http://www.sooperarticles.com/travel-articles/discover-real-southern-india-21-day-tour-1449087.html", "ord_in_thread": 0, "title": "Discover The Real Southern India with this 21-day tour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover The Real Southern India with this 21-day tour Discover The Real Southern India with this 21-day tour 0 \nDiscover the real Southern India and its unbeatable warm hospitality and cuisine by staying with a local family. The tour covers the three most southern states of India, Kerala, Karnataka and Tamil Nadu. \nMany of its properties have been in the family for generations and have often been the place the family business has been run from, such as tea estates and farms. Accommodating guests has been a popular way to boost their income and welcomecustomers to their homes and customs. These properties abound with Southern Indian characteristics and charm and deliver excellent value for money. This is the only way to really embrace authentic Southern Indiaand all itscharecterful charm. \nEnjoy full board and freshly prepared meals, including organic and vegetarian options in which Southern India specialises. Offering an impressive variety of dishes from its rich selection of local fruit, vegetables and produce of which many of the farm property owners grow and produce themselves. This commonly includes dairy, spice gardens, vegetable gardens, fruit orchards and honey produce. Many hosts also provide cookery lessons to explore the many local ingredients and cuisine dishes that Southern India has to offer. \nProperties owners are very proud of their homes and land and wish to share this with their guests. You will experience some diverse scenery and fascinating customs during your tour, away from thetourist trails and characterless modern hotels. Instead you will be welcome as one of the locals, meeting inspiring people along the way. You will get the chance to visit tea and coffee estates and watch the picking and processing of the plants, walk through ancient Indianrain forests and swim in local fresh rivers, none of which can be experienced at a luxury five star hotel removed form the real India in an atmosphere of sanitized splendor. \nThis 21-day tour around Southern India covers the most southerly states of Tamil, Nadu, Kerala and Karnatake observing the diverse scenery and cultures in each state. The tour commences in Chennai where you will be met on arrivalby your own English speaking driver and taken to Frangi house just 20 minutes from the airport. Frangi house is a charming guesthouse with tastefully decorated rooms and warm welcoming hospitality. \nOn day one after breakfast your will be taken to Pondicherry which is approximately 3 hours drive away, where you will pass through the town of Mahalipuram. Here you will stop off to explore the famous Shore temple, which is a world heritage site and Rick Stein's favorite curry restaurant of all time, situated right on the beach. Pondicherry is easy to explore on foot, where you can discover the Joubert Market, fascinating shops, churches and Hindu templesin the Tamil quarter. \nStaying at Gratitude a guest house set in theFrench quarter, this building has been carefully restored with a beautiful roof terrace around a charming courtyard, here writers and artists are encouraged to stay for long visits. This accommodation promises peace and tranquility yet very convenient for visiting local sites. Offering optional cookery lessons. From here explore Pondicherry, where the Joubert fish market is highly recommended. There are also good local shops and restaurants serving delicious Indian cuisine,finish the day with an evening walk along the sea frontand promenade as the locals do,observe the magnificent Indian sunset and the prominent statue of Ghandi. \nYou will get the chance to visit the ancient Hindu temples in Tamil Nadu before driving over the scenic Western Ghat Mountains to Kerala, stopping in Thekkady to visit Periyar National Park on the way. The journey will then take you through the hills the stay on the lower backwaters, where you will discover a network of lakes and canals, which will offer an interesting insight into Keralan rural life. Kerala's city of Fort Cochin provides many fascination ancient buildings from past Dutch, Portuguese and British settlers, which is also home to a busy working harbor and naval base. \nFrom there the tour will move on to a home stay into the beautiful countryside. A train journey through more spectacular Southern Indian countryside will take the tour to Coimbatore to take the famous toy train that ascends to the Nilgiri Hills from Ooty to Mettupalavm. The tour will finish in the charming city of Mysore, with an abundance of Southern Indian cultural heritage including The City palace, bustling Deveraja market, an ancient fort and palace at Siringapatnum, \nThe cost for two people sharing a double room is 1,920 per personsharing a double room or 2,925 forsingle room occupancy. This includes accommodation, A/C car with English speaking driver, a soft trek in Periyar Park, train tickets for Angamali/Coimbatore and Cooonoor/ Mattupallayam, guides and entrance fees, service tax and meals as specified in the itinerary (Flights, additional meals and drinks, personal expenses, laundry and tips not included). Points South is an independent tour operator who specialises in India and Sri Lanka. Jane Points runs the company and visits the country frequently to ensure that the high standards expected are being maintained. Herprincipalgoal is to make your holiday as enjoyable, interesting and memorable as possible. Points South has a reputation for creating unforgettable experiences of a lifetime and regularly receivesexcellent feed-back from many of their clientsthat recommend them to friends and family. For more information on the tour, the read client feedback and to book a tour please visit: Point South . Rate this Article", "external_links": [], "published": "2015-10-12T18:08:00.000+03:00", "crawled": "2015-10-12T19:20:27.816+03:00", "highlightTitle": ""}