{"organizations": [], "uuid": "2aaaacdcc7ae80f3a7cbeec44f37eefce05d9d80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.charlestonscene.com", "main_image": "http://www.charlestonscene.com/storyimage/CP/20151014/CS/151019646/AR/0/AR-151019646.jpg", "site_section": "http://www.postandcourier.com/apps/pbcs.dll/section?Category=PC1201&template=rss", "section_title": "Arts and Travel", "url": "http://www.charlestonscene.com/article/20151014/CS/151019646/1003&ampsource=RSS", "country": "US", "title": "Nathan Durfee shows us the joy of drifting and discovering", "performance_score": 0, "site": "charlestonscene.com", "participants_count": 0, "title_full": "Nathan Durfee shows us the joy of drifting and discovering", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:15:00.000+03:00", "replies_count": 0, "uuid": "2aaaacdcc7ae80f3a7cbeec44f37eefce05d9d80"}, "author": "", "url": "http://www.charlestonscene.com/article/20151014/CS/151019646/1003&ampsource=RSS", "ord_in_thread": 0, "title": "Nathan Durfee shows us the joy of drifting and discovering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nathan Durfee"], "text": "Nathan Durfee shows us the joy of drifting and discovering \nBy Scott D. Elingburg \nSpecial to The Post and Courier Oct 14 2015 2:15 pm ‘Tall Tales Among the Turns’ × Here’s a story you may not have heard before: A small panda is set adrift on a boat. But the panda does not have the tools to maneuver his boat. What does the panda to do? Does he keep still and move aimlessly? Or does he succumb to the forces of nature and hope for the best? \nIf you go \nWhAT: Nathan Durfee exhibit: “The Joy of Drifting” \nWhere: Robert Lange Studios, 2 Queen St., Charleston \nWhen: On display until Oct. 30 No, this isn’t a children’s book plot line or one of those hilariously fun “Choose Your Own Adventure” books. It could be a metaphor, but that’s up to you, the viewer of Nathan Durfee’s new exhibit, “The Joy of Drifting.” As a writer, I’m always tuned in for a good narrative arc, whether it takes five minutes (as a children’s book) or eight years (e.g., “The Sopranos”) to complete. Durfee’s narrative arc takes less than eight years, but it is packed with as much symbolism, allegory, and pop culture as a Tolkien novel. In a press release from Robert Lange Studios, where Durfee’s exhibit will be displayed, Durfee says of his exhibit, “Can we drift with purpose? The show is themed around a tiny panda and his boat. Without rudders, sails, or oars, his adventures are dictated by the will of the current. Due to his small size and lack of tools he is forced to become an observer, joining us in discovering his world.” And just as the panda discovers his world, so, too, are we discovering Durfee’s world and his art, through these works. A mix of surrealism, folk and contemporary art, the works within “The Joy of Drifting” are whimsical at times, intensely serious at others, but always intriguing. As an example, two works that offer a glimpse into the world within “The Joy of Drifting” are “Tall Tales Among the Turns” and “Panda Gave His Hat to the Sea.” Both works contains notes of Salvador Dali and Rene Magritte, two famous surrealist painters, and both feature the panda as a central character. But the other, smaller elements of the paintings are heightened with detail and integral to the larger work. In “Panda Gave His Hat to the Sea,” panda rides a wave that is as much of a character as the panda. And the wooden bird on the front of the mast contrasts with the seagull that flies in front, effortlessly leading the way. “Tall Tales” has more of surrealist feel, but draws the viewer in with a host of smaller details; the large panda statue with his head thrown back could be deconstructed for hours. Both pieces showcase Durfee’s distinct style and character. Panda’s journeys in ‘The Joy of Drifting” can mirror our own journeys and struggles and our own triumphs and successes. As an added plus, Durfee’s exhibit is the 100th exhibit at Robert Lange Studios, a celebratory achievement. “There is an incredible amount of anticipation that comes along with Nathan’s exhibitions,” Robert Lange, owner of Robert Lange Studios, says. “This particular show is something we can all relate to — being awed with the discovery of new things, feeling small in a vast world and what can transpire when we are forced to be an observer.” Combined, Robert Lange Studios’ 100th exhibit of Durfee’s works makes for a special event. Enlarge Provided Nathan Durfee in his studio. \nProvided Nathan Durfee in his studio. × Enlarge Nathan Durfee in his studio. photos provided \nNathan Durfee in his studio. ×", "external_links": [], "published": "2015-10-14T22:15:00.000+03:00", "crawled": "2015-10-15T08:54:22.720+03:00", "highlightTitle": ""}