{"organizations": [], "uuid": "27f0edfd734c7ce674e47819a8c0265ca9d8ae2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.egyptindependent.com", "main_image": "", "site_section": "http://www.egyptindependent.com/rss-feed-term/154/rss.xml", "section_title": "Egypt Independent: Travel", "url": "http://www.egyptindependent.com//news/which-global-cities-have-best-and-worst-reputations-2015", "country": "US", "title": "Which global cities have the best and worst reputations in 2015?", "performance_score": 0, "site": "egyptindependent.com", "participants_count": 1, "title_full": "Which global cities have the best and worst reputations in 2015?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:09:00.000+03:00", "replies_count": 0, "uuid": "27f0edfd734c7ce674e47819a8c0265ca9d8ae2f"}, "author": "CNN", "url": "http://www.egyptindependent.com//news/which-global-cities-have-best-and-worst-reputations-2015", "ord_in_thread": 0, "title": "Which global cities have the best and worst reputations in 2015?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Which global cities have the best and worst reputations in 2015? On Australia, give yourself a pat on the back. And the city with the best reputation in the world is Sydney -- land of iconic buildings, Hugh Jackman and this beautiful skyline. Sydney and Melbourne are the two most reputable cities in the world, according to the latest study by the Reputation Institute. The 2015 City RepTrak study surveyed more than 19,000 residents of G8 countries -- France, Germany, Italy, the UK, Japan, the US, Canada and Russia. Respondents were asked to rate the world's 101 best cities based on their levels of trust, esteem, admiration and respect. \"We see linkages with other research when we compare our reputation rankings to data like tourism and investment,\" said Fernando Prado, managing partner at the Reputation Institute. \"The measures end up being strongly correlated.\" For a city, a strong reputation is closely linked to a desire by individuals to visit, live, work or invest there, he said. \"This is a bottom-line issue for local policymakers,\" added Prado. \"Cities with a good reputation welcome more tourists, host relevant events and attract more investment and talent.\" Europe has most reputable cities -- and one of the least Aside from the first two spots, Vancouver (no.5) is the only other non-European city in the top 10. In fact Europe dominated the top of the list --15 of the top 20 cities are from the region. Bumped off the top 10 list in 2014, Stockholm bounced back into third place this year. Seven out of the top 10 cities on the list are in Europe. Stockholm ranked the highest among European cities, taking third place. Last year's champion, Vienna is the fourth most respected city in 2015. Iran's capital city Tehran and Iraq's capital Baghdad, with scores of 35.4 and 31.4 respectively, came in last. Research and advisory firm Reputation Institute has released its latest City RepTrak report. It surveyed 19,000 people, asking them to rate 101 cities around the world by their reputations. Baghdad, the capital city of Iraq, came last. They're the only two cities to receive a \"poor reputation\" rating --- meaning their score was lower than 40. Moscow, found to have a \"weak reputation,\" was named the third least reputable city in the world. Asian cities score low but are improving Tokyo (no.12), the city with the biggest population and highest GDP among the cities surveyed, is the most highly regarded Asian city on the list, followed by another Japanese city, Osaka (no.20). Popular tourist destinations like Bangkok and Beijing lag behind, coming in at no. 69 and 85, respectively. Despite having a weaker performance generally, the report said that Asian cities showed the most improvement this year. Seoul (no.59) has the highest reputation score growth (15.1 percent increase from 2014), tailed by Karachi (no.91) -- Pakistan's biggest city -- which witnessed a 14 percent leap from last year. US cities great -- but not likeable The top US city on the list is San Francisco (no.24). Why such a poor result for the US? New York (no.31) and most of the US cities on the list suffered from a \"negative emotional halo,\" said Prado \"New York is a very interesting case to analyze, because it scores highly on what we call 'rational attributes,'\" he said. \"Survey respondents put New York in the top 10 for all three dimensions: Advanced Economy (no.2), Appealing Environment (no.6), and Effective Administration (no.10).\" Prado said this means New York should be in the top 10 in the final reputation chart -- \"if we see it from a rational angle.\" However, when it comes to thinking about the US brand, \"respondents recognize its greatness, but there are still some emotional barriers\" that prevent them from embracing it. \"This is what we call a negative emotional halo, which is a relevant challenge for New York and the USA\"", "external_links": [], "published": "2015-10-23T18:09:00.000+03:00", "crawled": "2015-10-23T19:44:24.883+03:00", "highlightTitle": ""}