{"organizations": [], "uuid": "a8b468e400eba2c0f436af10dc10818d54bbe949", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/29189-record-2468-volunteers-joined-2015-bali-hotels-association-coastal-cleanup-0", "country": "US", "title": "Record 2468 volunteers joined 2015 Bali Hotels Association Coastal Cleanup.0", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Record 2468 volunteers joined 2015 Bali Hotels Association Coastal Cleanup.0", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:10:00.000+03:00", "replies_count": 0, "uuid": "a8b468e400eba2c0f436af10dc10818d54bbe949"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/29189-record-2468-volunteers-joined-2015-bali-hotels-association-coastal-cleanup-0", "ord_in_thread": 0, "title": "Record 2468 volunteers joined 2015 Bali Hotels Association Coastal Cleanup.0", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Record 2468 volunteers joined 2015 Bali Hotels Association Coastal Cleanup.0 Record 2468 volunteers joined 2015 Bali Hotels Association Coastal Cleanup.0 Details Category: Hotel   11:10 More than 2,000 volunteers rallied for the cause of the environment on Saturday, 19 September 2015 scouring the beaches for trash during the International Coastal Cleanup (ICC) held on the 21 kilometer coastline of the Bali beaches.The initiative saw more than 110 hotels under the BHA banner gather over thousand eco-friendly warriors to clear debris in several beaches and rivers divided into 10 zones from Nusa Dua, Legian, Kuta, Seminyak, Tabanan to Ubud. \nAside from collecting trash along the coast, participants also segregated the various kinds of garbage collected fromplastic bags, containers, cutlery, cans, cigarettes and household waste, abandoned shoes to fishing debris, a total of 78,391 waste items. This year even more volunteers donated their time to participate resulting in 449 pillow cases which was used as bags, being collected reaching 1,504 kilograms in total. Ocean Conservancy’s International Coastal Clean Up has been running since 1986 and has become the world’s largest volunteer effort for ocean health. Every third September of each the year, millions of ‘green warriors’ from all over the globe help to clear trash from the shores of lakes, streams, rivers and oceans. Thanks to these volunteers recording every article collected, Ocean Conservancy has gained an accurate insight into the manufactured items which are impacting our planet’s health. “We hope that this initiative will start a ripple effect. Ideally we want to encourage more people, locals and tourist alike, to assume responsibility for their daily consumption of one - time products that effectively contribute to the oceans trash problem,” commented Jean - Charles Le Coz, Vice Chairman of the Bali Hotels Association. \"It was an absolute pleasure to learn that there were more than 2,000 volunteers participated in the Bali Hotel Association's International Coastal Cleanup 2015. We would like to extend a heartfelt thank you to everyone involved. We look forward to an even bigger and better cleanup next year to continue raising awareness and encouraging everyone to be more conscious about their trash,\" stated Clinton Lovell, Director of Environment Committee for BHA. Related articles", "external_links": [], "published": "2015-10-05T13:10:00.000+03:00", "crawled": "2015-10-05T14:39:44.191+03:00", "highlightTitle": ""}