{"organizations": [], "uuid": "ddb7f58afcd5cc5b841db9ef7d65cf67380b869e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/10/10/16/2D45366A00000578-0-image-a-111_1444490773868.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/article-3267646/It-s-heaven-high-seas-Sailing-style-Caribbean-s-dreamy-coves-private-yacht.html", "country": "GB", "title": "It's heaven on the high seas: Sailing in style through the Caribbean's dreamy coves by private yacht", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "It's heaven on the high seas: Sailing in style through the Caribbean's dreamy coves by private yacht | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:13:00.000+03:00", "replies_count": 1, "uuid": "bca478bddfbe2501a19a0658d40807e0dbf0bb9d"}, "author": "Helen Atkinson Wood For Mail On Sunday", "url": "http://www.dailymail.co.uk/travel/article-3267646/It-s-heaven-high-seas-Sailing-style-Caribbean-s-dreamy-coves-private-yacht.html#post-0", "ord_in_thread": 0, "title": "It's heaven on the high seas: Sailing in style through the Caribbean's dreamy coves by private yacht", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "28 shares 1\nView\ncomments\nWho doesn’t daydream about sailing on their own private yacht to the most secluded coves in the Caribbean?\nBut cruising? In my mind, cruising was the preserve of a senior generation who enjoyed being transported in their thousands in a floating block of flats to a number of different tourist hotspots.\nAnd that image stayed with me until the elegant four-masted motor yacht Windstar came over the horizon and into view.\nSailling in style: The 440ft motor yacht Windstar takes a tour of Barbados, St Lucia, Grenada and St Vincent\nBefore joining the Windstar, my mother and I spent the night in Barbados – to acclimatise to the Caribbean, you understand. Just 20 minutes from the port of Bridgetown – home to luxury liners and international cruise companies – sits Crystal Cove, a perfect hotel hideaway.\nSuites with spacious patios cluster around exotic gardens, pools and a swim-up cocktail bar beneath a cascading waterfall.\nCrystal Cove is much favoured by return visitors, and I can see why. After a refreshing dip in the aqua-blue sea, a couple of pina colada cocktails and a dinner of fresh snapper, we began to feel human again after the long-haul flight from London.\n Half-term heaven: Children will love every action-packed... Sleep on a budget, enjoy the bustling nightlife and indulge... Here's why it's called the British ISLES: The little known... Stunning architecture... and the cocktails are... 28 shares At Bridgetown harbour there are boats, there are ships – and then there’s the Windstar. Now I don’t know my port from my starboard, but I do know that the reason this 440ft motor yacht is breathtaking is quite simply her sails. Step aboard and you feel that you’re in a different era, a feeling confirmed by sight of the splendid teak decking.\nAfter exploring the sumptuous cabin that would be our home for the next week, we joined the other passengers on deck as we sailed away to Vangelis’s theme tune to the film 1492: Conquest Of Paradise. The particular paradise we were setting sail to conquer came in the form of the Windward Islands – St Lucia, Grenada and St Vincent.\nTo be gently rocked to sleep each evening by the waves and wake up at a new island each morning feels more like time-travelling than cruising. And not knowing what sight is going to greet you as you throw back the curtains is incredibly exciting.\nTo work up an appetite before breakfast, we could take yoga or pilates classes, or else take a brisk walk on deck.\nOne day we dropped anchor at Pigeon Island before a tender swept us across to this verdant national park. We clambered up Signal Hill, which provides stunning views across to Martinique, before treating ourselves to an ice-cold beer and kingfish roti.\nHelen Atkinson Wood and her mother with a fruitseller while on an excursion from the Windstar Cruise\nNext we headed for the spectacular Spice Island of Grenada, where we could participate in anything from scuba-diving to river-tubing, and golf to sampling rum.\nOn another occasion, the Windstar crew swept us up from Princess Margaret Beach in tiny Bequia. It was at times like this that we really did feel like royalty returning to our own private yacht. The fact that the 99 guests on board were attended to by a discreet yet congenial crew of 99 might have had something to do with that. Exemplary service and comfort are one thing but the intimacy was what made this trip so special.\nExecutive chef Budhi Thakur runs a tight ship in the galley, and to savour the vast array of gastronomic masterpieces that he and his team of ten chefs manage to produce from the tiny kitchen is incredible. Windstar? This vessel could easily be renamed Michelin Star.\nI’ve always fancied the idea of running away to sea and now I’ve found the perfect place on which to have such an adventure. It’s got four masts, it’s gleaming white, it’s luxurious from stern to bow – and it’s called Windstar.\nTRAVEL FACTS Cruise Line offers a seven-night Caribbean cruise aboard Windstar from £2,469pp on a full-board basis. This includes return flights from London and transfers, departing December 17. cruiseline.co.uk 0800 008 6682\nCaribtours offers seven nights all-inclusive at Crystal Cove from £1,579pp, including return flights, transfers and use of a UK airport lounge. caribtours.co.uk 020 7751 0660\nRead more: Caribtours | Holidays to the Caribbean, Mexico, Indian Ocean & Arabia www.cruiseline.c...", "external_links": ["http://www.cruiseline.co.uk/", "http://dailym.ai/1LohLSj", "http://www.caribtours.co.uk/"], "published": "2015-10-11T05:13:00.000+03:00", "crawled": "2015-10-12T05:20:52.726+03:00", "highlightTitle": ""}