{"organizations": [], "uuid": "8579c9169652a9db853a3cd32c9750c101286e9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tripideas/how-to-have-the-sistine-chapel-all-to-yourself/ar-AAf7bBv", "country": "US", "title": "How to have the Sistine Chapel all to yourself", "performance_score": 0, "site": "msn.com", "participants_count": 16, "title_full": "How to have the Sistine Chapel all to yourself", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 16, "uuid": "8579c9169652a9db853a3cd32c9750c101286e9a"}, "author": "‘Clock kid’ and family will move to Qatar", "url": "http://www.msn.com/en-us/travel/tripideas/how-to-have-the-sistine-chapel-all-to-yourself/ar-AAf7bBv", "ord_in_thread": 0, "title": "How to have the Sistine Chapel all to yourself", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How to have the Sistine Chapel all to yourself Fodor's 10/5/2015 © Mircea Costina | Dreamstime.com The Creation of Adam\nThe Sistine Chapel is one of Rome’s greatest treasures—but having an enjoyable visit there is rare.\nSome six million visitors pass through the chapel each year to see Michelangelo’s breathtaking frescoes; at peak times of year, as many as 2,000 people are allowed inside the chapel at once. Being in the presence of so many others may cause you to have some less-than-holy thoughts about your fellow travellers; taking photographs and speaking are forbidden, though many visitors do both, as it’s impossible for a crowd of that size to be controlled.\nRegardless, every few minutes a guard will announce on a loudspeaker, “ Atenzione , no photos, please be silent,” which momentarily quiets the throng before the hubbub starts up again. Meanwhile, with everyone staring up at the ceiling, bumping into other people is inevitable as you walk around the chapel. The experience brings to mind a chicken coop: crowded, chaotic, and noisy—hardly ideal conditions for viewing some of the finest artwork from the Renaissance.\nThe situation isn’t likely to improve anytime soon. Travel to Rome has increased more than 13% since 2013, the year Pope Francis was elected, according to American Express Travel. Earlier this year, His Holiness announced the Jubilee (also known as a Holy Year) of Mercy, which will take place December 8, 2015–November 20, 2016. The last Jubilee, which took place in 2000, brought 25 million pilgrims to Rome; this Holy Year is expected to attract as many as 33 million, many of whom undoubtedly will be planning to see the Sistine Chapel.\nDon’t let the hordes deter you—there are several ways to improve your Sistine Chapel experience.\nFirst of all, you should never wait in the public line to enter the Vatican Museums, where the chapel is located; by booking tickets on the official website, you are allowed to skip the line, which can have a wait time of up to three hours. If you don’t book tickets in advance, you’ll find the shortest lines between 12pm and 2pm, or during a Papal Mass. Even when lines to enter are short or nonexistent, however, you’ll still find a sizeable crowd inside the Sistine Chapel.\nA second option is to book entry through a tour company, which will also allow you to skip the public line, use the dedicated tour-group entrance, and enter the Vatican Museums an hour before the general public is admitted at 9am. However, it’s important to note that more than 200 operators share this entrance, so unless you’re first in line, it’s possible that you will still have to wait for up to an hour depending on the time of day.\nFor a truly unforgettable experience, there is a third option, and this one is the best. There are only three companies designated as official Vatican Museums partners, and these operators are allowed to enter twenty minutes before non-partner tour groups, which is also 80 minutes before the general public enters the museums. One of the official partners is an Italian bus-tour operator, another is a luxury company that plans every aspect of your trip—neither of which is a feasible option if you aren’t visiting multiple cities in Italy or you don’t want to pay a high price tag.\nThe third operator, City Wonders, is perfect if you’re planning your own trip to Rome and don’t want to commit to anything more than early access to the chapel. (Founded in 2004, City Wonders is a well-respected tour operator with dozens of offerings in Rome and Vatican City, and many more in other parts of Italy as well as London and Paris.) Their Sistine Chapel Express tour (from $54.64 for adults, $49.06 for children) allows its small group of up to twenty people to be among the first to enter the Sistine Chapel when it opens around 8 am.\nOn a recent Saturday morning, I experienced this tour myself. We met at 7:30am outside the entrance and put on audio headsets that allowed our guide to speak to us through a microphone rather than shouting. By 7:40, my group (less than ten people) went through security and was the first to enter the museums. We took a shortcut and swiftly made our way to the entrance of the Sistine Chapel, dumbstruck by the fact that we were the only people wandering through the gorgeous halls and galleries. Shortly after 8am, we were permitted to enter, and as I walked into the completely empty chapel, there weren’t even guards present yet.\nWords can’t fully express the sense of wonder I felt. Only the day before, I’d made an afternoon visit to the chapel and found the crowds and noise so miserable that I could barely enjoy Michelangelo’s masterpieces. Now, in the company of just a handful of others, the complete silence allowed me to fully appreciate the majesty of the space and the artwork. Even when other groups started to trickle in, the experience wasn’t altered—it turned out that everyone who’d spent money and woken up early to beat the crowds was respectful of the chapel and its rules. It felt strange knowing that, perhaps only an hour later, the room would be crowded with tourists trying to secretly take selfies.\nThe guide may quietly discuss the history of the Sistine Chapel via the headsets, but I’d recommend reading up in advance and taking the headphones out so you can enjoy the silence. The Sistine Chapel Express tour does not include a guided tour of the rest of the Vatican Museums, but once you are finished in the chapel—and you are welcome to stay as long as you like—you’re free to independently explore everything else, which can easily fill the majority of a day. Considering that general admission to the Vatican Museums costs 16 euros (currently $17.90), which means the premium you pay for early access to the chapel is just over $36. That’s not peanuts, but it’s a small price to pay for experiencing one of the most beautiful man-made spaces in the world, essentially, by yourself.\n ", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-21T22:59:43.564+03:00", "highlightTitle": ""}