{"organizations": [], "uuid": "50adb03dd4f44908b533799e9f7f40bd69d3d962", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151015Rain2.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/10/14/how-to-beat-the-rainy-season-with-kids", "country": "US", "title": "How to beat the rainy season with kids", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "How to beat the rainy season with kids", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:00:00.000+03:00", "replies_count": 0, "uuid": "50adb03dd4f44908b533799e9f7f40bd69d3d962"}, "author": "Jill Replogle", "url": "http://www.ticotimes.net/2015/10/14/how-to-beat-the-rainy-season-with-kids", "ord_in_thread": 0, "title": "How to beat the rainy season with kids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cute kids rain gear? Check. Katherine Stanley/The Tico Times \nI come from dry places. I am relatively new at motherhood. I am relatively new to Costa Rica. Therefore, the first downpours to trap me — along with a husband, a 3-year-old and a newborn — inside our small San José apartment filled me with dread. How the expletive would I keep the kiddos happy and stay sane during six months of rain? \nNow, as huge drops pelt the rooftop above my head, I feel perfectly competent as a Green Season parent (although, I know, it’s been a pretty dry year). Here’s what I’ve learned, complemented by my much more experienced colleague, Katherine Stanley: \n1) If you’re bent on getting the kids outside, you must leave as early in the morning as possible. NO DALLYING! Ditto for any break in the rain that seems like it’ll last more than a few minutes. Go! Go! Go! \n2) Go somewhere, anywhere. Even a trip to the grocery store can be an adventure when the alternative is staying cooped up inside all day. If you’ve got the energy to venture further afield, however, there are lots of other places in the Central Valley calling your kids’ names, foremost among them the incredible Children’s Museum , where they could spend every rainy day (or, heck, every sunny day, too) and still not get bored. A quick, informal poll of some other Chepe parents yielded some other suggestions, as yet untested by our staff but inspiring-sounding such as Color Me Mine in Escazú or FossilLand in Desamparados. Is that a little too ambitious? Most any mall has an indoor playground, and the Outlet Mall in San Pedro features a particularly awesome two-story version. \n3) If you get stuck inside, you must make your kid expend energy. Otherwise it’s likely to come out in ways you’d rather it not. We hold lots of family dance parties in our tiny living room, in the kitchen, anywhere. And isn’t it time your kid brushed up on his/her participatory campfire songs? Youtube is full of them . I also make up mini obstacle courses for my 3-year-old: “Run around the table three times; Do 10 jumping jacks; Run and touch the fridge and then come back for a high five”. For more ideas, check out this gem of a listicle, “ 40 ways to entertain your child while lying down ” (especially #3: “What’s on my butt?”). \nThe ultimate hook to get kids to help with baking: licking the bowl. Jill Replogle/The Tico Times \n4) Bake. I love seeing my daughter improve in her egg-cracking abilities and remembering that baking is what I did with my mom on rainy days. In fact, if you’re from northern climes, like Katherine, she suggests this: Ride that nostalgia train all the way home by treating the rainy season the way you would winter, which, after all, is what the rainy season is called in Costa Rica. Drink hot chocolate. Snuggle, as your child’s age and temperament permits. Sprinkle pumpkin spice on stuff. Even decorate those Christmas cookies, because come Dec. 25, you might be too busy frolicking in the sunshine. Take a long nap to the sound of an aguacero , catch up on your reading as you sip hot tea, and enjoy a luxurious bubble bath with a glass of wine. (Oh, wait – we slipped into a fantasy world there for a minute. Sorry. We’re back.) \n5) If you can’t beat it, head out to play in the rain. Here, there are two options. Option A: suit ‘em up head to toe, including botas de hule , an essential part of any Costa Rican childhood, for splashing in muddy puddles (if your child doesn’t think that sounds fun, seek medical attention; alternatively, brainwash him or her with episodes of“Peppa Pig,” in which splashing in muddy puddles is the ultimate treat). Option B, which often follows Option A: Forget the raingear and put on a bathing suit. Get drenched. Laugh. Love it. \nFathers, mothers, grandparents, beloved aunts and uncles and babysitters: what are your tricks and escapes for the rainy season? Tell us! (Seriously – please tell us! #1-5 might not get us all the way through November.)", "external_links": [], "published": "2015-10-14T20:00:00.000+03:00", "crawled": "2015-10-14T20:06:39.891+03:00", "highlightTitle": ""}