{"organizations": [], "uuid": "13284f68fe77a6b4bdd40424c44353d74297e22d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelncampinginfo.com", "main_image": "http://www.travelncampinginfo.com/wp-content/uploads/2015/10/waiheke-island-luxury-accommodation-150x150.jpg", "site_section": "http://www.travelncampinginfo.com/feed", "section_title": "Travel N Camping Info - Travel and Camping Information, Tips and News", "url": "http://www.travelncampinginfo.com/top-5-hotels-for-waiheke-island-luxury-accommodation.html", "country": "US", "title": "Top 5 Hotels For Waiheke Island Luxury Accommodation", "performance_score": 0, "site": "travelncampinginfo.com", "participants_count": 1, "title_full": "Top 5 Hotels For Waiheke Island Luxury Accommodation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:50:00.000+03:00", "replies_count": 0, "uuid": "13284f68fe77a6b4bdd40424c44353d74297e22d"}, "author": "admin", "url": "http://www.travelncampinginfo.com/top-5-hotels-for-waiheke-island-luxury-accommodation.html", "ord_in_thread": 0, "title": "Top 5 Hotels For Waiheke Island Luxury Accommodation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home > Hotels & Resorts > Top 5 Hotels For Waiheke Island Luxury Accommodation Top 5 Hotels For Waiheke Island Luxury Accommodation By admin on October 21, 2015 Pin It \nHauraki Gulf is the location of Waiheke Island which is easily accessible by boat from Auckland. The luxury lodges, apartments and hotels at Waiheke Island help the visitors to feel pampered and relaxed during their visit to the island. \nMany tourists consider Waiheke Island as one of the most magical parts of the wonderful experience of visiting Auckland. Waiheke Island luxury accommodation is basically popular for weddings, holidays, reunions, parties, honeymoons, romantic getaways and conferences as well. Top Waiheke Island Luxury Accommodation \nSome of the most popular hotels for Waiheke Island luxury accommodation are as follows: Delamore Lodge \nThis is a luxurious resort which is considered a jewel adorning the stunning beauty of Auckland. It is an exclusive and elegant lodge which has been meticulously designed in the shape of Maori fish hook called matau. This luxury resort at Waiheke Island offers breathtaking island and sea views. \nFor accommodation and other information: Delamore Lodge The Boatshed \nThe Boatshed is all about luxury suites, impressive facilities, panoramic ocean views and completely private relaxation. A stay at this hotel is one of the best ways of making the most out of your visit to Waiheke Island. The hotel boasts of beautiful design, local surrounds, art and architecture. \nFor booking and other information: The Boatshed Owhanake Bay Estate \nThis is a luxury accommodation in Waiheke Island offering the scope of a perfect retreat to its visitors. This boutique accommodation overlooks the wonderful and the peaceful Owhanake Bay in New Zealand. A stay at this luxury accommodation is one of the best ways of escaping the busy city life. \nFor booking and other information: Owhanake Bay Estate The Oyster Inn \nThe Oyster Inn is one of the hotels for Waiheke Island luxury accommodation, which is located in Oneroa. You will have to take a 35 minutes beautiful ferry ride from Auckland to reach this hotel. You can enjoy the tasty food along with beautiful view of ocean from verandah restaurants. \nFor accommodation and other information: The Oyster Inn Seadream \nSeadream luxury accommodation is perfectly sited at Oneroa Bay and is surrounded by the beach, restaurants, cafes and walkways. There are two holiday apartments at this hotel which is conveniently located offering quiet comfort. \nFor booking and other information: Seadream", "external_links": [], "published": "2015-10-21T17:50:00.000+03:00", "crawled": "2015-10-21T18:41:22.339+03:00", "highlightTitle": ""}