{"organizations": [], "uuid": "8a078d015c64900c173b8390403a98be46327f11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailyexaminer.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/10/19/scn181015gay-o9r4wq67eiuh5h5q1l2_fct632x474x71.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/DailyexaminercomauTravel", "section_title": "dailyexaminer.com.au: Travel", "url": "http://www.dailyexaminer.com.au/news/gay-visitors-are-welcome/2810732/", "country": "AU", "title": "Push to ensure gay visitors are welcome on the Coast", "performance_score": 0, "site": "dailyexaminer.com.au", "participants_count": 0, "title_full": "Push to ensure gay visitors are welcome on the Coast", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T16:00:00.000+03:00", "replies_count": 0, "uuid": "8a078d015c64900c173b8390403a98be46327f11"}, "author": "", "url": "http://www.dailyexaminer.com.au/news/gay-visitors-are-welcome/2810732/", "ord_in_thread": 0, "title": "Push to ensure gay visitors are welcome on the Coast", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Push to ensure gay visitors are welcome on the Coast Stuart Cumming | 19th Oct 2015 6:00 AM Stuart Cumming Reporter Stuart studied journalism at the University of Southern Queensland in Toowoomba. He worked briefly at Central Queensland News and Warwick Daily News. He has worked as a reporter at The Chronicle since July 2009.   Coast's reputation as a gay-welcoming community has been shown off to gay and lesbian tourism professionals from around Australia. \nGay and Lesbian Tourism Australia members held their annual general meeting in Noosa at the weekend and toured hinterland accommodation houses to get a wider understanding of the region's attractions. \nOrganisation president and owner of Horizons at Peregian resort Rod Stringer said tourism operators at Noosa tended to recognise the benefit of marketing towards the gay and lesbian market but he encouraged more to get involved. \n\"We just like to make the local industry here aware that it is a good market,\" Mr Stringer said. In Maleny are Louise Terry, Ben Elder, Gerry Bourke, Mel Patterson-Gray, Rod Stringer, Vincent Cooper, Mario Paez, Mark Peterswald, Dean Rallison , David Collishaw, Dennis Basham, Brett Max and Kat Patterson-Gray. \nHe had no definitive figures on how much gay and lesbian tourism market was worth but referenced anecdotal evidence that in the United States, it was thought to be a $100 billion industry. \n\"Gay people seem to travel more than anybody else,\" he said. \nMr Stringer said some tourism operators' bookings had already doubled around the first week of March next year, coinciding with the build up to and completion of the Sydney Gay and Lesbian Mardi Gras. He said about 150 accommodation properties and tourism businesses were affiliated with Gay and Lesbian Tourism Australia. \nThe members who were able to attend the weekend's events cruised the Noosa River and visited bed and breakfasts in the hinterland. \nIt was the first time the annual general meeting had been held in Noosa. \nMr Stringer said being a gay-welcoming accommodation provider could be as simple as telling couples not to be afraid to ask for a hotel room with a double bed. \nGay and Lesbian Tourism Australia Victoria director Vincent Cooper enjoyed his busy weekend schedule. \n\"We jammed a lot in but it was a really successful day,\" Mr Cooper said. \nHe said gay and lesbian travellers essentially sought out value-for-money and quality products. \nHis experiences of marketing gay and lesbian tourism destinations in his home state were that Noosa and Cairns were particularly popular attractions. \n\"It is already well-established,\" he said. \n\"Pre- and post-mardi gras, the Sunshine Coast is a popular destination.\" \nHe was pleased with the atmosphere of the Sunshine Coast. \n\"There is a more welcoming feel and you can feel that when you walk up Hastings St.\" \nTourism Noosa marketing manager Louise Terry said Noosa had a strong participation and membership with Gay and Lesbian Tourism Australia. \nShe said it made sense for Tourism Noosa to host the national organisation's annual meeting. \n\"It's a great was to showcase our destination.\" gay visitors", "external_links": [], "published": "2015-10-18T16:00:00.000+03:00", "crawled": "2015-10-19T16:13:51.596+03:00", "highlightTitle": ""}