{"organizations": [], "uuid": "6a31940cc2d3a0379cf289f7f219b8f1e1520924", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/d/4/u/x/image.related.StuffLandscapeSixteenByNine.620x349.17d4pl.png/1444274967607.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/budget/72836121/Eight-things-you-should-ask-for-on-your-next-flight", "country": "AU", "title": "Eight things you should ask for on your next flight", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Eight things you should ask for on your next flight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:29:00.000+03:00", "replies_count": 0, "uuid": "6a31940cc2d3a0379cf289f7f219b8f1e1520924"}, "author": "TALIA AVAKIAN", "url": "http://www.stuff.co.nz/travel/themes/budget/72836121/Eight-things-you-should-ask-for-on-your-next-flight", "ord_in_thread": 0, "title": "Eight things you should ask for on your next flight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eight things you should ask for on your next flight TALIA AVAKIAN Last updated 16:29, October 8 2015 Business Insider/Flickr/Erik Charlton \nDespite tight security rules, passengers can still ask for a tour of the cockpit. \nThey say there's no such thing as a stupid question, and this rings especially true on flights, which feature a variety of free items passengers can snag, as long as they know to ask. \nA Reddit thread recently asked flight attendants about secret perks passengers should be taking advantage of on flights. We consulted that thread and did some of our own research to create the following list. \nFrom free alcoholic drinks to ibuprofen, here are 8 things you should ask for on your next flight. \nWhy have a tiny cup when you can have the whole can? Image: Flickr/frankieleon \nTHE WHOLE CAN OF FIZZY-DRINK \nFlight attendants are stingy with soda, generally only doling out half of a can, which, combined with the quantity of ice they dispense, simply isn't enough to quench our thirst. So next time,order a whole can. Flight attendants are happy to oblige, or, if they have run out of cans, happy to return to refill your cup. \nBASIC MEDICATION AND BANDAGES \nWhile it depends on the airline's regulations, most flights are equipped with basic medications like painkillers and antacids, as well as band-aids. These are free if you ask. \nHot chocolate is often served on flights. Image: Flickr/macinate \nHOT CHOCOLATE Ad Feedback \nAs an alternative to coffee or tea, most airlines also offer hot chocolate. Etihad Airways, Virgin Atlantic, and Southwest Airlines are just some of the airlines that offer hot chocolate in Economy. Qantas even has hot chocolate made with Cadbury chocolates to satisfy your sweet tooth. \nFREE ALCOHOL \nSince airlines are basically charging passengers for everything these days, most assume this applies to alcoholic beverages as well. However, many airlines do still offer free booze. \nAlaska Airlines for example serves free beers on some of its routes; US Airways gives out free wine with dinner on international flights; Delta offers complimentary wine, beer, and spirits on international flights; and Lufthansa has a whole menu of complimentary alcoholic beverages on all of its flights. Typically, this tends to be the case with long-haul and international flights. \nEmirates has free grooming kits that include shaving items. Flickr/Gary Bembridge \nGROOMING KITS \nOn longer flights, some airlines tend to stock items like earplugs, pens, combs, and playing cards that they're happy to give away. Emirates even has free grooming kits that include shaving items, toothbrushes, socks, and playing cards. \nEXTRA SNACKS \nThe complimentary snacks offered on flights are tiny and often leave you hungry. Simply ask for seconds — if there are leftovers after all customers have been served, flight attendants will happily give you an extra snack. \nA TOUR OF THE COCKPIT \nSecurity measures regulating tours of the cockpit have become stricter, but many airlines will still do it. The best time to ask is usually after a flight has landed, since that's when pilots aren't in a rush. \nThe tray has been proven to be the dirtiest part of a plane. Shutterstock/Vedmed85 \nSANITISING WIPES \nAeroplanes are dirty and carry a lot of germs, which is why you want to wipe down surfaces like the tray table in order to avoid getting a cold. If you forget to pack your own sanitising wipes, ask a flight attendant since they usually have them on hand. \nREAD MORE:", "external_links": [], "published": "2015-10-08T06:29:00.000+03:00", "crawled": "2015-10-09T02:47:11.399+03:00", "highlightTitle": ""}