{"organizations": [], "uuid": "a4924b1af8ee1a8b75c95715ad5895edc8635a67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://www.marketwire.com/library/MwGo/2015/10/8/11G066810/GPJ-681824903339.jpg", "site_section": "http://www.marketwire.com/rss/mwTravelandHospitality.xml", "section_title": "Marketwired - Travel and Hospitality", "url": "http://www.marketwired.com/press-release/george-p-johnson-experience-marketing-acquires-pulse220-2062412.htm", "country": "CA", "title": "George P. Johnson Experience Marketing Acquires pulse220", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "George P. Johnson Experience Marketing Acquires pulse220", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:15:00.000+03:00", "replies_count": 0, "uuid": "a4924b1af8ee1a8b75c95715ad5895edc8635a67"}, "author": "", "url": "http://www.marketwired.com/press-release/george-p-johnson-experience-marketing-acquires-pulse220-2062412.htm", "ord_in_thread": 0, "title": "George P. Johnson Experience Marketing Acquires pulse220", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["George P. Johnson"], "text": "October 08, 2015 09:15 ET George P. Johnson Experience Marketing Acquires pulse220 \nDETROIT, MI --(Marketwired - October 08, 2015) - Project: WorldWide-owned George P. Johnson Experience Marketing (GPJ), the world's leading experiential agency, announced today its acquisition of Michigan-based experiential agency, pulse220. Established in 1987 and based outside of Detroit in Ferndale, MI, pulse220 is well known for its work in producing business meetings and hospitality events as well as large-scale activations for brands including Gatorade, Ally Bank, PepsiCo, and Quicken Loans. The entire management team and staff of pulse220 will be joining GPJ. \"pulse220's stellar reputation for creating extraordinary brand experiences fits seamlessly with GPJ's long history of innovation, creativity and flawless delivery,\" said Chris Meyer, CEO of GPJ. \"We were immediately attracted to both the agency's approach to leadership, and to its vibrant culture. pulse220 has had excellent momentum over the past few years growing its robust client roster.\" \npulse220's CEO, Craig Erlich, a highly respected executive in experiential marketing, will join GPJ as SVP and General Manager of GPJ's headquarters in Auburn Hills, MI. Erlich will also oversee the company's Nashville, TN facility, where the company's fabrication and graphics capabilities are housed, and he will lead GPJ's growth strategy in both markets. \"I could not be more excited to join GPJ. My team and I have long admired the agency's work and are truly excited to be joining what is clearly the most innovative group of strategists, creative talent, and producers in the industry,\" said Erlich. \"Combining our team's expertise with the worldwide presence of GPJ means we're set to shine on a much bigger stage. The pulse220 team is relishing the opportunity to get started.\" The influx of fresh talent will supplement GPJ's award-winning work across the globe, and will provide existing GPJ clients with some new perspectives and approaches. pulse220's clients will also benefit from GPJ's industry-leading logistics, fabrication and buying power. \"The growth of experiential as a percentage of the overall marketing mix cannot be denied,\" said Meyer. \"pulse220 will help enable us to accelerate our growth and further shore up our position as the leader in this category. Their reputation is stellar and we're sure there's going to be a demonstrable uptick in innovation and the level of client service we provide as a result.\" \nAbout George P. Johnson Experience Marketing GPJ is the world's #1 ranked experiential marketing agency. It enables leading brand marketers to benefit from integrated experiential programs that leverage online, mobile and physical brand interactions. Clients in technology, healthcare, consumer goods, finance and other fields rely on GPJ to help them compete more effectively on a global basis by creating and accelerating relationships with customers, employees, partners, media and other influencers. GPJ is part of Project: WorldWide, the leading independent engagement marketing solutions network ( www.project.com ). www.gpj.com Contact Information", "external_links": [], "published": "2015-10-08T16:15:00.000+03:00", "crawled": "2015-10-08T17:33:39.612+03:00", "highlightTitle": ""}