{"organizations": [], "uuid": "cd951917e857092b4a9159970f5ec182612a9353", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03467/Road-trip-songs_3467652k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11919997/best-road-trip-songs.html", "country": "US", "title": "Music for driving: The 12 greatest road trip songs of all time", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Music for driving: The 12 greatest road trip songs of all time - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:36:00.000+03:00", "replies_count": 0, "uuid": "cd951917e857092b4a9159970f5ec182612a9353"}, "author": "Andrew Woods", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11919997/best-road-trip-songs.html", "ord_in_thread": 0, "title": "Music for driving: The 12 greatest road trip songs of all time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The right music for a road trip is essential. The entire journey can live or die by the quality of its tunes. After all, very few road movies feature a soundtrack of talk radio. So a few classic car tunes will ensure your journey will live long in the memory. Here are a few travel-inspired gems that get our playlists primed for that open road… 1. Dodgy - Staying Out For The Summer A real summer VW camper anthem this, as you head out for a few precious days away from the grind. A joyful anthem to being shackle-free, sure to set the tone of the trip. 2. Prince - Little Red Corvette “I guess I should have known, By the way you parked your car sideways, That it wouldn't last” Not so much a song about the thrill of driving as a lament to someone’s parking ability (as well as a metaphor for sex and promiscuity) – but it’s still a road trip classic that gets the whole car singing along. 3. Steppenwolf - Born To Be Wild “Get your motor runnin’, Head out on the highway, Lookin’ for adventure, And whatever comes our way” Merely reading the words to this is enough to make you throw a rucksack into the back seat and head off into the unknown with zero warning. A thrusting anthem of the road that doesn’t so much suggest a trip, as demand it. 4. ZZ Top - Gimme All Your Lovin’ Not a song about driving at all, but the screeching guitars do make you feel like you’re standing trackside at Nascar. A hit single from the album Eliminator (named after the band’s fêted hot rod), Gimme All Your Lovin’ reeks of petrol and burnt rubber. 5. Bruce Springsteen - Born To Run “In the day we sweat it out on the streets of a runaway American dream, At night we ride through the mansions of glory in suicide machines” Although we’d never condone the driving of suicide machines, Born To Run is still the finest of the Boss’s many trips following that white line into who knows where. The key change alone is worth the price of admission. 6. AC/DC - Highway To Hell Hopefully you haven’t set your satnav for the eternal bonfire and your destination is somewhere a little less foreboding. A hard rock classic that requires that the elbow pokes out of an open window as you tap the car roof, Highway To Hell makes 65mph in the middle lane feel like 110 mph on a desert track. 7. Guns N’ Roses - Paradise City A song that’s more excited about the destination than it is about getting there. Whether your journey ends up anywhere quite so green of grass and fair of face, this will it at least get there in a buoyant mood. 8. Duane Eddy - Peter Gunn A cover of Henry Mancini’s theme tune for the Fifties cop show of the same name, this has all the driving beat of a night-time cruise around a big city. 9. Simon and Garfunkel - America Inspired by a five-day road trip Paul Simon spent with an ex-girlfriend, America is a series of snapshots and a dialogue on both the loneliness and the companionship of travel. “Cathy, I'm lost, I said, though I knew she was sleeping, I'm empty and I'm aching and I don't know why, Countin' the cars on the New Jersey turnpike, They've all come to look for America.” Nice one for slowing things down a little. 10. Kraftwerk - Autobahn “We’re driving, driving, driving, on the autobahn” Hardly a song to get the wind in your hair, so to speak, Autobahn is a 22-minute electronic celebration of car horns and traffic noise and is the ultimate homage to life on the motorway. 11. Jimi Hendrix Crosstown Traffic Not every minute of your journey will be chasing the horizon, so how about a song that makes gridlock exciting. Crosstown Traffic, with its screeching, pulsing riffs, is the theme tune for the greatest cop show never made and gets those hairs on the back your neck moving like the nodding dog on your dash. 12. The Doors - Moonlight Drive “Let's swim out tonight, love, It's our turn to try, Parked beside the ocean, On our moonlight drive” Once you’re nearing your destination, you’re going to want to slow things down a little and this is as sumptuous as parking-up gets, whether you’re in Venice Beach, Southern California or Hastings. Smooooth. With the AA on your side, you can relax and focus on the music whilst they focus on the music. Find out more at theaa.com", "external_links": [], "published": "2015-10-09T22:36:00.000+03:00", "crawled": "2015-10-09T18:36:32.085+03:00", "highlightTitle": ""}