{"organizations": [], "uuid": "7accd9a475bc5337d5fe3b7ba14b61c14406a7c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30217728/strategic-analysis-of-the-north-american-class-4-8-select-original-equipment-wheel-end-components-market-reportlinker-review", "country": "US", "title": "Strategic Analysis of the North American Class 4-8 Select Original Equipment Wheel-end Components Market - Reportlinker Review", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Strategic Analysis of the North American Class 4-8 Select Original Equipment Wheel-end Components Market - Reportlinker Review - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7accd9a475bc5337d5fe3b7ba14b61c14406a7c8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30217728/strategic-analysis-of-the-north-american-class-4-8-select-original-equipment-wheel-end-components-market-reportlinker-review", "ord_in_thread": 0, "title": "Strategic Analysis of the North American Class 4-8 Select Original Equipment Wheel-end Components Market - Reportlinker Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Reportlinker\nNEW YORK , Oct. 8, Strategic Analysis of the North American Class 4–8 Select Original Equipment Wheel-end Components Market : Unit Shipments to Experience a 2.2% CAGR Decline from 2014 to 2022\nThis research service analyzes the North American market for select original equipment wheel-end components (drum brakes, slack adjusters, and hubs) for Class 4 to 8 (medium- and heavy-duty) trucks. It assesses market dynamics, including drivers and restraints, and provides unit shipment and revenue forecasts. The study examines original equipment manufacturer influencers on supplier selection, and breaks down expected truck production volumes by class through 2022. It includes insights about the current and future competitive environment, as well as profiles of leading market participants. The base year is 2014; the forecast period is from 2015 to 2022.\nSummary of Key Findings\nMarket Size 2014–2022\nTotal market size for wheel-end components was estimated to be million units, generating $ million in revenue, in 2014. In 2022, the market is expected to decline to million units with revenue of $ million.\nPricing\nTier I suppliers are facing pricing pressures from consumers who are increasingly demanding low-cost options (which are typically $ to $ less) for wheel-end components as total cost of ownership (TCO) concerns continue to mount.\nCompetition\nThe original equipment (OE) wheel-end components market is mature with intense domestic and foreign competition. A value components market has opened in North America and has the potential to disrupt the market.\nTechnology\nAir disc brake (ADB) technology is expected to experience moderate growth, contributing to the decline in drum brake shipments. In the class 8 segment, however, drum brakes will remain the primary choice at an % penetration rate in 2022.\nKey Questions this Study Will Answer\n-What is the growth outlook for class 4-8 commercial vehicles?\n-What are the current and expected price ranges, unit shipments, and market revenue for each component?\n-How will the installed base of drum and disc brakes shift by the end of the forecast period?\n-What is the competitive environment?\n-What current and future strategies will foster growth for market participants?\nRead the full report: http://www.reportlinker.com/p03313092-summary/view-report.html\nAbout Reportlinker\nReportLinker is an award-winning market research solution. Reportlinker reviews, finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.\nhttp://www.reportlinker.com", "external_links": ["http://www.reportlinker.com/", "http://www.reportlinker.com/p03313092-summary/view-report.html"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:56:44.353+03:00", "highlightTitle": ""}