{"organizations": ["AirwheelM3 Electric Skateboard for Teenagers Introduction to AirwheelM3 Electric Skateboard for Teenagers Airwheel M3"], "uuid": "3f45f3c010c69343da922acf0a0207796b67b930", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/introduction_to_airwheelm3_electric_skateboard_for_teenagers/", "country": "US", "title": "Introduction to AirwheelM3 Electric Skateboard for Teenagers", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Introduction to AirwheelM3 Electric Skateboard for Teenagers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:27:00.000+03:00", "replies_count": 0, "uuid": "3f45f3c010c69343da922acf0a0207796b67b930"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/introduction_to_airwheelm3_electric_skateboard_for_teenagers/", "ord_in_thread": 0, "title": "Introduction to AirwheelM3 Electric Skateboard for Teenagers", "locations": ["M3"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Spiderman"], "text": "Introduction to AirwheelM3 Electric Skateboard for Teenagers Airwheel M3 is a wireless remote control skateboard. The board of Airwheel motorized skateboard M3 is exquisitely handmade. Airwheel provides the buyers of electric skateboard. usa, 20 October 2015 -- At the end of last month, Airwheel pushed out a model of electric skateboards called M3 in its new product conference. Amongst the roll-outs of the its new product conference, Airwheel M3 showed its own features to good advantage and came under limelight soon. Hereby some high performances will be delved into. Airwheel M3 is a wireless remote control skateboard. Compared with other models like the single-wheeled scooter, the twin-wheeled intelligent scooter and the two-wheeled self-balancing scooter , M3 differs both in the exterior structure and design and the inner elements. Tyre Airwheel wireless remote control skateboard M3 adopts the tyres wider than other models. The 4.5 ins. threaded wide tyres offer a strong grip when electric skateboard M3 whizz about. Even if M3 zooms about at a high speed, the rider still can activate the brake system to stop in no time. When M3 travel on the slippery path, the strong grip brought by the wide tyres is much of help to prevent slip-up. Handmade design The board of Airwheel motorized skateboard M3 is exquisitely handmade. The beautifully engineered bodywork appeals to the young. Plus the handmade mixture embodies the air of fashion. Airwheel has been in pursuit of minimalistic chic. The effort to pursue is also mirrored in M3. In M3, there is no unneeded design and accessories. Each part in M3 is essentials and M3 cannot go without any one of them. Colourful and dashing sticker Airwheel provides the buyers of electric skateboard with a variety of colourful stickers used on the board. The stickers contains many theme like Spiderman and the patters of scary human skeleton. These fashionable themes cater to the young, who are fond of vogue, trend and novelty. Colourful and stylish stickers give them more options to express or manifest their characters. The above performances are just a small part of Airwheel M3. Of course, there are still more advantages and features appealing to the scooter-lovers and the masses. If interested, welcome to visit its website. # # #", "external_links": [], "published": "2015-10-20T00:27:00.000+03:00", "crawled": "2015-10-20T08:36:39.500+03:00", "highlightTitle": ""}