{"organizations": [], "uuid": "bdafced369b281b93504d12aa85ed7c5dfe801af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "activeplanettravels.com", "main_image": "", "site_section": "http://activeplanettravels.com/feed", "section_title": "Active Planet Travels |outdoor adventure travel |overseas adventure tours", "url": "http://activeplanettravels.com/work-vs-vacation-the-fading-boundaries/", "country": "US", "title": "Work vs Vacation: The Fading Boundaries", "performance_score": 0, "site": "activeplanettravels.com", "participants_count": 1, "title_full": "Work vs Vacation: The Fading Boundaries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:38:00.000+03:00", "replies_count": 0, "uuid": "bdafced369b281b93504d12aa85ed7c5dfe801af"}, "author": "Ronald Robbins", "url": "http://activeplanettravels.com/work-vs-vacation-the-fading-boundaries/", "ord_in_thread": 0, "title": "Work vs Vacation: The Fading Boundaries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  20, 2015 - 10:38 am | Travel Blog 0 Flares 0 Flares × With the growing trend of self-employed, digital nomads all around the world, the term “workation” is swiftly becoming an everyday term on the average joe’s palate. The “work vs. vacation” mentality is quickly fading as you get individuals such as travel bloggers and other entrepreneurs blending it all and creating a new lifestyle – leading to a new world of adventures. But what about those people who still work a regular “9 to 5” job? How do you differentiate this old school mentality to a new, innovative “workation” mindset? Whether you choose to take your workation at a chain of business hotels with great leisure facilities vs a hostel, in my personal opinion, it all comes down to your frame of mind and the way you view your current lifestyle. For instance, if you were to look at Pullman’s Global Nomad Campaign, it directly aligns with the mindset of a having a workation 24/7. By creating this kind of mindset, you can easily turn your new world into a playground of possibilities – hints, the whole point of a lifestyle revolved around a permanent workation. Blending the “Workation” Lifestyle… Prior to becoming a full-time digital nomad , like most people, I struggled with the idea of both working and being on vacation at the same time. And as any entrepreneur can relate, what came even more as a challenge was the discipline it took to accomplish what I needed to accomplish on a day-to-day basis to achieve my goals. However, this lifestyle was something that truly intrigued me and I set out to ensure this was the kind of life I truly wanted to achieve. Four years of hard work later accompanied by blood, sweat, and a lot of frustrated tears, Active Planet Travels finally took footing and created an outlet for the lifestyle I have today. But what I’ve found that helped me most during this time, was something I didn’t realize I was doing all along: living the workation lifestyle. The Fading Boundaries But, as you can imagine, it takes a little bit of time to find the balance of work and play. What I find works for me most is dedicating a specific time every day to have a mini “vacation”. This is the time when I put work on hold, no matter what, and enjoy the life that is around me. This can include anything from taking 1-2 hours a day for an excursion all the way to 4-5 hours for an all out getaway apart from the computer screen. Doing this allows me time to go on a hike , arrange time for a day sail , or even simply go to the nearest cafe for a cup of joe. You’d be surprised at how even changing the location of your office can make a huge difference in your life. All in all, the workation mindset is something I’ve learned to truly appreciate (and practice) 7 days a week as it lowers my stress levels and helps my productivity in front of the computer get much better over time. With enough practice, it comes naturally to you and honestly helps turn back the clock, relieving stress levels, and enjoying your life just that much more. What do you need to change in your life to start having a permanent “workation” mindset? You May Also Like:", "external_links": [], "published": "2015-10-20T19:38:00.000+03:00", "crawled": "2015-10-20T22:02:21.246+03:00", "highlightTitle": ""}