{"organizations": [], "uuid": "e6e6fb0b764d97522676ef6e83c064c015efe863", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/65192/un-official-funding-shortages-could-be-disastrous-food-insecure-", "country": "US", "title": "UN official: Funding shortages could be disastrous for food-insecure Mauritania", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "UN official: Funding shortages could be disastrous for food-insecure Mauritania", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T21:05:00.000+03:00", "replies_count": 0, "uuid": "e6e6fb0b764d97522676ef6e83c064c015efe863"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/65192/un-official-funding-shortages-could-be-disastrous-food-insecure-", "ord_in_thread": 0, "title": "UN official: Funding shortages could be disastrous for food-insecure Mauritania", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click here for information and nomination UN official: Funding shortages could be disastrous for food-insecure Mauritania \nNEW YORK, NY - On her two-day visit to Mauritania, Ertharin Cousin, the Executive Director of the World Food Program (WFP), saw at first hand the challenges faced by nearly 1 million food insecure people amid rising malnutrition in the country. \n“Mauritania has borne the brunt of recurring food crises, chronic malnutrition and instability spilling over from neighbouring Mali,” said Ms. Cousin in a press statement issued by WFP from Mauritania's capital, Nouakchott. \n“We are especially concerned about the serious malnutrition situation affecting 14 percent of Mauritania's children under five,” she added. \nAt present, WFP's funding needs are met only by half and it reports a shortage of $11 million to respond to urgent and immediate needs. \nMs. Cousin warned that a shortage of funding could have drastic consequences for vulnerable Mauritanians and Malian refugees. Indeed, with security in northern Mali still precarious, the agency notes that nearly 50,000 refugees need humanitarian assistance to meet their food needs. \nThe shortage in funding has led to refugees receiving reduced food rations at times that meet only about half their nutritional needs. \n“We know that the resources of donor countries are stretched by so many emergencies around the world, but WFP is committed to continue to provide vital food and nutrition assistance to all Malian refugees and more than half a million Mauritanian in the grips of food insecurity and malnutrition,” she said. \nOn her visit, Ms. Cousin traveled to Mbera refugee camp and neighbouring host communities in southern Mauritania, on the border with Mali and met with refugees, women at a community centre, and children at a school in the camp. \nShe also met with mothers and malnourished children at a local health centre and held meetings with authorities, donor community and WFP staff and UN partners. \nWFP also said that it is preparing to provide nutritious, hot meals to more than 150,000 children across the country once schools resume. But with insufficient resources, the agency reports that it can only provide for two months of its 2015-2016 school meal program. \nAccording to the UN agency, one in four people are food-insecure in Mauritania, meaning they do not have enough food to eat to lead healthy lives. \nOf these, more than 200,000 people are severely food insecure and need immediate, life-saving assistance. Female-headed families are the most affected. \nThe agency is working closely with the Government of Mauritania and its partners to meet immediate needs while promoting sustainable long-term development through resilience building and social protection programs. Ertharin Cousin, the Executive Director of the World Food Program Oct 24, 2015", "external_links": [], "published": "2015-10-24T21:05:00.000+03:00", "crawled": "2015-10-24T23:56:42.468+03:00", "highlightTitle": ""}