{"organizations": [], "uuid": "329913ed39addb2be455fd53531cb700bb18a027", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/29357-moving-venue-cater-for-the-man-booker-prize-2015", "country": "US", "title": "Moving Venue cater for the Man Booker Prize 2015", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Moving Venue cater for the Man Booker Prize 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:15:00.000+03:00", "replies_count": 0, "uuid": "329913ed39addb2be455fd53531cb700bb18a027"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/29357-moving-venue-cater-for-the-man-booker-prize-2015", "ord_in_thread": 0, "title": "Moving Venue cater for the Man Booker Prize 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moving Venue cater for the Man Booker Prize 2015 Moving Venue cater for the Man Booker Prize 2015 Details Category: Agency & Association Created on Thursday, 15 October 2015 10:15 On Tuesday 13th October 2015 Moving Venue by Smart, an event caterer specialising in heritage and landmark venues, returned to London’s Guildhall to cater for the Man Booker Prize 2015. Appointed for the third consecutive year, Moving Venue provided a sparkling Champagne canapé reception and an elegant dinner for the evening. The event was attended by over 500 high-profile literary figures and media. \nMoving Venue created a menu reflecting the robust flavours of autumn. Included in the menu was a cheddar panna cotta with a deep fried quail egg, celeriac espuma, and wild rice crispies; pan fried Aberdeen Angus beef fillet, potato rosti, butternut squash puree, wild mushroom and Swiss chard galette. Dessert was a seasonal orange carpaccio and blood orange parfait with cardamom almond brittle and honey roasted fig. The Man Booker Prize is widely regarded as the most important literary award in the English-speaking world bringing together some of the world’s most famous writers for a star-studded evening, honouring fiction’s best of the best. The evening was attended by HRH the Duchess of Cornwall, who presented the Man Booker Prize 2015 to Marlon James, for his novel A Brief History of Seven Killings. Gail Heron, Sales and Marketing Director at Moving Venue commented, “We were very proud to be the catering partner once again for this prestigious night in the literary calendar. The menus for this year’s event reflected some of the great autumn seasonal produce to create dishes which lived up to the occasion.” Lizzie Grumbach, Events Director at Four Colman Getty said, “Following the success of last year’s event, Moving Venue were the natural choice to cater the Man Booker Prize 2015 dinner; consistently providing flawless, professional and reliable service in the past, they surpassed themselves this year, delivering excellent cuisine which reinforced the prestige of the awards.” Related articles", "external_links": [], "published": "2015-10-15T12:15:00.000+03:00", "crawled": "2015-10-15T12:59:36.379+03:00", "highlightTitle": ""}