{"organizations": [], "uuid": "4ab9ff0db86dbec5ff19b99d8005814cc83567e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30323895/roark-capital-portfolio-company-driven-brands-inc-acquires-carstar-auto-body-repair-experts", "country": "US", "title": "Roark Capital Portfolio Company Driven Brands, Inc. Acquires CARSTAR Auto Body Repair Experts", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Roark Capital Portfolio Company Driven Brands, Inc. Acquires CARSTAR Auto Body Repair Experts - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "4ab9ff0db86dbec5ff19b99d8005814cc83567e8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30323895/roark-capital-portfolio-company-driven-brands-inc-acquires-carstar-auto-body-repair-experts", "ord_in_thread": 0, "title": "Roark Capital Portfolio Company Driven Brands, Inc. Acquires CARSTAR Auto Body Repair Experts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Driven Brands, Inc.\nLatest Addition to Driven Brands Portfolio Creates North American Powerhouse in the Automotive Aftermarket Franchising Industry\nCHARLOTTE, N.C. , Oct. 22, Driven Brands, Inc., a portfolio company of Roark Capital and the nation's leading franchise automotive company, announced today that it has acquired Kansas -based CARSTAR Auto Body Repair Experts. CARSTAR is one of the largest multi-shop network of independently owned collision repair facilities in the U.S., operating in more than [240] locations in 30 states.\n\"At Driven Brands, we are committed to expanding our footprint through the acquisitions of complementary brands that can help elevate our presence in the communities we serve,\" said Jonathan Fitzpatrick , president and chief executive officer of Driven Brands. \"CARSTAR - an iconic brand that is well-recognized and respected by leading insurance companies - brings us additional expertise in the collision repair business. We are excited about the strength this addition brings to the Driven Brands family creating an unrivaled North American powerhouse in automotive franchising.\"\nThe acquisition gives Driven Brands the opportunity to create a new division called Paint & Collision, which will be led by the current Maaco Franchising, Inc., president, Jose R. Costa , and comprised of Maaco, CARSTAR, and Drive N Style.\nWhile operating as separate brands, the division's new structure will allow the business to streamline services and share expertise to improve the customer experience and profitability for franchisees. CARSTAR will retain its current management team led by its chief executive officer, David Byers .\n\"We will benefit from Driven Brands and the Roark Capital team's extensive franchising knowledge across a number of retail categories including automotive, retail services and restaurants,\" said David Byers , CEO of CARSTAR Auto Body Repair Experts. \"And, there are many opportunities for improving operational efficiencies, customer engagement and national branding as part of their portfolio. This move also will bring new capital resources to CARSTAR to continue to drive our growth.\"\nCosta has served as president of Maaco for the last three years and will apply his heightened expertise to lead the Paint & Collision business segment. He will blend best practices and create opportunities to leverage purchasing power across the system.\n\"We are energized by the addition of CARSTAR to the Driven Brands portfolio, and know it will play an important part in the newly created Paint & Collision business segment,\" said Jose R. Costa , group president of Paint & Collision, Driven Brands. \"I look forward to working with the new members of our franchisee family and to bringing technological developments and competitive pricing to all of our customers,\" added Costa.\nDriven Brands manages a family of automotive companies including MAACO®, Meineke Car Care Centers®, 1-800 Radiator, Merlin 200,000 Mile Shops, Pro Oil Change, Econo Lube & Tune, AutoQual®, Aero-Colours® and Drive N Style®. Incorporating CARSTAR into the Driven Brands portfolio, the brands will now generate annual system revenues of approximately $1 billion through 2,000 locations in [48] states and [2] countries.\nAfter a record year in 2014 for sales and growth, CARSTAR, North America's largest multi-shop operator (MSO), finished the first half of 2015 with system-wide sales of $386 million , which puts it on track to outpace its performance in 2014. In 2015, CARSTAR stores in the U.S. have generated year-to-date same store sales increases of 8.3 percent, outpacing the overall collision repair industry average by more than four percent. In addition, CARSTAR is expanding its insurance relationships, securing MSO programs with several of the top insurance carriers.\nCARSTAR represents the 11th acquisition for Driven Brands since 2013, expanding the brands' footprint to more than 2,000 franchise locations in the U.S. Adding CARSTAR to the Driven Brands portfolio is part of the company's overall strategy to grow through acquisition.\nAbout Driven Brands\nThe Driven Brands family of automotive companies, headquartered in Charlotte, NC , serves as parent company for several businesses including: MAACO®, CARSTAR, Meineke Car Care Centers®, 1-800 Radiator, Merlin 200,000 Mile Shops®, Econo Lube & Tune, Pro Oil®, AutoQual®, Aero-Colours® and Drive N Style®. Founded in 1972, MAACO and Meineke Car Care Centers are two of the most iconic brands in the automotive industry and have become a staple in American culture.\nDriven Brands has more than 2,000 centers across the U.S. and Canada , which are predominately owned and operated by franchisees. Combined, all businesses generate more than $1 billion in system sales. For more information, visit www.DrivenBrands.com .\nAbout CARSTAR Auto Body Repair Experts\nCARSTAR Auto Body Repair Experts is North America's largest Multi-Shop Operator Network of independently owned collision repair facilities with more than [240] locations in 30 states. CARSTAR delivers national scale, consistently high-quality vehicle repairs, repeatable outcomes and the industry's highest customer satisfaction ratings; all repairs are backed by a national warranty and service guarantee. For more information visit www.carstar.com .\nAbout Roark Capital Group\nRoark focuses on consumer and business service companies with a specialization in franchised and multi-unit business models in the retail, restaurant, consumer and business services sectors. Since inception, Roark has acquired 47 franchise/multi-unit brands, which have generated $19 billion in annual system revenues from 21,000 locations in 50 states and 75 countries. Roark's current brands include Anytime Fitness, Arby's, Atkins Nutritionals, Batteries Plus Bulbs, Carl Jr.'s, Corner Bakery, Driven Brands, FOCUS Brands (the owner of Auntie Anne's Pretzels, Carvel Ice Cream, Cinnabon, McAlister's Deli, Moe's Southwest Grill, and Schlotzsky's), Hardee's, Il Fornaio, Massage Envy, Miller's Ale House, Money Mailer, Naf Naf Grill , Pet Valu, Pet Supermarket, Primrose Schools, Waxing the City, and Wingstop. For more information please visit www.roarkcapital.com .\nFor media inquiries, contact:\nDan Yampolsky\nTel: +1 305 735-8927\nCell: +1 203 710-3911\nEmail: dan@rockorange.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/roark-capital-portfolio-company-driven-brands-inc-acquires-carstar-auto-body-repair-experts-300164488.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/roark-capital-portfolio-company-driven-brands-inc-acquires-carstar-auto-body-repair-experts-300164488.html", "http://www.xmlnews.org/ns/", "http://www.drivenbrands.com/", "http://www.roarkcapital.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL35374&Transmission_Id=201510220700PR_NEWS_USPR_____FL35374&DateId=20151022", "http://www.carstar.com/"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T16:34:45.750+03:00", "highlightTitle": ""}