{"organizations": [], "uuid": "2db9514affee9552ec39fbd2cdaff6da038ab835", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30257268/coast-guard-issues-favorable-final-environmental-impact-statement-for-port-ambrose", "country": "US", "title": "Coast Guard Issues Favorable Final Environmental Impact Statement for Port Ambrose", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Coast Guard Issues Favorable Final Environmental Impact Statement for Port Ambrose - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "2db9514affee9552ec39fbd2cdaff6da038ab835"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30257268/coast-guard-issues-favorable-final-environmental-impact-statement-for-port-ambrose", "ord_in_thread": 0, "title": "Coast Guard Issues Favorable Final Environmental Impact Statement for Port Ambrose", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Liberty Natural Gas\nWASHINGTON , Oct. 14, 2015 /PRNewswire/ -- The United States Maritime Administration and U.S. Coast Guard issued its 4,242 page final Environmental Impact Statement (EIS) for the proposed Port Ambrose Project Deepwater Port Application this week. The EIS, confirms that the project is needed, the location is safe, and the impacts to the environment are minimal.\nFor further information about the Port Ambrose project and a link to the comprehensive final EIS please visit www.portambrose.com\n\"We are very pleased that the United States Coast Guard's final Environmental Impact Statement (EIS) for Port Ambrose supports the project design, location and fundamental need. The EIS is the result of an exhaustive, multi-year state and federal study and confirms that Port Ambrose is a safe and environmentally responsible project with minimal impacts,\" said Roger Whelan , CEO of Liberty Natural Gas.\nWhelan added, \"The release of the final EIS is a major milestone and we are pleased that the Coast Guard, with input from many other agencies, was able to clearly lay out the minimal environmental and safety impacts of the project in the document. It has been more than three years since we submitted the Port Ambrose application and during that time we have worked to demonstrate, and the comprehensive environmental and safety reviews by experts in high-level federal and state agencies confirm, that the project is safe and needed.\"\nAbout Liberty Natural Gas\nLiberty Natural Gas, LLC, the developer of the Port Ambrose project, is a portfolio company of a fund advised by West Face Capital, a Toronto, Canada based investment management firm. In addition to the Port Ambrose project, West Face Capital and its affiliates are currently developing a deepwater port project in northwest England (United Kingdom ), known as Port Meridian, and are actively exploring opportunities for other international regasification/import projects.\nBoth Port Ambrose and Port Meridian are being developed in coordination with Höegh LNG ( Norway ), which has extensive design and operations experience in both LNG terminals and LNG delivery vessels. When operational, Port Ambrose and Port Meridian can be used as an integrated LNG system to deliver cargoes on a seasonal basis to both the New York and UK markets. More information about the Meridian LNG portfolio can be found at www.meridianlng.com .\nVideo - https://www.youtube.com/watch?v=EFNavdib98c#t=17\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/coast-guard-issues-favorable-final-environmental-impact-statement-for-port-ambrose-300159138.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=AQ27242&Transmission_Id=201510140805PR_NEWS_USPR_____AQ27242&DateId=20151014", "http://www.meridianlng.com/", "http://www.prnewswire.com/news-releases/coast-guard-issues-favorable-final-environmental-impact-statement-for-port-ambrose-300159138.html", "http://www.portambrose.com/", "http://www.youtube.com/watch?v=EFNavdib98c?version=3", "http://www.youtube.com/watch?v=EFNavdib98c#t=17"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T18:21:35.765+03:00", "highlightTitle": ""}