{"organizations": [], "uuid": "8bbfc3a35f9546c355af528c62df036b94a2a27e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/thousands-of-spectators-flock-to-albuquerques-annual-international-balloon-fiesta-330555371.html", "country": "US", "title": "Thousands of spectators flock to Albuquerque's annual international balloon fiesta", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Thousands of spectators flock to Albuquerque's annual international balloon fiesta - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T02:57:00.000+03:00", "replies_count": 0, "uuid": "8bbfc3a35f9546c355af528c62df036b94a2a27e"}, "author": "Susan Montoya Bryan, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/thousands-of-spectators-flock-to-albuquerques-annual-international-balloon-fiesta-330555371.html", "ord_in_thread": 0, "title": "Thousands of spectators flock to Albuquerque's annual international balloon fiesta", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ALBUQUERQUE, N.M. - Tens of thousands of spectators swarmed the launch field Saturday for the first mass ascension of the 44th annual Albuquerque International Balloon Fiesta.\nThe nine-day event kicked off at dawn. More than 500 balloons representing dozens of states and nearly 20 different countries registered for the event this year. Among them were character balloons such as one depicting the head of \"Star Wars\" villain Darth Vader, which inevitably floated across from a Yoda balloon. Other popular draws included two bees kissing and a flying pig with sunglasses.\nOrganizers say it's one of the most photographed events in the world.\n\"Every time I turn around, I see another one,\" said Kim Kaiser, who came from Vermont. \"I've got to get a picture of this one and that one.\"\nOne of the big draws of the balloon fiesta is the ability of spectators to roam the city's 72-acre balloon park to watch the morning mass ascensions.\nMarilyn Oates, who travelled from Michigan, said nothing compares to being surrounded by so many hot air balloons.\n\"There's no explaining the majesty of it and it's so huge and you can't explain it in words,\" Oates said. \"You have to come and see it.\"\nA combination of factors makes Albuquerque the perfect place for the fiesta: typically clear skies, cool mornings and wind patterns at various elevations that help keep the balloons aloft over the city.\nThe mountains that border the city's east side and weather patterns help create what is known as the \"box.\" When the box is in effect, the lower winds blow south and higher winds blow north, meaning balloonists can travel one direction, then backtrack to land near their launch site by changing elevation. That keeps the balloons bobbing over the city rather than drifting away.\nSeveral balloons that took off in the morning later landed in a nearby park where balloon chase crews were poised to retrieve them.\n___\nAssociated Press writer Terry Tang contributed to this report.\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-10-04T02:57:00.000+03:00", "crawled": "2015-10-04T14:27:55.575+03:00", "highlightTitle": ""}