{"organizations": [], "uuid": "8563474087fd214cdecd2ef0928c45c423f36e34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64503/gdp-rise-uganda-tourism-contribution-significant", "country": "US", "title": "GDP Rise in Uganda: Tourism contribution significant", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "GDP Rise in Uganda: Tourism contribution significant", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T10:50:00.000+03:00", "replies_count": 0, "uuid": "8563474087fd214cdecd2ef0928c45c423f36e34"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/64503/gdp-rise-uganda-tourism-contribution-significant", "ord_in_thread": 0, "title": "GDP Rise in Uganda: Tourism contribution significant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GDP Rise in Uganda: Tourism contribution significant Original, timely global, travel, tourism, business news and research: \nBy TOURISM’S CONTRIBUTIONS TO UGANDA’S GDP RISE TO 6.3 TRILLION SHILLINGS | Oct 05, 2015 eTN Exclusive: Unique and original, timely, global breaking news: \nRecently published figures suggest that the contributions made by the tourism industry to the Ugandan GDP has risen from 2013 to 2014 by 0.8 trillion Uganda Shillings, reaching 6.3 trillion shillings overall. \nThis comes on the back of increased arrival numbers which for 2014 reached 1.266 million visitors, up from the previous year when the country received 1.206 million visitors. [Note visitors are not equated with mainstream tourists] \nIn percentage terms has the sectoral contribution, inspite of being poorly facilitated , reached just under 10 percent of the country’s GDP, making it increasingly important vis a vis investments and job creation. \nThe Ministry of Tourism last month, coinciding with the World Tourism Day celebrations which this year took place in the northern Ugandan town of Lira, created tourism clusters to promote subregions to work together. Towards that end did the Minister for Tourism, Hon. Dr. Maria Mutagamba, call upon local governments to set aside significant funding in their budgets for the promotion of tourism to their area but also to help clean up and maintain attractions of value for tourists, to persuade them come and visit, and of course spend their money. \nProjections given for the year 2015 speak of a potential rise in arrivals and revenues of 8 percent, fuelled in part by the expected visit of Pope Francis in November, which is thought to already have a magnetic effect for the destination. \nTapping into specific niche markets, like pilgrimage and sports tourism – the opening of the new golf course at the Lake Victoria Serena Golf Resort is seens as a catalyst to bring more golfers to Uganda – has widened the scope and allowed for product diversification away from the ‘just gorillas’ image Uganda courted for almost too long.", "external_links": [], "published": "2015-10-05T10:50:00.000+03:00", "crawled": "2015-10-05T20:46:30.953+03:00", "highlightTitle": ""}