{"organizations": [], "uuid": "c95115f8d759ebe05c805dfd47b5827419912dec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-56256f9c/turbine/ct-saint-louis-arch-50th-travel-1025-20151002", "site_section": "http://www.baltimoresun.com/travel/rss2.0.xml\r", "section_title": "Travel - Baltimore Sun", "url": "http://www.baltimoresun.com/travel/ct-saint-louis-arch-50th-travel-1025-20151002-story.html", "country": "", "title": "As its arch turns 50, St. Louis embraces its historic attractions", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "As its arch turns 50, St. Louis embraces its historic attractions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:33:00.000+03:00", "replies_count": 0, "uuid": "c95115f8d759ebe05c805dfd47b5827419912dec"}, "author": "Jay Jones", "url": "http://www.baltimoresun.com/travel/ct-saint-louis-arch-50th-travel-1025-20151002-story.html", "ord_in_thread": 0, "title": "As its arch turns 50, St. Louis embraces its historic attractions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel As its arch turns 50, St. Louis embraces its historic attractions \nAt 50, the St. Louis Arch is synonymous with the city — just one of several attractions that have been drawing visitors for half a century. Jay Jones Chicago Tribune What happened to the popularity of St. Louis' arch? \nIn the early 1960s, at the same time rocket scientists were trying to figure out how to put a man on the moon, other engineers were struggling with a different dilemma: how to get people to the top of the Gateway Arch. \nFamed architect Eero Saarinen had designed the 630-foot-high stainless steel arch in 1947 but was stumped when it came to creating a conveyance, something akin to an elevator, that didn't have to move straight up and down. \n\"The major elevator companies didn't really want to touch it,\" recalled Bob Moore, a historian for the National Park Service. \nDick Bowser, an inventor, ultimately solved the problem. He developed a \"transporter\" that could move guests to the crest while seated in barrel-shaped pods. \nOn Oct. 28, 1965 — in just four minutes — the first visitors rode to the top of the arch towering above the Mississippi River. \n\"It was real Space Age stuff,\" Moore said, referring to St. Louis, not the moon. \nFifty years later, the landmark remains synonymous with St. Louis. It's just one of several local attractions that have been drawing visitors for half a century or more. \nBut there's a problem. People aren't visiting the arch in nearly the numbers they once did. \nIn 1966, the first full year of operation, 4.6 million people came to the Jefferson National Expansion Memorial ( www.nps.gov/jeff ), the National Park Service site that includes the Gateway Arch. By last year, that number had plummeted by 60 percent, to just 1.8 million. \nSome of the blame goes to Mother Nature. With its riverfront location, the park is forced to close when the Mississippi overflows. The flooding typically occurs during peak tourist season. \n\"It has had a big impact on what we can do on the riverfront,\" said Ryan McClure of CityArchRiver ( www.cityarchriver.org ), a group working to revitalize the area. \nJob one is raising the ground level by 3 feet along a mile and a half of riverfront. McClure said the raised promenade, to be completed this December, is intended to bring both businesses and visitors back to the riverfront. Farmers markets and festivals are being planned. \n\"Our goal is to program this throughout the year to make it more active and vibrant,\" McClure said. \nThe $380 million project also includes an overhaul of the Museum of Westward Expansion, which closed earlier this year. \n\"The old museum was just that. It was an old museum,\" Moore explained. \"It was opened in 1976 and had been there all that time with very little change.\" \nWhen it reopens in 2017, the museum will feature the interactive technology that 21st-century visitors expect. \n\"We'll tell the story of the Louisiana Purchase and Lewis and Clark, but we're going to have it told through the lens of St. Louis,\" Moore added. The explorers both settled in the city after their expedition. \nAbout 13 miles southwest of downtown, more 19th-century history is shared at the Ulysses S. Grant National Historic Site ( www.nps.gov/ulsg ). \nChicagoans probably associate Grant with Galena, but before moving to northwest Illinois, he spent five years living in the family home of his wife, Julia Dent. \nThe farmstead, located in a wooded rural setting, is where the couple first met. While Grant is well-known as the Civil War general who saved the Union and later became president, park rangers point out a curious incongruity: the Dents and the Grants owned slaves who did their housework and tended the land. Slavery was legal in Missouri. \nIn 1907, August Busch Sr. of Anheuser-Busch fame, bought 300 acres of what had been Dent land and restored the four-room, two-story cabin that Grant had built in 1855. The cabin, which Grant named Hardscrabble, is the centerpiece of Grant's Farm ( www.grantsfarm.com ), a popular tourist attraction. \nThe farm, just down the road from the historic site, is home to the Budweiser Clydesdales. They're among scores of animals particularly popular with kids. For the grown-ups, there are free samples of the brewery's beverages at the Bauernhof. Munchies such as bratwurst, pretzels and pizza are for sale at the adjoining Brat Haus. \nA visit to St. Louis isn't complete without a stroll through majestic Forest Park ( www.forestparkforever.org ). Created nearly 140 years ago, it's 50 percent larger than New York's Central Park. \nThe site of the 1904 world's fair, the Louisiana Purchase Exposition, the park is home to several landmarks, including art and history museums, the Muny Opera and the St. Louis Zoo. \nVisitors seeking a unique place to stay will enjoy The Cheshire ( www.cheshirestl.com ), a British-themed hotel just across the street from Forest Park. Guests can pedal their way through the park on the hotel's complimentary bikes. \nOpened in 1965, the same year as the Gateway Arch, each room is themed to a different author, poet or playwright, including Anne Bronte, Daniel Defoe and Graham Greene. \nPaintings of monarchs from Henry VIII to Elizabeth II adorn the public spaces. The Fox & Hounds features the classic decor of an English pub and is a lively place to enjoy fish and chips with a pint of ale. \nA couple of miles away, in a trendy neighborhood called the Delmar Loop, people can watch pop being bottled as they sip on a classic root beer at Fitz's ( www.fitzsrootbeer.com ). Launched in 1947 as a drive-in, Fitz's Bottling Co. reopened in its current location in 1993. \nWhile several varieties of soda are bottled here, root beer rules. It's made using the original 1940s recipe. \nThe formula includes natural roots, spices and barks. There's no high fructose corn syrup, just pure cane sugar. A root beer float, the creamy concoction overflowing its chilled mug, is sure to bring back childhood memories. \nJay Jones is a freelance reporter.", "external_links": [], "published": "2015-10-20T01:33:00.000+03:00", "crawled": "2015-10-21T08:26:57.065+03:00", "highlightTitle": ""}