{"organizations": [], "uuid": "189b21df94b349fd32ad534a4552f7cd3e019297", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/11/pegasus1.jpeg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/the-logistics-industry-gathers-at-the-international-transport-and-logistics-conference/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "The logistics industry gathers at the ‘International Transport and Logistics ConferenceTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "The logistics industry gathers at the ‘International Transport and Logistics ConferenceTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "10ec342cf5de478948fa95d26ce88378c0c52cbc"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-logistics-industry-gathers-at-the-international-transport-and-logistics-conference/", "ord_in_thread": 0, "title": "The logistics industry gathers at the ‘International Transport and Logistics ConferenceTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The logistics industry gathers at the ‘International Transport and Logistics Conference  \nCo-hosted by Pegasus Airlines Cargo Directorate and Bahcesehir University’s Faculty of Economics, Administrative and Social Sciences, the ‘International Transport and Logistics Conference’ brought together education and experience for students looking to start a career in the sector.\n \nPegasus Airlines Cargo Directorate and Bahcesehir University’s Faculty of Economics, Administrative and Social Sciences co-hosted the ‘International Transport and Logistics Conference’ on Thursday 8 October at the Bahcesehir University Besiktas Campus.\n \nHosted by Pegasus Airlines Cargo Vice President Aydin Alpa and Vice Dean of Bahcesehir University’s Faculty of Economics, Administrative and Social Sciences Professor Dr. Yavuz Gunalay, the conference brought together prominent local and international executives in the air, sea and road logistics sectors. Pegasus Airlines CFO Serhan Ulga and Operational Control Center (OCC) Manager Umit Kula also shared their industry know-how with students.\n \nEmphasising the importance of the conference as a platform for bringing together industry leaders as well as providing an environment for students looking to join the sector where their academic experience is brought together with the experience of the professionals, Pegasus Airlines Cargo Vice President Aydin Alpa commented: “Turkey is a vital logistics hub in the region due to its geographical location, hence we anticipate further growth and expansion in the sector in the near future. As Pegasus Airlines Cargo, we currently carry air cargo across 37 countries and 94 different locations. We continue to invest in and further prepare for the expansion of our flight network as fast as we can obtain traffic rights from the Civil Aviation Authority.”\n \nThe conference, co-hosted by Pegasus Airlines Cargo Directorate and Bahcesehir University’s Faculty of Economics, Administrative and Social Sciences, gave students the chance to combine their academic education with the industry know-how of sector leaders who shared their experiences at the conference.\n \nConference speakers included Reibel Transport and Trade Co. General Manager Arif Badur, Etihad Cargo Vice President David Hugh Kerr, Arkas Holding Executive Vice President and Logistics Services Group President Diana Arcas, Dusseldorf Airport Cargo Managing Director Gerton Hulsman, ABDA Cargo Services Regional Manager of Middle East, Europe & Africa Nilan Gunatilaka, Istanbul Sabiha Gokcen International Airport Cargo Operations and Marketing Manager Harun Ay, Lufthansa Cargo AG Turkey General Manager Hasan Hatipoglu, UPS SPRL President of Freight Forwarding Europe Region Jens Poggensee, Aviation Services Holding EOOD CEO Michail Dantchev, Ekol Logistics General Manager of Freight Murat Bog, Vice Dean of Bahcesehir University’s Faculty of Economics, Administrative and Social Sciences Professor Dr. Yavuz Gunalay, Damco CEO of EastMed Area Okyay Oztugran, International Transporters Association President O. Cetin Nuhoglu and Chair of Department of International Finance at Bahcesehir University Associate Dr. Deniz Gokce.\n \n \nSource:- Pegasus Airlines", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T19:19:50.097+03:00", "highlightTitle": ""}