{"organizations": [], "uuid": "2645a794ba9459a3c035957815df946bb53d0a62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30162369/gm-unveils-lets-drive-nyc-car-sharing-program", "country": "US", "title": "GM Unveils 'Let's Drive NYC' Car-Sharing Program", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "GM Unveils 'Let's Drive NYC' Car-Sharing Program - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "2645a794ba9459a3c035957815df946bb53d0a62"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30162369/gm-unveils-lets-drive-nyc-car-sharing-program", "ord_in_thread": 0, "title": "GM Unveils 'Let's Drive NYC' Car-Sharing Program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " General Motors\nNEW YORK , Oct. 1, 2015 /PRNewswire/ -- Running an errand to a big box store or planning a weekend excursion are about to get easier for some Manhattan residents because of a car-sharing program revealed today by General Motors. It's the company's latest move to deliver urban mobility options to customers around the globe.\nLet's Drive NYC is available to eligible residents of The Ritz Plaza, a 479-unit luxury apartment building at Times Square in midtown Manhattan , owned and managed by Stonehenge Partners.\nResidents use a GM-developed mobile app to reserve a vehicle and access parking in one of 200 garages throughout Manhattan managed by Icon Parking Systems. The fleet currently includes eight Chevrolet Trax small SUVs and two Chevrolet Equinox compact SUVs, with more vehicles to be added later.\nIn consideration of periodic apartment lease payments, residents receive electronic credits valid for three hours of rental per month. After that, users pay less than $10 an hour or up to $75 for a 24-hour reservation.\n\"Having a car in the city didn't seem realistic, but 'Let's Drive NYC ' changes that,\" said Andy Chediak , a 32 year-old Stonehenge resident. \"The quick-and-easy access to a car on demand at The Ritz Plaza is a game-changer that fundamentally alters my approach to transportation, with new opportunities that weren't previously practical.\"\nUnlike other mobility service offerings, Let's Drive NYC leverages integrated and existing OnStar connectivity technologies and services such as remote diagnostic status, and access to OnStar advisors with the push of a button.\n\"Customers want options on how to move from Point A to Point B that provide flexibility and personalization,\" said GM President Dan Ammann . \"Let's Drive NYC is just one part of GM's global urban mobility strategy. We view evolving consumer preferences, such as car-sharing, as real business opportunities, where we can quickly build on our existing capabilities such as OnStar connectivity to very effectively meet customer needs.\"\nGM offered the program earlier this summer to select Ritz Plaza residents who completed more than 100 trips and drove nearly 20,000 miles in the New York , New Jersey and Connecticut tri-state area. Based on the pilot program, GM, Stonehenge and Icon were quick to broaden the program.\n\"When GM approached us with their car-sharing program, we were excited to incorporate this innovative service to further enhance our residents' lifestyle,\" said Ofer Yardeni , chairman and CEO of Stonehenge. \"Owning a vehicle in New York City is expensive and inconvenient. GM's Let's Drive NYC car-sharing program delivers a valuable and sought-after amenity, and residents of The Ritz Plaza are taking full advantage of it.\"\nStonehenge is a leader in community-building events within the Manhattan residential market. It provides residents with complimentary programming ranging from comedy and trivia nights to concerts. Incorporating Let's Drive NYC helps achieve Stonehenge's goal of offering amenities that encourage interaction among residents.\nGM's urban mobility programs range from investments in Germany of ridesharing service flinc and Opel's new car-sharing community CarUnity to testing Zagster bike sharing at its Technical Center in the U.S. and a partnership with Jiao Tong University in China to integrate Chevrolet EN-V 2.0 vehicles into a multi-modal transportation system. All are designed to better understand and address urban transportation issues for customers.\nOne of GM's first mobility partnerships was with Google early last year, where it tested a commuter ride-sharing service using Chevrolet Spark EVs. Using an app, drivers and riders were matched based on trip patterns and schedules. The project demonstrated value and potential in creating transportation services around automotive, leading to other initiatives, like the Let's Drive NYC program.\nAbout General Motors\nGeneral Motors Co. (NYSE:GM, TSX: GMM) and its partners produce vehicles in 30 countries, and the company has leadership positions in the world's largest and fastest-growing automotive markets. GM's brands include Chevrolet and Cadillac, as well as Baojun, Buick, GMC, Holden, Jiefang, Opel, Vauxhall and Wuling. More information on the company and its subsidiaries, including OnStar, a global leader in vehicle safety, security and information services, can be found at http://www.gm.com .\nAbout Stonehenge Partners\nStonehenge Partners is a vertically integrated, private real estate company with expertise in investment management, property management, development, design, construction and leasing. Stonehenge owns and manages a Manhattan portfolio currently valued at $3.1 billion comprised of 25 income-producing properties with more than 3,000 residential apartment units. Stonehenge is recognized for its above-and-beyond customer service platform and five-star lifestyle programming. More information can be found at www.stonehengenyc.com .\n releases/gm-unveils-lets-drive-nyc-car-sharing-program-300152606.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.gm.com/", "http://www.stonehengenyc.com/", "http://www.gmsustainability.com/issues/innovation.php", "http://www.prnewswire.com/news-releases/gm-unveils-lets-drive-nyc-car-sharing-program-300152606.html", "http://media.gm.com/media/cn/en/gm/news.detail.html/content/Pages/news/cn/en/2015/may/0527_shanghaijiaotong.html", "http://media.gm.com/media/us/en/gm/news.detail.html/content/Pages/news/us/en/2014/Aug/0826-bike-share.html", "http://media.gm.com/media/intl/en/opel/news.detail.html/content/Pages/news/intl/en/2015/opel/06-24-car-unity.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=DE17369&Transmission_Id=201510011015PR_NEWS_USPR_____DE17369&DateId=20151001"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-01T17:50:34.233+03:00", "highlightTitle": ""}