{"organizations": [], "uuid": "e4f78cb539e41bd1e7b212b6ef729c2a85a87a85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/organizers-rename-annual-alaska-slavery-auction-fundraiser-following-complaint-334354391.html", "country": "US", "title": "Organizers rename annual Alaska 'slavery auction' fundraiser following complaint", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Organizers rename annual Alaska 'slavery auction' fundraiser following complaint - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T20:19:00.000+03:00", "replies_count": 0, "uuid": "e4f78cb539e41bd1e7b212b6ef729c2a85a87a85"}, "author": "Mark Thiessen, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/organizers-rename-annual-alaska-slavery-auction-fundraiser-following-complaint-334354391.html", "ord_in_thread": 0, "title": "Organizers rename annual Alaska 'slavery auction' fundraiser following complaint", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANCHORAGE, Alaska - Organizers of an annual Alaska charity event said Monday they will stop calling it a \"slavery auction\" after the NAACP complained.\nThe event in the town of Sitka involves people bidding in an auction on volunteers' time, with the winning bidders putting the volunteers to work doing odd jobs, like mowing lawns or cleaning gutters. It's part of Sitka's Alaska Day festivities, which commemorate the state's transfer of ownership from Russia to the U.S.\nThe president of the Anchorage chapter of the NAACP issued a news release drawing attention to the \"slavery\" name ahead of this year's auction, which took place Sunday. The Alaska Dispatch News then did a story about it — further spreading the word — and the auction name was widely condemned online.\n\"All at once, I don't know what happened,\" said Rita Ledbetter, a bartender at the Pioneer Bar, which hosts the annual event.\nAnchorage NAACP President Wanda Laws told The Associated Press she wanted to shine a spotlight on the auction name because it was \"extremely inflammatory and insensitive.\"\n\"You do not glorify the selling of another human being. You just don't do that,\" she said. \"It's horrific.\"\nTwenty to 25 people volunteered to have their labour sold at the auction organized by Sitka's Pioneer Bar. Sunday's event raised $3,000 for the local volunteer fire department, Ledbetter said. Previous beneficiaries included Special Olympics and charities fighting multiple sclerosis and breast cancer.\nLedbetter said the auction has been held for 31 years and has had no problems other than a phone complaint during each of the past two years. She also noted no one contacted her directly about the name.\n\"It's a local, local thing, and I don't know why it's such a big deal,\" Ledbetter said by telephone Monday.\n\"Why I wasn't called by the NAACP and say, 'Hey,' instead of slamming us for a word that just means squat now. I mean, how long has that been? 150? Almost 200 years? It's like, 'C'mon ,'\" Ledbetter said.\nStill, she confirmed the auction will change its name to the \"Alaska Day Auction\" going forward.\nAlaska Day chairman Ted Allio said the matter has been blown out of proportion. Allio noted Russians enslaved Natives living in Sitka before the U.S. purchased Alaska in 1867. But he says, \"You don't hear them yelling\" about the name.\nBut Lawrence SpottedBird, general manager of the Sitka Tribe of Alaska, said calling the event a slavery auction wasn't OK and Allio \"overstepped on his comments.\"\nThe event is well-intentioned but affected the black community, SpottedBird said.\n\"I stand with them,\" he said. \"There should be basically an apology for using that term.\"\nSitka Fire Chief Dave Miller said the auction money will be put into the training fund for volunteers. He said after Law's comments and all the online complaints, he asked the auctioneer not to use the world \"slavery\" during the actual auction.\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-10-19T20:19:00.000+03:00", "crawled": "2015-10-20T04:20:22.075+03:00", "highlightTitle": ""}