{"organizations": [], "uuid": "17c72beafb04977bc169ed2c32c7a162d1c971f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30218670/chef-alain-ducasse-and-philippe-salle-elior-group-chairman-ceo-have-signed-a-strategic-and-culinary-partnership-agreement", "country": "US", "title": "Chef Alain Ducasse and Philippe Salle, Elior Group Chairman & CEO, Have Signed a Strategic and Culinary Partnership Agreement", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Chef Alain Ducasse and Philippe Salle, Elior Group Chairman & CEO, Have Signed a Strategic and Culinary Partnership Agreement - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "17c72beafb04977bc169ed2c32c7a162d1c971f1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30218670/chef-alain-ducasse-and-philippe-salle-elior-group-chairman-ceo-have-signed-a-strategic-and-culinary-partnership-agreement", "ord_in_thread": 0, "title": "Chef Alain Ducasse and Philippe Salle, Elior Group Chairman & CEO, Have Signed a Strategic and Culinary Partnership Agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Elior Group\nPARIS , October 8,\nAlain Ducasse , a standard-setting chef for French cuisine across the globe - founder of Alain Ducasse Entreprise -, and Philippe Salle - Chairman and Chief Executive Officer of Elior Group, one of the world's leading players in the contract and concession catering markets - have decided to team up in order to combine their growth objectives and standards of excellence.\nThis strategic partnership will, from the outset, accelerate each partner's respective growth trajectory and create additional drivers for their lasting success, reinforcing their shared commitments. The two groups expect to leverage synergies from the combination in terms of providing culinary consulting, winning contracts together for major concessions across the world, and creating joint designs of innovative catering concepts.\nThe partnership involves Elior Group acquiring some 10% of Alain Ducasse Entreprise's capital. This will notably enable Alain Ducasse Entreprise to ensure that its planned openings at prestigious sites - ranging from Versailles to the new Les Halles quarter in Paris - can take place in the best possible conditions. For its part, Elior Group will be able to benefit from Alain Ducasse's savoir-faire and expertise so that it can proudly showcase French cuisine in all of its markets and service offerings.\nSpeaking about the agreement, Alain Ducasse said: \" Our partnership with Elior Group represents the inauguration of a new type of business model that allies large-scale services with excellence. \" Equally enthusiastic about the deal, Philippe Salle said: \" The reason why our two groups decided to join forces is because we have a shared vision of excellence and a common desire to innovate in order to better serve our customers. \"\nBoth Alain Ducasse and Philippe Salle are extremely confident in the future of the culinary profession and have ambitious objectives for their groups. As a result they are delighted to have entered into this partnership which will drive growth for both parties involved.\nFor more information:\nhttp://www.alain-ducasse.com\nhttp://www.eliorgroup.com\n@Elior_Group\n ", "external_links": ["https://twitter.com/Elior_Group", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510082252&Transmission_Id=201510081400PR_NEWS_USPR_____enUK201510082252&DateId=20151008", "http://www.xmlnews.org/ns/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T01:36:02.736+03:00", "highlightTitle": ""}