{"organizations": [], "uuid": "7e1bbdba908690986ad882da0b0a784567109016", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30263727/china-rail-transit-air-conditioner-industry-report-2014-2015", "country": "US", "title": "China Rail Transit Air-conditioner Industry Report, 2014-2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "China Rail Transit Air-conditioner Industry Report, 2014-2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e1bbdba908690986ad882da0b0a784567109016"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30263727/china-rail-transit-air-conditioner-industry-report-2014-2015", "ord_in_thread": 0, "title": "China Rail Transit Air-conditioner Industry Report, 2014-2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " ReportBuyer\nLONDON , Oct. 14, China's demand of rail transit vehicles for air conditioning comes mainly from three aspects-railway coaches and locomotives, high-speed EMUs, as well as urban rail transit (metro and light rail).\nRailway coaches and locomotives: In 2014, when China's railway jumpstarted a comprehensive reform, including the attempt to introduce non-state capital to carry out railway construction and initiate railway development fund, China's full-year railway investment totaled RMB808.8 billion . In a long time to come, China's fixed investment into railways will keep steady growth, and China's policies for speeding up railway construction will also remain unchanged.\nIn 2014, the locomotive ownership in China amounted to 21,100 units, an increase of 261 units from a year ago. Among them, the number of high-power CRH locomotives reached 8,423 units, rising 1,406 units on a year-on-year basis. China's railway air-conditioning is mainly used in locomotive cabs and railway coaches. In 2014, the demand of locomotives for air conditioning units in China approximated 1,658 units.\nHigh-speed EMUs: In 2014, the domestic EMU ownership reached 1,411 trains, equivalent to 13,696 units, with the vehicle ownership density being about 0.82 units/km, up from 0.75 units/km in 2013. In 2014, China's air conditioning unit demand from EMUs amounted to 1,030 sets or so.\nAs of the end of 2014, China's high-speed railway network of four vertical and four horizontal trunk lines had been largely completed. In 2015, the rail lines under construction involve Xuzhou-Lanzhou High-speed Railway, Qingdao–Taiyuan High-Speed Railway, Beijing–Harbin High-Speed Railway, Beijing - Guangzhou -Shenzhen-Hong Kong High-Speed Railway, as well as Shanghai-Kunming High-Speed Railway. In 2014, a total of 10 trunk railway lines to be improved and under development in western regions started construction, and additional 3 lines will start in 2015, all of which would be successively completed during 2018-2020. This will increase China's trunk line mileage, thereby expanding the demand for EMU air conditioning.\nUrban rail transit (metro and light rail): As of the end of March 2015 , there were a total of 39 cities that had been approved to construct urban rail transit lines. Among them, 90 subway lines from the said 22 cities had been put into operation, with a total mileage of 2,827 kilometers. Thus, this helped fuel China's demand for rail transit vehicles, which in turn expanded their demand for air-conditioning. In 2014, the market size of rail transit air-conditioning totaled about 11,814 sets.\nAs of the end of April 2015 , the cities such as Luoyang, Hohhot, Xiangyang, Huainan, and Jiujiang were also mapping out the construction of urban rail transit. In future, an increasing number of medium-sized cities will construct rail transit, which would give an impetus to air conditioning demand in this respect.\nIn terms of overall market segments, China's demand for rail transit air-conditioning will come mainly from high-speed EMUs and urban rail transit. By contrast, the demand from railway coaches and locomotives will decline to some extent.\nFrom the perspective of rail transit air-conditioning manufacturers, with high production qualification requirements (must obtain products test certificates and operational reports), China's rail transit air-conditioning unit manufacturers mainly include Shijiazhuang King Transportation Equipment, ZRJC, and Shanghai Faiveley.\nAs the technical partner of Mitsubishi Electric, Shijiazhuang King Transportation Equipment has an annual capacity of around 12,000 sets of rail transit air-conditioning units. Its major clients consist of CRRC, Mitsubishi, Alston, and Bombardier, etc. ZRJC mainly manufactures special air conditioning for locomotives, with its products widely used in railway coaches, subway, and other rail transit vehicles, which therefore has great advantages in locomotive air conditioning. Its major customers include CRRC, Siemens, and Alston, etc, Shanghai Faiveley Rail Vehicle Equipment Co., Ltd. is mainly engaged in production of air conditioning units for urban rail transit and coaches, with its technologies from its parent company-Shanghai Faiveley Group. Its major clients are comprised of CRRC and Bombardier.\nChina Rail Transit Air-conditioner Industry Report, 2014-2015 mainly focuses on the following:\nStatus quo of China's rail transit air-conditioning industry, including definition and classification, applications, and policies and regulations, etc.;\nChina's rail transit market, including development, investment scale, railroad network planning, etc. of China's railway transportation and urban mass transit;\nChina's rail transit vehicle market, including ownership and market demand of locomotives, urban rail, and high-speed EMUs;\nChina's rail transit air-conditioning market, including market demand, capacity, competitive landscape, and market forecast, etc;\nProfile, financials, main products, R&D, and technical characteristics of 8 major rail transit air-conditioning manufacturers, including Shijiazhuang King Transportation Equipment, ZRJC, Shanghai Faiveley, New United Group, Merak Jinxin, Songz, Longertek Technology, and COOLTEK.\nDownload the full report: https://www.reportbuyer.com/product/3078239/\nAbout Reportbuyer\nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers\nhttp://www.reportbuyer.com\nFor more information:\nSarah Smith\nResearch Advisor at Reportbuyer.com\nEmail: query@reportbuyer.com\nTel: +44 208 816 85 48\nWebsite: www.reportbuyer.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/china-rail-transit-air-conditioner-industry-report-2014-2015-300160061.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=BR28399&Transmission_Id=201510141859PR_NEWS_USPR_____BR28399&DateId=20151014", "http://www.prnewswire.com/news-releases/china-rail-transit-air-conditioner-industry-report-2014-2015-300160061.html", "https://www.reportbuyer.com/product/3078239/", "http://www.xmlnews.org/ns/", "http://www.reportbuyer.com/"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T04:08:34.098+03:00", "highlightTitle": ""}