{"organizations": [], "uuid": "1913dabc81d32484e482947cb9f6cbccf5689d88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/article/travel-smartly-not-glamorously/ar-AAf8AEU", "country": "US", "title": "Travel Smartly, Not Glamorously", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "Travel Smartly, Not Glamorously", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 3, "uuid": "ab5e05ec926dad6ecf0735db09788e28d048b072"}, "author": "Elodie Cheesman", "url": "http://www.msn.com/en-us/travel/article/travel-smartly-not-glamorously/ar-AAf8AEU#post-0", "ord_in_thread": 0, "title": "Travel Smartly, Not Glamorously", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Smartly, Not Glamorously The Huffington Post 1 day ago Elodie Cheesman © OcusFocus via Getty Images SELFIE STICK The internet is saturated with articles about how to be a smart traveller, with tips like: \"Check local customs to see if exposing yourself at the beach is frowned upon,\" \"Don't get drunk on the plane (or do),\" \"Take the road less travelled/venture off the beaten track/speak to that toothless local man to find the best hidden haunts but don't accept the magic beans he proffers...\"\nThese articles skate over the practical stuff, or are just plain aspirational. Bringing \"a light cashmere wrap for the plane\" seems unwise, unless of course you're in first class and there's no chance of being stuck beside a snivelling child who is likely to drip snot all over you. And since when did rose water facial spritzer become imperative for your skin's survival? Most of us will never be privy to glamorous, sweat-free, snot-free, being-ferried-around-on-a-palanquin type travel. But that's a good thing: learning to be a self-sufficient, savvy traveller is half the fun!\nI was fortunate enough to spend a fair bit of the last year travelling - from Turkey to Italy, the UK, Canada, Scandinavia, Eastern Europe, Spain to Germany. Here's what I learned:\n1. There's nothing wrong with looking \"like a tourist.\"\nA lot of my friends moan about not wanting to look like a dorky tourist, so stuff their suitcases full of party dresses, heels, vests (possibly the most redundant item of clothing ever - when are your core and arms ever at such different temperatures that they demand a sleeveless shearling number to equalise them?) and leather jackets. This kind of prissiness strikes me as serious overcompensation. It's not as though the only two travel options are \"fashion-conscious\" and \"below-the-knee cargo shorts, gormless expression, bumbag, bus-driver socks with Gore-Tex Velcro sandals and a loud Hawaiian shirt layered over a 'Show Me The Way To The Buffet' t-shirt.\" You can look like a tourist without looking like a trope; I personally aim for a 'practical and inoffensive' appearance. What I'm saying is, ditch the GHD.\n2. It's all in the shoes and the bag.\nOf course, you don't want to appear too touristic lest this subjects you to sub-par service. In Budapest, for example, I'm fairly sure that it was our sporty (read: bedraggled) appearance that sparked snooty treatment. At one café, a waiter flat-out refused to let us order cake. \"But I've been dreaming about this cake for days,\" my friend Sam jokingly pleaded. \"We all have dreams,\" the waiter sniffed, before haughtily stalking off. I have since traded my nylon blue backpack for an unobtrusive black Hedgren cross-body bag, and avoided such Pretty Woman shopping-scene moments. This wonder-bag also allows me to slip through security in art galleries rather than go through the rigmarole of putting it in a locker or carrying it frontal-papoose-style. Shoe-wise, brands like Homyped and Ecco make sandals that are comfortable enough to trek around in all day, yet don't scream 'Dwight Schrute does casual Friday'.\n3. You only ever need 3 outfits. And a bar of Sard.\nTravelling through Spain and Germany this past summer, I did a fair bit of hand-wringing. By which I mean that I would handwash and wring out my clothes (washerwoman style), not that I was stressing about my outfit rotation. My failsafe evening routine consisted of: attacking the day's clothes with a bar of Sard soap in the hotel sink, wringing them out, wrapping them in hotel hand-towels to wring them out again (the towels soak up the excess water so the clothes are dry by the next morning), and hanging them in the shower/over chairs/off light fittings. This took all of 10 minutes which seems preferable to seeking out a Laundromat every few days (I don't have the patience for that; I'm not a leisured NY grad student in a 90s sitcom). Cold weather is even easier - heavy clothing won't dry as quickly, but the cold dulls the smell, which renders washing unnecessary (hey, the care instructions for most jeans these days are \"don't wash; stick in the freezer once every 6 months\" anyway).\n4. Get a traveller's pouch\nCarrie Bradshaw may like her money where she can see it - hanging in her closet - but I like mine (and my passport) where I can feel it - chafing against my belly in an elasticised beige bag. I wore a traveller's pouch throughout Turkey, Italy and Spain. This made me feel kind of like a drug mule (or perhaps the world's most fortunate colostomy patient), and was a bit difficult to accommodate with skimpy clothing (though there were far more obvious reasons for me to avoid the crop top). However, it was absolutely worth it for the feeling of security. I found that the best disguise for a traveller's pouch is a peplum top, babydoll or a loose long-sleeve Wee Willie Winkie-esque shirt.\n5. Do highly specific research\nGoogle is your friend for questions like: Do I need to take a power adaptor and voltage converter? What medicines can I get over the counter? Should I bring my own gastro-stop? Is it safe to eat raw salad leaves? How does the transport system work?\nIt's a good idea to research the scams that may be trending in the country you're visiting. In Italy, for example, I was on the lookout for gypsies tossing babies or people posing as train attendants in off-brand uniforms; in Spain, for people offering free flamenco lessons on the street. It also pays to read TripAdvisor threads for each city and attraction you plan to visit. While you'll have to wade through some outliers (there's always some insufferable sod complaining that the Prado museum has too many masterpieces, or that the Sagrada Familia is 'underwhelming', or that the walk up a series of gently inclining ramps hurt their knees...) you can pick up useful tips like whether you should buy tickets in advance, how long you should set aside for each attraction, and which of multiple museum entrances offers the speediest entry.\n6. Download a translation app.\nIt's a good idea to learn a few words of the local language for courtesy's-sake ( please, thank you, I'm terribly sorry ) and so that you can order your coffee and food as you like it. In Spain, for example, I learnt after repeatedly receiving ham on toast for breakfast that 'jam' is taken as an Anglo shortening of jamon , and that mermelada is the key to delicious fruit conserve. A translation app is handy for more specific queries. To give a completely random hypothetical, it would be much easier to show a bewildered pharmacist a screenshot of bindehautentzündung than to mime 'woke up with eyes weeping with conjuctival pus', or to discretely flash your phone's translation of 'cold sore' to a chemist in Italy than to struggle with the translation (though frustratedly announcing 'Herpes!' will get results. Hypothetically.)\n7. Get a selfie stick.\nWhile it's sufficient to brush up on your photography skills for landscape snaps (tip: study the technique of Asian men; no-one does the human tripod better) it's always nice to have some photos with you in them. Standard selfies aren't ideal; you need to be able to discern where your pouting face is, and not just from the Minnie Mouse ears perched atop your head. This is where the selfie-stick comes in. Sure it'll attract some derisive sniggers, and has been banned in some places, but it really is the key to great travel pictures. Of course you can ask a passerby to take your photo (or offer to take theirs, thus pressuring them to reciprocate) but more often than not you end up with a blurry photo, their fleshy thumb obscuring the screen...or it's just a hassle for all involved.\nI don't think it's going too far to say that the selfie-stick is the ultimate symbol of self-sufficiency, which is one of the greatest achievements, and joys, of travelling.\n ", "external_links": ["http://www.huffingtonpost.com/?ncid=txtlnkusaolp00000618"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-07T08:02:49.918+03:00", "highlightTitle": ""}