{"organizations": [], "uuid": "23b8f699678ae0c0ef2ee48a28e430013da3077c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tripideas/could-you-start-your-own-country/ar-AAeX7jj", "country": "US", "title": "Could you start your own country?", "performance_score": 0, "site": "msn.com", "participants_count": 2, "title_full": "Could you start your own country?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 1, "uuid": "1557feb42494d0d81625781ac4ffd3bbf493d15e"}, "author": "Wanderlust", "url": "http://www.msn.com/en-us/travel/tripideas/could-you-start-your-own-country/ar-AAeX7jj#post-0", "ord_in_thread": 0, "title": "Could you start your own country?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Could you start your own country? Wanderlust 3 days ago Wanderlust Ever got sick of the way things are run in your own country? Ever found yourself muttering “If I were in charge...”? Well some people decide to act on it and actually start their own country. Introducing the ‘micronation’, basically a legally unrecognised country that lays claim to land that is either disputed or its members believe to be unadopted.\nThree new micronations have already been formed in 2015. The Free Republic of Liberland, the Kingdom of Enclava and the Principality of Ongal all lay claim to land along the Croatia-Serbia border opened up by the 1990s Yugoslav Wars.\nWithin the last 10 years, the number of micronations has risen – more than 100 of them now exist in the world today. So are they real countries and can you visit them? While none have been officially recognised – it takes a defined territory, permanent population and a capable government for that to happen – you can still pay some of them a visit.\n“Tours are given free of charge by the monarchy and there’s no limit on photos,” says Lord Steven Baikie, from the Principality of Hutt River in Australia – which requires a passport and visa payment if you want to enter. Some places, like Whangamomona Republic in New Zealand, are an easy visit with no border controls, but others – as with Liberland – are off limits (Croatia has blocked access there since its inception).\n© Shutterstock Man on top of mountain (Shutterstock) Then there are the marketing savvy ones – the UK micronation of Sealand offers official stamps, currency, flags and the chance to become a Lord, Baron or Knight. But why are more of them cropping up today? “The internet,” says Emperor Eric Lis of the 28-year-old Aerican Empire, a Canadian micronation. “It inspires copycats.”\nSo though we travel aficionados may have thought there was a finite number of places for us to visit, it turns out that number is growing all the time. So grab your passport and start making a new must-travel list – now where do we book a flight to Ladonia..?\nFive micronations you (probably) didn't know existed North Dumpling Island A private island owned by Segway inventor Dean Kamen a mile off the coast of Connecticut, he declared he was breaking away from the United States after he wasn’t allowed to build a wind turbine.\nSealand\nThis disused Second World War sea fort off the Suffolk coast was initially set up as a pirate radio station by Paddy Roy Bates. In 1978, the inhabitants had to overcome an invasion by Dutch and German mercenaries.\nPrincipality of Hutt River\nAustralia’s oldest micronation, it was born in 1970 after farmer Leonard Casley and the government disagreed about crop sales but now welcomes 40,000 visitors per year.\nNaminara Republic\nCreated as a tool to boost tourism to Namiseom Island in South Korea, the ploy seems to have worked – 1.5 million people visit the wildlife-laden micronation each year.\nKingdom of North Sudan\nFounded on the promise that he would make his daughter a princess, American Jeremiah Heaton has laid claim to Bir Tawil, an 800 sq mile unclaimed slice of land between Sudan and Egypt.\nGo to MSN Home This feature is not supported on the version of your browser. We recommend upgrading to the latest version of Internet Explorer to use this feature.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-03T15:06:44.490+03:00", "highlightTitle": ""}