{"organizations": [], "uuid": "cda73082e54b14042d13f4564b296e79937ac2cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20151015/1297468.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/730892/vegetarian-festival", "country": "TH", "title": "Vegetarian Festival", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Vegetarian Festival", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:26:00.000+03:00", "replies_count": 0, "uuid": "cda73082e54b14042d13f4564b296e79937ac2cd"}, "author": "", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/730892/vegetarian-festival", "ord_in_thread": 0, "title": "Vegetarian Festival", "locations": ["Thailand", "Malaysia", "Singapore", "Indonesia", "Southeast Asia", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWSPAPER SECTION: LIFE | WRITER: PICHAYA SVASTI - + The Vegetarian Festival originated in China, and is based on a Chinese belief that seven Lord Buddhas and two bodhisattvas (enlightened beings) annually visit the world in the form of nine deities. They stay for nine days and nine nights in the ninth lunar month. In Southeast Asia, the Vegetarian Festival has become a tradition in Singapore, Malaysia, Indonesia and Thailand. This traditional observation of vegetarian diet is for people of Chinese descent to do spiritual cleansing and merit-making. This year, the festival in Thailand is being celebrated until Oct 21. \nFire-walking in Phuket. \nIn the Central Region, several provinces are celebrating the festival, the biggest ones being Bangkok and Samut Sakhon. In Bangkok, a lot of festivities such as vegetarian cooking and food fairs are being held along Yaowarat Road for nine days. Highlights are a Chinese lion dance, a flower float carrying deity statutes and a ceremony to select a virgin to represent Guan Yin, the Goddess of Mercy, on the first day. Call Samphanthawong District Office on 02-237-9127 . In Samut Sakhon, which served as a port for Chinese junks in the past, local residents and visitors can take part in merit-making at nine major Chinese shrines and buy vegetarian food from more than 50 booths outside the City Guardians Shrine. Call the Samut Sakhon City Municipality on 034-411-208 . In the Eastern Region, the Pattaya Vegetarian Food Festival 2015 will continue until Oct 22 at the Sawang Boriboon Foundation in Na Klua district, Chon Buri. A procession of Chinese deities accompanied by devotees in white clothes marks the start of the celebration, followed by an auspicious communal meal complimented by peaches for good fortune. Call the Tourism Authority of Thailand (TAT)'s Pattaya Office on 038-427-667 . In the South, several provinces host the celebrations in different styles. In Ranong, where many Thai people of Hokkian Chinese descent live, the Ranong Vegetarian Festival and its sacred rituals are believed to bring good fortune to those who observe the rites. The nine-day celebration takes place at Tai Tae Eia Shrine. Call the shrine on 077-835-195 . In Phuket, the country's most colourful celebration of the festival coincides with the Nine Emperor Gods Festival. Many religious devotees adhere to a strict vegetarian diet to ensure the purification of mind and body. Visitors will be able to observe rituals such as fire-walking and body-impaling. Call TAT's Phuket Office on 076-211-036 . In Trang, which was an international trading port, the festival includes vegetarian food, continuous prayer chanting, a procession of Buddha statues and Chinese god statues, ceremonies to drive away bad fortune, fire-walking, bridge-crossing and stair-of-knives-climbing rituals, a candle ceremony and cultural performances. Call Chao Por Muen Ram Shrine on 075-219-434 or Kiew Ong Eiar Shrine on 075-210-701 . In Krabi, more than 40 Chinese shrines hold processions of Buddha statues and provide vegetarian food for those coming to worship the statues at each shrine in order to purify body and soul, bring good luck, prosperity and longevity. Call TAT's Krabi Office on 075-622-163 . In Phangnga province, locals clad in white will be able to enjoy free vegetarian meals from Chinese shrines in their neighbourhood. Celebrations include a procession of Chinese deities and rituals, such as fire-walking. Call the Phangnga Tourism Coordination Centre on 076-481-900--2 . In Songkhla's Hat Yai district, the Vegetarian Festival includes the annual procession of Buddha statues, the worship of Chinese deities, the blessings of Buddhist monks, a parade of spiritual mediums and the sale of vegetarian delicacies by more than 108 vendors. There will also be a ceremony to see off Chinese gods to heaven on Chalathas beach. Call TAT's Hat Yai Office on 074-231-055. For more about the festival nationwide, call TAT's Call Centre on 1672. \nif you have any news to share. Tell us what you think about this article Like dislike 0 people liked / 0 people disliked it Share this article", "external_links": [], "published": "2015-10-14T23:26:00.000+03:00", "crawled": "2015-10-15T10:32:45.088+03:00", "highlightTitle": ""}