{"organizations": [], "uuid": "3580c632bf45067bc47ed71aa0ea66b3b2466338", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64880/let-games-begin-world-travel-market-inaugurates-tourism-cup-comp", "country": "US", "title": "Let the games begin: World Travel Market inaugurates Tourism Cup competition", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Let the games begin: World Travel Market inaugurates Tourism Cup competition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T00:08:00.000+03:00", "replies_count": 0, "uuid": "3580c632bf45067bc47ed71aa0ea66b3b2466338"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64880/let-games-begin-world-travel-market-inaugurates-tourism-cup-comp", "ord_in_thread": 0, "title": "Let the games begin: World Travel Market inaugurates Tourism Cup competition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Let the games begin: World Travel Market inaugurates Tourism Cup competition   \nOct 15, 2015 eTN   \nThe MMGY Tourism Cup competition, inspired by well-known international golf competitions, the Ryder Cup and the Solheim Cup, will match a team of European travel and tourism leaders against their American counterparts in a debate-style forum that will cover topics shaping today's tourism industry. \nThe inaugural debate will utilize current research, insights and case studies to test the two teams’ tourism knowledge. \nWorld Travel Market London (WTM) 2015, the leading global event for the travel industry, together with international travel and hospitality marketing communications agency MMGY Global will be hosting a lively and insightful competition between European and American tourism leaders who will battle it out for the chance to walk away as winners of the inaugural MMGY Tourism Cup. \nEduardo Santandar, CEO and Executive Director of the European Travel Commission will captain a group that faces off against a team led by Todd Davidson, U.S. Travel Association National Chair, CEO of Travel Oregon as they compete in four entertaining rounds. \nThe one-hour session will be moderated by MMGY Global Vice Chairman Peter Yesawich and co-hosted by the sponsoring company Adara, featuring the organization’s Vice President of Resort and Destination Analytics, Ted Sullivan. \nAdditional team competitors will include Joss Croft, CMO, Visit Britain; Mark Henry, Central Marketing Director, Tourism Ireland; Ida Gutiérrez de Escofet, SVP Corporate Affairs, CSR and Communication, NH Hotel Group; Tam Pigott, Executive Director, The Beaches of Ft. Myers and Sanibel; Barry Goldstein, Chief Digital & Distribution Officer, Wyndham Hotel Group; and Rob Torres Managing Director, Travel, Google. \nThe friendly competition will also be raising money and awareness for the international water aid organization, Just a Drop. \nWTM London delegates in the audience will be encouraged to vote and share information in an effort to raise the donation from MMGY Global and event sponsor Adara toward the worthy cause. \nWorld Travel Market London, Conference and Seminar Manager, Charlotte Sutton said: \"This is an exciting new addition to the WTM London Event Programme for 2015, the first time WTM London has done anything like this. \n“It will be great to see how the two teams battle it out in each of the rounds and draw from their collective intelligence, as well as their collective influence in the industry. This competition will benefit not just the delegates in the audience but also raise awareness for Just a Drop, the water aid charity that World Travel Market London fully supports year-round.” \nThe MMGY Tourism Cup Competition will take place on Tuesday, November 3, at WTM London on the WTM Global Stage from 1615-1715 hours. \neTurboNews is a media partner for World Travel Market (WTM).", "external_links": [], "published": "2015-10-16T00:08:00.000+03:00", "crawled": "2015-10-16T00:20:40.457+03:00", "highlightTitle": ""}