{"organizations": [], "uuid": "67414be0bea7d50d76cb4e153bb0327aaf3cee21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30338586/insurance-may-not-cover-the-strongest-hurricane-on-record-says-squaremouth", "country": "US", "title": "Insurance May Not Cover the Strongest Hurricane on Record, says Squaremouth", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Insurance May Not Cover the Strongest Hurricane on Record, says Squaremouth - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "67414be0bea7d50d76cb4e153bb0327aaf3cee21"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30338586/insurance-may-not-cover-the-strongest-hurricane-on-record-says-squaremouth", "ord_in_thread": 0, "title": "Insurance May Not Cover the Strongest Hurricane on Record, says Squaremouth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Squaremouth\nST. PETERSBURG, Fla. , Oct. 23, 2015 /PRNewswire/ -- Virtually overnight, Hurricane Patricia intensified to the strongest storm on record, with Puerto Vallarta in its path. While residents prepare for the worst, travelers with upcoming trips to the popular destination are left with few options. According to Squaremouth , one of the nation's leading travel insurance comparison sites, it is now too late to buy a travel insurance policy for the storm.\nMost travel insurance policies include \"Hurricane and Weather\" coverage within the Trip Cancellation benefit. This provides reimbursement for prepaid and non-refundable trip costs if a traveler is unable to reach their destination due to a storm.\nHowever, once a storm is named, it becomes excluded from all policies, meaning there is no coverage for any losses related to the storm. For coverage related to Hurricane Patricia, the cutoff date was Thursday, October 22 , when the storm was named. Any policies purchased before this date may still offer benefits relating to the storm.\n\"While hurricane coverage is common among travel insurance policies, most are very specific about what triggers this benefit,\" explained Squaremouth Claims Manager, Brandi Morse . \"Most policies require the traveler's destination be uninhabitable or their transportation be delayed for a significant amount of time.\"\nSimply not wanting to travel because of the storm is never covered under standard policies.\n\"Planning a beach getaway at the end of hurricane season may seem like a safer bet for travelers, but Hurricane Patricia's appearance shows this isn't the case,\" said Squaremouth CEO Chris Harvey . \"This storm serves as an unfortunate reminder for travelers that even the strongest hurricane on record may not be covered.\"\nTravelers can stay informed about insurance coverage for Hurricane Patricia in Squaremouth's Extreme Weather and Travel Insurance Information Center . This is updated with official provider position statements, answers to frequently asked questions, and current government travel alerts and notices as they become available.\nABOUT SQUAREMOUTH\nSquaremouth is an online company that compares travel insurance products from virtually every major travel insurance provider in the United States . Using Squaremouth's comparison engine and third party customer reviews, travelers can research and compare insurance products side-by-side. More information can be found at www.squaremouth.com .\nAVAILABLE TOPIC EXPERT\nMegan Singh\nmsingh@squaremouth.com\n(727) 378-0983\n releases/insurance-may-not-cover-the-strongest-hurricane-on-record-says-squaremouth-300165620.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/insurance-may-not-cover-the-strongest-hurricane-on-record-says-squaremouth-300165620.html", "http://www.squaremouth.com/", "https://www.squaremouth.com/current-event-information-centers/weather-travel-insurance-information-center/", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL37347&Transmission_Id=201510231915PR_NEWS_USPR_____FL37347&DateId=20151023", "https://www.squaremouth.com/"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T03:14:08.338+03:00", "highlightTitle": ""}