{"organizations": ["Britannia Club", "Britannia Club Restaurant", "Britannia Single", "Cunard", "Britannia Club Balcony", "Queen Mary", "SOUTHAMPTON", "U.S. Travel Association", "Cunard North America", "Blohm+Voss Shipyard"], "uuid": "71d74d09964b272e976233dcdad49c709a561b2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_5_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13321247/1/redesigned-britannia-club-balcony-staterooms-and-new-britannia-single-staterooms-will-offer-fine-tuned-private-enclaves.html?cm_ven=RSSFeed", "country": "US", "title": "Redesigned Britannia Club Balcony Staterooms And New Britannia Single Staterooms Will Offer Fine-Tuned Private Enclaves", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Redesigned Britannia Club Balcony Staterooms And New Britannia Single Staterooms Will Offer Fine-Tuned Private Enclaves", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:00:00.000+03:00", "replies_count": 0, "uuid": "71d74d09964b272e976233dcdad49c709a561b2b"}, "author": "", "url": "http://www.thestreet.com/story/13321247/1/redesigned-britannia-club-balcony-staterooms-and-new-britannia-single-staterooms-will-offer-fine-tuned-private-enclaves.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Redesigned Britannia Club Balcony Staterooms And New Britannia Single Staterooms Will Offer Fine-Tuned Private Enclaves", "locations": ["England", "Hamburg", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mary", "Richard Meadows"], "text": "Reprint SOUTHAMPTON, England , Oct. 13, 2015 /PRNewswire/ -- Queen Mary 2 's redesigned Britannia Club Balcony staterooms and all-new Britannia Single staterooms will offer passengers more options and a more elegant, modern stateroom experience. Fresh design schemes and fine details will pay tribute to the original Queen Mary's iconic art deco heritage while keeping this grand ocean-liner at the forefront of luxury. During her extensive 25-day refit at the Blohm+Voss Shipyard in Hamburg, Germany , Cunard flagship Queen Mary 2 will receive a wide range of upgrades, including 30 new Britannia Club Balcony staterooms and 15 Britannia Single staterooms, as well as a comprehensive refurbishing of all pre-existing Britannia Club Balcony cabins. Britannia Club guests enjoy an elevated experience onboard with large, well-appointed balcony staterooms, all with prime locations as well as the freedom to dine when you choose in the dedicated Britannia Club Restaurant - the perfect setting for those who prefer a more intimate dining experience. A pillow menu is available to help you achieve the perfect night's sleep, alongside a host of other luxurious touches and amenities including: Convenient 24-hour room service Nightly turndown service with chocolate Penhaligons toiletries Soft terry robes and slippers Refrigerator, safe and hair dryer Satellite TV with multi-language film and music channels \"Catering to the changing tastes of our guests is a priority at Cunard,\" said Richard Meadows , president, Cunard North America . \"According to the U.S. Travel Association, solo travelers comprise about 23% of all leisure travelers. In addition, we are seeing a strong demand for Britannia Club accommodations. We have carefully considered these needs in Queen Mary 2's refit by rejuvenating the current Britannia Club staterooms and creating additional accommodations for these respective groups.\"Refreshed designs in the Britannia Club and the new Britannia Single staterooms will include softer colour tones to enhance the feeling of space, as well as new contemporary carpet patterns inspired by the geometric diamond designs seen on the original Queen Mary . Of the 15 Britannia Single staterooms that will be added, nine single cabins will be on Deck 2 and six larger single staterooms will be built on Deck 3L. New single cabins on port side Deck 2 will benefit from increased ceiling height and an illuminated coffered ceiling. New single cabins on port side Deck 3L will feature two unique circular windows with bench seat cushions and a central dressing console table. 1 of 3", "external_links": [], "published": "2015-10-13T15:00:00.000+03:00", "crawled": "2015-10-13T15:12:50.270+03:00", "highlightTitle": ""}