{"organizations": [], "uuid": "15a5b05f9ab0fe1539ca80a8734ab8b63f28310e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30258530/new-workforce-study-is-first-of-its-kind-for-port-of-montreal-drayage-sector", "country": "US", "title": "New workforce study is 'first of its kind' for Port of Montreal drayage sector", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New workforce study is 'first of its kind' for Port of Montreal drayage sector - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "15a5b05f9ab0fe1539ca80a8734ab8b63f28310e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30258530/new-workforce-study-is-first-of-its-kind-for-port-of-montreal-drayage-sector", "ord_in_thread": 0, "title": "New workforce study is 'first of its kind' for Port of Montreal drayage sector", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Asia Pacific Gateway Skills Table\nMONTREAL , Oct. 14, 2015 /CNW/ - The Asia Pacific Gateway Skills Table and Montreal Port Authority released findings from the Port of Montreal Drayage Labour Profile and Communications Study today. The study includes a labour force profile of drivers in the region, and an examination of communication technologies currently used by drayage trucking companies and drivers in Montreal .\n\"The message is clear: the drayage workforce is changing. Moving towards newer technologies can help reduce driver wait times at the port and effectively reduce greenhouse gas emissions,\" said Daniel Dagenais , Vice-President Operations at the Port of Montreal . \"Technology will be at the forefront of our plans, and we are excited that this project has given us a greater understanding of the people driving goods to and from our port and how they are communicating.\"\nUsing communications technologies to reduce congestion and wait times is a major factor in increasing productivity for drivers who work full time and who make multiple trips to and from the port.\n\"Employers have shared that receiving real-time information is critically important to help them make decisions about daily trips and operations,\" said Marc Cadieux , President and CEO, Quebec Trucking Association (ACQ). \"We anticipate that more drivers and dispatchers will be using smartphones and GPS to communicate, in addition to going online for information.\"\nAccording to the study many drivers and employers already use smartphones to share and obtain traffic information. The study found that drivers actively using newer technology will increase and a significant percentage of drivers would prefer to use newer technologies to receive their information.\nThe report included a survey of more than 400 drivers and 30 employers, and determined key demographic information about drivers (97 per cent are male, average driver age is 46 years old, and 51 per cent speak French), as well as industry structure (about two-thirds of drivers work for a trucking company, while one-third own their own trucks).\n\"The report shows a picture of a distinctive labour force, how they work, and how they want to receive critical information,\" said Krista Bax , Executive Director, Asia Pacific Gateway Skills Table. \"Our study findings can be used as a guide for the port and employers on how best to communicate with drivers, which benefits the entire sector.\"\nQuestions focused on preferences, methods and tools used to communicate between employers and drivers. This is the third report that the Asia Pacific Gateway Skills Table has undertaken on the drayage industry, and the first to focus on Montreal's drayage sector.\nTo download the Port of Montreal Drayage Labour Profile and Communications Study , please visit: http://www.apgst.ca/projects/pdfs/APG_Montreal_Dray_Final-web.pdf\nThis project is funded in part by the Government of Canada's Sectoral Initiatives Program, which aims to address current and future skills shortages.\nAbout Asia Pacific Gateway Skills Table\nThe Asia Pacific Gateway Skills Table is a non-profit, regional partnership between labour, business and education/training institutions. Its mission is to ensure the Asia Pacific Gateway has enough people with the right skills and training to meet its needs. For more information, visit apgst.ca\nAbout Montreal Port Authority\nThe Montreal Port Authority (MPA) is an autonomous federal agency created under the terms of the Canada Marine Act. It does everything in its power to make the Port of Montreal as competitive as possible, and from this perspective it provides first-rate facilities to sea and land carriers, to terminal operators and to shippers.\n ", "external_links": ["http://www.apgst.ca/projects/pdfs/APG_Montreal_Dray_Final-web.pdf", "http://rt.prnewswire.com/rt.gif?NewsItemId=C8615&Transmission_Id=201510140930CANADANWWEB______C8615&DateId=20151014", "http://www.xmlnews.org/ns/", "http://apgst.ca/"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T18:19:13.049+03:00", "highlightTitle": ""}