{"organizations": [], "uuid": "f58c65063150249d5d968f1333a9156476cc1856", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30316881/10-extraordinary-discounts-people-age-50-and-above-should-know-about", "country": "US", "title": "10 Extraordinary Discounts People Age 50 And Above Should Know About", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "10 Extraordinary Discounts People Age 50 And Above Should Know About - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "f58c65063150249d5d968f1333a9156476cc1856"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30316881/10-extraordinary-discounts-people-age-50-and-above-should-know-about", "ord_in_thread": 0, "title": "10 Extraordinary Discounts People Age 50 And Above Should Know About", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " AARP Services, Inc.\nFrom Electronics to Entertainment, AARP Members Can Access a Variety of Everyday Savings\nWASHINGTON , Oct. 21, Many AARP members already know of the discounts available to them on travel-related goods and services, such as car rentals, hotels, vacation packages and cruises. However, they might be surprised to learn they qualify for additional discounts on everyday costs, such as groceries, car maintenance and movie tickets.\n\"AARP members often tell us they enjoy the popular travel and dining discounts that are available to them,\" said Angela Jones , senior vice president, business development and lifestyle products at AARP Services, Inc. \"In fact, since Denny's launched their promotion in 2010, AARP members have utilized the discount more than 48 million times.\"\nHowever, they might not know they are missing out on additional opportunities to save every day, Jones added. With an AARP membership, Americans 50 and over can unlock the potential to save on electronics, concerts, pet insurance plans, shipping costs and even regular car maintenance.\nIn addition to popular travel offers, AARP members can save on the following products and services:\nMovie Tickets : Regal Entertainment Group offers AARP members up to 25 percent off Regal movie tickets as well as $3.00 off a small or larger-size popcorn and soft drink combo. E-readers and Books : AARP members save 10 percent on Amazon Kindle e-readers, 50 percent on a selection of Kindle eBooks and 10 percent on a selection of print and audio books on Amazon.com from popular genres such as romance, mystery, thriller, and historical fiction. Car Maintenance : By presenting their AARP membership card at time of service, AARP members pay just $17.99 every day for an oil change, tire rotation and maintenance inspection at any Monro Muffler Brake & Service or Mr. Tire location. They also save 10 percent on auto repairs at any RepairPal certified shop. Shoes : AARP members save 20 percent on their entire purchase at any Reebok and Rockport Outlet Store or on Reebok.com. Dining : AARP members receive 15 percent off every day at Outback Steakhouse, Carrabba's Italian Grill and Bonefish Grill; 15 percent off the entire check at Denny's; 10 percent off at any of the 500 Landry's Inc. restaurants nationwide, including McCormick & Schmick's, Claim Jumper, Chart House and more. Shipping : AARP members receive 15 percent off eligible products and services and 5 percent off domestic and international UPS® shipping services when using their AARP membership card at over 4,500 retail The UPS Store locations. Pet Insurance : Pet owners save 10 percent or more insurance plans with Petplan pet insurance when they sign up online. They also receive up to a $35 Petplan Visa® Prepaid Card (restrictions may apply) to help with pet wellness expenses like flea/tick preventives, vaccines, dental cleanings and more. Grocery and Household Items : AARP members receive instant savings on featured products by swiping their AARP membership card at select Meijer, Family Dollar and Fred's Super Dollar locations, and earn 10 percent back on every order of delicious foods delivered right to their door by Schwan's Home Service. Concerts and Shows: AARP members save 25 percent or more when buying event tickets in groups of four from Ticketmaster, and save up to 30 percent on Cirque du Soleil shows. Mobile Phone Service : AARP members can choose from a variety of wireless service providers, including Consumer Cellular, AT&T and Cricket Wireless. Consumer Cellular offers AARP members a 5 percent discount on monthly service charges and a 30 percent discount on eligible accessories, AT&T offers AARP members a 10 percent discount on the monthly service charge of qualifying wireless plans and a 15 percent discount on eligible accessories, and Cricket Wireless offers a $20 mail-in rebate for each line of service with the purchase of a phone. AARP memberships cost just $16 a year and can often be recouped by using just a few of the many discounts available. To take advantage of any discount or service offered to AARP members, or to find out about all the ways AARP members can save, download the free AARP Member Advantages Offer Finder mobile app for iOS and Android devices or visit aarpdiscounts.com .\nABOUT AARP SERVICES, INC.\nAARP Services, Inc., founded in 1999, is a wholly-owned taxable subsidiary of AARP. AARP Services manages the provider relationships for and performs quality control oversight of the wide range of products and services that carry the AARP name and are made available by independent providers as benefits to AARP's millions of members. The provider offers currently span health products, financial products, travel and leisure products, and life event services. Specific products include Medicare supplemental insurance; credit cards; auto and home, mobile home and motorcycle insurance, life insurance and annuities; member discounts on rental cars, cruises, vacation packages and lodging; special offers on technology and gifts; pharmacy services; and legal services. AARP Services also engages in new product development activities for AARP and provides certain consulting services to outside companies.\n releases/10-extraordinary-discounts-people-age-50-and-above-should-know-about-300163911.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CL34545&Transmission_Id=201510211200PR_NEWS_USPR_____CL34545&DateId=20151021", "http://www.prnewswire.com/news-releases/10-extraordinary-discounts-people-age-50-and-above-should-know-about-300163911.html", "http://discounts.aarp.org/", "http://www.xmlnews.org/ns/"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T23:08:55.764+03:00", "highlightTitle": ""}