{"organizations": ["| Buying Business Travel"], "uuid": "ac0e2168b5f227706b0a5ee239503b01d41d963e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buyingbusinesstravel.com", "main_image": "", "site_section": "http://buyingbusinesstravel.com/rss.xml", "section_title": "Buying Business Travel", "url": "http://buyingbusinesstravel.com/feature/1924845-opinion-can-taxis-take-their-local-economies-global", "country": "IE", "title": "Opinion: Can taxis take their local economies global? | Buying Business Travel", "performance_score": 0, "site": "buyingbusinesstravel.com", "participants_count": 0, "title_full": "Opinion: Can taxis take their local economies global? | Buying Business Travel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:43:00.000+03:00", "replies_count": 0, "uuid": "ac0e2168b5f227706b0a5ee239503b01d41d963e"}, "author": "", "url": "http://buyingbusinesstravel.com/feature/1924845-opinion-can-taxis-take-their-local-economies-global", "ord_in_thread": 0, "title": "Opinion: Can taxis take their local economies global? | Buying Business Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John McCallion"], "text": "0 comments BBT Mon, 19 Oct 2015 11:43 Follow @BBT_online Managing director of ground transport firm Groundscope, John McCallion, discusses the danger to local economies if traditional taxi firms fail to compete against new service providers such as Uber. \nOne area of taxis that is often overlooked is their contribution to the local economy they operate in.\nHow many times have you been travelling on business and wound up eating in a restaurant you’d never have known about without a helpful local cabbie, or visiting a local attraction that wasn’t part of your itinerary when you left home?\nAll of these helpful interventions support local companies that rely on trade from business travellers passing through their part of the country.\nHowever, one threat to local taxi firms – and indirectly to the economies they support – is the huge 1,000 +-car city-based cab service that is the ‘go to’ for most business travellers. Most of these drivers don’t know the local area at all, but the size of the company they represent and its relationships with major international organisations mean they are the default choice for any pre-booked ground transportation. Local taxi firms don’t get a look in.\nToday though, technology innovation is helping the local firm fight back. The emergence of online booking platforms for ground transport – available on web and mobile – means people booking business travel can access a wide selection of rigorously-vetted taxi firms, coaches and cars that are safe, reliable, competitively priced and, above all, local.\nBy signing up as a vetted service provider, local firms can start competing in a much bigger marketplace, and fight for the right to be a global traveller’s ‘option of choice’.\nIn the age of Uber, it’s never been more important for taxi firms to widen their addressable markets but this technology revolution could also have an enormous impact on those hidden gems - pubs, cafes, shops - in towns and cities across the country that could lie undiscovered by travellers without the helping hand of a knowledgeable, local drivers.\nJohn McCallion is a founding stakeholder in the Groundscope business. He has a substantial corporate commercial and marketing background gained with leading retailers including Pepsi Co and Marks & Spencer. John is a business management and marketing graduate and holds a post graduate diploma in marketing from Westminster University.", "external_links": [], "published": "2015-10-19T14:43:00.000+03:00", "crawled": "2015-10-20T05:43:34.994+03:00", "highlightTitle": ""}