{"organizations": [], "uuid": "00b34e1c5224f3764c6595800fd99d8c1d296490", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/RPRC205-118_2015_133644_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/forgotten-colorado-japanese-american-internment-site-opens-door-to-dark-episode-in-us-history-334209471.html", "country": "US", "title": "Forgotten Colorado Japanese-American internment site opens door to dark episode in US history", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Forgotten Colorado Japanese-American internment site opens door to dark episode in US history - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T15:10:00.000+03:00", "replies_count": 0, "uuid": "00b34e1c5224f3764c6595800fd99d8c1d296490"}, "author": "Russell Contreras, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/forgotten-colorado-japanese-american-internment-site-opens-door-to-dark-episode-in-us-history-334209471.html", "ord_in_thread": 0, "title": "Forgotten Colorado Japanese-American internment site opens door to dark episode in US history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GRANADA, Colo. - If you aren't careful on this southeastern Colorado rural highway, you might easily pass the signs leading to a site that marks a dark and unjust episode in U.S. history.\nBut slow down and you'll find nestled along the Colorado-Kansas border in Granada, Colorado, remnants of a gloomy place that even the weeds of the Great Plains can't cover up: the Amache Japanese-American Relocation Center. Behind the dry brushes sit lonely concrete slabs that once housed makeshift homes, a school, even a dancehall for detainees waiting for the end of World War II.\n\nThis Jan. 18, 2015, photo shows a rebuilt watchtower at Camp Amache, the site of a former World War II-era Japanese-American internment camp in Granada, Colo. From 1942 to 1945, more than 7,000 Japanese-Americans and Japanese immigrants were forcibly relocated to what was then called the Granada Relocation Center. They were part of the more than 110,000 Japanese-Americans ordered to relocation camps in California, Colorado, Idaho, New Mexico, Arizona, Wyoming, Utah and Arkansas. (AP Photo/Russell Contreras) \nThere's a recreated watchtower where armed guards kept internees behind the gates, and random artifacts scattered through the landscape. They tell a story of Americans imprisoned solely because of their ethnic background after Japan's bombing of Pearl Harbor.\nAmong those detained here were a cartoonist who once worked for Walt Disney and a Medal of Honor recipient who gave his life fighting in World War II for the U.S. Army.\nFrom 1942 to 1945, more than 7,000 Japanese-Americans and Japanese immigrants were forcibly relocated to what was then called the Granada Relocation Center. They were part of the more than 110,000 Japanese-Americans ordered to camps in California, Colorado, Idaho, Arizona, Wyoming, Utah, Arkansas, New Mexico and other sites.\nExecutive Order 9066, signed by President Franklin D. Roosevelt, forced Japanese-Americans, regardless of loyalty or citizenship, to leave the West Coast and other areas for designated camps surrounded by barbed wire and military police. Half of those detainees were children.\nAt Amache, they lived in an area next to poor Mexican-American farm workers. They tried to go on with life as normal as possible. They produced a newspaper, the Granada Pioneer, which featured the worked of detainee cartoonist Chris Ishii. They tried farming, held Christmas block parties and even formed a football team. They lived there even as their sons were drafted into the U.S. Army.\nSeventy years ago this month, on Oct. 15, 1945, shortly after Japan's surrender, the last detainees left Amache and the internment site closed. It remained largely untouched until it became listed on the U.S. National Register of Historic Places in 1994 and a local high school teacher founded the Amache Preservation Society.\nToday, the buildings for the 20-by 24-foot barracks where families were forced to live are gone. So are the police station, the co-op store and Amache High School. All that's left are concrete floors and signs giving details about what was once here.\nA cemetery for the 121 inmates who died while in captivity remains and their bilingual tombstones are decorated with coins. The cemetery grounds include a monument for the 31 Japanese-Americans who volunteered for military service from Amache, then lost their lives in battle while their families remained locked up.\nVisitors might drive around confused if not for the informative billboards at the camp's entrance explaining the locations and showcasing photos from Amache daily life. But you also can download a free podcast from the Amache website for an audio tour of the 600-acre camp with narrowly paved roads.\nThere is no cost to visit Amache. But you can't buy Amache souvenirs like T-shirts or coffee mugs at the site. It is a place to wander, meditate and take an occasional photo. The rest is left to the imagination.\n\"I have brooded about this whole episode on and off the past three decades for it is illustrative of how an entire society can somehow plunge off course,\" Milton S. Eisenhower, the first director of the War Relocation Authority, later said in 1974 of the internment of Japanese-Americans.\nUnder the buried weeds here in Colorado, the story of that course still asks to be remembered. All that is needed is for travellers to slow down and take a turn on a road that could easily be otherwise missed.\n___\nIf You Go...\nCAMP AMACHE: Located in southeastern Colorado about a mile and a half west of the town of Granada and half an hour drive from the Kansas border. It is off of Highway 385/50 along the Santa Fe Trail; http://www.amache.org/.\n___\nFollow Russell Contreras on Twitter at http://twitter.com/russcontreras .\n ", "external_links": [], "published": "2015-10-19T15:10:00.000+03:00", "crawled": "2015-10-19T22:54:27.448+03:00", "highlightTitle": ""}