{"organizations": [], "uuid": "847669bb2bc5bca0e8fbe6fa7b9d1e5358e9bec4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443529165917/d88f0b06-af52-414b-a2f5-28be73e07410-2060x1236.jpeg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=50a9e8947dbc88dcfa21cede3c7ce41c", "site_section": "http://www.theguardian.com/travel/all", "section_title": "Travel | The Guardian", "url": "http://www.theguardian.com/lifeandstyle/2015/oct/10/extreme-sports-slacklining-free-climbing-spencer-seabrooke", "country": "GB", "title": "Extreme sports special: 'I get the urge to jump when I'm standing on the edge' | Life and style", "performance_score": 0, "site": "theguardian.com", "participants_count": 14, "title_full": "Extreme sports special: 'I get the urge to jump when I'm standing on the edge' | Life and style | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:00:00.000+03:00", "replies_count": 17, "uuid": "dd269d5d41159b5c5598616539735b298246089d"}, "author": "Becky Barnicoat", "url": "http://www.theguardian.com/lifeandstyle/2015/oct/10/extreme-sports-slacklining-free-climbing-spencer-seabrooke#post-0", "ord_in_thread": 0, "title": "Extreme sports special: 'I get the urge to jump when I'm standing on the edge' | Life and style", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The volcano boarder: Zoltan Istvan\nAny snowboarder visiting the island of Tanna in the South Pacific, as I did in 1995, would have had the same thought when they set eyes on its volcano. Mount Yasur has a near-vertical, 1,000ft pumice slope on its north side, and I looked at its treeless, virgin face and said to myself, “I’ve got to go down that.”\nIt took an hour to hike to the top in the sweltering heat, during which the volcano belched smoke and hurled out rocks of solidified lava. It was quiet when I reached the half-mile wide crater, but I didn’t hang around. As I pushed off, the volcano erupted again and a lava bomb exploded on the slope 100ft away.\nVolcano boarding. Photograph: Matthew Micah Wright/Getty Images/Lonely Planet Images For me, this is the thrill of the sport that I invented that day. Some people board down extinct volcanos, but as far as I’m concerned it’s not the same thing – and Mount Yasur is the most exciting volcano I’ve tried. There are a number of dangers: the potential of being overwhelmed by gases, the lava bombs and the solidified lava that can be sharp and hidden under the pumice scree. Most deadly, though, are the “bullets” of hot lava, which can fly up to half a mile from the crater at speeds great enough to punch straight through someone. There are three memorials on the slopes of Yasur to tourists killed in this way.\nA film of me slaloming down Mount Yasur on my snowboard created a lot of interest in the sport. Currently, there’s a handful of people taking part in volcano boarding on any given day across the world – there’s a volcano in Nicaragua that’s particularly popular.\nThe closest call I have ever had was a lava bomb that landed about 20ft away, but I wouldn’t want to overemphasise the danger. It’s all about the joy of boarding combined with the thrill of having something explode behind you. You have to keep an eye on the sky the whole way down.\nI think an adapted form of volcano boarding could easily be included in the Transhumanist Olympics, too. Now that is something I’d love to try.\nAs told to Chris Broughton\nFacebook Twitter Pinterest Base jumper Gary Connery at Monte Brento, Italy. The Base jumper: Ellen Brennan\nI became addicted to freefall on my 18th birthday when I was given a skydive as a present. The fear I felt before jumping evaporated as I stepped into space, and I became lost in the moment. After that, it was all I talked about, all I ever wanted to do.\nAs an adrenaline junkie, I was soon looking for my next thrill. I decided to take up Base jumping and wingsuiting, leaping from hot air balloons or tall structures, relying on my wits to decide when to pull the ripcord and release the parachute. I even moved from New York to Chamonix in France, where I can jump from high cliffs and fly through mountainside scenery, often no more than a few feet from the ground.\nThere’s something tranquil about the first couple of seconds of freefall. There’s a feeling of serenity. It’s partly a sense of being able to do something that ought to be impossible. Each time I fly a new route, I know I’m seeing it from a perspective that no one else has before.\nIf I Base jump on my own, I’ll call a friend before I do and leave the phone on in my pocket. That way, if I have an accident they’ll know where I am. I’m always aware of the potential danger. There are only so many people doing this in the world, so when anyone dies, it’s someone you know.\nWhen I’m on top of a mountain, the idea of hiking down seems horrific when I could jump off instead, fly at more than 100mph and land safely at the bottom in two minutes. Even so, I never take unnecessary risks – if conditions change for the worse before a jump, I’m not ashamed to hike back down on foot.\nBut there has to be an element of the unknown. I’m looking at doing big jumps from mountains you need crampons and ropes to climb, with longer flights down, landing on glaciers. I’m perhaps more cautious than I used to be, but I’m more skilled, too, and if it wasn’t scary, I don’t think I’d do it. CB\nFacebook Twitter Pinterest Spencer Seabrooke breaks the free solo slackline world record in British Columbia. Photograph: YouTube The slackliner: Spencer Seabrooke\nSome people talk about having an urge to jump when they’re high up. I have that urge when I’m standing on the edge, about to walk a slackline. I enjoy the abyss, it’s a powerful thing. It’s just air, but it has a crazy energy to it. When I “free solo”, without the use of a leash or a harness, all that separates me from that abyss is a long, flat strip of webbing an inch wide, slung between two anchor points.\nThere are all kinds of ways to make the walk safer – a full harness, a “swami belt”, which is just a rope tied around your waist or ankle. It’s a good way to practice but free solo is where slacklining really comes alive for me. It seems much simpler when you’re out there with nothing else to think about – it’s just you and the void, and you’re completely in control.\nIt’s not about overcoming fear, it’s about controlling it. Fear is a good thing. Fear is what keeps you alive. When you’re afraid your senses are heightened and you’re super-aware of everything that’s going on around you. You still feel confident in your head but your body gets an overwhelming buzz.\nI have to push myself just to physically get on to the line – the scariest part is that first second of standing up, because that’s when it gets real. But then as soon as I start walking, it’s just muscle memory – everything becomes natural and I’m not afraid, although when I reach the other side it can be hard to comprehend what I’ve just done.\nI shout and grunt and laugh as I cross – the sounds just come out, they’re a way of relieving tension. I can feel every nerve in my leg. If one starts shaking when I’m really nervous the grunting is a release.\nWhen I’m wearing a harness, I’ll look out over the expanse or even straight down past my feet at the drop below. It feels good to take in where you are. But when you’re free soloing with no harness, you’re just focusing on where you’re trying to get to. Wind doesn’t bother me – as long as it’s consistent, it can feel nice to walk in. It’s random gusts that can throw you off a bit.\nTo qualify as a free solo, you have to be over a “death fall” – a drop you wouldn’t survive if you lost your footing and failed to grab the line. I just beat the world record for the longest free solo walk, across a canyon 64 metres across and nearly as deep as the Eiffel Tower is high – 291 metres. When I threw a rock down it took seven seconds to hit the ground. I’d have had time to shout, “OK guys, that was fun! See you later.” I’m planning another crossing nearby soon and hoping to add another seven or eight metres to the record. As soon as I think up another feat that’s it, I have to do it.\nI don’t want to die and I don’t feel like I’m hanging on a thread of life or death when I free solo on a high line – I have complete confidence in myself. I enjoy the risk and accept I could die, but no one should live their life not doing what they want to because they’re afraid. People die by things that are out of their control every day – if I gave up the thing I love, maybe further down the road I’ll be hit by a drunk driver and have my life taken from me when it all could have been within my control. CB\nFacebook Twitter Pinterest Rocky start ... Hazel Findlay climbing the Totem Pole, Tasman Peninsula, Tasmania. The free climber: Hazel Findlay\nI am the only British woman to have free climbed El Capitan in Yosemite national park. To understand El Capitan, you need to see it – it is a 2,300 metre high sheer wall of rock. It took me four days using just my hands and feet and the natural shape of the rock to get to the top. I love big wall climbing – it’s great to go to sleep on the wall and wake up on the wall - it’s one of the most fun things you can do. You sleep in a portaledge, a cross between a tent and a hammock clipped to the wall, and, yes, there is a moment of thinking, “Oh wow, this is crazy”, but once you’ve learned to trust your equipment it’s like walking along the pavement.\nMy dad introduced me to climbing. He is a guide in the Himalayas, and wanted me to share his passion. I remember doing one of my first scary routes when I was 11. I was crying the whole way up, but I did it. I had such a sense of satisfaction when I got to the top. From being so frightened to somehow overcoming my fear and managing to do it. I never forgot it.\nI’m not interested in pushing myself to the point where there is a good chance I might hurt myself. There are lots of challenges in climbing that feel scary, but are actually quite safe. Situations where you could take a long fall, but you won’t get hurt because you are tied on. You might have been climbing for 16 hours, your brain is tired and you’re nearing the top of a vertical rockface in the dark using a head torch. It’s a challenge: you can’t make a mistake, you still have to compose yourself. So much is about controlling your reaction to stress or scary situations, and that’s what I’m interested in.\nThe element of risk in climbing grabs people. You learn a lot about yourself overcoming those kind of challenges and you come away feeling stronger. Life can be mundane, but climbing takes you away from that. It makes life richer to have those adventures.\nAs told to Becky Barnicoat\nThe daredevil psyche: risk takers aren’t as reckless as they seem, says Dr Rhonda Cohen People drawn to extreme sports usually love the idea of a challenge and a unique accomplishment. For some, it’s escaping the monotony of everyday life and the journey is more important than the actual sport: planning the event in great detail, raising money for charity, anything that gets them out of their routine.\nDopamine and arousal levels (adrenaline) can play a part; some people feel they need a kickstart – a physical buzz like jump-starting a car – that they can’t get from normal life.\nIt can be a misconception to assume these people are reckless or somehow different to the rest of us. I’ve been out with Base jumpers who turned back and refused to jump when the conditions weren’t right even with a film crew watching.\nThese people are often the opposite of what they seem: extreme risk takers. They try their hardest not to leave anything to chance. They don’t do anything until they feel ready. When we look at it from the outside, we may think they’re out of control but actually they’re extremely controlled and they consider every detail.\nSocial media is partly responsible for people being out there who shouldn’t be – if kids see people hanging off a building by one arm, is it a good thing?\nI would say there’s a lot of creativity in what extreme sports professionals do. These sports often don’t have established rules, they have to be worked out as they go along.\nCrucial to this is a sense of trust – in oneself and in one’s environment. These days we’re not encouraged to trust ourselves, we’re always worried that something will go wrong. But sometimes – in lots of situations – we have to trust, to let go, to be in the moment and just go for it.", "external_links": ["https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443529714219/4ff87487-dffd-46f9-aae0-cede460a38b0-bestSizeAvailable.jpeg?w=620&q=85&auto=format&sharp=10&s=780e207b7dd58277f24cd59e13feeeea", "http://www.pinterest.com/pin/create/button/?description=Extreme+sports+special%3A+%27I+get+the+urge+to+jump+when+I%27m+standing+on+the+edge%27&url=http%3A%2F%2Fwww.theguardian.com%2Flifeandstyle%2F2015%2Foct%2F10%2Fextreme-sports-slacklining-free-climbing-spencer-seabrooke&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F9%2F29%2F1443530310203%2F8f00dff6-2953-489b-a287-576c44a8385a-2060x1236.jpeg", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443529714219/4ff87487-dffd-46f9-aae0-cede460a38b0-bestSizeAvailable.jpeg?w=380&q=85&auto=format&sharp=10&s=589bf640ec83d44ce1054d5be5924d9c", "http://www.pinterest.com/pin/create/button/?description=Extreme+sports+special%3A+%27I+get+the+urge+to+jump+when+I%27m+standing+on+the+edge%27&url=http%3A%2F%2Fwww.theguardian.com%2Flifeandstyle%2F2015%2Foct%2F10%2Fextreme-sports-slacklining-free-climbing-spencer-seabrooke&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F9%2F29%2F1443530451551%2F2bf2491a-61a9-4a1d-b4e2-fc772223c8d5-2060x1236.jpeg", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/6/1444148506984/53ed42e7-30b2-49a3-8ea2-6ce2ebc88678-2060x1156.jpeg?w=445&q=85&auto=format&sharp=10&s=72cd9ec9f2c8cf71b03e64e9e2238c81", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530310203/8f00dff6-2953-489b-a287-576c44a8385a-2060x1236.jpeg?w=605&q=85&auto=format&sharp=10&s=7fdcdbc0e471b3590c59b4642621c5e2", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443529714219/4ff87487-dffd-46f9-aae0-cede460a38b0-bestSizeAvailable.jpeg?w=445&q=85&auto=format&sharp=10&s=0d361ae0524de77f6c6acd05f933674a", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4czce%2Fsfb%23img-3&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4czce&picture=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F9%2F29%2F1443530451551%2F2bf2491a-61a9-4a1d-b4e2-fc772223c8d5-2060x1236.jpeg", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530451551/2bf2491a-61a9-4a1d-b4e2-fc772223c8d5-2060x1236.jpeg?w=605&q=85&auto=format&sharp=10&s=c23f936b868fc5539d94671446c2f949", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530310203/8f00dff6-2953-489b-a287-576c44a8385a-2060x1236.jpeg?w=620&q=85&auto=format&sharp=10&s=0b775e47bd4d6eed6aef9d12abf0e318", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443529714219/4ff87487-dffd-46f9-aae0-cede460a38b0-bestSizeAvailable.jpeg?w=300&q=85&auto=format&sharp=10&s=a95cfc4d681c9aca39f369afa6db9a05", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443529714219/4ff87487-dffd-46f9-aae0-cede460a38b0-bestSizeAvailable.jpeg?w=605&q=85&auto=format&sharp=10&s=b106a7af40bb3ee337524d1841f1dd57", "http://www.pinterest.com/pin/create/button/?description=Extreme+sports+special%3A+%27I+get+the+urge+to+jump+when+I%27m+standing+on+the+edge%27&url=http%3A%2F%2Fwww.theguardian.com%2Flifeandstyle%2F2015%2Foct%2F10%2Fextreme-sports-slacklining-free-climbing-spencer-seabrooke&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F10%2F6%2F1444148506984%2F53ed42e7-30b2-49a3-8ea2-6ce2ebc88678-2060x1156.jpeg", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530451551/2bf2491a-61a9-4a1d-b4e2-fc772223c8d5-2060x1236.jpeg?w=445&q=85&auto=format&sharp=10&s=09088058acd3d372c6b2b1e616a82bbb", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530451551/2bf2491a-61a9-4a1d-b4e2-fc772223c8d5-2060x1236.jpeg?w=620&q=85&auto=format&sharp=10&s=a158973f0cce77b435618ade75daa530", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530451551/2bf2491a-61a9-4a1d-b4e2-fc772223c8d5-2060x1236.jpeg?w=300&q=85&auto=format&sharp=10&s=746423b9f80c2eb35a1d16eef7853ff3", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4czce%2Fsfb%23img-4&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4czce&picture=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F10%2F6%2F1444148506984%2F53ed42e7-30b2-49a3-8ea2-6ce2ebc88678-2060x1156.jpeg", "https://twitter.com/intent/tweet?text=Extreme%20sports%20special%3A%20", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530310203/8f00dff6-2953-489b-a287-576c44a8385a-2060x1236.jpeg?w=445&q=85&auto=format&sharp=10&s=dc26c0b7c59331fac323e41a248713f1", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4czce%2Fsfb%23img-2&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4czce&picture=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F9%2F29%2F1443530310203%2F8f00dff6-2953-489b-a287-576c44a8385a-2060x1236.jpeg", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/6/1444148506984/53ed42e7-30b2-49a3-8ea2-6ce2ebc88678-2060x1156.jpeg?w=300&q=85&auto=format&sharp=10&s=99e7f2fc5e4c4fe06c9ff7699422ecc6", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/29/1443530310203/8f00dff6-2953-489b-a287-576c44a8385a-2060x1236.jpeg?w=300&q=85&auto=format&sharp=10&s=b5782dc3bf8bedf1603caf88b73c88bf", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/6/1444148506984/53ed42e7-30b2-49a3-8ea2-6ce2ebc88678-2060x1156.jpeg?w=620&q=85&auto=format&sharp=10&s=1163c0baceb38cf65124f7cbb72e1051", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/6/1444148506984/53ed42e7-30b2-49a3-8ea2-6ce2ebc88678-2060x1156.jpeg?w=605&q=85&auto=format&sharp=10&s=0f0465a42de997ca0964b2e17519276e"], "published": "2015-10-10T16:00:00.000+03:00", "crawled": "2015-10-12T19:16:08.265+03:00", "highlightTitle": ""}