{"organizations": ["Ltd", "Airwheel Technology Holding Co."], "uuid": "e68ef174c870023b055369549d0d68ce68eadb70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/airwheel_intelligent_self_balancing_scooter_solve_traffic_problems/", "country": "US", "title": "Airwheel Intelligent Self-balancing Scooter Solve Traffic Problems", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Airwheel Intelligent Self-balancing Scooter Solve Traffic Problems", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T04:17:00.000+03:00", "replies_count": 0, "uuid": "e68ef174c870023b055369549d0d68ce68eadb70"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/airwheel_intelligent_self_balancing_scooter_solve_traffic_problems/", "ord_in_thread": 0, "title": "Airwheel Intelligent Self-balancing Scooter Solve Traffic Problems", "locations": ["L.A.", "Beijing", "Tongjiang Road", "Jiangsu", "China", "Japan", "Changzhou"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airwheel Intelligent Self-balancing Scooter Solve Traffic Problems , 24 October 2015 -- As to urban citizens, traffic jams and air pollution have become the primary killers for city travelling so far.Nowadays, the current transportation is themed with efficiency and energy-saving. However, the traditional transportation vehicles such as bicycles, cars, motorcycles and buses have their own advantages and shortcomings in the current requirements on transportation. Therefore, these transports are not able to play a dominant role in transportation over a long time. The advent of Airwheel intelligent scooter brings a ray of hope for consumers. As a combination of high technology and innovation, Airwheel self-balancing scooter has a sharp edges on reducing air pollution, for this vehicle is powered by electricity. It adopts the lithium batteries imported from Japan, which are durable and safe. Besides, it can be recharged for 1800 times. On that account, it will not emit any exhaust. Therefore, it does not affect the environment or the health of urban citizens. On the contrary, cars or motorcycles are not that environmentally friendly. The great amount of cars will always increase the traffic load and result in terrible traffic jams during the rush hours. With more Airwheel self-balancing scooters and fewer cars, the environment will get cleaner and traffic condition will be better. In terms of flexibility, Airwheel electric two-wheeled scooter is deemed superior to the other public transports such as bus and subway. Such public transports have their own travelling routes that may lead passengers to take a detour, which will cause them a waste of time. Nevertheless, Airwheel electric scooter is more flexible and convenient. With its help, riders can go to any places they want to reach. Apart from that, they can stop the vehicle anywhere anytime, which can save them a great deal of time. For urban citizens, traffic problems are the main concern when they go out. Now, with the help of Airwheel electric scooter, which is low-carbon and efficient, they can actually have a pleasant ride around the city. About: Established in 2004, Airwheel Technology was initiated by a group of pioneers who took constant adventure to reshape the world with edged technology. With a global view, the U.S.-based enterprise started to build since its establishment R&D centers located in L.A., Beijing, and Changzhou, a marketing center in Beijing and a manufacturing center in Changzhou. As the leader in global portable intelligent transport industry, we have been dedicated to extend the fun and benefit of cutting-edge technology to everywhere in the world. Media Contact: Company Name: Airwheel Technology Holding Co., Ltd Contact Person: Mr Tang Address: FL9 Zhongchuang, 396 Tongjiang Road, Changzhou, Jiangsu, China E-mail:", "external_links": [], "published": "2015-10-24T04:17:00.000+03:00", "crawled": "2015-10-25T04:53:31.348+02:00", "highlightTitle": ""}