{"organizations": [], "uuid": "8399ce16a1994ac4a33f0af426d087addd484a9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30207047/blood-type-racing-returns-to-sema-bringing-along-a-sinister-veloster-turbo", "country": "US", "title": "Blood Type Racing Returns To SEMA, Bringing Along A Sinister Veloster Turbo", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Blood Type Racing Returns To SEMA, Bringing Along A Sinister Veloster Turbo - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "8399ce16a1994ac4a33f0af426d087addd484a9d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30207047/blood-type-racing-returns-to-sema-bringing-along-a-sinister-veloster-turbo", "ord_in_thread": 0, "title": "Blood Type Racing Returns To SEMA, Bringing Along A Sinister Veloster Turbo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hyundai Motor America\nFOUNTAIN VALLEY, Calif. , Oct. 7, 2015 /PRNewswire/ -- Blood Type Racing Inc., the renowned Chicago -based tuner known for his extreme take on Korean vehicles, has revealed its Veloster Turbo R-Spec built for SEMA. The BTR Edition Veloster has an evil twist, designed to look as though it just switched over to the dark side. The car will be revealed at Hyundai's SEMA press conference on November 3 at 11:30 a.m. PT , in Las Vegas .\nThe vehicle's evil appearance began with a \"Carbon Black\" paint job, accented with a red racing stripe running from the front splitter up onto the hood. A carbon fiber wide-body kit gives the car a muscular, more aggressive stance, and front-mounted aero canards, front splitter and a rear deck spoiler provide down force at speed. Red accents on the custom SSR three-piece wheels, along with red projector \"demon eye\" headlamps add a final demonic touch to the vehicle's exterior.\nUsing the Veloster's 1.6-liter \"Gamma\" four-cylinder as a starting block, BTR added new cylinder sleeves, a high-boost turbocharger from Garrett, and custom connecting rods and pistons. With a retuned OEM ECU working in tandem with the strengthened engine internals, power output is now more than 500 horsepower, maintaining OEM drivability through use of Hyundai's latest GDI technology. The interior has been stripped down and given the full, race-spec treatment with the addition of a four-point roll cage, Sabelt bucket seats, harnesses and steering wheel, along with audio upgrades from Rockford Fosgate and Tanabe OLED Revel gauges.\n\"The focus of this build was to boost the performance capabilities of the Veloster R-Spec while creating one of the angriest-looking Hyundai vehicles to chew up the pavement,\" said Sam Lee , Director of Marketing, Blood Type Racing, Inc. \"The engine tune on this vehicle is pushing the small-displacement motor to the edge. With a specific output of 312 horsepower/liter, we're pushing this small displacement motor close to Formula 1 levels of performance. We've developed a number of internal components to help manage the power demands of this new engine, and paired with our hunkered-down suspension and aggressive exterior visuals, this Veloster is guaranteed to turn heads on the SEMA show floor.\"\nFollow #HyundaiSEMA to keep up to speed on all of this year's SEMA activity.\nPOWERTRAIN MODIFICATIONS\nPavel's Racing Engines (PRE) Custom Forged Pistons PRE Custom Forged Connecting Rods PRE Custom Sleeves PRE Custom Bearings PRE Custom Valve Springs KMC Fabrication Custom Intake Manifold Devils Own Methanol/Water Injection System KMC Fabrication Custom Dump Tube KMC Fabrication Custom Cat-less 3-in. Exhaust Custom Front-Mount Intercooler Garrett GTX3582R Dual Ball Bearing Turbo KMC Fabrication Custom Sidewinder Turbo Manifold Synapse Engineering Radial Blow Off Valve Synapse Engineering Wastegate Clutch Masters Upgraded Clutch CHASSIS/SUSPENSION MODIFICATIONS\nBC Racing Coilovers Pierce Motorsports Strut Tower Brace Pierce Motorsports Under Body Brace Pierce Motorsports Torsion Bar Slotted and Dimpled Rotors Performance Brake Pads Upgraded Brake Lines SSR Professor TF1 19x9.5-in. Wheels with Custom Red Face Toyo Proxes R888 Tires Tire Sticker.com \"Toyo Tires\" / \"Proxes\" permanent sticker EXTERIOR MODIFICATIONS\nSoCal Garage Works Carbon Fiber Wide Body Fender Kit SoCal Garage Works Carbon Fiber Front Canards SoCal Garage Works Carbon Fiber Side Skirt Covers SoCal Garage Works Custom Front Grill APR Carbon Fiber Front Lip Seibon Carbon, Carbon Fiber Hood Seibon Carbon, Carbon Fiber Rear Hatch Seibon Carbon, Carbon Fiber Hood Prop Sequence Garage Devil's Spoiler Sequence Garage Rear Bumper Lip Rally Armor Red Mud Flaps BASF Carbon Black Paint Genuine Hyundai Side Mirrors with Turn Indicators Custom Diode Dynamics Headlights with Demon Eyes INTERIOR MODIFICATIONS\nSabelt GT-130 Racing Seats Sabelt Saloon 4-Point Harness Sabelt SW-465 Steering Wheel Pierce Motorsports 4-Point Roll Cage BTR Custom Rear Seat Delete BTR Custom Subwoofer Box BTR Custom Trunk False Floor BTR Custom Battery Trunk Relocation Rockford Fosgate P3SD4-10 Shallow Subwoofers Rockford Fosgate P1650 2-Way Coaxial Speakers Rockford Fosgate P165-SI 2-Way Component Speakers Rockford Fosgate P1000X5 Amplifier Tanabe VLS OLED Boost Gauge Tanabe VLS OLED Wideband AFR Gauge HYUNDAI MOTOR AMERICA\nHyundai Motor America, headquartered in Fountain Valley, Calif. , is a subsidiary of Hyundai Motor Co. of Korea. Hyundai vehicles are distributed throughout the United States by Hyundai Motor America and are sold and serviced through more than 830 dealerships nationwide. All Hyundai vehicles sold in the U.S. are covered by the Hyundai Assurance program, which includes the 5-year/60,000-mile fully transferable new vehicle limited warranty, Hyundai's 10-year/100,000-mile powertrain limited warranty and five years of complimentary Roadside Assistance. Hyundai Blue Link Connected Care provides owners of Hyundai models equipped with the Blue Link telematics system with proactive safety and car care services complimentary for one year with enrollment. These services include Automatic Collision Notification, Enhanced Roadside Assistance, Vehicle Diagnostic Alert, Monthly Vehicle Health Report and in-vehicle service scheduling.\nFor more details on Hyundai Assurance, please visit www.HyundaiAssurance.com\nPlease visit our media website at www.hyundainews.com and our blog at www.hyundailikesunday.com\nHyundai Motor America on Twitter | YouTube | Facebook\nPhoto - http://photos.prnewswire.com/prnh/20151006/274759\nLogo - http://photos.prnewswire.com/prnh/20131002/LA90771LOGO-b\n releases/blood-type-racing-returns-to-sema-bringing-along-a-sinister-veloster-turbo-300155532.html\n ", "external_links": ["http://www.youtube.com/hyundai", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA21841&Transmission_Id=201510071030PR_NEWS_USPR_____LA21841&DateId=20151007", "https://photos.prnewswire.com/prnvar/20151006/274759", "http://www.hyundaiassurance.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/blood-type-racing-returns-to-sema-bringing-along-a-sinister-veloster-turbo-300155532.html", "http://www.hyundailikesunday.com/", "http://photos.prnewswire.com/prnh/20131002/LA90771LOGO-b", "http://www.facebook.com/Hyundai", "http://twitter.com/hyundai", "http://photos.prnewswire.com/prnvar/20131002/LA90771LOGO-b", "http://www.hyundainews.com/", "http://photos.prnewswire.com/prnh/20151006/274759"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T02:46:03.962+03:00", "highlightTitle": ""}