{"organizations": [], "uuid": "990f2e741b48bccba71a4b2b4fc6fe43303cee43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/f/s/9/o/image.related.StuffLandscapeSixteenByNine.620x349.17fowb.png/1444685526208.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/short-breaks/72955595/Does-travelling-make-you-ill-Heres-some-help-for-motion-sickness", "country": "AU", "title": "Does travelling make you ill? Here's some help for motion sickness", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Does travelling make you ill? Here's some help for motion sickness", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:36:00.000+03:00", "replies_count": 0, "uuid": "990f2e741b48bccba71a4b2b4fc6fe43303cee43"}, "author": "Ellen Creager", "url": "http://www.stuff.co.nz/travel/themes/short-breaks/72955595/Does-travelling-make-you-ill-Heres-some-help-for-motion-sickness", "ord_in_thread": 0, "title": "Does travelling make you ill? Here's some help for motion sickness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Does travelling make you ill? Here's some help for motion sickness ELLEN CREAGER Last updated 10:32, October 13 2015 123RF \nMotion sickness can be a real problem for travellers, but there is help. \nFirst, you feel uneasy. Then comes the cold sweat. Then dizziness, headache, and nausea and then - ugh - vomiting. \nBlech! Motion sickness is no fun. \n\"It started when I would take trips to my grandparents' house in Saginaw and I would throw up in the car,\" Spencer Ray said. \nOn a recent plane ride he felt an effect similar to when he is on a roller coaster. \n\"And with roller coasters,\" he says, \"I realised I was scared of them because I was going to throw up.\" \nSome travellers with motion sickness avoid holidays they would really love to take. \n\"It has affected my ability to go on trips, such as a cruise or even long car rides,\" Sue Meyers said. \n\"My husband has always wanted to go on a cruise, and as much fun as that sounds, I'm terrified of being sick the whole time with no relief.\" \nMotion sickness happens when what you see and what your inner ear senses are two different things. It can happen to adult astronauts and 2-year-old toddlers. Some evidence shows it has a genetic component and runs in families. \nChildren ages 2-12 are most likely to get it. Women have it more than men. People who have migraines often also have motion sickness. And people taking certain medications, like antibiotics, antidepressants or even pain medicine, can feel it, too, according to the CDC , because dizziness can be a side effect. Ad Feedback \nShort of avoiding planes, boats and cars, how can you combat it? \nIn one novel experiment in Britain reported in September in the journal Neurology, researchers zapped a person's head with an electrical current and found it delayed motion sickness by three minutes by disrupting signals from the inner ear - a plan that somehow does not sound practical in the real world of three-hour flights and eight-hour car trips, but which may lead to related treatments. \nAbout 30 percent of people have experienced motion sickness, according to the Imperial College of London researchers, but \"given a sufficiently provocative stimulus almost everyone can be made motion sick.\" \nMeyers has tried acupressure wrist bands, Dramamine, ginger and other remedies. Nothing works. In cars, she must either drive or stare straight ahead in the passenger seat: \"No turning around, no sitting in the backseat, no reading or looking away from what is coming ahead on the road.\" \nRay said as he has gotten older he has realised he can keep motion sickness somewhat at bay by \"getting fresh air all the time and keeping your face cold.\" \nStill the most effective treatment is one developed by the US military. \nCalled scopolamine (brand name, Transderm Scop), the prescription patch behind the ear effectively blocks motion sickness for up to 72 hours. It does not cause drowsiness; instead, it affects nerve fibres in the inner ear to reduce perception of motion and prevent motion sickness. \nI used the patch successfully during a cruise off the coast of Africa and once on choppy 8-foot seas on Lake Superior. As a ferry sailed from Isle Royale to Copper Harbor; several people were vomiting, but I felt fine. \nFor children, the patch cannot be used, but the CDC recommends Benadryl for children ages 2-12, given one hour before travel. \nOf course, these suggestions do not always work. And even professionals who spend hours on boats, planes or in cars on the job can battle severe motion sickness, including former Detroit Free Press outdoor writer Eric Sharp. \n\"I still get sick on buses, airplanes if there is turbulence, swings and many carnival rides, including the Mad Hatter Teacup ride at Walt Disney World,\" said Sharp. \n\"And despite being a sailor since childhood, I still occasionally get sick on boats.\" \nOnce in a sailboat race, he was fine until the finish. Then, \"the waves were maybe a foot high, but I told my friend John, 'I'm going to be sick.' He said, 'You can't be sick; it's just too flat.' So I leaned over and barfed on his feet and said, 'Now do you believe me?'\" \nUntil researchers come up with something better, the medicines available besides scopolamine are antihistamine-based, anti-nausea motion sickness drugs; take an hour before travel. They should not be mixed with alcohol and can cause drowsiness. Supplements like ginger, peppermint or black horehound can reduce the symptoms of nausea and motion sickness. Deep breathing might help. Wristbands that press on acupressure points to combat nausea work for some. \nStill, Meyers wishes researchers would come up with something better. \n\"I've been like this all my life, and it's hard,\" she says. Motion sickness makes her feel lousy. It makes her dread travelling. \n\"It is not just a stomachache,\" she says. \nTNS", "external_links": [], "published": "2015-10-13T00:36:00.000+03:00", "crawled": "2015-10-13T00:41:01.394+03:00", "highlightTitle": ""}