{"organizations": [], "uuid": "ab296168ec40d2bfc3a8acb00680b3d8639d220b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/ioana-budeanu/25-reasons-to-visit-roman_8_b_8369844.html", "country": "US", "title": "25 Reasons to Visit Romania With Andreea Raicu", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "25 Reasons to Visit Romania With Andreea Raicu", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T01:00:00.000+03:00", "replies_count": 0, "uuid": "ab296168ec40d2bfc3a8acb00680b3d8639d220b"}, "author": "Ioana Budeanu", "url": "http://www.huffingtonpost.com/ioana-budeanu/25-reasons-to-visit-roman_8_b_8369844.html", "ord_in_thread": 0, "title": "25 Reasons to Visit Romania With Andreea Raicu", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nPhotos from Andreea's personal archive \nAndreea Raicu is an example for all of us. She is an ex-model, actress, TV star, fashion icon, and now she has ventured into the online world with her magazine. But above these, Andreea is a beautiful woman, on the inside and outside. She is smart, kind and warm. Andreea is a Goodwill Ambassador, she's an amazing friend, a TED Conferences' speaker and she inspires people to follow their dreams. I know you'll love her just like I do! \n1. You've traveled the world, you saw a lot of beautiful places and you could live anywhere. Why did you choose to live and work in Romania? \nRomania is a beautiful country and I love it. I grew up in Romania and have built my career here. This country has given me lots of opportunities, including the possibility to work in television for more than 18 years, open my own business, become a publicly recognized and loved figure, and most of all, be surrounded and supported by amazing and loving people. \nToday Romania is my home base and I enjoy living here. It is the place where my family, closest friends and my business are. Of course, I enjoy traveling and visiting many places around the world, and I am fortunate enough that my lifestyle and my job gives me the chance to keep on doing it. This way I get the chance to make new friends around the world, participate in international projects, and come back home and share all those beautiful travel and personal experiences. \n2. Why would you recommend a foreigner to visit Romania? What are the three special places that someone must see in our country? \nRomania is a country full of surprises and diversity. People who visit Romania get caught by amazing surprises that are beyond their expectations, with its people, nature, history and energy. I would definitely recommend visiting Romania, combining the magic of its cities, like Bucharest and Cluj , as well as its nature and cultural sites such as Danube Delta (which can be one of the most beautiful sites in the world), The Merry Cemetery or the Biertan Fortified Church. \n3. What is your best memory from a trip through Romania? \nI love discovering my country every time I can. There are so many beautiful places that surprise me. I am happy to have so many friends that share the same love for Romania as I do and we take advantage of every opportunity to have a weekend getaway in our amazing country. Each time we choose a different destination and each trip is a memory to be told. \n4. What is your biggest struggle right now? \nI recently overcame a long period full of interior struggles to connect to myself. Even though I seemed to have a perfect and wonderful life from the outside -- great vacations, great lifestyle, great job and great projects -- and seemed to be inspirational to others; something beyond was not working well. I did not understand why, if everything was supposedly great, why I was not fully happy? \nI entered into a long period of internal search, not an easy one, until I had deep insights and breakthroughs which made me realize that so many of those outside results and goals were mostly part of social requirements, social pressure and lots of conditioning that are inside us all. \nI realized that the most important search in my life was the inner search, that deep search that matches my inside world with my outside world in gratitude, in a peaceful manner. The inner peace is the sustainable peace, beyond outside achievements. \nThe most important thing that I learned was to be mindful, and to be connected to who I am, rather that what I have, as well as to recognize my needs, my feelings, and be in awareness. I am not in struggle anymore, and I am grateful and happy with my life. \n5. What is your biggest dream? \nMy biggest dream today is to inspire people with the changes that happened in my life and to create spaces for them to find their longing and courage to live their lives the way they want, to dare to seek their dreams, and the things and experiences they dream to live. I want to inspire them to live their lives according to their values, and needs; and not according to social conditioning. I believe that if each one of us connects to our dreams, and awaken our longing and our inner love, replacing fear and war for love and care, respecting each other and respecting the nature and our planet, the world will become a better place to live. This is my dream. \n6. If you could have one thing in the whole world, what would you want most? \nI definitely would want to have the power to fill the world with love and justice, and create a better world. \n7. What is your greatest gift to the world? \nMy greatest gift for people is love and the willingness to create a better world, to touch people in their hearts. This is why I am currently giving mindfulness lectures and conferences, and I am working in bringing mindfulness workshops to Romania. Four years ago I built an online platform , where I gathered a beautiful community of both men and women that are open to change their lives and improve their lifestyle so they could live mindfully and find time for themselves. \n8. Romania definitely has something special. What is it? \nPeople make Romania so special; they are friendly, generous and full of energy. There are so many other things to add here: the rock sculpture of Decebalus, the best-preserved Delta in Europe, the UNESCO heritage sites and so on. \nYou can find Andreea on Instagram and Facebook . \nFollow Ioana Budeanu on Twitter: www.twitter.com/ioanablog More:", "external_links": [], "published": "2015-10-24T01:00:00.000+03:00", "crawled": "2015-10-24T01:20:16.073+03:00", "highlightTitle": ""}