{"organizations": [], "uuid": "f5fbf2a2ada1973f7c7432a38af3cdcd2d55cc82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thecultureist.com", "main_image": "", "site_section": "http://feeds.feedburner.com/culture-ist", "section_title": "The Culture-ist - An online travel & culture magazine for the socially conscious citizen", "url": "http://www.thecultureist.com/2015/10/14/food-for-thought-film/", "country": "US", "title": "Food For Thought: The Film Sparking Conversation Around the Health of Our Food", "performance_score": 0, "site": "thecultureist.com", "participants_count": 1, "title_full": "Food For Thought: The Film Sparking Conversation Around the Health of Our Food", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:12:00.000+03:00", "replies_count": 0, "uuid": "f5fbf2a2ada1973f7c7432a38af3cdcd2d55cc82"}, "author": "Amber Dunlap", "url": "http://www.thecultureist.com/2015/10/14/food-for-thought-film/", "ord_in_thread": 0, "title": "Food For Thought: The Film Sparking Conversation Around the Health of Our Food", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Food For Thought: The Film Sparking Conversation Around the Health of Our Food October 14, 2015 by Amber Dunlap Leave a Comment \nAmerica’s food system has been dominated by agribusiness for the past half a century, developed in the post-World War II era as a solution to the world’s skyrocketing population and food needs. What began with positive intentions has become an unsustainable food system that contributes 30% of the world’s carbon emissions and consumes 40% of the world’s land use, not to mention the enormous amount of water required to produce our food. The agribusiness practices of monoculture farming, confined animal feeding operations, and the overuse of antibiotics and chemical fertilizers in our food production are in need of a long overdue overhaul. Award-winning director Susan Rockefeller ‘s latest documentary, Food for Thought, Food For Life , paints a picture of what our food system has the potential to become through the inspiring and convincing stories of people shifting the status quo in their local communities today. \nSusan produced the film in partnership with Food Day , the nationwide celebration that takes place every October 24 th to bring awareness to what’s working and what isn’t in our food system. In a short 20 minutes, Food For Thought, Food For Life touches upon the negative impact of our current food system and then dives into several inspiring interviews with people and organizations who are innovatively taking food production back to its sustainable roots. \nInterwoven with clips from TED Talks heroes like “Gangsta Gardener” Ron Finley and inspiring interviews from forward-thinking chefs like Dan Barber of Blue Hill at Stone Barns Center , this film is an awakening to the sustainable food-centric solutions that exist in the world today and offers a glimpse inside the lives of everyday people like you and me who are stepping up to the plate and shifting the way we think about and grow our food. \nThis is more than an informational documentary. It ignites the altruistic spirit alive in all of us by providing actionable ways in which we can all step up and make better food choices for both ourselves and the planet. From researchers to educators, chefs, and farmers, there’s a relateable character and community for everyone in this film. Rockefeller’s goal for this project was to create something that would spark a conversation around food and food policy and to encourage us to explore the connection between the planet and our health. \nThe film is already available for streaming at Eating Well and will be screened at events across the nation this Food Day on October 24 th . You can find a full listing of screening events here as well as a kit to host your own screening if you’re so inspired. For further resources and information about the film, visit foodforthoughtfilm.com and join the conversation at #foodforthoughtfilm . About the Writer \nAmber Dunlap is an aspiring travel writer from Colorado dipping her toes into the profession here at The Culture-ist. Currently, she is prepping for a year abroad in Peru where she hopes to pick up the Spanish language, dive into the local culture, draw inspiration for her writing, and most importantly stretch her comfort zone to new depths. She’s an explorer and an adventurer, finding her bliss when in new places, under new roofs, and humbled by nature. Writing is her tool for processing and inspiring others to get out there and engage in this beautiful world. Find her on Twitter @Amber_Dunlap .", "external_links": [], "published": "2015-10-14T20:12:00.000+03:00", "crawled": "2015-10-14T21:40:47.369+03:00", "highlightTitle": ""}