{"organizations": [], "uuid": "bfef8e7ca24d05fdddec36a3e0675382db9fcdbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151019Shopping.jpg", "site_section": "http://www.ticotimes.net/categories/topics/business", "section_title": "Business Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/19/costa-rican-consumers-are-doing-more-grocery-shopping-visits-but-are-spending-less", "country": "US", "title": "Costa Rican consumers shop more often but spend lessThe", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rican consumers shop more often but spend lessThe Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T06:14:00.000+03:00", "replies_count": 0, "uuid": "bfef8e7ca24d05fdddec36a3e0675382db9fcdbf"}, "author": "L. Arias", "url": "http://www.ticotimes.net/2015/10/19/costa-rican-consumers-are-doing-more-grocery-shopping-visits-but-are-spending-less", "ord_in_thread": 0, "title": "Costa Rican consumers shop more often but spend lessThe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Results of a study on consumer habits in Costa Rica over the past year show that people are visiting grocery stores and supermarkets more often, but they’re spending less per trip.\nConsulting firm Kantar Worldpanel conducted the “Consumer Reality” study to evaluate consumer habits here between July 2014 and July 2015. Among other findings, the investigation found that local consumers are now looking for more options on where to buy and making more price comparisons before buying.\nPeople in Costa Rica visited stores an average of 133 times during the one-year period — 6 percent more than in the 2013-2014 period — but they didn’t always purchase something when they shopped.\nOn some of those visits Ticos just looked around or requested price information. The number of people who made purchases actually decreased by 8 percent compared to the previous period.\nSpending on items also declined: local consumers spent an average of 6 percent less this year than they did the previous year.\nKantar’s study also found that local consumers are buying less at large supermarket chains and are increasingly visiting more small grocery stores, or pulperías, and discount supermarkets. A total of 85 percent of purchases were made at these kinds of stores, the study found.\n“People are mostly grocery shopping in nearby small stores and they are mostly making small purchases,” said Vivian Gálvez, Kantar manager in Costa Rica.\nThis buying trend also is increasing the consumption of products in small sizes, mainly in the personal care, snacks and soft drinks categories.\nCompanies are aware of these trends. Offerings of products in small packages at grocery stores and supermarkets grew from 34 percent to 48 percent in the 2011-2015 period, Gálvez noted.\nAs for the most consumed products, the study found that 55 percent of purchases made by families in Costa Rica in the last year were food items; 14 percent were personal care products; 13 percent were beverages; and 12 percent were household items.\nContact L. Arias at larias@ticotimes.net", "external_links": ["http://www.kantarworldpanel.com/global/Countries/worldpanel/Costa-Rica"], "published": "2015-10-20T06:14:00.000+03:00", "crawled": "2015-10-20T17:37:52.589+03:00", "highlightTitle": ""}