{"organizations": ["Giles Hawke Membership of the MSC Voyagers Club", "MSC Cruises", "MSC Voyagers Club"], "uuid": "25ff3d504d20ef103c686d55bd1cde062b5f5cb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/135/590x/MSC-cruise-614472.jpg", "site_section": "http://express.co.uk//posts/rss/132/travel", "section_title": "Daily Express :: Travel Feed", "url": "http://www.express.co.uk/travel/cruise/614472/MSC-Cruises-loyalty-scheme", "country": "IE", "title": "MSC Cruises launches loyalty scheme upgrade for all passengers", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "MSC Cruises launches loyalty scheme upgrade for all passengers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T02:00:00.000+03:00", "replies_count": 0, "uuid": "25ff3d504d20ef103c686d55bd1cde062b5f5cb4"}, "author": "", "url": "http://www.express.co.uk/travel/cruise/614472/MSC-Cruises-loyalty-scheme", "ord_in_thread": 0, "title": "MSC Cruises launches loyalty scheme upgrade for all passengers", "locations": ["United Arab Emirates", "Spain", "Ireland", "Caribbean", "Barbados", "Europe", "UK", "Jamaica", "Italy", "France", "Bahamas", "South America", "Mediterranean", "British Virgin Islands"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Giles Hawke", "Black"], "text": "MSC Cruises launches loyalty scheme upgrade for all passengers MSC Cruises launches loyalty scheme upgrade for all passengers MSC Cruises is offering British passengers a points bonanza on its Voyagers Club loyalty scheme. PUBLISHED: 00:00, Sat, Oct 24, 2015 | UPDATED: 12:41, Sun, Oct 25, 2015 GETTY The scheme starts on the 26th of October From October 26 anybody with a valid loyalty club membership from other cruise lines, hotel groups and tour operators will get the same level of benefits on the MSC scheme. Passengers who already have an MSC Voyagers Club card will get an automatic benefits upgrade and those booking their first MSC cruise will be fast-tracked to a loyalty card benefits match. MSC Cruises specialises in Mediterranean itineraries, with winter cruises around Italy, France and Spain, as well as winter cruises to the Caribbean - in particular to Barbados, Jamaica, the Bahamas and British Virgin Islands. Related articles GETTY Membership guarantees a five per cent discount It also has winter cruises around the United Arab Emirates and to South America, and is one of the few cruise lines to offer Cuban cruises - although the number is growing. The scheme is a great way of encouraging those who have not tried MSC Cruises to join us MSC Cruises' executive director UK and Ireland, Giles Hawke Membership of the MSC Voyagers Club guarantees a 5 per cent discount on cruise prices, with tiered Classic, Silver, Gold and Black rewards levels that offer a range of on-board privileges. Members are also offered access to a range of specially chosen Voyagers Selection sailings with additional discounts of up to 15 per cent. To take advantage of the Status Match programme new members just print, complete and sign a registration form which should be scanned and sent by email to statusmatch@msccruises.co.uk along with proof of their existing loyalty club membership from another travel company. GETTY MSC cruises visit Europe and the Caribbean GETTY Winter cruises are also available This can be a scan of a membership card or screenshot of their membership online. After receiving a confirmation email with details of their new MSC Voyagers Club membership number, passengers will be assigned a tier level to match the level of benefits they receive from other schemes. Guests can then used their discount to book direct with MSC Cruises or through a travel agent. MSC Cruises' executive director UK and Ireland, Giles Hawke, said: \"The Status Match programme has already proved to be a great success in other countries so it is great news guests in the UK can now enjoy its benefits. \"The scheme is a great way of encouraging those who have not tried MSC Cruises to join us and understand what our Mediterranean way of life is all about while retaining all the perks and privileges they are used to.\" The Status Match facility follows the launch of the revamped MSC Voyagers Club programme in July 2015. For more information, and to download an application form go to www.msccruises.co.uk . Related articles", "external_links": [], "published": "2015-10-24T02:00:00.000+03:00", "crawled": "2015-10-25T18:26:49.411+02:00", "highlightTitle": ""}