{"organizations": [], "uuid": "be6a7c665ee2b05072d352f590020aa4daf7867a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources1.news.com.au/images/2015/10/03/1227555/340885-431b1adc-68c4-11e5-8a7a-1db252b8f9e4.jpg", "site_section": "http://www.adelaidenow.com.au/travel/australia/victoria", "section_title": "Victoria | Travel Victoria | Melbourne Travel and VIC Holidays | The Advertiser", "url": "http://www.adelaidenow.com.au/business/companies/qantas-is-making-a-killing-so-when-do-cheaper-fares-start/story-fnkjkuhu-1227555342707", "country": "US", "title": "Qantas: Could surging profits lead to cheaper fares? | Business News | Business and Finance News | |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Qantas: Could surging profits lead to cheaper fares? | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T00:19:00.000+03:00", "replies_count": 0, "uuid": "be6a7c665ee2b05072d352f590020aa4daf7867a"}, "author": "JASON MURPHY", "url": "http://www.adelaidenow.com.au/business/companies/qantas-is-making-a-killing-so-when-do-cheaper-fares-start/story-fnkjkuhu-1227555342707", "ord_in_thread": 0, "title": "Qantas: Could surging profits lead to cheaper fares? | Business News | Business and Finance News | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JUST last year Qantas was begging the government for assistance. The ASX-listed airline was on its way to making $2.8 billion in losses in the 2014 financial year and wanted taxpayers to provide guarantees on its loans.\nThe government said no.\nDid Qantas survive? With bells on. Its 2015 financial year profit was a far more exciting $560 million.\nThe Qantas share price rose from $1.43 a year ago to $3.83 on Friday, even though the overall share market fell. Chief executive Alan Joyce saw his pay jump from $2 million to $12 million.\nA pretty tidy turnaround.\nQANTAS Chairman Alan Joyce is laughing all the way to the bank. Picture: Ray Strange Source: News Corp Australia\nQantas was no doubt helped by the curious actions of the Saudi Arabians, who after years of miserliness started pumping out oil with abandon. The price of jet fuel was about 45 per cent lower in January 2015 than January 2014 and Qantas spent half a billion dollars less on fuel.\nThey also managed to cut costs. Remember the big showdown with the unions in 2011 when Qantas stopped flying altogether?\nThe company eventually came out of that a winner. It has announced thousands of job cuts that helped it save an extra $516 million in 2015, on top of fuel savings. Its 2015 profit would have been even higher without $186 million in costs for redundancies and restructuring, etc.\nQantas rewards shareholders 1:29 Play video\nQantas will return $505 million to investors after returning to profit\nNews Corp Australia 20 Aug 2015 News Business Lifestyle Travel In summary: The Flying Kangaroo is back. But do passengers get to share in its bounce?\nIt looks like passengers are actually paying a little more to fly in Australia.\nFirst, official government data for the whole market.\nRestricted economy fares were 5 per cent higher in 2015 financial year. Business class fares were 9 per cent higher, although the cheapest available discount was 2 per cent lower.\nThe cheapest available discount fares were down 2 per cent last financial year. But the overall trend sees them going up. Source: Supplied\nRestricted economy fares are increasing and increasing. Source: Supplied\nNext, Qantas data: In 2014 average revenue per passenger was $271.50. In 2015: $277.90.\nThat’s an increase of 2.4 per cent, although it could be explained by people flying different, more expensive trips. Still, with the lower cost of fuel, you may have expected revenue per passenger to go the other way.\nEconomics tells us in a competitive market, companies should cut prices when their cost of doing business falls. But with Qantas we’re not seeing that.\nWe could well ask how strong competition really is in Australia.\nIn the international travel market, there are many airlines. You can leave Australia on United, British Airways, Hawaiian, or China Eastern, etc.\nBut domestic is a lot more limited.\nVery briefly in early 2015, the government floated a proposal to let foreign airlines fly domestic routes in the tropical north. This was when Abbott was talking about revitalising Northern Australia. A competition policy review in 2015 found there would be “considerable benefits’ from such a move.\nBut the idea had as much chance as a fish on a hook and after a brief splash it was hauled out of the water to take its last gasps and die. Among the people spinning the reel were our friends at Qantas and Virgin .\nHOW STRONG IS COMPETITION FOR QANTAS?\nThe market sometimes sees price wars, but plenty of commentators call the Australian aviation market a “duopoly” — a market structure where competition is weak and companies have some power to set prices.\nTiger is fully owned by Virgin, as of 2014. Jetstar is, of course, part of Qantas.\nAustralia has a lot of other little airlines but they almost exclusively service rural areas Qantas and Virgin don’t touch.\nWhen you look at the planes lined up at our domestic airports you won’t see much variety. Source: News Limited\nSo in the main domestic market, there are really only two players. And according to one observer, they’re not playing rough.\nCredit rating agency Standard and Poors said in September Qantas had a “strong” position.\n“We view the Australian domestic aviation market as highly profitable in the absence of aggressive competition or a material deterioration of the Australian economy,” they wrote.\n“There is little indication to suggest that either domestic airline has an appetite to resume the heavy price discounting or accelerated capacity additions that occurred between 2012 and 2014.”\nQantas declined to make any comment on how strongly they compete.\nVirgin made a loss in 2015, of $93.8 million. But its domestic airline was quite healthy, with revenue of $3.3 billion creating earnings of $111 million. International had earnings of negative $70 million and Tiger of negative $9 million.\nMarket power is always a risk where there are too few competitors. In America, airlines are under investigation for possible collusion . While we are by no means suggesting that is happening in Australia, ticket prices can at times get steep.\nThis Grand Final weekend, Perth residents have seen fares as high as $2800 to get to Melbourne to see the Eagles play at the MCG, while Cairns residents were looking at prices of over $1000 to get to Sydney to see an all-Queensland showdown in the NRL.\nAirlines should be able to make a profit — an unprofitable airline soon goes broke and is no good to anyone.\nBut they shouldn’t make profit at the expense of passengers. We await the next round of discounts impatiently.\nAnd an upgrade to Business too, if you don’t mind. Source: Supplied\nJason Murphy is an economist. He publishes the blog Thomas The Think Engine . Follow him on Twitter @jasemurphy .\nOriginally published as Qantas is raking it in, so when do fares get cheaper?", "external_links": ["http://resources3.news.com.au/images/2015/10/03/1227555/340939-30210c26-68c3-11e5-8a7a-1db252b8f9e4.jpg", "https://en.wikipedia.org/wiki/List_of_airlines_of_Australia", "http://www.smh.com.au/business/aviation/virgin-warns-opening-top-end-to-foreign-airlines-will-force-it-to-reconsider-flying-routes-20150529-ghcb6o.html", "http://resources2.news.com.au/images/2015/10/03/1227555/340966-8a1966f4-68cf-11e5-8a7a-1db252b8f9e4.jpg", "http://resources1.news.com.au/images/2015/10/03/1227555/342653-89df4e24-68cf-11e5-8a7a-1db252b8f9e4.jpg", "http://www.news.com.au/finance/business/qantas-is-making-a-killing-so-when-do-cheaper-fares-start/story-fnkgde2y-1227555342707", "http://resources1.news.com.au/images/2015/10/03/1227555/343049-34be48c4-68c4-11e5-8a7a-1db252b8f9e4.jpg", "http://thomasthethinkengine.com/", "https://theconversation.com/explainer-cabotage-and-why-foreign-airlines-dont-fly-domestic-42350", "http://resources0.news.com.au/images/2015/10/03/1227555/343020-89dcf164-68d0-11e5-8a7a-1db252b8f9e4.jpg", "http://cdn.newsapi.com.au/image/v1/external?url=http://videomam.news.com.au.s3.amazonaws.com/generated/prod/media/201508/14a415de-581a-4242-8fb8-c2e198c8c2ff/150820_Qantas.mp4/image1024x768.jpg?count=2&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://www.smh.com.au/business/aviation/exqantas-boss-geoff-dixon-hits-out-at-plans-to-open-up-top-end-to-foreign-airlines-20150527-ghav6d.html", "http://www.indexmundi.com/commodities/?commodity=jet-fuel&months=120&currency=aud", "https://twitter.com/jasemurphy", "http://mashable.com/2015/07/01/justice-department-airlines-investigation/#wf6MoRim2Gq_"], "published": "2015-10-04T00:19:00.000+03:00", "crawled": "2015-10-03T13:52:12.725+03:00", "highlightTitle": ""}