{"organizations": [], "uuid": "722a59aada0ed0bd95698da7837682e6df099d2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gocentralamerica.about.com", "main_image": "http://f.tqn.com/y/gocentralamerica/1/S/s/6/-/-/Amb3.jpg", "site_section": "http://z.about.com/6/o/m/gocentralamerica_t2.xml", "section_title": "About.com Central America Travel: What's Hot Now", "url": "http://gocentralamerica.about.com/od/sampleitineraries/a/The-Gringo-Trail.htm", "country": "US", "title": "The Gringo Trail", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "The Gringo Trail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:07:00.000+03:00", "replies_count": 0, "uuid": "722a59aada0ed0bd95698da7837682e6df099d2d"}, "author": "", "url": "http://gocentralamerica.about.com/od/sampleitineraries/a/The-Gringo-Trail.htm", "ord_in_thread": 0, "title": "The Gringo Trail", "locations": ["Belize", "Resources Ambergris Caye"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robin Knotts"], "text": "Updated Articles and Resources Ambergris Caye, Belize. Robin Knotts \nThe Gringo Trail is an itinerary that includes some of the most popular destinations for travelers in Latin America: Mexico , Central America and South America . Just like the nickname \"Gringos\" for United States American and other foreign travelers in Latin America, the term can be somewhat derogatory, especially when used by die-hard travelers who steer clear of busy tourist attractions and well-trod destinations. \nI understand where they're coming from. It's thrilling to venture off the beaten path. I've had some of my favorite adventures in remote locations -- but then again, I've also had adventures in some of Central America's most famous destinations. The thing is, the Latin American hotspots typically attributed to The Gringo Trail are popular for a reason. And even within them, you'll find unique neighborhoods and attractions other travelers overlook, just like any popular destination within the United States. The Gringo Trail \nTikal, Guatemala Tikal is arguably the most impressive Mayan archaeological site in Central America. Located in Northern Belize's El Peten region, the ruins can take days to explore. Many travelers stay in the nearby village of Flores and shuttle to and from the Tikal ruins. \nAntigua Guatemala is another of Guatemala's most popular destinations for tourists and backpackers: a colonial city cradled by volcanoes in Guatemala's highlands. It's said to be the most popular place to attend Spanish school in all of Latin America. \nLake Atitlan, Guatemala Located in the Guatemala Highlands, Lake Atitlan (Lago de Atitlan) is a volcano-ringed lake with a dozen Mayan villages on its banks. The most popular villages for travelers are Panajachel and San Pedro La Laguna, though the quieter other villages are worth a visit. \nAmbergris Caye and Caye Caulker , Belize Ambergris Caye and Caye Caulker are Caribbean islands off the coast of northern Belize, near the Belizean Barrier Reef. Ambergris Caye's largest settlement, San Pedro Town, is boisterous and offers tons to do, while smaller Caye Caulker boasts a more chilled-out, backpacker vibe. Both are great places for diving, snorkeling and other water sports. \nThe Bay Islands, Honduras The Honduran Bay Islands include Roatan , Utila and Guanaja . Roatan is the largest and most popular for travelers; you can even book direct flights there from the United States. Utila is a favorite destination for backpackers and one of the cheapest places to obtain a PADI Scuba certification (it's where I got mine!). Guanaja and the Cayos Cochinos are much less traveled, but still lovely.", "external_links": [], "published": "2015-10-12T14:07:00.000+03:00", "crawled": "2015-10-12T21:35:28.553+03:00", "highlightTitle": ""}