{"organizations": [], "uuid": "71ed4b47928ed0ede033b22dd4139c446add4103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/16/8f/cb/Ann-Stevens-House.jpg", "site_section": "http://www.palmbeachpost.com/s/travel/", "section_title": "Florida Travel | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/travel/get-spooked-at-these-florida-bed-and-breakfasts/nn4gN/", "country": "US", "title": "Get spooked at these Florida bed-and-breakfasts | www.palmbeachpost.com", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Get spooked at these Florida bed-and-breakfasts | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:00:00.000+03:00", "replies_count": 0, "uuid": "71ed4b47928ed0ede033b22dd4139c446add4103"}, "author": "Mary Thurwachter", "url": "http://www.palmbeachpost.com/news/travel/get-spooked-at-these-florida-bed-and-breakfasts/nn4gN/", "ord_in_thread": 0, "title": "Get spooked at these Florida bed-and-breakfasts | www.palmbeachpost.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With Halloween creeping up on us we’re scaring up a few suggestions for B&Bs with haunt histories. Some folks like bunking with ghosts, or get a charge out of the idea that some departed spirit could turn up to rattle a doorknob or make the lights flicker.\nTruth be told, I’ve stayed at all of these B&Bs and never encountered a ghost. But I still enjoy the stories.\nGuests could be in touch with a ghost or two at the Ann Stevens House in Lake Helen, just steps away from Cassadaga. Contributed by Mary Thurwachter One of my favorites is the Herlong Mansion in Micanopy .\nMae’s room is the haunted one — but the ghost’s name is Inez, not Mae. Inez, a former inhabitant of the Southern colonial with wide verandas, fought siblings for ownership of the house. When she finally got it, she collapsed and died in the room she now haunts. Since then, some guests have reported rattling doors and icy chills overtaking them while staying in the room. For more information or reservations, call 352-466-3322 or visit www.herlong.com .\nSt. Augustine has many houses with haunt histories, including the Casablanca Inn on the Bay , a 1914 Mediterranean Revival home overlooking Matanzas Bay.\nSome say the Casablanca Inn, a 1914 Mediterranean Revival home overlooking Matanzas Bay, is haunted by a widow with a lantern. Contributed In the 1920s and ’30s, when rumrunners traveled the coast with bootleg liquor, the B&B was a boardinghouse run by a widow. The bootleggers, who would spend a few days at a time at her house, sold liquor to guests and locals. Once revenuers got wind of the operation, they began investigating. The widow was questioned, but remained mum. She worked out a plan to warn rumrunners when the government agents were in town. She would go to the widow’s walk on top of the house and wave her lantern back and forth.\nThe widow died long ago, and her lantern has disappeared, but shrimpers and fishermen still report seeing a swinging light at the top of the Casablanca. For more information, call 800-826-2626 or visit www.casablancainn.com .\nAnother St. Augustine B&B with a haunt history is the St. Francis Inn . Some say the ghost of a young woman, dressed in white, has been seen going up the back stairs or walking in the hall. For information or reservations, call 800-824-6062 or visit www.stfrancisinn.com .\nA ghost named Inez is said to haunt the Herlong Mansion in Micanopy. Contributed by Mary Thurwachter There’s a good chance, with the help of a medium, you’ll be able to summon one or two departed souls at the Ann Stevens House in Lake Helen, just steps away from Cassadaga. Ann C. Stevens, a wealthy and prominent spiritualist from Michigan, built the three-story Victorian farmhouse in 1895. For reservations or more information, call 800- 220-0310 or see www.annstevenshouse.com .\nSpooky stories abound yearround in Amelia Island’s Fernandina Beach, to the north and east of Jacksonville. You could come face-to-face with one of the salty sea captains who navigated through Amelia Island’s waters during the 1800s or perhaps see some of the 30 ghosts believed to be haunting the Florida House Inn , Florida’s oldest continuously run hotel. For more information, call 904-491-3322 or visit www.floridahouseinn.com .\nThe ghost of a young woman, dressed in white has been seen going up the back stairs or walking in the hall at the St. Francis Inn in St. Augustine. Contributed photo </span", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/16/a0/8a/ST-FRANCIS-INN-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/16/bc/e6/herlong-mansion-in-micanopy.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/16/8f/cb/Ann-Stevens-House.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/16/43/ab/CASABLANCA-MAIN.jpg"], "published": "2015-10-20T16:00:00.000+03:00", "crawled": "2015-10-21T01:06:39.896+03:00", "highlightTitle": ""}