{"organizations": [], "uuid": "386fe5584178cdc16bf1bbb60478c24a4aa8c10d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30274981/september-2015-fiat-chrysler-automobiles-sales-in-europe", "country": "US", "title": "September 2015 Fiat Chrysler Automobiles Sales in Europe", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "September 2015 Fiat Chrysler Automobiles Sales in Europe - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "386fe5584178cdc16bf1bbb60478c24a4aa8c10d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30274981/september-2015-fiat-chrysler-automobiles-sales-in-europe", "ord_in_thread": 0, "title": "September 2015 Fiat Chrysler Automobiles Sales in Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Fiat Chrysler Automobiles\nLONDON , October 16,\nFCA closed September with another strong monthly sales performance in Europe . Total unit sales were up 15.6% year-over-year (+9.8% for the industry) to 79,700 units. For the nine months year-to-date, unit sales totaled 668,000 vehicles - an increase of 13.5% over the same period in 2014 compared wit h 8.8% for the industry overall . The Fiat 500 and Panda continued as leaders in the European A segment, registering a combined share of nearly 28 .0 % for the year-to-date. The 500L marked its 12th consecutive month as leader in the Small MPV segment (with a 22.5% share year-to-date) and the 500X continued as one of the most popular vehicles in the Small SUV segment. On the back of these individual performances, the Fiat brand outpaced the industry average once again, posting a 15 .0 % year-over-year increase in September sales. The Jeep brand also maintained its momentum , with the Renegade driving a 158.7% sales increase in Europe .\nIn September, the European passenger car market (EU28+EFTA) continued the positive trend with new vehicle registrations up 9.8% for the month to more than 1,394,000 units.\nFor the nine months year-to-date, registrations were up 8.8% to nearly 10,777,000 vehicles.\nFCA closed the month with sales up 15.6% over September a year ago to 79,700 vehicles. This marked the ninth consecutive month that the Group has outperformed the industry average, taking European market share to 5.7% (+30 basis points).\nFor the year-to-date, FCA sales were up 13.5% to nearly 668,000 vehicles and share increased to 6.2% (+30 basis points).\nFCA posted sales increases in all major European markets, for both September and the year-to-date, and outpaced the industry in nearly every market. In Italy , sales were up 20.4% for the month and 17.5% for the year-to-date. There were also solid increases in Germany (+4.5% in September and +8.7% year-to-date), France (+17.0% in September and +13.7% year-to-date), the UK (+10.8% in September and +4.1% year-to-date) and Spain (+26.6% in September and +28.6% year-to-date).\nFiat brand posted a 15.0% year-over-year increase in September with 60,600 vehicles sold. Market share was 20 basis points higher at 4.3%.\nFor the year-to-date, the brand's European sales were up 10.6% to more than 503,000 vehicles and share was 4.7% (+10 bps).\nFor the major European markets, the brand posted particularly positive September sales in Italy (+23.8%), France (+23.1%), the UK (+5.6%) and Spain (+23.1%). Year-to-date, sales were higher in Italy (14.3%), Germany (4.1%), France (+17.9%) and Spain (+27.2%).\nFiat maintained its lead in the European A segment with the 500 and Panda accounting for a combined 27.2% share in September and nearly 28.0% for the year-to-date. Launched in markets across Europe in July, the new 500 contributed to the model's A-segment leadership for both the month and the year-to-date. The 500L also ranked number one in the Small MPV segment for both September and the year-to-date. With more than 66,300 vehicles sold so far this year, the 500L held a 22.5% segment share. The 500X also made a strong contribution, having firmly established itself among the most popular models in the Small SUV segment with more than 50,000 units sold so far this year. In Italy , the 500X was the best selling vehicle in its segment for the month and the year-to-date. The 500 family continues to be popular across Europe , with 62.4% of sales generated outside of Italy .\nLancia/Chrysler posted September sales of 4,700 vehicles and market share was 0.3%. Year-to-date, brand sales across Europe totaled more than 48,300 units and market share was 0.4%.\nIn Italy , Lancia's core market, brand sales were up 3.8% for the year-to-date and sales of the Ypsilon increased 11.9%.\nAlfa Romeo posted September sales of 5,000 vehicles and market share remained stable at 0.4%. September sales were up 11% year-over-year in Italy and 35.2% in Austria .\nYear-to-date, the brand's European sales totaled 43,500 units, with increases of 7.8% in Italy and 28.2% in Austria , and market share was 0.4%.\nSales of the Giulietta were up 6.5% year-over-year in September and 0.6% for the year-to-date.\nJeep marked its 23rd-consecutive month of sales growth in September with unit sales up 132.5% to more than 8,500 vehicles. Market share was double the prior year's level at 0.6%. The brand posted increases in all major European markets, significantly outperforming the industry average. By market, unit sales were up 251.6% in Italy , 44.1% in Germany , 148.3% in France , 175.2% in the UK and 221.2% in Spain .\nYear-to-date, sales increased 158.7% to 65,700 vehicles and market share doubled to 0.6%.\nThose results were driven by the continued strong performance of the new Jeep Renegade, which has established itself firmly among the top ten in the European Small SUV segment. The Renegade continues to gain momentum with more than 40,000 units sold so far in 2015.\nFor Ferrari and Maserati , the Group's luxury brands, European sales totaled 687 vehicles in September and 5,774 for the year-to-date.\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510162979&Transmission_Id=201510160217PR_NEWS_USPR_____enUK201510162979&DateId=20151016", "http://www.xmlnews.org/ns/"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T13:29:28.268+03:00", "highlightTitle": ""}