{"organizations": [], "uuid": "5d270d5c14cae0318104685e04766dc05e5199f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/07/HKA-Wins-HKIA-Customer-Service-Excellence-Awards_1.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hkia-sees-continuous-growth-in-air-traffic-in-september-2/", "country": "US", "title": "HKIA Sees Continuous Growth in Air Traffic in SeptemberTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "HKIA Sees Continuous Growth in Air Traffic in SeptemberTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "5d270d5c14cae0318104685e04766dc05e5199f0"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hkia-sees-continuous-growth-in-air-traffic-in-september-2/", "ord_in_thread": 0, "title": "HKIA Sees Continuous Growth in Air Traffic in SeptemberTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HKIA Sees Continuous Growth in Air Traffic in September Published on : Monday, October 19, 2015\nAir traffic at Hong Kong International Airport continued to grow in September. During the month, passenger volume rose by 6.3% to 5.4 million, while aircraft movements increased by 3.3% to 33,085 compared to the same month last year. Cargo volume handled also recorded a rise of 1.1% year-on-year to 368,000 tonnes in September, after declining in recent months.\nThe growth in September passenger traffic was mainly driven by 12% year-on-year growth in Hong Kong resident travel. Transfer/transit traffic also grew by 7% year-on-year. Traffic to / from Japan and Southeast Asia also increased significantly. Meanwhile, during the National Day Golden Week from 1 October to 7 October, overall passenger volume continued to rise by 4%, with the number of visitors rose by 10% compared with last year.\nThe rebound in air cargo traffic in September was primarily due to a 3% year-on-year growth in exports. Imports experienced negligible growth; however, transshipments decreased by 3% compared to the same month last year. Amongst the key trading regions, traffic to / from North America and Australasia increased most significantly.\nIn other news, HKIA recently received Payload Asia’s “Asia Pacific Airport of the Year – Industry Choice” Award. Cissy Chan, Executive Director, Commercial of Airport Authority Hong Kong said, “We are honoured by the industry’s recognition of HKIA for the second consecutive year. This accolade serves as testament to the combined efforts of our cargo operators and workers, as well as our other business partners in the air freight industry. HKIA has been the world’s busiest cargo airport for five consecutive years, and we will continue to offer the utmost efficiency and reliability to our customers, as we strive to maintain the airport’s status as a leading international and regional aviation hub.”\nPayload Asia is a leading air cargo magazine based in Singapore. The magazine’s annual awardees are selected by an international panel of cargo expert judges based on criteria such as operational performance, cargo growth, development strategy, customer service, product innovation, and competitive costs and services.\nIn the first nine months of this year, HKIA handled 51.2 million passenger trips, 3.2 million tonnes of cargo and 301,790 flight movements, representing growth of 8.4%, 0.2% and 4%, respectively, over the same period last year.\nSource:-HKIA", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T08:25:23.507+03:00", "highlightTitle": ""}