{"organizations": [], "uuid": "4b980afbaa95ec6b945e5af0477b163768b54d6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03478/ny-GettyImages-479_3478875k.jpg", "site_section": "http://www.telegraph.co.uk/travel/destinations/northamerica/rss", "section_title": "North America travel information, holiday ideas, advice and reviews", "url": "http://www.telegraph.co.uk/travel/travelnews/11945569/New-British-Airways-direct-flight-from-London-Gatwick-to-New-York.html", "country": "US", "title": "New British Airways direct flight from London Gatwick to New York", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "New British Airways direct flight from London Gatwick to New York", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:49:00.000+03:00", "replies_count": 0, "uuid": "4b980afbaa95ec6b945e5af0477b163768b54d6a"}, "author": "Hugh Morris", "url": "http://www.telegraph.co.uk/travel/travelnews/11945569/New-British-Airways-direct-flight-from-London-Gatwick-to-New-York.html", "ord_in_thread": 0, "title": "New British Airways direct flight from London Gatwick to New York", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel News New British Airways direct flight from London Gatwick to New York Return of flight from London Gatwick to New York to aid those travelling from the south of England New York just became more accessible to the south of England Photo: Getty Comments \nResidents in the south-east wishing to fly to New York received a boost today after British Airways announced a new direct route from Gatwick to the Big Apple. \nIt is now only the second airline, after Norwegian, to fly direct to the US city from Gatwick, meaning those living on the south coast have more options if they wish to avoid an often tedious rail journey to Heathrow. A train from Brighton, for example, reaches Gatwick in less than 30 minutes, but it takes two hours and a change in the capital to arrive at Heathrow. \nBA’s new route, due to start in May next year, also makes it the only carrier to fly to the east coast city from Gatwick, Heathrow and London City. \nSunset in New York from the new One World Trade Center observatory Photo: Getty \nThe flights will run daily using a Boeing 777, with three classes of tickets available, with tickets from around £400 return. It will depart Gatwick at 4.40pm, reaching JFK at 7.30pm local time. \nLynne Embleton, BA’s managing director at Gatwick, said the route will also provide a further connection to New York for other European city’s via Gatwick’s short-haul network. \n“New York is British Airways’ flagship Atlantic route and will always be one of the most popular destinations for holidaymakers and business travellers alike,” she said. \n• The cheapest way from London to New York \nIt is not the first time BA has flown the route. The airline ran Gatwick to New York for more than 25 years before pulling it in 2009 in favour of the Egyptian resort of Sharm El Sheikh. Virgin Atlantic, too, has run the route previously, before dropping it. \nThe beaches of Biarritz, France Photo: Getty \nBA also announced three new European routes from Heathrow for next summer: Biarritz in France, Mahon in Menorca and Palermo in Sicily. \nThe airline will fly twice a week to Biarritz and four times a week to Menorca from April 29, and from May 2 it will fly daily to Palermo. \nAdditional flights expected next year also include an extra summer-only daily flight to Budapest, three further flights a week to Venice, and more flights to Split, Palma, Berlin, Gibraltar and Olbia.", "external_links": [], "published": "2015-10-21T17:49:00.000+03:00", "crawled": "2015-10-21T18:11:48.826+03:00", "highlightTitle": ""}