{"organizations": ["Transportation", "Director General Civil Aviation Authority"], "uuid": "8f8a277efce13ce2c6d1571c36824040b55d3c48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/pr/images/2015/ff_2015_10_26.jpg", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/UAEs_flydubai_lauches_flights_to_Asmara-ZAWYA20151026102559/", "country": "AE", "title": "UAE's flydubai lauches flights to Asmara", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "UAE's flydubai lauches flights to Asmara", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T12:50:00.000+02:00", "replies_count": 0, "uuid": "8f8a277efce13ce2c6d1571c36824040b55d3c48"}, "author": "", "url": "http://www.zawya.com/story/UAEs_flydubai_lauches_flights_to_Asmara-ZAWYA20151026102559/", "ord_in_thread": 0, "title": "UAE's flydubai lauches flights to Asmara", "locations": ["United Arab Emirates", "Asmara", "East Africa Dubai", "UAE", "Africa", "Eritrea", "Asmara Saudia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paulos Kahsai", "Tesfaslassie Berhane", "Askalu Menkorios", "Sudhir Sreedharan"], "text": "Saudia to ground 19 of its aircraft flights commenced to the airline's 13th destination in East Africa Dubai, United Arab Emirates: flydubai 's inaugural flight has landed in the capital city of Eritrea, Asmara. As it landed at Asmara International Airport, senior Eritrean officials including Tesfaslassie Berhane, Minister of Transportation and Communication, Askalu Menkorios, Minister of Tourism and Paulos Kahsai, Director General Civil Aviation Authority welcomed the flydubai delegation led by Sudhir Sreedharan, Senior Vice President, Commercial (GCC, Subcontinent, Africa) and members of the airline's senior management team. \nGhaith Al Ghaith, flydubai 's Chief Executive Officer said, \"The addition of Asmara to our network reflects our commitment to enhancing air connectivity to Dubai which includes 67 points that did not previously have direct air links to Dubai or were underserved. The Eritrean capital becomes our 13 th destination in East Africa.\" \nAsmara is the 18 th destination flydubai launched this year and the airline has recently launched operations to Burundi, Rwanda, Somaliland, Tanzania and Uganda. Sudhir Sreedharan Senior Vice President, Commercial (GCC, Subcontinent, Africa), flydubai said: \"With the addition of four flights a week to Asmara, we are providing passengers from East Africa with a direct link to Dubai. When passengers choose flydubai they will enjoy our convenient, reliable and affordable travel services, our onboard experience and our dedicated Business Class.\"\nBusiness Class passengers can enjoy a comfortable spacious seat, a choice of meals from an internationally-inspired menu, a generous checked baggage allowance and fast track through immigration and security. In addition, Business Class passengers have access to business lounges across the network and a dedicated 24-hour Business team to assist with bookings and attend to enquires throughout their journey. Passengers travelling in Economy Class can enjoy the inflight entertainment system equipped with more than 1,300 hours of content, including movies, games and newspapers. The Boeing Sky Interior minimises jetlag and increases overhead locker space to ensure the best possible onboard experience. Economy Class passengers have access to a variety of hot and cold meals available for purchase on board and on a pre-order basis.\nFlight details: flights between Dubai and Asmara commenced on 25 October 2015 with 4 flights a week, with flight FZ665/666 operating on Monday, Thursday, Friday and Sunday. \nRound trip fares from Dubai: Economy Class return fares to Asmara will start at AED 1,950 including 7kg hand baggage and 20kg checked baggage, while Business Class return fares will start at AED 4,800 and are inclusive of all taxes and 40kg checked baggage. \n-Ends- \nAbout flydubai : Dubai-based flydubai strives to remove barriers to travel and enhance connectivity between different cultures across its ever-expanding network. Since launching its operations in 2009, flydubai has: \n\nCreated a network of more than 95 destinations, with 18 new routes launched in 2015. \nOpened up 67 new routes that did not previously have direct air links to Dubai or were not served by a UAE national carrier from Dubai. \nBuilt up a fleet of 50 new aircraft and will take delivery of more than 100 aircraft by the end of 2023, all of which will be Boeing 737-800s. \nIn addition, flydubai 's agility and flexibility as a young airline has enhanced Dubai's economic development, in line with the Government of Dubai's vision, by creating trade and tourism flows in previously underserved markets. \nFor more information about flydubai services, please visit flydubai .com. \nFor inquiries, please contact:", "external_links": [], "published": "2015-10-26T12:50:00.000+02:00", "crawled": "2015-10-26T15:53:59.419+02:00", "highlightTitle": ""}