{"organizations": ["GCC"], "uuid": "3de6429ce0f0928c295e7d017d65c1f8bcd32fb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/cia/large/130613060408JFXH.jpg", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Qatar_likely_to_get_3m_tourists_by_yearend-ZAWYA20151018030028/", "country": "AE", "title": "Qatar likely to get 3m tourists by year-end", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Qatar likely to get 3m tourists by year-end", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:13:00.000+03:00", "replies_count": 0, "uuid": "3de6429ce0f0928c295e7d017d65c1f8bcd32fb9"}, "author": "", "url": "http://www.zawya.com/story/Qatar_likely_to_get_3m_tourists_by_yearend-ZAWYA20151018030028/", "ord_in_thread": 0, "title": "Qatar likely to get 3m tourists by year-end", "locations": ["France", "UAE", "Qatar", "USA", "Saudi Arabia", "Bahrain", "Oman", "Dubai", "Kuwait", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hassan Abdul Rahman Al Ibrahim"], "text": "Dubai marriott harbour hotel welcomes new director of f&b Photo Credit:Reuters/Fadi Al-Assaad Doha: Qatar's tourism promotion agency expects tourist arrivals in the country to cross the three million-mark by 2015-end as the country's calendar of events and conferences reaches its peak in the last quarter (October to December). The agency says it is working to help establish Qatar as a destination for cruise ships, which will be bringing in hundreds of tourists during November.Qatar Tourism Authority ( QTA ) said the country received nearly 2.25 million visitors in the first nine months of 2015, up eight percent over the same period of 2014. QTA yesterday released third quarter (Q3) 2015 Performance Report which shows eight percent increase in visitor numbers in the period as compared to the same period of 2014.The Report shows that four-star hotels and standard hotel apartments saw highest occupancy rates in the period. Occupancy rates in all categories of hotels was 71 percent, holding steady from the same period (January to September) of last year.This, despite the fact that 15 new hotels opened their doors to guests after that, or in the period under review (January to September 2015).The QTA is intensifying efforts to capitalise on this growth through increased regional and global marketing activity, diversifying Qatar's tourism products and services and attracting investments to the sector. Tourist arrivals from other GCC countries rose an incredible 22 percent in the period (Jan to Sept) over the same period in 2014. Nationals of Saudi Arabia made up the largest segment of tourists to Qatar, as their number grew 31 percent.The majority of this growth took place in March when tourist arrivals rose 82 percent as compared to March of 2014.Visitor arrivals from the UAE also grew 13 percent in the period, while those from Bahrain, Kuwait and Oman rose seven percent, nine percent and two percent, respectively.The largest growth in other primary markets outside of the GCC, included arrivals from France (up nine percent), China (up 16pc) and USA (up two percent). Visitors arriving in July 2015 rose 14 percent as compared to the same period last year and 31 percent over the same period in 2013. According to the Report, hotel and hotel apartments data showed a positive performance with especially high occupancy rates in four-star hotels and standard hotel apartments.Hotel apartments witnessed higher occupancy rates with an average of 76 percent occupancy as compared to 71 percent for hotel properties.As compared to last year, the average room rate decreased for four, two and one-star hotels and increased for three and five-star hotels. \"The Report reflects healthy development of the tourism sector and is proof that Qatar is on track to achieve its objective of transforming itself into an attractive tourist destination for regional and international visitors,\" said Hassan Abdul Rahman Al Ibrahim, Chief Tourism Development Officer at QTA . © The Peninsula 2015", "external_links": [], "published": "2015-10-18T07:13:00.000+03:00", "crawled": "2015-10-18T12:22:37.925+03:00", "highlightTitle": ""}