{"organizations": [], "uuid": "2cde0c8fe1d8db6de72a7af92ada78957160e426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/05/Cruise-Critic.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/cruise-critic-names-the-best-cruise-lines-of-2015/", "country": "US", "title": "Cruise Critic Names the Best Cruise Lines of 2015Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Cruise Critic Names the Best Cruise Lines of 2015Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "2cde0c8fe1d8db6de72a7af92ada78957160e426"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/cruise-critic-names-the-best-cruise-lines-of-2015/", "ord_in_thread": 0, "title": "Cruise Critic Names the Best Cruise Lines of 2015Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cruise Critic Names the Best Cruise Lines of 2015 Published on : Tuesday, October 6, 2015\nCruise Critic, the world’s leading cruise reviews site and online cruise community, has announced the winners of its 8 th annual Cruise Critic Editors’ Picks Awards, naming the best of the cruise industry in 25 categories, chosen by Cruise Critic’s international team of editors. Focused primarily on ocean cruises in the past, this is the first year a full list of awards for river cruises has also been announced.\n“Our editors live and breathe cruising, sailing year-round and covering every aspect of the industry – from new ships and programs to updated amenities and features,” explained Carolyn Spencer Brown , editor-in-chief of Cruise Critic. “With so many wonderful cruise options available, it’s never an easy list to narrow down, but these awards truly represent the lines that our experts have recognized as the best of the best. This year we also highlight the top river cruise lines, reflecting the growth of this sector – in terms of both interest and options.”\nIn this year’s awards, announced today, Viking Star was named Best New Ship of 2015 in the ocean category. As the first ship in the Viking Oceans fleet, the 930-passenger Viking Star offers an entirely new product for cruisers. Beyond the ship’s overall design – which editors compared to a boutique hotel – Viking also carried over its more inclusive price structure from its river offerings, with inclusions like complimentary Wi-Fi, alcoholic beverages at lunch and dinner and a free shore excursion in every port.\nCarnival Cruise Line was named Best Value-for-Money for the second year in a row for its range of affordable fares and well-rounded offerings onboard. In the river category this award went to Emerald Waterways for its variety of inclusions and onboard amenities.\nAzamara Club Cruises was awarded Best Shore Excursions for the second consecutive year, a nod to the line’s range of tour options – from small-group cultural experiences during the day, to tours and outings in the evening. Azamara also received Best Itineraries for its ability to visit less frequented ports, and its commitment to destination immersion.\nIn the river category, Uniworld Boutique River Cruise Collection received awards for Best River Cruise Line, Best New River Ship – for the new S.S. Maria Theresa – and Best Shore Excursions. Editors praised the line’s lavish onboard offerings and amenities, new itineraries and innovative excursion offerings.\n2015 Cruise Critic Editors’ Picks Awards (Ocean)\nBest New Ship: Viking Star (Viking Ocean Cruises)\nBest Ship Refurbishment: Star Breeze (Windstar Cruises)\nBest for Luxury: Crystal Cruises\nBest for Families: Royal Caribbean International\nBest Itineraries: Azamara Club Cruises\nBest for Adventure: Un-Cruise Adventures\nBest Value-for-Money: Carnival Cruise Line\nBest Dining: Celebrity Cruises\nBest Entertainment: Royal Caribbean International\nBest Suites: Royal Caribbean International\nBest Inside Cabins: Disney Cruise Line\nBest Standard Cabins: MSC Cruises\nBest Shore Excursions: Azamara Club Cruises\nBest for Romance: Windstar Cruises\nBest Nightlife: Norwegian Cruise Line\nBest North American Homeport: Port Canaveral\n2015 Cruise Critic Editors’ Picks Awards (River)\nBest River Cruise Line : Uniworld Boutique River Cruise Collection\nBest New River Ship: S.S. Maria Theresa (Uniworld Boutique River Cruise Collection)\nBest Dining: AmaWaterways\nBest Cabins: Avalon Waterways\nBest Enrichment: Grand Circle Cruise Line\nBest Shore Excursions: Uniworld Boutique River Cruise Collection\nBest for Active Cruisers: AmaWaterways\nBest Itineraries: Viking River Cruises\nBest Value-for-Money: Emerald Waterways\nSource: Cruise Critic", "external_links": [], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T00:40:07.228+03:00", "highlightTitle": ""}