{"organizations": [], "uuid": "6d4733cc2997f772418fbf9de79858870ee19513", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/04/Seatrade-Cruise-Asia.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-dates-for-seatrade-cruise-asia-announced/", "country": "US", "title": "New dates for Seatrade Cruise Asia announcedTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "New dates for Seatrade Cruise Asia announcedTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6d4733cc2997f772418fbf9de79858870ee19513"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-dates-for-seatrade-cruise-asia-announced/", "ord_in_thread": 0, "title": "New dates for Seatrade Cruise Asia announcedTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New dates for Seatrade Cruise Asia announced Published on : Friday, October 16, 2015\nSeatrade is delighted to announce the new dates for Seatrade Cruise Asia. Hosted by Busan Port Authority, Busan Metropolitan City, Korea Tourism Organization and Korea Marine Leisure Network, Seatrade Cruise Asia will now take place 12-14 May 2016 at the Busan International Passenger Terminal in Busan, Korea. The event will feature a showcase exhibition, conference and travel agent training.\nThe conference will focus on the growing momentum for cruise tourism in Asia, the expansion of the cruise fleet now operating in Asian waters, and the opportunities and challenges this represents for the region. Representatives from the world’s leading cruise lines will take part in the conference sessions, along with senior representatives from ports, destinations and other cruise tourism stakeholders, giving their insights on how the region can increase its presence in this growing global industry.\nIt is widely predicted that demand for cruising in Asia will continue to grow, both as a source market for cruise passengers and as a key destination for cruise ship deployment. Seatrade Cruise Asia will look at the opportunities for expanding cruise sales across the region and the variation in tastes for the individual Asian source markets, and how the product can be adapted to address these tastes. It will also focus on the current pattern of cruise ship deployment in the region and the opportunities for developing new itineraries and new destinations.\nAs the pace of cruise development in Asia gathers momentum, the conference programme will look at operating conditions for cruise lines in the region, the availability of infrastructure and support services and what the expansion of cruising in Asia can contribute to the regional economy. The opportunities for Asian shipyards in cruise ship construction will also be discussed.\nComplementing the conference sessions, the exhibition will see destinations, tourism authorities, cruise associations, tour operators, port agents and suppliers showcasing their products and services to cruise industry professionals from around Asia. The event will also feature a travel agent training programme, and a full social programme for attending delegates.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T07:42:58.219+03:00", "highlightTitle": ""}