{"organizations": ["Kenya Tourism Board", "CNN", "Masai Mara Reserve"], "uuid": "d1d945207e90b73de4124cee5933aa28967e40b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151001163254-08-2015-09-29-mara-live-aftern-large-169.jpg", "site_section": "http://travel.cnn.com/rss.xml", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/10/02/travel/kenya-great-wildebeest-migration/index.html?eref=rss_travel", "country": "IL", "title": "Masai Mara Safari guides hope world's first live stream of spectacular wildlife event will bring in much-needed tourism", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Masai Mara Safari guides hope world's first live stream of spectacular wildlife event will bring in much-needed tourism", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:49:00.000+03:00", "replies_count": 0, "uuid": "d1d945207e90b73de4124cee5933aa28967e40b0"}, "author": "", "url": "http://edition.cnn.com/2015/10/02/travel/kenya-great-wildebeest-migration/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "Masai Mara Safari guides hope world's first live stream of spectacular wildlife event will bring in much-needed tourism", "locations": ["Mara River", "Tanzania", "Kenya", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andre Van Kets", "Verhoef", "Briana Duggan", "Van Kets", "Masai Mara", "Carel Verhoef", "Robyn Kriel"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Kenya's Great Migration stampedes into the digital age By Robyn Kriel and Briana Duggan, CNN Updated 1521 GMT (2221 HKT) October 2, 2015 JUST WATCHED Streaming live the great migration in Maasai Mara 02:40 (CNN) Across golden fields of Kenya's savannah, a lilac-breasted roller bird calls as it swoops over a safari van. On the ground, however, the guides on this safari are more interested in a different kind of tweet. \"Did you tweet out already?\" Andre Van Kets asks, placing his MacBook next to a portable satellite he's set up on the top of the safari vehicle. In the distance, a lioness is stalking a family of warthogs. She approaches them silently, and the time to capture the possible kill on camera is running out as quickly as Van Kets' iPhone battery life. He fumbles with his computer and after plugs in several devices and then says, \"We are ready to broadcast.\" Safaris might traditionally be rugged, back-to-nature experiences, but Van Kets, an African tourism expert, and professional safari guide Carel Verhoef are trying to bring this one into the high tech age. Greener pastures 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Masai Mara live – In Kenya's Masai Mara game reserve, safari guides hope the world's first live web broadcast of the annual Great Migration will help boost the country's tourism industry. Here a large group of wildebeest is shrouded in dust as it gathers near the Mara River. Hide Caption 1 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Walking wildebeest – A herd of wildesbeest walks along the skyline towards the Mara River. Each year, hundreds of thousands of wildebeest, zebra and other animals migrate between Tanzania's Serengeti and Kenya's Masai Mara. Hide Caption 2 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web River scramble – The migration is a continuous cycle that sees the animals travel thousands of kilometers and is known as one of the seven natural wonders of the world. Hide Caption 3 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Crossing the savannah – This year, safari guides are using live streaming platforms such as Periscope or YouTube to bring the migration to the world. The guides narrate what they see, showing viewers lions as they kill, wildebeest crossing rivers, and elephants as they browse. Hide Caption 4 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Dusty stampede – During the live web broadcasts, viewers are invited to ask the safari guides questions. So far these have included simple queries, such as: \"What do elephants eat?\" Hide Caption 5 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Marsh Pride – A member of a group of lions known as the Marsh Pride yawns having woken from an afternoon nap in the shade of a tree in the Masai Mara. The live broadcasts are a push by the Kenya Tourism Board's \"Make It Kenya\" initiative to showcase the country's best to the world. Hide Caption 6 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Wildebeest and zebra – Concerns about security following extremist attacks in recent years have impacted on Kenya's tourism industry. Visitor numbers have dropped by nearly a quarter since the beginning of 2015. Hide Caption 7 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Concerns for animals – Some say the decline in tourism numbers puts the animals at risk. The presence of safari tours help deter poachers and land encroachment, according to guide Carel Verhoef. Hide Caption 8 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Breaking into a run – Safari guide Carel Verhoef hopes that his live broadcasts will entice virtual viewers into eventually paying to visit the real thing. Hide Caption 9 of 10 10 photos: Serengeti via smartphone: Kenya's Great Migration stampedes onto the web Wildebeest stuggle out of the river – So far, the live web broadcasts have attracted around 200 people a time. \"We just turned on our account and we had 175 people join us for that safari experience,\" says tourism expert Andre Van Kets . There's definitely not room for 175 people in this vehicle so, I think that was a success.\" Hide Caption 10 of 10 They're conducting the first-ever live broadcast of the Great Migration, where more than two million wildebeest, zebras, and other animals travel across east Africa in search of greener pastures. Through October 5, Van Kets and Verhof will adventure across Kenya's Masai Mara Reserve, streaming about 40 minutes of daily broadcasts of some of the reserve's most exciting action through the app they co-created, HerdTracker. Using live streaming platforms such as Periscope or YouTube, the men narrate what they see, showing viewers across the world lions as they kill, wildebeest crossing rivers, and elephants as they browse. The videos, some of which are pixelated smartphone renderings of a long lens camera shots, are still making waves with around 200 viewers for each live broadcast. Viewers ask questions, \"like\" or write comments throughout. Some questions and comments are simple, like, \"what do elephants eat?' or \"do elephants often go alone?\" Others are cheeky. When a bull elephant ranges closer to the vehicle, one viewer remarks: \"Someone's going to need new undies!\" Threat from poaching It's a push by the Kenya Tourism Board's \"Make It Kenya\" initiative to showcase the country's best to the world. Concerns about security over the last two years have left a residual impact on tourists. Visitor numbers have dropped by nearly a quarter since the beginning of 2015, and s ome say this leaves surrounding communities and wilderness areas vulnerable . \"The moment the lodge or camp doesn't make it, it leaves a void,\" says Verhoef, adding that tourists in an area can prevent land encroachment and poaching. \"The cheapest way to look after Africa's resources in the natural world is to have people in those places.\" Verhoef hopes that his live broadcasts will entice virtual viewers into eventually paying to visit the real thing. \"We wanted to do it in a way that would stand out,\" said Van Kets. \"We just turned on our account and we had 175 people join us for that safari experience. There's definitely not room for 175 people in this vehicle so, I think that was a success.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from CNN Travel", "external_links": [], "published": "2015-10-02T19:49:00.000+03:00", "crawled": "2015-10-02T20:55:32.778+03:00", "highlightTitle": ""}