{"organizations": [], "uuid": "60c05312c28610424831b2e4f081851b7d997004", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/10/02/10/2D01348C00000578-0-image-a-8_1443778636199.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3257345/Holidaymakers-booking-Airbnb-Paris-charged-tourist-tax-night-stay-authorities-pocket-5m.html", "country": "GB", "title": "Holidaymakers booking Airbnb in Paris will be charged a 'tourist tax' for each night they stay", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Holidaymakers booking Airbnb in Paris will be charged a 'tourist tax' for each night they stay | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:48:00.000+03:00", "replies_count": 1, "uuid": "14daa24fe3970b351f04c41d74394d9f98905d7b"}, "author": "John Hutchinson for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3257345/Holidaymakers-booking-Airbnb-Paris-charged-tourist-tax-night-stay-authorities-pocket-5m.html#post-0", "ord_in_thread": 0, "title": "Holidaymakers booking Airbnb in Paris will be charged a 'tourist tax' for each night they stay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "6 shares 1\nView\ncomments\nAirbnb is set to charge visitors to Paris a 'tourist tax' that will have to be paid each night they stay in the French capital.\nThe charge, labelled the 'taxe de sejour,' will be 83 cents per day, and will be handed over to the local authority.\nIt is believed to be a response to criticism from Parisian hotels who have cited unfair competition over accommodation.\nParis is Airbnb's most popular tourist destination - but now visitors will have to pay a special tax\nSpeaking to The Local.Fr , Nicolas Ferrary, director of France Airbnb said: 'We are proud to launch this simple and effective tax scheme in our number one destination in the world.\n'By working closely with the government to simplify the payment of the tourist tax for our guests we are contributing to a modern and fair framework for tourism in France.'\nRELATED ARTICLES Previous 1 Next Could YOU travel the world on £7 a day? An ex-stockbroker... Now TRAINS have introduced charges for passengers with... From intertwined beech branches in Northern Ireland to... No Instagram... but they still had a good time! Vintage... Share this article Share Local authorities have urged people renting out rooms and property on Airbnb to charge the additional levy, but this was often not carried out.\nThe money raised from the new regulations could be as much as €5million per year.\nParis is now Airbnb's top travel destination, moving ahead of previous high flyers New York and Los Angeles.\nBack in 2012 when Paris launched itself on the Airbnb platform, there were 4,000 adverts. The number is now around 50,000.\nAirbnb has become so popular in Paris, high-end hotels like Le Bristol are citing unfair competition\nThe home-sharing website has transformed budget travel to the French capital and is giving the capital's luxury hotels a fright too.\n'The Paris market is going to get very difficult,' said Didier le Calvez, managing director of the Le Bristol Hotel. Along with bosses of the city's other 'palaces', he denounces Airbnb as a 'menace' that enjoys an unfair advantage.\nA trawl of the Paris region's 50,000 Airbnb offerings suggests le Calvez and his colleagues have reason to worry.\nAirbnb offers between 380 and 400 Paris properties at over €500 (£370) a night. Of those, about 40 charge over €1,000 (£750).\nAdd in the attraction of individuality, anonymity and in some cases extra beds, and that puts them potentially in competition with the €1,000 (£750) a night Le Bristol and half a dozen other high-end Paris hotels, which have about 1,500 rooms to offer in total.\nValerie Bodocco, CEO of My Paris Agency which acts as an intermediary between owners and booking web sites, believes Airbnb is seeing off competitors at the top end of the market.\n'We have also been using Wimdu and HouseTrip, but Airbnb is definitely the most important platform for us now as the others have had ups and downs,' she said.\nRead more: Airbnb starts charging users tourist tax in Paris - The Local", "external_links": ["http://dailym.ai/1L8vvQZ", "http://www.thelocal.fr/20151001/airbnb-starts-charging-tourist-tax-in-paris"], "published": "2015-10-02T18:48:00.000+03:00", "crawled": "2015-10-02T17:19:26.926+03:00", "highlightTitle": ""}