{"organizations": [], "uuid": "2711f83eae3aeda32a4a09f1beeb7f45c46aa5c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "varnished.dailyecho.co.uk", "main_image": "http://www.dailyecho.co.uk/resources/images/3079844/", "site_section": "http://varnished.dailyecho.co.uk//news/travel/rss/", "section_title": "Daily Echo | Travel", "url": "http://varnished.dailyecho.co.uk/news/travel/13895889.New_super_speed_cameras_hit_Hampshire_roads/?ref=rss", "country": "GB", "title": "New super speed cameras hit Hampshire roads", "performance_score": 0, "site": "dailyecho.co.uk", "participants_count": 0, "title_full": "New super speed cameras hit Hampshire roads", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T12:45:00.000+02:00", "replies_count": 0, "uuid": "2711f83eae3aeda32a4a09f1beeb7f45c46aa5c2"}, "author": "", "url": "http://varnished.dailyecho.co.uk/news/travel/13895889.New_super_speed_cameras_hit_Hampshire_roads/?ref=rss", "ord_in_thread": 0, "title": "New super speed cameras hit Hampshire roads", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Find out where Hampshire's speed cameras are with our list >> \nA programme of upgrades is being launched and over the coming months many traditional cameras, which are more than 15 years old, will be replaced with more advanced digital technology. \nPolice say the cameras will be replaced at priority sites where there is the greatest need to reduce the number of crashes and bring vehicle speed down. \nThe A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. \nOn the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. \nWork will begin soon on installing new cameras at both of these sites. \nSimon Gomer, Safer Roads Unit and Driver Awareness training manager, said: “We are delighted to be upgrading many of our fixed cameras, which will help us to reduce the number of deaths and injuries on the roads in Hampshire. Share article \n“We have carefully analysed casualty data and have selected the most appropriate sites to be part of the upgrade programme. \n“We hope that the presence of our new cameras will encourage drivers to change their behaviour and drive at lower, safer speeds.” Promoted Stories New super speed cameras hit Hampshire roads   Big Mac 10:51am Mon 26 Oct 15 \nMaybe useful in capturing the morons than just wonder across the road with their headphones on whilst checking their mobiles Maybe useful in capturing the morons than just wonder across the road with their headphones on whilst checking their mobiles Big Mac \nMaybe useful in capturing the morons than just wonder across the road with their headphones on whilst checking their mobiles Report Score: 15 justice4taxis 11:18am Mon 26 Oct 15 \nOne of the ones in Kingsway is actually hidden behind a tree. The DE also forgot to mention that they face the opposite way so now they can get the bikers as well. One of the ones in Kingsway is actually hidden behind a tree. The DE also forgot to mention that they face the opposite way so now they can get the bikers as well. justice4taxis \nOne of the ones in Kingsway is actually hidden behind a tree. The DE also forgot to mention that they face the opposite way so now they can get the bikers as well. Report sotonmeh justice4taxis 12:00pm Mon 26 Oct 15 \nGood! I think they should all be hidden. That way people will actually slow down rather than speed up again after they've passed the camera. Good! I think they should all be hidden. That way people will actually slow down rather than speed up again after they've passed the camera. sotonmeh \nGood! I think they should all be hidden. That way people will actually slow down rather than speed up again after they've passed the camera. Report S!monOn 11:21am Mon 26 Oct 15 \nHow fast is \"super speed\"? How fast is \"super speed\"? S!monOn \nHow fast is \"super speed\"? Report S!monOn 11:31am Mon 26 Oct 15 \nSlightly less than warp speed. Slightly less than warp speed. Mike Oxlongg \nSlightly less than warp speed. Report S!monOn 11:58am Mon 26 Oct 15 \nIf its like BT wifi its bloody slow Last edited: 5:24pm Mon 26 Oct 15 If its like BT wifi its bloody slow Juanhater \nIf its like BT wifi its bloody slow Report Score: 3 ArchbishopOfBanterbury 12:09pm Mon 26 Oct 15 \nShould be a nice little earner for the police and another way to get cash out of the motorists Should be a nice little earner for the police and another way to get cash out of the motorists ArchbishopOfBanterbury \nShould be a nice little earner for the police and another way to get cash out of the motorists Report Mavis Barlow ArchbishopOfBanterbury 12:37pm Mon 26 Oct 15 \nAgreed, it's a great way of extracting extra cash from those drivers who know the rules and are prepared to flaunt them, at a cost. If you don't want to be charged, stick to the limit. Agreed, it's a great way of extracting extra cash from those drivers who know the rules and are prepared to flaunt them, at a cost. If you don't want to be charged, stick to the limit. Mavis Barlow \nAgreed, it's a great way of extracting extra cash from those drivers who know the rules and are prepared to flaunt them, at a cost. If you don't want to be charged, stick to the limit. Report ArchbishopOfBanterbury 12:38pm Mon 26 Oct 15 ArchbishopOfBanterbu ry wrote… Should be a nice little earner for the police and another way to get cash out of the motorists \nFunny that they don't get cash out of me. Oh yes, that's because I don't exceed the speed limit. Anyone who gets done for speeding only has themselves to blame. Like any other law, if you break it, you face the consequences. Why do people seem to think that breaking the speed limit isn't a crime? [quote][p][bold]ArchbishopOfBanterbu ry[/bold] wrote: Should be a nice little earner for the police and another way to get cash out of the motorists[/p][/quote]Funny that they don't get cash out of me. Oh yes, that's because I don't exceed the speed limit. Anyone who gets done for speeding only has themselves to blame. Like any other law, if you break it, you face the consequences. Why do people seem to think that breaking the speed limit isn't a crime? beesdee ArchbishopOfBanterbu ry wrote… Should be a nice little earner for the police and another way to get cash out of the motorists \nFunny that they don't get cash out of me. Oh yes, that's because I don't exceed the speed limit. Anyone who gets done for speeding only has themselves to blame. Like any other law, if you break it, you face the consequences. Why do people seem to think that breaking the speed limit isn't a crime? Report beesdee 12:42pm Mon 26 Oct 15 \nCouldn't agree more. Fines against shoplifters is a nice little earner too as they are caught by those sneaky store detectives and CCTV cameras watching them without warning - should we feel sorry for them? Couldn't agree more. Fines against shoplifters is a nice little earner too as they are caught by those sneaky store detectives and CCTV cameras watching them without warning - should we feel sorry for them? Albie's Bow Legs \nCouldn't agree more. Fines against shoplifters is a nice little earner too as they are caught by those sneaky store detectives and CCTV cameras watching them without warning - should we feel sorry for them? Report camerajuan ArchbishopOfBanterbury 12:48pm Mon 26 Oct 15 \nJust like those pesky judges, sentencing all those criminals. What a world we live in eh? What are you smoking? Just like those pesky judges, sentencing all those criminals. What a world we live in eh? What are you smoking? camerajuan \nJust like those pesky judges, sentencing all those criminals. What a world we live in eh? What are you smoking? Report judesaints76 ArchbishopOfBanterbury 1:31pm Mon 26 Oct 15 \nwell if they weren't speeding in the first place there wouldn't be a need to have them! well if they weren't speeding in the first place there wouldn't be a need to have them! judesaints76 \nwell if they weren't speeding in the first place there wouldn't be a need to have them! Report ArchbishopOfBanterbury 4:44pm Mon 26 Oct 15 ArchbishopOfBanterbu ry wrote… Should be a nice little earner for the police and another way to get cash out of the motorists \nSo you are for speeding then [quote][p][bold]ArchbishopOfBanterbu ry[/bold] wrote: Should be a nice little earner for the police and another way to get cash out of the motorists[/p][/quote]So you are for speeding then Folkestone Saint ArchbishopOfBanterbu ry wrote… Should be a nice little earner for the police and another way to get cash out of the motorists \nSo you are for speeding then Report Score: 1 Smartiepants 12:50pm Mon 26 Oct 15 \nOld library picture again Daily Echo, this is the old camera(s). Maybe you should get out of the office and get a recent shot. Old library picture again Daily Echo, this is the old camera(s). Maybe you should get out of the office and get a recent shot. Smartiepants \nOld library picture again Daily Echo, this is the old camera(s). Maybe you should get out of the office and get a recent shot. Report Score: 4 derek james 12:50pm Mon 26 Oct 15 \ni seem to recall a recent report said many camera locations were accident blackspots because of sudden braking when the cameras were seen, self perpetuating revenue earners? i seem to recall a recent report said many camera locations were accident blackspots because of sudden braking when the cameras were seen, self perpetuating revenue earners? derek james \ni seem to recall a recent report said many camera locations were accident blackspots because of sudden braking when the cameras were seen, self perpetuating revenue earners? Report BenLovesCassie derek james 2:25pm Mon 26 Oct 15 \nSudden Braking???!!!! Holy Cow if youre going that much above the speed limit to loose control when braking for a camera you should not be on the road at all! Sudden Braking???!!!! Holy Cow if youre going that much above the speed limit to loose control when braking for a camera you should not be on the road at all! BenLovesCassie \nSudden Braking???!!!! Holy Cow if youre going that much above the speed limit to loose control when braking for a camera you should not be on the road at all! Report Score: 3 Nod 12:51pm Mon 26 Oct 15 \nThe most pointless speed cameras in history. These cameras only successfully slow people down for the 10cm that sets off the camera, and anyone who knows the roads or has a decent sat nav will slow down for that fraction of a mile every time. If you want to slow people down you need average speed cameras for the length of road. The most pointless speed cameras in history. These cameras only successfully slow people down for the 10cm that sets off the camera, and anyone who knows the roads or has a decent sat nav will slow down for that fraction of a mile every time. If you want to slow people down you need average speed cameras for the length of road. Nod \nThe most pointless speed cameras in history. These cameras only successfully slow people down for the 10cm that sets off the camera, and anyone who knows the roads or has a decent sat nav will slow down for that fraction of a mile every time. If you want to slow people down you need average speed cameras for the length of road. Report Score: 4 Graeme Harrison 12:52pm Mon 26 Oct 15 \nHow will replacing pre-existing cameras with super-dooper new ones will lead to a reduction in accidents? How will replacing pre-existing cameras with super-dooper new ones will lead to a reduction in accidents? Graeme Harrison \nHow will replacing pre-existing cameras with super-dooper new ones will lead to a reduction in accidents? Report Barone Graeme Harrison 2:49pm Mon 26 Oct 15 \nBecause the newer ones will be digital which basically means, no down time. The older analogue cameras used regular film which had to be changed every week or so and thus regularly \"ran out of film\". That and the digital camera software has already written the ticket before you are 100 mts down the road.. Because the newer ones will be digital which basically means, no down time. The older analogue cameras used regular film which had to be changed every week or so and thus regularly \"ran out of film\". That and the digital camera software has already written the ticket before you are 100 mts down the road.. Barone \nBecause the newer ones will be digital which basically means, no down time. The older analogue cameras used regular film which had to be changed every week or so and thus regularly \"ran out of film\". That and the digital camera software has already written the ticket before you are 100 mts down the road.. Report Graeme Harrison 3:53pm Mon 26 Oct 15 \nBecause of the Ice Rink! Because of the Ice Rink! 03alpe01 \nBecause of the Ice Rink! Report Score: 0 AndyAndrews 1:10pm Mon 26 Oct 15 \nAll the self-righteous people who say it's the driver's fault if they are caught speeding should grow up and realise that we can't drive with our eyes permanently glued to the speedometer - that WOULD be dangerous - and it is not otherwise obvious if you are doing 30mph or 35mph, which feel the same speed, especially on a dual carriageway like Lances Hill. By all means fine people exceeding the limit by 10mph or more, but a handful of mph on a major road is neither here nor there. All the self-righteous people who say it's the driver's fault if they are caught speeding should grow up and realise that we can't drive with our eyes permanently glued to the speedometer - that WOULD be dangerous - and it is not otherwise obvious if you are doing 30mph or 35mph, which feel the same speed, especially on a dual carriageway like Lances Hill. By all means fine people exceeding the limit by 10mph or more, but a handful of mph on a major road is neither here nor there. AndyAndrews \nAll the self-righteous people who say it's the driver's fault if they are caught speeding should grow up and realise that we can't drive with our eyes permanently glued to the speedometer - that WOULD be dangerous - and it is not otherwise obvious if you are doing 30mph or 35mph, which feel the same speed, especially on a dual carriageway like Lances Hill. By all means fine people exceeding the limit by 10mph or more, but a handful of mph on a major road is neither here nor there. Report camerajuan AndyAndrews 1:20pm Mon 26 Oct 15 \nAgree to a point, but it is the fault of the driver if they are going too fast. It literally & physically cannot be the fault of anyone else. They are in control of the vehicle (or should be at least!) therefore it is up to them to maintain the speed limit. Agree to a point, but it is the fault of the driver if they are going too fast. It literally & physically cannot be the fault of anyone else. They are in control of the vehicle (or should be at least!) therefore it is up to them to maintain the speed limit. camerajuan \nAgree to a point, but it is the fault of the driver if they are going too fast. It literally & physically cannot be the fault of anyone else. They are in control of the vehicle (or should be at least!) therefore it is up to them to maintain the speed limit. Report judesaints76 AndyAndrews 1:32pm Mon 26 Oct 15 \nif you're a half decent driver and know your car then you would know whether you're doing over the speed limit .. that's a really poor excuse if you're a half decent driver and know your car then you would know whether you're doing over the speed limit .. that's a really poor excuse judesaints76 \nif you're a half decent driver and know your car then you would know whether you're doing over the speed limit .. that's a really poor excuse Report Mavis Barlow AndyAndrews 1:33pm Mon 26 Oct 15 \nI am one of those self-righteous drivers, and I am perfectly able to maintain a safe and legal speed without my eyes being 'permanently glued to the speedometer', how else could I have passed my driving test? Even learner drivers are able to perform this marvellous feat of concentration and coordination! I am one of those self-righteous drivers, and I am perfectly able to maintain a safe and legal speed without my eyes being 'permanently glued to the speedometer', how else could I have passed my driving test? Even learner drivers are able to perform this marvellous feat of concentration and coordination! Mavis Barlow \nI am one of those self-righteous drivers, and I am perfectly able to maintain a safe and legal speed without my eyes being 'permanently glued to the speedometer', how else could I have passed my driving test? Even learner drivers are able to perform this marvellous feat of concentration and coordination! Report halo-man AndyAndrews 3:37pm Mon 26 Oct 15 \nTry standing in front of a car at 30 then again at 40 you'll soon see the difference Try standing in front of a car at 30 then again at 40 you'll soon see the difference halo-man \nTry standing in front of a car at 30 then again at 40 you'll soon see the difference Report AndyAndrews 3:54pm Mon 26 Oct 15 \nAren't you allowed to be 10% over? Aren't you allowed to be 10% over? 03alpe01 \nAren't you allowed to be 10% over? Report 03alpe01 4:48pm Mon 26 Oct 15 \nNo AndyAndrews 4:50pm Mon 26 Oct 15 \nwell said i'm not saying that speeding is acceptable but be a bit more realistic well said i'm not saying that speeding is acceptable but be a bit more realistic chevvits \nwell said i'm not saying that speeding is acceptable but be a bit more realistic Report Score: 0 Hector2004 1:18pm Mon 26 Oct 15 \nSo lets look at this link between DSI (deaths and serious injury) and the widespread introduction of the speed camera shall we. We have enjoyed 20 years of \"safety\" from these marvellous instruments however the roads are now more dangerous than ever before. Some might say the speed camera isn't so great at reducing accidents. It is however incredibly effective at criminalising otherwise safe motorists and generating billions of pounds of revenue.. So lets look at this link between DSI (deaths and serious injury) and the widespread introduction of the speed camera shall we. We have enjoyed 20 years of \"safety\" from these marvellous instruments however the roads are now more dangerous than ever before. Some might say the speed camera isn't so great at reducing accidents. It is however incredibly effective at criminalising otherwise safe motorists and generating billions of pounds of revenue.. Hector2004 \nSo lets look at this link between DSI (deaths and serious injury) and the widespread introduction of the speed camera shall we. We have enjoyed 20 years of \"safety\" from these marvellous instruments however the roads are now more dangerous than ever before. Some might say the speed camera isn't so great at reducing accidents. It is however incredibly effective at criminalising otherwise safe motorists and generating billions of pounds of revenue.. Report Hector2004 1:36pm Mon 26 Oct 15 \nThere are various reasons for road traffic collisions, speed being just one of them. There are various reasons for road traffic collisions, speed being just one of them. Mavis Barlow \nThere are various reasons for road traffic collisions, speed being just one of them. Report dwhm Mavis Barlow 2:30pm Mon 26 Oct 15 \nThe trouble is that cameras ONLY check for speed, not the other things. A policeman in a car is much more effective (but much more expensive) than a camera. The trouble is that cameras ONLY check for speed, not the other things. A policeman in a car is much more effective (but much more expensive) than a camera. dwhm \nThe trouble is that cameras ONLY check for speed, not the other things. A policeman in a car is much more effective (but much more expensive) than a camera. Report BenLovesCassie Hector2004 2:30pm Mon 26 Oct 15 \n\"criminalising otherwise safe motorists\" A thief isnt a criminal until s/he steals. A murder isnt a criminal until.... you get the idea... \"roads are now more dangerous than ever before\" apply the increase in road traffic over the last 20 years to your argument to find it ill-informed and invalid. \"criminalising otherwise safe motorists\" A thief isnt a criminal until s/he steals. A murder isnt a criminal until.... you get the idea... \"roads are now more dangerous than ever before\" apply the increase in road traffic over the last 20 years to your argument to find it ill-informed and invalid. BenLovesCassie \n\"criminalising otherwise safe motorists\" A thief isnt a criminal until s/he steals. A murder isnt a criminal until.... you get the idea... \"roads are now more dangerous than ever before\" apply the increase in road traffic over the last 20 years to your argument to find it ill-informed and invalid. Report Hector2004 BenLovesCassie 3:45pm Mon 26 Oct 15 \nYes Ben, the point you’re making hasn’t escaped me but we can expand on it. How about if we make it illegal to walk on the cracks in the pavement ? There are some roads near where I live that were always de-restricted (national speed limit for an A road). There have been some accidents which were without doubt the result of excessive speed; motorbikes travelling in excess of 100mph when really it’s only probably safe to do 60mph. The speed limit is now 50mph for the most part but reduces to 40mph intermittently. There have been many more deaths since this has happened but of course there has been an exponential rise in speeding convictions. Regarding your second point, this is called normalising in statistics and of course I am referencing normalised data. If you’d like to learn more about this subject, the data is freely available in the public domain, you don’t even need to make a FOI request. In order to understand the data, you’ll need to invest some time to learn about statistics but it will pay dividends in you being less “ill informed” and able to present a more “valid” argument. Yes Ben, the point you’re making hasn’t escaped me but we can expand on it. How about if we make it illegal to walk on the cracks in the pavement ? There are some roads near where I live that were always de-restricted (national speed limit for an A road). There have been some accidents which were without doubt the result of excessive speed; motorbikes travelling in excess of 100mph when really it’s only probably safe to do 60mph. The speed limit is now 50mph for the most part but reduces to 40mph intermittently. There have been many more deaths since this has happened but of course there has been an exponential rise in speeding convictions. Regarding your second point, this is called normalising in statistics and of course I am referencing normalised data. If you’d like to learn more about this subject, the data is freely available in the public domain, you don’t even need to make a FOI request. In order to understand the data, you’ll need to invest some time to learn about statistics but it will pay dividends in you being less “ill informed” and able to present a more “valid” argument. Hector2004 \nYes Ben, the point you’re making hasn’t escaped me but we can expand on it. How about if we make it illegal to walk on the cracks in the pavement ? There are some roads near where I live that were always de-restricted (national speed limit for an A road). There have been some accidents which were without doubt the result of excessive speed; motorbikes travelling in excess of 100mph when really it’s only probably safe to do 60mph. The speed limit is now 50mph for the most part but reduces to 40mph intermittently. There have been many more deaths since this has happened but of course there has been an exponential rise in speeding convictions. Regarding your second point, this is called normalising in statistics and of course I am referencing normalised data. If you’d like to learn more about this subject, the data is freely available in the public domain, you don’t even need to make a FOI request. In order to understand the data, you’ll need to invest some time to learn about statistics but it will pay dividends in you being less “ill informed” and able to present a more “valid” argument. Report Mary80 1:19pm Mon 26 Oct 15 \nSpeed cameras won't suddenly make drivers act less like idiots. They'd still speed and tailgate Speed cameras won't suddenly make drivers act less like idiots. They'd still speed and tailgate Mary80 \nSpeed cameras won't suddenly make drivers act less like idiots. They'd still speed and tailgate Report Score: 6 OSPREYSAINT 1:42pm Mon 26 Oct 15 \nEvery one with an ounce of common sense knows that the best way to beat the speed cameras is not to exceed the speed limit in the first place. Every one with an ounce of common sense knows that the best way to beat the speed cameras is not to exceed the speed limit in the first place. OSPREYSAINT \nEvery one with an ounce of common sense knows that the best way to beat the speed cameras is not to exceed the speed limit in the first place. Report OSPREYSAINT 1:49pm Mon 26 Oct 15 \nWaaaa too logical! You expect too much! Waaaa too logical! You expect too much! camerajuan \nWaaaa too logical! You expect too much! Report Hector2004 OSPREYSAINT 3:55pm Mon 26 Oct 15 \nThis is true and by slowing everyone down, we’d certainly see a reduction in road deaths and serious injuries but this simplistic rubbish pedalled by the safety camera partnerships neglects to tackle 90+ % of other road accidents. If you genuinely believe that most accidents are a direct result of cars travelling over an arbitrary figure, you don’t drive. A lady in front of me slowed down to 35 this morning to join the M27; she didn’t get much above 50 when she swooped across to the outside lane where she remained at 52 (indicated) for as long as I was on the road. This is true and by slowing everyone down, we’d certainly see a reduction in road deaths and serious injuries but this simplistic rubbish pedalled by the safety camera partnerships neglects to tackle 90+ % of other road accidents. If you genuinely believe that most accidents are a direct result of cars travelling over an arbitrary figure, you don’t drive. A lady in front of me slowed down to 35 this morning to join the M27; she didn’t get much above 50 when she swooped across to the outside lane where she remained at 52 (indicated) for as long as I was on the road. Hector2004 \nThis is true and by slowing everyone down, we’d certainly see a reduction in road deaths and serious injuries but this simplistic rubbish pedalled by the safety camera partnerships neglects to tackle 90+ % of other road accidents. If you genuinely believe that most accidents are a direct result of cars travelling over an arbitrary figure, you don’t drive. A lady in front of me slowed down to 35 this morning to join the M27; she didn’t get much above 50 when she swooped across to the outside lane where she remained at 52 (indicated) for as long as I was on the road. Report Score: 2 IronLady2010 1:48pm Mon 26 Oct 15 \nI have to agree with another poster who suggested the use of average speed cameras. With many vehicles these days boasting speeds of 0-60 in seconds the fixed cameras are pointless. I have to agree with another poster who suggested the use of average speed cameras. With many vehicles these days boasting speeds of 0-60 in seconds the fixed cameras are pointless. IronLady2010 \nI have to agree with another poster who suggested the use of average speed cameras. With many vehicles these days boasting speeds of 0-60 in seconds the fixed cameras are pointless. Report megacycle 2:33pm Mon 26 Oct 15 \nAre these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen. Last edited: 6:32pm Mon 26 Oct 15 Are these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen. megacycle \nAre these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen. Report megacycle 4:00pm Mon 26 Oct 15 megacycle wrote… Are these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen. \nWhen you are driving your eyes should be focused on the road not the speedo so how can a device that makes you take your eyes off the road improve safety? It's to generate cash pure and simple [quote][p][bold]megacycle[/bold] wrote: Are these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen.[/p][/quote]When you are driving your eyes should be focused on the road not the speedo so how can a device that makes you take your eyes off the road improve safety? It's to generate cash pure and simple bigfella777 megacycle wrote… Are these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen. \nWhen you are driving your eyes should be focused on the road not the speedo so how can a device that makes you take your eyes off the road improve safety? It's to generate cash pure and simple Report bigfella777 5:49pm Mon 26 Oct 15 bigfella777 wrote… megacycle wrote… Are these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen. When you are driving your eyes should be focused on the road not the speedo so how can a device that makes you take your eyes off the road improve safety? It's to generate cash pure and simple \nYour kidding right, a half second glance at your speedometer tells you how fast your going, the cash cow excuse is for cr@p and selfish drivers. [quote][p][bold]bigfella777[/bold] wrote: [quote][p][bold]megacycle[/bold] wrote: Are these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen.[/p][/quote]When you are driving your eyes should be focused on the road not the speedo so how can a device that makes you take your eyes off the road improve safety? It's to generate cash pure and simple[/p][/quote]Your kidding right, a half second glance at your speedometer tells you how fast your going, the cash cow excuse is for cr@p and selfish drivers. Folkestone Saint bigfella777 wrote… megacycle wrote… Are these upgraded cameras the ones that can tell if you're drunk or uninsured? \"The A3024 Maybray King Way in Southampton has seen 16 collisions causing injury in the three years leading up to March 31 this year, seven of which resulted in fatal or serious injuries. On the A33 Kingsway, Southampton, there were 15 crashes resulting in injuries in the same period. Work will begin soon on installing new cameras at both of these sites.\" Seems to me the existing sites aren't effective; why else are they regularly backed up by the mobile unit? Perhaps they should be moved to the places where the accidents actually happen. When you are driving your eyes should be focused on the road not the speedo so how can a device that makes you take your eyes off the road improve safety? It's to generate cash pure and simple \nYour kidding right, a half second glance at your speedometer tells you how fast your going, the cash cow excuse is for cr@p and selfish drivers. Report Score: 0 biggus2 2:42pm Mon 26 Oct 15 \nThe only way to beat the system is not to speed at all. Thus making the yellow peril redundant The only way to beat the system is not to speed at all. Thus making the yellow peril redundant biggus2 \nThe only way to beat the system is not to speed at all. Thus making the yellow peril redundant Report [deleted] 2:42pm Mon 26 Oct 15 \n[deleted] Score: 0 dave-the-rave 2:52pm Mon 26 Oct 15 \nReplacing the existing cameras with \" super duper digital technology \" means that the image is sent straight away and not as now whereas they have to wait till the film is removed from the camera and then sent off for developing! Just means they get to penalise you quicker and they get their cash quicker ! Replacing the existing cameras with \" super duper digital technology \" means that the image is sent straight away and not as now whereas they have to wait till the film is removed from the camera and then sent off for developing! Just means they get to penalise you quicker and they get their cash quicker ! dave-the-rave \nReplacing the existing cameras with \" super duper digital technology \" means that the image is sent straight away and not as now whereas they have to wait till the film is removed from the camera and then sent off for developing! Just means they get to penalise you quicker and they get their cash quicker ! Report dave-the-rave 3:57pm Mon 26 Oct 15 \nOnly if your stupid enough to break the speed limit in the first place. Only if your stupid enough to break the speed limit in the first place. 03alpe01 \nOnly if your stupid enough to break the speed limit in the first place. Report Score: 2 Cyrus Muro 5:30pm Mon 26 Oct 15 \nI dont hate much but speed cameras I f##king hate them. These things should all be destroyed its a shame there arent more vigilantes out there to do that. I hate vandalism but speed camera are fair game in my book. I hate the fact these **** things are marketed as safety cameras when in fact all they are are revenue devices, placed in positioned specifically to catch out normally law abiding motorists, furthermore far from being safety these contraptions are the main cause of accidents in the areas they are put up as drivers panic break or slow down to hesitant speeds when they see them, most drivers even brake when they are already under the speed limit. I really cant believe how the public at large has allowed the government and the local authorities to get away with what is basically highway robbery. The public at large are so gullible to believe these things actually bring speeds down they don't apart from 10 yards from them when everyone brakes to the speed limit and then speeds back up again. If they really want to bring speed down, they need to put police back on the road. I cant remember the last time I witnessed a policeman doing traffic work, come to think of it haven't seen a policeman in a long time except for those underpaid plastic coppers PCSOs or whatever nonsense they are called. Oh and before anyone says, Yes I have a clean license some 12 years now since I had any points. Do you people have any idea how much money these things make out of us. I can bet its enough to double the strength of the police so where are they all? I dont hate much but speed cameras I f##king hate them. These things should all be destroyed its a shame there arent more vigilantes out there to do that. I hate vandalism but speed camera are fair game in my book. I hate the fact these **** things are marketed as safety cameras when in fact all they are are revenue devices, placed in positioned specifically to catch out normally law abiding motorists, furthermore far from being safety these contraptions are the main cause of accidents in the areas they are put up as drivers panic break or slow down to hesitant speeds when they see them, most drivers even brake when they are already under the speed limit. I really cant believe how the public at large has allowed the government and the local authorities to get away with what is basically highway robbery. The public at large are so gullible to believe these things actually bring speeds down they don't apart from 10 yards from them when everyone brakes to the speed limit and then speeds back up again. If they really want to bring speed down, they need to put police back on the road. I cant remember the last time I witnessed a policeman doing traffic work, come to think of it haven't seen a policeman in a long time except for those underpaid plastic coppers PCSOs or whatever nonsense they are called. Oh and before anyone says, Yes I have a clean license some 12 years now since I had any points. Do you people have any idea how much money these things make out of us. I can bet its enough to double the strength of the police so where are they all? Cyrus Muro \nI dont hate much but speed cameras I f##king hate them. These things should all be destroyed its a shame there arent more vigilantes out there to do that. I hate vandalism but speed camera are fair game in my book. I hate the fact these **** things are marketed as safety cameras when in fact all they are are revenue devices, placed in positioned specifically to catch out normally law abiding motorists, furthermore far from being safety these contraptions are the main cause of accidents in the areas they are put up as drivers panic break or slow down to hesitant speeds when they see them, most drivers even brake when they are already under the speed limit. I really cant believe how the public at large has allowed the government and the local authorities to get away with what is basically highway robbery. The public at large are so gullible to believe these things actually bring speeds down they don't apart from 10 yards from them when everyone brakes to the speed limit and then speeds back up again. If they really want to bring speed down, they need to put police back on the road. I cant remember the last time I witnessed a policeman doing traffic work, come to think of it haven't seen a policeman in a long time except for those underpaid plastic coppers PCSOs or whatever nonsense they are called. Oh and before anyone says, Yes I have a clean license some 12 years now since I had any points. Do you people have any idea how much money these things make out of us. I can bet its enough to double the strength of the police so where are they all? Report Cyrus Muro 5:58pm Mon 26 Oct 15 Cyrus Muro wrote… I dont hate much but speed cameras I f##king hate them. These things should all be destroyed its a shame there arent more vigilantes out there to do that. I hate vandalism but speed camera are fair game in my book. I hate the fact these **** things are marketed as safety cameras when in fact all they are are revenue devices, placed in positioned specifically to catch out normally law abiding motorists, furthermore far from being safety these contraptions are the main cause of accidents in the areas they are put up as drivers panic break or slow down to hesitant speeds when they see them, most drivers even brake when they are already under the speed limit. I really cant believe how the public at large has allowed the government and the local authorities to get away with what is basically highway robbery. The public at large are so gullible to believe these things actually bring speeds down they don't apart from 10 yards from them when everyone brakes to the speed limit and then speeds back up again. If they really want to bring speed down, they need to put police back on the road. I cant remember the last time I witnessed a policeman doing traffic work, come to think of it haven't seen a policeman in a long time except for those underpaid plastic coppers PCSOs or whatever nonsense they are called. Oh and before anyone says, Yes I have a clean license some 12 years now since I had any points. Do you people have any idea how much money these things make out of us. I can bet its enough to double the strength of the police so where are they all? \nIt's 25 years for me and as I was going too fast, I didn't blame anyone else either, now I drive within the limit and have no problem with these cameras but always laugh at people like you who say they are all about the money, don't speed and you don't have to pay. [quote][p][bold]Cyrus Muro[/bold] wrote: I dont hate much but speed cameras I f##king hate them. These things should all be destroyed its a shame there arent more vigilantes out there to do that. I hate vandalism but speed camera are fair game in my book. I hate the fact these **** things are marketed as safety cameras when in fact all they are are revenue devices, placed in positioned specifically to catch out normally law abiding motorists, furthermore far from being safety these contraptions are the main cause of accidents in the areas they are put up as drivers panic break or slow down to hesitant speeds when they see them, most drivers even brake when they are already under the speed limit. I really cant believe how the public at large has allowed the government and the local authorities to get away with what is basically highway robbery. The public at large are so gullible to believe these things actually bring speeds down they don't apart from 10 yards from them when everyone brakes to the speed limit and then speeds back up again. If they really want to bring speed down, they need to put police back on the road. I cant remember the last time I witnessed a policeman doing traffic work, come to think of it haven't seen a policeman in a long time except for those underpaid plastic coppers PCSOs or whatever nonsense they are called. Oh and before anyone says, Yes I have a clean license some 12 years now since I had any points. Do you people have any idea how much money these things make out of us. I can bet its enough to double the strength of the police so where are they all?[/p][/quote]It's 25 years for me and as I was going too fast, I didn't blame anyone else either, now I drive within the limit and have no problem with these cameras but always laugh at people like you who say they are all about the money, don't speed and you don't have to pay. Folkestone Saint Cyrus Muro wrote… I dont hate much but speed cameras I f##king hate them. These things should all be destroyed its a shame there arent more vigilantes out there to do that. I hate vandalism but speed camera are fair game in my book. I hate the fact these **** things are marketed as safety cameras when in fact all they are are revenue devices, placed in positioned specifically to catch out normally law abiding motorists, furthermore far from being safety these contraptions are the main cause of accidents in the areas they are put up as drivers panic break or slow down to hesitant speeds when they see them, most drivers even brake when they are already under the speed limit. I really cant believe how the public at large has allowed the government and the local authorities to get away with what is basically highway robbery. The public at large are so gullible to believe these things actually bring speeds down they don't apart from 10 yards from them when everyone brakes to the speed limit and then speeds back up again. If they really want to bring speed down, they need to put police back on the road. I cant remember the last time I witnessed a policeman doing traffic work, come to think of it haven't seen a policeman in a long time except for those underpaid plastic coppers PCSOs or whatever nonsense they are called. Oh and before anyone says, Yes I have a clean license some 12 years now since I had any points. Do you people have any idea how much money these things make out of us. I can bet its enough to double the strength of the police so where are they all? \nIt's 25 years for me and as I was going too fast, I didn't blame anyone else either, now I drive within the limit and have no problem with these cameras but always laugh at people like you who say they are all about the money, don't speed and you don't have to pay. Report", "external_links": [], "published": "2015-10-26T12:45:00.000+02:00", "crawled": "2015-10-26T20:37:15.127+02:00", "highlightTitle": ""}