{"organizations": [], "uuid": "dd4c889cb98656f67cbe65c790939926d1a56810", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-10/PR_96369603.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094375108/Currency-trends-The-time-to-travel-is-right-now?src=RSS", "country": "US", "title": "Currency trends The time to travel is right now!", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Currency trends The time to travel is right now! | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "dd4c889cb98656f67cbe65c790939926d1a56810"}, "author": "Press", "url": "http://www.menafn.com/1094375108/Currency-trends-The-time-to-travel-is-right-now?src=RSS", "ord_in_thread": 0, "title": "Currency trends The time to travel is right now!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Wego.ae, the leading travel search site in the Middle East and Asia Pacific, today reveals the best destinations for travellers from the UAE and Saudi Arabia to travel to right now, and take full advantage of recent currency fluctuations.\n\n\"The movement in currency values against the US dollar means there's never been a better time for travellers from the UAE and Saudi Arabia to book flights and take off on a trip,\" said Mamoun Hmedan, Managing Director of Wego, Middle East, North Africa & India.\n\n\"At the moment, currency exchange rates in the Asia Pacific region in particular are exceptionally favourable for both the Dirham and Riyal. It's time to plan an exotic tropical island adventure in either Thailand, Malaysia or Indonesia, where rates are the best they've been in years.\"\n\nCurrently, 1AED buys around 9 Thai Baht, the highest rate in six years with the Malaysian Ringgit and Indonesian Rupiah peaking at ten year levels.\n\nThe Riyal is also enjoying its most favourable exchange rate with the Thai Baht, Malaysian Ringgit and Indonesia Rupiah since 2009.\n\n\"A trip to Bali, Penang, Langkawi, Phuket, Bangkok and so many other Southeast Asian destinations are extremely great value right now,\" Hmedan added. \"The Singapore Dollar too is creeping up to 2010 levels for the AED, leaving a whole lot more of your holiday budget to spend on shopping.\"\n\n\"It's also the best time to head downunder with both the AED and KSA reaching heights close to the highs during 2008 for the Australian Dollar,\" he continued.\n\n\"Closer to home, the Euro is topping ten year levels for both currencies, and the Turkish Lira is particularly attractive against the AED, also reaching ten year highs.\"\n\"For the best holiday value for your budget, the time to travel is definitely now,\" said Hmedan. \"MENA airlines have convenient and frequent connections throughout the Asia Pacific, with many direct services to Singapore, Bali, Bangkok, Kuala Lumpur and Australia. Getting to Europe and Turkey is also exceptionally easy, only now you can spend more during your holiday on the little luxuries and get a lot more in return for your travel dollar,\" he concluded. \n\nAbout Wego \nWego.com is the leading travel search engine across the Asia-Pacific and Middle East and is used by millions of travellers each month to save time, pay less and travel more. The company provides powerful yet simple to use tools that help travellers research trips, compare prices for flights and hotels across multiple websites, and to book travel online. Wego shows users an unbiased and channel neutral view of travel prices, providing a choice of booking direct with a hotel or airline, or via an online travel agent or aggregator. For more information, visit http://www.wego.com/about.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-10T02:06:47.088+03:00", "highlightTitle": ""}