{"organizations": [], "uuid": "ff520c6078057177b8d96ce139542e7a52b84975", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/BjdmlodDoAcm4JEYbDIaxtUiau8kmTi1/promo253054401&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel/holiday-ideas/cruises", "section_title": "Cruises | Travel Cruises and Holidays | The Advertiser", "url": "http://www.adelaidenow.com.au/lifestyle/health/labs-detect-flakka-in-workplace-drug-tests-as-police-warn-of-new-synthetic-drug-wave/story-fni0diad-1227553167240", "country": "US", "title": "Flakka, gravel, alpha-PVP: Synthetic ‘bath salt’ drug wave hits Australia", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Flakka, gravel, alpha-PVP: Synthetic ‘bath salt’ drug wave hits Australia | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:13:00.000+03:00", "replies_count": 0, "uuid": "ff520c6078057177b8d96ce139542e7a52b84975"}, "author": "Lauren McMah", "url": "http://www.adelaidenow.com.au/lifestyle/health/labs-detect-flakka-in-workplace-drug-tests-as-police-warn-of-new-synthetic-drug-wave/story-fni0diad-1227553167240", "ord_in_thread": 0, "title": "Flakka, gravel, alpha-PVP: Synthetic ‘bath salt’ drug wave hits Australia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT IS the horror drug that sends users into wide-eyed rage, leaving them clawing at roads, lunging at cars and engaged in all manner of bizarre and dangerous behaviour.\nAnd after fears it would reach Australian shores , dreaded designer drug flakka has now arrived.\nFlakka — also known as gravel or alpha-PVP and one of many “bath salt” drugs around — has already terrified communities across the United States and Europe.\nAnd now Australians are among its users, toxicology expert Andrew Leibie has told news.com.au.\n“I know flakka has been reported in post-mortem findings in Australia, but whether or not it was the cause of death, or whether it was one of several drugs present, we don’t know,” he said.\n“At the moment we’re starting to see it become more of an issue in Australia. (The US and Europe) are really having problems (with flakka) and I suspect we’re going to follow that experience.”\nFlorida is one of the worst-hit areas for flakka use. Earlier this year, a man high on flakka attacked a police officer after running naked through the streets, declaring himself God and having sex with a tree . A Fort Lauderdale man was also arrested naked and on flakka after he ran into traffic to escape an imaginary being he thought was trying to kill him. Flakka was also linked to the death of a Deerfield Beach man in December.\nNow flakka has reached the Australian drug market, local companies are now worried their staff are using it.\nMr Leibie, who is the national marketing director for national drug testing laboratory Safe Work Laboratories, said his lab was testing for flakka in workplaces at a detection rate of 1 per cent, but stressed that wasn’t necessarily indicative of the rate of flakka use in Australia generally.\n“We have had several approaches from large companies, mostly mining companies but some oil and gas companies as well, who have specifically said to us, ‘Can you please test for some of these drugs, including flakka’,” he said.\nPolice believe Florida man Kenneth Crowder, 41, was high on flakka when he was arrested naked. Source: Supplied\n“I’m not certain what is driving that, whether companies have some intelligence on their side or they’re trying to get ahead of the curve, or possibly because they have some international operations and they’re seeing what’s happening in places like Miami in Florida. But it’s popping up on companies’ radars in Australia.”\nFlakka is one of a large number of new psychoactive substances (NPS), which also includes drugs like synthetic cannabis. They are marketed as being “safe” or “herbal” alternatives to illicit drugs — but are far from it.\nMr Leibie said flakka and its derivatives triggered any number of reactions.\n“Generally they have both a hallucinogenic-type affect, like LSD or magic mushrooms, but then they also have a stimulant effect, like ice,” he said.\n“And you put the two together and it makes for a pretty nasty mix. People are thinking they’re seeing demons or the walls are possessed or whatever, and at the same time they have all the aggression and hyper stimulation and getting into fights for no reason that we see from ice usage.\n“That’s what makes it so bad I guess — it’s taking the worst of those traditional drugs and combining them.”\nSynthetic drugs have already made headlines in Australia. In 2012, they were linked to the death of Sydney teenager Henry Kwan , who jumped off a balcony. Two drug types, 25B-NBOMe and 251-NBOMe, were believed to have led to the strange death of a South Australian man who killed himself by repeatedly running into trees and power poles .\nSynthetic drugs, like flakka, are largely used at raves and nightclubs and are reasonably affordable. Some substances are up to $40 a pop in Western Australia but as cheap as $15 in Newcastle. They are considered easily obtainable online, usually from China, and are used both by men and women in the 24-to-40 age group who are typically well-educated and reasonably wealthy.\nDrug experts and police who spoke to news.com.au said one of the biggest problems about synthetic drugs generally was that too many new substances were entering the market.\nMore than 3000 NPS have been identified by the United Nations Office of Drugs and Crime, with two new substances believed to be entering the market each week.\nMr Leibie explained: “Even though we can talk about flakka as a specific chemical compound, the problem is that as soon as you make that illegal, what someone will do is say, ‘Look, I’m going to alter the structure, just a little bit, like change this hydroxy group from there to another spot, and, hey presto, it’s not alpha-PVP (flakka) anymore. It’s something slightly different. And therefore, it’s not illegal’.\n“People are continually changing the formula and … we’re now at the point where we have hundreds and hundreds of subtly different drugs out there.\n“One thing we do tend to see is that what’s currently on the market now, won’t be in six months’ time. Because we’ll have tests for it, we’ll be able to identify it, and we’ll be able to test for it in the workplace. And the manufacturers will just move onto the next thing.”\nMr Leibie said he believed designer drugs were going to be a more significant problem.\n“These drugs are typically cheaper, they’re marketed in a way that they’re legal and herbal and safe, they’re two steps ahead of us in terms of detection and identification and the legalities of it, and they’re a lot harder to detect coming in,” he said.\n“I don’t know that we have any drug dogs that can detect these compounds coming in because they’re too new. It takes years to train up these dogs.” Victoria Police chief commissioner Graham Ashton says Australia has a new drug trend to worry about. Picture: David Caird Source: News Corp Australia\n‘TURBOCHARGED VERSION OF ICE’\nVictoria’s chief police commissioner said today that various NPS found in Australia threatened to create a scourge to rival the ice epidemic.\nHe did not mention specific drugs but said the synthetic drug wave was likely coming in by way of international drug syndicates.\n“We all know it is coming,” he told Fairfax Media .\n“It is a turbocharged version of ice.”\nMr Ashton warned that police and other agencies needed to learn lessons from the current ice scourge and clamp down on NPS while at pre-addiction levels. “This will be the next big thing,” he warned.\nVictorian, NSW and Queensland police told news.com.au that various NPS had been on the local drug market for many years. NSW and Queensland police said flakka was being sold locally as “bath salts”.\n“Thankfully, we have seen little of this particular drug but we continue to look out for new and emerging substances,” NSW Drug Squad commander Detective Superintendent Tony Cooke said.\n“The point is, like all prohibited drugs and by whatever name or description, these drugs are dangerous. There is no such thing as a legal high or a safe way to utilise any of these so-called designer drugs.\n“We have seen synthetic drugs result in reckless, risky behaviours, such as running into traffic and people having psychotic crises. That’s not to mention the countless people who have experienced adverse reactions, including some who have died, after taking different synthetic drugs.\n“They are manufactured and sold by the same criminals who make and sell ice or whatever it is they can sell to make a dollar.”\nDrug experts say virtually nothing is known about the longer-term effects of designer drugs on physical and mental health.\nAustralian Drug Foundation chief executive John Rogerson added that they also presented unknown risks to police and frontline medical staff.\n“It’s a massive problem for those people who help (users), so emergency department staff, police, they don’t have a clue what these drugs are,” he told news.com.au.\n“No one knows what’s in them so therefore they’re a huge risk. And as soon as we find out what’s in them, we ban them, and another drug comes up.”\nAccording to the last United Nations World Drug Report, out this month, Australia leads the world in ecstasy and cannabis use , is ranked third for methamphetamines and fourth for cocaine.\nMr Rogerson said Australia needed new methods to deal with our national drug problem.\n“The issue for Australia around this is that can keep banning all the drugs, but the police are letting us know that we’re not going to arrest our way out of this drug problem and we need to think of new ways to deal with it,” he said.\n“They (the police) are doing all the work to stop supply and it’s time for the work to do be done to stop demand.”\nHe also warned that whatever the next designer next drug heading to Australia, it shouldn’t distract the fact the national ice scourge remained a very big and very urgent problem.\n“NPS use in Australia is not that high at the moment but you can see over a period of time usage is going to increase because it’s so easy to bring them into the country. You can’t expect Australia Post to inspect every piece of mail coming into the country: it is just impossible.\n“But we do know that ice is having a huge impact and we have some significant challenges around that, to support communities that we haven’t been supporting until now, and opening up avenues for people to get treatment.”\n ‘People think they’re seeing demons’", "external_links": ["https://www.youtube.com/embed/iBLS1zyEbRE", "http://www.theaustralian.com.au/national-affairs/state-politics/new-laws-follow-death-of-17-year-old-student-henry-kwan/story-e6frgczx-1226716425031", "http://resources0.news.com.au/images/2015/10/02/1227553/166956-01ab070c-680a-11e5-91d3-28f7a697e8f4.jpg", "http://www.news.com.au/lifestyle/health/labs-detect-flakka-in-workplace-drug-tests-as-police-warn-of-new-synthetic-drug-wave/story-fneuzlbd-1227553167240", "http://www.ibtimes.com/what-flakka-new-5-insanity-drug-making-bath-salts-look-aspirin-1874568", "http://resources3.news.com.au/images/2015/10/02/1227553/167483-57dbaf86-680b-11e5-91d3-28f7a697e8f4.jpg", "http://www.sun-sentinel.com/local/broward/fl-flakka-deaths-20150625-story.html", "http://m.heraldsun.com.au/news/national/world-drug-map-shows-how-australia-compares-to-others-on-recreational-substance-abuse/story-fntzoymk-1227515964278", "http://www.news.com.au/world/new-designer-drug-flakka-can-leave-users-violent-with-superhuman-strength/story-fndir2ev-1227300206354", "http://www.news.com.au/world/north-america/man-high-on-flakka-had-sex-with-tree-called-himself-god/story-fnh81jut-1227305620592", "http://www.theage.com.au/victoria/the-turbo-ice-age-20150930-gjy2bj.html", "https://news.vice.com/article/police-are-freaking-out-over-drugged-up-flakka-zombies", "http://www.news.com.au/national/south-australia/new-hallucinogenic-drug-25b-nbome-and-25i-nbome-led-to-south-australian-mans-bizarre-death/story-fndo4dzn-1226472672220"], "published": "2015-10-02T08:13:00.000+03:00", "crawled": "2015-10-01T18:54:31.552+03:00", "highlightTitle": ""}