{"organizations": [], "uuid": "6df8218ff8018d78703f39a4faeafa5de715947c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/29457-tceb-inaugurates-thailand-connect-our-heart-your-world-campaign-for-2016", "country": "US", "title": "TCEB inaugurates ‘Thailand CONNECT….Our Heart, Your World’ campaign for 2016", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "TCEB inaugurates ‘Thailand CONNECT….Our Heart, Your World’ campaign for 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:45:00.000+03:00", "replies_count": 0, "uuid": "6df8218ff8018d78703f39a4faeafa5de715947c"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/29457-tceb-inaugurates-thailand-connect-our-heart-your-world-campaign-for-2016", "ord_in_thread": 0, "title": "TCEB inaugurates ‘Thailand CONNECT….Our Heart, Your World’ campaign for 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TCEB inaugurates ‘Thailand CONNECT….Our Heart, Your World’ campaign for 2016 TCEB inaugurates ‘Thailand CONNECT….Our Heart, Your World’ campaign for 2016 Details Category: Agency & Association   15:45 As Thailand steps forth into a business oriented country capable of producing professional events and opportunities, it is home to worldwide business events, one of world's top countries that hosted IT&CM Asia and CTW Asia-Pacific for the 14th consecutive year. Thailand Convention and Exhibition Bureau or TCEB has announced a campaign to reassert Thailand as a destination at the HEART of ASEAN among the international business community, by introducing ‘Thailand CONNECT….Our Heart, Your World’ brand communication campaign for the 2016 fiscal year, attracting hosts of world's important business events. \n“Thailand CONNECT….Our Heart, Your World” highlights three key pillars of Thailand’s MICE industry: DESTINATIONS OF THAILAND : Your Heart’s Desire Diverse Destinations with Seamless Connections, Business in Thailand : At the heart of the world Helping to seize the opportunities across the globe, Asia and ASEAN, and PEOPLE OF THAILAND :Seamless Excellence, Passion Hearts. To capture the essence of Thailand’s unique position as a highly preferred global business events destination, it is indeed a highlight showcase where the country’s service-oriented goals are translated into tangible opportunities for business travellers with all elements working in perfect synergy. Enhancing more opportunities through key elements that allow broader business expansion, MICE travelers are to experience Thailand's destinations, marking experiences, business benefits, and convenience along with high chances to get close to world's top global hubs and business community. Mr. Nopparat Maythaveekulchai, president of TCEB has revealed that, “The strategic direction to promote Thailand’s MICE industry is in response to the government policy of reinforcing international confidence in Thailand, and especially boosting the vibrancy of the country’s MICE industry. For business events, Thailand is not only a unique destination at the HEART of ASEAN and an unparalleled business hub at the HEART of both the emerging Asian region and the global marketplace, but also a thriving hub, where passionate people offer seamless service from the HEART, and with an unforgettable smile.\" As 2016 is a fiscal year for Thailand, a year of business events that enhances global community and pushes Thailand towards becoming world's top destinations for business events. Attracting more than 10 world's important international business events, this upcoming year will be an enchanting, yet unforgettable for worldwide business-oriented MICE travellers. Related articles", "external_links": [], "published": "2015-10-20T17:45:00.000+03:00", "crawled": "2015-10-21T05:51:24.083+03:00", "highlightTitle": ""}