{"organizations": [], "uuid": "52e2ab3bac0938eb26dddebb9e8ba8d2b734666e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelmole.com", "main_image": "", "site_section": "http://www.travelmole.com/feeds/3_2.xml", "section_title": "TravelMole Media Group, L.L.C. | UK Sustainable Travel News", "url": "http://www.travelmole.com/news_feature.php?news_id=2018811", "country": "US", "title": "Free green multimedia opportunity folio - travel agents and tour operators special edition", "performance_score": 0, "site": "travelmole.com", "participants_count": 0, "title_full": "Free green multimedia opportunity folio - travel agents and tour operators special edition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T01:46:00.000+03:00", "replies_count": 0, "uuid": "52e2ab3bac0938eb26dddebb9e8ba8d2b734666e"}, "author": "", "url": "http://www.travelmole.com/news_feature.php?news_id=2018811", "ord_in_thread": 0, "title": "Free green multimedia opportunity folio - travel agents and tour operators special edition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wednesday 07th October 2015 Free green multimedia opportunity folio - travel agents & tour operators special edition \nBig green changes on the way - special FREE outbound industry report, vodcast and weekly update will help you take advantage of them. Wherever you're based in the world, at whatever level you work, if you are a travel agent or tour operator, MICE organization or group organizer this free service will help you.Independent, Inspirational, Informative, Incisive, Insightful and Innovative It's compiled by TotemTourism who have been at the heart of Global Sustainable Tourism since 1992.Within the next year… the UN will agree 169 new sustainable targets, at COP21 in Paris country by country emissions will be agreed, at ICAO next year airlines will agree emissions targets, the OTAs (including Tripadvisor, Priceline, Sabre, AirBNB, Expedia) will further move to control the global tourism marketing scene.If you are in the travel and tourism business all this will affect you.SustainableTourism2015 will be your guide to take advantage of the massive green opportunities on the way... especially created for the outbound travel and tourism industry - get plugged into it now! Free.The release date for the first dossier & vodcast is 2 November 2015, following which there will be weekly updates.If you work in the outbound industry at any level and wish to learn about the coming green opportunities you can use SustainableTourism2015 to: Find ever more sustainable profit-centres and mine them Avoid the coming threats and take advantage of the enormous opportunities Make yourself and your organisation real green travel leaders Identify powerful green marketing mechanisms Identify coming trends and exploit them Work more efficiently, more enjoyably, more profitably See the woods and the trees! Sustainable Tourism 2015 (Outbound industry edition) \"Green Outbound Travel massive global opportunities\" will include an initial dossier, vodcast & weekly update bulletin of inside information and analysis.9 Themes: See the bigger picture now, and the coming world of tourism with its social, cultural, economic and environmental implications The next few important years and how to take advantage of them The destination paradox and how to take advantage of it Sexy and Sustainable Food, Drink, transport and other destination networks Tourism's Trillion Dollar Marketing Machine how to benefit Identifying and avoiding Key Threats Using Key opportunities Tourism & Politics what it will do for you. The world's 100 top green destinations Destinations to watch. FREE OFFER: If you are a travel agent, tour operator , MICE or group organizer, you can get all the above free - just email valere@totemtourism.com DISCOUNTED FULL PACKAGE: you can get the full package at 50% off pre-publication offer (List price £120/€165/$185 Special pre-release offer just £50/€70/$78) Full details HERE http://www.sustainabletourism2015.com What they say about our previous Sustainable Tourism reports and guides:\"The suite of reports is brilliant.\" Dr Angela M Benson Principal Lecturer - Sustainable Tourism Development Adjunct Associate Professor University of Canberra, Australia \"What a great read!\" Greenloons USA \"It provides a both comprehensive and detailed approach focusing in particular on destinations.\" Lorenz Töpperwien @tourBlogging \"A refreshing and no-nonsense guide to understanding sustainable tourism\" Cherie McClosker, advocate of Philippines Fair Trade: \"A must-read for those working in sustainability and for colleagues that you're seeking to engage.\" Simon Pickup Sustainable Tourism Manager - ABTA \"Struck just the right balance between informing on international policy development; the latest trends in sustainable tourism practice and innovative developments in the private sector.\" Cape Town Tourism \"The most comprehensive resource of its kind.\" Chris McHugo Chairman Discover Ltd owners of the Kasbah Du Toubkal, Marrakech, Morocco \"Helps us to share interesting and topical issues with our teams world-wide,\" Jo Hendricks, ex Sustainable Destinations Manager Thomas Cook UK & Ireland \"Something for everyone - whatever their size and wherever they are on the sustainability continuum.\" Eva McDiarmid The Association of Scottish Visitor AttractionsWho has subscribed to our previous Sustainable Tourism reports and guides: Ecole Hoteliere de Lausanne, Rezidor Hotel Group, Northern Ireland Tourist Board, University of Brighton, Tourism Ireland, The Nature Conservancy, Cleaner Climate, Virgin Group, Micato Safaris, Hilton Hotels Corp, Visit Britain, Canada Tourism, Tourism Innovation Group, Dublin Institute of Technology, Sabre Holdings, EplerWood Consultancy, Nichols Tourism Group, The Adventure Company, Exclusively Canada, University of Wales, University of Guelph, Sustainable Side of the Street, IFC, Discover Ltd, Griffith University, Australia, Yukon Tourist Board, Ipswich College, Prince of Wales International Business Leaders Forum, The Tourism Company, Citizen Development Corps, University of Hertfordshire, Disney Corp, Anglia Ruskin University, Kidderminster College, Olive Green Group, Six Senses Group, and many, many more.", "external_links": [], "published": "2015-10-07T01:46:00.000+03:00", "crawled": "2015-10-08T02:06:11.597+03:00", "highlightTitle": ""}