{"organizations": [], "uuid": "fe37fffab1398896fd32665bbbb7b3e7c59dba1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/4d051491-96bb-499c-818d-e65375695cbf.img", "site_section": "http://www.ft.com/rss/companies/travel-leisure", "section_title": "Travel & Leisure", "url": "http://www.ft.com/cms/s/0/9d6e15ee-7638-11e5-a95a-27d368e1ddf7.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "country": "US", "title": "UK urged to ease Chinese visa regime", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "UK urged to ease Chinese visa regime", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:16:00.000+03:00", "replies_count": 0, "uuid": "fe37fffab1398896fd32665bbbb7b3e7c59dba1a"}, "author": "", "url": "http://www.ft.com/cms/s/0/9d6e15ee-7638-11e5-a95a-27d368e1ddf7.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "UK urged to ease Chinese visa regime", "locations": ["UK", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malcolm Moore"], "text": "UK urged to simplify visa regime for Chinese tourists Malcolm Moore ©Getty Visitors from China tend to stay longer and spend more money than tourists from most other countries \nUK efforts to attract Chinese tourists resulted in a 33 per cent year-on-year rise in arrivals between April and June, according to the latest data. \nThe Office for National Statistics said 64,000 mainland Chinese had made their way through the visa application process to come to the UK in the second quarter. More China investment — good for Britain? \nIn spite of the increase and the renminbi strengthening against the pound, their spending fell by 6 per cent to £151m, said the ONS. \nTourism chiefs have spent years targeting tourists from China who spend an average of £2,688 each, four times more than most visitors, and stay for 10 nights compared with an average of six. \nLast year, the government spent £1.6m on a campaign to give Mandarin names to some UK landmarks . Sherwood Forest, for example, became “Forest of Chivalrous Thieves” and the Cerne Abbas Giant the “Big White Streaker”. \nThis year, George Osborne, the chancellor, launched a £1.3m campaign from October 26 to Christmas that will ask Chinese tourists to share pictures of their visit online. The government hopes that 100m Chinese will see the results. \nThe various campaigns have had some success. During the past five years, the amount spent each year by Chinese visitors has increased by 326 per cent to £497.5m. \nBut the number is low in the context of the boom in China’s travel market . More than 120m Chinese are expected to travel abroad this year and while Asian countries are the top five destinations, France, Italy, Switzerland and Germany round out the top 10. In depth \nXi Jinping: UK state visit \nThe Chinese president is set to address parliament, dine at Buckingham Palace and ride in a royal carriage as London rolls out the reddest of red carpets for the Communist party leader \nBy comparison, the UK received 7.4m visitors from continental Europe, nearly 1m from the US and 152,000 from India in the second quarter, according to the ONS. \nDavid Scowsill, president of the World Travel & Tourism Council, the trade body, said: “Chinese business and leisure travellers should be important to the UK. Imagine the boost to the UK retail and hospitality industries and the economy in general if the UK government was more progressive with visa processing for Chinese consumers.” \nThe disadvantage of being outside the EU’s Schengen single-visa bloc could be offset by offering an online visa process, sparing visitors long queues at consular offices, said Mr Scowsill. The UK could also allow a simplified process that included a UK visa on a Schengen application. \n“We urge the government to think much more radically about this issue. It is extraordinary that the Chinese rank only number 34 among the top markets in terms of visits to the UK,” he said. \nOther issues include strict rules barring Chinese students in the UK from staying on to work, and the lack of a long-term visas. The US has introduced 10-year visas as standard for Chinese visitors, whereas the UK’s default is one year. Related Topics", "external_links": [], "published": "2015-10-19T14:16:00.000+03:00", "crawled": "2015-10-19T19:17:42.561+03:00", "highlightTitle": ""}