{"organizations": [], "uuid": "4c60e12a52e669aa01d640992adeddb1d45c3708", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/the-anomaly-of-pragues-geography.html", "country": "US", "title": "The Anomaly of Prague's Geography", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "The Anomaly of Prague's Geography", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:59:00.000+03:00", "replies_count": 0, "uuid": "4c60e12a52e669aa01d640992adeddb1d45c3708"}, "author": "Lisa Jeeves-2015-10-21T06:59:02-0400", "url": "http://www.articlesfactory.com/articles/travel/the-anomaly-of-pragues-geography.html", "ord_in_thread": 0, "title": "The Anomaly of Prague's Geography", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | October 21, 2015 \nBooked your Prague airport transfers ready for your holiday? You may be confused about the anomaly of Prague's geography. \nAnyone asked the question about to what country the beautiful city of Prague belongs may respond confidently with 'Czechoslovakia'. But that's not right, because the city is actually in the Czech Republic. But what's the difference what does it all really mean? To understand more fully, we need to take a step back to the past. HistoryPrior to the First World War, the area that was to become later known as Czechoslovakia was part of the Austro-Hungarian Empire. A multi-ethnic region of the empire, its peoples were predominantly of German, Czech and Slovak origin. After the defeat of Germany and Austria-Hungary in 1918, Czech and to a lesser extent Slovak nationalism led to the creation of the new independent state of Czechoslovakia.However, the industrialised western parts of the new country, predominantly Czech lands and those of German origin, didn’t always have a lot in common with their more rural Slovak countrymen. Tensions arose and the position was made worse after 1933 by Nazi agitation amongst the approximately 22% of the population with German roots.Just before the onset of World War II, the country was dismembered by Nazi Germany and ceased to exist.The Post-war Years Czechoslovakia was re-constituted after the end of the war. A large number of ethnic Germans were deported into Germany itself, leaving the country largely divided between Czechs and Slovaks. This was a period of the domination of the Soviet Empire in Eastern Europe, and Czechoslovakia was one of the least settled regions of it. The epic but doomed 'Prague Spring' of 1968 showed the world the determination of the people to be free, but also the ruthless determination of the Soviet Union to stop them being so.The fall of the Soviet Union in the 1990s, and the eventual largely peaceful move away from Communism in the country, inspired a generation. For arguably the first time since the 1930s, the country was truly independent again. However, there was an unforeseen consequence of that.Whatever the evils of the old Soviet Empire may have been, they had suppressed to some extent some of the underlying ethnic tensions in many countries, including Czechoslovakia. Very rapidly, the relations between the Slovaks and Czechs began to deteriorate again, but the various parties and ruling government decided this should not be cause for friction. Instead, in 1993, the two parts of the country separated perfectly amicably into the new entirely independent countries of the Czech Republic and Slovakia, becoming individual members of the European Union in the process.The Modern PragueToday, Prague is the proud capital of the Czech Republic and a very popular major tourist centre. For many younger Czechs, the days of being unified with Slovakia are something they can't even remember. Relations between the two countries are amicable and the separation was an all too rare example of a peaceful dissolution of a state. It’s to be hoped that other countries suffering from ethnic tensions may be able to learn something from this experience.Getting to PragueAs a burgeoning touristic destination, there are numerous scheduled and budget airlines flying in to Prague Airport. Transfers to the centre of the city can be prebooked online and are fast, efficient and reasonably priced. As with all airport arrivals though, if you’re travelling at peak times it might be prudent to book Prague airport transfers in advance. For those on a driving holiday around Europe, Prague is very well facilitated, with excellent access to major motorways leading right into the centre. There are also good connections to the rest of the European rail network, making it a very accessible city.   \nLukas Johannes is a driver for Shuttle Direct. If you’re looking for Prague airport transfers , Shuttle Direct provide pre-booked shuttles to major destinations all over Europe. Wherever you travel, Shuttle Direct can make sure that you don’t miss your car on your holiday abroad.", "external_links": [], "published": "2015-10-21T08:59:00.000+03:00", "crawled": "2015-10-22T04:55:44.266+03:00", "highlightTitle": ""}