{"organizations": [], "uuid": "4ad3da5777d07fdf5c161543154b08dead0d4031", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30165198/insurance-auto-auctions-launches-total-loss-solutions-suite-of-products", "country": "US", "title": "Insurance Auto Auctions Launches Total Loss Solutions Suite Of Products", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Insurance Auto Auctions Launches Total Loss Solutions Suite Of Products - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "4ad3da5777d07fdf5c161543154b08dead0d4031"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30165198/insurance-auto-auctions-launches-total-loss-solutions-suite-of-products", "ord_in_thread": 0, "title": "Insurance Auto Auctions Launches Total Loss Solutions Suite Of Products", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Insurance Auto Auctions, Inc.\nFirst in Salvage Industry to Offer Solutions to More Effectively Manage Costs and Improve Customer Service\nWESTCHESTER, Ill. , Oct. 1, 2015 /PRNewswire/ -- Insurance Auto Auctions, Inc. (IAA), a business unit of KAR Auction Services (NYSE: KAR), and the leading live and live-online salvage auto auction company, today announced the launch of IAA Total Loss Solutions™, a suite of products that directly impacts the opportunities to improve customer satisfaction and more effectively manage costs during the total loss claims process. The first two product lines the company has launched are IAA Inspection Services™ and IAA Title Services™.\n\"Our customers are consistently focused on providing the best possible experience for their insureds while increasing the efficiency of their claims process,\" said John Kett , CEO and president, IAA. \"The total loss claims process has become a more important success factor for our property and casualty carrier clients, as well as a primary influencer of customer satisfaction and retention.\"\n\"These are the first products IAA is bringing to market within our Total Loss Solutions strategy,\" commented Pat Walsh , senior vice president of business development, IAA. \"We completed extensive research on the total loss claims process and our results clearly indicate that opportunity exists to help our clients improve customer satisfaction and gain economic benefits.\"\nIAA Inspection Services was developed to reduce the cycle time from date-of-loss to total loss determination. Three offerings are included: Enhanced Images, Condition Report and Appraisal. These offerings are designed to allow direct towing to the salvage auction, where high-resolution imagery can support virtual inspection of vehicles, resulting in faster cycle time and reduced claims cost. Efficiencies within the inspection process can be further leveraged by IAA providing a pre-loss vehicle condition and option report, and a vehicle valuation to provide a comprehensive solution to the total loss claims process.\nIAA Title Services includes three offerings, all designed to suit the specific needs of the customer, including: Title Procurement, Title Solutions and Title Direct. Title Procurement is a seamless offering that can be used by carriers to manage the document procurement process on all total loss claims. Title Solutions can be utilized on those complex claims with unresolved title and document issues. Title Direct is a service that allows documents from multiple sources, typically the insured and lienholder, to be sent directly to an IAA Branch, reducing cycle time and cost for the carrier.\nAbout Insurance Auto Auctions, Inc.\nInsurance Auto Auctions is the leading live and live-online salvage vehicle auction company and a business unit of KAR Auction Services (NYSE: KAR). Headquartered in Westchester, Illinois , IAA has over 165 auction facilities throughout North America offering towing, financing and titling services. With the most auction facilities in North America , IAA provides registered buyers from around the globe with millions of opportunities to bid on and purchase donated and salvaged vehicles. Since 1982, IAA has sold millions of vehicles through its weekly auctions for insurance companies, fleet and rental companies, financing companies, charity organizations and the general public. IAA also leverages its business model to assist charitable organizations in the US through its One Car One Difference® campaign. To date IAA has provided millions of dollars in additional funding to charities by assisting in the processing of donated vehicles. Learn how we are making a difference by visiting www.1car1difference.com . With a talented team of over 2,000 employees, IAA is committed to providing customers with the highest level of services in the salvage auto industry. Go to www.IAA-Auctions.com to learn more, and follow IAA on Facebook and Twitter.\nJeanene O'Brien | Vice President\n(708) 492-7328 | www.iaai.com\nLogo - http://photos.prnewswire.com/prnh/20150617/223790LOGO\n releases/insurance-auto-auctions-launches-total-loss-solutions-suite-of-products-300152892.html\n ", "external_links": ["http://photos.prnewswire.com/prnvar/20150617/223790LOGO", "http://photos.prnewswire.com/prnh/20150617/223790LOGO", "http://www.prnewswire.com/news-releases/insurance-auto-auctions-launches-total-loss-solutions-suite-of-products-300152892.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY17652&Transmission_Id=201510011502PR_NEWS_USPR_____NY17652&DateId=20151001", "http://www.iaai.com/", "http://www.iaa-auctions.com/", "http://www.1car1difference.com/"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T05:36:49.392+03:00", "highlightTitle": ""}