{"organizations": [], "uuid": "06809b82edeafabef85636ac68129bf0820d0d62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "", "site_section": "http://www.rocketnews.com/category/travel/feed/", "section_title": "» Travel", "url": "http://www.rocketnews.com/2015/10/ghost-airport-313-million-illinois-airfield-struggles-to-keep-flights/", "country": "US", "title": "Ghost airport? $313 million Illinois airfield struggles to keep flights", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "Ghost airport? $313 million Illinois airfield struggles to keep flights", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T09:45:00.000+03:00", "replies_count": 0, "uuid": "06809b82edeafabef85636ac68129bf0820d0d62"}, "author": "Editor", "url": "http://www.rocketnews.com/2015/10/ghost-airport-313-million-illinois-airfield-struggles-to-keep-flights/", "ord_in_thread": 0, "title": "Ghost airport? $313 million Illinois airfield struggles to keep flights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last Slide Next Slide \nThis Aug. 26, 2015, photos shows rows of empty chairs inside the terminal at Mid America Airport in Mascoutah, Ill. (Photo: Jeff Roberson, AP) \nMASCOUTAH, Ill. (AP) — A little-used southern Illinois air strip once touted as a competitor to the St. Louis area’s primary airport is rolling the dice that new Las Vegas service will help stem nearly two decades of financial losses. \nMid America Airport has seen a succession of carriers come and go — and go belly up— since its 1997 opening. The airport 25 miles east of downtown St. Louis now has only low-cost Allegiant Air serving two Florida cities twice each week. Twice-weekly service to Vegas begins in November . \nAirport owner St. Clair County lost more than $6 million in 2013 on Mid America, which has yet to turn a profit. Including depreciation, that figure climbs to nearly $13 million. Officials acknowledge that the Vegas service will do little to stem those losses but hope the new route leads to further Allegiant expansion. \n“It was a mistake to start with, and it’s a mistake today,” said Colorado aviation consultant Michael Boyd, a long-time Mid America critic who called the county’s decision nearly two decades ago “civic hubris.” USA TODAY After 15 years, St. Louis’ 2nd airport gets little traction USA TODAY Celebrate National Aviation Day with these amazing photos (2015) \nThe airport was built after federal aviation officials suggested an Illinois alternative to relieve congestion at Lambert-St. Louis International Airport, then a regional hub for now-defunct Trans World Airlines (TWA). \nThe Sept. 11, 2001 terror attacks and the recession later that decade completed the unforeseen trifecta at Mid America, which in 2014 tallied about 16,000 passenger boardings, ranking it near the bottom of the country’s 391 primary service commercial airports — and behind facilities in much smaller communities such as Owensboro, Ky.; Bemidji, Minn.; and Rock Springs, Wyo. \nAirport planners envisioned needing as many as 85 gates to load passengers. Instead, just two passenger gates are plenty at a facility where the majority of air traffic comes from neighboring Scott Air Force Base, which has a joint use agreement with the county. \n“It’s not that public officials don’t make bad decisions,” said St. Clair County Commissioner Ed Cockrell, a former airport supporter who now says the county should consider closing it down and turning the property over to the Department of Defense. “That happens every day. We just have to step up and say we made a bad decision.” USA TODAY The world’s first Boeing 747 gets a much-needed makeover \nMid America boosters say its 10,000-foot runway helped spare Scott AFB from a round of government base closures; opponents suggest those claims are overblown. \nThe federal government contributed about two-thirds of the $313 million airport’s construction costs, with the state kicking in $63 million and the county the remaining $25 million. \n“It was a success the day they put the first spade in the ground,” insisted Richard Sauget, the airport governing board’s chairman. \nThe list of airlines to call Mid America home reads like a requiem for the embattled industry. First came a reincarnated version of Pan American, which offered flights to Gary, Indiana, for 16 months in 2000 and 2001. The next carrier, Great Plains Airlines, lasted just three months before going bankrupt. Then came Transmeridian Airlines for a year, followed in 2005 by Allegiant , which also left Mid America in January 2009, only to resume service there nearly four years later. \nThe airport has largely shifted its focus from commercial service to industrial uses, but again with erratic results. USA TODAY Korean Air is latest airline to get Boeing’s newest, biggest 747 \nAn air cargo company that shipped fresh flowers from South America to Mascoutah received nearly $3 million in county subsidies in a short-lived venture. Boeing converted the dormant refrigerated hangar to a small manufacturing site in 2010, bringing in more than 100 new jobs. A Michigan-based produce company arrived in 2012 to import South American fruit — but a recent visit to North Bay Produce by an Associated Press reporter found that the 54,000-square-foot warehouse remains primarily an over-the-road distribution center that attracts few flights. \nEven if southern Illinois officials were to cut their losses by closing Mid America, selling it, or both, county taxpayers won’t be off the hook anytime soon. \nEarlier this year, a majority of St. Clair County’s 29 commissioners voted to refinance the bonds used to build the airport, extending the notes’ payoff date from 2029 to 2045 while increasing the amount owed, from about $40 million to $88 million. \nAirport director Tim Cantwell remains optimistic that the money-losing airport will eventually turn things around. \n“It takes time,” he said. “Businesses have to grow…The commercial value is going to be so great here in the next 10 to 15 years.” \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-11T09:45:00.000+03:00", "crawled": "2015-10-11T13:29:14.287+03:00", "highlightTitle": ""}