{"organizations": [], "uuid": "ea31633191a4a20a65210275b7ee444601e5c5f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/65052/hawaii-state-environmental-agency-urged-protect-reef-ecosystem", "country": "US", "title": "Hawaii State Environmental Agency urged to protect the reef ecosystem", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Hawaii State Environmental Agency urged to protect the reef ecosystem", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T12:28:00.000+03:00", "replies_count": 0, "uuid": "ea31633191a4a20a65210275b7ee444601e5c5f2"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/65052/hawaii-state-environmental-agency-urged-protect-reef-ecosystem", "ord_in_thread": 0, "title": "Hawaii State Environmental Agency urged to protect the reef ecosystem", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hawaii State Environmental Agency urged to protect the reef ecosystem \nTourism, trade and carelessness are destroying the reef ecosystem in the US State of Hawaii. \nA new effort to crack down on the annual capture of hundreds of thousands of wild reef animals from Hawaii’s fragile reef ecosystem for US household aquariums is underway. Animal protection, conservation and cultural groups are applauding the positions by the Office of Environmental Quality Control and the Environmental Council urging Gov. David Ige and Department of Land and Natural Resources Chair Suzanne Case to issue an emergency moratorium on collection of reef wildlife for aquarium purposes due to unprecedented and ongoing coral bleaching events across Hawaii. \nThe agencies further stated that the aquarium collection trade is subject to review and environmental assessment under the Hawaii Environmental Policy Act. \nInga Gibson, Hawaii state director of The Humane Society of the United States said: “In its 50 year history, the environmental and cultural impacts of the aquarium trade have never been assessed, as required by HEPA. In light of the current, potentially catastrophic, coral bleaching events, we are very concerned about these impacts and urge the DLNR to act swiftly to protect this wildlife and their native reefs from unnecessary ornamental take.” \nGail Grabowsky, Ph.D, Chaminade University professor and former Environmental Council chair said: “The level of coral bleaching occurring on Hawaiian reefs is unprecedented in recent times. This widespread event could result in significant loss of corals and requires an urgent precautionary response. An immediate moratorium on the commercial capture of wildlife for aquariums makes sense while additional solutions are developed.” \nFacts: \nScientists state that more fish, especially herbivores, left protected on reefs can help to alleviate coral reef stressors. Coral bleaching is a devastating crisis that is predicted to get worse. \nHawaii is the largest U.S. supplier of reef wildlife for the aquarium trade and the third largest supplier in the world. Hundreds of thousands of animals are captured annually on Hawaii’s reefs. Some species, once common, have nearly disappeared as a result, including the Bandit Angelfish and the Hawaiian Turkeyfish, both of which are endemic. \nThe aquarium trade in Hawaii primarily targets herbivores such as yellow tang, kole, Achilles Tang and hermit crabs. \nAccording to NOAA, the top two actions coral reef managers can take to help minimize damage during bleaching events involves implementation of protected areas where no or limited activities are permitted and protecting herbivore populations. These can be temporary or long-term to ensure reef recovery and resilience against future stressors and bleaching events. \nIn a similar need for swift action on an emerging issue, on June 26, 2015, DLNR issued an emergency rule prohibiting the take of sea cucumbers due to mass harvesting and the important role sea cucumbers play in protecting Hawaii’s reefs. \nhe Hawaii Environmental Policy Act, Chapter 343, HRS, was first enacted in 1974 to ensure that the environmental consequences of actions proposed within our state are appropriately considered. Oct 21, 2015", "external_links": [], "published": "2015-10-21T12:28:00.000+03:00", "crawled": "2015-10-22T01:02:04.149+03:00", "highlightTitle": ""}