{"organizations": [], "uuid": "9e2d637432023422b85757e7f979911bb2e5ed47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03388/win-a-holiday_3388987k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-23.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/11776679/Win-a-350-holiday-voucher.html", "country": "US", "title": "Win a £350 holiday voucher", "performance_score": 3, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Win a £350 holiday voucher - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T22:45:00.000+03:00", "replies_count": 0, "uuid": "9e2d637432023422b85757e7f979911bb2e5ed47"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/travel/11776679/Win-a-350-holiday-voucher.html", "ord_in_thread": 0, "title": "Win a £350 holiday voucher", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Have you experienced serene solitude and isolation, on a mountain hike, by a remote lake, in the desert or on a far-flung archipelago? The reader who sends in the best entry will win a £350 travel voucher. DialAFlight DialAFlight (0844 556 6060; dialaflight.com ) is one of the UK’s top travel companies, offering tailor-made travel to destinations throughout the world. Whether you’re looking to fly to the Caribbean, long for a round-the-world adventure or are simply seeking a short break, DialAFlight’s 300-strong team of travel managers can assist. No travel itinerary is too big or too complicated and DialAFlight prides itself on offering some of the most competitively-priced air fares in the industry. DialAFlight also offers fabulous deals on hotels, escorted tours and car hire. The prize Save 50 per cent on an all-inclusive Caribbean escape to the Grand Pineapple Beach Antigua . This four-star resort, set on a white-sand beach on the quiet north-east coast, features freshwater swimming pools, tennis courts and complimentary water sports. Seven nights all-inclusive costs from £945 per person (two sharing) including flights (Gatwick). Book by October 31 2015 and travel May 2-24 2016. Or, why not enjoy a journey to the jungle? An 11-night Costa Rica Jungle & Sea Tour – exploring the lush rainforests, dramatic volcanoes and glorious beaches of this tropical paradise – costs from £2,099 per person (saving £250 per couple) including b&b, some other meals and flights (Heathrow). Book by November 20 2015 and travel in March 2016. Submissions Email your entries (no more than 150 words, please) with your name, address and telephone number, by midnight on Wednesday October 28 2015, to yoursay@telegraph.co.uk.The £350 DialAFlight voucher can be used for travel departing within a year of the competition date, subject to availability. It is redeemable against one booking only (international travel only), made within six months of the competition date. The prize is non-transferable and no cash alternative is available. Only one prize voucher can be won per person per year. All bookings are subject to DialAFlight’s booking terms and conditions (see dialaflight.com). Other terms and conditions apply. Email yoursay@telegraph.co.uk for details. Telegraphtravel", "external_links": [], "published": "2015-10-23T22:45:00.000+03:00", "crawled": "2015-10-23T19:11:53.070+03:00", "highlightTitle": ""}