{"organizations": [], "uuid": "1ec216b0296bcacb714db9b90fade90f1d23bee4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30354864/clean-diesel-power-a-key-component-in-long-beachs-greenest-port-in-the-world-accomplishments", "country": "US", "title": "Clean Diesel Power A Key Component in Long Beach's \"Greenest Port in the World\" Accomplishments", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Clean Diesel Power A Key Component in Long Beach's \"Greenest Port in the World\" Accomplishments - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "1ec216b0296bcacb714db9b90fade90f1d23bee4"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30354864/clean-diesel-power-a-key-component-in-long-beachs-greenest-port-in-the-world-accomplishments", "ord_in_thread": 0, "title": "Clean Diesel Power A Key Component in Long Beach's \"Greenest Port in the World\" Accomplishments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Diesel Technology Forum\nWASHINGTON , Oct. 26, 2015 /PRNewswire-USNewswire/ -- The Port of Long Beach announced this month that it has surpassed every air pollution reduction milestone set for 2014 due to air quality improvement programs, including cleaner diesel trucks, low sulfur fuel, and the increased use of shore power for ships.\nAccording to an annual emissions survey, the port has reduced diesel particulates by 85 percent since 2005, nitrogen oxides (NOx) by 50 percent and sulfur oxides by 97 percent. These reductions surpassed the goals established under the San Pedro Bay Ports Clean Air Action Plan, according to Long Beach Port and community officials.\n\"The Port of Long Beach has shown that accelerating investments in new technology clean diesel trucks has propelled the port to both environmental and economic gains. It also lays the foundation for continued progress toward future goals,\" said Allen Schaeffer , the Executive Director of the Diesel Technology Forum .\n\"Mayor Garcia and leadership at the Port of Long Beach are to be recognized for the successful implementation of several emissions reduction programs that allowed them to exceed their air quality goals,\" Schaeffer said. \"These major air quality improvements highlight how the integration of clean diesel trucks, cleaner fuel, electric shore power for ships, and other programs can result in significant reductions in emissions.\"\nAccording to the port's 2014 emissions inventory, the majority of trucks that service the port's terminals – more than 91 percent - are diesel-fueled vehicles. Alternative fuel trucks, primarily those fueled by liquefied natural gas (LNG), made approximately 8.2 percent of the terminal calls in 2014, according to the Port's Clean Trucks Program (CTP) activity records and the Port Drayage Truck Registry (PDTR).\nThe port prohibits trucks older than Model Year (MY) 2007 from entering the complex and requires that trucks register with the port. There are a small number of pre-2007 trucks that get access on a one-time basis but have to pay a significant fee. According to the dray truck registry, about 60 percent of the 16,887 registered trucks entering the port are MY 2007-2009. The remainder are MY 2010 or newer.\n\"Because more than 95 percent of all heavy-duty trucks in the U.S. are diesel-powered, as are a majority of medium-duty trucks, the advancements in diesel technology can play a major role in producing immediate air quality improvements,\" Schaeffer said. \"Over the last 10 years, emissions from heavy-duty diesel trucks, buses and other vehicles have been reduced by 99 percent for nitrogen oxides - an ozone precursor - and 98 percent for particulate emissions.\n\"Today it would take 60 trucks powered by a newer diesel engine to equal the same emissions from one truck manufactured in 1988.\n\"The Port of Long Beach remains the greenest Port in the world, reducing emissions while increasing economic activity,\" Long Beach Mayor Robert Garcia said in a press release from the Port. \"The Port's consistent commitment to sustainability and our environment should be celebrated.\"\nConnect with DTF\nFor the latest insights and information from the leaders in clean diesel technology, join us on Facebook , follow us on Twitter @DieselTechForum, or YouTube @DieselTechForum and connect with us on LinkedIn .\nABOUT THE DIESEL TECHNOLOGY FORUM\nThe Diesel Technology Forum is a non-profit organization dedicated to raising awareness about the importance of diesel engines, fuel and technology. Forum members are leaders in clean diesel technology and represent the three key elements of the modern clean-diesel system: advanced engines, vehicles and equipment, cleaner diesel fuel and emissions-control systems. For more information visit www.dieselforum.org .\n(View this press release online here .)\nAvailable Topic Expert: For information on the listed expert(s), click appropriate link.\nAllen Schaeffer\nhttps://profnet.prnewswire.com/Subscriber/ExpertProfile.aspx?ei=111282\nContact:\nSteve Hansen\nshansen@dieselforum.org\n301-668-7230 (o)\n202-355-3664 (c)\nLogo - http://photos.prnewswire.com/prnh/20120201/MM46474LOGO\n releases/clean-diesel-power-a-key-component-in-long-beachs-greenest-port-in-the-world-accomplishments-300166280.html\n ", "external_links": ["http://www.youtube.com/dieseltechforum", "https://www.facebook.com/dieseltechforum?ref=ts", "http://www.prnewswire.com/news-releases/clean-diesel-power-a-key-component-in-long-beachs-greenest-port-in-the-world-accomplishments-300166280.html", "http://www.dieselforum.org/", "http://www.linkedin.com/company/252044?trk=prof-exp-company-name", "http://photos.prnewswire.com/prnvar/20120201/MM46474LOGO", "http://photos.prnewswire.com/prnh/20120201/MM46474LOGO", "https://profnet.prnewswire.com/Subscriber/ExpertProfile.aspx?ei=111282", "http://dieselforum.org/", "http://www.xmlnews.org/ns/", "http://www.polb.com/news/displaynews.asp?NewsID=1494&TargetID=1", "http://www.dieselforum.org/news/clean-diesel-power-a-key-component-in-long-beach-s-greenest-port-in-the-world-accomplishments", "https://twitter.com/DieselTechForum", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC38805&Transmission_Id=201510261705PR_NEWS_USPR_____DC38805&DateId=20151026"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T23:48:00.812+02:00", "highlightTitle": ""}