{"organizations": [], "uuid": "b960dcab9459abbde656df77e235dc9a843c3157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Copenhagen-Street-Food.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/copenhagen-street-food-celebrates-winter-season/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Copenhagen Street Food celebrates winter seasonTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Copenhagen Street Food celebrates winter seasonTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "1b5181b8c3cf92a00098efde5f652d7ab9d05dda"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/copenhagen-street-food-celebrates-winter-season/", "ord_in_thread": 0, "title": "Copenhagen Street Food celebrates winter seasonTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Copenhagen Street Food celebrates winter season  \nEat your way through street food from 35 different stalls at the popular food market Copenhagen Street Food. From this week Copenhagen Street Food is open Thursday – Sunday until Easter 2016, when the summer season begins. The market is available for rental for large events Monday, Tuesday and Wednesday during the autumn and winter season.\nNew street kitchens \nCurrently, there are no available stalls, and the next ones to open are “Chopped Salad” and “Sweet Food”. Chopped Salad will offer a fresh new experience, where the lettuce is chopped right in front of the guest. “Sweet Food” will serve sweets and cake inspired by seasonal produce. “Sweet Food” is expected to open in late October and “Chopped Salad” is expected to open in early November.\nTaste your holiday memories in Copenhagen’s largest dining hall \nThe old paper warehouses are filled with 35 independent and colourful food trucks and containers where you can enjoy street food from 13 different countries. Taste your holiday memories from e.g. Mexico, Morocco, England, Colombia, Turkey, Denmark, Germany, Italy, Brazil, China, Korea or Thailand. There are lots of opportunities for children, adults, meat-lovers and vegetarians alike.\n“Copenhagen Street Food is a ”must-see” venue and a great place to visit during the dark months. You can hang out near the fireplace with delicious street food, sip hot drinks in the candlelight indoors or enjoy the view to the harbour, Opera and Royal Playhouse near the bonfires on the quay. Bring your date, family, friends and colleagues and enjoy an informal day or evening on the Paper Island, ” says Baris Dikmen, Chairman of the Association Copenhagen Street Food, which operates the street food market.\n \nCosiness \nThe construction of Copenhagen Street Food is soon finished and when winter arrives, the place will be snug and cosy. You are welcome to drop in but it is also possible to make reservations in the “Greenhouse”, which has room for 160 people. With a reservation the waiter will welcome and seat you at a candlelit table, give you a map of the stalls, then take your beverage order while you go and explore the four streets: The Milky Road, The Bull Path, The Grass Path and The Straw Road. There is room for 1,200 people in the 2300m2 large halls.\nCowCash \nCopenhagen Street Food is an island community that has introduced its own currency – CowCash. A coin has a value of DKK 25 and can be used in all stalls and bars. This makes it easy for you to pay the meal for all of your friends. You buy an amount of CowCash, give it your friends, they can purchase exactly the kind of street food the want for CowCash and you get one bill. The stalls also accept credit cards and cash.\nMusic & cocktails – the bars are expanding \nOn weekends you can enjoy live music and DJs that provide a festive mood when the bars are open until late with various cocktails and drinks. The wine & gin bar “Drueta” is getting a rooftop terrace where there will be gin and wine tastings. “Cow Bar” will also get a champagne bar on the roof, where you can enjoy the view to all the colourful stalls – like a little village.\nActivities \nAdditionally, there will be flea markets, concerts and interesting cultural activities. Copenhagen Street Food will exist in warehouse 7 and 8 on The Paper Island until 2018. What will happen to the food market after that is currently unknown.", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T19:58:13.597+02:00", "highlightTitle": ""}