{"organizations": [], "uuid": "2c818bf04e8141da16467627d5208c4f31b29a00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/QuintaDoLago-01oct15.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/irish-ace-mehaffey-joins-elite-field-for-junior-major-at-quinta-do-lago/", "country": "US", "title": "Irish Ace Mehaffey Joins Elite Field for Junior 'Major' at Quinta Do LagoTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Irish Ace Mehaffey Joins Elite Field for Junior 'Major' at Quinta Do LagoTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "2c818bf04e8141da16467627d5208c4f31b29a00"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/irish-ace-mehaffey-joins-elite-field-for-junior-major-at-quinta-do-lago/", "ord_in_thread": 0, "title": "Irish Ace Mehaffey Joins Elite Field for Junior 'Major' at Quinta Do LagoTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Irish Ace Mehaffey Joins Elite Field for Junior ‘Major’ at Quinta Do Lago Published on : Friday, October 2, 2015\nNorthern Ireland’s Olivia Mehaffey will head a select group of some of golf’s top up-and-coming amateur stars who have been confirmed to play in the prestigious Telegraph BMW Junior Championship at Quinta do Lago in Portugal next month.\nThe 17-year-old will be one of 12 boys and nine girls who will gather at the famous Algarve resort from October 12-17 to compete for the chance to be added to an illustrious roll call of previous winners including Justin Rose, Tom Lewis, Tommy Fleetwood, Matthew Fitzpatrick, Melissa Reid and Carly Booth.\nMehaffey, from Banbridge, has enjoyed her most successful year ever in 2015, with victory in the Scottish Amateur Stroke Play Championship and a runner-up finish at Ladies’ British Open Stroke Play helping her win the 2015 LGU Order of Merit title and rise to third place in the European rankings.\nJoining her in the field for the prestigious 54-hole junior tournament will be a host of other potential stars from golf’s next generation including 2015 English Girls’ Under-16 champion Cloe Frankish; Jamie Li, who will be making his third successive appearance in the event; and England Squad members Louisa Brunt, Eloise Healey and Billy Spooner.\nQualifying for the 2015 Telegraph BMW Junior Championship began this spring with hundreds of qualifying rounds being staged at clubs across the UK over the summer.\nHailed by victorious European Ryder Cup captain Paul McGinley as one of junior golf’s Majors, the tournament will be held on Quinta do Lago’s new North Course, one of the most talked-about design projects in Europe in 2014.\nOne of three 18-hole championship courses at the luxury resort, the new-look layout has quickly become a firm favourite with golfers and, as well as being named ‘Europe’s Best New Golf Course’ at the 2014 World Golf Awards, was a new entry in Golf World’s benchmark Top 100 Courses in Continental Europe 2015/16 rankings.\nThe official winter training base for England Golf’s elite squads, Quinta do Lago is perfect for a relaxing family holiday in exquisite surroundings and offers the very best in award-winning sports and leisure facilities, with a wide variety of pursuits to enjoy in addition to its outstanding golf facilties.\nSource:- IAGTO", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T18:08:48.607+03:00", "highlightTitle": ""}