{"organizations": [], "uuid": "30184f88610f35f3ca5d555201357d771bb92e5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://photos.prnewswire.com/prnvar/20150918/268165LOGO", "site_section": "http://rss.prnewswire.com/industry/tra/", "section_title": "PR Newswire: Travel", "url": "http://www.prnewswire.com/news-releases/portland-resident-selected-as-travelocitys-second-travel-for-good-voluntourism-award-recipient-300160294.html", "country": "IT", "title": "Portland Resident Selected as Travelocity's Second Travel f", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Portland Resident Selected as Travelocity's Second Travel f", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:33:00.000+03:00", "replies_count": 0, "uuid": "30184f88610f35f3ca5d555201357d771bb92e5d"}, "author": "Travelocity", "url": "http://www.prnewswire.com/news-releases/portland-resident-selected-as-travelocitys-second-travel-for-good-voluntourism-award-recipient-300160294.html", "ord_in_thread": 0, "title": "Portland Resident Selected as Travelocity's Second Travel f", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS , Oct. 15, 2015 /PRNewswire/ -- Committed to making the world a better place one trip at a time, Travelocity® selected Pauline Lewis , a local resident of Portland , as the second of three travel award recipients for this year's Travel for Good program. Pauline will receive an all-expense-paid voluntourism trip to Ethiopia to assist and help orphaned children and marginalized women find permanent families with the Selamta Family Project. In addition, Travelocity will make a $10,000 donation directly to the Selamta Family Project. \"Working with nonprofits has been a lifelong passion of mine,\" said Lewis. \"I can't wait to immerse myself by meeting the families, learning from them and working to bring back individual stories so that people in the U.S. can feel as connected to Selamta families as I do.\"\nLewis lives in Portland, Ore. and was chosen from among thousands of entries for her unique passion to help those in need across the globe.\n\"We continue to be inspired by the incredible submissions to the Travel for Good program,\" said Ashley Parker , Senior Brand Manager and head of the Travel For Good program. \"Pauline's love for helping orphaned children in need is an inspiration to us all and we are thrilled to assist in making her voluntourism dream possible.\"\nThe Travel for Good program is still accepting submissions via Twitter through Sun., Oct. 18 at 11:59 p.m. ET . To apply, interested individuals must follow @Travelocity or @TravelForGood on Twitter and use the hashtag #TravelForGood, share the location and purpose of their trip, the organization with whom they want to volunteer and why they are passionate about that cause. Applications can be submitted in any shareable format, including text, images and video, to best demonstrate the goals of their trip and volunteer efforts.\nFor more information and full program details, visit the Travel for Good page at www.travelocity.com/travelforgood . Entries can also be submitted directly from this page. Travelocity will also be awarding $500 to 100 individuals to get them started on saving for their own Travel for Good efforts. All of the travel award recipients will be notified throughout the duration of the campaign.\nAbout Travelocity\nTravelocity wants to inspire you to \"Go & Smell the Roses!®\" and is dedicated to being your kindred spirit – a travel companion and a travel instigator, roaming the world beside you while helping make your traveling experience memorable with innovative apps, competitive prices and 24/7 customer service. Based in Dallas, Texas , Travelocity is owned by Expedia, Inc., one of the world's leading travel companies, with an extensive brand portfolio that includes many of the world's leading online travel properties.\n© 2015 Travelscape, LLC. All rights reserved. Travelocity, Travel For Good, the Travel For Good logo, the Star Design and Go & Smell the Roses are trademarks of Travelscape, LLC. All other trademarks and logos are property of their respective owners.  CST# 2056372-50\nContact\nJina Michael \nCitizen Relations for Travelocity\n310-698-9009\njina.michael@citizenrelations.com \nLogo - http://photos.prnewswire.com/prnh/20150918/268165LOGO \n \n\nSOURCE Travelocity\n\n\nRELATED LINKS\nhttp://www.travelocity.com", "external_links": [], "published": "2015-10-15T18:33:00.000+03:00", "crawled": "2015-10-15T18:34:27.093+03:00", "highlightTitle": ""}