{"organizations": ["Lucca Lucca Travel"], "uuid": "ade5ac2810f22fbd48970643d73075298aca9709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeurope.about.com", "main_image": "http://f.tqn.com/y/goeurope/1/S/F/X/2/140519352.jpg", "site_section": "http://z.about.com/6/o/m/goeurope_t2.xml", "section_title": "About.com Europe Travel: What's Hot Now", "url": "http://goeurope.about.com/od/lucca/a/lucca_guide.htm", "country": "US", "title": "Visit Giacomo Puccini's Home Town: Lucca", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Visit Giacomo Puccini's Home Town: Lucca", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T14:05:00.000+03:00", "replies_count": 0, "uuid": "ade5ac2810f22fbd48970643d73075298aca9709"}, "author": "", "url": "http://goeurope.about.com/od/lucca/a/lucca_guide.htm", "ord_in_thread": 0, "title": "Visit Giacomo Puccini's Home Town: Lucca", "locations": ["Northern Tuscany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Konrad", "Giacomo Puccini"], "text": "Lucca Travel and Tourism Guide Visit a Jewel of a City in Northern Tuscany Sign Up for our Free Newsletters Thanks, You're in! Health Tip of the Day Sign up There was an error. Please try again. Please select a newsletter. Please enter a valid email address. Did you mean ? Expert Videos Konrad Wothe/LOOK-foto/LOOK/Getty Images \nTired of trudging up steep slopes to get to that Tuscan hill town? Lucca may be the answer. With its imposing 16th century ramparts still wrapped around the compact village sitting on flat ground, Lucca offers the casual stroller wonderful opportunities to walk off that heavy Tuscan lunch without breaking a sweat. Lucca: Location \nLucca sits on an alluvial plateau near the Serchio river, 19 meters above sea level. Lucca is located 30 kilometers northeast of the Pisa airport and 85 kilometers west of Florence in Northern Tuscany. Lucca was an important junction in Roman times, you'll see it in the north-south grid pattern of main streets and in the elliptical plan of the \"Piazza Anfiteatro\" . To the north of Lucca lie the Apuane Alps with their famous marble quarries , spas and mineral water springs, streams, woods and caves. Getting to and from Lucca \nLucca's train station is two blocks outside the ramparts (enter at Porta San Pietro) on the south side of town in Piazza Ricasoli. Lucca is on the Florence-Viareggio train line, with frequent service to Florence. It takes 70 minutes to an hour and a half to go from Lucca to Florence. Here's a map of Lucca showing the train station, a suggested walking route, and the major attractions. \nBuses run daily to Florence and Pisa as well, and leave from Piazza Verdi, adjacent to the tourist office. \nLucca is on the A11 Autostrada between Viareggio and Florence . Lucca from Above: Guinigi Tower \nCasa Guinigi was the fifteenth-century home of Lucca's leading family. Like rich folks of the period, they built a tower. This one, however, is unique for the oaks that grow from it (and down into the room below). You can climb up and get wonderful views of Lucca in all directions. Check your camera battery before you go--it's 230 steps back down.. Our Lucca Photo Gallery has pictures from Guinigi Tower. Giacomo Puccini \nLucca was the birthplace of Giacomo Puccini (in 1858), one of Italy's most famous operatic composers. Today you can visit his birth house, which is now a museum, at Corte S. Lorenzo, 9 (via di Poggio) in Piazza della Cittadella, featuring a bronze statue of Puccini in the center. The Puccini Festival, held in an open-air theater in nearby Torre del Lago, allows opera lovers to feel the inspiration of the surroundings Puccini chose to live in. The theater opens out directly to a view of Lake Massaciuccoli with the Apuan Alps in the background. The Puccini festival is held May-August. See the official Puccini Festival web site for more. If you go, take some good mosquito repellent . Lucca's Ramparts \nLucca is surrounded entirely by 16th century walls. In the 19th century, trees were planted and now the ramparts can be walked or cycled. It's approximately three miles around the oval. Bicycles can be rented; the top is paved. Where to Stay \nIf you like hotels, look for user-rated Lucca hotels on Hipmunk. If you need to stay near the train station and just outside the walls, we like the Hotel Rex , very convenient if you're coming in by train; you can drop off your luggage, cross the street and in a couple of minutes are inside the walls and very near the action. \nIf you prefer a vacation rental, HomeAway lists over 1000 in the Lucca area . Where to Eat \nLucca offers up some pretty fine Tuscan cuisine. The restaurant most talked about is Ristorante Buca di Sant'Antonio . Have some farro soup, one of the oldest dishes in Italy and a favorite of Giacomo Puccini and Ezra Pound, according to the Restaurant's web site. For an informal and inexpensive meal, we like Trattoria da Leo ( Review ). Our current favorite for traditional cuisine of Lucca is Trattoria da Giulio, Via delle Conce, 45, in the northwest quadrant of the city, right near the walls. The Villas of Lucca \nIf you have a car, or find a tour, you can take in the Villas of Lucca, a string of grand villas and their formal gardens located to the north of Lucca and open to the public. Our favorite is Villa Torrigiani . If you do the whole tour, you'll end up in Collodi, where you can visit Collodi, the birthplace of Pinocchio , where you can visit the Pinocchio Park, great for the kids. Famous Churches \nThe Romanesque Duomo di San Martino, completely rebuilt between the twelfth and fifteenth centuries, contains the Volto Santo (Holy Face), a wooden figure of Christ. The Volto Santo is believed to be the face of Christ, carved by Nicodemus who was present at the crucifixion. \nThe facade of San Michele in Foro found in Piazza San Michele is probably the most photographed church in Lucca. If it looks tacked on, it's because they spent all the money on it, and didn't have enough left to raise the church as high as the facade. The columns in the facade are all different, and the archangel crowning the church features retractable wings to survive high winds. Puccini sang in the choir here. Open daily 7:40-noon and 3-6. Lucca in a Different Light \nIf you happen to be around Lucca in September, the Luminaria di Santa Croce features the the old town awash in candelight as \"il Volto Santo,\" a wooden sculpture of Christ is carried through the cobbled streets of the old town to the Duomo. Other Attractions \nFor a comprehensive list of the major attractions in Lucca, see Lucca Top Attractions . Of course, as in any city, a major attraction is wandering the medieval streets and seeing the little details that are normally hundreds of years old. Lucca is a great strolling town because very little traffic is found inside the walls. Lucca Weather and Climate \nI've never sweltered inside Lucca's walls; there's always shaded alleyways to duck into on a hot summer day. For the historical climate and current weather, see Lucca Travel Weather Near Lucca \nThe town of Barga , north of Lucca on the edge of the Garfagnana region and the Apuane Alps (Alpi Apuane), is considered one of the most beautiful medieval walled cities in Tuscany, yet it's only lightly touristed. \nPietrasanta , a small medieval town near the coast and sitting upon the foothills of the Apuan Alps, is the place Michelangelo came for the best stone. It's still an important center for working Marble, and you'll find many artisans at work here. \nTorre del Lago Puccini is a small town on the shores of Lake Massaciuccoli where the Puccini festival is held. Lake lovers will love the lake. Get more information from our virtual tour: Torre del Lago Pictures . \nFlorence is 1 hour and 18 minutes from Lucca by train, a trip that will cost you about $20 on the train, but there's a cheaper bus. (See the route and current prices .) Related Articles", "external_links": [], "published": "2015-10-02T14:05:00.000+03:00", "crawled": "2015-10-03T00:56:46.383+03:00", "highlightTitle": ""}