{"organizations": [], "uuid": "449f57edc4b0a4bf4fea570dc03c11dd377b374b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/65071/fraport-expands-electric-vehicle-fleet-frankfurt-airport", "country": "US", "title": "Fraport expands electric vehicle fleet at Frankfurt Airport", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Fraport expands electric vehicle fleet at Frankfurt Airport", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:05:00.000+03:00", "replies_count": 0, "uuid": "449f57edc4b0a4bf4fea570dc03c11dd377b374b"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/65071/fraport-expands-electric-vehicle-fleet-frankfurt-airport", "ord_in_thread": 0, "title": "Fraport expands electric vehicle fleet at Frankfurt Airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click here for information and nomination Fraport expands electric vehicle fleet at Frankfurt Airport \nFRANKFURT, Germany - Airport operator Fraport AG continues to expand its fleet of electric-powered vehicles at the company’s Frankfurt Airport (FRA) home base with the addition of 10 more electric cars, as well as a prototype container-transport vehicle to be used in ground handling operations for carrying baggage to and from the aircraft. \nThe new container-transport vehicle from Mulag is equipped with twin 80 volt lead-acid batteries serving as the power source for the vehicle’s two electric motors. The prototype has a load capacity of seven tons and can reach a top speed of 25 kilometers per hour. First reviews in day-to-day operations have already shown an energy saving of 80 percent versus a comparable diesel-powered vehicle – thereby reducing emissions on the apron and contributing to Fraport’s overall carbon-reduction efforts at FRA. \nPowered by electric batteries only, the 10 passenger cars from Mitsubishi provide a maximum speed of 130 kilometers per hour and a range of 150 km. Fraport’s ground handling unit uses these cars for service performance of aircraft handling activities at Frankfurt Airport. \nThis acquisition of electric vehicles is part of the “E-Fleet operated by Fraport” project – supported by funding from the German Ministry of Transport and Digital Infrastructure, as part of the Rhine-Main Electromobility Model Region initiative. This fleet expansion is also part of the E-Port An consortium involving Fraport, Lufthansa Group and other partners, which is facilitated by the State of Hesse to promote electrification of vehicles used in aircraft handling. Oct 21, 2015", "external_links": [], "published": "2015-10-21T22:05:00.000+03:00", "crawled": "2015-10-22T01:01:45.831+03:00", "highlightTitle": ""}