{"organizations": [], "uuid": "f622071e4f83aeb67e48d95c7227c85141a9c132", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/1200_630/5611f5911800002e00dc11b7.jpeg?cache=vceDFb0qwT", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/disneyland-annual-pass-increase_5611d177e4b0dd85030c6adf", "country": "US", "title": "Disneyland Annual Pass Jumps To More Than $1,000", "performance_score": 3, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Disneyland Annual Pass Jumps To More Than $1,000", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:06:00.000+03:00", "replies_count": 0, "uuid": "f622071e4f83aeb67e48d95c7227c85141a9c132"}, "author": "Ed Mazza", "url": "http://www.huffingtonpost.com/entry/disneyland-annual-pass-increase_5611d177e4b0dd85030c6adf", "ord_in_thread": 0, "title": "Disneyland Annual Pass Jumps To More Than $1,000", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Disneyland Annual Pass Jumps To More Than $1,000 The increase comes as the park gets ready to temporarily close several major attractions. Ed Mazza Overnight Editor, The Huffington Post Posted: 10/05/2015 01:06 AM EDT photographerglen/Flickr Sleeping Beauty Castle at Disneyland, where the price of an annual pass with no blackout dates has jumped to $1,049 from $779. \nThe \"happiest place on Earth\" might be a little less happy these days as Disneyland fans turn grumpy over a new round of price increases -- including the introduction of an annual pass that costs more than $1,000. \nThis week, Disney eliminated many of its current annual pass options for both the Disneyland Resort in Anaheim and the Walt Disney World Resort in Florida, replacing them with new passes that in most cases are more expensive. \nAnd in one case, it's a lot more expensive: An annual pass to Disneyland and Disney's California Adventure with no blackout dates has jumped by nearly $300. \nThe new $1,049 Disney Signature Plus replaces the $779 Premium Annual Passport. Like the Premium pass, the Signature Plus allows for unlimited attendance to both Anaheim parks and provides discounts on some food and merchandise. The Signature Plus will also include additional perks such as parking and unlimited downloads of PhotoPass images such as the pictures taken on rides. \nA lower-priced pass offers access to the parks 350 days a year -- all but the two busy weeks around Christmas and New Year's -- for $849. \nA full list of prices and benefits is available on the Disneyland website. \nIt's the second time this year annual pass prices have risen, with a February increase bringing the no-blackout cost from $699 to $779. \nSome parkgoers are complaining that the increase comes as Disneyland gets ready to shut down a number of popular attractions for an extended period, including the Disneyland Railroad and Tom Sawyer Island, due to construction of the new \"Star Wars\" land. Welcome to Disneyland where we're about to charge you lots more money for six fewer attractions! — David Daut (@Illusion0fLife) October 4, 2015 Disneyland pass increase would feel justified if it came at the opening of new attractions but its coming when a lot of stuff is closing. — Peter Sciretta (@slashfilm) October 4, 2015 Disneyland stopped selling Premium annual passes, and replaced it with a new pass that's exactly the same except it's $1000. ✨Disney✨Magic✨ — Alec.pdf (@alecsahagian) October 4, 2015 \nThe price of single-day tickets did not change, with a day at Disneyland costing $99. \nPrices for annual passes at Walt Disney World also jumped, with the new Platinum Pass -- which allows entry into the parks all year -- now costing $749. The annual pass had previously cost $654. \nA number of other passes are also available at both parks, including passes for local residents and members of the Disney Vacation Club. The Disney Premier Passport, which offers unlimited access to both Disneyland and Walt Disney World, now costs $1,439, up from $1,099. \nThe company said more changes may be ahead, including pricing that could vary from day to day based on demand.", "external_links": [], "published": "2015-10-05T08:06:00.000+03:00", "crawled": "2015-10-05T08:18:53.742+03:00", "highlightTitle": ""}