{"organizations": ["Food Groups of Florida Updated", "Food Groups of Florida In Partnership"], "uuid": "8b3c35339e3570604e72bc0293168a66e7416af9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/cc/0a/WHIO_Facebook_Icon.png", "site_section": "http://www.whio.com/feeds/categories/travel/", "section_title": "News | Travel", "url": "http://www.whio.com/feed/travel/the-4-food-groups-of-florida/fCG7CQ/", "country": "US", "title": "The 4 Food Groups of Florida", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "The 4 Food Groups of Florida", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:47:00.000+03:00", "replies_count": 0, "uuid": "8b3c35339e3570604e72bc0293168a66e7416af9"}, "author": "", "url": "http://www.whio.com/feed/travel/the-4-food-groups-of-florida/fCG7CQ/", "ord_in_thread": 0, "title": "The 4 Food Groups of Florida", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: 5:11 p.m. Friday, Oct. 9, 2015 | Posted: 9:47 a.m. Friday, Oct. 9, 2015 The 4 Food Groups of Florida In Partnership with VisitFlorida.com \nLike much of the culinary world, Florida’s tastes have adapted to exotic and eclectic palates. There are wonderful places throughout the state to get a banh mi sandwich, a spicy tikka masala , an authentic Italian tiramisu or a crispy schnitzel. \nBut if you’re looking for a true Florida experience that’s not only delicious but delightfully down-home, you can’t go wrong with the basics: the crab claws, the oranges, the gator tail, the Cuban sandwich. Florida cuisine is hodgepodge of Latin, Caribbean and southern flavors and you can taste these influences in dishes throughout both coastal and inland counties. \nWhile each region of Florida seems to have its own specialty items – from freshly caught spiny lobster in the coastal areas to the delicate boiled peanuts along the interstate system – here are the four basic food groups you should look for when visiting the Sunshine State. VISIT FLORIDA FILE \nNo visit to the Sunshine State would be complete without sampling some fresh seafood. \nSwim through a seafood lover’s paradise \nGrilled oysters, meaty crab cakes, juicy snapper, blackened grouper … the list of Florida’s greatest culinary gems goes on and on. When you’re visiting a state almost surrounded by the ocean, you can’t pass up a taste of some of the freshest seafood you’ll find anywhere. \nWhile Stinky’s Fish Camp in northwest Florida’s Santa Rosa Beach might sound less than appetizing, the rustic, cabin-like restaurant is known for its cornucopia of shellfish and seafood, including local oysters served 18 ways, ceviche straight from the Gulf Coast, and a number of crawfish dishes. Stinky’s view of Dune Allen’s rare coastal dune lakes is magnificent. \nFor a more low-country meal with a unique flavor and atmosphere, Ted Peters’ Famous Smoked Fish in St. Petersburg serves simple platters of mullet, mackerel, salmon and mahi-mahi, all smoked from 4 to 6 hours in a special on-site smoke shack that curious visitors love to walk into and see for themselves. \nIf you’re on the East Coast, the Atlantic Ocean’s rock shrimp is a must, especially during the peak season of July through November. The small, hard-shelled crustaceans have to be cracked by machine but they have a big flavor and can be steamed, broiled, fried or sautéed. New Smyrna Beach locals love JB’s Fish Camp for rock shrimp dishes, and The Whale’s Rib Raw Bar in Deerfield Beach also serves them in a variety of ways. VISIT FLORIDA file \nFlorida is a major producer of oranges as well as grapefruits, limes and lemons. \nSqueeze in a little Citrus \nPerhaps surprisingly, Florida oranges are not native to the state since they were brought in and planted by Spanish settlers in the 1500s. But thanks to a the perfect climate, juicy citrus immediately flourished in Florida, making the state now a famous producer of the world’s orange supply, as well as grapefruits, limes and lemons. \nTo see these beauties in the flesh and tour working groves, Florida’s Natural Grove House in Lake Wales and Mixon Fruit Farms in Bradenton provide a glimpse of what goes into growing, as well as free samples of juices and plenty of fruit crates and gift items for sale. Al’s Family Farms in Fort Pierce is a third-generation business that grows a staggering number of citrus varieties and has a tour that includes a playful “O.J. Corral” that has a citrus maze and orange-racing chutes. \nAs if that’s not enough to make you thirsty, Florida Orange Groves Winery in St. Petersburg produces 36 different tropical, citrus and berry wines, some of which have contributed to the winery’s 211 medals in national and international competitions. The winery includes a free tour with a tasting bar that offers free wine tastings. VISIT FLORIDA file \nGuests are seated in the main dining area of the Columbia Restaurant in Ybor City. \nPay homage to Florida’s Latin roots \nGiven Florida’s robust Latin-American population, it’s no wonder so many restaurants feature strong Cuban, Puerto Rican and Dominican flavors on their menus. \nThe best tend to be those that got here first, and few can make that claim as convincingly as Ybor City’s Columbia Restaurant , founded in 1905 by a Cuban immigrant and thought to be Florida's oldest restaurant, as well as the largest Spanish restaurant in the world. Coated in colorful mosaics and preserving an old-world feel, Columbia is famous for its garlicky 1905 salad with olives, cheese and ham served with fresh Cuban bread, as well as its hearty paella and arroz con pollo . \nCoincidentally, Tampa also claims to be home of the authentic Cuban sandwich, a hot-pressed delight of ham, roast pork, Swiss cheese and mustard, but Miami will beg to differ. South Florida is filled with top-notch Cuban restaurants – Las Olas Café , Sarussi Café and Enriqueta’s Sandwich Shop to name a few. \nFor a different type of Latin flair, Orlando’s Casa Mofongo stays true to its Puerto Rican roots with dishes such as Masitas de Pollo Encebollada (chicken pieces with onions), Pastelón de Plátanos Maduros (plantain lasagna) and sides of yucca or beans. The restaurant serves something called Sangria Don Juan – “the best wine punch in the universe,” the menu claims, “straight from Puerto Rico.” VISIT FLORIDA file \nSome of Florida's freshest fare can be found at the many farmers' markets throughout the state . \nIndulge in Florida’s native flora and fauna \nAny culinary adventure in Florida would not be complete without grazing by roadside stands and shops, such as the Parkesdale Farms Market , located for more than 30 years off of Interstate 4 in Plant City. The farm harvests more than an 3 million pounds of strawberries annually and the ones they don’t ship get served in rich milkshakes, atop tender shortcakes, and as jams, salad dressings and candies. \nBoiled peanuts are somewhat of a Florida delicacy and can be found in barrels at many mom-and-pop convenience stores and gas stations in north and central Florida, though the freshest ones are usually found at fly-by-night roadside kiosks and farmers’ markets. \nThe mild taste of alligator meat makes it a popular offering among Florida restaurants, which typically serve it fried with a dipping sauce. Tampa’s Skipper’s Smokehouse is the perfect Florida setting for gator tail nuggets and gator sandwiches, offering outdoor picnic-style seating, live music on most evenings under a moss-covered canopy of oaks. \nSt. Augustine’s Creekside Dinery advertises “low country cookin’” on a deck overlooking the city’s oldest boatyard on marshy Gonzales Creek. The restaurant serves shrimp and oysters smothered in a spicy sauce made from St. Augustine datil peppers, as well as seafood filled with Florida blue crab stuffing and grilled fresh catches with Key Lime butter. \nThere’s no shortage of great dining options in Florida, whether it’s fancy five-star nouvelle cuisine or roll-up-your-sleeves Cracker food served in paper trays. For the more adventurous types willing to sniff out the most quintessential Florida meals, a delightful vacation experience awaits. \nWant to see and read more about Florida food? Try these links:", "external_links": [], "published": "2015-10-09T16:47:00.000+03:00", "crawled": "2015-10-10T06:28:33.092+03:00", "highlightTitle": ""}