{"organizations": [], "uuid": "e6a0235d322712a7620cdde8659144c73c593528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "https://photos.prnewswire.com/prnvar/20151006/274297", "site_section": "http://www.prnewswire.com/rss/travel/travel-news.rss", "section_title": "PR Newswire: Travel Industry", "url": "http://www.prnewswire.com/news-releases/hyatt-regency-brand-unveils-global-marketing-campaign-highlighting-unexpected-insights-from-travelers-300154860.html", "country": "US", "title": "Hyatt Regency Brand Unveils Global Marketing Campaign Highl", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Hyatt Regency Brand Unveils Global Marketing Campaign Highl", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T22:19:00.000+03:00", "replies_count": 0, "uuid": "e6a0235d322712a7620cdde8659144c73c593528"}, "author": "Hyatt Hotels Corporation", "url": "http://www.prnewswire.com/news-releases/hyatt-regency-brand-unveils-global-marketing-campaign-highlighting-unexpected-insights-from-travelers-300154860.html", "ord_in_thread": 0, "title": "Hyatt Regency Brand Unveils Global Marketing Campaign Highl", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHICAGO , Oct. 6, Hyatt Hotels Corporation (NYSE: H ) today announced the launch of a multi-million dollar integrated global marketing campaign for the Hyatt Regency brand. \" It's Good Not to Be Home, \" the largest campaign in Hyatt Regency's nearly 50-year history, celebrates ways Hyatt Regency hotels and resorts, a member of the Hyatt Gold Passport ® family of brands, helps its guests make the most of being away. This goes against the assumption that guests are always looking for a home away from home while traveling. \"We heard loud and clear from travelers around the world that while it is good to be home, there is an inherent freedom in traveling and breaking from routine, making new connections and experiencing new things,\" said Sandra Cordova Micek , senior vice president global brands, Hyatt. \"This campaign lets travelers know that we not only understand, we agree. That's why we are celebrating the simple human truths about travel that sometimes being away from home can actually be good. The Hyatt Regency brand gives guests everything they need in one place – fantastic hotels and resorts around the world, caring staff, excellent food, and the list goes on.\"\nThe Hyatt Regency brand worked with advertising agency Pereira & O'Dell on the global marketing campaign, which is aimed at both consumers and meeting planners. The integrated marketing campaign includes TV, social, digital, out of home and print media, a surprise and delight program, in-hotel activations and conference take-overs that will continue to roll out through October and November.\n\"The best creative work happens when we are in tune with the consumer. We believe that the insight that sometimes 'it's good not to be home' will not only resonate, it will help a well established brand break through in a sea of 'home away from home' messages in the category,\" said PJ Pereira, founder and chief creative officer, Pereira & O'Dell. \"The Hyatt Regency brand does a ton of research and prototyping to innovate and evolve the guest experience. We're excited to work with the brand to help tell its story.\"\nStrategic Partnerships with Fast Company , Comedy Central (in the U.S.)\nThe Hyatt Regency brand is part of the Hyatt Gold Passport family of brands, whose overall purpose is caring for our community of travelers so they can be their best, wherever they are. Unexpected ways of caring for guests include connecting them to others, and even just making them laugh.\nThe Hyatt Regency brand is teaming up with Fast Company to create opportunities for entrepreneurial-minded travelers to connect. Fast Company will host experiential sessions at select Hyatt Regency hotels, including a series of workshops and networking events designed to allow guests to make new connections and to remember why, sometimes, it's good not to be home.\nThe Hyatt Regency brand is also working with Comedy Central to tap into the universal power of humor to bring people together by celebrating funny \"not at home\" moments. The brand will join forces with Comedy Central and follow a comedian on the road to the New York Comedy Festival , which Hyatt Gold Passport is also sponsoring. Guests will also be treated to surprise and delight comedic moments at select hotels across the U.S.\nThe Hyatt Regency Experience\nThe Hyatt Regency brand continues to evolve the overall guest experience in a continuous effort to help guests be at their best. From free WiFi to new guest room prototypes to redesigned public spaces, guests enjoy a seamless technology experience and space designed to uniquely fit their needs. Whether they are staying for work or play, Hyatt Regency hotels and resorts strive to help guests make the most of being away from home.\nThe Hyatt Regency brand's \"It's good not to be home\" video assets can be found at https://youtu.be/aB-VQMsBaos .\nAbout Hyatt Regency\nThe Hyatt Regency brand is part of Hyatt Gold Passport and guests can enjoy all the benefits as a member of the loyalty program. The Hyatt Regency brand prides itself on connecting travelers to who and what matters most to them. More than 150 conveniently located Hyatt Regency urban and resort locations in over 30 countries around the world serve as the go-to gathering space for every occasion – from efficient business meetings to memorable family vacations. The brand offers a one-stop experience that puts everything guests need right at their fingertips. Hyatt Regency hotels and resorts offer a full range of services and amenities, including notable culinary experiences; technology-enabled ways to collaborate; the space to work, engage or relax; and expert planners who can take care of every detail. For more information visit www.hyattregency.com .\nThe term \"Hyatt\" is used in this release for convenience to refer to Hyatt Hotels Corporation and/or one or more of its affiliates.\nAbout Hyatt Hotels Corporation\nHyatt Hotels Corporation, headquartered in Chicago , is a leading global hospitality company with a proud heritage of making guests feel more than welcome. Thousands of members of the Hyatt family strive to make a difference in the lives of the guests they encounter every day by providing authentic hospitality. The Company's subsidiaries develop, own, operate, manage, franchise, license or provide services to hotels, resorts, branded residences and vacation ownership properties, including under the Hyatt®, Park Hyatt®, Andaz®, Grand Hyatt®, Hyatt Centric ™ , Hyatt Regency®, Hyatt Place®, Hyatt House®, Hyatt Zilara ™ , Hyatt Ziva ™ , Hyatt Residences® and Hyatt Residence Club® brand names and have locations on six continents. As of June 30, 2015 , the Company's worldwide portfolio consisted of 618 properties in 51 countries. For more information, please visit www.hyatt.com .\nVideo - http://youtu.be/aB-VQMsBaos\nPhoto - http://photos.prnewswire.com/prnh/20151006/274297\nPhoto - http://photos.prnewswire.com/prnh/20151006/274298\nSOURCE Hyatt Hotels Corporation\nRELATED LINKS\nhttp://www.hyatt.com", "external_links": ["http://www.hyattregency.com/", "http://youtu.be/aB-VQMsBaos", "https://urldefense.proofpoint.com/v2/url?u=https-3A__youtu.be_aB-2DVQMsBaos&d=BQMF-g&c=Hso5VlsiAbVjjQbjbkggFA&r=fx0g2PZgQ5VSvXdz0F6TmjgqcgWhKPpzndZQlPWQvrA&m=AfwMac-v39VGwcA8aKo6WVqBL86sD550A7C4DkFYvUk&s=s10ugMW3kANZLukIh7U-L0aO82_MowZljz2hIADLhC4&e=", "https://youtu.be/aB-VQMsBaos", "http://www.hyatt.com/", "http://studio-5.financialcontent.com/prnews?Page=Quote&Ticker=H", "http://nycomedyfestival.com/", "http://www.regency.hyatt.com/en/hyattregency.html"], "published": "2015-10-06T22:19:00.000+03:00", "crawled": "2015-10-06T17:26:27.102+03:00", "highlightTitle": ""}