{"organizations": [], "uuid": "7f71798d399b26d8e3198d295b0f375539499795", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/29431-valuing-vegans-at-well-met", "country": "US", "title": "Valuing Vegans at Well Met", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Valuing Vegans at Well Met", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:45:00.000+03:00", "replies_count": 0, "uuid": "7f71798d399b26d8e3198d295b0f375539499795"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/29431-valuing-vegans-at-well-met", "ord_in_thread": 0, "title": "Valuing Vegans at Well Met", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Valuing Vegans at Well Met Valuing Vegans at Well Met Details Category: Venues & Events   15:45 Well Met Conferencing has demonstrated its pledge to providing a tailored service by creating a bespoke, entirely vegan menu for an event. The Gendered Bodies in Visible Spaces Conference was held at the Rose Bowl on 25 June 2015, with its organisers requesting that the conference office’s catering division, Well Fed, provided a full lunch and refreshment menu for 80 delegates, which was entirely vegan. \nThe concept was pioneered by executive chef David Parker, whose development process included utilising focus groups to ensure that the delegates would receive the best options on offer. His menu focused on healthy eating, using the finest, fresh sustainable ingredients and creating strong, passionate flavours, including a selection of sandwiches and wraps and an array of finger cakes, geared to giving delegates the maximum satisfaction during their conference. David Parker Executive Chef at Leeds Beckett University’ said: “The menu is such an important part of the delegate’s experience, it can really make or break their day, and we are proud to offer such a tailored experience for delegates. The food received glowing reviews, with vegan, vegetarian and lactose intolerant delegates celebrating the fact that they could eat everything on offer completely worry-free.” This event showcased Well Met’s ability to offer delegates a specialist service and, following unanimous positive feedback, another specialised vegan catered event, the SLIP ‘Inspiring and Empowering Learners in Practice’ 2015 Conference in collaboration with the University of Leeds and the Open University, was held on 3 September 2015. Kate Davis, Head of Business Development at Leeds Beckett University said: “It is vital that we are able to cater for all of our delegates’ dietary requirements and that we can offer a bespoke service to clients who have special requests. We strive to create the best, customer-focused experience for delegates and our catering team, led by David Parker, ensure this is met with the menus we provide for our conferences and events.” Related articles", "external_links": [], "published": "2015-10-19T17:45:00.000+03:00", "crawled": "2015-10-19T19:05:42.263+03:00", "highlightTitle": ""}