{"organizations": [], "uuid": "9d912dc6a1d4aeb10bb9c86b5179658b9717f8f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lagalog.com", "main_image": "", "site_section": "http://lagalog.com/feeds/posts/default", "section_title": "lagal[og] - Philippines Travel & Photography Blog", "url": "http://lagalog.com/2015/10/maligcong-bontoc-sipping-mountain.html", "country": "US", "title": "Maligcong, Bontoc: Enjoying a Glorious Weekend Sipping Mountain Coffee and Glorious Light Up on Two Mountains", "performance_score": 0, "site": "lagalog.com", "participants_count": 1, "title_full": "Maligcong, Bontoc: Enjoying a Glorious Weekend Sipping Mountain Coffee and Glorious Light Up on Two Mountains", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:27:00.000+03:00", "replies_count": 0, "uuid": "9d912dc6a1d4aeb10bb9c86b5179658b9717f8f1"}, "author": "noreply@blogger.com (Oggie Ramos)", "url": "http://lagalog.com/2015/10/maligcong-bontoc-sipping-mountain.html", "ord_in_thread": 0, "title": "Maligcong, Bontoc: Enjoying a Glorious Weekend Sipping Mountain Coffee and Glorious Light Up on Two Mountains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Maligcong, Bontoc: Enjoying a Glorious Weekend Sipping Mountain Coffee and Glorious Light Up on Two Mountains In the waning afternoon light, Victoria gathers her rice harvest By chance, the book I've been reading coming to our Backpack Photography tour in Maligcong, Bontoc , in Mountain Province, is \"Travellers' Tales Alaska\" and Ian Frazier 's \"Travels in Siberia\" . Well, the coldest it got during the weekend was 19 degrees and 16 degrees days after with some serious wind chill added. But the parallels with the prevailing cold weather wasn't lost on me. Planning a tour scheduled for the off-season is tricky. In our part of the world, it is often joked about that there are three seasons - summer, rainy, and rain-ier. With climate change and the wild weather noticeable during the past decade, you'll never really know what kind of weather you'd get so we planned, sent word out to interested parties, and crossed our fingers that perhaps, Yahweh God will grant us even a sliver of good weather. Months and weeks leading up to our trip, it's easy to get disheartened by the news. The recent strong typhoon in August washed away the bridge in Bauko and necessitated the construction of a temporary steel scaffolding of a bridge suitable only for light vehicles (it creaked as our bus passed). I also got news from Suzette , our friend who owns the Maligcong Homestay , that the typhoon damaged some parts of the terraces. But we plodded on and prepared, whether we can indeed proceed or not. We have been blessed with a weekend of good weather -- that piercing-blue-sky-kind. On our first afternoon, we hiked up to the school vantage point some 1.4 kilometers from the homestay and was awed by the sunset hues. There was a portion of the cemented trail that looked like it was washed away by the rains. Mt. Kupapey Layers of Beautiful Light SIPPING COFFEE AND DIVINE LIGHT ON MT. KUPAPEY. Now, this harkens back to my mountaineering days almost a decade ago, where the simplest pleasures are amplified a hundred-fold when you enjoy them on the mountains. Our guide, Tina , and her coterie of porters, some barely in their tweens and teens, brought thermos of mountain coffee to serve with Suzette's oat bars while enjoying the sunrise. My favorite adopted canine, Kunig , trekked with us, happy to get his share of oat bars from our sympathetic participants. I'm almost always at the tail of treks so I got to share stories with some participants as well as pick ripe guavas along the trail. I was also on the lookout for wild strawberries but it seemed the season for picking has passed. Ditto with wild mushrooms. Later in the afternoon, we got some consolation in tasting the first harvest in nearby Nardo's Farm . Shooting the shooters on Kupapey at sunrise MEETING GUARDIANS OF THE TERRACES IN THE MAIN VILLAGE. We headed to the main village on foot on our second afternoon, enamored with the idea of capturing some of the villagers harvesting rice plants in the waning afternoon light. Losing ourselves in the maze of houses, we bumped into what I call the guardians of the main village, sort of like village elders, who are meeting regarding pressing concerns like the threat of small-scale mining to their water supply and the terraces. ANOTHER SUNRISE, ANOTHER MOUNTAIN. Our main guide, Tina, chose a much gentler route up Mt. Fato unlike the Mt. Fato - Kupapey traverse we did almost four months earlier - longer but knee-friendly inclines. Jerome , Suzette's hubby, was also very kind to transport us via jeep to the jump-off off a winding dirt road southwest of Favarey. The good weather leading up to our weekend trip meant that like in Kupapey, there was no sea of clouds. But then again, the sunrise light was just beautiful, bathing the limestone formations and fern forest on the summit with incredible light. Shooting the shooters on Mt. Fato It was fun sipping mountain coffee while waiting for the sun to rise over the landscape. We also had a blast retracing our treks from the previous days from this higher vantage point as well as tracing the outline of the Sleeping Beauty range in Tinglayan to the east and Sagada town to the south. Hiking back, it was edifying to look up and see the bright blue sky framed by towering conifer branches and leaves, taking in the crisp air laced with the sweet, familiar odor of wet, dewy grass. I'm always slower on descents but I relished the opportunity to chat with our other guide, Terrence , who brought up the rear. I catch up on news and issues like the mining threat, the felled pine trees littering the trail, illegal logging, and the territorial disputes between Maligcong and Guina-ang. Admittedly, I wasn't able to shoot anything much and instead let our participants have the really nice vantage points to themselves (I can always go back some other day, anyway and this is their trip). But I always love going back to this place and it's an excuse to keep going back. More than the beauty and solitude Maligcong offers, I got to meet the warmest people in a really cold place - of which, like reading books on Alaska and Siberia at the time of this trip, the parallels and paradoxes are not lost on me.", "external_links": [], "published": "2015-10-20T17:27:00.000+03:00", "crawled": "2015-10-21T06:24:13.905+03:00", "highlightTitle": ""}