{"organizations": [], "uuid": "40c26b2a08c8bea9bec49e1fe01562b6dadbf308", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30273509/opportunity-analysis-of-eretailing-for-automotive-tyres-in-europe-reportlinker-review", "country": "US", "title": "Opportunity Analysis of eRetailing for Automotive Tyres in Europe - Reportlinker Review", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Opportunity Analysis of eRetailing for Automotive Tyres in Europe - Reportlinker Review - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "40c26b2a08c8bea9bec49e1fe01562b6dadbf308"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30273509/opportunity-analysis-of-eretailing-for-automotive-tyres-in-europe-reportlinker-review", "ord_in_thread": 0, "title": "Opportunity Analysis of eRetailing for Automotive Tyres in Europe - Reportlinker Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Reportlinker\nOpportunity Analysis of eRetailing for Automotive Tyres in Europe : Online Tyre Sales to Nearly Double in the Next 7 Years\nNEW YORK The research presents a comprehensive analysis of the tyre eRetailing aftermarket in Europe , with focus on the key countries contributing to the eCommerce revenues. The analysis includes market dynamics, revenue forecasts, competitive benchmarking, and company profiles. The research covers tyres sold through online retail and auctions by identified participants. The research also profiles participants and their eCommerce flowchart. The study tries to understand the potential challenges faced by market participants and proposes solutions accordingly. The study period covered is from 2011 to 2021, with 2014 as the base year. The forecast period is from 2015 to 2021.\nKey Findings\nTyre eRetailing will continue to gain at the expense of traditional retailing in Europe as the tyre aftermarket size remains more or less stable.\nTyre Aftermarket\nThe tyre replacement market in Europe is expected to grow from € billion in 2014 to € billion in 2021. The market had slowed down in the beginning of 2013, but the growth in trucks have led to the revival of the market in 2014.\nTyre eRetail\nThe tyre eRetail market in Europe is expected to grow from € billion to € billion from 2014 to 2020 at a CAGR of %. The tyre eRetail market is expected to be driven by customers preferring the convenience and lower prices of eRetail.\nAftermarket Market share\nThe tyre aftermarket in Europe is dominated by the European brands such as Continental and Michelin. Continental is expected to increase its market share in Europe . Asian brands are likely to increase their market share in the non-premium market in future due to lower prices.\nTyre eRetail Market Share\nTyre eRetailers (primarily selling tyres) are estimated to have more than % market share in the European tyre eRetailing market. The market displays more or less a similar landscape in Europe , except the UK, where auto parts retailers (selling many different automotive replacement parts) are leaders in the tyre eRetail market.\nRead the full report: http://www.reportlinker.com/p03191379-summary/view-report.html\nAbout Reportlinker\nReportLinker is an award-winning market research solution. Reportlinker reviews, finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.\nhttp://www.reportlinker.com", "external_links": ["http://www.reportlinker.com/", "http://www.reportlinker.com/p03191379-summary/view-report.html"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T05:49:48.131+03:00", "highlightTitle": ""}