{"organizations": [], "uuid": "64a8aae5882893329b7ef3896ebbbcff970b89e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcnews.com", "main_image": "http://media1.s-nbcnews.com/j/newscms/2015_41/1254736/ss-151008-twip-03_b9531df5f1188bbd5643a6c20d23f25e.nbcnews-fp-1200-800.jpg", "site_section": "http://feeds.nbcnews.com/feeds/travel", "section_title": "NBC News Travel", "url": "http://www.nbcnews.com/news/week-in-pictures/week-pictures-oct-1-8-n441286", "country": "US", "title": "The Week in Pictures: Oct. 1 - 8", "performance_score": 1, "site": "nbcnews.com", "participants_count": 1, "title_full": "The Week in Pictures: Oct. 1 - 8 - NBC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:41:00.000+03:00", "replies_count": 0, "uuid": "64a8aae5882893329b7ef3896ebbbcff970b89e1"}, "author": "nbcnews.com", "url": "http://www.nbcnews.com/news/week-in-pictures/week-pictures-oct-1-8-n441286", "ord_in_thread": 0, "title": "The Week in Pictures: Oct. 1 - 8", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 . Boats damaged by Hurricane Joaquin are strewn across the bush in Long Island, Bahamas, on Oct. 5, 2015. Joaquin unleashed heavy flooding as it roared through sparsely populated islands in the eastern Bahamas last week, as the Coast Guard searched for crew members of the U.S. container ship El Faro which they concluded sank near the Bahamas during the storm. Tim Aylen / AP\n2 . Chinese tourists walk across a glass-bottomed suspension bridge in the Shinuizhai mountains in Pingjang county, in China's Hunan province on Oct. 6. The bridge, originally a wooden walkway spanning some 1,000 feet across the 600-foot deep valley, reopened two weeks ago following renovations as a tourist attraction. Johannes Eisele / AFP - Getty Images\n3 . Railroad passenger cars from a derailed Amtrak passenger train are surrounded by foliage on Oct. 5 in Northfield, Vt. The train, the Vermonter, was headed from Vermont to Washington, D.C., when it apparently struck rocks that were on the tracks. No life-threatening injuries were reported. Stefan Hard / Barre-Montpelier Times Argus via AP\nadvertisement advertisement 4 . A train conductor sits next to an Amtrak train after it derailed on Oct. 5, near Roxbury, Vt., about 20 miles southwest of Montpelier, Vt. Cathy Bell / Courtesy of Brian Bell via AP\n5 . A man makes his way through floodwaters in the parking lot of The Citadel Beach Club on Isle of Palms, S.C., on Oct. 5. Charleston and surrounding areas are still struggling with floodwaters due to a slow moving storm system.\n• Gallery: South Carolina Battered by Historic Rainfall Mic Smith / AP\n6 . Pope Francis kisses a baby as he arrives for his weekly general audience at St Peter's square on Oct. 7 at the Vatican. Filippo Monteforte / AFP - Getty Images\nadvertisement advertisement 7 . Migrants aboard dinghies reach the Greek island of Lesbos after crossing the Aegean sea from Turkey on Oct. 4. For the thousands of refugees and migrants landing on its beaches every day, Greece's Lesbos island is a step to safety and a brighter future in Europe. More than half a million people have reached Europe via the Mediterranean this year -- including over 310,000 landing in Greece, figures from the UN refugee agency show. Aris Messinis / AFP - Getty Images\n8 . A migrant holds a baby as they arrive on the Greek island of Lesbos after crossing the Aegean sea from Turkey on Oct. 5. Europe is grappling with its biggest migration challenge since World War II, with the main surge coming from civil war-torn Syria. Aris Messinis / AFP - Getty Images\n9 . Infiltrated members of the Israeli security forces detain a Palestinian stone thrower and aim their weapons at protesters during clashes in Beit El, on the outskirts of the West Bank city of Ramallah, on Oct. 7. New violence rocked Israel and the Israeli-occupied West Bank, including a stabbing in annexed east Jerusalem, even as Israel and Palestinian president Mahmud Abbas took steps to ease tensions. Abbas Momani / AFP - Getty Images\nadvertisement advertisement 10 . Pierre Plissonnier, Air France's director in Orly, nearly shirtless, tries to cross a fence, helped by security and police officers, after several hundred employees invaded the offices of Air France, interrupting the meeting of the Central Committee in Roissy-en-France on Oct. 5. Air France-KLM unveiled a revamped restructuring plan on October 5 that could lead to 2,900 job losses after pilots for the struggling airline refused to accept a proposal to work longer hours. Kenzo Tribouillard / AFP - Getty Images\n11 . Smoke and ash billow from the Cotopaxi volcano in Pedregal, Ecuador, late on Oct. 7. Jose Jacome / EPA\n12 . Malaysian youths cool off in a river as schools remain closed due to hazy conditions in Hulu Langat on Oct. 6. Malaysia, Singapore and large expanses of Indonesia have suffered for weeks from acrid smoke billowing from fires on Indonesian plantations and peatlands that are being illegally cleared by burning. The regional environmental crisis has caused flights and major events to be cancelled, and forced tens of thousands of people in the region to seek medical treatment for respiratory problems. Mohd Rasfan / AFP - Getty Images\nadvertisement advertisement 13 . People cross U Bein bridge over Tuangthaman Lake in Mandalay, Myanmar on Oct. 6.\n• The Week in Pictures: Sept. 24 - Oct. 1 Jorge Silva / Reuters", "external_links": ["http://media4.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-05.nbcnews-ux-1024-900.jpg", "http://media3.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-11.nbcnews-ux-1024-900.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-01.nbcnews-ux-1024-900.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-03.nbcnews-ux-1024-900.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-10.nbcnews-ux-1024-900.jpg", "http://media3.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-13.nbcnews-ux-1024-900.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-07.nbcnews-ux-1024-900.jpg", "http://media3.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-02.nbcnews-ux-1024-900.jpg", "http://media3.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-04.nbcnews-ux-1024-900.jpg", "http://media2.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-14.nbcnews-ux-1024-900.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-12.nbcnews-ux-1024-900.jpg", "http://media1.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-08.nbcnews-ux-1024-900.jpg", "http://media4.s-nbcnews.com/j/msnbc/components/slideshows/_production/twip-151008/ss-151008-twip-09.nbcnews-ux-1024-900.jpg"], "published": "2015-10-09T00:41:00.000+03:00", "crawled": "2015-10-09T00:26:13.784+03:00", "highlightTitle": ""}