{"organizations": [], "uuid": "5a27d1301675404b31c08bef82682c3bfc0ee64c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thesundaily.my", "main_image": "http://www.thesundaily.my/sites/default/files/sun_logo_ogfb.jpg", "site_section": "http://www.thesundaily.my/rss/lifestyle/travel", "section_title": "theSundaily.my Travel", "url": "http://www.thesundaily.my/news/1591974", "country": "MY", "title": "Global sites of Star Wars pilgrimage around the world to feel 'the power of the Force'", "performance_score": 0, "site": "thesundaily.my", "participants_count": 1, "title_full": "Global sites of Star Wars pilgrimage around the world to feel 'the power of the Force'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:04:00.000+03:00", "replies_count": 0, "uuid": "5a27d1301675404b31c08bef82682c3bfc0ee64c"}, "author": "theSundaily", "url": "http://www.thesundaily.my/news/1591974", "ord_in_thread": 0, "title": "Global sites of Star Wars pilgrimage around the world to feel 'the power of the Force'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Global sites of Star Wars pilgrimage around the world to feel 'the power of the Force' Posted on 24 October 2015 - 04:04am Print \nAS DECEMBER approaches, and with it, the premiere of the seventh chapter of the Star Wars saga, the GoEuro travel site has partnered with GetYourGuide.com to give you a list of the must-see tourist sites for fans of the epic space franchise. \nThe aim of the list was to identify 31 sites around the world where one can truly \"feel the Force\". To compile the vast catalogue of sites, the study took into account accessibility, accommodation, and infrastructure and in particular, sites where the power of the Force is decidedly present, in other words, spots where visitors can truly get a sense of the spirit of George Lucas's films. \nLocated in various places from California to Malaysia and Dubai, the Legoland parks top the list with a score of 94. The park's Star Wars attractions are considered some of the very best. Different Legoland sites have recreated scenes from the saga. \nThe listing also contains filming locations including the Sidi Driss hotel in Matmata in Tunisia. The Berber establishment was portrayed as the Lars homestead on the planet of Tatooine and visitors can still stay at the hotel. Diners are even organized in the same spot that George Lucas's cameras were posed. This legendary site stands in second place. \nAnother film destination (fourth on the list) recommended to Star Wars enthusiasts is located nearby, in the plains of the salt lake of Chott el Djerid, where artificial craters were traced when Luke Skywalker appeared for the first time in episode IV. For hardcore fans, a ticket to Guatemala is necessary to visit the Mayan Tikal ruins that served as the backdrop for the rebel base on planet Yavin 4 in \" Star Wars Episode IV: A New Hope \". \nBelow is the full list of the essential pilgrimage sites for Star Wars fans (including film locations, other destinations and tourist attractions). – AFP Relaxnews \n1 - Legoland, six parks worldwide 2 - The Lars farm and homestead and desert scenes on Taooine in Matmata, Tunisia 3 - Rancho Obi-Wan in Petaluma, California, United States 4 - The exterior environment of the Lars homestead in Chott el Djerid, Tunisia 5 - Star Wars exhibit at Madame Tussaud's in London, United Kingdom and Berlin, Germany 6 - Star Tours - The Adventures Continue, Disneyland Park in Anaheim, California, and Orlando, Florida, USA and Tokyo, Japan 7 - Skellig Michael in Skellig Mickael (Ireland) 8 - Yavin 4 in Tikal (Guatemala) 9 - The slave quarters in Mos Espa on Tatooine in Ksar Hadada, Tunisia 10 - Theed city, Naboo in Spain Square, Seville, Spain 11 - The slave quarters in Mos Espa on Tatooine in Ksar Medenine, Tunisia 12 - Astroport of Mos Eisley, home of Obi Wan on Tatooine in Djerba, Tunisia 13 - The slave quarters in Mos Espa on Tatooine in Ksar Ouled Soltane (Tunisia) 14 - Naboo, Lake Como (Italy) 15 - Greenham Common in Greenham Common, United Kingdom 16 - The Tatooine Desert, road to Jabba's palace in Death Valley, United States 17 - Royal Palace of Naboo in Caserta, Italy 18 - Tatooine Canyon, in the Shubiel Gorge in Sidi Bouhlel, Tunisia 19 - The Force Awakens, Hang En Cave, Vietnam 20 - Alderaan in Grindelwald, Switzerland 21 - The Great Pit of Carkoon in the Yuma Desert, United States 22 - Endor in Redwood National Park, United States 23 - The Sacred Forest of Naboo in Whippendell Woods, United Kingdom 24 - The Force Awakens in Puzzlewood, United Kingdom 25 - The Force Awakens, in the Abu Dhabi Desert, United Arab Emirates 26 - Mustafar on Mount Etna, Sicily, Italy 27 - The Tatooine Desert in La Grande Dune, Tunisia 28 - Kashyyyk in Guilin, China, 29 - Hoth at the Hardangerjokulen Glacier in Finse, Norway 30 - The Force Awakens at the Eyjafjallajökull Glacier, Iceland 31 - Kashyyyk in Phang Nga Bay, Thailand Opinion", "external_links": [], "published": "2015-10-23T23:04:00.000+03:00", "crawled": "2015-10-25T22:00:45.727+02:00", "highlightTitle": ""}