{"organizations": [], "uuid": "faefd90045c85f42892d91823fc70293e2dacc62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/03/starwood-logo.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/starwood-hotels-resorts-to-launch-dual-branded-aloft-and-element-hotel-development-in-redmond-washington/", "country": "US", "title": "Starwood Hotels & Resorts to Launch Dual-Branded Aloft and Element Hotel Development in Redmond, WashingtonTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Starwood Hotels & Resorts to Launch Dual-Branded Aloft and Element Hotel Development in Redmond, WashingtonTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "faefd90045c85f42892d91823fc70293e2dacc62"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/starwood-hotels-resorts-to-launch-dual-branded-aloft-and-element-hotel-development-in-redmond-washington/", "ord_in_thread": 0, "title": "Starwood Hotels & Resorts to Launch Dual-Branded Aloft and Element Hotel Development in Redmond, WashingtonTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Starwood Hotels & Resorts to Launch Dual-Branded Aloft and Element Hotel Development in Redmond, Washington\nStarwood Hotels & Resorts Worldwide, Inc. today announced plans to break ground on a dual-branded Aloft and Element hotel development in Redmond, Washington, set to open in July 2017. Owned and managed by CSM Corporation, the 150-room AloftRedmond and 131 -room Element Redmond will be located just outside the campus for Microsoft Corporation’s world headquarters.\n“This hotel development brings together the best of both brands to offer an incomparable guest experience,” said Steve Schlundt, Chief Operating Officer of CSM’s lodging and residential divisions. “The proximity to Microsoft’s campus presents an ideal opportunity. By developing both extended and non-extended-stay hotels, we are able to better meet customers’ needs. We look forward to working side-by-side with Starwood Hotels & Resorts to bring this innovative concept to the Redmond area.”\nThe Aloft and Element hotel development will boast a prime location within Esterra Park, a campus-style, master-planned development with 1.2 million square feet of commercial office space, 1,400 residential units and a Link light-rail station slated to open in 2023. Easily accessible from the I-5 Freeway, the hotels are close to both Redmond’s shopping district and downtown Bellevue. Aloft Redmond and Element Redmond will face a common courtyard and will each feature separate branded lobbies. Shared facilities will include 6,500 square feet of state-of-the-art meeting space, an outdoor pool, a fitness facility and parking.\nAloft Redmond will offer leading-edge design, loft-like rooms, accessible technologies and amenities including Re:fuel by Aloft®– a one-stop grab & go food and beverage area, and W XYZ® bar, which will feature local emerging artists as well as some of the hottest bands with Live at Aloft Hotels programming. Aloft remains one of the fastest growing hotel brands, with the company’s second largest pipeline.\nElement Redmond will offer a fresh perspective on extended stay lodging, with light-filled studios featuring a fluid design, fully equipped kitchens and spa-inspired bathrooms. Guests can stay on the move with the Element brand’s complimentary bikes to borrow and enjoy the brand’s signature Rise breakfast and Relax evening reception.\nAloft and Element Redmond will join several other similar developments worldwide, including Aloft and Element Lexington, Aloft and Element Boston Seaport (2016), Aloft and Element Dallas Love Field (2016), Aloft and Element Columbus (2017) and Aloft and Element London Tobacco Dock (2017).\n“We are experiencing growing demand for dual-branded Aloft and Element hotel developments in major metropolitan markets throughout North America and beyond,” said Allison Reid, Senior Vice President, North America Development for Starwood Hotels & Resorts. “Both Element, which is on track to more than double its number of rooms by 2017, and Aloft, which just crossed its 100 th hotel milestone worldwide, offer unique, sought after experiences.”\nSource:- Starwood Hotels & Resorts", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T18:53:50.360+03:00", "highlightTitle": ""}