{"organizations": [], "uuid": "b472b5fd9b521e4fee7da5013abf55fdb59e63dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30265478/galaxy-entertainment-group-reports-selected-unaudited-q3-2015-financial-data", "country": "US", "title": "Galaxy Entertainment Group Reports Selected Unaudited Q3 2015 Financial Data", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Galaxy Entertainment Group Reports Selected Unaudited Q3 2015 Financial Data - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "b472b5fd9b521e4fee7da5013abf55fdb59e63dd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30265478/galaxy-entertainment-group-reports-selected-unaudited-q3-2015-financial-data", "ord_in_thread": 0, "title": "Galaxy Entertainment Group Reports Selected Unaudited Q3 2015 Financial Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Galaxy Entertainment Group Limited\nGroup Revenue of $12.3 Billion, Up 5% Quarter-on-Quarter, Down 29% Year-on-Year\nGroup Adjusted EBITDA of $2.1 Billion, Up 13% Quarter-on-Quarter, Down 36% Year-on-Year\nDevelopment Cost Savings of $400-$500 Million on Galaxy Macau™ Phase 2\nDriving an $800 Million Cost Control Program\nWell Capitalized with Cash of $6 Billion and Virtually Debt Free\nSpecial Dividend of $0.14 per Share To be Paid On or About 30 October 2015\nHONG KONG , Oct. 15, 2015 /PRNewswire/ -- Galaxy Entertainment Group Limited (\"GEG\" or the \"Group\") (HKEx stock code: 27) today reported unaudited results for the three month periods ended 30 September 2015 .\nTHIRD QUARTER HIGHLIGHTS\nGEG: Delivering solid results in a potentially stabilizing market\nRevenue of $12.3 billion , down 29% year-on-year, up 5% quarter-on-quarter Adjusted EBITDA of $2.1 billion , down 36% year-on-year, up 13% quarter-on-quarter Played unlucky in the third quarter which reduced Adjusted EBITDA by approximately $131 million Driving an $800 million cost control program Galaxy Macau™: Continue to ramp up Phase 2 and open remaining facilities\nRevenue of $8.7 billion , down 22% year-on-year, up 9% quarter-on-quarter Adjusted EBITDA of $1.7 billion , down 30% year-on-yea r, up 19% quarter-on-quarter Played unlucky in the third quarter which reduced Adjusted EBITDA by approximately $117 million Hotel occupancy across the five hotels was 99% Non-gaming revenue of $742 million , up 92% year-on-year and 60% quarter-on-quarter StarWorld Macau: Solid quarter focusing on operating efficiencies\nRevenue of $2.9 billion , down 48% year-on-year, down 7% quarter-on-quarter Adjusted EBITDA of $514 million , down 43% year-on-year, up 1% quarter-on-quarter Played unlucky in the third quarter which reduced Adjusted EBITDA by approximately $11 million Hotel occupancy was 99% Broadway Macau™: Continue to ramp up and open remaining facilities\nRevenue of $189 million for its first full quarter of operation Virtually broke even with Adjusted EBITDA of $(1) million Played unlucky in the third quarter which reduced Adjusted EBITDA by approximately $3 million Hotel occupancy was 99% Development Update: Project planning continues and completed first international investment\nGalaxy Macau™ Phase 2 -- Development cost savings of $400-$500 million Cotai Phases 3 & 4 -- Site investigation works expected to commence in early 2016 Hengqin -- Continuing with concept plans for the 2.7 square kilometer land parcel International -- Continuously exploring opportunities in overseas markets and completed the strategic investment in Soci e t e Anonyme des Bains de Mer et du Cercle des E trangers a Monaco (\"SBM\") Balance Sheet and Special Dividend: Well capitalized and virtually debt free\nCash on hand of $6.0 billion as at 30 September 2015 with net cash of $4.8 billion Debt of $1.2 billion as at 30 September 2015 Another special dividend of $0.14 per share as previously announced to be paid on or about 30 October 2015 Dr. Lui Che Woo , Chairman of GEG said:\n\"Despite continuing headwinds in the Macau market, GEG achieved a very solid 5% increase in revenue and even more satisfactory 13% increase in Adjusted EBITDA in Q3 2015 when compared with the second quarter of 2015. During the quarter, we continued to build on the successful May 2015 launch of Galaxy Macau™ Phase 2 and Broadway Macau™ by opening most of the retail and hospitality facilities. The two new interconnected offerings in Cotai are driving significant visitation across the properties, making Galaxy Macau™ an even more compelling integrated resort.\n\" Feedback from visitors and guests on Galaxy Macau™ Phase 2 and Broadway Macau™ has been positive and we are very proud to have delivered such a high quality integrated resort and enhanced our customer experience. The properties are still ramping-up, with additional new facilities opening through year-end. We are now focused on moving all of our operations up the efficiency curve as rapidly as possible, without compromising customer service. To that end we are driving a cost control program with the goal of delivering $800 million in savings for the Group.\n\" GEG's balance sheet remains strong with virtually no debt and generates solid free cash flow. Our resorts have proved to be successful and are well positioned to be even more competitive as the marketplace grows and develops. Given the encouraging results during Golden Week in early October and the positive supportive comments made by the Government we are cautiously optimistic that we are starting to see the market stabilize. Spending behavior in Macau remains cautious, but we are very confident in the longer term outlook and prospects for Macau and for GEG specifically and we are well positioned for the longer term success.\n\" Finally, I would like to take this opportunity to thank all of our 2 2 ,000 staff for their commitment to delivering exceptional customer experiences through our renowned 'World-Class, Asian Heart' service philosophy each and every day.\"\nMarket Overview\nThe challenging market conditions that we have experienced over the past year have continued into Q3 this year. A number of factors are weighing on sentiment and these include: the widely publicized anti-corruption program, the slowing Chinese economy, the current smoking restrictions, concerns about liquidity and the fall of the A-Shares index to name a few. Total gaming revenue decreased by 36% year-on-year to $171 billion for the first nine months of 2015. Third quarter revenue of $53 billion declined a modest 4% sequentially and 34% year-on-year.\nGroup Financial Results\nThe Group posted quarterly revenue of $12.3 billion and Adjusted EBITDA of $2.1 billion . As of 30 September 2015 , the latest twelve months Adjusted EBITDA decreased 37% year-on-year to $8.9 billion . During the third quarter, GEG experienced bad luck in gaming operations which reduced its Adjusted EBITDA by approximately $131 million , otherwise our Adjusted EBITDA would have been 6% higher on a normalized basis.\nThe Group's total gaming revenue on a management basis [1] in the third quarter of 2015 grew 3% quarter-on-quarter to $11.5 billion but decreased 33% year-on-year.\nGEG's balance sheet at 30 September 2015 remains well capitalized and liquid, with cash on hand of $6.0 billion and net cash of $4.8 billion . GEG's debt declined from $4.8 billion at 30 June 2015 to $1.2 billion at 30 September 2015 due primarily to repaying debt associated with the treasury management exercise.\nDriving Mass Business in an Evolving Market\nGEG continues to actively manage its business including its revenue and EBITDA mix consistent with the evolving Macau market trends towards mass. We have achieved this by continuing to grow our mass business including slots by significantly expanding our world class non-gaming amenities such as hotels, retail, entertainment and MICE. Our efforts have resulted in increasing our mass, slots and non-gaming revenue mix from approximately one third of total revenue in Q3 2014 to approximately one half in Q3 2015 on a management basis for our Macau operations with upside as we continue to ramp up our recent resort openings and add new amenities. As a result, mass, slots and non-gaming now accounts for a vast majority of EBITDA while our VIP business represents a much smaller portion of EBITDA despite being the market leader. We will continue to allocate our resources to their highest and best use on a profit contribution basis.\nFor the Group's Adjusted EBITDA (HK$'m), please visit: http://photos.prnasia.com/prnh/20151015/8521506883-a\nGalaxy Macau™\nGalaxy Macau™'s revenue in the third quarter grew 9% quarter-on-quarter to $8.7 billion but decreased by 22% year-on-year. Adjusted EBITDA increased 19% quarter-on-quarter to $1.7 billion but decreased 30% year-on-year.\nAdjusted EBITDA margin under HKFRS improved from 18% in Q2 2015 to 19% in Q3 2015 versus Q3 2014's 22%. Adjusted EBITDA margin under US GAAP also improved from 24% in Q2 2015 to 25% in Q3 2015 versus 29% in Q3 2014.\nGalaxy Macau™ experienced bad luck in its gaming operations which reduced its Adjusted EBITDA by approximately $117 million in the third quarter.\nVIP Gaming Performance\nTotal VIP rolling chip volume in the third quarter was $125 billion . This translated into revenue of $4.5 billion , 38% down year-on-year and a more modest 4% versus Q2 2015.\nVIP Gaming\nHK$'m\nQ3 2014\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nTurnover\n224,435\n137,222\n124,645\n-9%\n-44%\nNet Win\n7,239\n4,659\n4,481\n-4%\n-38%\nWin %\n3.2%\n3.4%\n3.6%\nMass Gaming Performance\nThird quarter mass revenue was $3.0 billion , grew 21% sequentially but was down 2% year-on-year.\nMass Gaming\nHK$'m\nQ3 2014\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nTable Drop\n6,842\n6,542\n7,014\n7%\n3%\nNet Win\n3,070\n2,496\n3,013\n21%\n-2%\nHold %\n44.9%\n38.2%\n43.0%\nElectronic Gaming Performance\nElectronic gaming revenue was $442 million , up 17% quarter-on-quarter and 5% year-on-year.\nElectronic Gaming\nHK$'m\nQ3 2014\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nSlots Handle\n9,325\n9,579\n11,435\n19%\n23%\nNet Win\n419\n378\n442\n17%\n5%\nHold %\n4.5%\n3.9%\n3.9%\nNon-Gaming Performance\nNon-gaming revenue increased by 92% year-on-year to $742 million in the third quarter.\nOccupancy across the five hotels was 99%.\nNet Rental Revenue for the Promenade was $236 million for the quarter, an increase of 372% compared to $50 million in the corresponding period of 2014.\nNon-Gaming Revenue\nHK$'m\nQ3 2014\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nNet Rental Revenue\n50\n100\n236\n136%\n372%\nHotel Revenue / F&B / Others\n336\n364\n506\n39%\n51%\nTotal\n386\n464\n742\n60%\n92%\nStarWorld Macau\nStarWorld Macau reported a 7% sequential and 48% year-on-year reduction in revenue to $2.9 billion in the third quarter 2015. Adjusted EBITDA was $514 million , 43% lower year-on-year and up 1% sequentially.\nAdjusted EBITDA margin under HKFRS improved from 16% in Q3 2014 and Q2 2015 to 17% in Q3 2015. Adjusted EBITDA margin under US GAAP also improved from 24% in Q3 2014 and 23% in Q2 2015 to 25% in Q3 2015.\nStarWorld Macau experienced bad luck in its gaming operations which reduced its Adjusted EBITDA by approximately $11 million in the third quarter.\nVIP Gaming Performance\nStarWorld Macau reported VIP rolling chip volume of $68 billion in the third quarter, a decrease of 5% quarter-on-quarter and 55% year-on-year. This translated to a 15% quarter-on-quarter and 59% year-on-year reduction in revenue to $1.8 billion .\nVIP Gaming\nHK$'m\nQ3 2014\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nTurnover\n150,452\n71,448\n67,543\n-5%\n-55%\nNet Win\n4,412\n2,112\n1,795\n-15%\n-59%\nWin %\n2.9%\n3.0%\n2.7%\nMass Gaming Performance\nStarWorld Macau third quarter mass gaming revenue was $1.1 billion , up 12% quarter-on-quarter but 5% lower year-on-year.\nMass Gaming\nHK$'m\nQ3 2014\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nTable Drop\n2,661\n2,465\n2,642\n7%\n-1%\nNet Win\n1,116\n951\n1,063\n12%\n-5%\nHold %\n41.4%\n38.6%\n40.3%\nElectronic Gaming Performance\nStarWorld Macau's electronic gaming generated revenue of $27 million , 18% lower quarter-on-quarter and down 40% year-on-year.\nElectronic Gaming\nHK$'m\nQ3 2014\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nSlots Handle\n682\n480\n558\n16%\n-18%\nNet Win\n45\n33\n27\n-18%\n-40%\nHold %\n6.6%\n7.0%\n4.9%\nNon-Gaming Performance\nNon-gaming revenue in the third quarter of 2015 was $60 million , down 9% quarter-on-quarter and 33% year-on-year. Hotel room occupancy was 99% during the period.\nBroadway Macau™\nBroadway Macau™ does not have a VIP gaming component. The third quarter 2015 is the first full quarter since we opened on 27 May 2015 . Revenue was $189 million while Adjusted EBITDA was virtually break even with $(1) million for the period.\nBroadway Macau™ experienced bad luck in its gaming operations which reduced Adjusted EBITDA by approximately $3 million in the third quarter.\nMass Gaming Performance\nBroadway Macau™'s mass gaming revenue was $124 million .\nMass Gaming\nHK$'m\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nTable Drop\n177\n495\n180%\nn/a\nNet Win\n37\n124\n235%\nn/a\nHold %\n20.7%\n25.1%\nElectronic Gaming Performance\nBroadway Macau™'s electronic gaming revenue was $8 million .\nElectronic Gaming\nHK$'m\nQ2 2015\nQ3 2015\nQoQ%\nYoY%\nSlots Handle\n58\n122\n110%\nn/a\nNet Win\n4\n8\n100%\nn/a\nHold %\n7.1%\n6.8%\nNon-Gaming Performance\nNon-gaming revenue was $57 million and hotel room occupancy was 99%.\nCity Clubs and Construction Materials Division\nCity Clubs' Adjusted EBITDA for the third quarter 2015 was $26 million versus $25 million in Q2 2015 and prior year's $41 million .\nThe Construction Materials Division reported Adjusted EBITDA of $94 million for the third quarter 2015 versus $96 million in Q2 2015 and $114 million in the same period in 2014.\nDevelopment Update: Cost Savings, Cotai, Hengqin and International\nGalaxy Macau ™ Phase 2 Cost Savings\nWe are presently finalizing our accounts for the development of Galaxy Macau™ Phase 2 and we expect to confirm development cost savings of $400-$500 million .\nPhases 3 & 4 in Cotai\nGEG has a strong development pipeline in Macau . It plans to expand its Cotai footprint by a further one million square meters in the coming years with the addition of Phases 3 & 4. We continue to develop our master plan and site investigation works are expected to commence in early 2016.\nHengqin\nGEG continues to advance its conceptual plans to develop a world class destination resort on a 2.7 square kilometer land parcel on Hengqin. The low rise, low density resort will complement the Group's high energy properties located in Macau .\nInternational\nGEG continues to actively explore development opportunities in overseas markets. GEG recently completed its first international strategic investment in Societe Anonyme des Bains de Mer et du Cercle des E trangers a Monaco (\"SBM\").\nSelected Major Awards (January to October 2015 )\nAward\nPresenter\nGEG\nCasino Operator of the Year Australia / Asia\nInternational Gaming Awards\nBest Managed Company - Gaming in Asia\nEuromoney Magazine\nGaming and Lodging - Most Honoured Company\nInstitutional Investor Magazine -\nAll Asia Executive Team Survey\nBest Managed Company in HK (6 th Place)\nFinanceAsia Magazine\n4th Outstanding Corporate Social Responsibility Award\nThe Mirror\nBest Investor Relations Company - Large Cap\nHong Kong Investor Relations Association\nBest Investor Relations Presentation Collaterals - Large Cap\nGalaxy Macau™\nCasino VIP Room of the Year\nInternational Gaming Awards\nWorld's Best Hotel 2014-2015 - Resort Hotel Macau\nInternational Hotel Awards\n2014 Asia's Top Entertainment Complex\nNOW Travel Asia Awards\nHurun Report Best of the Best Awards -\nLuxury Hotel Wedding in Macau Star Performer\nHurun Report\nTripAdvisor's Traveler Choice 2015 Winner -\nTop Hotel for Romance & Top Luxury Hotel (China)\n(Banyan Tree Macau)\nTripAdvisor\n2015 Forbes Travel Guide -\nFive-Star Hotel (Banyan Tree Macau)\nForbes Travel Guide\n2015 Forbes Travel Guide -\nFive-Star Spa (Banyan Tree Spa Macau)\nLEED gold certification - Galaxy Macau™ Phase 2\nUnited States Green Building Council\nHotel & Event Facilities of the Year\nAsia Pacific MICE Awards 2015\nStarWorld Macau\nRanked as \"Top Class Comfort\" 2015\nMichelin Guide Hong Kong Macau\nTop 10 Glamorous Hotels of China\nChina Hotel Starlight Awards\nBest Service Hotel of Asia\nGolden Horse Award of China Hotel\nSpecial Dividend\nOn 19 August 2015 , we announced another special dividend of $0.14 per share to be paid on or about 30 October 2015 .\nOutlook\nThe Group continues to believe in the long term potential of China and that rising incomes plus the continuing urbanization will drive long term demand for tourism and travel. GEG firmly believes that Macau will benefit from this growth in travel and tourism and remains well positioned to capture its share of this growth.\nThe opening of Galaxy Macau™ Phase 2 and Broadway Macau™ have attracted significantly more visitors, once again demonstrating the strength of demand in Macau for high quality products and offerings, in general, and GEG's ability to identify and capture this demand, specifically. Overall, the Group continues to refine its products and enhance its competitiveness as other new resorts open in due course and increase the overall attractiveness of Macau as a world class tourism destination. GEG is uniquely positioned with its high quality portfolio of resort properties and extensive development pipeline with Cotai Phases 3 and 4 and Hengqin.\nGEG's balance sheet is exceptionally strong with modest debt and net cash of $4.8 billion . The Group's focus is firmly on continuing to ramp up Galaxy Macau™ Phase 2 and Broadway Macau™, ensuring that all our properties achieve their full potential. We are actively managing costs with savings of up to $800 million already identified. GEG remains committed to maintaining its high standards of customer service. In the shorter term we are encouraged by the performance during Golden Week and by the recent positive comments made by the Government indicating greater support for the industry and we remain very confident in the longer term outlook.\nAbout Galaxy Entertainment Group (HKEx stock code: 27)\nGalaxy Entertainment Group Limited (\"GEG\" or the \"Group\") is one of the world's leading hospitality and gaming companies. It primarily develops and operates hotels, gaming and integrated resort facilities in Macau . The Group is listed on the Hong Kong Stock Exchange and is a member of the Hang Seng Index.\nGEG is one of six gaming concessionaires in Macau with a track record of delivering innovative, spectacular and industry leading properties, products and services, underpinned by a \"World Class, Asian Heart\" service philosophy, that has enabled it to consistently outperform the wider market.\nGEG operates three flagship venues in Macau : on Cotai, Galaxy Macau™, one of the world's largest integrated destination resorts, and the adjoining Broadway Macau™, a new hotel, entertainment and retail landmark destination; and on the Peninsula, StarWorld Macau, an award winning high end boutique property.\nThe Group has the largest development pipeline of any concessionaire in Macau . When Phases 3 & 4 of its Cotai landbank are completed, GEG's footprint on Cotai will double to more than 2 million square meters. GEG has also entered into a framework agreement to develop a low rise, low density world class destination resort on a 2.7 square kilometer land parcel on Hengqin adjacent to Macau . This resort will complement GEG's offer in Macau , differentiate it from its peers and support Macau in its vision to become a World Centre of Tourism and Leisure. Additionally, we continue to explore international development opportunities.\nGEG is committed to delivering unique 'World Class, Asian Heart' holiday experiences to its guests and building a sustainable future for Macau .\nGEG also operates a Construction Materials Division.\nFor more information about the Group, please visit www.galaxyentertainment.com\n[1]\nThe primary difference between statutory revenue and management basis revenue is the treatment of City Clubs revenue where fee income is reported on a statutory basis and gaming revenue is reported on a management basis.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/galaxy-entertainment-group-reports-selected-unaudited-q3-2015-financial-data-300160261.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.galaxyentertainment.com/", "http://www.prnewswire.com/news-releases/galaxy-entertainment-group-reports-selected-unaudited-q3-2015-financial-data-300160261.html", "http://www.xmlnews.org/ns/", "http://photos.prnasia.com/prnh/20151015/8521506883-a", "http://rt.prnewswire.com/rt.gif?NewsItemId=HK29057&Transmission_Id=201510150305PR_NEWS_USPR_____HK29057&DateId=20151015"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T11:38:21.820+03:00", "highlightTitle": ""}