{"organizations": [], "uuid": "c53c7cbf411f147d60218b7723d086bbee012847", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30241240/strategic-analysis-of-powertrain-light-weighting-measures-reportlinker-review", "country": "US", "title": "Strategic Analysis of Powertrain Light-weighting Measures - Reportlinker Review", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Strategic Analysis of Powertrain Light-weighting Measures - Reportlinker Review - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "c53c7cbf411f147d60218b7723d086bbee012847"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30241240/strategic-analysis-of-powertrain-light-weighting-measures-reportlinker-review", "ord_in_thread": 0, "title": "Strategic Analysis of Powertrain Light-weighting Measures - Reportlinker Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Reportlinker\nStrategic Analysis of Powertrain Light-weighting Measures : Aluminum to Continue to Dominate, Plastics to Evolve, and Newer Joining Techniques to be the Norm\nNEW YORK , Oct. 12, The study throws light on various light-weighting measures on powertrains and their importance and level of maturity in taking original equipment manufacturers (OEMs) closer to CO2 targets. The study has been broken down into 3 clusters-engine, transmissions, and exhaust after-treatment. Newer materials and the pace of substitution of conventional materials have been discussed. Supplementary technological advances required in manufacturing and joining process and economies of scales to be achieved are also detailed. The study delves into key participants, such as BMW and VW, for a deeper insight into their light-weighting strategies through 2 case studies. The base year is 2015 and forecasts have been provided till 2022.\nKey Findings\nOriginal equipment manufacturers (OEMs) are required to reduce - % of their CO2 emissions on average in 6–7 years. Powertrain light weighting is expected to contribute significantly to this.\nPowertrain Light Weighting: Key Takeaways, Global, 2015–2020\n-Emission Compliance-By 2020, powertrain components are estimated to have the potential to lose up to % of their weight. Every kg weight loss will result in the CO2 target reducing by g/km, while the same is expected to result in emissions getting lowered by 6–7 g/km, giving significant advantage to the OEM. German OEMs, such as Volkswagen (VW) and BMW, are expected to lead with at least a 10% weight reduction year-on-year (YoY) using lightweight techniques.\n-Material of the future is highly subjective to application. However, significant levels of material substitution will occur only if new materials score well in terms of their availability, economics, and sustainability. Plastics and reinforced polymers have large potential for light weighting, but their increased application is dependent on research advancement in their thermal properties and joining methods.\nKey Questions this Study Will Answer\n- By 2020, can cost targets and weight-reduction targets be met simultaneously while achieving light weighting?\n- Is there a difference between the fundamental drivers of premium and mass OEMs to achieve light weighting? Do they tend to vary with markets, segments, models, and brands (within a group)?\n- How do powertrain focus areas help in achieving more than chassis and interiors? Which materials and joining techniques are key today and in the future?\n- What are the different substitute materials and methods for light-weight engines, transmissions and exhaust systems?\n- Why are key global OEMs expected to target light-weight packages? What are the expected base and intended characteristics of light-weight packages?\n- What are the key light-weighting strategies of BMW and VW? What are the materials, processes, and philosophies that are fundamental to their light-weighting approaches?\nRead the full report: http://www.reportlinker.com/p03321216-summary/view-report.html\nAbout Reportlinker\nReportLinker is an award-winning market research solution. Reportlinker reviews, finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.\nhttp://www.reportlinker.com", "external_links": ["http://www.reportlinker.com/p03321216-summary/view-report.html"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T22:57:51.553+03:00", "highlightTitle": ""}