{"organizations": [], "uuid": "a629c789cbddd593028ec0a7f37efe05455ac15e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03467/laptop_virus_3467342k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-08.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/case-studies/11919194/how-business-can-recover-from-cybercrime.html", "country": "US", "title": "How a business can recover from cybercrime", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "How a business can recover from cybercrime - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:53:00.000+03:00", "replies_count": 0, "uuid": "a629c789cbddd593028ec0a7f37efe05455ac15e"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/case-studies/11919194/how-business-can-recover-from-cybercrime.html", "ord_in_thread": 0, "title": "How a business can recover from cybercrime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On a regular day at media recruitment agency Major Players’ London office, computers whirred with activity. Phones, printers and photocopiers quietly hummed in the background and thousands of emails were being sent back and forth when, all of a sudden, director of operations Jonathan Levene was disturbed by some distressing news. “One of our finance guys came to me saying he had a huge warning message on his monitor with some kind of countdown timer,” Mr Levene says. “I instantly knew we’d been hit with a bad virus.” Protecting against spam, malware and viruses is commonplace for businesses today , with most malicious emails deflected automatically by various security programmes, and new problems rapidly identified and solved with a quick software update. However, this virus wasn’t so easy to resolve. Major Players’ computer system had been hit by a particularly vicious piece of malware, CryptoLocker, which has affected an estimated 250,000 computers to date. The aggressive virus has the potential to take down whole organisations with its ability to seize and lock crucial data. Camouflaged as an email attachment from credible senders, the virus encrypts both local and shared network file data with a remotely held key. The victim is given 72 hours to pay a ransom fee. If they don’t pay up in time, CryptoLocker destroys the encryption key – and access to the valuable files is lost permanently. “Sure enough, when I arrived at my colleague’s desk, I could see the red dialogue box displaying a ransom message and a list of files that were now encrypted and inaccessible,” Mr Levene says. For most victims, seeing the CryptoLocker virus flash up on their computer screens leaves just two choices: pay up or lose the data forever In Major Players’ case, the ransom was $400 – not an earth-shattering fee for a successful media agency, but a dangerous precedent to set. What would stop CryptoLocker hitting them again, and demanding double – or 10 times the amount – next time? “We initially considered paying the ransom,” Mr Levene says. “The threat isn’t exactly ambiguous, up there in bold on the monitor, flashing with the words: ‘The server will destroy the key after a time specified in this window. After that, nobody can and never will be able to restore files.’” For most victims, seeing the CryptoLocker virus flash up on their computer screens leaves just two choices: pay up or lose the data forever. But before making any snap payments, Mr Levene contacted Databarracks, which provides back-up and disaster recovery services from an ex-military nuclear bunker in south London. Thankfully, Major Players had made use of their cloud back-up service – meaning CryptoLocker no longer had the upper hand. “From the minute he answered the phone, our engineer, Tom, knew exactly what to do,” says Mr Levene. “He was unequivocal, saying: ‘Don’t pay the ransom, we can get your data back for you.’” “Tom sent us our files back immediately so we could access them locally and then stopped the daily scheduled back-ups from running to prevent the encrypted files from overwriting our existing back-ups.” The fact Major Players had prioritised cloud back-ups as an important safety measure paid dividends, with no harm caused to any data – or the company bank account. “The nature of our business means that we can’t be overly prescriptive with the internet access rights we afford our recruiters,” Mr Levene says. “Email correspondence is a critical function for us – it’s how most of our work is done. Often those mails can be unsolicited.” While vetting emails for anything suspicious and downloading appropriate virus prevention software is hugely important, preparing for the worst is key – and companies ignore the importance of the cloud at their peril. “The recovery was actually so smooth, no one in the office even noticed,” Mr Levene adds. “I’ve seen organisations where back-up is a secondary consideration, and it’s situations like this that really demonstrate how important it is to stay on top of things.” “Anyone can be affected by ransomware such as CryptoLocker,” says Databarracks’ managing director Peter Groucutt. “CryptoLocker itself was the most significant and widespread malware we have seen. Even though it has now been cracked, ransoms still occur and are a growing threat. “Staying up-to-date with the latest developments is an important starting point. Half the battle is knowing what to look out for; if you recognise a suspicious email as a threat, the whole security incident is avoided.” • For more advice on preparing your business for the tech challenges of the future, visit HP BusinessNow You may also be interested in: • Build tech to grow your business • Breaking new markets means rethinking your SME • Efficient doctors need IT prescription • What is lean start-up philosophy? • Consider it signed, sealed and sent with Sendy", "external_links": [], "published": "2015-10-08T20:53:00.000+03:00", "crawled": "2015-10-08T16:27:46.485+03:00", "highlightTitle": ""}