{"organizations": [], "uuid": "1f5a3b9e448d9bb496f0156c4c64847a54ae796b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/65215/arab-citizens-israel-feel-tensions", "country": "US", "title": "Arab Citizens of Israel Feel Tensions", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Arab Citizens of Israel Feel Tensions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T23:41:00.000+02:00", "replies_count": 0, "uuid": "1f5a3b9e448d9bb496f0156c4c64847a54ae796b"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/65215/arab-citizens-israel-feel-tensions", "ord_in_thread": 0, "title": "Arab Citizens of Israel Feel Tensions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click here for information and nomination Arab Citizens of Israel Feel Tensions \nThis weekend, Israel’s security services went on high alert as rumors spread that an Israeli soldier had been kidnapped near Israel’s border with Syria. When the gag order was lifted, it turned out that a 23-year-old Arab citizen of Israel had used a paraglider to cross the border into Syria, apparently to join Islamic State. \nHe is not the first to do so. A spokesman for Israel’s Shin Bet security service told The Media Line that about 40 Arab citizens of Israel and Palestinians from East Jerusalem have joined Islamic State over the past few years. In most cases, Israel has taken away their citizenship. \nThe paraglider added to the tensions swirling around Arab citizens of Israel who make up just over 20 percent of Israel’s population. The current wave of violence has sharpened these tensions as three of the attackers have been Arab citizens, and many of the others have been teenagers from east Jerusalem, which Israel acquired in 1967 and annexed. \n“In every clash between Israel and the Palestinians, the Arab citizens of Israel will side with their brethren – you have to take it for granted,” Sami Smooha, a professor of sociology at Haifa University and himself an Arab citizen of Israel told The Media Line. “That said, they don’t really take any action. We see that even the demonstrations have died down and I don’t expect to see any more.” \nArab citizens of Israel say that the last month of dozens of Arab attacks on Jews has increased suspicion on all sides. Arab employees in Jewish schools have been told not to come to work, or to work only after the children go home. A poll by the New Wave Economic Institute found that 60 percent of Jewish Israelis say they have avoided buying from Arab-owned shops since the beginning of the month. Many Israeli Arabs say they have taken to speaking in Hebrew in public, fearful they could be a target for angry Jewish attacks. In several instances, Arab citizens of Israel have been beaten by Jewish mobs. Arab citizens also held a commercial strike to protest the violence. \nSmooha believes that the overall framework of relations between Jews and Arabs in Israel remains intact, despite suspicion on all sides. \n“There is a lot of interdependence between the communities and there is a commitment by Jews, Arabs and the state to continue this system of peaceful relations,” Smooha said. “I don’t see what is happening now as a real threat to Arab-Jewish relations.” \nArab citizens of Israel have more political power than ever before. In the last election, four separate Arab parties united to form the Joint List, which won twelve Knesset seats, becoming Israel’s third largest party. Long-time Knesset member Ahmed Tibi, known for firebrand speeches in the Israeli Knesset was elected Deputy Speaker. \nYet there is a sense of deepening separation among the communities. Someone on Facebook recently posted that he was looking for a small Jewish community in Israel to move to outside the main cities. Thrown into his description of a “nice balance of religious groups” and “great community vibe” was two words “Arab-free”. His post sparked a Facebook storm with some calling him a racist and others applauding his sentiment. He eventually modified the post. \nWith the exception of Haifa, Ramla, and Akko, there are few places were Jews and Arabs really live side-by-side. Even in Haifa, the largest mixed Arab-Jewish city, there are mostly-separated neighborhoods. \nSeveral cities in Israel including Ashkelon and Rehovot, announced that Arab construction workers would no longer be allowed in their cities. \n“”We are going through a difficult time. There is a wave of attacks, and no one can guarantee that that wave is over,” Israel’s Economy Minister and head of a hardline party called the Jewish Home Naftali Bennett opened his speech. “We are working every day until late at night, including yesterday, to combat terrorism. But you have to know 99.9% of Arab citizens are loyal to the State of Israel. It is only a very small minority acting out against.” \n“Therefore, the policy of the government of Israel should be a tough hand against terrorists, but extending a hand of embrace to faithful citizens. The hard line I wield against terrorists in the Cabinet will continue with new efforts in light of the security situation. But in my job as Economy Minister, I will not permit harm against any employee on the basis of religion or race. Something like that will not happen in Israel.” \nPolls have consistently shown that Arab citizens of Israel want to stay, and not become part of any future Palestinian state. At the same time, they demand full equality, and not to be treated with suspicion by their Jewish neighbors and co-workers. By By Linda Gradstein | The Media Line | Oct 25, 2015", "external_links": [], "published": "2015-10-25T23:41:00.000+02:00", "crawled": "2015-10-25T23:59:39.856+02:00", "highlightTitle": ""}