{"organizations": ["Parramatta", "Opera House"], "uuid": "949a0113f8d89d8cfdfb9e4a0e5c3e143acfbed9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/187", "section_title": "Artipot: Travel > Cruises Articles", "url": "http://www.artipot.com/articles/1943065/theres-no-magic-like-sydney-new-years-eve-magic.htm", "country": "US", "title": "There's no magic like Sydney New Year's Eve magic (Tom John)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "There's no magic like Sydney New Year's Eve magic (Tom John)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:03:00.000+03:00", "replies_count": 0, "uuid": "949a0113f8d89d8cfdfb9e4a0e5c3e143acfbed9"}, "author": "", "url": "http://www.artipot.com/articles/1943065/theres-no-magic-like-sydney-new-years-eve-magic.htm", "ord_in_thread": 0, "title": "There's no magic like Sydney New Year's Eve magic (Tom John)", "locations": ["New York", "Harbour Bridge", "Australia", "Sydney Harbour", "Sydney"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom John", "Macquarie"], "text": "By Tom John Oct 14, 2015 The countdown is on to the biggest night of the year as the world prepares to bid farewell to 2015 and welcome the New Year with hearts full of hope and resolutions galore.From Sydney's legendary NYE fireworks in the East to New York's iconic ball drop in the West, New Year's Eve 2015 is the day to lay your worries aside, let your hair down and party like you've never partied before!Past trends reveal that Sydney is the world's most preferred New Year's Eve destination, primarily because it's summer Down Under, unlike other party cities in the world. And, Sydney does not disappoint... with a creative ambassador in charge of the theme, ideas on how to best execute it are chalked up well in advance to gift New Year revellers a celebration that's an absolute showstopper! Sydney Harbour takes centre stage on New Year's Eve, and that's definitely the place to be! The Sydney skyline, lined with the magnificent Opera House and the Harbour Bridge sets the stage for all the harbour events, the mind-blowing midnight fireworks and pyrotechnics that kick off the New Year with a big bang!The best vantage point is Mrs. Macquarie's Chair at the tip of the Royal Botanical Gardens, but chances are you'll find people who've camped overnight to grab the best seats in the house! The other go-to spots that attract large crowds are Sydney Heads, the inner harbor and the Parramatta River.But, not to worry, vantage points to view the Sydney Harbour New Year's Eve events are dime a dozen - some are family friendly, some have food and alcohol on sale, some allow you to bring your own, some are ticketed while many others are free.Just remember, with New Year's Eve in Sydney, the entire city is looking to celebrate a great evening out; so making last-minute plans will only set you and your family up for a big disappointment. You have to do the spadework well in advance, narrow down your choices and decide on one venue based on parameters that suit you best.Here's another thought... if 2015 has been particularly good for you and you really want to live it up with a party to top all parties, you should consider booking an exclusive Sydney Harbour New Year's Eve Fireworks Cruise. It's an experience that is worth paying top dollar for!You'll be absolutely spoilt for choice when it comes to choosing a luxury Sydney Harbour New Year's Eve party cruise, with numerous cruise operators offering packages with tempting inclusions. Prices vary based on the cruising vessel, its luxury parameters, type of food and beverage inclusions, entertainment options that could include DJ or a live band etc. But, the common denominator is a prime position in the harbour exclusion zone that gives cruising guests ring-side seats to all the mesmerizing harbour events that set the tone for the evening, including the 9pm family fireworks and the world-renowned midnight fireworks.Great views and great parties aside, the other obvious advantage of a Sydney Harbour NYE cruise is the certainty of a seat aboard a cruising vessel and the surety that there will be no elbowing or jostling for space to see the fireworks as they light up the Sydney sky. If you're ready to pay for a once-in-a-lifetime experience, choosing a NYE harbour cruise is quite a no-brainer!There are some NYE harbour events that hosted every year, but the wonder of it all is that they never cease to amaze locals or repeat visitors. The special aircraft that execute stunning air displays with fantastic dips and dives, twists and turns, the beautiful projections on the ethereal pylons of the Harbour Bridge, the Sydney Harbour Bridge Effect and the Harbour of Light Parade are visual treats like no other leaving you at a complete loss for words.That's Sydney New Year Magic for you! About the Author Tom John has taken a step back from his job as a mainstream journalist in Sydney to pursue his passion for travel and adventure. He hopes to get an intrinsic feel of Australia through varied experiences, reliving every exciting and memorable moment through his writing. Suffice to say, nothing gives him more pleasure than sharing his escapades with the rest of the world!", "external_links": [], "published": "2015-10-14T10:03:00.000+03:00", "crawled": "2015-10-15T08:16:36.967+03:00", "highlightTitle": ""}