{"organizations": [], "uuid": "96ee5893f0aa8789b90cf40d82a9e41b415777b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30327090/opening-of-the-nile-ritz-carlton-cairo-marks-a-new-era-for-the-majestic-property", "country": "US", "title": "Opening Of The Nile Ritz-Carlton, Cairo Marks A New Era For The Majestic Property", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Opening Of The Nile Ritz-Carlton, Cairo Marks A New Era For The Majestic Property - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "96ee5893f0aa8789b90cf40d82a9e41b415777b0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30327090/opening-of-the-nile-ritz-carlton-cairo-marks-a-new-era-for-the-majestic-property", "ord_in_thread": 0, "title": "Opening Of The Nile Ritz-Carlton, Cairo Marks A New Era For The Majestic Property", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Ritz-Carlton Hotel Company, L.L.C.\nIconic hotel offers gateway to Egyptian luxury lifestyle in a legendary setting\nCAIRO , Oct. 22, 2015 /PRNewswire/ -- The Nile Ritz-Carlton, Cairo , the iconic luxury hotel on the shores of the Nile, opened its doors to a new wave of global travelers to the historic city today. The landmark property, which reopened under the stewardship of The Ritz-Carlton Hotel Company, L.L.C., will offer leisure and business travelers to the city an opulent retreat in the heart of Cairo that is rich in history and intuitive in service.\nPhoto - http://photos.prnewswire.com/prnh/20151022/279579\nThe grand opening of the iconic property, offers visitors from around the world a stately vantage point to witness the resurgence of one of the world's most famous historic destinations. \" Cairo is a city that fuses the majesty of the past with the pulse of the present and the promise of the future,\" stated Herve Humler , President & C.O.O., The Ritz-Carlton.\n\"Visitors over the centuries have been drawn by its ever-evolving mix of history, trade and culture, which continues to draw adventurists, as well as families and business travelers to this vibrant city. With millennial travelers seeking luxury as part of their travel experience, the Nile Ritz-Carlton Cairo marries this \"bucket-list\" city with world-class services. This has not only made Cairo more appealing but has also given us the opportunity to raise our first Ritz-Carlton flag in on the banks of the Nile.\"\nFor the modern luxury traveler experiencing the vibe of Cairo for the first time, The Nile Ritz-Carlton, Cairo provides the ideal base from which to dive into the energy of the city as well as to withdraw from it to reflect and introspect. Business and leisure travelers can get the best of both worlds in the historic 331-room hotel, with its ultramodern facilities including a spectacular Olympic-size pool as well as meeting rooms, ballrooms and business facilities. Gastronomes visiting Egypt will also be spoilt for choice with an array of dining venues, with innovative and cutting edge fare spanning Arabian, Italian and Continental cuisine.\nFrom five-star Nile cruises to explorative culinary tours and private excursions to the Pyramids, Cairo is unveiling the diversity of its luxury offering and allowing Arab and global travelers to discover the city in new and innovative ways. While first time visitors to the city will be awed by the majesty of the Pyramids of Giza, the city also offers alternative experiences such as viewings of the well-preserved medieval residences formerly owned by wealthy merchants.\nCultural aficionados and art enthusiasts who desire more than visits to the Sphinx and the Pyramids can delight in Cairo's lush art scene that runs the gamut from Islamic art to impressionist paintings. For the gourmand, the flavours that the city offers showcase the potpourri of cultures that has enriched the city's personality and made it a unique destination. With cuisines from around the world and experiences catering to the conventional and the quirky, the city is a culinary playground.\n\" Cairo is a vibrant destination and no matter what your purpose in visiting the city, business or leisure or visiting family, there is always a sense of discovery. The past has left a strong imprint on the personality of the city but its dynamism comes from its ever-evolving cultural and social scenes. For the global tourist, it is this tasteful fusion that appeals and keeps Cairo current,\" added Humler.\nAbout The Ritz-Carlton Hotel Company, LLC\nThe Ritz-Carlton Hotel Company, L.L.C., of Chevy Chase, Md. , currently operates 91 hotels and resorts in the Americas, Europe , Asia , the Middle East , Africa , and the Caribbean . More than 30 hotel and residential projects are under development around the globe. For more information, or reservations, visit the company web site at www.ritzcarltonreserve.com , www.ritzcarlton.com or www.ritzcarlton.cn . The Ritz-Carlton Hotel Company, L.L.C. is a wholly-owned subsidiary of Marriott International, Inc. (NASDAQ) – visit www.marriottnewscenter.com\nContact: Sarah Walker-Kerr\nsarah.walkerkerr@ritzcarlton.com\nRegional Director of Public Relations, Middle East & Africa\n+971 (0) 56 2160815\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/opening-of-the-nile-ritz-carlton-cairo-marks-a-new-era-for-the-majestic-property-300164691.html\n ", "external_links": ["http://www.marriottnewscenter.com/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NE35693&Transmission_Id=201510221220PR_NEWS_USPR_____NE35693&DateId=20151022", "http://www.ritzcarlton.com/en/Reserve/Default.htm", "http://photos.prnewswire.com/prnh/20151022/279579", "http://www.prnewswire.com/news-releases/opening-of-the-nile-ritz-carlton-cairo-marks-a-new-era-for-the-majestic-property-300164691.html", "http://www.ritzcarlton.com/zh-cn/Default.htm", "http://www.ritzcarlton.com/en/Default.htm"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T21:40:40.238+03:00", "highlightTitle": ""}