{"organizations": [], "uuid": "9089c8fdeceba1edbefc0138cc9b0f46be80edfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "robbreport.com", "main_image": "http://robbreport.com/sites/default/files/images/articles/2015Oct/1791781//ritz-carlton-kyoto-01.jpg", "site_section": "http://robbreport.com/rss-luxury-travel", "section_title": "Luxury Travel - Robb Report – Your Global Luxury Resource", "url": "http://robbreport.com/luxury-travel/explore-two-japans-most-popular-cities-ritz-carlton", "country": "US", "title": "Explore Two of Japan’s Most Popular Cities with Ritz-Carlton", "performance_score": 0, "site": "robbreport.com", "participants_count": 1, "title_full": "Explore Two of Japan’s Most Popular Cities with Ritz-Carlton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:00:00.000+03:00", "replies_count": 0, "uuid": "9089c8fdeceba1edbefc0138cc9b0f46be80edfb"}, "author": "Rebekah Bell", "url": "http://robbreport.com/luxury-travel/explore-two-japans-most-popular-cities-ritz-carlton", "ord_in_thread": 0, "title": "Explore Two of Japan’s Most Popular Cities with Ritz-Carlton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Explore Two of Japan’s Most Popular Cities with Ritz-Carlton Ritz-Carlton, Kyoto Rebekah Bell October 21, 2015 \nAt the break of dawn, Tokyo’s Tsukiji fish market is buzzing with activity. Buyers haggle with each other at the tuna auction, while retailers set up shop in the market and prepare for the onslaught of customers. The market runs like a well-oiled machine, giving tourists and locals alike an insider’s look at the thriving Japanese landmark. Perusing the world’s largest fish market is just one of the activities on the roster for guests who book the One Journey, Two Capitals vacation package offered by the Ritz-Carlton, Kyoto, and the Ritz-Carlton, Tokyo. During the trip, guests will stay for two nights at each hotel, providing just the right amount of time to experience the sights and sounds of each iconic city. \nIn addition to guided tours of Tsukiji fish market, the Tokyo leg of the trip includes shopping excursions to the fashionable Harajuku and Shibuya districts, touring sumo wrestling rings, cultivating Bonsai trees, and trying local tipple with a Japanese-whiskey expert. To celebrate the annual release of new sake batches, the Ritz-Carlton, Tokyo, will offer in-room sake tastings from a brewery founded in 1702. \nGuests will then travel to the ancient city of Kyoto, which dates back to at least the 8th century and is populated by colorful shrines, secret gardens, and over 1,000 Buddhist temples. While staying at the Ritz-Carlton, Kyoto (the only luxury hotel in the heart of Japan’s imperial city), guests can learn samurai sword techniques, soap making, and sushi preparation. They can also taste sake with a sommelier, participate in an interactive kimono ceremony, visit the Kamigamo Shrine and other sacred sites, or tour the city by rickshaw. Rates for a four-night stay start at around $2,300 (based on double occupancy) and include daily breakfast for two and transfers to the train station. ( ritzcarlton.com )", "external_links": [], "published": "2015-10-21T22:00:00.000+03:00", "crawled": "2015-10-22T04:08:15.299+03:00", "highlightTitle": ""}