{"organizations": [], "uuid": "ad2b3140315d285ab3e8d4f17a9ff3803d0cc60e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/06/STARWOOD-HOTELS-RESORTS.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/starwood-hotels-resorts-accelerates-growth-in-africa-and-indian-ocean-with-seven-new-deals/", "country": "US", "title": "Starwood Hotels & Resorts Accelerates Growth in Africa and Indian Ocean with Seven New Deals - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Starwood Hotels & Resorts Accelerates Growth in Africa and Indian Ocean with Seven New Deals - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad2b3140315d285ab3e8d4f17a9ff3803d0cc60e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/starwood-hotels-resorts-accelerates-growth-in-africa-and-indian-ocean-with-seven-new-deals/", "ord_in_thread": 0, "title": "Starwood Hotels & Resorts Accelerates Growth in Africa and Indian Ocean with Seven New Deals - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Starwood Hotels & Resorts Accelerates Growth in Africa and Indian Ocean with Seven New Deals Published on : Wednesday, September 30, 2015\nFrom the Africa Hotel Investment Forum (AHIF) (http://www.Africa-Conference.com) in Addis Ababa, Ethiopia, hospitality leader Starwood Hotels & Resorts Worldwide, Inc. (NYSE:HOT) (http://www.starwoodhotels.com) today announced aggressive expansion in Africa and Indian Ocean, increasing its market penetration across the region. Today the company has a strong footprint with 34 operating hotels and a robust pipeline of 20 hotels under development. With the expansion of its luxury, upper upscale and mid-market brands, Starwood will grow its portfolio by over 50% in the next five years, with more than 50 hotels operating and nine out of its 10 compelling lifestyle brands flying their flag in the region.\n“The momentum of growth we are seeing in Africa today is unprecedented. It is a reiteration of the trust our owners have in us, the power of our distinct lifestyle brands and the strength of our global distribution and award-winning loyalty program,” said Michael Wale, President for Starwood, Europe, Africa and Middle East. “Africa is a market with huge potential. With economic growth, a rising middle class and rapid urbanization, the demand for travel and quality lodging will continue to grow and provide us with a significant opportunity to grow our brands and play our part in supporting many emerging markets across the continent.”\nReaffirming its commitment to growth in the region, the company announced seven new deals including W Sharm El Sheikh and The Residences at W Sharm El Sheikh (Egypt), Sheraton Bamako (Mali), The Westin Abuja and Residences (Nigeria), Four Points by Sheraton Abuja and Residences (Nigeria), Four Points by Sheraton Nairobi Airport (Kenya), Aloft Dakar (Senegal), and Element Oyster Bay Dar es Salaam (Tanzania). With the new signings Starwood will further build its position in Nigeria and Egypt, increase its presence in Senegal and enter new markets, which include Mali, Kenya and Tanzania.\nW Sharm El Sheikh and The Residences at W Sharm El Sheikh\nRenowned for its visionary design, playful luxury and Whatever/Whenever® mentality, W Hotels Worldwide will make its much anticipated entry into Egypt with W Sharm El Sheikh and Residences scheduled to open in 2020. Owned by Tower Prestige for Hotels SAE, the hotel with 350 stylish guest rooms and suites will be located at Nabq Bay in the Red Sea resort town of Sharm El Sheikh. It will also feature 50 branded residences with a dedicated Resident’s Lounge and access to the signature W offerings and services available at the hotel.\nSheraton Bamako Hotel\nStarwood’s largest and most globally recognized brand, Sheraton, will foray into Mali in West Africa with Sheraton Bamako Hotel. Scheduled to open in early 2017, the hotel is owned by Koira Hotel Investment S.A. Boasting 200 modern rooms, the hotel will also feature all of the Sheraton brand signature experiences and amenities including a lobby bar serving the brand’s latest food and beverage program Paired, Sheraton Club® Lounge, the Shine Spa for Sheraton™ and the state-of-the-art Sheraton Fitness® center.\nThe Westin Abuja and The Residences\nWith its distinct and winning approach to wellbeing, Starwood is gaining traction to grow Westin in gateway cities and in resort destinations. Home to 389 contemporary guest rooms and suites, each featuring the iconic Westin Heavenly® Bed and signature Westin services and amenities, the hotel will be part of a landmark mixed use development in Abuja’s central business district, marking the debut of the brand into Nigeria. Scheduled to open in 2022, the hotel will also feature 194 branded residences with access to hotel facilities. In partnership with Century Health and Hospitalities Limited, the project also includes a Four Points by Sheraton Hotel with branded residences.\nFour Points by Sheraton Abuja and The Residences\nA part of the mixed use development project owned by Century Health and Hospitalities Limited, Four Points by Sheraton Abuja will feature 212 spacious and contemporary guest rooms including suites and 150 branded residences with access to hotel facilities. With the two projects together Starwood will add over 600 rooms reinforcing Starwood’s position as a leading hospitality player in Nigeria.\nFour Points by Sheraton Nairobi Airport\nWith its emphasis on stylish comfort and genuine service at an honest value, Four Points by Sheraton spearheads Starwood’s growth in the mid-market segment in the region. Strategically located within the secure boundary of the airport precinct, the 194-room Four Points by Sheraton Nairobi Airport will mark Starwood’s entry into Kenya. Owned by AirMarc Ltd the hotel will be operated under a franchise arrangement and is expected to become a welcome gateway for travelers transiting to leisure destinations in Kenya as well as for business travelers.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T00:40:44.687+03:00", "highlightTitle": ""}