{"organizations": [], "uuid": "f7cb57dc80b54047f2ecabf9088f84560873ef66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64436/elections-travel-agents-association-india", "country": "US", "title": "Elections: Travel Agents Association of India", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Elections: Travel Agents Association of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T11:29:00.000+03:00", "replies_count": 0, "uuid": "f7cb57dc80b54047f2ecabf9088f84560873ef66"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/64436/elections-travel-agents-association-india", "ord_in_thread": 0, "title": "Elections: Travel Agents Association of India", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Elections: Travel Agents Association of India Original,   \nBy Anil Mathur, eTN India | Oct 02, 2015 Sunil Kumar eTN   \nMembers of Travel Agents Association of India (TAAI) elected office-bearers and Managing Committee for the 2-year term (2015-17) at the 64th AGM held on 30th September, 2015, in Mumbai. \nTeam TAAI Positive emerged victorious with a sweeping majority. Sunil Kumar R, who headed TAAI Positive, has been elected as President, Marzban Antia has been voted as Vice President Lokesh Bettaiah, as the Honorary Secretary General and Jay Bhatia as HonoraryTreasurer. \nThe new Managing Committee of TAAI includes R. Venkatachalam, Imtiaz Qureshi, Bhagwan Ramnani, Devaki Thiagarajan, Shreeram Patel, Anil Kumar and Jyoti Mayal. \nTalking to the media after the election results were announced, Mr Sunil Kumar said - It is a rewarding result and he is very very excited that the entire team has won. He thanked the members for their faith in the TEAM and said that the TEAM TAAI POSITIVE will go all out to attempt meeting the expectations of the members. The focus will be on trying to guide members into a changing industry era where the challenges will be many while opportunities too will multiply. To a question on what would be the key focus, he remarked that TAAI will do all possible to boost their positive image levels and take TAAI to its much awaited next level. It will be our endeavour to lead members from the \"today-we-exist\" into an environment called \"tomorrow\", rather than trying to get the tomorrow's to meet our today's. He added that this is one way to make the association relevant in a changing environment and evolution being the order of the day, our approaches and practices must change. Thus training will be an ongoing process to ensure that members can be successful in the current environment. \nHe was happy that the members who had attended the AGM were very cooperative and supported the election process which was an almost zero defect process. \nHe added that our immediate agenda will be design our planning and form committees to assign agenda and accountability to our members. Among the things we need to do is to get a closer connectivity with the Government.. \nHe once again thanked members for their support and invited them to join the initiative to drive TAAI forward to its most deserved position.", "external_links": [], "published": "2015-10-02T11:29:00.000+03:00", "crawled": "2015-10-02T17:46:09.534+03:00", "highlightTitle": ""}