{"organizations": ["Breaking Travel News | News Boeing", "China State Shipbuilding Corporation and China Investment Corporation", "Lufthansa", "Southwest Airlines", "Travel Like James Bond Yahoo Travel Photo", "OpenSkies", "Tamweelview European Holdings", "Breaking Travel News | News Vodafone UK", "GAAP", "House", "Car U.S. News & World", "Yahoo Travel", "USA TODAY", "Congress", "Inns of Court", "Marseille", "Breaking Travel News | News Carnival Corporation", "Global Business Travel Association", "Hilton Worldwide", "News The Antigua & Barbuda Tourism Authority", "Breaking Travel News | News Oakwood Worldwide", "The Spa Club", "Nações Unidas", "Spa Club", "Gluten-Free Travel Yahoo Travel", "British Airways", "The House Administration Committee"], "uuid": "a0cd4ec0716d816920490fe6cd0369b0377370c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newslocker.com", "main_image": "http://www.newslocker.nl/images/newslocker-cube.png", "site_section": "http://www.newslocker.com/en-us/news/travel/rss/", "section_title": "Travel - Newslocker", "url": "http://www.newslocker.com/en-us/news/travel/how-to-hack-your-holiday-travel-and-where-to-go-for-new-years-mashable/", "country": "", "title": "How to hack your holiday travel, and where to go for New Year's - Mashable", "performance_score": 0, "site": "newslocker.com", "participants_count": 0, "title_full": "How to hack your holiday travel, and where to go for New Year's - Mashable", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:01:00.000+03:00", "replies_count": 0, "uuid": "a0cd4ec0716d816920490fe6cd0369b0377370c1"}, "author": "", "url": "http://www.newslocker.com/en-us/news/travel/how-to-hack-your-holiday-travel-and-where-to-go-for-new-years-mashable/", "ord_in_thread": 0, "title": "How to hack your holiday travel, and where to go for New Year's - Mashable", "locations": ["Clerkenwell", "Shenzhen", "Morocco", "Mission Hills Mid Valley", "Gatwick", "Bob Hope Airport", "Salzburg", "Lyon", "Avignon", "London", "South of France", "UAE", "Hungary", "Kenya", "Brazil", "WASHINGTON", "Paris", "Dominican Republic", "Glasgow", "Burbank", "Mount Rushmore", "Iceland", "Los Angeles", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Bond", "Zhang Yunlong", "Maggie Fuller", "Jon Lal", "Daniel Kahneman", "Zoe Lofgren", "Erik Mace", "Hu Zhiqiang", "Schock", "Donaldson Collection/Michael Ochs"], "text": "How to hack your holiday travel, and where to go for New Year's Mashable There's no better sign the holidays are coming than the many reminders of when to buy your airfare. While there's no way to know you're getting the absolute lowest price, or buying at the precisely right time, there are ways to minimize the chances of ... via RSS for travel Since Lufthansa’s surcharge on global distribution system bookings went into effect on Sept. 1, 42 percent of travel buyers have decreased bookings with the carrier, according to an Oct. 14 to Oct. 19 survey by the Global Business Travel Association and its network of European partners. Of the 434 ... How to Save Money on Holiday Travel by Car U.S. News & World Report If you're driving to visit relatives, then you'll want to pack your own snacks. 150105_driving. Road trips can be fun but also costly. By Jon Lal Oct. 22, 2015 | 9:28 a.m. EDT + More. It's time to plan for the holiday season, and while that means ... Off The Grid: How To Travel When You Can't Paste Magazine Here's something you might have always known but may have never articulated: We travel with our minds, not our bodies. Our “remembering self” makes us who we are, not our “experiencing self,” according to Nobel-winning research from Daniel Kahneman. Travel Insurance Is No Longer Just for the Over-Prepared TIME Last year a friend slipped and broke her ankle the day she was scheduled to travel to Paris. Instead of a trip to the Louvre, she took a trip to the hospital. She had to cancel her flight on OpenSkies, owned by British Airways. OpenSkies was not very ... via Breaking Travel News | News Carnival Corporation has formed a joint venture in China that intends to launch the first world-class, multi-ship domestic cruise brand in the Chinese market. Carnival is partnering with China State Shipbuilding Corporation and China Investment Corporation on the new venture aimed at accelerating the development and growth of the overall cruise industry in China, which is expected to eventually become the largest cruise market in the world. via Breaking Travel News | News Vodafone UK has added eight new worldwide destinations to its number of 4G roaming destinations. This means customers can use 4G for faster data speeds in 71 destinations. The new destinations include Dominican Republic, Hungary, Kenya, Morocco and UAE - perfect for those planning a getaway or that all important business trip this autumn. via Breaking Travel News | News Boeing has reported third-quarter revenue has increased nine per cent to $25.8 billion on record commercial deliveries. Core earnings per share for the quarter increased 18 per cent to $2.52, reflecting strong performance across the company, and GAAP earnings per share was $2.47. via Breaking Travel News | News The Antigua & Barbuda Tourism Authority has launched a new ‘Island Life’ brand campaign with a high impact tube platform advertising campaign targeting London commuters. The 16-sheet poster campaign, will run across high footfall, centrally-located London underground stations until November 19th, timed to raise awareness ahead of the key Winter and January sales period. via Breaking Travel News | News After nearly six months of running its new all year round direct service between London and the South of France, stopping at Lyon, Avignon and Marseille, Eurostar reports that the route has proven to be a great success. Since launch on May 1st this year, the service has carried over 110,000 passengers - exceeding expectations. via Breaking Travel News | News Oakwood Worldwide has expanded its London portfolio with a freshly renovated six-unit building at 96 Leather Lane. The new property offers a combination of one-, two- and three-bedroom fully furnished serviced apartments, situated conveniently for business travellers between the Inns of Court in London’s legal district and the media and creative business district of Clerkenwell. via Breaking Travel News | News Four Seasons had confirmed plans to open Four Seasons Hotel São Paulo at Nações Unidas in 2017, with Private Residences to follow. Through the partnership between Iron House Real Estate and Tamweelview European Holdings, the 254-room Hotel and 84 Private Residences will be the group’s first foray into Brazil. via Breaking Travel News | News Transforming hotel spa treatments from an extravagance to a monthly must, Hilton Worldwide has launched a global spa treatment membership, The Spa Club. The Spa Club offers local residents a discounted spa treatment each month, access to amenities at the Hilton nearest them, and a host of other perks. via Breaking Travel News | News Snow and sunshine dominate the weather outlook for British Airways’ customers looking to get away as the airline’s winter 2015 schedule starts at the end of the month. From October 25th the winter season kicks off with a new service to the dramatic volcanic landscape of Iceland while the skiing-mecca of Salzburg gets two new flights from Gatwick and Glasgow in December. via Breaking Travel News | News Underscoring Mission Hills’ reputation as the pioneer and innovator in China’s golf and leisure industry, the Mission Hills Footgolf Championship Grand Final, a total of 36 two-man teams battled for honours on the resort’s famous Pete Dye Course at Mission Hills Mid Valley, Shenzhen. Putting their best foot forward, Zhang Yunlong and Hu Zhiqiang were crowned champions at the championship. 11 travel apps for your next vacation MarketWatch Roadtrippers.com's app can help you navigate quirky places around the world—like Mount Rushmore's secret room. By. NatashaBurton. With the holidays approaching, many of us are contemplating some well-deserved time off (ahhh, finally). Whether you ... You Won't Believe Which Countries are Great for Gluten-Free Travel Yahoo Travel Gluten-free eating has come a long way in some parts of the world. (Photo: Thinkstock). By Maggie Fuller. We get it: the idea of traveling gluten-free can be overwhelming. For people with a serious allergy, preparing for a vacation is a whirl of ... The World is Not Enough: How to Travel Like James Bond Yahoo Travel Photo by Donaldson Collection/Michael Ochs Archives/Getty Images. Design by Erik Mace for Yahoo Travel. We all know about James Bond's license to kill, but what's really impressive is his frequent-flyer account. Over five decades and 24 films (the ...and more » House committee rejects plan to disclose lawmakers' travel details USA TODAY WASHINGTON — The House Administration Committee decided Wednesday not to require members of Congress to disclose to the public where they went when they traveled with tax payer dollars. Rep. Zoe Lofgren (D-Calif.), a member of the bipartisan ... House tightens office decoration, travel rules in wake of Schock scandalSTLtoday.comall 5 news articles » Burbank city manager's report tallies travel costs Los Angeles Times In this Aug. 2014 file photo, a waning gibbous moon serves as the backdrop in the morning sky as a Southwest Airlines passenger plane takes off from Burbank's Bob Hope Airport. In this Aug. 2014 file photo, a waning gibbous moon serves as the backdrop ...  ", "external_links": [], "published": "2015-10-22T15:01:00.000+03:00", "crawled": "2015-10-23T00:14:39.061+03:00", "highlightTitle": ""}