{"organizations": [], "uuid": "48d82a9c8deb7e045b489a982ee4c946e3782f0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/top-bars-and-pubs-of-kensington.html", "country": "US", "title": "Top Bars and Pubs of Kensington", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Top Bars and Pubs of Kensington", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T07:39:00.000+03:00", "replies_count": 0, "uuid": "48d82a9c8deb7e045b489a982ee4c946e3782f0a"}, "author": "Lisa Jeeves-2015-10-19T05:39:24-0400", "url": "http://www.articlesfactory.com/articles/travel/top-bars-and-pubs-of-kensington.html", "ord_in_thread": 0, "title": "Top Bars and Pubs of Kensington", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | October 19, 2015 \nIf you’re staying in a Kensington hotel, the chances are you are within a very short stroll of any number of posh clubs or upscale pubs. If you want to experience the robust and upmarket nightli... \nIf you’re staying in a Kensington hotel, the chances are you are within a very short stroll of any number of posh clubs or upscale pubs. If you want to experience the robust and upmarket nightlife of Kensington, the suggestions below make a great start. \nThe Abingdon \nIf you want to spend a cosy, classy evening with your special someone just a few steps from your Kensington hotel, the Abingdon might be just the place to go. This upscale bar offers a range of excellent food and wine, and is also highly rated for its friendly, casual service. The staff will make you feel like royalty even if you just opt for the set menu, and once you've finished dining you can relax in the pleasant atmosphere at the bar without feeling hurried. Located at 54 Abingdon Road. Admiral Codrington \nThe Admiral Codrington has a well-deserved reputation for its top-of-the-line cuisine and impeccable service. The establishment's skylight affords you a wonderful view as you dine, adding a very romantic element to your experience. The place has the feel of a traditional British pub (including the diverse menu) but with a definite upmarket ambience. Located at 17 Mossop Street, Chelsea. \nEclipse South Kensington \nIf you're in the mood to go partying but don’t want to stray to far from your Kensington hotel, the Eclipse is an excellent choice. Serving up indulgent cocktails and an extensive selection of wines you certainly won’t go thirsty. Once you're warmed up you can cut loose in the club, where an eclectic selection of house music pulses through to the wee hours of the morning. Try to get on to the guest list as the club tends to get packed to the brim. Located at 158 Brompton Road. \nBritannia \nIf you're looking for a place that has successfully fused the traditional feel of of an Olde English pub with a modern aesthetic, the Britannia comes highly recommended. Everything from the wood-panelled walls to the leather armchairs oozes quiet class – and it's a wonderful place to sit back, sip ale, and soak in the elegant atmosphere. It also provides a great range of gastronomical delights. Located at 1 Allen Street. \nBlagclub \nIf you want to experience an exotic, over-the-top psychedelic nightclub, the strangely named Blagclub is where you should go. There is a large selection of drinks to enjoy, from wines and beers to spirits and cocktails, but it’s the mixture of Hindu décor and opulent gold ceilings that make you feel as if you’ve just stepped out of reality and into a funky dream! Lose yourself in another world, all just a short walk from your Kensington hotel. Located at 11 Russell Gardens. \nOf course there are so many more hidden (and not so hidden) pubs and clubs to explore in Kensington, but these make a good start. Source:   ABOUT THE AUTHOR \nMatthew Zelinski works for the London Regency Hotel, a top Kensington hotel . This wonderful hotel embodies the true flavour of Kensington, with its traditional regency-style façade and superb facilities. Whether you're looking for accommodation in London for business or leisure, the Regency offers an effortlessly elegant experience.", "external_links": [], "published": "2015-10-19T07:39:00.000+03:00", "crawled": "2015-10-21T05:57:48.785+03:00", "highlightTitle": ""}