{"organizations": [], "uuid": "ea73b641d32ee1a488c50602e77aa9cd4e6a8ef2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30220721/north-beach-village-resort-hosts-grand-opening-of-north-beach-village-design-featuring-exhibit-by-ftlauderdalesun", "country": "US", "title": "North Beach Village Resort Hosts Grand Opening of North Beach Village Design Featuring Exhibit by FtLauderdaleSun", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "North Beach Village Resort Hosts Grand Opening of North Beach Village Design Featuring Exhibit by FtLauderdaleSun - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ea73b641d32ee1a488c50602e77aa9cd4e6a8ef2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30220721/north-beach-village-resort-hosts-grand-opening-of-north-beach-village-design-featuring-exhibit-by-ftlauderdalesun", "ord_in_thread": 0, "title": "North Beach Village Resort Hosts Grand Opening of North Beach Village Design Featuring Exhibit by FtLauderdaleSun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " North Beach Village Resort\nFORT LAUDERDALE, Fla. , Oct. 8, Local art is about to take center stage in North Beach Village when North Beach Village Resort (NBVR), famous for its eclectic collection of mid-century modern boutique hotels, opens the doors to its new gallery. North Beach Village Design, located at 600 Breakers Ave., just steps away from Fort Lauderdale Beach, will open on Friday, October 16, 2015 at 5 p.m.\nPhoto - http://photos.prnewswire.com/prnh/20151008/275409\n\"We are excited to launch this new gallery space and add yet another interactive space to the Village where families and people of all ages can relax and enjoy the Village Life,\" said Christine Sposa , Vice President of Operations at North Beach Village Resort.\nNorth Beach Village Design's inaugural exhibit, entitled \"Live in the Moment,\" includes more than a dozen photographs on canvas taken by local artist Andy Royston a.k.a FtLauderdaleSun.\nOriginally from Yorkshire, England , Andy Royston began the FtLauderdaleSun Project in 2009. Every single morning, he uses his iPhone to capture a single moment of Fort Lauderdale Beach at dawn. Then, using a variety of apps, angles and natural lighting, he edits the images and instantly shares them with his more than 50,000 social media followers.\n\"For me, photography is not about the mechanical technology that captured it, but rather about establishing an emotional connection to each image,\" said Royston. \"My aim from day one was to capture and share the moment as closely to the instant of creation as possible, so we could all live in the moment.\"\nIn addition to the \"Live in the Moment\" exhibit, the grand opening of North Beach Village Design will feature interactive art exhibits by Garman Sculpture Works and living art displays by Steve Watkins of Hana Box . Guests will be treated to complimentary appetizers, wine, and music.\nFor $40 per person, guests (ages 6+) can create their own masterpiece on canvas. The cost includes professional art instruction, canvas, easel and supplies. Guests can RSVP in advance by visiting bit.ly/villagedesign.\nThe free grand opening event will take place on October 16, 2015 . All are invited to meet Andy Royston from 5 p.m. to 6 p.m. followed by grand opening festivities from 6 p.m. to 8:30 p.m.\nFor more information about North Beach Village Design, call (954) 565-5790 or visit bit.ly/villagedesign.\nAbout North Beach Village Resort\nNorth Beach Village Resort comprises a collection of 15 mid-century modern boutique hotels located just a few miles inland from Fort Lauderdale Beach, just steps away from countless attractions including the historic Bonnet House. Each resort location offers a different flair, a different view of Fort Lauderdale , or a unique attraction. Resort guests can enjoy the amenities of a resort, like larger than life rooms and suites with kitchen appliances, and flat screen cable televisions, plus a practical living space that allows guests to vacation on their own terms. Additional North Beach Village Resort offerings include the relaxed yet distinguished Village Café, energizing Village Yoga, bicycle rentals for unguided escapades along the coast, a multitude of crystal blue pools, complimentary wifi, and more. Visit www.northbeachvillageresort.com .\nMEDIA RELEASE CONTACT\nLaurie Menekou , (954) 732-0754 (or)\nlmenekou@conceptual-communications.com\n releases/north-beach-village-resort-hosts-grand-opening-of-north-beach-village-design-featuring-exhibit-by-ftlauderdalesun-300157020.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151008/275409", "http://www.prnewswire.com/news-releases/north-beach-village-resort-hosts-grand-opening-of-north-beach-village-design-featuring-exhibit-by-ftlauderdalesun-300157020.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL24025&Transmission_Id=201510081825PR_NEWS_USPR_____FL24025&DateId=20151008", "https://www.facebook.com/SeanGarmanSculptures", "http://thehanabox.com/", "http://www.northbeachvillageresort.com/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T01:34:45.134+03:00", "highlightTitle": ""}