{"organizations": [], "uuid": "6664a4e59c63e5e86b2bc80c001f1a6fb3fdc92f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30279355/professional-driver-tanner-foust-partners-with-polaris-slingshot-and-mad-media-for-the-slingshot-x-video-series", "country": "US", "title": "Professional Driver Tanner Foust Partners with Polaris® Slingshot® and Mad Media for the Slingshot X Video Series", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Professional Driver Tanner Foust Partners with Polaris® Slingshot® and Mad Media for the Slingshot X Video Series - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6664a4e59c63e5e86b2bc80c001f1a6fb3fdc92f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30279355/professional-driver-tanner-foust-partners-with-polaris-slingshot-and-mad-media-for-the-slingshot-x-video-series", "ord_in_thread": 0, "title": "Professional Driver Tanner Foust Partners with Polaris® Slingshot® and Mad Media for the Slingshot X Video Series", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Polaris\nSlingshot X Vehicle Launches this Weekend at Biketoberfest in Daytona Beach, Fla.\nMINNEAPOLIS , Oct. 16, As part of a partnership between three-wheeled moto-roadster Polaris® Slingshot® and Mad Media, the driver for the highly anticipated film campaign Slingshot X was unveiled today: three-time U.S. rally cross champion and four-time X-Games gold medalist Tanner Foust . Additionally, the Slingshot X vehicle – a 2016 Polaris Slingshot SL – will be on display for the first time at Biketoberfest in Daytona Beach, Fla. from October 16 – 18.\nDetails of the Slingshot X film remain highly guarded outside of a film teaser released on SlingshotX.com . Fans can expect to be wowed with a film that will capture what the unique and exhilarating Slingshot roadster is capable of – especially with one of the most respected precision car drivers behind the wheel. The film is set to release later this year.\n\"When Polaris Slingshot and Mad Media approached me about being a part of this project, I was intrigued to say the least,\" Foust said. \"The second I laid my eyes on a Slingshot I knew it was going to be a unique machine to throw around. I'm stoked to show fans what this one-of-a-kind vehicle can do!\"\nFoust is a versatile and multi-talented driver known for his supreme car control and proven track record of podium placements, national championships and world records. In addition to his accolades on the race track, Foust translates his expertise on-camera as host for History Channel's Top Gear and performing stunts for various films, television shows and commercials.\nA video launched today introducing the Slingshot X vehicle that will be featured in the film and can be viewed at SlingshotX.com and on the Polaris Slingshot Facebook page . This new three-wheeled moto-roadster will also be on display throughout this weekend at Biketoberfest. The highly modified Slingshot X vehicle built by SlingshotX.com and SlingStreet will sport a custom turbo charged engine with paddle shifted automatic transmission, amongst other race-inspired modifications, making this one of the best handling and most powerful Slingshots ever built.\nVisit SlingshotX.com for more information surrounding the Polaris® Slingshot® and the official release date of \"SlingshotX\" the video!\nFor More Information:\nFacebook: https://www.facebook.com/SlingshotX/ or https://www.facebook.com/PolarisSlingshot/\nFollow on Instagram: @slingshot_x @polarisslingshot\nContact: slingshotxofficial@gmail.com\nAbout SlingshotX.com\nSlingshot X ( www.SlingshotX.com ) is the premiere web portal for Slingshot enthusiasts, builders, and owners. Based around the award-winning work of Mad Media - this content rich, interactive website is a premium entry point into the world of the three-wheeled roadster that took the world by storm in 2014.\nAbout Mad Media\nMad Media ( www.madmedia.com ) is a San Diego based marketing and creative agency, with in-house film and television production. They specialize in crafting authentic, culturally engaging brand messages, and deliver them across print, web, photography, and film platforms. Mad Media has been leading the online content revolution since 1995 producing major commercial, television, online content and viral film projects such as the Gymkhana series and XP1K series.\nAbout Polaris\nPolaris is a recognized leader in the powersports industry with annual 2014 sales of $4.5 billion. Polaris designs, engineers, manufactures and markets innovative, high quality off-road vehicles, including all-terrain vehicles (ATVs) and the Polaris RANGER ® and RZR ® side-by-side vehicles, snowmobiles, motorcycles and on-road electric/hybrid powered vehicles.\nPolaris is among the global sales leaders for both snowmobiles and off-road vehicles and has established a presence in the heavyweight cruiser and touring motorcycle market with the Victory ® and Indian Motorcycle ® and Slingshot ® brands. Additionally, Polaris continues to invest in the global on-road small electric/hybrid powered vehicle industry with Global Electric Motorcars (GEM), Goupil Industrie SA, Aixam Mega S.A.S., and internally developed vehicles. Polaris enhances the riding experience with a complete line of Polaris Engineered Parts, Accessories and Apparel, Klim branded apparel and ORV accessories under the Kolpin ® , Cycle Country ® and Pro Armor ® brands.\nPolaris Industries Inc. trades on the New York Stock Exchange under the symbol \"PII\", and the Company is included in the S&P Mid-Cap 400 stock price index.\nInformation about the complete line of Polaris products, apparel and vehicle accessories are available from authorized Polaris dealers or anytime at www.polaris.com .\nPhoto - http://photos.prnewswire.com/prnh/20151016/277757\n releases/professional-driver-tanner-foust-partners-with-polaris-slingshot-and-mad-media-for-the-slingshot-x-video-series-300161312.html\n ", "external_links": ["https://www.facebook.com/SlingshotX/", "https://www.facebook.com/PolarisSlingshot/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG30642&Transmission_Id=201510161355PR_NEWS_USPR_____CG30642&DateId=20151016", "http://photos.prnewswire.com/prnh/20151016/277757", "http://www.polaris.com/", "http://slingshotx.com/slingshot-x-video-teaser/", "http://www.prnewswire.com/news-releases/professional-driver-tanner-foust-partners-with-polaris-slingshot-and-mad-media-for-the-slingshot-x-video-series-300161312.html", "https://instagram.com/slingshot_x/", "https://instagram.com/polarisslingshot/?hl=en", "https://photos.prnewswire.com/prnvar/20151016/277757", "http://slingshotx.com/"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T22:16:03.340+03:00", "highlightTitle": ""}