{"organizations": [], "uuid": "e6e09b9fa4bf793598a32f962c2963dfa1e92564", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/29265-intergeo-world-s-leading-conference-and-trade-fair-makes-successful-return-to-stuttgart-new-event-planned-for-2019", "country": "US", "title": "INTERGEO: World’s leading conference and trade fair makes successful return to Stuttgart New event planned for 2019", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "INTERGEO: World’s leading conference and trade fair makes successful return to Stuttgart New event planned for 2019", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:50:00.000+03:00", "replies_count": 0, "uuid": "e6e09b9fa4bf793598a32f962c2963dfa1e92564"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/29265-intergeo-world-s-leading-conference-and-trade-fair-makes-successful-return-to-stuttgart-new-event-planned-for-2019", "ord_in_thread": 0, "title": "INTERGEO: World’s leading conference and trade fair makes successful return to Stuttgart New event planned for 2019", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Venues & Events INTERGEO: World’s leading conference and trade fair makes successful return to Stuttgart New event planned for 2019 INTERGEO: World’s leading conference and trade fair makes successful return to Stuttgart New event planned for 2019 Details Category: Venues & Events   16:50 How can large building projects such as Stuttgart 21 be managed successfully? How will unmanned aerial systems support the surveying sector in the future? And in the age of the Internet, what will tomorrow’s maps – and therefore the world – look like? From 15 to 17 September, leading national and international manufacturers, researchers and consumers came together at the world’s largest and most important event for geodesy, geoinformation and land management to answer these questions and lots more besides. \nHighlights on the agenda included urban planning, climate and civil protection, as well as the future of mobility and alternative energy production. After the inaugural event in 2004, Stuttgart was hosting INTERGEO for the second time and, with more than 16,500 fascinated visitors from 92 countries, it proved another total success in 2015. The entire spectrum of the geo sector was represented in Stuttgart. Over an area of around 31,500 square metres in three halls, 549 exhibitors gave visitors a comprehensive overview of the products and services on offer, while the conference took place at the ICS International Congress Center Stuttgart. A trends and media forum provided insights into the “geo-world” of tomorrow. In addition, the grounds outside were used as a flight zone for unmanned aerial systems, which are already playing a crucial role in the surveying sector. “We were delighted to welcome INTERGEO to Stuttgart’s new exhibition grounds, which were opened in 2007. With its versatile facilities and generously sized outdoor area, it provides the ideal setting for events such as INTERGEO with its trade fair and conference”, says Stefan Lohnert, Division Director Guest Events at Messe Stuttgart. The premiere at the new exhibition grounds was extremely well received by the event organisers – so much so, in fact, that they took the opportunity to announce there and then that INTERGEO would return to Stuttgart in 2019. “We were very impressed by the professional support on site. And the exceptional location allows us to welcome increasing numbers of international exhibitors and guests. With its close proximity to the airport and motorway, Messe Stuttgart offers our visitors outstanding accessibility”, says Christoph Hinte, CEO of HINTE Expo & Conference and organiser of INTERGEO. Related articles", "external_links": [], "published": "2015-10-08T18:50:00.000+03:00", "crawled": "2015-10-09T07:29:21.072+03:00", "highlightTitle": ""}