{"organizations": [], "uuid": "abf81f9f98f3836e8361c8b6d541398ba2a9974b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03473/villa-Val-d_Is_re_3473674k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-16.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travel-competitions/11934161/Telegraph-Travel-Awards-201516-win-a-30000-stay-in-Val-dIsere.html", "country": "US", "title": "Telegraph Travel Awards 2015/16: win a £30,000 stay in Val d’Isère", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Telegraph Travel Awards 2015/16: win a £30,000 stay in Val d’Isère - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T22:26:00.000+03:00", "replies_count": 0, "uuid": "abf81f9f98f3836e8361c8b6d541398ba2a9974b"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/travel/travel-competitions/11934161/Telegraph-Travel-Awards-201516-win-a-30000-stay-in-Val-dIsere.html", "ord_in_thread": 0, "title": "Telegraph Travel Awards 2015/16: win a £30,000 stay in Val d’Isère", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Luxury specialist Scott Dunn is offering one lucky winner a week’s holiday at the fabulous chalet Eagle’s Nest in Val d’Isère, with seven of their friends or family. The winner will experience the renowned Scott Dunn ski chalet service which includes a private chef to prepare breakfast, afternoon tea and gourmet dinners and a private host to serve morning tea in bed, pre-dinner Champagne and canapés and help organise everything from booking mountain restaurants for lunch to arranging ski lessons. Flights and transfers are included for the whole party and the trip is worth over £30,000. How to enter Follow this link to tell us about your favourite travel companies and destinations - and to enter the draw for one of 27 prizes . You will need to leave your name, telephone number and a valid email address. See here for full terms and conditions . The prize Scott Dunn’s iconic Eagle’s Nest is an award-winning chalet that offers a luxury ski holiday with a difference. Boasting arguably the best position in Val d’Isère, perched high above the village, it offers wonderful views, an indoor swimming pool, outdoor hot tub, sauna and steam room, but most importantly comes with a full team of Scott Dunn staff, so you don’t need to lift a finger. The lucky winner, along with seven of their friends or family, will spend a week at the chalet experiencing the renowned Scott Dunn ski chalet service which includes a private chef to prepare breakfast, afternoon tea and gourmet dinners and a private host to serve morning tea in bed, pre-dinner Champagne and canapés and help organise everything from booking mountain restaurants for lunch to arranging ski lessons. Guests will also have access to Scott Dunn’s in-resort driver service to whizz them to and from the slopes each day. Those travelling with children also have the opportunity to add on a private nanny or spaces at Scott Dunn’s Explorers kids club (subject to extra charge) if they desire; both will look after children from four months upwards. Scott Dunn’s dedicated family team can also pre-arrange all baby equipment for our youngest guests, while children taking ski lessons are driven to ski school by our drivers to save their little legs in heavy ski boots. Flights to Geneva and airport transfers to Val d’Isère are included for all eight guests For more information on Scott Dunn and their ski holidays, please visit scottdunn.com/ski or call 020 8682 5050 The prize provider Scott Dunn is an award-winning luxury tour operator which has been creating tailor-made holidays and honeymoons to amazing destinations all over the world for 30 years. Their Travel Consultants each spend a month a year seeking out the best properties and fine-tuning their local knowledge so they can craft holidays around their guests. Scott Dunn also operate their own luxury ski chalets in the Alps, and family villas in the Mediterranean sun, which come complete with a private chef, host, and nanny if required. As we as this, Scott Dunn have fabulous Explorers kids club at some of the finest hotels in Europe, the Maldives and Thailand which look after little ones from 4 months upwards. Terms and conditions The prize is for up to 8 people staying for 7 nights in Chalet Eagle’s Nest either during the winter season 2015/16 (if space still available) or during the 2016/17 season. Should the prize be taken in the 2016/17 season, the winner will not be able to make their booking until 1st October 2016. The prize includes breakfast on 7 days and supper on 6 evenings. The prize also includes seats on designated flights from London and return shared transfers to resort. Childcare, lift passes and ski hire/tuition are excluded (all can be arranged by Scott Dunn at additional cost). Additional guests (up to 4) may be added to the booking at an additional cost. Dates over Christmas, New Year, Easter and other school and public holidays are excluded and all bookings are subject to availability. In exceptional circumstances, Scott Dunn reserves the right offer an alternative chalet of equivalent value. No credit or cash alternative will be offered if the prize not taken. Telegraphtravel", "external_links": [], "published": "2015-10-16T22:26:00.000+03:00", "crawled": "2015-10-16T16:46:13.775+03:00", "highlightTitle": ""}