{"organizations": [], "uuid": "bc4adfeabfcf3cdb096f110463ab609d34e2f953", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/3ccd7a2098a4d0f4ddf1273add4c1759", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-ideas/the-luxurious-private-island-getaway-practically-on-our-doorstep/story-fnjpj945-1227572413335?from=public_rss", "country": "IL", "title": "Is this better than Bora Bora?", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Is this better than Bora Bora?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T01:12:00.000+03:00", "replies_count": 0, "uuid": "bc4adfeabfcf3cdb096f110463ab609d34e2f953"}, "author": "", "url": "http://www.news.com.au/travel/travel-ideas/the-luxurious-private-island-getaway-practically-on-our-doorstep/story-fnjpj945-1227572413335?from=public_rss", "ord_in_thread": 0, "title": "Is this better than Bora Bora?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email a friend \nTOM Hanks’ character and his buddy Wilson had a few issues to deal with while stranded on that uninhabited island in the Oscar-winning film Castaway . \nBut if they had any idea of what lay only a short speed boat ride from their lonely island home, there would have been another problem: a serious case of FOMO. \nAs we jump from the boat into the stunningly blue water and swim through swarms of tropical fish toward Monuriki, the still preserved island made famous by the 2002 film, you can just make out the shell outline of words HELP ME left on the beach as an ode to its fictional inhabitants. \nWading to shore and strolling along the practically untouched island’s clean white sand, exploring its cool green forestry centre and marvelling and the mountainous rock centrepiece that gives the land mass its recognisable shape, you start to wonder why those shells have been placed to form of that desperate plea in the first place. \n“‘Help me’? Why would anyone want to leave this paradise?” we wonder. And that’s when we remember where we’ve come from. The real Castaway island, which you can visit from Likuliku Resort. Likuliku Resort, on nearby Malolo Island. \nMonuriki Island is every bit as stunning as the film made it out to be, and then some. But what those tricky cinematographer’s cleverly framed out was the luxurious resort islands it neighboured. \nOne of those is Malolo island which hosts Fiji’s luxurious couple’s, adults only escape, Likuliku Lagoon Resort. \nIt’s at Likuliku’s fine dining restaurant I was earlier tossing up between fresh crab omelet or honeycomb pancakes for breakfast. Later, I contemplated an afternoon of either snorkelling around the coral reef marine sanctuary that is the island’s front yard, or a luxury massage at its oceanfront spa. \nIt’s also the only resort near Australia that offers the same celebrity-favoured overwater bures that more well known islands such as Bora Bora in French Polynesia are known for. \nWhile the huts that tower over crystal clear waters are what has helped Bora Bora earn its reputation as “ the most beautiful place on earth ”, for us geographically alienated Australians, the long trip with a few stops is a bit much. It’s basically Bora Bora, minus half a day of travel time. \nIf relaxation and beauty is what you’re after in a luxury escape, you may waste a whole lot of precious relaxing time getting there, and let’s face it, when it comes to soaking up an island getaway, every (happy) hour counts. \nAfter just a quick three or four hour flight from practically anywhere on Australia’s east coast and a stunning speed boat, chopper or sea plane trip after that, Aussies with expensive taste could be looking out from their luxury overwater bures on this beautiful private island over the sparkling, impossibly blue waters of Fiji. \nThe 10 unique and spacious overwater bures sit above the coral reef and allow access from your own private balcony straight into the ocean. If snorkelling from your balcony’s not your thing you can watch the fish through the floor. The 10 bures are booked out just about all year round, so save up and book in. \nWith prices starting from $570 per night and more than triple that for the overwater experience, that aforementioned expensive taste is essential, but it’s luxury like I’ve never experienced before. \nWhile Fiji is the home of family friendly holidays where in-house nanny services and amazing Kids Club options make some of the island nation’s resorts the hottest tickets going, on this side of spectacular Malolo island, you won’t see any small children or nannies but the staff will make sure you’re just as well looked after. \nThanks to the wide-smiling staff, who are all native Fijians apart from the one high profile Australian chef, it’s the kind of place you’re happy to call home as soon as you land. \nThe Fijians restaurant is run by executive chef Shane Watson, previously of Perth, and offers a changing a la carte menu with dishes dependent on what’s fresh in the surrounding waters or picked from Shane’s impressive herb garden that day. \nFor active types the best view is from the island’s peak after a dawn hike, and for those interested in nature, the very educational medicine walk and a visit to the rare resident iguanas is a treat. Seriously stunning sunsets come free of charge, or with the all inclusive price like meals. The beachfront bar. \nAs well as the trip to what locals sometimes call Tom Hanks Island thanks to the attention the Castaway star attracted to the area, for those after even more of an escape, there’s nearby Honeymoon Island which couple’s can have all to themselves, stand up paddle boarding, trips to the local village, and plenty of island hopping to be had. \nAfter the day trip to Monuriki, relaxing with a cocktail at the resort’s beach bar looking over at the impossibly pink sunset, you can kind of understand why Mr Hanks wanted so desperately to get off that island. Or at least why he signed up for the gig in the first place. \nThe writer was a guest of Likuliku Lagoon Resort and Malolo Island Resort . Holiday Picks", "external_links": [], "published": "2015-10-17T01:12:00.000+03:00", "crawled": "2015-10-17T01:22:46.023+03:00", "highlightTitle": ""}