{"organizations": ["IBM"], "uuid": "df96415b0e2ffd807e3cb7c92300fe465fd62ced", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/wallst2_600x400.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13330849/1/stocks-slide-as-ibm-leads-tech-sector-lower.html?cm_ven=RSSFeed", "country": "US", "title": "Stocks Slide as IBM Leads Tech Sector Lower", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Stocks Slide as IBM Leads Tech Sector Lower", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:14:00.000+03:00", "replies_count": 0, "uuid": "df96415b0e2ffd807e3cb7c92300fe465fd62ced"}, "author": "", "url": "http://www.thestreet.com/story/13330849/1/stocks-slide-as-ibm-leads-tech-sector-lower.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Stocks Slide as IBM Leads Tech Sector Lower", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nStocks were lower by late morning Tuesday as a disappointing quarter from IBM ( IBM - Get Report ) pulled tech stocks lower but better-than-expected earnings from Verizon ( VZ - Get Report ) boosted telecoms. \nThe S&P 500 was down 0.04%, the Dow Jones Industrial Average was flat, and the Nasdaq fell 0.29%. \nIBM shares fell 5.3% after the company reported a sharp decline in quarterly sales and reduced its full-year profit guidance. The tech giant reported a 14% drop in sales in its third quarter, missing analysts' estimates. IBM said it expects full-year net income of $14.75 to $15.75 a share, down from previous guidance of $15.75 to $16.50. \nMajor tech giants such as Amazon ( AMZN - Get Report ) , Alphabet ( GOOGL - Get Report ) , Alibaba ( BABA ) and Netflix ( NFLX ) sold off in sympathy. The Technology SPDR ETF ( XLK ) fell 0.3%. \nVerizon climbed more than 1% after beating earnings and sales estimates in its third quarter. The telecom giant earned $1.04 a share, 2 cents above estimates, while revenue jumped 5% to $33.16 billion. Increased revenue was driven by growth in Fios and Verizon's wireless business. \nIndustry peers AT&T ( T ) , Vodafone ( VOD ) and Level 3 Communications ( LVLT ) climbed, though competitors Sprint ( S ) and T-Mobile ( TMUS ) moved lower. \nOther companies reporting on Tuesday included Travelers ( TRV ) which released a better-than-expected third-quarter report. Net income of $2.97 a share beat estimates by 70 cents, while revenue jumped 2.7% to $6.19 billion. \nHarley-Davidson ( HOG ) fell more than 7% after a disappointing quarter and reduced full-year forecasts. The motorcycle manufacturer expects to ship 265,000 to 270,000 units for the full year, down from at least 276,000, as it faces an increasingly competitive environment. Third-quarter net income of 69 cents a share was flat from a year earlier and missed estimates by 9 cents. Harley-Davidson said it would cut jobs as a result of weakened demand, though declined to detail the extent of layoffs. \nSonic Restaurants ( SONC ) added nearly 5% after same-store sales in its fourth quarter increased 7.3%, a significant increase in growth from a 6.1% increase last quarter. Quarterly profit of 43 cents a share beat estimates by a penny. \nUnited Technologies ( UTX ) added 2% after announcing a $12 billion share buyback program and a better-than-expected third quarter. Net income of $1.67 a share bested estimates of $1.55. However, revenue came in short estimates as currency exchange ate into the topline and amid engine-delivery delays over the quarter. \nUnited Airlines ( UAL ) named Brett Hart, general counsel, as its acting CEO while CEO Oscar Munoz recovers from a heart attack. Munoz was hospitalized late last week and his expected recovery time has not been disclosed. \nIn deals news, SanDisk ( SNDK ) jumped more than 7% on reports it is in advanced talks to sell itself to Western Digital ( WDC ) . A deal could be announced as soon as this week, according to Bloomberg . Previous reports noted that SanDisk had been in deal talks with both Western Digital and Micron Technology . \nTeam Health Holdings ( TMH ) jumped 20% after receiving, and rejecting, a $5 billion bid from AmSurg ( AMSG ) . The cash-and-stock offer valued the healthcare provider at $71.47 a share, a significant premium to Monday's close of $52.50 a share. \nYum! Brands ( YUM ) jumped 5% after it said Tuesday it would separate its Chinese and U.S. businesses after several quarters of declining sales overseas. Chinese revenue has taken a big hit after a food scandal mired KFC's suppliers last year. Activist investor and board member Keith Meister believes a spin-off could be worth $7 billion, Bloomberg reports. \nFresh Market ( TFM ) climbed 4% after trading resumed following a brief halt. Trading had been paused as the company announced it was conducting a strategic review of its business, including a potential sale. The grocery chain has hired JPMorgan as its financial adviser. \nWeight Watchers ( WTW ) extended gains on Tuesday after rocketing more than 100% higher a day earlier. Shares had doubled their value after Oprah Winfrey took a 10% stake in the company . Winfrey made more than $70 million over Monday's session on the new position. \nGeneral Electric ( GE ) shares were on watch after it began its offer to exchange shares of GE for Synchrony Financial ( SYF ) stock at a 7% discount. Synchrony will become a stand-alone savings and loan company following the exchange offer. But despite the enticing offer, some argue holding onto GE shares will benefit investors in the long run. \nHousing starts were a bright spot on Tuesday. Construction on new homes in the U.S. climbed 6.5% to 1.21 million in September, returning to June's level at an eight-year high. Economists had expected September starts to total 1.14 million. \n\"The September starts report suggests that the U.S. housing recovery might be regaining its footing, after the brief relapse during the summer months,\" Millan Mulraine, deputy chief U.S. macro strategist at TD Securities, wrote in a note. \"Moreover, the strong performance in September should provide a modest lift to overall economic activity.\" Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-10-20T19:14:00.000+03:00", "crawled": "2015-10-20T19:26:46.467+03:00", "highlightTitle": ""}