{"organizations": [], "uuid": "db792eb2fe328fd92b597cd0cb01ca72df2a0000", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/9/7/8/5/image.related.StuffLandscapeSixteenByNine.620x349.16ya2h.png/1444356254534.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/nz/72143225/Big-views-from-the-top-of-central-Canterburys-Big-Ben-range", "country": "AU", "title": "Big views from the top of central Canterbury's Big Ben range", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Big views from the top of central Canterbury's Big Ben range", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T19:00:00.000+03:00", "replies_count": 0, "uuid": "db792eb2fe328fd92b597cd0cb01ca72df2a0000"}, "author": "Pat Barrett", "url": "http://www.stuff.co.nz/travel/destinations/nz/72143225/Big-views-from-the-top-of-central-Canterburys-Big-Ben-range", "ord_in_thread": 0, "title": "Big views from the top of central Canterbury's Big Ben range", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Big views from the top of central Canterbury's Big Ben range PAT BARRETT Last updated 05:00, October 12 2015 Pat Barrett \nRakaia Valley and Lake Coleridge as seen from Big Ben. \nOut the back of the Rakaia Gorge in central Canterbury is a relatively new accessway on to the southeastern end of the Big Ben Range and Big Ben, a large rounded summit at 1416m elevation. \nHere the river broadens into a large flood plain and the foothill ranges fall back, granting the river space to meander. \nThis accessway is known as the Dry Acheron Track and its formation through private land to reach the toe of the range provides some great opportunities for hikes in a remarkable setting. \nI decided to take the plunge and head on through the lower Dry Acheron Stream early one winter morning when the snow had retreated to the tops and was not coating the flats as has been the case many times this season. \nNot that I mind a bit of snow, there is plenty above me I see on the tops, but heavy snow on the flats makes for heavy, and slow, going. \nWith this in mind I can ratchet up the pace and make a beeline, in a winding sort of a way, up this very attractive stream which flows through a series of mini-gorges, open space, and terraces as it drains the Big Ben Range. \nPulling up at the base of the hill I survey the steep incline above, shed a few layers as the day has warmed considerably, down some liquid and forge on up. A rough trail climbs the face, and it's poled, which makes life a little easier. \nThe good thing about steep slopes is that if you can keep the pace steady you get up really fast and into the view zone before too many gasps. This one is like that and soon gives way to a very pleasant mid-slope plateau at around 1000m where a small knoll offers a resting stop and a sweeping view of the Rakaia Valley. \nThe route up from Dry Acheron on to Big Ben. Image: Pat Barett \nIt was worth coming even this far for the view here which ranges all the way from Methven, past Mt Hutt, up the Rakaia to the Main Divide, over to Lake Coleridge and into the Wilberforce. Ad Feedback \nHigher up it just gets better, the snow zone is reached, and a false summit, before the final long easy slope, again through snow, to the range crest and Big Ben. \nLike its name, the view from here is huge and now covers much of the Canterbury Plains, all of the Rakaia, Coleridge, and Wilberforce basins and the Big Ben Range, which rolls away to the northwest like a frozen wave of surf. \nThe only problem is the wind is scything in from the west, cutting through my layers and making any lengthy time on the exposed summit untenable. \nSeeking shelter to the lee side, I take lunch and try to keep warm, which is a faint hope. \nREAD MORE:", "external_links": [], "published": "2015-10-11T19:00:00.000+03:00", "crawled": "2015-10-11T19:27:55.978+03:00", "highlightTitle": ""}