{"organizations": [], "uuid": "ea3e92fc2a97b51cab93c6cb54d402d4dd88e470", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cheeseweb.eu", "main_image": "http://cdn4.cheeseweb.eu/wp-content/uploads/2015/10/space-center.jpg", "site_section": "http://feeds.cheeseweb.eu/cheeseweb-eu", "section_title": "Slow Travel in Europe and Beyond | CheeseWeb", "url": "http://cheeseweb.eu/2015/10/voyage-space-french-guiana/", "country": "US", "title": "A Voyage to Space, in French Guiana", "performance_score": 0, "site": "cheeseweb.eu", "participants_count": 1, "title_full": "A Voyage to Space, in French Guiana", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:18:00.000+03:00", "replies_count": 0, "uuid": "ea3e92fc2a97b51cab93c6cb54d402d4dd88e470"}, "author": "Alison", "url": "http://cheeseweb.eu/2015/10/voyage-space-french-guiana/", "ord_in_thread": 0, "title": "A Voyage to Space, in French Guiana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "» Slow Travel » France » French Guiana, France » A Voyage to Space, in French Guiana A Voyage to Space, in French Guiana By alison - October 2, 2015 This entry is part 1 of 7 in the series French Guiana . \nFrench Guiana’s Space Centre offers visitors a behind the scenes look at what it takes to launch satellites into space. If you’re lucky, you may even get to see a rocket launch, like I did. \nWhen I was a kid, I was fascinated by space. My best friend and I watched the movie Space Camp until we could recite the dialogue by heart. I watched countless hours of Star Trek (and all the various spin-offs) with my Dad. I visited Kennedy Space Centre and the US Space and Rocket Centre in Huntsman, Alabama, (home of the real Space Camp), on holidays with my family. I still remember the exact moment I heard about the Challenger explosion and meeting Roberta Bondar, Canada’s first female astronaut, was the highlight of my junior high-school life. \nBut somehow, over the years, my obsession with space faded. Or so I thought, until I learned there was a slim chance I could see a live rocket launch, during my stay in French Guiana. Suddenly I remembered that childhood fascination with the great unknown, beyond Earth’s atmosphere – The final frontier – Space. \nLittle did I know, before arriving in French Guiana , Kourou is one of the most important rocket launch sites in the world and I was going to get a behind the scenes look at how they get rockets into space. \nIf you’re anything like me, the first question you’re probably asking is “What has space got to do with French Guiana?” This tiny, jungle-filled region seems an unlikely setting for Europe’s primary space station. But French Guiana was chosen as a launch site back in the 1960s, for several very important reasons. \nFirst, it’s close to the equator, at 5° north, meaning a rocket launch can take full advantage of the Earth’s rotation. It also has more than 3500km of open coastline, meaning rockets have a clear flight-path with little risk to humans. Finally, French Guiana is safe from natural disasters; there are no major earthquakes, cyclones, or volcanic activity here. The Space Museum (Musée de L’Espace) is the welcome point to the Guiana Space Centre \nFrench Guiana’s Space Centre , is incredibly open to the public. In fact, it’s one of the region’s top tourist attractions. In addition to the Space Museum (Musée de L’Espace) , visitors can join 3-hour guided tours of the Space Centre , throughout the week. The tours are free, but require prior reservation and you must present a national ID card or passport upon arrival. Tours are given in French, but you can ask ahead to organise a tour in another language. \nArriving at the Space Centre, I eagerly boarded the bus to learn what it was all about. \nWhat struck me immediately and consistently, throughout my visit, is how open the Space Centre is – both in terms of physical access, but also access to information. To the people of French Guiana, it’s perfectly normal to go and watch a rocket launch from one of several (safe) public viewing areas. \nOnboard the bus, no question about the Space Centre or its activities seemed off-limits. Even when asked about the environmental impact of the rocket launches, ample information was provided. Numerous studies are being conducted, on air and water quality, as well as the impact to fish, birds, and mammals, and steps are being constantly taken to lessen the impact on French Guiana’s precious natural resources . There are even monthly tours, guided by a naturalist , through the Space Centre’s savannas, to discover the wildlife calling this area home. The Space Centre is big and very open to the public. \nThe second thing I noted is the site is big – really big, taking up a long stretch of land between Kourou and Sinnamary; hence the need for a bus. Much of the road we travelled is also public and only closes during a launch. It’s only when we entered the building and launch areas, we had to pass through security checks. \nAs with all things science (and government) related, there are a lot of acronyms involved. In French Guiana, there’s the Guiana Space Centre itself, the CSG (Centre Spatial du Guyane). But the CSG is a partnership between many other agencies. There’s the French space agency, the CNES, or Centre National d’Etudes Spatiales ; the European Space Agency (ESA); and Arianespace , the commercial contractor that actually gets rockets and their cargo into space. Yeah, it’s complicated. \nYou may also be wondering why Europe needs a space centre at all. The main reason is satellites – for mapping, for telecommunications, and for tracking weather and natural disasters. The rockets launched from French Guiana are unmanned and contain multiple satellites, depending on the size and type of rocket. These satellites are built elsewhere and sent to French Guiana to install inside the rockets for launch. \nWe disembarked the bus to visit one of the launch centres, Centre de Lancement N°3, to learn more about the launch process. Little did I know, I’d soon get to see it firsthand. Centre de Lancement N°3 is a reinforced bunker, close to the launch site. From here, the rockets are monitored and controlled until they leave the ground. \nFrom the launch centre, we proceeded to tour the various launch sites. There are three types of rocket launchers at the CSG: The Vega light launcher, the Soyuz medium launcher (in partnership with the Baikonur Cosmodrome in Kazakhstan), and the Arian 5 heavy launcher. The Soyuz medium launcher is in partnership with Russia. All of the signs are in Russian and French. \nIn the distance, our guide pointed out the launcher for the Arian 5, which, hopefully would be launching in just a few days. Two of the launch pads, including Ariane 5 (top). \nFlavia, my expert guide from Guyane Tourisme , looked at me with a determined gleam. “I’m going to ask if we can watch the launch from Salle Jupiter,” she said. As I didn’t yet know exactly what Salle Jupiter was, I nodded and smiled, envisioning one of the distant public viewing areas. \nAt the end of the tour, we returned to the Musee de L’Espace, and headed upstairs. “Welcome to Salle Jupiter,” said our tour guide. \nI looked around the room. We were in mission control. It was all of my childhood space fantasies come to life. While I stood gaping like a kid in a candy-store, Flavia was off working her magic on the phone. Salle Jupiter on my first visit, and on my second. Things get pretty busy during a launch! \n“I’ve gotten us a meeting with the Press Officer,” she smiled, and within minutes we were standing before the woman in charge. While she couldn’t yet guarantee us a spot, she was cautiously optimistic she could get us in. \n“Now we just have to cross our fingers that the launch will actually happen,” Flavia told me. \nA launch can be postponed for any number of reasons, from bad weather and visibility, to technical failures. Postponing a launch is costly, but not as costly as losing an entire rocket and its cargo. Back in 1996, that’s exactly what happened to the first Ariane 5 rocket. Only 37 seconds into the launch, the rocket exploded. The rocket and its cargo were valued at over 500 million USD. That’s a very expensive accident. \nThe rocket launch we hoped to see, the third Arian 5 launch of 2015, had already been postponed, from July 8 th . It could easily happen again. \nThroughout my week in French Guiana, Flavia and I watched the weather reports. The morning of the launch, on August 20th, we were on Ile Royale , literally watching the sky for clouds. At 1pm, when we were evacuated from the island, the launch was still on. \nWe made our way back to the CSG, this time through heavy security. As we still had no official security clearance, it took a bit of sweet-talking but eventually we made it inside. All along, we both believed we’d be sitting in the seats reserved for the general public. \nThat’s right; if you plan ahead and are extremely lucky, you can watch a rocket launch from Salle Jupiter. Priority is given to the companies who are launching the satellites and the various companies and agencies involved in each launch. However, any remaining seats are available to the public on a first-come-first-served reservation basis. \nWe however, were directed upstairs to the press centre. Once there, we were given a wifi code, and simultaneous translation headsets, and we were ushered into a small room – our private viewing booth. Our own private viewing booth above Salle Jupiter \nFlavia looked at me with surprise. “Bloggers must be lucky. With all the times I’ve been here for a launch, we’ve never had one of these rooms.” I was getting giddy with excitement. \nInstalled in our booth, with wifi and coffee, I put on my headset. I was surprised to hear a live play-by-play of exactly what was happening inside the glass bubble on the floor below. On the giant screens before us, was a live feed of the rocket and launch pad, a countdown to launch, and a projection of the flight path the rocket would take around the equator before leaving Earth. \nIn addition to the play-by-play, we were shown videos telling us about the rocket’s payload – in this case, two satellites: the Star One C4, a telecommunications satellite for South America, built in Brazil, and MSG-4, a meteorological satellite covering Europe, Africa, and Eastern South America, for European agency EUMETSAT . The videos showed us how the rocket was constructed, how the satellites were installed, and how these satellites would do their vital jobs once in orbit. \nAs we crept closer to launch time, a countdown began on one of the monitors in our booth and activity in the glass bubble ramped up. Immediately before the launch, doors opened onto the balcony where we could watch the launch with our own eyes. There was plenty to entertain us before we exited the big red doors to watch the launch in person. \nHearing the final countdown was a thrill. However, for all of the effort, planning, and excitement (not to mention money) that goes into a launch, what you can see from Earth is extremely short, especially when there is low cloud cover, as there was for us. \nStill, nothing can quite describe the feeling of watching something on land head into space. \nWhen the rocket disappeared into the clouds, I assumed the show was over. In fact, one of the most interesting phases of our visit had just begun. Although we could no longer see the rocket, we were presented with a computer simulation of exactly what was happening to the rocket in space. Arianespace uploads these videos to their Youtube channel , so you can actually watch the entire 1.5 hour video of the VA 224 launch we watched live. Watching the satellites launch on the computer demo. \nOver the next minutes, we watched as the rocket left Earth’s atmosphere, jettisoned its boosters, and prepared to separate the two satellites. After about 28 minutes, the first satellite was successfully separated and, after 40 minutes, the second satellite went into orbit. The atmosphere in Salle Jupiter went from tense to celebratory in seconds. \nSince the 1980s, Arianespace has launched more than 500 satellites into orbit and more than 70 are waiting for their own trip into space. \nThe next time you use your GPS, check the weather, or look at satellite images of your next travel destination, think of little French Guiana, on the coast of South America, and the huge role they play in getting that information to you. Salle Jupiter in Lego at the Space Museum – because Lego is almost as cool as space. \nWhen you plan your visit to French Guiana, don’t miss a trip to the Guiana Space Centre. You never know, you may just get to experience one of these incredible rocket launches for yourself. \nI’d like to extend a huge thank you to Flavia, for her determination to get us into Salle Jupiter for the launch, and for sharing her beautiful region with me throughout my week in Guyane. My travel to French Guiana was sponsored by Guyane Tourisme and Atout France Belgium . As always, all opinions remain my own.", "external_links": [], "published": "2015-10-02T07:18:00.000+03:00", "crawled": "2015-10-02T16:48:47.655+03:00", "highlightTitle": ""}