{"organizations": [], "uuid": "30ff9dbeb02dd2145b6581e40e33e86e36b9076c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/lifestyle/travel-tourism/", "section_title": "Travel News:Travel and Tourism,Latest Travel News,Tourism News Today,Latest Travel News Articles | The Financial Express", "url": "http://www.financialexpress.com/article/lifestyle/travel-tourism/culture-alley/152881", "country": "IE", "title": "Culture alley", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Culture alley | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T08:03:00.000+03:00", "replies_count": 0, "uuid": "30ff9dbeb02dd2145b6581e40e33e86e36b9076c"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/lifestyle/travel-tourism/culture-alley/152881", "ord_in_thread": 0, "title": "Culture alley", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Nicky Hilton finds married life 'amazing' Whoopi Goldberg's tour bus goes up in flames Adam Lambert has 'no beef' with Demi Lovato, Nick Jonas Rajasthan International Folk Festival\nWhat: Rajasthan International Folk Festival, which helps promote local musicians and vocalists of Rajasthan, attracts thousands of music lovers to Jodhpur every year. At this year’s edition, you can expect foot-tapping music, dance and poetry. This year’s line-up includes a thumri recital by classical and contemporary musician Suchismita Das, traditional and classical Maand songs assembled and sung by Parveen Sabrina Khan, among others. Also present will be 1991 Grammy-winner Yossi Fine, a Jewish Israeli bassist; Kheta Manganiyar, Mahesh Vinayakram and many other Rajasthani musicians.\nWhere: Jodhpur\nWhen: October 23-27\nTata Literature Live!\nThe Mumbai LitFest\nWhat: The sixth edition of Mumbai’s largest international literary festival brings together an eclectic mix of the world’s most notable authors. Over 120 celebrated writers and thinkers from over 14 countries will participate in the four-day festival this year. Among them are Egyptian-American Mona Eltahawy, who is creating waves with her recent book, Headscarves and Hymens; Germaine Greer, one of the pioneers of the international feminist movement; Kiran Nagarkar, Indian novelist and playwright; Hussain Zaidi, investigative journalist and author of Dongri to Dubai; and author Vikram Seth, among others. Performances related to literature—plays, performance poetry, storytelling with music—will also be an integral part of the festival.\nWhere: NCPA, Nariman Point, and Prithvi Theatre, Juhu, Mumbai\nWhen: October 29-November 1\nDharamshala International\nFilm Festival\nWhat: Undeterred by the fact that Dharamsala, Himachal Pradesh, has no cinemas, the first edition of Dharamshala International Film Festival was held in November 2012. The festival aims to bring high-quality, independent films along with their filmmakers from around the world to Dharamsala and create a cultural platform to engage all communities that inhabit the area. The fourth edition will not only showcase local, national and international films and documentaries, but will also include conversations, workshops and masterclasses with directors.\nWhere: Mcleodganj, Himachal Pradesh\nWhen: November 5-8\nInternational Film Festival of India\nWhat: With a focus on promoting Indian cinema globally, the International Film Festival of India (IFFI) has emerged as one of the biggest film festivals of Asia. This year’s edition will showcase the best of Indian and world cinema in different sections like Indian panorama, Indian and foreign retrospectives, tributes and special focus. In addition to this, film students and lovers will also have the opportunity to interact with directors, producers and technicians of Indian and world cinema at workshops and masterclasses, which will focus on different aspects of filmmaking.\nWhere: Goa\nWhen: November 20-30\nPrithvi Theatre Festival\nWhat: Named after the legendary actor Prithviraj Kapoor, the annual celebration of theatre, Prithvi Theatre Festival, was first held in 1983 and is an annual feature of the Prithvi calendar, starting usually in early November and running anywhere from a week to a month. The focus of the festival is Indian and international theatre, showcasing groups from India and across the world.\nWhere: Mumbai\nWhen: To be announced\nHornbill Festival\nWhat: To encourage inter-tribal interaction and to promote the cultural heritage of Nagaland, the government there organises Hornbill Festival every year in the first week of December. Visitors can enjoy colourful performances, craft exhibitions, sports, food fairs and games during the 10-day celebrations. Traditional arts, including paintings, wood carvings and sculptures, will be on display. Festival highlights include herbal medicine stalls, flower shows, Naga wrestling, musical concerts, among others.\nWhere: Naga Heritage Village, Kohima\nWhen: December 1-10\nComic Con India\nWhat: A few years back, to avoid the expense of travelling abroad to a comic convention, a group of young people in Delhi decided to create one on their own in their home city. With that mission, Comic Con India was formed and it has now grown to multiple events across the country. The fest attracts pop culture fans from across the country. This year’s chapter of Comic Con, to be held in New Delhi, will cater not only to fans of comics, but of gaming, movies and television as well.\nWhere: NSIC Grounds, Okhla, New Delhi\nWhen: December 4-6\nSunburn Goa\nWhat: Held in late December, Sunburn Goa is the perfect destination for those looking to immerse themselves in world-class electronic music. Not only does it provide the perfect soundtrack to round off the year, but festival-goers can also let loose with a range of adrenaline-powered activities such as bungee jumping, volleyball and zorbing—the ultimate holiday experience.\nWhere: Vagator, Goa\nWhen: December 27-30\nKochi-Muziris Biennale\nWhat: The third edition of Kochi-Muziris Biennale will have artist Sudarshan Shetty as its artistic director and curator. The 2016 biennale will look back at aspects of a ‘shared past’ and work towards the vision of a ‘People’s Biennale’. There will also be the ‘Student’s Biennale’, a pilot programme for students of government-run art colleges. Led by 15 young curators from across the country, Student’s Biennale seeks to extend and\nstrengthen art educational practices and infrastructure in India. The biennale will also have performances, collateral events and interactive projects.\nWhere: Multiple venues in Kochi, Kerala\nWhen: To be announced\nOktoberfest Goa\nWhat: Since its inception in 2011, Oktoberfest Goa has seen EDM come alive, with fans joining from across the globe in huge numbers. The fest features some of the best DJs and live acts from across the country and abroad. The fifth edition of the fest promises to be a cracker of an event, with music that is sure to get you dancing, a wide range of beers to tickle anybody’s tastebuds, food stalls with mouth-watering local and continental delights, and a flea market as well.\nWhere: Baga, Goa\nWhen: November 6-8\nPushkar Fair\nWhat: Pushkar Fair, visited in droves by foreigners and Indians alike, is one of the largest gatherings for a fair in the world. Held in the month of Kartik, or November, it is one of India’s highly-rated travel experiences, attracting more than 11,000 camels, horses and cattle, and visited by over four lakh people over a period of around 10 days.\nWhere: Pushkar, Rajasthan\nWhen: November 15-25\nIndian art fair\nWhat: India Art Fair returns for its eighth edition, bringing the best art galleries in the subcontinent and beyond. The fair provides a platform not only to established international galleries, but to emerging talent from south Asia as well. You can expect a breadth of modern and contemporary art practices, including paintings, sculptures, new media, installations and performance art, among others.\nWhere: NSIC Grounds, Okhla,\nNew Delhi\nWhen: January 28-31, 2016\nRamlila of Ramnagar\nWhat: The 31-day-long Ramlila of Ramnagar, Varanasi, is world-famous. Over a million pilgrims arrive annually for the vast processions and performances organised by religious leader Kashi Naresh. Different episodes from the Ramayana narrative are performed at different locations around Varanasi. The spectators move along with the actors from one place to another. But for those Delhi residents who can’t make it to Varanasi, there is help at hand, as the Indira Gandhi National Centre for the Arts in the capital is screening all the performances daily at 6pm for 30 minutes, coinciding with the actual Ramlila at Ramnagar.\nWhere: Ramnagar, Varanasi; and Indira Gandhi National Centre for the Arts, New Delhi\nWhen: Till October 27\nJaipur Literature Festival\nWhat: Prominent names set to appear at the ninth edition of Jaipur Literature Festival include poet, novelist and essayist Margaret Atwood, author Ruskin Bond, photographer Steve McCurry, Harvard historian Niall Ferguson, and Britain’s Stephen Fry, among others. The 2016 festival explores global issues such as migration, privacy and navigating change. Homi Bhabha from the Mahindra Humanities Centre will curate sessions around the theme of privacy in the contemporary world. There will also be a focus on the rich oral heritage of Rajasthan with a session on the Kaavad traditions of illustrated storytelling and performance.\nWhere: Diggi Palace, Jaipur, Rajasthan\nWhen: January 21-25, 2016\nKala Ghoda Arts Festival\nWhat: Kala Ghoda Arts Festival is a kaleidoscope of music, dance, theatre, street stalls and workshops, among others. Now in its 17th year, it is a community celebration of arts within one of the most beautiful and historic precincts of Mumbai, the Kala Ghoda Art District. The festival has sections like visual arts, food, literature, films and a children’s section as well. Also, many heritage walks are organised to give people an insight into Mumbai’s heritage. Over the years, the festival has grown exponentially, drawing over 1.5 lakh people from all over the city and beyond to over 350 events spread over nine days.\nWhere: Multiple venues in Mumbai\nWhen: February 6-14, 2016\n 18, 2015 12:03 am", "external_links": [], "published": "2015-10-18T08:03:00.000+03:00", "crawled": "2015-10-25T09:31:41.613+02:00", "highlightTitle": ""}