{"organizations": [], "uuid": "09253aa7f820ddeb2d38d17293c4d582998761b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Mike_Bonner_Portrait.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-trends/", "section_title": "Travel Trends And FocusTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mike-bonner-appointed-as-the-vice-president-of-oneonly-resorts/", "country": "US", "title": "Mike Bonner appointed as the Vice President of One&Only Resorts", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Mike Bonner appointed as the Vice President of One&Only Resorts - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "09253aa7f820ddeb2d38d17293c4d582998761b1"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mike-bonner-appointed-as-the-vice-president-of-oneonly-resorts/", "ord_in_thread": 0, "title": "Mike Bonner appointed as the Vice President of One&Only Resorts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mike Bonner appointed as the Vice President of One&Only Resorts Published on : Monday, October 12, 2015\nOne&Only Resorts announced the appointment of established industry leader Mike Bonner as Vice President, Marketing, One&Only Resorts, effective immediately. In this role, Mr. Bonner will be responsible for the entire Global Marketing of the brand, including Online and Offline Channels, Customer Relationship Management, Direct Marketing, Creative Services and Brand Partnerships. Mr. Bonner will be based in Dubai and will report directly to Helen McCabe-Young, Executive Vice President, Sales and Marketing, One&Only Resorts.\nMr. Bonner joins One&Only Resorts with extensive experience as a Sales and Marketing leader in the travel industry, having most recently worked with Silversea Cruises as General Manager and Sales and Marketing Director for UK and Ireland. Previously with Silversea, he was Director of Marketing for UK, Asia Pacific and Emerging Markets where he successfully developed a new marketing strategy to re-position the brand, as well as looking after the Sales, Reservations and Customer Services functions for the region.\n“I am thrilled to have Mike join One&Only Resorts’ team,” commented Helen McCabe-Young, Executive Vice President, Sales and Marketing, One&Only Resorts. “His career achievements in developing strategic campaigns for well-known luxury brands make him the perfect fit for this role, and I am delighted to further elevate our Sales and Marketing efforts with such a great addition to the team.”\nPrior to joining One&Only Resorts, Mr. Bonner also worked with Maybourne Hotel Group managing all aspects of global marketing activities as well as supporting sales and public relations. He ensured the achievement of growth opportunities for new markets including Middle East and Asia – and contributed to the development of successful Marketing and Food and Beverage campaigns across the luxury properties. He has a strong record of consistently delivering revenues, leading projects, as well as developing and implementing key partnerships across multiple channels.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T13:18:49.940+03:00", "highlightTitle": ""}