{"organizations": [], "uuid": "b42672789542b34c4aa05a5c024f71d72633acf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/solan-a-beautiful-british-era-town-of-himachal-pradesh.html", "country": "US", "title": "Solan  a beautiful British era town of Himachal Pradesh", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Solan  a beautiful British era town of Himachal Pradesh", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T11:13:00.000+03:00", "replies_count": 0, "uuid": "b42672789542b34c4aa05a5c024f71d72633acf4"}, "author": "Dimpy Roy-2015-10-13T09:13:44-0400", "url": "http://www.articlesfactory.com/articles/travel/solan-a-beautiful-british-era-town-of-himachal-pradesh.html", "ord_in_thread": 0, "title": "Solan  a beautiful British era town of Himachal Pradesh", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | October 13, 2015 \nSolan is a small and beautiful hamlet situated in the Himalayan regions of India. It is an old town filled with multiple structures from British colonial era and full of natural beauty. Visit the place on next vacation and spend it exploring the places to visit in Solan. \nSolan, a former Gurkha occupied region, which was then ceded by the British East India Company and developed as a major cantonment town, is small yet significant part of Himachal Pradesh. It is a quaint town that saw major developments under the reign of British, including the Kalka-Shimla railway line, which is considered today as an important heritage to Government of India. Named after the local goddess Shoolini devi, the town basically includes colorful small buildings connected by a network of narrow bylanes, set atop the slanting slopes of a hill and in the midst of lush greenery. It is easily one of the cleanest places in India. Though today, the developments here are slow but the town is sufficiently equipped with the elementary parameters of modernization. The place has earned different sobriquets, of which the most popular ones are: \"Mushroom city of India\" in reference to the large mushroom farms covering the lands and also for the fact that Directorate of Mushroom Research is situated here, and \"City of Red Gold\" because of the large production of tomatoes in the region. \n\n\nSituated about 70 k.m. from Chandigarh, 45 k.m. from Shimla, and 300 k.m. Delhi, the little hamlet also serves as a perfect destination to seek refuge from the scorching summer heat and maddening chaos of city life. The natural beauty of the town is simply unmatched, which when combined with the multiple monuments and old structures from British colonial era and the genuine hospitality offered by the hotels in Solan, make the town an ideal place for holidaying. Tourist attractions are spread all over the place and in turn are full of different interesting things to do. Following are some tourist attractions visiting which lets you understand the place and helps spend a memorable vacation. \n\n\nMotilal Nehru Central State Library - It is the only central state library in the entire state. Built in 1959 and named after the highly illustrated former Prime Minister of India, Pandit Nehru, the library is one of the chief landmarks. It stores a large collection of book, novels, biographies, and other printed materials from all over the world. It is situated on Mall Road, which is a chief commerce centre and thus easily accessible. \n\n\nMohan Shakti National Park - It is one of the most frequented places in the region, yet is quiet and beautiful. For the locals, it is a popular picnic site; it is quite likely that you will spot some groups of people picnicking here. The place is a few kilometers from the town's centre and in the midst of thick oak trees and lush greenery. The views offered by the park are just stunning and perfect for photography. \n\n\nThe Mall Road - It is the main shopping area and the centre of trade in the region. You will find multiple handicrafts, textile, and art shops selling some interesting and colorful items. Besides, there are multiple restaurants serving appetizing culinary cuisines that satisfy your taste buds and leave you wanting for more. \n\nIn a nutshell, filled with some interesting and unique tourist allures and places to visit in Solan, a holiday experience in the town is something to look forward to. It is a quiet and beautiful place ideal to spend a relaxing holiday. Source: Free Articles from ArticlesFactory.com ABOUT THE AUTHOR \nDimpy Roy is a travel blogger currently working with Travel Planners Online. Engaged more on the stay and location, Dimpy Roy helps the travellers to find best Hotels in Solan and walks them through on the list of best Places to visit in Solan they can choose from.", "external_links": [], "published": "2015-10-13T11:13:00.000+03:00", "crawled": "2015-10-14T06:42:43.855+03:00", "highlightTitle": ""}