{"organizations": [], "uuid": "1a2cb93f7ecbc7cb269c657902c057b36f607db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/festivals-culture/the-worlds-best-oktoberfests/ar-AAeKlzh", "country": "US", "title": "The World's Best Oktoberfests", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "The World's Best Oktoberfests", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 2, "uuid": "444458e2058be4bbbed630287c188d203a32d40b"}, "author": "Jonathan Shannon", "url": "http://www.msn.com/en-us/travel/festivals-culture/the-worlds-best-oktoberfests/ar-AAeKlzh#post-0", "ord_in_thread": 0, "title": "The World's Best Oktoberfests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The World's Best Oktoberfests Condé Nast Traveler 9/24/2015 Jonathan Shannon © Getty There are plenty of enjoyable Oktoberfest celebrations the world over—all featuring steins of frothy beer, lederhosen and keg tapping. But these are the Volkfests which promise the most memorable experiences.\nOktoberfest, Munich The most well-known harvest festival is on the bucket list of any serious traveler, but it’s not mandatory to get covered in foamy beer at the keg tappings. For a classier, but no less fun experience, make a reservation as early as you possibly can at the Weinzelt, an expansive two-story tent with views of the monumental Bavaria statue in Bavariapark. It’s run by the Kuffler’s, a family business with restaurants all over Germany, and while the wine tent doesn’t serve traditional Oktoberfest beer (there’s Paulaner wheat beer, if you must), it’s advisable to sip Sekt, German sparkling wine, in case you’re caught in the background of celeb photos published in German gossip magazine Bunte.\nCannstatter Wasen, Stuttgart It’s not quite as big as its Munich counterpart, but it is older, somewhat less well known, and still a grand affair, with the requisite beer tents, parades, and a fairground. Stuttgart is in the sunnier climes of south Germany where the locals are justifiably proud of their vineyards, and there’s plenty of regional specialties on offer at the Cannstatter Oberamt and Schmids Wasen Alm tents. The four large beer breweries – Dinkelacker, Schwaben Bräu, Stuttgarter Hofbräu and Fürstenberg – keep suds heads happy, but with some 1,000 different types of beers brewed in the region by small, family-owned breweries still using centuries-old traditional methods, it’s worth venturing further afield to wet your whistle while you’re there.\nWiener Wiesn Festival, Vienna Austria’s biggest folk music festival sets up in the capital’s Prater public park every year. The merriment takes place in the shadow of the Wiener Riesenrad, a towering 212-foot-tall ferris wheel built in 1897. Plant yourself in the Wojnar Kaiser tent for a view of the Riesenrad through the transparent roof. To add to an evening of spectacular sights, attend the LGBT pink Wiener Wiesn Festival in the Wojnar on October 2.\nSierra Nevada Oktoberfest, Chico, CA One of the USA’s biggest and best craft brewers, Sierra Nevada, has teamed up with storied, award-winning Bavarian brewery, Brauhaus Riegele, to create a one-off Oktoberfest collaboration. Using traditional methods, German Steffi malts and Sierra Nevada’s penchant for hops, the beer is a blonder, dryer Oktoberfest lager that’s an easy quaff. And where better to drink it than Sierra Nevada’s own bash? The three-day affair at the brewery in Chico has tents, beer, and plenty of German treats. There’s no fairground, but the Wanderlust Circus and Germanic music acts will provide plenty of entertainment.\nNational Beer Festival, Villa General Belgrano, Argentina A history of German immigration means there are plenty of traditional Oktoberfest celebrations in the Americas. They’re often found in towns boasting scene-setting Germanic architecture, but the Alpine-lite town of Villa General Belgrano goes one better. Finding itself between the Sierras Chicas and the Sierras Grandes mountain ranges, Villa General Belgrano’s climate is similar to that of Munich’s, which lives at the foot of the Alps. So, unlike the Americas’ biggest Volksfest in Blumenau, Brazil, Villa General Belgrano won’t be too hot for donning lederhosen and participating in the keg tappings, parades, and pageantry.\nMore from Condé Nast Traveler:\nThe 2015 Friendliest and Unfriendliest Cities Around the World\n100 Top Hotels & Resorts in the World\n50 Things to Do in the U.S. Before You Die\n ", "external_links": ["http://www.cntraveler.com/?mbid=synd_msn", "http://www.cntraveler.com/galleries/2015-06-27/things-to-do-in-america-all-50-us-states?mbid=synd_msntravel", "http://www.cntraveler.com/galleries/2015-08-14/the-2015-friendliest-and-unfriendliest-cities-in-the-world?mbid=synd_msntravel", "http://www.cntraveler.com/galleries/2014-10-20/top-100-hotels-and-resorts-in-the-world-rca-2014?mbid=synd_msntravel"], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-10-05T13:38:24.228+03:00", "highlightTitle": ""}