{"organizations": [], "uuid": "34558139437e606a9bb352895a23cd31091b5073", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30188162/frequent-flyers-give-tsa-failing-grade-for-the-fourth-year-in-a-row", "country": "US", "title": "Frequent Flyers Give TSA Failing Grade For the Fourth Year in a Row", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Frequent Flyers Give TSA Failing Grade For the Fourth Year in a Row - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "34558139437e606a9bb352895a23cd31091b5073"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30188162/frequent-flyers-give-tsa-failing-grade-for-the-fourth-year-in-a-row", "ord_in_thread": 0, "title": "Frequent Flyers Give TSA Failing Grade For the Fourth Year in a Row", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Frequent Business Traveler\nNEW YORK , Oct. 5, Eighty-seven percent of frequent flyers think that the Transportation Security Administration is doing either a poor or fair job in performing security screenings at the nation's airports, according to a new survey of frequent flyers conducted by Frequent Business Traveler magazine in partnership with FlyerTalk, the world's largest online travel community and ExpertFlyer, a leading provider of air travel information tools.\nThe survey finds that the typical American frequent flyer continues to hold the TSA in low regard with 71.9 percent of respondents indicating the TSA's screening procedures are either not effective or not too effective at preventing acts of terrorism on an aircraft, an increase of 4.9 percentage points from 2014 and 6.4 from 2013.\nIn contrast, only 20.8 percent indicated the procedures are somewhat effective, 5.5 percent said very effective, and 1.9 percent said extremely effective.\nA total of 2,129 respondents took part in the online survey conducted from August 21 through September 24 .\n\"This year's survey results show that the TSA has a long way to go to build confidence in its mission,\" said Jonathan Spira , editorial director, Frequent Business Traveler. \"Our survey respondents traverse security checkpoints multiple times each month and are in an excellent position to render a verdict on this subject.\"\nOther Key Findings\n-- Nearly 45 percent stated they were not satisfied with their last security experience\n-- Over three quarters (76.7 percent) of survey respondents have used PreCheck, the TSA trusted traveler security lanes\n-- Satisfaction with PreCheck continued to fall from a high of 80.3 percent in 2013 to 62.7 percent in 2015 and the drop may be partially attributed to the TSA's policy of allowing infrequent travelers, whose unfamiliarity with procedures slows down the screening process, into PreCheck lanes.\nThe complete results of the study as well as an infographic for editorial purposes are at http://accura.cc/ebjk8f\nAbout Frequent Business Traveler\nFrequent Business Traveler magazine offers travel tips and insights, news, reviews, and deals to a globetrotting audience.\nAbout FlyerTalk\nFlyerTalk is the world's largest online travel community with dedicated forums on a variety of topics.\nAbout ExpertFlyer.com\nExpertFlyer.com offers a comprehensive real-time air travel information service to frequent travelers and corporate travel managers\nMedia Contacts\nFor Frequent Business Traveler\nHenry Feintuch , henry@feintuchpr.com , +1 212 808-4901\nFor ExpertFlyer\nLou Desiderio , lou@pr-synergy.com , +1 917 627-0912\n releases/frequent-flyers-give-tsa-failing-grade-for-the-fourth-year-in-a-row-300154131.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY19931&Transmission_Id=201510051213PR_NEWS_USPR_____NY19931&DateId=20151005", "http://accura.cc/ebjk8f", "http://www.xmlnews.org/ns/", "http://www.flyertalk.com/", "http://www.expertflyer.com/", "http://www.frequentbusinesstraveler.com/", "http://www.prnewswire.com/news-releases/frequent-flyers-give-tsa-failing-grade-for-the-fourth-year-in-a-row-300154131.html"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T20:26:22.154+03:00", "highlightTitle": ""}