{"organizations": ["Lough Derg"], "uuid": "5f2014ca13cc97d4881e93e5758b895cbbcc19f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/the_preview_of_otherworlds_campaign_chapter_8_in_dark_age_of_camelot/", "country": "US", "title": "The Preview of Otherworlds Campaign: Chapter 8 in Dark Age of Camelot", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "The Preview of Otherworlds Campaign: Chapter 8 in Dark Age of Camelot", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T21:51:00.000+03:00", "replies_count": 0, "uuid": "5f2014ca13cc97d4881e93e5758b895cbbcc19f0"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/the_preview_of_otherworlds_campaign_chapter_8_in_dark_age_of_camelot/", "ord_in_thread": 0, "title": "The Preview of Otherworlds Campaign: Chapter 8 in Dark Age of Camelot", "locations": ["Black Mountains South", "Hibernia", "Vanern Swamp", "Nara Manastrong", "Silvermine Mountains", "Camelot Hills", "Camelot", "Cullen", "Vanern Swamp Hibernia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sandy", "Hamis", "Harlen", "Arin Snowtouch", "Mindy", "Moore", "Allen", "Locke", "Cullen", "Haley"], "text": "The Preview of Otherworlds Campaign: Chapter 8 in Dark Age of Camelot , 23 October 2015 -- According to the official news of Dark Age of Camelot, Chapter 8 of the Otherworlds Campaign has arrived in DAOC! Earn the new Otherworldly Necklace! Buy DAOC Platinum online can help you to gain more beautiful decorations. Now you can buy cheap DAOC Platinum on our web shop MMOGAA.com. Check out walkthroughs for the Prologue and Chapters 1-7 as well as the new Chapter 8 notes by looking at the Campaign Calendar image above or reading the lists below:According to the official news of Dark Age of Camelot, Chapter 8 of the Otherworlds Campaign has arrived in DAOC! Earn the new Otherworldly Necklace! Buy DAOC Platinum online can help you to gain more beautiful decorations. Now you can buy cheap DAOC Platinum on our web shop MMOGAA.com. Check out walkthroughs for the Prologue and Chapters 1-7 as well as the new Chapter 8 notes by looking at the Campaign Calendar image above or reading the lists below: After completing Chapter 7, visit the following NPCs to continue on to Chapter 8: Albion: Lieutenant Haley in the Otherworlds' Camelot Hills, Chapter 7 area Midgard: Arin Snowtouch in the Otherworlds' Mularn , Chapter 7 area Hibernia: Nara Manastrong in the Otherworlds' Lough Derg, Chapter 7 area Find the scout! The Otherworlds' armies have escaped for now. Uncover an enemy scout so your realm can track down their main force and destroy it once and for all! Earn the new Otherworldly Necklace! Gather more Otherworldly Ore! For those that are not yet ready to start Chapter 8, follow these steps to catch up: To begin the Prologue visit the following NPCs once you’ve reached level 50: Albion: Chamberlain Harlen in the Throne Room Midgard: Athr Hasetti Theyr in the Throne Room Hibernia: Seneschal Desmond in the Throne Room For those that have already completed the Prologue and are ready to begin Chapter 1, visit the following NPCs to continue: Albion: Lieutenant Haley in Lyonesse Midgard: Arin Snowtouch in Vanern Swamp Hibernia: Nara Manastrong in Bog of Cullen For those that have already completed Chapter 1 and are ready to begin Chapter 2, visit the following NPCs to continue: Albion: Master Burray in the Otherworlds' Lyonesse, Chapter 1 area Midgard: Master Hamis in the Otherworlds' Vanern Swamp, Chapter 1 area Hibernia: Master Zedde in the Otherworlds' Bog of Cullen, Chapter 1 area After completing Chapter 2, visit the following NPCs to continue on to Chapter 3: Albion: Master Raystan in the Otherworlds' Lyonesse, Chapter 2 area Midgard: Master Rarold in the Otherworlds' Vanern Swamp, Chapter 2 area Hibernia: Master Moore in the Otherworlds' Bog of Cullen, Chapter 2 area After completing Chapter 3, visit the following NPCs to continue on to Chapter 4: Albion: Master Mills in the Otherworlds' Lyonesse, Chapter 3 area Midgard: Master Engler in the Otherworlds' Vanern Swamp, Chapter 3 area Hibernia: Master Ernston in the Otherworlds' Bog of Cullen, Chapter 3 area After completing Chapter 4, visit the following NPCs to continue on to Chapter 5: Albion: Master Allen in the Otherworlds' Black Mountains South, Chapter 4 area Midgard: Master Tiorvi in the Otherworlds' Gotar, Chapter 4 area Hibernia: Master Iacobus in the Otherworlds' Silvermine Mountains, Chapter 4 area After completing Chapter 5, visit the following NPCs to continue on to Chapter 6: Albion: Master Locke in the Otherworlds' Black Mountains South, Chapter 5 area Midgard: Master Torgo in the Otherworlds' Gotar, Chapter 5 area Hibernia: Master Valentine in the Otherworlds' Silvermine Mountains, Chapter 5 area After completing Chapter 6, visit the following NPCs to continue on to Chapter 7: Albion: Master Sandy in the Otherworlds' Black Mountains South, Chapter 6 area Midgard: Master Cindy in the Otherworlds' Gotar, Chapter 6 area Hibernia: Master Mindy in the Otherworlds' Silvermine Mountains, Chapter 6 area Walkthroughs for previously released chapters will be added to the calendar as soon as each new chapter’s release, players only need to along with notes for the new one! If you need to learn more information about the DAOC walkthroughs for the Prologue and Chapters 1-7, you can also visit the official website of Dark Age of Camelot. If you need DAOC Plat , please visit our homepage, MMOGAA.com. # # #", "external_links": [], "published": "2015-10-22T21:51:00.000+03:00", "crawled": "2015-10-23T06:36:03.520+03:00", "highlightTitle": ""}