{"organizations": [], "uuid": "158d5c125f21e1bee947b4444bb2b293ab266628", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30184587/more-than-70-percent-of-car-shoppers-believe-emissions-crisis-could-spread-beyond-volkswagen-and-mistrust-of-the-brand-rides-high-according-to-kelley", "country": "US", "title": "More Than 70 Percent Of Car Shoppers Believe Emissions Crisis Could Spread Beyond Volkswagen And Mistrust Of The Brand Rides High, According To Kelley Blue Book Survey", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "More Than 70 Percent Of Car Shoppers Believe Emissions Crisis Could Spread Beyond Volkswagen And Mistrust Of The Brand Rides High, According To Kelley Blue Book Survey - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "158d5c125f21e1bee947b4444bb2b293ab266628"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30184587/more-than-70-percent-of-car-shoppers-believe-emissions-crisis-could-spread-beyond-volkswagen-and-mistrust-of-the-brand-rides-high-according-to-kelley", "ord_in_thread": 0, "title": "More Than 70 Percent Of Car Shoppers Believe Emissions Crisis Could Spread Beyond Volkswagen And Mistrust Of The Brand Rides High, According To Kelley Blue Book Survey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Kelley Blue Book\nAutotrader Quick Poll Reports 30 Percent of Respondents Less Likely to Consider a Diesel Vehicle; Volkswagen Site Traffic Affected on Both KBB.com, Autotrader.com\nIRVINE, Calif. , and ATLANTA , Oct. 5, Kelley Blue Book www.kbb.com , the only vehicle valuation and information source trusted and relied upon by both consumers and the automotive industry, and Autotrader, the Internet's leading resource for car shoppers and sellers, today report that more than 70 percent of KBB.com survey respondents believe the diesel emissions issue could spread beyond just Volkswagen . As for the brand's reputation, the majority of those surveyed say they have \"complete\" or \"general mistrust\" in Volkswagen. In addition, according to a recent Autotrader Quick Poll, 30 percent of respondents say they would be less likely to consider a diesel vehicle.\n\"Volkswagen can fix the mechanical problems and make reparations to owners, but winning back the confidence of shoppers and loyal buyers will be a daunting challenge that could take years to overcome,\" said Michelle Krebs , senior analyst for Autotrader. \"Every automaker should take note of the importance of integrity.\"\nKey Highlights from Kelley Blue Book and Autotrader Research on the Diesel Emissions Crisis\nAwareness of Diesel Emissions Crisis is High, Primarily Associated with Volkswagen; Other Brands Are Suspected\n64 percent of consumers are aware of the diesel emissions issue. 96 percent of those aware say that Volkswagen is the primary manufacturer involved. 63 percent cite \"intentional deceit\" as the most troubling aspect of this issue. 53 percent of respondents say they have \"complete\" or \"general mistrust\" in Volkswagen. 72 percent say they think this issue could spread beyond Volkswagen. 42 percent feel other automobile manufacturers also are secretly violating EPA emission rules. 58 percent are unsure if Volkswagen is taking proper actions in addressing this issue. Source: Kelley Blue Book's KBB.com Survey, September 23-28, 2015 , with 1,002 respondents\nAccording to an Autotrader Quick Poll, 30 percent of respondents say they would be less likely to consider a diesel vehicle. Source: Autotrader Quick Poll, 914 respondents\n\"Automotive consumers are well aware of the diesel emissions issue, and they have Volkswagen squarely in their sights as the manufacturer at fault; as a result, the company's brand image is taking a hit,\" said Rick Wainschel , vice president of customer analytics and insights for Kelley Blue Book. \"If this issue spreads, which consumers see as entirely plausible, other manufacturers – and diesel vehicles in general -- also could be affected.\"\nVolkswagen Site Metrics, Valuation and Listing Data from KBB.com and Autotrader\nVolkswagen Site Metrics for Kelley Blue Book's KBB.com (Week-Over-Week)\nVolkswagen TDI Trade-In Value Lookups have increased 79 percent. Volkswagen Total Trade-In Value Lookups have increased 10 percent. Volkswagen TDI Research has increased 13 percent for new cars, and increased 16 percent for used cars. Volkswagen Total Research has increased 15 percent for new cars, but decreased 12 percent for used cars. Source: Kelley Blue Book's KBB.com Site Traffic\n\"During the last week since news broke of the emissions crisis, traffic to both KBB.com and Autotrader.com has generally increased for Volkswagen, particularly for the diesel models, but at this point it is hard to determine the mindset and intentions of precisely what these early surges in activity represent,\" said Wainschel. \"The increased level of trade-in activity on KBB.com and private seller activity for Autotrader appear to show that consumers are curious to see if values of these models have dropped, and demonstrate they may have some level of concern on this aspect of the emissions issue. At the very least, it indicates that consumers are hungry for information about values.\"\nVolkswagen Site Metrics for Autotrader (Week-Over-Week)\nVolkswagen Shopping for Diesel has increased 7 percent. Total Volkswagen Shopping is down 1 percent. Volkswagen Private Seller Activity for Diesel is up 19 percent. Total Volkswagen Private Seller Activity is up 1 percent. Source: Autotrader.com Site Traffic\nAutotrader Listing Information for Volkswagen\nMake\nFuel Type\nInterest % Chg. (VDPs / Listing)\nPrice % Chg.\nListings % Chg.\nPrice Chg.\nVolkswagen\nDiesel\n7.0%\n(0.7%)\n(3.9%)\n($175.45)\nVolkswagen\nNon-Diesel\n(2.0%)\n(0.1%)\n1.1%\n($20.12)\nVolkswagen\nAll\n(0.7%)\n(0.4%)\n0.3%\n($82.91)\nNon-Volkswagen\nDiesel\n(0.9%)\n0.2%\n0.4%\n$77.96\nNon-Volkswagen\nNon-Diesel\n(1.0%)\n0.2%\n1.3%\n$38.45\nNon-Volkswagen\nAll\n(1.0%)\n0.1%\n1.2%\n$33.83\nSource: Autotrader Inventory, 9/12/15-9/18/15 (Pre-Announcement) Versus 9/19/15-9/25/15 (Post-Announcement)\n\"This announcement impacts the diesel vehicles from Volkswagen, which carry higher residual values than their equivalent gasoline counterparts,\" said Eric Ibara , director of residual values for Kelley Blue Book. \"While early readings suggest that TDI vehicles are being affected by the news, it is possible that they could return to normal levels within a year. This will depend on how Volkswagen handles this crisis and what they announce the fix will be for the U.S. market.\"\nTo discuss this topic, or any other automotive-related information, with a Kelley Blue Book analyst on-camera via the company's on-site studio, please contact a member of the Public Relations team to book an interview.\nFor more information and news from Kelley Blue Book's KBB.com, visit www.kbb.com/media/ , follow us on Twitter at www.twitter.com/kelleybluebook (or @kelleybluebook), like our page on Facebook at www.facebook.com/kbb , and get updates on Google+ at https://plus.google.com/+kbb .\nAbout Kelley Blue Book ( www.kbb.com )\nFounded in 1926, Kelley Blue Book, The Trusted Resource® , is the only vehicle valuation and information source trusted and relied upon by both consumers and the automotive industry. Each week the company provides the most market-reflective values in the industry on its top-rated website KBB.com, including its famous Blue Book® Trade-In Values and Fair Purchase Price, which reports what others are paying for new and used cars this week. The company also provides vehicle pricing and values through various products and services available to car dealers, auto manufacturers, finance and insurance companies, and governmental agencies. Kelley Blue Book's KBB.com ranked highest in its category for brand equity by the 2015 Harris Poll EquiTrend ® study and has been named Online Auto Shopping Brand of the Year for four consecutive years. Kelley Blue Book Co., Inc. is a Cox Automotive company.\nAbout Autotrader\nCreated in 1997, Atlanta -based Autotrader is the Internet's ultimate automotive marketplace. As a leading resource for car shoppers and sellers, Autotrader aggregates millions of new, used and certified pre-owned cars from thousands of dealers and private sellers and provides expert articles and reviews. Autotrader , which also operates the AutoTraderClassics.com auto marketing brand, is wholly owned by Cox Automotive. Additionally, Cox Automotive owns Kelley Blue Book ( KBB.com ®), Manheim Auctions as well as companies that provide a full suite of software tools that help dealers and manufacturers manage their inventory and advertising online: vAuto®, HomeNet Automotive®, VinSolutions®, AIS Rebates™, Genius Labs® , NextGear Capital® and Haystak™. Cox Automotive is a subsidiary of Cox Enterprises. For more information, please visit http://press.Autotrader.com .\nLogo - http://photos.prnewswire.com/prnh/20121108/LA08161LOGO\n releases/more-than-70-percent-of-car-shoppers-believe-emissions-crisis-could-spread-beyond-volkswagen-and-mistrust-of-the-brand-rides-high-according-to-kelley-blue-book-survey-300153639.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=LA19043&Transmission_Id=201510050500PR_NEWS_USPR_____LA19043&DateId=20151005", "http://photos.prnewswire.com/prnh/20121108/LA08161LOGO", "http://autotraderclassics.com/", "http://www.kbb.com/volkswagen/", "http://www.xmlnews.org/ns/", "http://press.autotrader.com/", "http://photos.prnewswire.com/prnvar/20121108/LA08161LOGO", "http://www.autotrader.com/", "http://www.kbb.com/car-news/all-the-latest/five-things-to-know-about-the-vw-diesel-scandal/2000012472/", "http://www.facebook.com/kbb", "http://www.twitter.com/kelleybluebook", "http://www.prnewswire.com/news-releases/more-than-70-percent-of-car-shoppers-believe-emissions-crisis-could-spread-beyond-volkswagen-and-mistrust-of-the-brand-rides-high-according-to-kelley-blue-book-survey-300153639.html", "http://autotrader.com/", "http://www.kbb.com/media/", "http://www.kbb.com/", "http://kbb.com/", "https://plus.google.com/+kbb"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T13:16:42.027+03:00", "highlightTitle": ""}