{"organizations": [], "uuid": "3cfff29a1a2c70adc8682303fba0e733bbf9178a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelncampinginfo.com", "main_image": "http://www.travelncampinginfo.com/wp-content/uploads/2015/09/columbus-oh-tourist-attractions-150x150.jpg", "site_section": "http://www.travelncampinginfo.com/feed", "section_title": "Travel N Camping Info - Travel and Camping Information, Tips and News", "url": "http://www.travelncampinginfo.com/7-best-columbus-oh-tourist-attractions-to-visit.html", "country": "US", "title": "7 Best Columbus OH Tourist Attractions To Visit", "performance_score": 0, "site": "travelncampinginfo.com", "participants_count": 1, "title_full": "7 Best Columbus OH Tourist Attractions To Visit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T16:30:00.000+03:00", "replies_count": 0, "uuid": "3cfff29a1a2c70adc8682303fba0e733bbf9178a"}, "author": "admin", "url": "http://www.travelncampinginfo.com/7-best-columbus-oh-tourist-attractions-to-visit.html", "ord_in_thread": 0, "title": "7 Best Columbus OH Tourist Attractions To Visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home > Travel Destinations > 7 Best Columbus OH Tourist Attractions To Visit 7 Best Columbus OH Tourist Attractions To Visit By admin on October 1, 2015 Pin It \nColumbus, the capital of Ohio has been named after Christopher Columbus and was founded in the year 1812. There are number of exotic landscapes and features in this city which is also considered one of the most historical cities in Ohio. \nAmong the major Columbus OH tourist attractions, there are old quarters of the towns, the villages, history malls and a number of other historical monuments. Best Columbus OH Tourist Attractions \nSome of the most famous Columbus OH tourist attractions, which you should not miss during your visit, have been described below: Franklin Park Conservatory And Botanical Garden \nThis park and botanical garden located in Columbus provides a horticultural display of incredible variety featuring 88 acres of outdoor and indoor gardens. The seasonal exhibits of the garden offer a great experience to the visitors. Visitors to this garden can also get the sight of wonderful selection of different plants especially during the summers. Ohio Statehouse Photo Credits: ohiostatehouse.org \nOhio Statehouse is a building in Greek Revival fashion. It remains open for the public including the Senate Building and Atrium and the Capitol Square. Visitors to this place can either opt for self-guided or guided tours. Center Of Science And Industry Photo Credits: Geo \nThe Center of Science and Industry contains 116,000 square feet space for exhibits. Apart from this, the COSI even has a separate space for Ohio State University Labs in Life. The working television station of the COSI is also an important feature. Kelton House Museum And Garden Photo Credits: keltonhouse.com \nThis is a charming and a beautiful Victorian-era house built in the year 1852. The building showcases the life in Columbus during the 19th century. this home which is operated by Junior League possesses gardens that have been well-tendered. Columbus Museum Of Art \nColumbus Museum of Art is one of the most popular tourist attractions in Columbus, Ohio. This art museum is located in downtown Columbus and it holds beautiful collection of modern period painting of American and European art. \nPaintings of Pablo Picasso and Juan Gris are highlights of the permanent collection in this museum. Apart from this, you can also enjoy the outdoor sculpture gallery, and cafe. Please note that if you are visit this museum, do after 24th Oct 2015 as it is presently closed for expansion. German Village Photo Credits: Brandon Bartoszek \nGerman Village, which is located towards the south of Columbus downtown, is a historic neighborhood. This is a beautiful place with many charming old houses, Schiller Park, delicious restaurants, etc. \nThis place is named as German Village as most of the people living here are German immigrants, who settled in this place in early to mid 19th century. This place also holds its place in National Register of Historic Places. Easton Town Center Photo Credits: Brandon Bartoszek \nThe Easton Town center is a shopping destination in Columbus and it probably ranks among some of the most famous Columbus OH tourist attractions. There are a number of entertainment venues and dining options that you can find at this place.", "external_links": [], "published": "2015-10-01T16:30:00.000+03:00", "crawled": "2015-10-01T17:35:44.206+03:00", "highlightTitle": ""}