{"organizations": [], "uuid": "3583f286f2f55f63b01ab48532592cb6d4a0d639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30245879/business-travel-takes-off-on-bookingcom", "country": "US", "title": "Business Travel Takes Off on Booking.com", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Business Travel Takes Off on Booking.com - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "3583f286f2f55f63b01ab48532592cb6d4a0d639"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30245879/business-travel-takes-off-on-bookingcom", "ord_in_thread": 0, "title": "Business Travel Takes Off on Booking.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Booking.com\nAMSTERDAM , October 13,\nA lmost one in five bookings on Booking.com now made for business\nWhen it comes to business travel, there's a simple truth that every business traveller is also a leisure traveller. Today, Booking.com reveals that more and more of its leisure travellers are making business bookings on its site, with almost one in five now made for business travel. As the face of business travel changes, the largest accommodation booking platform in the world has responded with additional, highly tailored services designed to give today's road warriors an easier and more rewarding experience, as well as better value for employers.\n\"Among Booking.com customers, location is the primary factor when selecting a place to stay when travelling for work. With around a third of US business bookings on Booking.com made at places that are not hotels, there's also a clear and growing desire for something different,\" explains Ripsy Bandourian, Senior Product Owner, Booking.com. \"The traditional executive crash-pad of the past may have had its day. Today's business travellers wear more guises and require more choice, control and flexibility over where they choose to rest their heads than ever before. Understanding these trends and listening to our customers' specific asks, we've shaped our product to best empower business travellers across the world to easily discover, book, and enjoy the best places to stay when travelling for work.\"\nEnhanced features for business travel on Booking.com highlight those places which are used a lot for business. With more than 60 million real guest reviews, Booking.com intelligently combs through a wealth of data and draws from 25 different types, including apartments, homes, B&Bs, motels, and hotels, to make easy work of finding those that are business traveller tested and approved. Key amenities that rank most essential amongst this community, from free WiFi to top-class breakfasts, are also brought to travellers' attention. With 800,000 places to stay in over 83,000 unique destinations, seasoned executives to PhD students can book with confidence, wherever their business takes them.\nTaking the experience even further, Booking.com for Business provides a free tool for travel managers and assistants that allows booking on behalf of others. Booking.com for Business is a platform with enhanced functionality and reporting designed to meet the specific needs of corporate travel, while delivering the same ease as Booking.com. Travel organisers can create a free, no-strings-attached account to get access to the lowest rates as well as a whole host of features to simplify their tasks. Travellers themselves are also given exclusive access to special deals and complimentary extras at select properties, helping to turn a 3-star budget into a 4-star experience. With the majority of business travellers (65%) booking travel themselves and preferring to book directly online, Booking.com for Business provides the additional choice, simplicity, savings and the seamless control they crave.\n\"We are seeing more and more businesses opting to use Booking.com instead of their current method,\" confirms Bandourian. \"As well as a much broader selection of great places to stay, they get better prices and a simple, trustworthy mobile-enabled experience. Our mission is to help employees get more out of their business stays, and help their employer to save money. And the formula is working. Today, tens of thousands of businesses have signed up to our Booking.com for Business tool and are actively engaged. We see strong growth and a bright future in this area. Someday, we hope to see as many business bookings as leisure bookings on our site.\"\nAbout Booking.com :\nBooking.com is the world leader in booking hotel and other accommodations online. It guarantees the best prices for any type of property - from small independents to five-star luxury. Guests can access the Booking.com website anytime, anywhere from their desktops, mobile phones and tablet devices, and they don't pay booking fees - ever. The Booking.com website is available in 42 languages, offers over 805,000 hotels and accommodations including more than 370,000 vacation rental properties and covers nearly 84,000 destinations in 221 countries and territories worldwide. It features over 60M reviews written by guests after their stay, and attracts online visitors from both leisure and business markets around the globe. With over 19 years of experience and a team of over 10,000 dedicated employees in 170 offices worldwide, Booking.com operates its own in-house customer service team, which is available 24/7 to assist guests in their native languages and ensure an exceptional customer experience.\nEstablished in 1996, Booking.com B.V. owns and operates Booking.com™, and is part of The Priceline Group (NASDAQ: PCLN). Follow us on Twitter , Google+ and Pinterest , like us on Facebook , or learn more at http://www.booking.com .\n ", "external_links": ["https://plus.google.com/+Bookingcom", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510122512&Transmission_Id=201510130400PR_NEWS_USPR_____enUK201510122512&DateId=20151013", "http://www.booking.com/business.html", "http://www.twitter.com/bookingcom", "http://www.facebook.com/bookingcom", "http://booking.com/", "http://pinterest.com/bookingdotcom/", "http://www.booking.com/?aid=354544&utm_source=PR&utm_medium=email_pr&utm_campaign=22_01_2013"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T13:51:34.265+03:00", "highlightTitle": ""}