{"organizations": ["Buddhist", "Hong Kong Heritage Museum"], "uuid": "71b56c86cc92b254c32987942478e1dc289d5767", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/186", "section_title": "Artipot: Travel > Air Travel Articles", "url": "http://www.artipot.com/articles/1943104/cultural-hotspots-of-hong-kong.htm", "country": "US", "title": "Cultural Hotspots of Hong Kong (Deepak Nangla)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Cultural Hotspots of Hong Kong (Deepak Nangla)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T10:03:00.000+03:00", "replies_count": 0, "uuid": "71b56c86cc92b254c32987942478e1dc289d5767"}, "author": "", "url": "http://www.artipot.com/articles/1943104/cultural-hotspots-of-hong-kong.htm", "ord_in_thread": 0, "title": "Cultural Hotspots of Hong Kong (Deepak Nangla)", "locations": ["Hong Kong", "Lantau Island"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wong", "Huang Chuping", "Wong Tai", "Deepak Nangla", "Zhao Shao'ang", "Wong Tai Sin"], "text": "By Deepak Nangla Oct 14, 2015 Hong Kong's culture reflects a perfect blend of East and West. The diversity in population, food, traditions, language, lifestyles and beliefs is a great indicator of the impact of cultural influences. It is, however, worth knowing that this diversity has given the modern metropolis some of its most precious gems that are an integral part of the city's major attractions for visitors from across the world. Next time when you book your flights to Hong Kong, make sure to visit these interesting places.Here's a glimpse of some of these treasures that have been a part of the hustle-bustle of this busy city, yet maintained their charm and significance. Wong Tai Sin Temple:- This famous shrine is dedicated to Huang Chuping who came to be known as Wong Tai Sin, or the Great Immortal Wong after he attained enlightenment. The architecture of the temple is magnificent and showcases traditional temple Chinese style. Stunning carvings in different colours, yellow latticework and blue frescos make the roofs look simply divine, whereas the grand red pillars add to the appeal. Built with fengshui elements, the temple is particularly famous for its fortune telling and answering prayers. Po Lin Monastery and Big Buddha:- Situated in the mountainous region of Lantau Island, this is one of the top must-visit destinations for visitors to Hong Kong who want to experience the natural as well as the cultural side of the city. While the monastery depicts impressive architecture with colourful manifestations of Buddhist iconography, it is the extraordinary statue of 34 meters high of the Tian Tan Buddha or the Big Buddha that draws pilgrims from all over the world. The Hong Kong Heritage Museum:- The Hong Kong Heritage Museum is an ideal place to while away the afternoon hours amidst relics and pieces from the ancient times. The museum, spread across 7,500-square meters, houses six permanent galleries which comprise a rich collection of objects reflecting the culture, art and history of Hong Kong and its neighboring regions. A collection of Chinese paintings by Zhao Shao'ang and a vivid exhibition depicting the development of Cantonese opera are the major highlights of the museum. Lam Tsuen:- The 700-year-old community of villages is famous for its two majestic banyan trees. Earlier, people would write their wishes on paper, tie it to an orange and throw it on the branches of the trees as a symbol of good luck. This practice has however, now been stopped in an effort to protect the ageing wishing trees. Travelers come here to enjoy the uniqueness and everlasting charm of the region. The Tin Hau Temple, built during the Qing dynasty is another major attraction of the area. About the Author All major airlines offer Cheap flights to Hong Kong . The city has many such treasures waiting to be explored by you. So book your Cheap tickets to Hong Kong soon to be a part of an amazing vacation. Rating:", "external_links": [], "published": "2015-10-14T10:03:00.000+03:00", "crawled": "2015-10-14T11:58:37.523+03:00", "highlightTitle": ""}