{"organizations": [], "uuid": "952bab53a894f4fbe3d7f7f49591bc2977abbe11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151014Assembly1.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/10/15/citizen-groups-ask-criminalization-street-sexual-harassment", "country": "US", "title": "Citizen groups want street harassment criminalized in Costa Rica", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Citizen groups want street harassment criminalized in Costa Rica", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:30:00.000+03:00", "replies_count": 0, "uuid": "952bab53a894f4fbe3d7f7f49591bc2977abbe11"}, "author": "L. Arias", "url": "http://www.ticotimes.net/2015/10/15/citizen-groups-ask-criminalization-street-sexual-harassment", "ord_in_thread": 0, "title": "Citizen groups want street harassment criminalized in Costa Rica", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nLegislators from various parties join women’s rights groups during the announcement of an initiative to enact stricter laws against street harassment, Oct. 13, 2015. (Via Legislative Assembly) \nWomen’s rights group Colectivo Acción Respeto Costa Rica and other organizations launched an initiative Tuesday to draft and submit a bill for criminalizing catcalls and other forms of sexual harassment on Costa Rican streets. \nThe groups announced their proposal during a press conference at the Legislative Assembly where lawmakers from the ruling Citizen Action Party (PAC), National Liberation Party (PLN) and Broad Front Party (FA) offered support to promote the adoption of the draft. Among its main goals the initiative asks for the inclusion of street harassment as an offense in the country’s Penal Code. \nAlejandra Arburola Cabrera, a spokeswoman with the Colectivo, told The Tico Times that they started working on the initiative months ago, however the recent stabbing of Gerardo Cruz prompted them to speed up the discussion and include lawmakers and citizens. \nCruz was stabbed twice one day after he posted on his Facebook profile a video he shot of another man recording video with his cellphone up the skirt of a female pedestrian in downtown San José. Cruz has since undergone three surgeries and currently remains at Calderón Guardia hospital. \nArburola said Cruz’s case is a reflection of the reality that haunts women from the moment they leave their houses everyday. “We are seen as objects, with no rights and submitted to constant violence. This needs to stop as soon as possible,” she said. \nTuesday’s meeting also allowed the groups’ leaders to call on all citizens to participate in the drafting of the bill, following a number of priorities identified by the group in recent months. \nAmong them, they believe the bill should clearly define street harassment based on gender or sexual orientation as a criminal offense punishable with prison sentences. \nCurrent laws in Costa Rica consider sexual harassment a minor offense described as a “violation against decency,” and filing a complaint requires the offender to be fully identified by police. If the suspect does not carry an ID, cops will take him (or her) to the nearest precinct for a full identification and then release the suspect. \nThe complaint then goes to a Misdemeanors Court where the victim has to provide evidence. If the judge finds the suspect guilty, the offender will have to pay a monetary fine ranging from 5 to 30 days of his salary. \nFollowing Cruz’s case, the Judicial Branch last Thursday reported that so far this year it has received a total of 7,321 complaints of street harassment — some 26 per day. \nThe groups are asking for a more expeditious process for filing a complaint. They also want the court to issue cautionary measures to protect the victims. Their proposal also demands stricter sanctions for recidivist offenders and for those found guilty of harassing minors, disabled or elderly people. \nUnder the proposed law, the Judicial Branch would create a registry of complaints that facilitates monitoring of sexual harassment offenders. \nProponents also want a protocol developed for dealing with sexual harassment victims, including training for police officers. \nThe groups proposing the law plan to host public forums so that citizens can join the discussion. Following public consultation, they estimate that they’ll submit the draft bill to the Assembly in about three months, Arburola said. \nAngela Delgado, another representative of the collective said other groups have actively joined their initiative to promote the bill, among them Proyecto Lyra, Piropos o Acoso CR, Colectivo Furia Rosa, Community, Este es mi cuerpo CR, El Tío Hugo and a number of independent feminist activists. Political support \nNational Liberation Party lawmaker Carla Prendas Matarrita was among those legislators who attended the news conference announcing the initiative. She told the audience that legislators from various parties pledged to support the initiative and will join efforts to make sure the bill becomes law. \nPAC’s Emilia Cruz Molina said a group of women lawmakers are already lobbying for support from all legislators to move forward with the bill, and she asked the population to get involved in its drafting. \nThe groups’ leaders asked interested people to submit their ideas to the Facebook page of Colectivo Acción Respeto Costa Rica or by email: accionrespetocostarica@gmail.com. \nLast week the Ombudsman’s office, the National Institute for Women and NGO “El acoso callejero no es cosa de hombre” (Street sexual harrasement is not a man’s thing) launched a campaign on social media to raise awareness on the issue. \nThe campaign includes videos and messages from artists, athletes, journalists and other personalities saying that real men don’t catcall, make obscene gestures, take pictures or videos on the street. \nWatch one of the spots: Not the first attempt to penalize street harassment \nThis isn’t the first time Costa Rica considers penalizing street harassment. In 2005, then-Costa Rica legislator Gloria Valerín Rodríguez (Social Christian Unity Party) introduced a bill that would have added street harassment against women to Costa Rica’s penal code. \nValerín proposed a fine of 30 to 50 days minimum wage for perpetrators. The bill was unsuccessful. \nBackers of the current initiative hope to capitalize on the widespread public outrage caused by the video taken by Cruz and his subsequent attack in order to push through a bill. \nEarlier this year, a Panamanian congresswoman submitted a bill to penalize street harassment in that country. The proposal was received with a mix of praise and ridicule . Contact L. Arias at larias@ticotimes.net", "external_links": [], "published": "2015-10-15T12:30:00.000+03:00", "crawled": "2015-10-15T12:57:05.993+03:00", "highlightTitle": ""}