{"organizations": [], "uuid": "07124a0bbf6a5e170d91677652814a24194fd18a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/fe86f64d8faeca514af773f13599edaa9b3687f5/c=0-0-2128-1202&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/08/USATODAY/USATODAY/635799450311491419-ThinkstockPhotos-477772872.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/travel/advice/2015/10/11/upsell-add-on-fees/73628946/", "country": "US", "title": "A cure for the upselling epidemic", "performance_score": 0, "site": "usatoday.com", "participants_count": 0, "title_full": "A cure for the upselling epidemic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T02:02:00.000+03:00", "replies_count": 0, "uuid": "07124a0bbf6a5e170d91677652814a24194fd18a"}, "author": "", "url": "http://www.usatoday.com/story/travel/advice/2015/10/11/upsell-add-on-fees/73628946/", "ord_in_thread": 0, "title": "A cure for the upselling epidemic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A cruise can bring a barrage of upsells, from drinks in souvenir glasses to art auctions, spa services and premium restaurant meals. (Photo: Getty Images/iStockphoto)\n6 CONNECT 8 TWEET 13 LINKEDIN COMMENT EMAIL MORE Airlines do it by quietly restricting the terms on their tickets. Cruise lines resort to good old-fashioned salesmanship. And the entire travel industry does it better, thanks to sophisticated software.\nIt's called the \"upsell\" — and yes, it's completely out of control.\nThe travel industry is addicted to the money it makes from selling you extras after you've made a booking. The airline industry collected a cool $38 billion from \"optional\" items such as checked luggage last year, up 21% from 2013. You have the power to stop this nonsense now.\nFor example, if you're looking for the lowest fare on Delta Air Lines, you might find one of its new, highly restrictive economy-class fares. No changes, refunds or upgrades are allowed with these new tickets, nor can you make advance seat reservations. A decade ago, these same kind of tickets would have come with a seat assignment, two checked bags and the ability to change a reservation.\nBy adding onerous restrictions to its economy-class ticket, the airline stands to earn more from passengers who must buy a new ticket if their plans change or who have to pay for a checked bag, says Tim Leffel, the author of The World's Cheapest Destinations . Want more flexibility? Pay more.\n\"The act of buying a plane ticket is an exercise in upselling gone amok,\" he says.\nThis is by no means just an airline problem. Tanner Callais, a cruise industry observer who runs the blog GalvestonCruiseTips.com , says cruise lines are no longer content to just sell you a ticket. They start upselling you before you book your vacation by offering upgrades to a higher-class cabin, cleverly breaking the price down into a \"by day\" rate so it's easier to swallow. Once on board, it's a barrage of upsells, from drinks in souvenir glasses to art auctions, spa services and premium restaurant meals.\n\"Sometimes it really feels like the entire point of a cruise is to bring you on board to hit you with sales pitches for a week straight,\" he says.\nIf you feel you're the target of an aggressive upsell, you probably are. \"More and more, we are asked to increase revenues with more creative efforts,\" says Michael Maven, a London-based consultant for Carter & Kingsley, a consulting firm. His travel industry clients like to create systems for adding on purchases.\n\"So for example, once a customer has purchased the core product, we would ask them if they were interested in the upgraded version of what they have bought,\" he explains. It could include touting the \"benefits\" of a loyalty card or the savings they'd get by participating in a loyalty program.\nThere's no doubt that extra revenue is good for travel companies. But is it good for you? In most instances, the upsold items were amenities that the company should have included as part of the purchase price, such as the ability to check a bag, have lunch or use a toll tag on a rental car. The methods used to sell them, which seem increasingly desperate, are laughable and at times even unbelievable.\nConsider what happened to Norissa Tworkowski on a recent flight from Washington to Fort Lauderdale. First, the crew turned the air conditioning \"down very low,\" remembers Tworkowski, who works for the federal government.\n\"Passengers around me were complaining about how freezing cold it was,\" she recalls. \"About two minutes after the AC was blasted, there was an announcement that blankets are available — for $5.\"\nHow do you stop the insanity? With one word: \"No.\"\nThat's what Tworkowski did.\n\"I chose to remain cold as a matter of principle,\" she says.\nHow to avoid the upsell\n• Learn to spot it. Upsells are everywhere, and the tactics travel companies use are more aggressive than ever. Sometimes they're subtle, but often they are in your face. One discount carrier tries to sell you assigned seats by generating a pop-up on its site, warning that you could be separated from your loved ones on the plane if you don't pony up the cash for a seat. That's an upsell.\n• Run a worst-case scenario. What if you refuse? For the seat-assignment upsell, it's not as bad as they make it look. If you're traveling with young kids, they'll probably find a way for you to sit together anyway. Or if you're someone like Tworkowski, you'll just be cold for a little while.\n• Say \"no\" — and let them know why. The upsell is successful only when it works. If enough people tell an airline, car rental company or cruise line that they're not buying it, then it will stop. But it's not enough to say \"no.\" You have to let the company know you're not interested and why.\nChristopher Elliott is a consumer advocate and editor at large for National Geographic Traveler. Contact him at chris@elliott.org or visit elliott.org .\n6 CONNECT 8 TWEET 13 LINKEDIN COMMENT EMAIL MORE Read //usat.ly/1RBobOK TOP VIDEOS", "external_links": ["https://twitter.com/intent/tweet?url=http%3A//usat.ly/1RBobOK&text=A%20cure%20for%20the%20upselling%20epidemic&via=usatoday", "http://usat.ly/1RBobOK", "http://www.gannett-cdn.com/-mm-/72e75611e88293aba97910dd237f0430af393566/c=248-0-2127-1413&r=x404&c=534x401/local/-/media/2015/10/08/USATODAY/USATODAY/635799450311491419-ThinkstockPhotos-477772872.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1RBobOK&mini=true", "http://www.gannett-cdn.com/-mm-/521cd80a4fb9f1f1edf37d025629b379daee5bba/r=500x332/local/-/media/2015/10/08/USATODAY/USATODAY/635799450311491419-ThinkstockPhotos-477772872.jpg", "http://www.gannett-cdn.com/media/2015/10/08/USATODAY/USATODAY/635799450311491419-ThinkstockPhotos-477772872.jpg"], "published": "2015-10-12T02:02:00.000+03:00", "crawled": "2015-10-12T15:41:17.708+03:00", "highlightTitle": ""}