{"organizations": [], "uuid": "3c0f373bc6553d7036224330ddf6c59b88ea94ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/29219-travelport-acquires-its-distributor-in-austria", "country": "US", "title": "Travelport acquires its distributor in Austria", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Travelport acquires its distributor in Austria", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T17:50:00.000+03:00", "replies_count": 0, "uuid": "3c0f373bc6553d7036224330ddf6c59b88ea94ae"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/29219-travelport-acquires-its-distributor-in-austria", "ord_in_thread": 0, "title": "Travelport acquires its distributor in Austria", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travelport acquires its distributor in Austria Travelport acquires its distributor in Austria Details Category: Agency & Association   15:50 Travelport, a leading Travel Commerce Platform, has announced the acquisition and vertical integration of its distributor in Austria, TraviAustria. TraviAustria was founded in 1987 by Austrian Airlines, an original shareholder in the predecessor company of Travelport. In addition to providing local sales, support and marketing activity for the Travelport travel commerce platform to travel agencies in Austria, TraviAustria built and operates one of the largest tour operator booking platforms in Central Europe, called CETS. \nCETS is used by 2,500 travel agencies in 12 European countries and provides real time access and booking for the products of some 140 service providers, in addition to the 400+ airlines, more than 650,000 hotels and other content that Travelport provides. Both TraviAustria and the CETS platform are now wholly owned by Travelport. Gordon Wilson, President and CEO for Travelport, commented: \"Vertically integrating one of our few remaining third party distributors in Europe, enables Travelport to operate more efficiently and to enhance our presence and customer relationships in Austria. Moreover, in this particular case, we have also acquired ownership of a significant tour operator distribution capability as an adjunct to our travel commerce platform and the revenues that go with this. The agreement will offer us further synergies with the German company, travel-IT which operates in the same space and in which we invested earlier this year.” Rudolf Mertl, CEO, TraviAustria, said: “This is an exciting time for TraviAustria and we see this acquisition as a very positive move for our customers. Now with the full backing of Travelport, we will be better placed to take advantage of the considerable opportunities that we see ahead of us in the region.” Travelport continues to strengthen its portfolio of products, services and customer engagement, both organically and inorganically, through investments in building leading positions in airline merchandising, hotel distribution, mobile travel commerce and B2B payments and today’s news builds on this. Related articles", "external_links": [], "published": "2015-10-06T17:50:00.000+03:00", "crawled": "2015-10-06T19:14:40.635+03:00", "highlightTitle": ""}