{"organizations": [], "uuid": "db578cbbf1ddb0f5def2cba408dcc0bb17c1c9a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/Mereenie-Inner-Loop.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/inner-loop-to-help-build-tourism-numbers-in-central-australia/", "country": "US", "title": "Inner Loop to help build tourism numbers in Central Australia - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Inner Loop to help build tourism numbers in Central Australia - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "db578cbbf1ddb0f5def2cba408dcc0bb17c1c9a5"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/inner-loop-to-help-build-tourism-numbers-in-central-australia/", "ord_in_thread": 0, "title": "Inner Loop to help build tourism numbers in Central Australia - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Inner Loop to help build tourism numbers in Central Australia\nThe Territory Government’s $25 million commitment to seal the Mereenie Inner Loop is a step closer with the tender for the 43 kilometre seal and upgrade now open.\nChief Minister Adam Giles said the Country Liberals Government was investing in the future of tourism in Central Australia and delivering on the number one infrastructure priority for local tourism operators.\n“This loop is a great self-drive or guided tour route, taking in both popular and little-explored destinations in some amazing desert country,” Mr Giles said.\n“My Government is committed to building tourism opportunities in Central Australia and I’m confident this investment in the ‘Inner Loop’ will bring more visitors to the region, convincing them to stay longer and spend more.”\nThe Inner Loop forms part of the iconic 1335 kilometre Red Centre Way tourist drive linking Uluru, Kata-Tjuta, Kings Canyon and the West MacDonnell Ranges.\nMinister for Infrastructure Peter Chandler said this was the last remaining unsealed section of the Mereenie Inner loop.\n“This project will seal 43 kilometres of Larapinta Drive between Hermannsburg and Glen Helen with work expected to start early next year and be completed by November 2016,” he said.\n“This $25 million investment is part of the Country Liberals Government’s record infrastructure spend and is a recognition of the importance transport infrastructure plays in the development of Northern Australia.\n“Transport infrastructure supports the community and facilitates economic development while unlocking potential opportunities in our remote and regional areas.”\nMr Giles said the drive market was a growing tourism sector for the Territory.\n“Last year, 140,000 people visited the West MacDonnell Ranges and I want to see that number grow by making the region easier to access,” he said.\n“Over the next two years, the Territory economy will strategically tilt towards the tourism industry and the Country Liberals Government is laying the groundwork now to prepare the industry for this shift. We will not repeat Labor’s mistakes by failing to plan for this new landscape.\n“It’s heartening to see the Central Australian tourism industry showing signs of recovery after years of decline under Labor but we know infrastructure will be a critical economic driver going forward.\n“That’s why we’ve committed $25 million to seal the Inner Loop, as well as $4.75 million for a Tourism Infrastructure Development Fund to support new and improved tourism products, particularly in our regions.”\nThe 43 kilometres will be designed and constructed between CH 126km and CH 169km and will become a sealed surface including upgrades of all creek crossings.\nThe tender is set to be awarded in late November with construction due to commence in January 2016 and be completed by November 2016.\nThe Meerenie Inner Loop is fully funded by the Northern Territory Government.", "external_links": [], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-03T13:22:10.832+03:00", "highlightTitle": ""}