{"organizations": [], "uuid": "2659e8a22958de6aabb1bd2197e524c5c178086d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/10/nt.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/situation-update-of-the-crowd-surrounded-phukets-thalang-police-station/", "country": "US", "title": "Situation Update of the crowd surrounded Phuket’s Thalang police stationTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Situation Update of the crowd surrounded Phuket’s Thalang police stationTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "2659e8a22958de6aabb1bd2197e524c5c178086d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/situation-update-of-the-crowd-surrounded-phukets-thalang-police-station/", "ord_in_thread": 0, "title": "Situation Update of the crowd surrounded Phuket’s Thalang police stationTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Situation Update of the crowd surrounded Phuket’s Thalang police station Published on : Monday, October 12, 2015\nThe Royal Thai Police have declared that things are back to normal in Phuket this morning after the island’s Thalang police station came under attack from a group protesting police action against suspected drug dealers on Saturday morning. As the barricades were brought to block the police station, this led to the closure of Thepkasattri Road. During the protest, police vehicles in the station compound were set alight and a number of windows were broken while no one was seriously hurt during the protests.\nThe protest at Thalang Police Station started following a police chase that ended in the death of two suspected drug dealers on Saturday. Members of the suspects’ families had come to the Police Station demanding to speak to officers.\nPhuket Governor Chamroen Tipayapongtada and Phuket Police Chief Major General Patchara Boonyasit came to talk to the crowd and quell the situation which resulted in property damage to the building and to 21 cars including nine police vehicles that were set alight.\nThe crowd began to disperse by about 3.30am this morning after a negotiation team from the 41 Army Circle in Nakhon Si Thammarat arrived on the scene. Everything is now back to normal in Phuket and Thepkasattri Road has been reopened to traffic.\nAccording to the latest report from Phuket International Airport, no departure and arrival flights have been affected by the incident. Every flight has been operating as usual.\nHowever, the closure to the road caused a delay to check-in for the passengers to some flights. The airport has provided its assistance to those who are affected according to procedures and conditions. Moreover, two buses have been prepared to accommodate the passengers close to the scene. The Phuket International Airport’s public relations officers are also standing by to provide information and conveniences to those affected.\nSource:- Tourism Authority Of Thailand", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T12:45:40.810+03:00", "highlightTitle": ""}