{"organizations": [], "uuid": "b776bd5b02eef8b664d6b554153efdc4ddd7fcd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/ad23cb4f572e03a62da5c493f777ea29766777c6/c=0-350-1198-1027&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/08/Phoenix/Phoenix/635799267348400638-national1.jpg", "site_section": "http://www.azcentral.com/travel-explore/", "section_title": "Phoenix Arizona Travel Guide, Hotels, Sightseeing - azcentral.com ", "url": "http://www.azcentral.com/story/travel/2015/10/09/favorite-phoenix-area-trails/73613910/", "country": "US", "title": "5 favorite Phoenix-area trails", "performance_score": 0, "site": "azcentral.com", "participants_count": 2, "title_full": "5 favorite Phoenix-area trails", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:37:00.000+03:00", "replies_count": 1, "uuid": "b3bb772b288e44b4ba511f93ab6a32ed2dec7a6d"}, "author": "azcentral.com", "url": "http://www.azcentral.com/story/travel/2015/10/09/favorite-phoenix-area-trails/73613910/#post-0", "ord_in_thread": 0, "title": "5 favorite Phoenix-area trails", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The new Phoenix Trail Guide from Visit Phoenix includes 140 trails in and around the Phoenix metropolitan area. Here are five favorites in McDowell Mountain Regional Park, South Mountain Park, Camelback Mountain, Piestewa Peak and Cave Creek. Some are easy. Some are hard. Some are long. Some are short. At least one of them is right for you.\nNorth Trail, McDowell Mountain Regional Park\nDistance: 2.9 miles.\nRating: Easy.\nWhere: From Fountain Hills, go north on McDowell Mountain Road to the park entrance. The trailhead is about 11 miles from the entrance to Asher View Drive.\nDescription: This is a perfect trail for visitors who want to experience the beauty of the desert without doing a lot of climbing or scrambling. It is open to mountain bikers, but horses are not allowed. The loop trail is flat and wide with great views of the surrounding mountains and is far enough back that hiking traffic is light. When they’re in bloom, it’s a great place to see wildflowers. It crosses a couple of washes, but that’s about as difficult as it gets. There is occasional shade from mesquite trees and a few benches along the route to sit and rest or contemplate.\nAZCENTRAL\nNew guide to Phoenix hiking, biking, equestrian trails\nNational Trail, South Mountain Park\nDistance: 14.3 miles one way.\nRating: Moderate to strenuous.\nWhere: Pima Canyon Trailhead, 9904 S. 48th St., Phoenix.\nDescription: This scenic trail is the spine of South Mountain, and taking it all in during one hike is probably not realistic. But the first 5½ miles or so going west from the Pima Canyon Trailhead will take hikers along an easy fire road and then up to Telegraph Pass. There are great views of downtown Phoenix and the Valley. The area around Telegraph Pass often has good wildflowers in spring.\nEcho Canyon Trail, Echo Canyon Recreation Area\nDistance: 2.3 miles.\nRating: Difficult.\nWhere: 4925 E. McDonald Drive, Phoenix.\nDescription: Hiking Camelback Mountain is a must for many locals visitors, so I’m including it. But beware that while this is a short hike, it is not an easy one. Take plenty of water, even if you don’t think it’s very hot. Wear sturdy shoes. Plan on being out there about two hours. And be prepared to do some serious climbing. When trail builders place chains and pipes to grab onto, that’s steep. You will climb about 1,300 feet in just over a mile.\nAZCENTRAL\nGuide to the Superstition wilderness\nFreedom Trail, Phoenix Mountains Preserve\nDistance: 3.7 miles.\nRating: Moderate.\nWhere: 2701 E. Squaw Peak Drive, Phoenix. Take the first left past the ranger station to the Hopi Trailhead. Follow the Trail 302 signs.\nDescription: Beat the crowds going up and down the Summit Trail on Piestewa Peak by taking the Freedom Trail, a loop around the circumference. OK, you might not avoid all the crowds, but the Freedom Trail is far less traveled and will take you to places where it will be hard to believe there is a city all around you. You won’t go to the peak, but you’ll get about 800 feet of total climbing in the loop.\nSpur Cross Trail, Spur Cross Ranch Conservation Area\nDistance: 5.2 miles.\nRating: Moderate.\nWhere: 44000 N. Spur Cross Road, Cave Creek.\nDescription: This is part of the Maricopa Trail, a planned system of about 240 miles of trails that will one day (hopefully) connect numerous regional and municipal parks in Maricopa County. This hike will get you away from just about everything except maybe some wildlife. Crossing Cottonwood Creek, the trail switches back and forth, ascending about 500 feet in the first couple of miles. It connects to the moderate Cave Creek Trail System as well as the far more difficult Elephant Mountain Loop.\nAZCENTRAL\nBest spots to see Arizona's fall colors", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/b9cc448f826df6c16578427fb158f34ca731b476/c=95-0-2184-1180&r=x633&c=1200x630/local/-/media/Phoenix/None/2014/10/20/635493990159270006-phxdc5-6hgrw4j5nmciic926tz-original.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/5856ebb37c86df44fb46ee8d15ba159adf847530/c=483-0-3995-3512/local/-/media/2015/10/06/Phoenix/Phoenix/635797365506487604-echo.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/2f7b005d84bc9465f095e1deecbfd2fb03b84d93/c=304-0-2128-1824/local/-/media/2015/09/23/Phoenix/Phoenix/635786132858142166-West-Fork-2.jpg"], "published": "2015-10-09T16:37:00.000+03:00", "crawled": "2015-10-11T20:50:30.147+03:00", "highlightTitle": ""}