{"organizations": ["News Vueling Airlines", "Vox", "International Air Transport Association", "Breaking Travel News | News Delta Air Lines", "Mercedes-Benz", "International Airlines Group", "Delta", "Barcelona", "Breaking Travel News | News Virgin Trains", "Travel Marketing Forbes", "Breaking Travel News | News Frasers Hospitality"], "uuid": "489903b161654ef554558c516c5a0bf8cf4e3534", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newslocker.com", "main_image": "http://www.newslocker.nl/images/newslocker-cube.png", "site_section": "http://www.newslocker.com/en-us/news/travel/rss/", "section_title": "Travel - Newslocker", "url": "http://www.newslocker.com/en-us/news/travel/heres-how-to-travel-to-cuba-vox/", "country": "", "title": "Here's how to travel to Cuba - Vox", "performance_score": 0, "site": "newslocker.com", "participants_count": 0, "title_full": "Here's how to travel to Cuba - Vox", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:00:00.000+03:00", "replies_count": 0, "uuid": "489903b161654ef554558c516c5a0bf8cf4e3534"}, "author": "", "url": "http://www.newslocker.com/en-us/news/travel/heres-how-to-travel-to-cuba-vox/", "ord_in_thread": 0, "title": "Here's how to travel to Cuba - Vox", "locations": ["Cuba", "Milan", "Washington", "Manchester Airport", "Europe", "Italy", "New York", "USA", "U.S.", "Rome", "Alicante", "North Atlantic", "Asia", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Richard Anderson", "Hallie Crawford", "Marty McFly", "Fraser", "Obama", "Brian Kelly"], "text": "Here's how to travel to Cuba Vox You should go to Cuba. If you need convincing, we made a 2-minute video you should see: Like this video? Subscribe to Vox on YouTube. Traveling to Cuba isn't hard anymore. It used to be difficult, but now it's not. In January, President Obama announced ...and more » U.S. News & World Report (blog) How to Handle Work Travel Like a Pro U.S. News & World Report (blog) Always packed power cords, chargers and other important tech accessories in your carry-on bag. By Hallie Crawford Oct. 21, 2015 | 10:39 a.m. EDT + More. I am a road warrior. It sounds exciting and strong, doesn't doesn't it? It sounds like a gladiator ... New travel guides aim to please and feed The Columbian \"Italy: From the Source\" is part of a new line of cookbooks that offer takes on the cuisine of a particular country. (Lonely Planet). \"Thailand: From the Source\" is part of a new line of cookbooks that offer takes on the cuisine of a particular country ... China sees bumps in the outbound travel ride but online developments keep rising Eye For Travel When an industry is worth over $50 billion, then every percentage move is big money. This is the latest Chinese official figure for the country's online travel transactions last year, and it was a rise of 39%. China's outbound travel has been seen as a ... via Breaking Travel News | News Frasers Hospitality has raised the ante on designer living, with the launch of ‘Mercedes-Benz Living @ Fraser’ this November.The new option will bring together the cutting-edge design and innovative technologies for which Mercedes-Benz is renowned for, with the Gold-Standard service excellence that is synonymous with Frasers Hospitality. via Breaking Travel News | News Vueling Airlines has said it will launch two new routes from Manchester Airport for summer 2016. Part of International Airlines Group, Vueling will offer direct services to Alicante and Rome from June 2016. The Spanish low cost airline will operate three flights a week to Alicante and two flights a week to Rome in addition to their existing service to Barcelona, which started in June 2015. via Breaking Travel News | News TripAdvisor has announced the launch of the Review Performance report – an enhanced online analytics dashboard available for free to all registered businesses on the site. Designed based on user feedback, the new dashboard provides registered business owners with insights and trend data about their reviews, ranking and competitors in an interactive online display. via Breaking Travel News | News Delta Air Lines has finished a day with no cancelled flights for the 100th time in 2015, reaching a remarkable operational milestone with three months to go in the year. In a message to Delta employees, chief executive Richard Anderson said of the feat: “This is an unprecedented accomplishment that should make all Delta people proud. Advertisers find new dimensions in travel audience data Tnooz The travel and leisure industry was one of the first to be transformed by digital. The industry is somewhat unique in that price is proven to be the overwhelming factor consumers are concerned with – their personal experience with a particular brand is ...and more » Destination Creativity: Genius Ideas in Travel Marketing Forbes I'm always amazed by the ingenuity of the travel profession's top destination marketers, individuals responsible for getting their communities on the “must visit” lists of leisure travelers across the globe. The combination of a great product (exciting ... via Breaking Travel News | News Virgin Trains has unveiled its new look for its staff working on its east coast route. The new red hot uniform features fresh micro checked shirts and blouses, bright and bold red ties and scarves, plus waistcoats and jumpers – helping both staff and customers to connect with the Virgin brand. via RSS for travel Strong growth on flights within Europe and across the North Atlantic raised international air traffic 5.4 percent year over year in August, as Asia demonstrated weakness, according to the International Air Transport Association. Traffic within Europe, including connecting flights on longer-haul ... Go back in time with other time-travel faves USA TODAY You've watched Marty McFly get his parents back together in 1955, check in on what things are like in the “future” of 2015 and mosey over the Old West of 1885. So what's next after celebrating the 30th anniversary of Back to the Future? Pop culture has ... The right way — and the wrong way — to redeem your travel rewards Washington Post For the average person flying coach from Italy to New York, the highlight of the nine-hour flight in a cramped airplane seat might be a hot meal or a good movie to pass the time. But when Brian Kelly flew home to New York from Milan at the end of a two ...  ", "external_links": [], "published": "2015-10-21T17:00:00.000+03:00", "crawled": "2015-10-22T00:14:00.953+03:00", "highlightTitle": ""}