{"organizations": [], "uuid": "6f6fbd2f4854627f2c74fa59711de3cdac8bf9ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "robbreport.com", "main_image": "http://robbreport.com/sites/default/files/images/articles/2015Oct/1793156//four-season-safari-lodge-03.jpg", "site_section": "http://robbreport.com/rss-luxury-travel", "section_title": "Luxury Travel - Robb Report – Your Global Luxury Resource", "url": "http://robbreport.com/luxury-travel/take-solo-serengeti-safari-through-four-seasons-new-africa-travel-package-video", "country": "US", "title": "Take a Solo Serengeti Safari through the Four Seasons’ New Africa Travel Package [VIDEO]", "performance_score": 0, "site": "robbreport.com", "participants_count": 1, "title_full": "Take a Solo Serengeti Safari through the Four Seasons’ New Africa Travel Package [VIDEO]", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T10:00:00.000+03:00", "replies_count": 0, "uuid": "6f6fbd2f4854627f2c74fa59711de3cdac8bf9ab"}, "author": "Viju Mathew", "url": "http://robbreport.com/luxury-travel/take-solo-serengeti-safari-through-four-seasons-new-africa-travel-package-video", "ord_in_thread": 0, "title": "Take a Solo Serengeti Safari through the Four Seasons’ New Africa Travel Package [VIDEO]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Viju Mathew October 22, 2015 \nThomas Jefferson said, “One travels more usefully when they travel alone, because they reflect more.” Given this sentiment, the Lone Ranger on the Serengeti package at the Four Seasons Safari LodgeSerengeti presents an ideal opportunity for untamed introspection. Designed for adventurers traveling solo to Tanzania, the experience reveals the beauty of the African landscape and its inhabitants, while providing a boutique base camp for self-discovery. \n\nSet in the center of the Serengeti (Maasai for “endless plains”) National Park, the 77-room Four Seasons Safari Lodge Serengeti provides a springboard for wilderness exploration and wildlife viewing in a region renowned for the largest land-based migration of mammals on the planet. Each morning will kick off with a game drive to seek out the park’s more elusive residents in their natural surroundings. In the afternoon, guests will gather with the lodge’s resident naturalist, Maasai guides, and park rangers to set off on a 90-minute walking safari in search of elephants, giraffes, warthogs, and a cornucopia of other creatures. The hikers will learn how to use the latest tracking technology—including camera traps—to record animal activity. Once back at the Four Seasons Discovery Centre (the first research and educational facility of its kind in East Africa), participants recover captured footage and create their own digital keepsake. \nTo help satisfy the appetite for adventure, a daily cooking class explores regional recipes shared by local culinary masters. When the desire for socializing has been sated, guests return to their lodgings for a ritual bath experience and a private, in-room dinner. And as evening entertainment, the film Out of Africa is ready to play on DVD—naturally. \nAlso included in the $895 per night price are three daily meals at any of the resort’s restaurants, all local libations (including beer, wine, and liquor), use of the fitness center and infinity-edge pool (overlooking a popular watering hole), and transfer to and from the Seronera airstrip. To further enhance Serengeti serenity, therapies based on indigenous techniques are available at the Four Seasons full-service spa for an additional cost—but then again, solo travelers can afford to be more self-centered. ( fourseasons.com  ", "external_links": [], "published": "2015-10-22T10:00:00.000+03:00", "crawled": "2015-10-23T19:29:21.783+03:00", "highlightTitle": ""}