{"organizations": ["Sony", "Your First Choice Electric"], "uuid": "68ebe08e40574dd23c9a83cd1819c7700f95e5fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/airwheel_intelligent_two_wheel_self_balancing_electric_scooter_your_first_c/", "country": "US", "title": "Airwheel Intelligent two wheel self-balancing electric scooter, Your First Choice", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Airwheel Intelligent two wheel self-balancing electric scooter, Your First Choice", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:04:00.000+03:00", "replies_count": 0, "uuid": "68ebe08e40574dd23c9a83cd1819c7700f95e5fe"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/airwheel_intelligent_two_wheel_self_balancing_electric_scooter_your_first_c/", "ord_in_thread": 0, "title": "Airwheel Intelligent two wheel self-balancing electric scooter, Your First Choice", "locations": ["France", "United States", "Airwheel", "America", "England", "Australia", "Korea", "Germany", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Airwheel"], "text": "Airwheel Intelligent two wheel self-balancing electric scooter, Your First Choice Electric bike is an essential and familiar transport to a lot of people, but only a few know and try electric self-balancing scooter. United States, 21 October 2015 -- Choosing a good electric scooter makes your life easier, happier and more efficient. Electric scooter’s price varies from 1000 to 5000. Those above 10,000 have limited market share and development space. Many buyers are attracted by the low price, but forget to examine the scooters’ quality. A few people known that inferior brand is unreliable, so it is not surprised to see the news about battery explosion. Battery is the core of an electric scooter, which determines the riding speed, riding time, and life range. Airwheel intelligent scooter always aims to be perfect in every aspect, so it uses the imported Sony battery, which can be charged for over 1800 times. A good product is always customer-oriented, which is not only eco-friendly, but also high. Airwheel electric scooter is outfitted with the most intelligent chip, using aerospace attitude control theory, fuzzy software algorithm, and gyroscope system to realize self-balance by leaning forwards and backwards. Rider only needs to move forwards or backwards slightly to control it, to speed up or slow down. Airwheel electric intelligent scooter is safe, portable, and environmentally friendly. Besides, Airwheel intelligent scooter is not a transport, but also a good way for people to do exercise. Though it is powered by electricity, riding it for 30 minutes costs 285 calories and riding around cones for 30 minutes costs 900 calories. At the same time, it can improve people’s balancing ability and nerve reflex flexibility, which trains our shoulders, ridge, arms and legs, and builds up our body as well.As a well-known brand in electric scooter industry, Airwheel intelligent scooter sells well in scores of countries, such America, Germany, England, Italy, Korea, Australia and France. Since the establishment of Airwheel , it has win public praise and attracted a great number of users. Airwheel never stops to bring you the most fashionable riding experience. Let’s choose Airwheel! # # #", "external_links": [], "published": "2015-10-21T01:04:00.000+03:00", "crawled": "2015-10-21T17:35:51.640+03:00", "highlightTitle": ""}