{"organizations": [], "uuid": "ec2918bda0fa858beea315a93d1fcd08afe2a675", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/10/21/17/2DA2443500000578-0-image-a-17_1445444065375.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3282735/Too-tired-talk-hotel-snacks-toiletries-HANGOVER-CURES-ordered-using-emojis.html", "country": "GB", "title": "Too tired to talk? The hotel where snacks, toiletries and HANGOVER CURES can all be ordered using emojis", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Too tired to talk? The hotel where snacks, toiletries and HANGOVER CURES can all be ordered using emojis | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:41:00.000+03:00", "replies_count": 1, "uuid": "ec2918bda0fa858beea315a93d1fcd08afe2a675"}, "author": "Georgia Diebelius For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3282735/Too-tired-talk-hotel-snacks-toiletries-HANGOVER-CURES-ordered-using-emojis.html", "ord_in_thread": 0, "title": "Too tired to talk? The hotel where snacks, toiletries and HANGOVER CURES can all be ordered using emojis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "8 shares 1\nView\ncomments\nWhat could be easier than phoning for room service? Texting for it.\nA new service, which was launched by Aloft Hotels today, allows guests to text emoji combinations to the Manhattan property's front desk to receive items such as crisps, deodorant and painkillers.\nThe Text it, Get it, programme (TiGi) consists of six packages that can be ordered by sending over a string of images along with the guests room number and surname.\nThe hotel began offering the services - that will be available if ordered by emoji - this morning in Manhattan\nFor guests suffering the effects of a big night out, they can text the water droplet, pill and banana emoji for the $10 (£6.50). This 'Hangover Package' is made up of two bottles of Vitamin Water, Advil and two bananas.\n 2 Next Would YOU pay for Michelin-star starvation? Luxury 'medical... Astonishing pictures show the remains of an Airbus A330's... Who said London was expensive? It is now cheaper to travel... A pool with a view: Architects unveil plans for spectacular... Breathe in! Prague's narrowest street is so tiny that... Curtained pool decks and rooms with prayer mats and copies... The Text it Get it system consists of six packages\nBy stringing together and sending emojis of a chocolate bar, lollipop and cookie, for $10 (£6.50) you will have ordered the 'Munchies' package. This features a bottle of Coca-Cola, a Snickers, Doritos and a chocolate brownie - and a phone with a two pin plug will get you a phone charger delivered for $25 (£16).\nOther packages include the 'Re:Fresh', comprising a toothbrush, toothpaste, a razor, shaving foam and deodorant, the 'Sightseer', which is a $10 MetroCard, a city map and two drinks at the hotel bar and the 'Surprise Me' box - which is describe as 'fun swag and cool stuff' for $25 (£16).\nAlthough the service is only currently available at Aloft in Manhattan Downtown, it could expand to Europe, Asia and the rest of the U.S. within the coming weeks.\nThe hotel's new concept follows in the footsteps of Domino's pizza, which in May launched a system letting customers order food with emojis on Twitter - but it's only available in the U.S.\n'EasyOrder' allows customers to create an account on the Domino’s website, with details of their pizza preferences and address, so that when the emoji is sent, so is the pizza.", "external_links": ["http://dailym.ai/1hTGvpp"], "published": "2015-10-21T23:41:00.000+03:00", "crawled": "2015-10-21T22:01:10.845+03:00", "highlightTitle": ""}