{"organizations": [], "uuid": "0b8c4b972ace191a8f82a3d42ed4151ebcaaf492", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03467/Majestic_Princess_3467249k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/cruises/11918676/Majestic-Princess-Princess-Cruises-names-new-600-million-ship-designed-for-Chinese.html", "country": "US", "title": "Majestic Princess: Princess Cruises names new €600 million ship designed for Chinese", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Majestic Princess: Princess Cruises names new €600 million ship designed for Chinese - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:12:00.000+03:00", "replies_count": 1, "uuid": "bb2763f444c71613d310c4048bfc061511bf380d"}, "author": "Teresa Machan", "url": "http://www.telegraph.co.uk/travel/cruises/11918676/Majestic-Princess-Princess-Cruises-names-new-600-million-ship-designed-for-Chinese.html#post-0", "ord_in_thread": 0, "title": "Majestic Princess: Princess Cruises names new €600 million ship designed for Chinese", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Princess Cruises' newest ship, launching in summer 2017, will be called Majestic Princess. The 3,560-passenger vessel is the third \"Royal Class\" ship for the cruise line and has been designed with Chinese passengers in mind. The ship will carry a Chinese name on the hull, 盛世公主号 (Shèng Shì Gōng Zhǔ Haò) – chosen by Carnival plc's China employees and interpreted as “Grand World” or “Grand Spirit.” “We’re excited to be the first line to offer a genuine premium cruise option to Chinese vacationers,” said Jan Swartz, president of Princess Cruises . \"[Majestic Princess] represents our brand’s long-term commitment to the continuing growth of the China market.” T'ai chi at sea, ballroom dancing, subtitled Hollywood movies, Chinese satellite TV channels and a souped-up designer shopping experience are among the \"Princess Class\" experiences being rolled out to the Chinese market. Priority will be placed on food, amenities and shopping. In addition to the 24-hour buffet at sea, a wide variety of traditional Chinese dishes will also be offered for breakfast, lunch and dinner. The rapidly expanding Chinese cruise market has seen a parade of international ships moving to China. MSC Cruises announced last month that it will deploy its 1,976-passenger MSC Lirica to Shanghai, while Royal Caribbean's Quantum of the Seas sails from Shanghai. Following its launch in China next April Ovation of the Seas will sail from Tianjin. China has the potential to deliver 83 million cruise passengers a year according to a recent study by the Hong Kong Tourism Board. • China plots domination of the global cruise market Princess ships began homeport cruising in China in 2014 with an inaugural season of Shanghai-based cruises aboard Sapphire Princess, which visited cities including Seoul (Incheon), Busan and Jeju Island in South Korea and Fukuoka (Hakata), Kagoshima, Okinawa and Nagasaki in Japan. Majestic Princess will be based in China year round and will begin sailing to Japan and South Korea (ports not yet confirmed) from Shanghai in summer 2017. SeaWalk Most of the signature features shared by sister ships Royal, and Regal Princess, will also be on the new ship, including the above-the-water SkyWalk which is cantilevered over the sea, Starboard; a multi-level atrium; multiple dining venues including the exclusive Chef's Table Lumiere; the adults-only Sanctuary spa and the on-deck Movies Under the Stars cinema experience. Eighty per cent (all outside staterooms) of Majestic's cabins will have balconies. These will be configured to appeal to families and multi-generational travellers. Read more: Saga's all-new balcony cruise ship Weighing in at 143,000 grt and with a build cost of €600 million Majestic Princess is being built at the Italian shipyard Fincantieri, where P&O Cruises' Britannia, Princess's Royal and Regal Princess and Carnival Magic were built. Telegraph Cruise & Travel Show Monty Halls will be speaking at this month’s Telegraph Cruise & Travel Show about his adventures in the Galapagos, and the Sardine Run in South Africa.The former Royal Marine turned travel adventurer will headline the show, being held at Exhibition Centre Liverpool on Saturday October 17 and Sunday October 18, from 10am-5pm. More than 50 cruise lines will be exhibiting along with travel experts, Telegraph journalists and cruise experts. Cruise lines include Viking Cruises, Noble Caledonia and Hurtigruten. Tickets cost £10; discounted price available (use code: TELETRAVEL). Offer ends October 16. For more information, to book a ticket and to pre-book a session with a Cruise Lines International Association expert, see telegraph.co.uk/cruisetravelshow . Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-10-09T20:12:00.000+03:00", "crawled": "2015-10-10T16:37:29.431+03:00", "highlightTitle": ""}