{"organizations": [], "uuid": "dffa835ce229a0bec2627b27ae511be553121300", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytelegraph.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/c87baef9b47a50fc853d85e9e0a68236", "site_section": "http://www.dailytelegraph.com.au/travel/travel-news", "section_title": "Travel News | Australian Holiday News and Travel News | dailytelegraph.com.au", "url": "http://www.dailytelegraph.com.au/lifestyle/health/the-natural-cold-remedy-causing-anaphylaxis/story-fni0diab-1227562562070", "country": "US", "title": "Cold remedy A.paniculata linked to anaphylaxis", "performance_score": 0, "site": "dailytelegraph.com.au", "participants_count": 1, "title_full": "Cold remedy A.paniculata linked to anaphylaxis | DailyTelegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:31:00.000+03:00", "replies_count": 0, "uuid": "dffa835ce229a0bec2627b27ae511be553121300"}, "author": "Sue Dunlevy", "url": "http://www.dailytelegraph.com.au/lifestyle/health/the-natural-cold-remedy-causing-anaphylaxis/story-fni0diab-1227562562070", "ord_in_thread": 0, "title": "Cold remedy A.paniculata linked to anaphylaxis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A HERB used in common alternative cold and flu remedies has been linked to 43 cases of anaphylaxis prompting the medicines watchdog to issue a warning.\nThe herbal ingredient A. paniculata is claimed to relieve fever, the symptoms of colds, alleviate sore throats, alleviate gastrointestinal upsets and acute diarrhoea and aid recovery from mild respiratory tract infections.\nIt is listed as an ingredient in Blackmores Cold Combat tablets, Ethical Nutrients Immune Defence formula and a product called KoldKare.\nThe Therapeutic Goods Administration has revealed between December 2002 and April 2014, it received 43 reports of anaphylaxis and 78 reports of other allergic-type reactions associated with products that contain A.paniculata.\n“Consumers and health professionals are advised that, following a safety review of Andrographis paniculata (A.paniculata) the TGA has found a potential risk of allergic reactions, including severe allergic reactions such as anaphylaxis, associated with the use of products containing this herbal ingredient,” it said in a safety advisory.\nDangerous ... A. paniculata is claimed to relieve fever and the symptoms of colds. Picture: iStock The herbal ingredient used in some complementary medicines is indigenous to India, Ceylon, and Java.\n It is also known as kalmegh and green chiretta in Ayurvedic medicine, and chuanxinlian in traditional Chinese medicine, the TGA says.\nThe TGA is now considering whether any further action is required, and says in the meantime will continue to monitor products containing A.paniculata.\n“If you use a medicine that contains A.paniculata and suspect that you are experiencing any signs or symptoms of an allergic reaction, stop using the product and consult a health professional,” the TGA says.\nDr Lesley Braun, the Director of Blackmores Institute, said andrographis has been the active ingredient in the company’s Cold Combat product for 13 years.\n“In that time, we have sold more than 24 million doses and it is generally a very well-tolerated ingredient,” she said.\n“Allergic reactions can come from exposure to any natural compound including foods, plants and herbal medicines, so it’s timely that consumers are reminded of the signs to look for,” she said.\n“I’d recommend anyone who has been taking a product containing andrographis without any negative reaction, that it’s likely to continue to be well-tolerated and there’s no reason to stop taking it,” she said.\nWatch out ... the TGA has found A.paniculata carries a potential risk of allergic reactions such as anaphylaxis. Picture News Corp. Blackmores would definitely consider adding a warning about the reaction to the label because it’s important that our consumers have access to information about the medicines they choose, she said.\nPaul Mannion, the technical director of Healthworld Limited, which makes Ethical Nutrients products, said there had been three anaphylactic reactions to his company’s Immune Defence product in the last ten years and a dozen allergic reactions.\nHe stressed that people could be allergic to a range of medications and foods including peanuts, whey protein, yeast and aspirin.\nHis company is co-operating with the TGA review and would consider putting warning labels on the product if the TGA decided it was appropriate.\nSigns and symptoms of severe allergic reactions can include one or more of the following:\n• hives or welts (a red, itchy, lumpy rash, like mosquito bites)\n• a tingling feeling in or around the mouth\n• stomach pain, vomiting and/or diarrhoea\n• facial swelling\n• difficulty with breathing and/or noisy breathing\n• swelling of the tongue\n• swelling and/or tightness in throat\n• difficulty talking and/or hoarse voice\n• loss of consciousness and/or collapse.\nOriginally published as Warning over natural cold remedy", "external_links": ["http://cdn.newsapi.com.au/image/v1/77d9b6f3df2e4881f21565fe26186639", "http://cdn.newsapi.com.au/image/v1/4b9458384c1b39ce1dc00c1b392718ad", "http://cdn.newsapi.com.au/image/v1/9ad1be769b5eb94b37cc926dc2f58c42", "http://cdn.newsapi.com.au/image/v1/dc7a58158ef06303c3bbed972721916b", "https://www.tga.gov.au/", "http://cdn.newsapi.com.au/image/v1/1d97c1975bd6c22a964e36b89d4e386a?width=650", "http://www.news.com.au/lifestyle/health/the-natural-cold-remedy-causing-anaphylaxis/story-fneuzlbd-1227562562070?sv=5e5b4736dafe026550e9466a1d75daa3", "https://www.tga.gov.au/alert/products-containing-andrographis-paniculata", "http://cdn.newsapi.com.au/image/v1/bca21e0a01245c0e1e4042b934a7b636?width=650", "http://cdn.newsapi.com.au/image/v1/fb509cbd13e5ff9c1c96fa2553068811", "http://cdn.newsapi.com.au/image/v1/1c99bb1f2999ff8678647339409be444", "http://pixel.tcog.cp1.news.com.au/track/news/content/v1/?category=/section/dailytelegraph.com.au/collection/popular-content/all/24hours/&t_product=most-popular-mobile&td_standfirst=false&td_kicker=false&td_byline=false&td_resultSize=6&maxRelated=20&display:footer=true&origin=omniture&t_template=s3/chronicle-component/otherstories/templates/index&domain=dailytelegraph.com.au"], "published": "2015-10-08T18:31:00.000+03:00", "crawled": "2015-10-08T22:07:04.582+03:00", "highlightTitle": ""}