{"organizations": [], "uuid": "3d686a0c8e4192da0e28963a84623a9568678a58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "offtoneverland.com", "main_image": "http://otn.offtoneverlandtr.netdna-cdn.com/wp-content/uploads/2014/07/IMG_4365-1024x996.jpg", "site_section": "http://www.offtoneverland.com/feed/", "section_title": "Off to Neverland Travel - Disney Vacations", "url": "http://offtoneverland.com/the-disney-difference/", "country": "US", "title": "The ‘Disney Difference’", "performance_score": 0, "site": "offtoneverland.com", "participants_count": 1, "title_full": "The ‘Disney Difference’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T09:00:00.000+03:00", "replies_count": 0, "uuid": "3d686a0c8e4192da0e28963a84623a9568678a58"}, "author": "Off to Neverland Travel", "url": "http://offtoneverland.com/the-disney-difference/", "ord_in_thread": 0, "title": "The ‘Disney Difference’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Off to Neverland Travel ® Director of Marketing Kyle Froman \nThe ‘Disney Difference’. \nIt’s that extra little sprinkling of pixie dust and magic that keeps beckoning us to visit “The Happiest Place on Earth” from all around the globe. \nAt times the ‘Disney Difference’ can be hard to describe with our words, yet when experienced, it is completely undeniable. \nLast week after navigating a long and busy day at Magic Kingdom ® Park, my family and I were ready for a brief reprieve from the heat of the day and bustle others around us also enjoying their time in the park. \nWe retreated to Fantasyland ® Area to rest and refresh at Gaston’s Tavern. After scouting a location to sit and rest I slipped away to get us a few LaFou’s Brews from the counter. \nAfter ordering and waiting what felt like only a few seconds I was handed our drinks by one of Gaston Tavern’s Cast Members. When I went to tap my wrist and pay the Cast Member quickly and proudly replied, “these are on us today!” \nIt was the ‘Disney Difference.’ \nIt re-energized us and completely transformed the rest of our day. \nA few days later we were ‘dragging’ through Epcot ® after a full day and we decided to slow ourselves down with a visit to Character Spot. As we moved towards the queue a Cast Member asked where we were heading next. As we shared with him our Character Spot plans he encouraged us that now was a ‘great time to go’ as the line was only 5 or 10 minutes. \nWe smiled and continued towards the queue. \nAs we approached, we noticed the wait time was actually 45 minutes so we turned to walk away. As we did, the Cast Member that had just spoken to us approached us and said “follow me”. \nHe proceeded to lead us to the FastPass+ entrance and through the FastPass+ queue. Our wait did, indeed, end up being only 5 to 10 minutes thanks to the special touch this Cast Member added to our evening. \nIt was the ‘Disney Difference.’ \nWe decided to end our night at Epcot ® with a ride on Soarin ’® Attraction since our 4 year old had finally ‘risen’ to the minimum height requirements. It was his first ride! We chose to ride during IllumiNations: Reflections of Earth so that the wait time would be a minimal. \nFollowing our relatively short 45 minute wait, as we were boarding Soarin ’® Attraction our 4 year old looked to the Cast Member nearest to him and said “Am I going to die?!” \nThe Cast Member was quick to assure him, and then adore him, before sending us off for our flight. \nAs our flight over California came to an end the same Cast Member returned and asked our 4 year old if we’d like to be on Soarin ’® Attraction’s last flight for the night…of course we did! \nIt was the ‘Disney Difference.’ \nIt’s the extra magic that Walt Disney World ® Resort brings to every guest’s vacation. \nIt’s takes on different shapes for every guest and trip, but I’m certain that you will experience that same ‘difference’ on your next trip too! \nIn fact, our Magic Makers ® are ready to sprinkle some pixie dust of their own, so be sure to contact us about helping your family navigate the Happiest Place on Earth! By | October 23rd, 2015 | Categories: Disney News | | 0 Comments Share This Story, Choose Your Platform!", "external_links": [], "published": "2015-10-23T09:00:00.000+03:00", "crawled": "2015-10-26T17:43:58.850+02:00", "highlightTitle": ""}