{"organizations": [], "uuid": "63c30323d00292b2797f5ca35a10344096ee7c1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03473/bernard_lapasset_w_3473682k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-15.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sport/rugbyunion/rugby-world-cup/rugby-power-50/11934337/bernard-lapasset-continues-to-reshape-rugby-union.html", "country": "US", "title": "Bernard Lapasset continues to reshape rugby union", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Bernard Lapasset continues to reshape rugby union - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T21:00:00.000+03:00", "replies_count": 0, "uuid": "63c30323d00292b2797f5ca35a10344096ee7c1e"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sport/rugbyunion/rugby-world-cup/rugby-power-50/11934337/bernard-lapasset-continues-to-reshape-rugby-union.html", "ord_in_thread": 0, "title": "Bernard Lapasset continues to reshape rugby union", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rugby Power 50: No 28 Bernard Lapasset The first time I saw Bernard Lapasset was at the Rugby World Cup final in 1995. I was in Johannesburg simply as a punter, part of a tour group from Australia. Bernard was on the podium, thenthe very young chairman of the International Rugby Board (IRB), and the president of the French Rugby Federation (FFR). In those days, the chairmanship of the IRB rotated on an arranged basis, without the need for a vote by the constituents. Those were the days. Yet here we are, 20 years later, in the middle of a fabulous RWC 2015 , hosted by England, and Bernard remains the chairman of World Rugby (the rebranded IRB) and also Rugby World Cup Ltd, which owns the RWC franchise on behalf of World Rugby. For clarity, Bernard had just that one year, 1995, as IRB chairman. However, he remained as president of the FFR until 2007, a remarkable achievement in the world of rugby politics. He retired from that position because he was chosen unanimously by the IRB constituents to succeed Dr Syd Millar as only the third elected chairman of the IRB. Bernard’s election was a significant coincidence as France was the host of RWC 2007, a huge success by any measure, with Bernard leading the organising committee with great skill and experience. I met Bernard in person in 1996, when I became one of the Australian Rugby Union (ARU) delegates to the IRB. I was ARU chief executive from 1995-2004 and again from 2007-2012, during which time I served on the IRB and for a few years as a director of Rugby World Cup Ltd. Over that time, Bernard and I struck up a friendship that remains to this day. An IOC delegate told me that longheld suspicions that rugby was too Anglo-Celtic centric were dispelled by Bernard Longevity and success is rare in the business and politics of most sports, and rugby is no different. As with the game itself, it can be tough, sometimes brutal and uncompromising. Bernard has survived and succeeded in the national and international arenas over an exceptionally long time. One of many examples of his contribution and influence for the betterment of the game is rugby union’s reinstatement as an Olympic sport, from 2016 in Rio de Janeiro, with the sevens version of the game. It was a long campaign, but Bernard’s diplomatic skills and international network paid dividends. A senior International Olympic Committee delegate later told me that the long-held suspicion that rugby was too Anglo-Celtic centric was dispelled when Bernard addressed his first meeting of the IOC executive board in four languages: French, English, Spanish and Italian. He has focused a lot of his efforts on the developing nations, through funding and improved competition options. Argentina’s inclusion in the Sanzar Rugby Championship was assisted with IRB funding. Similar initiatives are occurring in Europe, North America and the Pacific Islands. Finally, the decision to appoint Japan as host for RWC 2019, the first to be hosted by a “nontraditional” rugby nation, was taken under Bernard’s leadership. A brave, but visionary decision. Bernard’s second four-year term as chairman expires in May 2016. I don’t know if he will seek another four years but suspect he would like to. You would expect that there will be other candidates: Bill Beaumont, the RFU chairman who lost to Bernard by one vote in 2012 in acrimonious circumstances, could be one. Regan Hoskins, from South Africa, the current deputy, may stand; Michael Hawker, a dark horse from Australia, might too. Bernard’s detractors criticise his “style”, describing it as a bit chaotic and not inclusive. English is not his native tongue (which it is for the most part around World Rugby tables) so that’s a factor. Whatever the future holds, thank you Bernard. Rugby owes you a great deal. The Rugby Power 50 panel Josh Lewsey England World Cup winner in 2003, WRU head of rugby and Toshiba representative Will Greenwood England World Cup winner in 2003, Telegraph columnist and Sky Sports analyst Maggie Alphonsi England World Cup winner in 2014 Paul Vaughan former chief executive of England Rugby 2015 and RFU business operations director John O’Neill former chief executive of the Australian Rugby Union Gavin Mairs Telegraph rugby writer Jonathan Davies former Wales outside-half and now BBC analyst Mick Cleary Telegraph rugby correspondent Judge’s comment “As chairman of World Rugby, Bernard has been one of the most powerful influences in the global game for almost three decades. And in his role as vice-chairman of the National Olympic Committee, he played a key role in securing a place for Sevens in the Olympic Games in Rio next year.” Gavin Mairs The sponsor Toshiba, the global electronics company, is proud to be an official sponsor of Rugby World Cup 2015 – the third successive tournament at which it has had such a role. The company, which is also the official sponsor of the Japan men’s rugby union team, is providing many of its products to support the running of the event. Toshiba has six “pillars” by which it runs. These are community, sustainability, leadership, innovation, quality and design. These principles are fundamental to rugby and were used to help decide the Rugby Power 50. Who is No 1? For the full Rugby Power 50, visit telegraph.co.uk/rugbypower50 Telegraphsportpage Follow @telegraphsport", "external_links": [], "published": "2015-10-15T21:00:00.000+03:00", "crawled": "2015-10-16T14:17:52.342+03:00", "highlightTitle": ""}