{"organizations": [], "uuid": "b9a13af73a1f55568dc494aec4a28e80a8e20097", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03461/Article_3461207a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-02.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/promotions/11907251/Join-the-Telegraph-Casino-and-you-could-be-on-your-way-to-Monte-Carlo.html", "country": "US", "title": "Join the Telegraph Casino and you could be on your way to Monte Carlo", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Join the Telegraph Casino and you could be on your way to Monte Carlo - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:30:00.000+03:00", "replies_count": 0, "uuid": "b9a13af73a1f55568dc494aec4a28e80a8e20097"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/promotions/11907251/Join-the-Telegraph-Casino-and-you-could-be-on-your-way-to-Monte-Carlo.html", "ord_in_thread": 0, "title": "Join the Telegraph Casino and you could be on your way to Monte Carlo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Telegraph Casino is a new and exciting online casino, offering a wide range of classic table games, slots and bingo. Sign-up now at www.telegraph.co.uk/casino and you could win a luxury VIP weekend for you and three friends to Monte Carlo including a real life casino experience with spending money. The Telegraph has teamed up with IGT, a leader in global gaming with more than 30 years of experience, to launch Telegraph Casino for our UK readers. It’s designed for the discerning reader so whether you are a new or experienced player, Telegraph Casino is guaranteed to have something to entertain you. Licensed and regulated by the UK Gambling Commission, Telegraph Casino provides a fair and safe gaming environment for all our readers to enjoy and to play responsibly. Win a VIP holiday To celebrate the launch, Telegraph Casino is running an exclusive competition offering unbelievable prizes to be won. Every deposit made and played through between October 1 and October 31, 2015 will earn all new Telegraph Casino players an entry into a prize draw. The top prize gives one player and three friends a luxury VIP experience in the glitz and glamour of Monte Carlo including flights, hotel, and spending money all included. Second prize will offer one player and a friend a VIP weekend and soaking up the sun in Marbella including a real life casino experience. The third prize is a luxury weekend for two taking in the sights of London. Sign-up today to experience a fantastic suite of world-class online games at Telegraph Casino, including roulette, blackjack, classic card games, slots, progressives and video poker. Telegraph Casino offers a wide range of regular promotions, offered on a weekly basis. These can vary from deposit bonuses to free spins and even include special prizes that can be won by completing simple tasks. Fantastic welcome bonuses All new players who sign-up and deposit £10 or more will be rewarded with a 100% welcome bonus. This will give players £20 to play with. Deposit more and the bonus will grow; deposits of £200 will receive a huge £300 bonus, meaning players have a fantastic £500 to play with. To convert bonuses into real cash, players simply need to play through their first deposit bonus amount 40 times For Telegraph readers wishing to play Bingo, Telegraph Casino has some of the best Jackpot bingo games around. Free Bingo is widely available allowing new players to get some practice. Jackpot games are always available with big prizes for one line, two lines and the full-house. Running on IGT software means that Telegraph Casino is home to some of the top online and land based casino slots currently available, such as, Cleopatra, Da Vinci Diamonds Dual Play, Rainbow Riches, and Monopoly In addition, Telegraph Casino’s list of online casino games include a wide range of Slots, Table Games, Roulette, Video Poker and 9 different types of Blackjack. Customer support and satisfaction are an absolute priority for The Telegraph and our Casino is focused on making our players’ gaming experience as enjoyable as possible in a safe and secure environment. Telegraph Casino understands the importance of offering easy and accessible Customer Support options. So whether it’s an issue with logging in, getting started, or a frequently asked question, you can always reach our Casino Customer Support team who are available 24 hours a day, 365 days year to answer all of your questions. Join today at www.telegraph.co.uk/casino telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-10-02T22:30:00.000+03:00", "crawled": "2015-10-02T19:05:17.973+03:00", "highlightTitle": ""}