{"organizations": [], "uuid": "7b0ba91a6e63f0b17975b2492ae8368f52e9e112", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/d48b562461d073aa22313ab86c1bc13b", "site_section": "http://feeds.news.com.au/public/rss/2.0/trav_around_world_357.xml", "section_title": "NEWS.com.au | Travel | Around the World", "url": "http://www.news.com.au/travel/world-travel/if-you-were-dead-wouldnt-you-want-to-be-in-new-orleans/story-e6frfqc9-1227561715990?from=public_rss", "country": "IL", "title": "Inside America’s most haunted city", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Inside America’s most haunted city", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T04:44:00.000+03:00", "replies_count": 0, "uuid": "7b0ba91a6e63f0b17975b2492ae8368f52e9e112"}, "author": "", "url": "http://www.news.com.au/travel/world-travel/if-you-were-dead-wouldnt-you-want-to-be-in-new-orleans/story-e6frfqc9-1227561715990?from=public_rss", "ord_in_thread": 0, "title": "Inside America’s most haunted city", "locations": ["US", "America", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rowena Ryan", "Paula Froelich", "Emily Moulton", "Kate Schneider", "Benedict Brook", "Lauren Mack"], "text": "Inside America’s most haunted city 12:32 PM Paula Froelich VISIT any US town and you’re likely to hear local ghost stories. But this city has a reputation for being particularly ghostly. Fab things you can get in your hotel room 12:10 PM Lauren Mack, CheapFlights FORGET ordering late night snacks, these hotels are now offering services you never even knew existed and they’re amazing. ‘It cracked, it really cracked!’ 11:57 AM Kate Schneider WHEN you’re standing more than 1000 metres above the ground, this is the one thing you really don’t want to happen. Amazing things you can order to your hotel room 8:29 AM Lauren Mack, CheapFlights FORGET ordering late night snacks, these hotels are now offering services you never even knew existed and they’re amazing. These are our worst roads 21:18 PM Benedict Brook THESE are the roads motorists would rather forget, clogged by congestion, poor surfaces and downright danger. Here are the worst places to drive. Is this the future of air travel? 21:00 PM Emily Moulton IT RUNS on roughly 50,000 units of power a day — and it costs nothing. Could this be the eco travel fix we have been looking for? The extravagant holiday for the super-rich 14:45 PM Rowena Ryan IT promises to transform your life, on a 12-month, 20 country trip around the world and it’s all yours for a cool $340,000 ... each. ‘If you were dead — wouldn’t you want to be in New Orleans?’ October 8, 2015 11:44am Email a friend \nStrolling through the Cities of the Dead with the Mary Poppins of dead people isn’t as creepy as it sounds, I swear. But it does make the city come alive in ways you’ve never imagined. \nWhen I went down to New Orleans last month I wanted to experience a side of the city I, literally, can’t see — the ghostly side. \nIf you talk to people who believe in and experience the “Sixth Sense,” NOLA is jam packed with people who just quite haven’t made the transition to heaven or hell. \nSo I called my friend Cari Roy, The New Orleans Psychic, who’s been talking to dead people and peeking inside people’s heads since she was a little girl. Cari Roy \n“So why are all these ghosts here? Why not just go up to heaven or hell?” I asked Cari. \n“Well,” she explained, “Once you make the final transition, that’s it, there’s no turning back. If you think you’re going to heaven and pull the lever … only to find out that you’re going straight to hell, well, that’s eternity. You can’t go back from hell. So a lot of them are too scared to leave this plane. And some, who are in heaven, want to communicate.” \n“Okay — but why New Orleans?” \n“Well, if you were dead — wouldn’t you want to be in New Orleans?” She quipped. \n“I can’t disagree,” I said, thinking it’s pretty awesome even for the living — so imagine how much ruckus the ghosts must get up to … St Roch Cemetaries \nStops along the way include the restaurant bar Muriel’s in Jackson Square — which has several ghosts roaming around, but the most notorious is Pierre Antoine. \nAccording to Muriel’s website, “Pierre Antoine Lepardi Jourdan built his dream home restoring it to the original grandeur, for his family and himself. Although Jourdan dearly adored his beautiful home, he was a man that could never quench his thirst for the thrill and excitement of gambling. \nIn 1814 he wagered his beloved home in a poker game and crushingly lost the one thing he treasured most in life. \nThe shock of the loss was so intense, before having to vacate the premises and hand over his beloved treasure, he tragically committed suicide on the second floor in the area that served as the slave quarters — the same area where Muriel’s Seance Lounges are situated today.” \n“Pierre likes a party,” Cari said. “He will come out when there’s music and dancing. \n“But how do you know he’s there?” \n“Well, I feel him and can talk to him,” she said, “But he’s been known to throw glasses to get people’s attention.” (This is corroborated by employees at Muriel’s who have seen this). \nAnother uber haunted place is Nicolas Cage’s former home, which used to belong to the sadistic socialite, Madame Delphine LaLaurie, who became notorious for imprisoning, beating and torturing slaves in her attic. \n“She was eventually run out of town by a mob,” Cari said. “That’s a ghost who’s too scared to pull the trigger — I think she knows where she’d go and doesn’t want to. I’ve talked to her several times and she feels misunderstood. I think she was bipolar.” \nSaint Roch’s in the Ninth Ward is one of the many above-ground cemeteries throughout the city. \nThe final stop on the tour was at St. Roch’s cemetery in the Ninth Ward, where Cari detected a spinning red dancing female ghost. \n“Oh yeah — she’s here — twirling around, just dancing through.” \nAnd then Cari checked out my ghosts, and according to Cari: \n“You’re followed by your grandmother — she’s spunky and spirited,” (true). \n“She wants you to find someone,” (okay). \n“You’re going to meet a sexy fussbudget,” (I’m down). \n“And you’re…” (that’s private). \nSo, I got that going for me. Heh. \nSeriously though — if you ever get to New Orleans (or even if you don’t — Cari skypes!), look up Cari Roy. She’s pretty amazing. \nThis article originally appeared on Yahoo Travel and was republished via NY Post .", "external_links": [], "published": "2015-10-08T04:44:00.000+03:00", "crawled": "2015-10-08T04:57:53.813+03:00", "highlightTitle": ""}