{"organizations": [], "uuid": "69d026b2ef5743554bd8ba77aefe85be07148dca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64835/seychelles-tourism-minister-takes-questions-head-national-assemb", "country": "US", "title": "Seychelles Tourism Minister takes questions head on at National Assembly", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Seychelles Tourism Minister takes questions head on at National Assembly", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:54:00.000+03:00", "replies_count": 0, "uuid": "69d026b2ef5743554bd8ba77aefe85be07148dca"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64835/seychelles-tourism-minister-takes-questions-head-national-assemb", "ord_in_thread": 0, "title": "Seychelles Tourism Minister takes questions head on at National Assembly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seychelles Tourism Minister takes questions head on at National Assembly   \nOct 14, 2015 eTN   \nAlain St.Ange, the Seychelles Minister responsible for Tourism and Culture, was in the National Assembly this week for Question Time. Minister St.Ange had eight questions ranging from points touching both departments falling under his ministry appearing on the Order Paper dated Tuesday, October 13. \nWith the Hon. Patrick Herminie, the Speaker of the National Assembly in the Chair, the Hon. Meggy Marie, the Elected Member for Anse Aux Pins, asked for a rundown on the career path of the Seychelles Tourism Academy and the Shannon College of Hotel management students who today are qualified with a Bachelor’s Degree in International Hotel Management. To this question the Minister explained in great detail the five cohorts who are currently following or who have successfully completed the ADHM program, and he went on to explain the Mentors Committee appointed to follow the career path of each of these students. \nThe Hon. Emmanuel Fideria, the Elected Member for Les Mamelles, on his part wanted to know if the Ministry of Tourism and Culture would consider attaching a cultural officer to each of the country's regions to help identify and to organize cultural activities at the district level. For this question the Minister explained the existing level of cultural activities did not justify a permanent cultural officer in each of the regions but explained that with the Inter District Cultural Competition, a Committee was currently working with districts participating in this cultural competition. He also stated that the National Arts Council and the Conservatoire de Musique was always ready and able to attend to districts if their expertise was required. \nThe Hon. Natasha Esther, the Elected Member for Baie Ste. Anne Praslin, asked Minister St.Ange for an explanation on the status of the planned development for the parcel of land allocated on Eve Island for a cultural center on Praslin. The Minister explained that plans were already drawn up and that small modifications were presently being included to take up the need for a Praslin Campus for the Tourism Academy and that discussions were already in place with the Ministry of Finance to see of the budget for such a project. \nThe Hon. Bernard Arnephy, the Elected Member for Anse Boileau, had two questions for Minister St.Ange. The first question was to seek an explanation on the increase in the budget allocated for marketing of the destination in the field of tourism. The Minister responsible for Tourism and Culture used his answer to position the work being done by the Tourism Board with great success. He explained that when in 2014 the marketing budget was slightly reduced, marketing and sales activities were curtailed, and that resulted in a drop in the targeted visited arrival numbers. The Minister went on to further speak about the marked increase of 20% for the current year to date in visitor arrival numbers and said that the increase in the marketing budget to the Tourism Board brought the needed results for Seychelles, because the Tourism Board Offices in the main source markets had this current year been better able to work with their trade partners to ensure that Seychelles remained visible and in so doing relevant in the world of tourism. The Minister used his reply to appeal to the National Assembly to support the Tourism Board demand for a 6% increase in the 2016 budget for marketing purposes. \nThe elected member's second question was to see if the creation of more Kids’ Clubs in the hospitality industry in Seychelles was in progress. The Minister said that he supported the appeal and explained that this fell in line with a new course being launched by Constance Ephelia Resort for Kids Club Attendants. This course was being supported and worked on jointly by the Seychelles Tourism Academy. \nThe Hon. Kevin Vidot, the Elected Member for English River, wanted to get an explanation as to why the Ministry of Tourism and Culture had taken a playing field at English River for the construction of a Music Stadium. Minister St.Ange in his reply that the artists of the islands needed a place they can call home as this was a needed facility for them to showcase themselves to Seychelles. The stadium's location in Victoria was also a prerequisite for a music stadium if the country was to show that it was not ashamed of its culture. Victoria, as the “Capital of the World of Creoles” needed at all costs to have a venue for the country's artists to showcase their music and for Seychelles to continuously stage cultural manifestations. The Minister also explained the second phase of the project that would include an arts village with a waterfront development. In response to a supplementary question raised by the Hon. Vidot on the loss of a playing field by English River for the youth to train on, the Minister said that the district had three large playing fields in or adjacent to English River, and the reallocation of one for use by musicians and the world of arts could not be seen as a let-down for the district. \nThe Hon. Maria Payet-Marie, the Proportionately Elected Member, had two questions for Minister St.Ange. The first dealt with the status of CINEA and the second on whether it had been determined which category of tourists was deemed the best for the islands. On the creation of CINEA, the Minister explained that the proposed legislation was currently in its final draft and that soon it would be coming to the National Assembly. The Minister explained that the delay had occurred because the existing acts covering the Tourism Board and the National Arts Council need to be amended simultaneously as the new legislation prepared to create CINEA, because the new body would be taking over some of the responsibilities previously falling under these two bodies. Minister St.Ange also explained that CINEA would be based at the ICCS Conference Center and would be responsible for all the events that appear on the national list of events. \nOn the question of the best target markets for the tourism industry, the Minister explained that it could be seen that the higher-end tourists were spending more in the islands, but he sought the support of the National Assembly to undertake a study on the intake from the tourism industry that remains in the country. The Minister also said that it was important to also see the benefit for the country when Seychellois are more involved in the tourism industry. He spoke about the benefits in kind for the country when more Seychellois are working together to defend and in so doing help to consolidate the island's tourism industry. \nSeychelles is a founding member of the International Coalition of Tourism Partners (ICTP) . For more information on Seychelles Minister of Tourism and Culture Alain St.Ange, click here . Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-10-14T23:54:00.000+03:00", "crawled": "2015-10-15T00:55:58.691+03:00", "highlightTitle": ""}