{"organizations": [], "uuid": "e35ca9236f7e54e6c671e3e30aa2e75207af592d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tripideas/calling-all-foodies-5-exotic-food-travel-experiences-right-here-in-the-us/ar-BBmkxJ8", "country": "US", "title": "Calling All Foodies: 5 Exotic Food Travel Experiences Right Here in the U.S.", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Calling All Foodies: 5 Exotic Food Travel Experiences Right Here in the U.S.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "e35ca9236f7e54e6c671e3e30aa2e75207af592d"}, "author": "Mia Taylor", "url": "http://www.msn.com/en-us/travel/tripideas/calling-all-foodies-5-exotic-food-travel-experiences-right-here-in-the-us/ar-BBmkxJ8", "ord_in_thread": 0, "title": "Calling All Foodies: 5 Exotic Food Travel Experiences Right Here in the U.S.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Calling All Foodies: 5 Exotic Food Travel Experiences Right Here in the U.S. The Street 4 days ago Mia Taylor © TheStreet Calling All Foodies: 5 Exotic Food Travel Experiences Right Here in the U.S. So much of the pleasure of traveling comes from the exotic and unusual foods that are often part of the journey.For years, countless among us sat enthralled while Anthony Bourdain traipsed the globe showcasing and sampling the world's culinary offerings for the Travel Channel.\nFrom Vietnam to Hong Kong and beyond, A nthony Bourdain: No Reservations was a hit for good reason. It tapped into the desires of foodies, jet-setters and armchair travelers alike by offering up unique experiences, exotic and colorful destinations and meals fit for a king or queen.\nThe droolfest continues with Bourdain's latest show - CNN's Parts Unknown - focused on uncovering lesser known places, their cultures and cuisine. Once again, Bourdain has tapped into a massive demographic and popular obsession.\nAccording to Euromonitor, while Americans who travel internationally spend most of their money on accommodations, their second biggest category of expenditure is food.\nBut what if you can't afford to jet around the globe in pursuit of your latest over-the-top culinary adventure? Or what if you don't have a television network footing the bill?\nNot to worry, there are unique food-related travel opportunities right here in the United States. These are not hyped up gourmet restaurants presenting their latest mind boggling or artfully elaborate creations, but rather experiences that combine an entertaining or unique tourist destination with a notable, or truly localized food experience.\nWith that criteria in mind, here's a look at five places in the United States where you can have a food adventure, or two, of your own.\n1. Oyster Excursions, Mirbeau Inn & Spa at The Pinehills, Plymouth, Massachusetts\n© Provided by Thestreet.com As the boat progresses, there's sandbar and ocean as far as the eye can see. And then something else appears amid this classic New England sea and sand tableau - blue and white checkered table cloths fluttering in the breeze on high-top tables, waiters, people cooking over an open fire and an acoustic guitar player.\nWelcome to Chef Stephen Coe's most recent creation - oyster education and dinner in the most unlikely of settings - on a remote sand bar that's a stone's throw from some of Plymouth's oyster flats.\nCoe, who has been working with local farmers and fisherman since the inception of his career and counts beekeeping and oyster foraging among his favorite hobbies, has incorporated his love for sourcing his own ingredients into a unique food experience.\nThis past summer, for the first time, he teamed up with Plymouth Rock Oyster Growers to create oyster dinner excursions that include a boat ride to local oyster flats where guests are immersed in the process of oyster growing, and then dinner on a nearby sand bar (perfectly timed with low tide of course). The experience includes freshly grilled Plymouth Bay oysters (cooked right on the spot), wine, and s'mores over an open fire.\n\"When the boat pulls up, you hear people freaking out, because all of sudden, you start seeing this setting from the boat and people are like, 'What is this?'\" explains Coe of guests' first glimpse of his sand bar dining room. \"And then we tell them to take off their shoes, jump in the water and we approach them serving champagne.\"\nThe champagne is followed later by grilled oysters, raw oysters, slow cooked lobster and even bacon wrapped tenderloin.\nSounds like a pretty fabulous way to end a summer day right?\nThe first season of Coe's sand bar oyster bonanzas were a sellout hit. Which means a second season, this coming summer, is already in the works. (The dinners are held every other week during the summer.)\n\"We sold out every one of them,\" Coe says. \"We have a 20 person limit because there's a lot of work that goes into making it happen - prepping, and packing and doing all of that in reverse before the tide comes back in. The people who get on the list for one of these dinners are very happy.\"\nThe experience is $150 per person. Those interested in participating this coming summer should contact Mirbeau Inn.\n2. Perch Tacos, Put-in-Bay Island, Lake Erie\n© Provided by Thestreet.com Thinking about Ohio doesn't usually conjure up images of quaint islands and charming fishing villages. But unbeknownst to many outside the Midwest, there's a small Ohio island in Lake Erie called Put-in-Bay that's legendary for a variety of different reasons.\nNicknamed the \"Key West of the Midwest,\" the island is a freshwater oasis rich in history, renowned for its laid-back mentality and is one of the best kept secrets in the U.S. People who frequent the tiny island also know that its the best place in the world for getting one particular type of freshwater meal: perch tacos.\nThe yellow perch from this region is said to have a mild, sweet flavor and a firm flaky texture - making it the ideal option for those who don't necessarily enjoy the fishiness that comes with other types of fish. While most restaurants in the Great Lakes region tend to make a sandwich or a platter from the prized fish, the island tavern Goat Soup & Whiskey has developed a near cult following for its perch tacos.\nAfter being caught locally, the fish is cleaned, lightly breaded, fried and wrapped in a soft tortilla with cabbage, tomato, green onion and cheese and the restaurant's famous, secret Pali Wali sauce. While this meal may sound quite simple, it attracts droves of tourists and locals every year.\n\"The restaurant itself is a great experience,\" says longtime island resident Katrina Reed. \"It has that charm that is hard to replicate. It's very cool to be sitting there knowing all of the ingredients you're eating come from right around you. They catch the fish locally and grow all the other ingredients in the restaurant's gardens.\"\n\"People come to the island from the mainland just to have these tacos,\" she adds.\nThe island is only accessible by boat or plane. The best way to get to Put-in-Bay is aboard the Miller Ferry, a 22-minute ride that's $14 roundtrip.\n3. Aebleskiver in Solvang - California's Little Denmark\n© Provided by Thestreet.com Pronouncing the name of this particular food might be challenging, but eating it won't be.\nAebleskiver are round, Danish pancake balls that are deceptively light, fluffy and served topped with raspberry jam, powdered sugar and sometimes a side of Danish sausage.\nOne of the best places (outside of Denmark) to indulge in them is in Solvang, otherwise known as California's Little Denmark. The community not only proudly serves its ancestral food but is also home to several representations of Danish architecture. To boot, each September hosts an incredibly popular Solvang Danish Days festival that includes aebleskiver breakfasts, aebleskiver eating contests, Viking encampments, music and living history demonstrations.\nIn between the annual festival, one of the best places in town to sample this Danish treat is at The Solvang Restaurant. Opened in 1911 by immigrants, the restaurant is now operated by Jeff Paaske and his sister Carol, who are fourth generation descendants of Danish transplants themselves.\n\"They're our signature dish,\" says Jeff Paaske. \"In Denmark they're served at Christmastime. I was raised on them. My mother cooked them for me quite often during the year.\"\nThere's two ways to enjoy aebleskiver at The Solvang Restaurant - they can be ordered from the take out window (a bag of three costs $3.75), or you can come in, sit down and enjoy a full Danish meal.\n4. Ethnic Neighborhoods Food & Culture Tour, Los Angeles, CA\n© Provided by Thestreet.com Some of the best northern Thai curry soup to be had in the United States is being served at a tiny, hole-in-the wall restaurant in the middle of Los Angeles's Little Armenia neighborhood. And without the help of longtime tour guide Summer Davis, it's not easy to track down.\n\"It's this little, six-table restaurant, a small, family run place, that is operated mainly by one woman from Chang Mai,\" begins Davis, manager of Los Angeles Urban Adventures, which offers a foodie's dream tour. Called the Ethnic Neighborhoods Food & Culture Tour, Davis's tour takes locals and travelers on a gastronomic adventure through some of Los Angeles's most interesting and vibrant ethnic neighborhoods. Los Angeles is the perfect setting for such a tour, being home to the only Thai Town in the U.S., and countless other emerging immigrant communities.\nThe tour includes sweet and savory foods from ethnic markets, bakeries and restaurants in Koreatown, Thai Town and Little Armenia. For those who want to do more than just eat, eat, eat, Davis also incorporates walking the neighborhoods and learning about their history (a great chance to work off some of the calories.)\n\"This is a full-on experience that goes way off the beaten path in L.A., yet still includes interesting sites, architecture, history and even a view of the Hollywood sign, from a completely different than usual spot,\" Davis says.\nBut the food Davis skillfully exposes her tour participants to is truly the highlight of this foodie adventure.\n\"We sample a yummy walnut pancake served by a boutique Korean bakery,\" she says. \"And the bakery is located inside a Korean supermarket. And that supermarket is inside a Korean shopping center.\"\nIn other words, good luck finding these mouth watering places, without first taking the tour.\n5. Foods of the Old West (including Prairie Butter), The Fort, Denver, Colorado\n© TheStreet Calling All Foodies: 5 Exotic Food Travel Experiences Right Here in the U.S. Meals at The Fort are inspired by the diaries of Native Americans, rare cookbooks from the American West and extensive research into the diet of 19th century trappers and traders.\nFounded in 1963 by Sam Arnold, and his wife Elizabeth, who were amateur historians, the couple amassed thousands of rare books about the region, its people and their eating habits, from which they developed the restaurant's historically-based frontier menu.\n\"My father decided to research the diet of the American mountain man,\" explains Sam Arnold's daughter, Holly Arnold Kinney, who now runs the restaurant. \"So he started researching diaries, talking to the Cheyenne, Apache, collecting rare cookbooks and all of that resulted in this 3,000-volume rare cookbook and western history library that became the inspiration for what we would serve on menu.\"\nAccording to the Arnold's research, the region's ancestral people enjoyed eating several parts of the buffalo -- including the tongue, bone marrow and the tenderloin. Accounts from Santa Fe Trail travelers in the 1840s describe \"prairie butter,\" or broiled buffalo bone marrow, as a favorite treat. These are the sorts of menu items that The Fort has specialized in for decades and has built its reputation upon.\n\"We are known as truly Colorado cuisine,\" continues Kinney, who still owns the collection of rare books and continues to use them as inspiration for menu items.\nSome of the other true Colorado cuisine served at The Fort, besides buffalo, includes regional game such as elk and quail, and macaroni and cheese pudding.\nBut visiting The Fort is about far more than just eating. The building itself is a historically accurate, full-scale replica of Bent's Fort, an important fur trading post that dates back to 1833. The impressive adobe structure is listed on the National Register of Historic places and sits amid 100 idyllic acres in southwest Denver's Red Rocks territory.\nThe Fort's authentic American west experience has attracted people from all walks of life and was even the site of a political summit hosted by former President Bill Clinton that was attended by leaders from around the world including Tony Blair and Boris Yeltsin.\n\"This is not like visiting Disneyland,\" Kinney says, of the authentic nature of the building and its food. \"You're walking through true adobe walls, not cinderblock covered with paint. And you really feel like you're walking back into 1830s when you come through the gate of The Fort.\"\n ", "external_links": ["http://thestreet.com/", "http://www.soupandwhiskey.com/#about", "http://www.mirbeau.com/pinehills-plymouth/", "http://www.losangelesurbanadventures.com/", "http://www.solvangrestaurant.com/"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-26T19:21:05.453+02:00", "highlightTitle": ""}