{"organizations": [], "uuid": "00ee97fc83218132ed6e8bb7fe1dd2c55522a7e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-10/norfolk_island_0810.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/norfolk-island-a-slice-of-paradise-set-in-sea", "country": "MY", "title": "Norfolk Island: A slice of paradise set in sea", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Norfolk Island: A slice of paradise set in sea", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:14:00.000+03:00", "replies_count": 0, "uuid": "00ee97fc83218132ed6e8bb7fe1dd2c55522a7e4"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/norfolk-island-a-slice-of-paradise-set-in-sea", "ord_in_thread": 0, "title": "Norfolk Island: A slice of paradise set in sea", "locations": ["Norfolk Island"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Print Article \nNorfolk Island from the plane. Gorgeous isn't it? — TODAY pic SINGAPORE, Oct 8 — Perched 1,600km off the east coast of Australia, Norfolk Island claims to offer “360 degrees of wonder”. As it turned out, this is not just tourism spiel: The petite island is about three times the size of Pulau Ubin at 34.6 sq km and you are greeted with incredibly scenic views, awashed in shades of verdant green and watery blue everywhere you turn. \nIt may have something to do with the fact it is dotted with Christmas trees or, more accurately, the Norfolk pine trees. In 1774, British explorer James Cook discovered the island filled with these evergreens and named it Norfolk Island in honour of the Duchess of Norfolk. He is said to have been so impressed by its natural panorama that he thought he had stumbled on “paradise”. \nHome to fewer than 2,500 people — it gets more than 10 times in tourist numbers — Norfolk Island is the perfect place to relax and unwind. There are no traffic lights, no fast food chains, no multiplex cinemas and glitzy shopping malls. It is so safe, nobody locks their doors or cars, and it is said the five police officers who patrol the isle are always looking for things to do. \nThough the island is small, a relatively lengthy roadway criss-crosses the landscape, and signs announce cows and other animals have the right of way on the island’s asphalt strips. \nNorfolk Island is so therapeutic that it is not uncommon for urban dwellers to simply gaze at the surrounding vistas from various locations. Lazing in the sun on one of the tranquil beaches, such as Emily Bay and Anson Bay, is another fabulous way to take in the scenery. This can be followed by a swim or snorkel in the lagoon. \nHowever, you should bushwalk through Norfolk’s parks to truly experience the dramatic and surreal beauty of the island. There are routes such as the Rainforest Gully Circuit or the Old Mountain Track (where you can even see Philip Island), which provide for an invigorating but relatively easy jaunt. Or go through Mount Pitt or Mount Bates — the highest points of Norfolk at 110m and 319m, respectively — for a bird eye’s view of the coastlines. \nYep, Norfolk Island pretty much looks like that everywhere you turn. — TODAY pic While Norfolk’s natural beauty evoke awe, I was more interested in its history. Although some evidence suggests that seafaring Polynesians lived there between the 11th and 14th centuries, the first European settlement only started in 1788 — as a penal colony with nine male and six female convicts deported from Australia, some six weeks after the arrival of the First Fleet in Sydney. The settlement was abandoned in 1814, but reopened again in 1825. \nThe two colonial penitentiaries were developed along the seafront stretch called Kingston, which is now a UNESCO World Heritage site. While wandering through the ruins of prisons, gaols, guard towers and military barracks and some of the wonderfully restored Georgian buildings, I couldn’t help but feel a touch of sorrow for these convicts, most of whom were in their 20s, sent here for petty crimes such as stealing a piece of bread or clothing. \nThere are four museums — the Commissariat Store, the Pier Store, The HMS Sirius Museum and No 10 Quality Row — depicting haunting stories of the past (you can get the museum pass, which allows you access to all four, for A$25 or RM75) and you can catch the Sound & Light show at Kingston, or The Trial Of The Fifteen, a courtroom drama played at the island’s only auditorium, to watch history come to life. \nThe very spot where Captain Cook landed on Norfolk Island. — TODAY pic A new chapter of Norfolk Island began in 1856, with the arrival of 194 people from Pitcairn Island, located almost 6,800km away. The new settlers were mostly descendants of the famous mutineers of the HMS Bounty. For the most entertaining version of this piece of history, Pinetree Tours offers tours and shows such as the Mutiny On The Bounty Show, performed at an outdoor amphitheatre; as well as a visit to the houses of the descendents of one the mutineers, Matthew Quintal. \nThe mutineers’ descendants now constitute about 40 per cent of the island’s total population. Calling themselves Norfolk Islanders, they breathe culture, traditions and dialect that evolve from a mix of English and Polynesian habits and practices: Playing cricket and golf, weaving baskets and speaking a unique dialect — a rough blend of seafaring English and Tahitian (this dialect is taught in the island’s only school). \nThe cuisine is also derived from Tahitian traditions: The undeclared national dish is the Tahitian fish salad. One way to indulge in these cuisines is via culinary tour, such as the interactive buffet dinner at Bounty Lodge or an ocean fishing trip. \nWhile the residents of Norfolk Island ponder their future (the island seems set to become a Regional Council of Australia next July), there seems to be little worry that they will lose their sense of community. \nAnd perhaps that is part of the reason why travellers fall in love with its charm. — TODAY", "external_links": [], "published": "2015-10-08T03:14:00.000+03:00", "crawled": "2015-10-08T03:55:23.415+03:00", "highlightTitle": ""}