{"organizations": [], "uuid": "6822aaf065c813e0119e070cbbae4cc1197c97b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20151020/c1_735492_151020051423_620x413.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/735492/air-passenger-numbers-hit-record-high", "country": "TH", "title": "Air passenger numbers hit record high", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Air passenger numbers hit record high", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T23:26:00.000+03:00", "replies_count": 0, "uuid": "6822aaf065c813e0119e070cbbae4cc1197c97b9"}, "author": "", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/735492/air-passenger-numbers-hit-record-high", "ord_in_thread": 0, "title": "Air passenger numbers hit record high", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Air passenger numbers hit record high 20 Oct 2015 at 03:26 1,066 viewed 3 comments NEWSPAPER SECTION: NEWS | WRITER: AMORNRAT MAHITTHIROOK \nAirport officials say Suvarnabhumi and other Thailand airports now are handling more than 100 million passengers a year, and there is no place to put new flights. {Photo from Flight Simulator) - + Crash kills Thai, injures 16 Koreans Crowded airports are likely to be a more familiar sight as more Thais shun inter-provincial buses and fly with budget airlines. \nThe trend shows up in the increasing number of air passengers at the country's six major airports. Airports of Thailand Plc (AoT) board chairman Prasong Poontaneat said passenger numbers have set a \"historic record\", the highest since the AoT started its service about a century ago. \nFrom Oct 1 last year to Sept 30 this year, the number of passengers jumped to more than 106.8 million, 33.5% up from the 80 million during the same period the year before. The number of flights has increased to 707,362, a 15.97% jump, he said. \nAt Suvarnabhumi airport, the number of passengers increased by 12.6% to 52 million people and the number of flights increased by 6.1% to 310,870. Earlier report : Industry calls for ban on new flights \nPassenger numbers at Don Mueang airport, home of low-cost airlines, jumped by 47.75% to 28 million people and the number of flights increased by 32.7% to 214,809. \nAt provincial airports, the number of passengers at Phuket airport increased by 11.19% to 12.5 million people and at Chiang Mai airport passengers increased by 29.8% to 8 million. In Hat Yai, passengers rose by 21.19% to 3.5 million, while 1.6 million people passed through Mae Fah Luang airport in Chiang Rai, an increase of 26.9%. \nOne reason for the increase is Thais are changing their travelling behaviour, switching from buses to planes, he said. \nThey find it easier to travel by plane and many airlines are offering low-priced tickets. The country is also quieter politically, which makes it a more appealing travel destination. \nForeigners make up the largest portion of the more than 106 million air travellers over the past fiscal year, or 61 million of the total, said AoT president Nitinai Sirismatthakarn. \nIn another development, the Land Transport Committee decided Monday not to increase the airport surcharge as demanded by taxi drivers. \nThe surcharge is set at 50 baht, but van taxi drivers wanted an increase to 100 baht to relieve their financial burdens.   2 people liked / 12  ", "external_links": [], "published": "2015-10-19T23:26:00.000+03:00", "crawled": "2015-10-20T04:39:06.362+03:00", "highlightTitle": ""}