{"organizations": [], "uuid": "0c08ff75374fccdd7e171b5750a18987f8df2512", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/article/travel-packages-even-first-class-passengers-cant-ignore/ar-AAfdyad", "country": "US", "title": "Travel Packages Even First-Class Passengers Can't Ignore", "performance_score": 0, "site": "msn.com", "participants_count": 5, "title_full": "Travel Packages Even First-Class Passengers Can't Ignore", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 4, "uuid": "0c08ff75374fccdd7e171b5750a18987f8df2512"}, "author": "Scott McCartney", "url": "http://www.msn.com/en-us/travel/article/travel-packages-even-first-class-passengers-cant-ignore/ar-AAfdyad", "ord_in_thread": 0, "title": "Travel Packages Even First-Class Passengers Can't Ignore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Packages Even First-Class Passengers Can't Ignore The Wall Street Journal. 6 days ago Scott McCartney Travel packages aren’t just for budget tourists following tour guides with red umbrellas anymore. Travelers accustomed to five stars and first class can easily save with them, too.\nAirlines, hotels and car-rental companies have gotten more aggressive at offering unpublished discount prices through bundled packages, and online travel agencies are making it easier to book packages, even on smartphones. Business travelers, too, can save big buying airline tickets and hotel rooms together.\nAirlines Reporting Corp., a data firm that processes tickets bought through travel agencies, used airline data and Expedia hotel rates to calculate average savings of 30% in trips from the U.S. to London last summer, 24% to Paris and 22% to Las Vegas, Maui and Cancún. Savings on packages to New York averaged 19% and New Orleans 18%.\nThe new style of packages caters to today’s do-it-yourself consumers who want to book their own itineraries after carefully researching hotels, flights and attractions. Hotels, like airlines, have gotten smarter about targeting particular types of travelers, too. They’re offering their best prices to people likely to stay longer, come back more frequently and, most important, spend more in shops, restaurants, casinos, spas and room service.\nThe savings are real. A Nov. 21 to Nov. 28 trip to Maui from Seattle over Thanksgiving was 12% less when purchased as a package compared with a la carte. It came to $7,455 for seven nights at the Four Seasons Maui at Wailea and $3,518 for nonstop Hawaiian Airlines flights for two people, or a total of $10,973, when booked directly at the Four Seasons and Hawaiian websites. The same trip is $20 more total when priced on Expedia.\nBut book the same Four Seasons garden-view room with a king bed and the same flights together on Expedia and the package price was $9,657—savings of more than $1,300.\nTraveling from Boston to Miami the same week was priced last week at $4,516 if bought directly from the Loews Miami Beach and American Airlines, including daily resort fees. Expedia’s prices if bought separately were slightly lower. But the Expedia package price was 12% lower: $3,968, or savings of $548.\nIn the first half of this year, Orbitz says packages generated $20 million in savings on travel bookings, with average savings of $155 per trip. Orbitz says package bookings to Mexico, one of the most popular package destinations, were up 16% last month, compared with September 2014. Expedia, which recently acquired Orbitz but still operates the two separately, says its packages save, on average, $226 based on actual bookings.\nPackage sales are growing at a rate greater than 20%, Expedia Senior Vice President Greg Schulze says.\n© Robert Harding World Imagery/Getty Images One reason airlines, hotel and car-rental companies offer deep package discounts: Consumers—and competitors—can’t see what actual prices are. The discounted prices aren’t listed in public reservation systems, where competitors can match prices.\nWith packages, airlines and hotels can offer even deeper discounts if they want to lure more customers from particular cities, perhaps to entice customers from a competing airline’s hub airport without starting a fare war. They might eye certain cities where customers tend to spend more. Longer stays may generate better prices; weekdays are often cheaper than weekends at resorts, but urban destinations with lots of business travelers will target weekend packages for deep discounts.\n“The package shopper books twice as far in advance, stays twice as long and is less likely to cancel,” Mr. Schulze says. “So the hotelier gets a good customer.”\nHistorically, the giant vacation package business has centered on tours sold by traditional travel agencies, often as group trips with guides and transportation built in. Those packages sometimes have limited choices for hotels and flights, and comparison shopping can be difficult. Online travel agencies make it more mix-and-match, offering individual trips that even business travelers might use to save money.\nAirlines and hotels tell online travel agencies what they’ll charge for a package if their prices aren’t disclosed. Then travel agencies set the total price, usually building in their own markup. Technology has allowed hotels to change prices rapidly, as airlines do, based on how particular dates at individual properties are selling. Hotels can also track competitors’ pricing more closely.\nAirlines and hotels have gotten bolder about pricing, Mr. Schulze says.\nAt the same time, online travel agencies have made it easier to book packages. Instead of a package coming with a fixed airline itinerary, shoppers can now select the particular flights they want after selecting a hotel. Preferred airlines or nonstop flights may push the price higher, but travelers like the flexibility of choosing their flights. They can also select first-class and business-class seats, and upgrade hotel rooms before they buy.\nOrbitz began offering packages through mobile devices in August. Buying a vacation package can be complex, with lots of choices and sometimes thousands of dollars involved. But some shoppers are comfortable making a purchase like that through smartphones.\nUnlike spur-of-the-moment hotel-room bookings, bookings made through smartphones on Orbitz have an average cost of $1,658 and four-night duration, and are made nearly two months in advance. “It’s not what you think of when you think of mobile,” says Chris Brown, chief product officer at Orbitz. “Consumers are getting more and more comfortable making big purchases on that device.”\nHenrique Certad checked airline and hotel prices carefully for a mid-September trip from Fort Lauderdale, Fla., to New York City for his family of four. Prices for hotels seemed particularly high. Then he followed an Orbitz suggestion on his smartphone to look at package pricing.\nThe family got five nights at the Excelsior Hotel, near the American Museum of Natural History and Central Park, and three seats on Spirit Airlines nonstop for $1,950. Orbitz says they saved 41% on that package. Knowing Spirit’s fee-happy pricing structure, Mr. Certad, his wife and two daughters, ages 4 and 1, packed just one suitcase.\n“I don’t know why they do that, but what I do know is in the end, the cost was much better for us,” says Mr. Certad, who works for an architectural firm in Miami.\nWith most packages, travelers can collect airline miles. With hotels, policies vary and some deals may not earn loyalty points. And cancellations can be tricky. Expedia passes through whatever policies airlines, hotels and other travel companies have, so a package might end up being mostly nonrefundable. Most, however, leave the airline portion nonrefundable and hotel portion refundable up to a cancellation deadline, sometimes even the day of arrival.\nAnd buyer beware: Airlines from Spirit to American offer their own packaging, grouping hotels and car rentals with their tickets. But those packages often come with severe cancellation penalties—sometimes they’re even completely nonrefundable—if you have to cancel close to departure.\nWrite to Scott McCartney at middleseat@wsj.com\n ", "external_links": ["http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfcedt.img&quot;}}", "http://www.marketwatch.com/mw2/mediarss/wsjdn/wsjtv.asp?type=wsj-section&amp;query=Lifestyle&amp;count=30&quot;},{&quot;ns&quot;:&quot;ignore_this_version&quot;,&quot;value&quot;:&quot;System.Collections.Generic.List`1", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAfn6xf.img&quot;}}", "http://b.scorecardresearch.com/b?&quot;,&quot;Category&quot;:&quot;travelarticle&quot;},&quot;Mute&quot;:&quot;true&quot;,&quot;HomePageLink&quot;:&quot;//www.msn.com/en-us&quot;,&quot;GeofenceUseSps&quot;:&quot;false&quot;,&quot;GeofenceEnabled&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:true,&quot;Mute&quot;:true,&quot;SwfCacheRefreshTime&quot;:86400,&quot;AdConfig&quot;:{&quot;FWFlashProfile&quot;:&quot;188286:MSN_US_AS3_LIVE&quot;,&quot;FWHtml5Profile&quot;:&quot;188286:MSN_HTML5_Live", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAf3qmv.img&quot;}},{&quot;csId&quot;:&quot;AAao9sx&quot;,&quot;description&quot;:&quot;Looking", "http://online.wsj.com/", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAf7w9S.img&quot;}},{&quot;csId&quot;:&quot;BB42RJi&quot;,&quot;description&quot;:&quot;Take", "http://live.wsj.com/video/buying-bundled-vacation-can-save/9417B7D6-E419-4695-9BB1-CD800DCB822E.html&quot;,&quot;sourceFriendly&quot;:&quot;The"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-14T05:12:48.437+03:00", "highlightTitle": ""}