{"organizations": [], "uuid": "ae95373ca2cde7df2d9042264e0cc93732d7516f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vogue.com", "main_image": "http://www.vogue.com/wp-content/uploads/2015/10/09/vegetables-new-meat.jpg", "site_section": "http://www.vogue.com/living/", "section_title": "Living: Weddings, Interior Design, Food, Travel, and Parties - Vogue", "url": "http://www.vogue.com/13359379/are-vegetables-the-new-meat", "country": "US", "title": "Are Vegetables the New Meat?", "performance_score": 1, "site": "vogue.com", "participants_count": 2, "title_full": "Are Vegetables the New Meat? - Vogue", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T15:00:00.000+03:00", "replies_count": 2, "uuid": "2a0678ae5eb5cfce8bcdec8546efd64b4e8c3175"}, "author": "Tamar Adler", "url": "http://www.vogue.com/13359379/are-vegetables-the-new-meat#post-0", "ord_in_thread": 0, "title": "Are Vegetables the New Meat?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“A vegetable garden in the beginning looks so promising,” wrote Gertrude Stein, “and then after all little by little it grows nothing but vegetables, nothing, nothing but vegetables.” Sigh.\nThis was the sybarite’s complaint for eons: that vegetables lacked the promise of “a good piece of meat.” Suddenly, lamentations have broken off. Everywhere, knives and forks are being brandished over plates of cabbage and carrots and cauliflower and kale, at rough checkered tablecloths and heavy damask and everything in between. Restaurant-consulting firm Technomic reports that two thirds of today’s Americans think a vegetarian meal can be as satisfying as one with meat. Christine Keller, director of trend practice at CCD Innovation and editor of a late-spring bulletin called Vegetable Chic , tells me root-vegetable presence on menus has grown 46.7 percent in the past year. Roy Choi’s newest Los Angeles restaurant, Commissary, in the Line Hotel, is built inside a greenhouse and advertises itself as “not necessarily a vegetarian restaurant, just good food and drink based around plants as the foundation.” Vedge, on Philadelphia’s Locust Street, serves an entirely vegetarian menu to throngs of well-heeled omnivores. In Chicago, Grace’s all-vegetable Flora menu frequently outsells its Fauna one. The list of New York and San Francisco entries is too long to begin—but Nolita’s buzzy Rebelle has risen on the reputation of its “beet bourguignon.” Beckett Bar, Paris’s first “vegetable bar,” opened in the Madeleine in January. Maybe the plainest signs of transition from porcine moment to vegetal one are the inimitable Daniel Humm’s recent pièce de résistance at Eleven Madison Park: a whisper-light alabaster celery root, braised with truffle in a cleaned pig’s bladder; and that the Spotted Pig’s April Bloomfield , who seems always leading a trend by the nose, chose as the follow-up to her best-selling first cookbook, A Girl and Her Pig, A Girl and Her Greens .\nAll our old pale and passive vegetative associations are slipping. Beets simmer in glorious, thick jus and spit-roast over oak. Kohlrabi salt-bakes like whole fine bass. Carrots are rolled in puff pastry into Wellington or pounded with fat into rillettes. Parsnips smolder overnight under bricks. There are comparisons to bacon (Vegetables: Are They the New Bacon?, Washington Post , October 2014).\nI don’t spend too much time thinking about food trends. But with this one I am transfixed. It is not only that I love cabbages and carrots—though I do. It is that stem- or bulb- or flower-as-meat has the potential to improve personal and planetary welfare.\nSince Frances Moore Lappé wrote in 1971 about the terrible misallotment of grain to cows, there has been a persuasive case against meat-based diets. More recent data—that it takes 25 times more energy to produce a calorie of beef than a calorie of corn; that we use 450 gallons of water per quarter-pound hamburger; that the meat industry emits more greenhouse gases than all forms of transport; that the likelihood of premature death from any cause is 75 percent higher in heavy meat eaters—has made the case for a fundamental shift in the balance of our diet from animal to plant.\nOf course, the data have been accumulating for a long time. What is different now is chefs themselves, who seem, in silent collective assent, to have decided to advance the argument for plants in the eternally more convincing language of pleasure. And have begun sculpting a culinary landscape anew.\nI decide to take a grand tour, starting close to home, on Havemeyer Street in Williamsburg, at Semilla.\nSemilla, which serves a shockingly inexpensive tasting menu it calls “vegetable forward” (a term its owners may have coined), was opened last October by Per Se and Brooklyn Fare alumnus José Ramírez-Ruiz and Pamela Yung and quickly applauded by The New York Times . The accolades have mounted. Bloomfield tells me, in a conversation about her long-standing love of vegetables, that her recent meal there was “one of the best I’ve eaten all year.”\nOn a salmon-pink evening, my husband and I sit in two of the slim restaurant’s eighteen seats, and beneath its high, light ceiling are poured cava. There is no menu—everyone eats the same ten courses, named in a note sent electronically at the meal’s end—so all there is to do is sit and watch as José and Pamela cook, plate by plate, blistering tender yellow bamboo shoots, then filling them with creamed avocado; seed- and herb-dusting lettuces; frying a green garlic pancake, then drizzling it with sunchoke vinegar; and continuing on for two calm hours with many lovely stops all along the season’s soil line.\n“At Per Se,” Ramírez-Ruiz tells me, “we all fantasized about our imaginary future restaurants. I always thought of La Chassagnette in Provence, where there’s an organic farm with five dedicated gardeners, and L’Arpège,” which has been vegetable-focused for decades. “My imaginary restaurant was 80 percent vegetable.”\nAt Untitled at the Whitney, Michael Anthony also says the creative heart of his menu is the vegetable section that stands squarely at its middle. So, in Renzo Piano’s airy glass square, we eat solely from it: lightly cured radishes and snap peas, crisp and barely brined; then a bowl of beets and herbed buttermilk; a very large and meaty roasted cauliflower; and a wonderful spring array of asparagus and tiny turnips dotted with crisp, salty guanciale and blanketed with pecorino.\nAnthony—whose second book, V Is for Vegetables , comes out this month—accounts for his new concentration: “Vegetables are the single best expression of eating here, in New York, at a specific time of year—they are our true regional cuisine.” Humm (whom I phone after, flipping through his new NoMad cookbook and aimlessly sticking little tabs on the recipes that are all or mostly vegetable, I quickly run out of tabs) explains further. “There’s not a lot of meat raised an hour from here. There’s not a lot of fish caught an hour from here. But incredible vegetables are a car ride away. I used to be so caught up on the convention that luxury was foie gras and caviar that I didn’t stop to consider asparagus cut that day, a carrot pulled that morning as our true luxury ingredients.”\nI eat at John Fraser’s Narcissa, where the cornucopia of leaves and roots and flowers that makes up much of the menu comes from André Balazs’s Hudson Valley farm, the Locusts, an enchanted glen where I spent a weekend four years ago helping the farmer make dulce de leche from local goat’s milk. I eat at perfect Via Carota on Grove Street , down whose menu runs an old-fashioned botanical calendar, Gennaio to Dicembre , each month marked with an intricate etching of its emblematic harvest: a frilled cabbage, erotic bulbous figs, a fairy-tale pumpkin, a truffle.\nThe dishes haven’t all been vegetarian, or all light, but flipping the ratio of plant to meat has changed something critical. A traditionally haute tasting menu of foie gras, quail, rabbit ragù, filet mignon is traditionally pleasant in the moment and, also traditionally, slightly painful once digestion initiates. These meals have been all pleasure.\nSo much so that I wonder if, in a festive mood, we might soon say, “Tonight, we dine!” and, salivating animally, envision a mound of steaming, brown, and buttered broccoli romanesco. Might the day be nearing when, to pull out all the stops, we pound our chests, then cut into great platters of zucchini?\nI write Marion Nestle, professor of nutrition, food studies, and public health at NYU, and author of Food Politics, What to Eat, Safe Food , and Why Calories Count , to ask whether she would find such a day nutritionally copacetic. “We don’t need to eat any animals, really,” she responds. “If you eat enough calories, the probability of getting more than enough protein is extremely high. Most Americans get twice the protein needed.” This surprises me. She explains: Proteins are made from a combination of 20 different amino acids, “and animal proteins contain a higher proportion of those amino acids than plants do.” Different vegetables have varying amounts of different amino acids, which is why eating a variety of vegetables meets human protein needs perfectly. Grains and beans contain the most, so if anyone were worried she wasn’t getting enough protein, she could focus her attention there. But a diverse vegetable diet, chosen without a focus on any one thing in particular, is nutritionally sufficient.\nAnother reasonable question is whether vegetable-centric cuisine is scalable. I haven’t eaten in any restaurant that reaches people the way, say, Friendly’s might, or Applebee’s. This is what is on my mind when I read that José Andrés, award-winning chef of Jaleo and Minibar and 21 other restaurants around the country, has opened Beefsteak, the Chipotle of botanical cuisine, with two locations in Washington, D.C., and more on the way in different cities around the country. There, one can order a bowl of bulgur, quinoa, or rice, top it with a whole selection of vegetables—raw and cooked—bean or yogurt or tomato sauce, add avocado or a poached egg, or, if one must, chicken or salt-cured salmon, and then finish it with any number of wonderful sounding flourishes, like seaweed salad or toasted sesame or corn nuts.\n“The number-one problem Americans face today is the lack of vegetables in our diet,” Andrés tells me over the phone. “We are eating almost opposite the amounts of fruit and vegetables and meat we’re supposed to. I also realized recently that meat is incredibly overrated in terms of flavor. Think about a pineapple: Every instant, even after the last bite, is deeply interesting.” Vegetables are playing greater roles at all his restaurants, but he opened Beefsteak specifically “to feed the many.” And he is. In D.C., “the lines are endless,” he tells me. “And MC Hammer was just here.”\nAaron London, a six-foot, broad-shouldered cyclist, covered in winding tattoos, with chin-length brown hair tied in a samurai topknot, and the clear, shining eyes of a cult leader, takes all of this furthest at his new restaurant, AL’s Place, which he opened in February in San Francisco. I first ate Aaron’s food seven years ago at Ubuntu in Napa, the most technically complex and exciting and unlikely vegetarian restaurant of its time—it was in a yoga studio; it was expensive; it was refined.\nAt AL’s Place, a bright cornflower blue–and–white tiled corner room in the Mission, Aaron has formalized what is elsewhere de facto. The appetizers and main dishes are based on vegetables—Catalan chickpeas or porcini mushrooms or whole tiny heads of scarlet and jade and speckled lettuce, Sardinian fregola or grits or green peas. Side dishes are meat—you can order a small plate of wild salmon or trout or sliced hanger steak to take bites of next to your grits, or have a poached egg, drizzled with olive oil, along with your yellow bean stew.\nMy husband and I eat here twice because Aaron wants us to try everything and, though the menu is short, each dish is so dense with flavor that we can’t all at once. Each thing he serves tastes like something from the future: luminous, with an eerie and likable unpredictability that seems to come from erstwhile supporting players’ having been considered with a fresh mind.\nLondon’s nose-to-tail energies are exhaustively marshaled—mostly on vegetables, though at both dinners we order the same side dish: a whole black cod head, pressed flat and roasted under a brick, served with spicy sauce. The finest thing on the menu, big wedges of porcini mushrooms sitting in a rich fava mayonnaise, is made, he tells me, with the pleased amazement of someone who struck gold, almost entirely of dinosaurish outer fava-bean husks , and the even less usable internal fava-bean skins , containing no actual fava bean and yet tasting like its absolute distilled essence.\n“I’m a freak about using every part of the vegetable,” he tells me. “I don’t want to compost anything. We fill up maybe half a container of compost a day.” It isn’t for lack of volume. The restaurant is full from the moment it opens at 5:30 until closing. When I arrive for my second dinner, a camera crew is finishing a photo shoot. The crew begins shooting us and other diners and the room, and the presence of a lens provides me the voyeuristic distance to feel the answer to my question of whether the day of slavering over platters of zucchini draws nigh. Wineglasses are full and refilled; tabletops are cluttered with high, rich plates of shoots and bulbs and leaves in rich and piquant sauces; the noises of joyous, festive eating rise. The day is here.", "external_links": [], "published": "2015-10-11T15:00:00.000+03:00", "crawled": "2015-10-12T20:42:21.199+03:00", "highlightTitle": ""}