{"organizations": [], "uuid": "989c323f9ed84c30086715ea43dbe8f521110213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02159/Afternoon-Tea-Clar_2159297a.gif", "site_section": "http://www.telegraph.co.uk/archive/2015-10-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/ultratravel/9124793/Londons-ten-best-afternoon-teas.html", "country": "US", "title": "London's ten best afternoon teas", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "London's ten best afternoon teas - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:13:00.000+03:00", "replies_count": 0, "uuid": "989c323f9ed84c30086715ea43dbe8f521110213"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/travel/ultratravel/9124793/Londons-ten-best-afternoon-teas.html", "ord_in_thread": 0, "title": "London's ten best afternoon teas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The ritual of afternoon tea owes its origins to Anna, the 7th Duchess of Bedford. As a young women in the early 1800s she lived during a time when it was common to eat only two main meals a day, with breakfast scheduled early in the morning and dinner occuring late in the evening. Weakened and irritated by hunger pangs each day, she decided to schedule time to take tea and snack each afternoon. This private ceremony was firstly done furtively in her bedroom, but over time well-heeled acquaintances joined her and the practice was perpetuated. Nowadays tea rooms and hotels in London and throughout the country offer permutations of this centuries-old tradition. Plenty are pretty much indistinguishable but quite a few offer something unique. Below are some of the capital's best afternoon teas for those who want to experience something special. Best for healthy indulgence: Brown's Hotel's Tea-Tox Tea-Tox at Brown's Hotel Photo: Adrian Houston Limited Tea-tox at Brown's Hotel. Image: Adrian Houston Limited The historic Brown’s Hotel, where Queen Victoria used to take her tea, caters to the modern world of dieting and health obsessions with a lighter take on traditional afternoon tea. Served in the elegant English Tea Room , the low-carb, low-fat, low-sugar spread is more indulgent than it sounds, maintaining rich flavours while using healthier substitutes such as fruit, low-fat crème fraiche and chocolate made with sugar-free xylitol. The open-faced sandwiches, including smoked chicken with a dollop of guacamole, are light but satisfying, and balanced with refreshing palette cleansers such as fruit sorbet and lime apple jelly. Scones might be the only glaring omission, but you won’t miss them too much with healthier treats such as flourless - but flavourful - dark chocolate and zesty yoghurt-topped orange cakes. The meal pairs nicely with the silver needle white tea, a delicate infusion of cucumber, melon and other fruit flavours. Reviewed by Soo Kim Top treat: the smoked mackerel with a soft-boiled quail’s egg on a chicory leaf is a wonderful blend of savoury and smoky flavours Address: Brown's Hotel , Albemarle Street, London W1S 4BP Days and times: daily from 12pm-6.30pm Cost: £45; champagne afternoon tea £55 Check availability: Brown's Hotel, London Read more: the best hotels in central London Best for a ceremonious experience: Teanamu Chaya Teahouse Within moments of stepping into Pei Wang’s relaxing Notting Hill Teanamu Chaya Teahouse , it is apparent that tea, and the meticulous ritual around creating the perfect brew, is top of the agenda. With no less than 18 teas to chose from – and that’s not counting the bespoke tisane infusions one can mix and match – it’s hard to know where to start, but the black lychee variety proved a delightful and tasty choice. The self-boiling kettle on each table is essential when you consider the tiny size of the traditional tea pots and drinking cups, but the Chinese ethos is based around having just enough to drink in the present moment. Pei’s extensive knowledge and fresh, preservative-free snacks (who could resist the healthy-sounding citrus, yuzu soft-set marshmallow dusted with green tea) make this an educational and altogether less gluttonous experience than the traditional English afternoon variety. Even better, those taken with their newly discovered brew can buy packets to take away to recreate the magic back home. Reviewed by Olivia Lidbury Top treat: The lo mai fan lotus leaf rice parcel - a sticky, tea-infused rice with braised mushrooms and sweet azuki - was a revelation. Address: Teanamu Chaya Teahouse, coach house, 14a St Luke’s Road, W11 1DP Days and times: Saturdays and Sundays: 12pm - 6pm. Cost: The ichi-go ichi-e afternoon tea, with sandwiches, dim sum and sweets, costs £30; the more simple wabi sabi afternoon tea, served without the dim sum, costs £25. Best for traditional afternoon tea: The Ritz Afternoon tea has been served at the Ritz since its 1906 opening and that sense of heritage is partly why it remains so popular today. Served with precision in the hotel's ornate Palm Court, the tea includes the requisite finger sandwiches with smoked salmon, roast ham et al, alongside fresh raisin and apple scones and cakes on a tiered cake stand. Service is assured and seamless if occasionally a touch perfunctory - perhaps an inevitability when staff serve so many customers each day. The company, meanwhile, is polite: here it is required that one dresses for tea, with (gentle)men expected to wear jacket and tie; jeans, sportwear and trainers are forbidden. That sense of formality seems an especially strong lure for foreigners eager to experience a sense of British pomp and ceremony, so book well in advance if you want to secure a spot at this enduringly popular spot. Reviewed by John O'Ceallaigh Top treat: they may lack the flair of the cakes that follow, but the sandwiches here are a fresh, tasty and wholesome start to proceedings Address: The Ritz , 150 Piccadilly, W1J 9BR Days and times: daily 11.30am-7.30pm Cost: £50, or £66 for a champagne afternoon tea Check availability: The Ritz, London Best for a cultural day out: House Afternoon Tea at the National Theatre Go behind the curtains at one of the South Bank’s most prominent buildings during this afternoon tea like no other . Theatre aficionados can take a guided backstage tour of the National Theatre, where they’ll learn not only its history and secrets – such as the fact that the Olivier Theatre’s fly tower above the stage could hold a London bus, or that the National Theatre is classed as the largest factory in Zone 1 – but also visit otherwise off-limits areas, such as the set designers’ studio and the prop store, a magical place stocked during my visit with fantastical puppets from His Dark Materials and gruesome hands from Treasure Island. You might even catch a warm-up: I saw the cast of Jane Eyre whooping and hollering, stretching and spinning, before their matinee. Then for the tea at House restaurant, whose menu references former shows and is served in \"acts\". It's a classic if uninspired offering, so expect hummus sandwiches, from One Man Two Guv'Nors, Cat in the Hat green eggs and ham sandwiches and the usual scones and clotted cream. Reviewed by Jade Conroy Top treat: Mrs Lovett’s Pork Pie (from Sweeney Todd) and the Marble Mouthful (inspired by Eliza Doolittle). Address: Upper Ground, South Bank, London, SE1 9PX Days and times: Tea and tour packages run on Fridays at Sundays, starting at 1pm. Cost: £35 per person for the tea and tour; afternoon tea is available for £26.50 but it's the tour that makes this option special. Best for people who don't like afternoon tea: Ichi Sushi afternoon tea For those who want to avoid the slump that follows a sugar-heavy afternoon tea, a Japan-inspired alternative should serve as a welcome alternative. At Ichi Sushi and Sashimi Bar , tucked off the lobby of the Park Plaza (reserve the table with the Big-Ben view), afternoon tea focuses on seafood rather than sandwiches and overly sweet cakes. A flight of heavenly blends made tea-choosing tough. Guided by the kimono-clad waitress I chose a delicate white apricot. The “bridge” of made-on-the-spot sushi (14 items) didn’t disappoint either, and bonus points for fresh wasabi, which delivered a more refined kick than the paste. “Have you tried our sparkling sake?\"\" asked 'miss cherry blossom kimono', as I polished off a green tea and chocolate Japanese savarin. Not a fan of Asian desserts I ate all five - washing them down with my new find, the deliciously light sparkling and cloudy Sawa Sawa sake. A success. However - and I never thought I'd say this - why pollute a Japanese painting with a token (dry) scone? Reviewed by Teresa Machan Top treat: fresh wasabi - a subtley spikey kick Address: Park Plaza hotel, Westminster Bridge Hotel, 200 Westminster Bridge Rd, London SE1 7UT Days and times: daily from noon to 5pm Cost: £25 or £34 with a glass of sparkling sake Best for a celebration: Claridge's afternoon tea Afternoon tea at Claridge's hotel Photo: Claridge's To the delicate question of what should be applied first to the deliciously light, raisin-infused scone – Cornish clotted cream or Marco Polo gelée – came the Belgian waiter’s impeccably diplomatic answer: “There is no one way to eat your scone, sir. It is a matter of taste.” Afternoon tea in Claridge’s is all about good taste: of the interior designers who have laid on a supremely elegant (and yet informal) setting; of the pianist/cellist duo whose harmonies blend so well with the warm chatter (of sons and mothers; friends and lovers); of the sumptuous delicacies upon which you feast: cucumber (and organic chicken) sandwiches, scones to sigh for; perfectly formed pastries fusing the flavours of pears and walnuts, chocolate and crème brûlée. There’s a reason why Claridge's has succeeded in serving afternoon teas for 150 years. Book well ahead. Reviewed by Adrian Bridge Top treat: the Second Flush Muscatel Darjeeling, one of 24 specially blended teas on offer and just the thing to accompany those pastries. Address: Claridge’s, Brook St, Mayfair, London W1K 4HR Days and times: tea is served daily at 3pm, 3.30pm & 5pm or 5.30pm Cost: £55; champagne afternoon tea £65-£80 Check availability: Claridge's, London Best for men: Sanctum/CSDR gentlemen's afternoon tea Sanctum Soho is a rock star’s boutique hotel, and their Gentleman’s Afternoon Tea is a heart-stoppingly unwholesome line-up of red meat, carbs and saturated fats topped off with high-octane booze and premium nicotine. You sit on shiny snakeskin upholstery to imbibe English Breakfast tea in smart china. This washes down snacks sufficient for an army of rock titans: oysters, rabbit pasties, stonking steak sandwiches, burgers and miniature hotpots, followed by a comparatively subtle chocolate fudge cake and Jack Daniels ice cream. The culmination, if your schedule and liver permit, is a choice of three varieties of JD in silver tankards, with complimentary cigars to take up to the roof terrace. The food was terrific, the surroundings swanky and the service spot-on, but how many colossi can put this away in an afternoon and still give of their best in the evening? Not Justin Bieber, I’ll be bound. Reviewed by Andrew Baker Top treat: the poached oyster with Bloody Mary relish was an ideal jumping-off point: keep that down, and you'll sail through the rest of the menu. Address: Sanctum Soho Hotel 20 Warwick Street, London W1B 5NF Days and times: daily 2pm-6pm Cost: £50 Best for enjoying a cheap day out: Fan museum Taking afternoon tea in the Orangery of a Georgian townhouse is almost as indulgently nostalgic as the eclectic collection of intricate fans, or “trifles” as history has often described them, on show at the Fan Museum . Perched in the heart of Greenwich, it is a short but sweet little trip through history, displaying an assorted handful of the 4,000 fans in its collection. Ranging from a 13th-century Chinese fan leaf to a bladeless Dyson, the exhibits tell the story of how fans are a reflection of cultural change - having even been used to disperse evil spirits at one stage – as well as frivolous cooling devices associated with incessantly fainting ladies in corsets. A jaunt through this unpretentious and playful gallery is followed by a generous afternoon tea, with home-made cakes and two scones complete with liberal amounts of cream and blackcurrant jam made by the museum’s owner, for a commendable £7. Reviewed by Anoosh Chakelian Top treat: a satisfyingly hefty hunk of chocolate brownie, moist and filled with white chocolate chunks. Address: Greenwich Fan Museum,12 Crooms Hill, Greenwich, London, SE10 8ER Days and times: Tues 3pm-5pm; Sun 3pm-5pm Cost: £7 for two scones with jam and cream, two cakes and a pot of tea; admission to the museum is an additional £4 for adults, or £3 for concessions. • London's most unusual museums Best for views: Ting restaurant, Shangri-La at the Shard It would be easy for those offering afternoon tea on the 35th floor of the Shard to rest on the glass and steel laurels of their location. Those behind Ting, the restaurant of Shangri-La at the Shard , to their credit have not. They do the basics well. The staff are impeccably mannered, the Far-Eastern-inspired decor is sleek, and its classic afternoon tea hits all the right traditional notes. But it's the Asian tea that really stands out, with inventive, delicately flavoured sweet and savoury treats. We expected we'd recommend having a mixture of both, but for savouries, the Asian selection wins easily - and that's not faulting the classic option. When you're not looking at the endlessly fascinating view - even the urinals are spectacular, for goodness sake - you'll find yourself debating the relative merits of the gyoza-style or the steamed prawn dumplings. You pay a premium for the floor-to-ceiling panorama, no question. This is among the most expensive options on this list of London's best afternoon teas. And it's something of a lottery whether you get the much sought after window seats (they won't guarantee them in the lounge), and others are not always as comfortable. Best tactic: be a regular, or turn up early, be charming - and prepare to swoop when there's space. But wherever you sit the views, and the treats, will reel you in. This is high tea in every sense. Reviewed by Jolyon Attwooll Top treat: The steamed prawn dumpling wins (just), while the Chocolate Temptation ganache was the pick of the pastries. Address: Shangri-La at the Shard , 31 St Thomas St, SE1 3QU Days and times: Mon-Fri 2pm-6.30pm; Sat-Sun 11.30am-6.30pm Cost: Classic English afternoon tea: £49, or £57 with a glass of champagne; Asian: £54, or £62 with a glass of champagne Check availability: Shangri-La at the Shard, London Best if you want to try something new: London Royal Tea; Hotel Café Royal The London Royal Tea at Hotel Cafe Royal The capital takes centre stage at Hotel Café Royal's newly launched London Royal Tea afternoon tea. Tube signs adorn the macarons and elsewhere on the silver cake trays there is inspiration from Spitfire planes to pearly kings and queens. So it is with a great sense of occasion that guests sit down amid the dazzling Oscar Wilde room – an opulent riot of gilded mirrors and ceiling frescos - at the five-star hotel. There is a strong sense of history, too, thanks to the smartly suited master of ceremonies who clears his throat every hour to regale the room with Quote: s and anecdotes from Wilde’s life. The extensive tea menu covers everything from oolong to tisanes (herb teas) via some delectable exclusive blends (try the Celestine – two soft Chinese black teas with a vanilla pod), but the tea and Veuve Clicquot cocktails (£18) are what really raise the bar. Savouries were enjoyably meaty - look out for the chorizo, onion and thyme “Wellington” slice – while the sweets included a very British Battenberg and a gold-leaf-flecked “raspberry regent” – an exquisite mouthful of berry mousse. Reviewed by Natalie Paris Top treat: A delicate roll filled with diced wild boar and English mustard, topped with a dab of pickled apple and tiny crackling pieces. Address: Hotel Café Royal , 68 Regent Street, London W1B 4DY Days and times: daily, every hour from 12pm to 5pm. Cost: £42 or £55 with a glass of Veuve Clicquot. This article was originally published on March 5, 2012, and updated most recently on October 9, 2015. Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-10-09T23:13:00.000+03:00", "crawled": "2015-10-09T18:44:56.640+03:00", "highlightTitle": ""}