{"organizations": ["Nissan Micra Manual"], "uuid": "d541637025fb884701efe568cb50140f47256a6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/aries_car_rental_offers_fuel_efficient_airport_car_rentals/", "country": "US", "title": "Aries Car Rental Offers Fuel-Efficient Airport Car Rentals", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Aries Car Rental Offers Fuel-Efficient Airport Car Rentals", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T00:36:00.000+03:00", "replies_count": 0, "uuid": "d541637025fb884701efe568cb50140f47256a6d"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/aries_car_rental_offers_fuel_efficient_airport_car_rentals/", "ord_in_thread": 0, "title": "Aries Car Rental Offers Fuel-Efficient Airport Car Rentals", "locations": ["Perth", "PERTH"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aries Car Rental Offers Fuel-Efficient Airport Car Rentals Australia, 8 October 2015 -- Aries Car Rental, one of the leading rental service companies in Perth, offers a range of fuel-efficient airport cars for hire. The company is committed to helping clients get a memorable, stress-free experience with the ride.[PERTH, October 8, 2015] – Aries Car Rental, a reliable provider of car rentals in Perth, is offering an extensive selection of fuel-efficient airport cars for rent at reasonable prices. The company discusses car rental agreement and additional services they provide. Comprehensive Range of the Latest Models Aries Car Rental is the go-to source of high quality vehicles in the area. Whether for business or pleasure, they offer value for money rates and charges on all latest models. These include (but not limited to):• Nissan Micra Manual – This vehicle is available for only $24 per day, which includes 100km ride and comprehensive insurance. The Nissan Micra Manual is not only aesthetically pleasing and easy to use, but also safe and fuel-efficient. • Hyundai i20 – This is among the most entertaining cars to drive. For just $26 a day, interested customers can get to experience what it’s like to use Hyundai i20. It features huge boot, stylish interior, keyless entry and sleek design. Not to mention it comes with a choice of six engines. • Nissan Pulsar Sedan – This car, on the other hand, is available for hire for $32 per day. It features 4 cylinders, reverse sensor and 1.2 turbo petrol. Each of the company’s vehicles for hire is clean inside and out and has low mileage. They aim to make exploring Perth and nearby areas easier, quicker and safer. Additional Services What sets Aries Car Rental apart from the others is they value the importance of customer satisfaction. Apart from offering a variety of airport cars, they also provide airport drop-off service, free parking in the Central Business District and prompt roadside assistance for sudden breakdowns. About Aries Car Rental Aries Car Rental is a top car rental company in Perth that offers a great selection of SUVs, student vehicles, corporate cars, family vehicles and many more. Their vehicle range includes small to medium and even 8-seater capacity. They have established a strong reputation for providing ease of payment, reliable insurance and competitive pricing. To know more about the company and their car hire specials, interested clients can visit their website at http://www.ariescarrental.com.au . # # #", "external_links": [], "published": "2015-10-08T00:36:00.000+03:00", "crawled": "2015-10-10T09:01:58.087+03:00", "highlightTitle": ""}