{"organizations": [], "uuid": "8d105f4337dca7ed68b603aaf4542cbe7717f47b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03457/old-mutual-tax-eff_3457295a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/finance/new-pension-rules/11899322/inheritance-tax-free-gifts.html", "country": "US", "title": "Make your gift inheritance tax-efficient | New Pension Rules", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Make your gift inheritance tax-efficient | New Pension Rules - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:57:00.000+03:00", "replies_count": 0, "uuid": "8d105f4337dca7ed68b603aaf4542cbe7717f47b"}, "author": "Emma Lunn", "url": "http://www.telegraph.co.uk/sponsored/finance/new-pension-rules/11899322/inheritance-tax-free-gifts.html", "ord_in_thread": 0, "title": "Make your gift inheritance tax-efficient | New Pension Rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learn more about new pension rules » GIFTING LUMP SUMS Giving your children money while you’re still alive can have inheritance tax (IHT) implications if you die within seven years of the gift. Any gifts made less than seven years before death count towards the IHT threshold which currently stands at £325,000. This limit includes your property and possessions, as well as cash and investments. But everyone has an annual IHT gift allowance of £3,000 per year (for the 2015-16 tax year). This enables you to give some cash away each year to your children without it affecting your tax situation. If you didn’t use last year’s allowance you can carry it forward and give £6,000 away this year. The allowance is per donor, not per child. There’s no IHT to pay on gifts if the donor lives for another seven years You can also give smaller sums of up to £250 a year to as many people as you like although you cannot combine this with the 18 £3,000 annual allowance. Gifts larger than these limits can potentially mean your child will have to pay IHT of up to 40pc on the amount when you die – but only if you die within seven years. THE SEVEN-YEAR RULE Seven years is an important cut-off period for the calculation of IHT. There’s no IHT to pay on gifts if the donor lives for seven years after giving the gift. Of course, it’s difficult to plan your inheritance with this rule in mind. “The seven-year rule applies where you make a gift known as a Potentially Exempt Transfer, or PET. As long as you survive for seven years after making the gift (PET) to others, there is no IHT to pay on the gift when you die,” says Martin Bamford, chartered financial planner at Informed Choice. “The amount of IHT relief received on a PET is tapered if a tax liability does arise, so your beneficiaries would pay 100pc of the tax due if you died within three years, 80pc if death occurs between years three and four, 60pc if you die between years four and five, 40pc on death between years five and six, or 20pc of the tax due if you died between years six and seven.” Depending on your gifting history there may not be a tax liability on the PET if you die within seven years. OTHER EXEMPTIONS There are also IHT exemptions for gifts to mark a wedding or civil partnership. The limits depend on your relationship with the person getting married. “The limits for these gifts are up to £5,000 given to a child, £2,500 given to a grandchild or great-grandchild, or £1,000 given to anyone else,” says Mr Bamford. Make the gift from your income rather than your savings You can also make tax-free gifts from your savings and investments to family members who need maintenance or support. These include your current or former spouse or civil partner, children under 18 or in full-time education, or any other relative who depends on you financially. Another way to give your children money without IHT implications is to make the gift from your income – your salary or pension – rather than your savings. It’s important to keep accurate records. This will make it much simpler for your beneficiaries to sort out your estate after you die. If you need more information about this subject, you might find it useful to speak to a financial adviser. You may also be interested in: • Six questions to ask your pension adviser • The new shape of retirement • Balancing pensions against retirement income", "external_links": [], "published": "2015-10-09T18:57:00.000+03:00", "crawled": "2015-10-09T13:55:09.072+03:00", "highlightTitle": ""}