{"organizations": ["Unesco City of Music"], "uuid": "0d18f4e1a93a4aecf1d800b371f5eccd50714182", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/35/nn/p035nn3f.jpg", "site_section": "http://www.bbc.com/travel/feed.rss", "section_title": "BBC Travel", "url": "http://www.bbc.com/travel/story/20151019-the-scottish-city-where-rock-n-roll-reigns?ocid=global_travel_rss", "country": "GB", "title": "The Scottish reign of rock 'n' roll", "performance_score": 1, "site": "bbc.com", "participants_count": 0, "title_full": "The Scottish reign of rock 'n' roll", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:14:00.000+03:00", "replies_count": 0, "uuid": "0d18f4e1a93a4aecf1d800b371f5eccd50714182"}, "author": "", "url": "http://www.bbc.com/travel/story/20151019-the-scottish-city-where-rock-n-roll-reigns?ocid=global_travel_rss", "ord_in_thread": 0, "title": "The Scottish reign of rock 'n' roll", "locations": ["Britain", "Mogwai", "UK", "Glasgow"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mike MacEacheran", "Franz Ferdinand"], "text": "Britain The Scottish city where rock ’n’ roll reigns Glasgow, the UK’s only Unesco City of Music, has birthed bands from Mogwai to Franz Ferdinand. A new tour wanders through the city’s dilapidated, but still buzzing, musical landscape. By Mike MacEacheran 23 October 2015 \nAt the intersection of Glasgow’s Sauchiehall and Pitt Streets, two worlds meet. To the north and west are the rudimentary student bars and cafes near the Glasgow School of Art , a building long considered Charles Rennie Mackintosh’s masterpiece, though now framed by scaffolding after a ravaging 2014 fire. To the south is the mercantile quarter of Blythswood Square and St Vincent Street, all Georgian grandeur and hubristic wealth. Advertisement 007 returns in SPECTRE! Only in cinemas. \nCelebrate the release of the new James Bond movie SPECTRE and discover why Bond is GREAT in our fantastic video. Get a sneak peek into the Bond lifestyle! Click here to find out more \nConsider the evidence: the Union at the Glasgow School of Art was a staging post for bands including rock group Franz Ferdinand, indie pop band Belle and Sebastian and alt-rock group Teenage Fanclub. The same can be said of Nice ’n’ Sleazy , where members of rock bands Snow Patrol, Mogwai and The Vaselines – which was once described as Nirvana rocker Kurt Cobain’s favourite group in the whole world – found their feet. \nOr consider King Tut’s Wah Wah Hut , the place where Oasis were signed after their first gig, and from where every Scottish band, from Travis or Biffy Clyro, has begun their assault on the charts. Here music history lives and breathes in the walls, behind the painted doors, in the creak of the floorboards. View image of King Tut's Wah-Wah Hut (Credit: Credit: Mike MacEacheran) \n\"Glasgow’s success on the global music stage has been built on our deep-rooted music culture,” said Fiona Shepherd of Glasgow Music City Tours , who launched the city’s new walking tour of prominent venues, pubs and clubs in August. “We’re a port city – and that drove our industrialised economy – so we have a history of importing and exporting our music. People here love country, soul and the blues; that runs deep. And there was a constant influx of folk music from Ireland.” \nDespite its role in the global music scene, Glasgow is just a tenth the size of London or New York. In fact, given that the Scottish city was named the UK’s only Unesco City of Music in 2008, you could argue that the walking tours are overdue. (Even Austin, Texas – which brands itself as the live music capital of the world – doesn’t have Unesco status). \nThe tour winds from the Royal Concert Hall on Killermont Street, eulogised in song by Aztec Camera’s Roddy Frame, past the now defunct Apollo, where Glasgow-born band AC/DC recorded their first live album, to venues including the CCA , 02 ABC , Broadcast , Box , Nice ’n’ Sleazy and King Tut’s – making it a wander through a musical landscape responsible for some of the UK’s favourite bands. \n“You should never underestimate the appeal of a dilapidated, scuzzy, old-fashioned rock ’n’ roll venue,” said Shepherd, who is also The Scotsman’s music critic. “These are places small enough to feel intimate, but big enough to feel important. They help tell the story of where our music scene has come from – and more importantly, where it is going.” View image of Glasgow School of Art (Credit: Credit: Robert Harding Picture Library Ltd/Alamy Stock Photo) \nEven to an outsider, Glasgow appears like a community of rock stars, pub singers, buskers and performers. It’s hard to walk more than a block without passing a live music venue or club; even during daylight, under a bleak, thundercloud sky, Glasgow maintains its rock ’n’ roll swagger. \nBut swagger doesn’t mean unwelcoming: the scene’s collaborative nature is steeped in DIY mythology and a can-do attitude. The city has the highest concentration of music students in the UK, and the Electric Honey record label, run out of Glasgow Kelvin College , is the most successful student union record label in the world: it released Belle and Sebastian’s 1996 debut album as well as records from Biffy Clyro, Scotland’s reigning rock band, and Glasgow-based Snow Patrol. \n“It’s a small city so it’s easier to get to know other musicians and bands than elsewhere,” said Joe McAlinden, an ex-member of 1990s Scottish guitar band Superstar and now a singer-songwriter performing under the moniker Linden. “When we were growing up, the scene was most welcoming. Primal Scream and The Pastels didn’t mind us lot hanging around. In fact, they encouraged us to get involved – we got to support the bands we loved and in some cases got to play with them, too.” \nTo some extent, all this mutual respect can be traced back to the 1979 formation of Postcard Records, the music label that became a vehicle for the arty melodies of groups like Josef K, Aztec Camera and Edwyn Collins’ Orange Juice. Two years earlier, the city council had banned punk – punk concerts, specifically – and a post-punk, new wave backlash was on the way. What followed was the birth of Johnny and the Self-Abusers, who morphed into Simple Minds, then came Altered Images, Deacon Blue, Del Amitri, Texas, Primal Scream… the list goes on. View image of Posters of gigs show just how varied Glasgow's music scene is (Credit: Credit: Mike MacEacheran) \n“I think the wheel keeps turning – established bands influence the next generation, even pulling them into the city,” said Francis McDonald, Teenage Fanclub’s drummer, a solo artist and manager of Glaswegian bands Camera Obscura and The Vaselines. “If you like bands from the city, you might choose to go and study, socialise or work there – and that fresh blood means new bands start up all the time. Glasgow fosters a special kind of grounding that ensures musicians don’t get to stand on too high a pedestal. There is definitely a hint of, ‘If they can form a band, I can, too…’” \nWhat also the keeps the scene grounded is that most bands rarely “trade up”, moving away from the city for a greater shot at stardom. Belle and Sebastian continue to live in the city’s West End, Mogwai can be spotted drinking in Nice ’n’ Sleazy, and Steven McRobbie, frontman of indie luminaries The Pastels, co-owns Monorail Music in Kings Court. \nCynicism, a notoriously Glaswegian trait, also helps curb the susceptibility for any band to have ideas above their station. That’s an impression that you can’t shake when paying a visit to the Barrowland Ballroom , one of the city’s most storied corners. Dilapidated, with flaking paint, cracked urinals and creaking, sprung floorboards, the Barrowland Ballroom isn’t a re-creation, it is the music venue and ballroom as it once was – and it stubbornly clings to life. View image of The dilapidated Barrowland Ballroom, a Glasgow institution, stubbornly clings to life (Credit: Credit: Alan Oliver/Alamy Stock Photo) \nBut to see it in full swing on a Friday or Saturday night, when the dance floor turns into a raucous bear pit of revellers, is to be reminded of how a Glasgow crowd can help a band realise their full potential, reminding them – for better or for worse – that when they are on stage, with the lights dimmed and all eyes on them, anything is possible. \nBecause in Glasgow, that’s how rock ’n’ roll stars are made. \nThis story is a part of BBC Britain – a series focused on exploring this extraordinary island, one story at a time. Readers outside of the UK can see every BBC Britain story by heading to the Britain homepage ; you also can see our latest stories by following us on Facebook and Twitter . Follow BBC Travel", "external_links": [], "published": "2015-10-23T20:14:00.000+03:00", "crawled": "2015-10-23T13:54:18.734+03:00", "highlightTitle": ""}