{"organizations": [], "uuid": "5e1ca0383f0b749883a059e72dc3eb0ec821a9ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://seattletimes.com/rss/ricksteveseurope.xml", "section_title": "The Seattle Times » Sections » Travel", "url": "http://www.seattletimes.com/life/travel/12-ways-to-give-yourself-a-travel-checkup/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_travel", "country": "CH", "title": "12 ways to give yourself a travel checkup", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "12 ways to give yourself a travel checkup | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:56:00.000+03:00", "replies_count": 0, "uuid": "78c5186e958b73fe31c61ff7a6bf4965bd26905f"}, "author": "Ellen Creager", "url": "http://www.seattletimes.com/life/travel/12-ways-to-give-yourself-a-travel-checkup/", "ord_in_thread": 0, "title": "12 ways to give yourself a travel checkup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OK, travelers. How healthy is your travel profile? It’s time to take stock. Here are 12 things to do this fall to get your travel affairs in order:\n1. If you do not have a passport, get one. You may have no plans to go anywhere, ever. But I believe all dreams are possible to those who are prepared. A record 38 percent of Americans now have a passport, and one of them should be you. If in the next 10 years someone offers you a sudden chance to fly to Paris or Tokyo or the Taj Mahal or even Toronto, you will be ready. (Cost of a new passport: $110; for details see www.travel.state.gov).\n2. If you have a passport, check the expiration date. Most nations require that the expiration date of your U.S. passport be at least 6 months beyond the date you return home from visiting. If your passport has less than 9 months left before it expires and you are planning an international trip, get a new one now.\n3. Check accumulated miles or points for each of your airline and hotel loyalty programs. You may have points or perks you didn’t even realize you had. Make sure the miles or points are not in danger of expiring (some companies like American Airlines will zap them if there is no recent activity on your account.) Also, check for points you have amassed on credit cards that offer travel perks. Do you have enough for a free airline ticket or hotel room? If so, use them. Make a list of what you’ve got so you do not forget and let the points slip away. I do this check four times a year to stay current.\n  4. Sign up for the loyalty program for any airline, car rental, cruise line or hotel you use or may use. I am never sure why people don’t join, because they are free and they come with beneficial perks even to basic members. One of the best perks? The ability to skip long lines at airport car rental counters and go straight to your reserved vehicle. I belong to 6 airline frequent flier programs plus loyalty programs for 5 car rental firms, 7 hotel chains and 3 cruise lines. Examples? Hilton Honors, Delta SkyMiles.\n5. Check to see whether you have any airline companion e-certificates or e-credits you may have forgotten about. If you do, double-check their expiration dates and rules. Many people forget they have them, but a companion certificate can be worth up to $400. (How do you find out if you might have credits or certificates? On www.delta.com, for example, log into your SkyMiles profile and check “my wallet” to see any credits or certificates available. If you have trouble tracking down credits, call the airline.)\n6. Compile a printed list of all of your travel loyalty programs, including account numbers, logins and passwords. Keep it somewhere safe at your house. I believe it is fine also to keep travel loyalty account numbers on a list in your phone as long as you don’t include the login information.\n7. Examine the state of your suitcase. Are the wheels shot, does the handle stick, or is the zipper busted? You absolutely have to get a new one. You will be amazed at the good prices and how light new luggage is. Once you buy a new bag, personalize it with a ribbon or unique luggage tag.\n8. Update your bucket list. Are the places you have dreamed of seeing still relevant? Do you still absolutely have to see the Grand Canyon or Antarctica in your lifetime? Contemplate, review and boil down your bucket list to five places or fewer and make plans to visit at least one of them next year.\n9. Install the latest travel apps on your phone. Install apps for all airlines, hotels and car rental companies you use (and store logins so the app recognizes you.) I also recommend these apps for checking flights and fares: Hopper, ITA Software, Kayak and Flight Aware (check the app stores for iPhone and Android to download.)\n10. Get Global Entry. If you fly internationally even once a year or drive back and forth to Canada, it is worth the $100 fee for the 5-year pass. The big perks? You can bypass long immigration/customs lines at the airport and use a kiosk, which clears you in about one minute instead of hours. It also routinely gets you into the TSA PreCheck fast lane for domestic flights. And it lets you use the NEXUS fast lane when driving back to the U.S. from Canada. ( www.globalentry.gov ).\n11. Choose your 3 favorite travel photos from this year. Don’t just store a ton of photos on your phone or laptop to be forgotten and lost in the haze of time. Pick 3. Print them out. Put them up next to your desk. As the dark gloom of winter descends you can recall those happy times and start planning your trips for next year.\n12. Start planning your trips for next year. Don’t just dream. Do it.\n———\nEllen Creager", "external_links": [], "published": "2015-10-19T12:56:00.000+03:00", "crawled": "2015-10-19T20:45:34.633+03:00", "highlightTitle": ""}