{"organizations": [], "uuid": "5e90adcd78b525c55cf830d03a53b7d2f12a6c39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/news/16-of-the-worst-things-you-can-do-in-hawaii/ar-AAeVi68", "country": "US", "title": "16 Of The Worst Things You Can Do In Hawaii", "performance_score": 0, "site": "msn.com", "participants_count": 5, "title_full": "16 Of The Worst Things You Can Do In Hawaii", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 4, "uuid": "f224c8d04a91712b3641abc91648cb4c496038f7"}, "author": "Landess Kearns", "url": "http://www.msn.com/en-us/travel/news/16-of-the-worst-things-you-can-do-in-hawaii/ar-AAeVi68#post-0", "ord_in_thread": 0, "title": "16 Of The Worst Things You Can Do In Hawaii", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "16 Of The Worst Things You Can Do In Hawaii The Huffington Post 2 days ago Landess Kearns Hawaii is known for its Aloha spirit, but its residents can also be fiercely protective of the land, the culture and everything else that makes the state feel like paradise.\nBelow, 16 things you should avoid doing in Hawaii.\n1. Call locals \"Hawaiians.\" © Getty Images/Perspectives Hawaii, Big Island, Milolii, two local fishermen relaxing in front of church. Calling somebody a \"Hawaiian\" is not like calling somebody a \"New Yorker.\" The term is reserved for people who have Hawaiian blood, AKA Native Hawaiians, and using it inappropriately is the surest way to cement your outsider status.\n2. Tell locals you'd sleep on the beach if it meant you could live in Hawaii. Homelessness is a very real issue in Hawaii , so joking about it probably won't get you many laughs.\n3. Assume that living in the islands is a day at the beach. Between the mind-numbing traffic, $10 milk , and skyrocketing rents, living in Hawaii is not for the faint of heart. Most locals feel lucky to live in \"paradise,\" but it can be a daily struggle just to get by.\n4. Start speaking pidgin the second you get off the plane. Pidgin, a creole language often used by locals in Hawaii, is a unique and beloved part of life in Hawaii. But it's probably best to stick to your native tongue if you don't want to attract some weird looks.\n5. Congest the roads to take in the sights © Getty Images/Lonely Planet Images The beautiful, scenic and winding road to Hana. Even Hawaii's most scenic roads might be someone's daily commute. There's nothing more frustrating when you're late for a meeting than being stuck behind a slow-moving vehicle that's taking photos out the window.\n6. Ignore high surf or flash flood warnings. As serene as they may seem, Hawaii's beautiful beaches, mountains and waterfalls can be treacherous for tourists and locals alike. For instance, Hanauma Bay, one of the most popular snorkel spots on Oahu, is the state's deadliest beach . Checking weather reports, surf forecasts and knowing your own limits prior to hiking or swimming could save your life.\n7. Touch turtles, Hawaiian monk seals, or any other threatened species. Hawaiian monk seals and honu (green sea turtles) are both endangered species, but that doesn't stop uninformed visitors from approaching them on the beaches or in the water. Observe these animals from a distance , or prepare to be hit with a hefty fine.\n8. Light up on the beach. © Getty Images/Flickr RM kauai seasape Smoking on Hawaii's beaches is illegal, which keeps the beaches clean. Doing your utmost to keep it that way is majorly appreciated by locals.\n9. Step on the coral. Don't let its rocky appearance fool you -- much of the seafloor is covered with living organisms. Touching coral with any part of your body can cause irreparable damage to one of the most vital components of undersea ecosystems.\n10. Bring invasive species. Sure, you can take a pineapple home, but there are strict guidelines for what comes in and goes out of Hawaii. We really like our snakeless islands, and we'd like to keep them that way.\n11. Stay in Waikiki the entire time. © Getty Images/Flickr RF Honolulu skylinefFrom diamond head There's so much more to Hawaii than the overcrowded tourist traps. Do some research, rent a car, and explore the lesser-known parts of the islands .\n12. Be a picky eater. Once you've gotten out of Waikiki, you'll realize that Hawaii's cultural melting pot means endless culinary possibilities . Step away from the chain restaurants, and your taste buds will thank you.\n13. Touch the lava. We know, we know, lava is cool, but resist the urge to get too close, or to put things like egg beaters in the flows -- aside from this being extremely unsafe, some locals consider interfering with the lava to be disrespectful to Pele, the Hawaiian goddess of volcanoes.\n14. Take the lava rock home. © Getty Images/Moment Open Boy's hands holding lava rock in Hawaii Removing lava rock or sand from Hawaii's Big Island might seem like a memorable souvenir, but you'd be better off buying a magnet. Legend has it you'll be cursed if you take it home with you.\n15. Drop in on a fellow surfer. Learning to surf in Hawaii is a blast, but if you're catching waves among locals, make sure you respect the rules of surfing. Most importantly, don't catch a wave someone is already riding .\nA video posted by @kookslams on Aug 1, 2015 at 5:05pm PDT\n16. Honk. People in Hawaii are exceptionally friendly drivers -- it's part of the \"aloha spirit.\" So keep your road rage to yourself and try throwing a shaka instead.\n ", "external_links": ["http://www.civilbeat.com/2014/06/respect-the-locals-sea-turtle-selfies-are-uncool-and-illegal/?ncid=txtlnkusaolp00000618", "https://instagram.com/p/53DfzCKF_J/?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/?ncid=txtlnkusaolp00000618", "http://www.hawaiinewsnow.com/story/29452971/smoking-at-state-parks-beaches-now-illegal-in-hawaii?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/2015/01/29/hawaii-deadliest-beaches_n_6550864.html?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/entry/hawaii-best-secret-beaches_560343c0e4b0fde8b0d140aa?ir=Hawaii&ncid=txtlnkusaolp00000618", "http://www.nmfs.noaa.gov/pr/education/hawaii/?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/2014/11/01/pahoa-lava-trespassers-arrested_n_6085416.html?ncid=txtlnkusaolp00000618", "https://en.wikipedia.org/wiki/Shaka_sign?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/2015/06/26/hawaii-homeless-relocation_n_7647794.html?ncid=txtlnkusaolp00000618", "http://hdoa.hawaii.gov/pi/pq/import-program/plant-guidelines/?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/entry/hikers-escape-flash-flood-maui-drone_55e7b33ce4b0c818f61aa755?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/2014/10/28/pahoa-lava-flow_n_6057318.html?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/2015/03/04/hawaii-food-bucket-list_n_6738518.html?ncid=txtlnkusaolp00000618", "https://joekent.wordpress.com/2013/04/19/why-is-milk-so-expensive-in-hawaii/?ncid=txtlnkusaolp00000618", "http://www.surfline.com/surfology/bill-of-lefts-and-rights/index.cfm?id=51320&ncid=txtlnkusaolp00000618", "http://www.reefresilience.org/coral-reefs/stressors/local-stressors/coral-reefs-tourism-and-recreational-impacts/?ncid=txtlnkusaolp00000618", "http://www.huffingtonpost.com/2013/09/10/hawaiian-legends_n_3898664.html?ncid=txtlnkusaolp00000618"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-02T03:48:22.404+03:00", "highlightTitle": ""}