{"organizations": ["Airwheel New Complete Electric Skateboards"], "uuid": "1c8ab56a1fefdb7d61fdb05139cfa64d1a35cd04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/how_to_skate_an_airwheel_new_complete_electric_skateboards_m3_several_simpl/", "country": "US", "title": "How to Skate an Airwheel New Complete Electric Skateboards M3? Several Simple Steps Will Work Out", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "How to Skate an Airwheel New Complete Electric Skateboards M3? Several Simple Steps Will Work Out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T02:51:00.000+03:00", "replies_count": 0, "uuid": "1c8ab56a1fefdb7d61fdb05139cfa64d1a35cd04"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/how_to_skate_an_airwheel_new_complete_electric_skateboards_m3_several_simpl/", "ord_in_thread": 0, "title": "How to Skate an Airwheel New Complete Electric Skateboards M3? Several Simple Steps Will Work Out", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Airwheel"], "text": "Press Releases How to Skate an Airwheel New Complete Electric Skateboards M3? Several Simple Steps Will Work Out Skateboarding is one of the most popular and iconic street sports. Whether someone want to learn the basics to cruise around, orwant to learn to kick flip like a pro, they can learn what steps needed to get started. However, beyond the common operation, Airwheel electric skateboard M3 has certain particular design, which excels others among its counterparts. Learning how to ride it, customers surf the sidewalk freely. USA, 21 October 2015 -- Skateboarding is one of the most popular and iconic street sports. Whether someone want to learn the basics to cruise around, orwant to learn to kick flip like a pro, they can learn what steps needed to get started. However, beyond the common operation, Airwheel electric skateboard M3 has certain particular design, which excels it among its counterparts. Learning how to ride it, customers surf the sidewalk freely. Firstly, when talking about riding an average skateboard, there are several basic steps. Firstly, one should stand on the board properly. Put the board flat on the ground and stand on it to learn to place his feet properly, and get his balance without falling down. Riding anAirwheel electric skateboard M3 adopts the same principle. Then, give oneself another push when one slows down. The next step is to flex the rider’s ankle and shift his or her weight to turn. The key is to ride with the knee flexed, keeping the rider’s center of gravity low to the ground. The latter steps are totally different from M3 and the reason account for the remote control system, which is also regarded as a breakthrough of Airwheel Technology. The wireless variable speed remote control has condensed wisdom with small size. They can easily control everything and make life become active by giving full paly to their innovation. In the past, remote control is always related to intelligent life such as the household appliances. Even the fuel driven vehicle is not able to achieve remote control completely. However, Airwheel made a magic.Equipped with the remote control system, even a skateboard green hand can operate it easily. Just putting on certain button, they can achieveacceleration, deceleration or turning around smartly. Because of the technology innovation, people are bestowed a more convenientlifestyle and travelling way! Get more infromations from Airwheel Official Site ! # # #", "external_links": [], "published": "2015-10-21T02:51:00.000+03:00", "crawled": "2015-10-21T17:35:50.747+03:00", "highlightTitle": ""}