{"organizations": [], "uuid": "a530e497639a391072505966a70295a318111ff4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/10/06/17/2D24B68B00000578-0-image-a-10_1444147693309.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3257646/The-things-hotel-room.html", "country": "GB", "title": "The free things you CAN take from your hotel room (and ones you can't)", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 11, "title_full": "The free things you CAN take from your hotel room (and the ones you can't) | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:27:00.000+03:00", "replies_count": 10, "uuid": "31408a322c496c859f5f0d74c1613d10e6db9606"}, "author": "Chris Kitching for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3257646/The-things-hotel-room.html#post-0", "ord_in_thread": 0, "title": "The free things you CAN take from your hotel room (and ones you can't)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "15 shares 13\nView\ncomments\nThere’s nothing thrifty holidaymakers love more than free stuff, especially when it comes to tiny bottles of shampoo or other complimentary items in a hotel room.\nWhile the perks can range from stationary to event tickets, depending on the hotel’s star rating, some guests are willing to go a step further and nick bathrobes or pillows even though they risk being hit with a huge bill weeks later.\nMailOnline Travel has compiled a list of free things guests can take from their rooms or request from the front desk, along with some amusing tales about those who were caught swiping items that were off-limits.\nNo matter how comfy that bathrobe is, you can't take it with you unless you're willing to pay a hefty charge\nToiletries\nMiniature bottles of shampoo, conditioner and shower gel, and tiny bars of hand soap are the classic example of complimentary items in a hotel room.\nThey range from basic to high end, with five-star hotels offering luxurious lotions from designer brands such as Hermes or Bulgari.\nSome guests will even sneakily raid the housekeeper’s trolley when no one is looking.\nThe tiny bottles are often at or below 100ml in size, meaning they’re perfect to take in hand luggage on the flight home.\nEvent tickets\nHigher-end hotels are willing to go a little further to pamper their well-heeled guests, and they may throw in free tickets to events or tourist attractions.\nIn the Big Apple, the James New York hotel offers free tickets to the New Museum, Manhattan’s only dedicated contemporary art museum, through its Cultural Collection programme.\nOther perks include free admission to outdoor screenings by the Lower East Side Film Festival, and educational programming hosted by The Drawing Center, a non-profit exhibition space.\n Next Classical musician 'threatened with arrest and patted down... Hot tub canoodlers, inattentive parents and hallway... Three in four British travellers 'now actively avoiding'... The ultimate retreat: Stunning walled medieval town on... 15 shares Toothbrushes\nThose who stay in four- and five-star hotels on a regular basis likely have a drawer at home filled with toothbrushes or single-use tubes of toothpaste.\nFree toothbrushes are standard at Shangri-La hotels, for example, along with bath products from L’Occitane en Provence.\nThey’re rarely offered at budget or middle-of-the-road hotels, although guests can request them from the front desk if they forgot to pack theirs.\nOther freebies can include razors, shaving cream, cotton ear buds, shoe shine cloths or sponges, sewing kits, combs and nail files.\nTravelodge says some guests have tried to smuggle its king size Dreamer Beds out of its UK hotels\nITEMS TAKEN FROM HOTEL ROOMS Unopened toiletries (61,000 taken by guests) Light bulbs (53,000) Batteries (48,000) Towels (44,000) Plants (36,000) Bibles (34,000) Bath-mats (28,000) Duvet Covers (23,000) TV Remotes (17,000) Hairdryers (15,000) Source: Laterooms.com\nBeds\nIt’s a no-brainer that a mattress or bed is not free and taking one would put a holidaymaker at risk of being charged with theft, but that hasn’t deterred some guests.\nAccording to Travelodge, some guests have tried to smuggle its king size Dreamer Beds out of its hotels.\nShakila Ahmed, Travelodge spokeswoman, said: 'Since we have introduced our new brand design and modernised our hotel rooms across the country, we have seen a significant rise in our fluffy pillows, snuggly duvets, striped bed runners and contemporary artwork being taken from our 504 UK hotels.’\nFood and drink\nThese days, it seems like almost every hotel room in the world – no matter the star rating – offers complimentary tea and coffee (plus sugar and artificial sweeteners) for guests.\nIn more expensive hotels, guests may find a Nespresso machine with a case stocked with capsules, or a bottle of Champagne to welcome them upon arrival.\nBut at most hotels, bottles of bubbly, spirits or beer are usually kept in the overpriced mini-bar.\nOther freebies can include fruit, biscuits and packets of crisps to consume in the room or take home.\nDoubleTree by Hilton gives out 77,000 free chocolate chip cookies to its guests each day, amounting to 28million a year.\nBob Atkinson, travel expert at TravelSupermarket, said: ‘One of the main areas guests get caught out when staying in a hotel is by being tempted by mini-bar snacks and drinks. That bottle of water so tempting to grab on our way out can come back to haunt us when we get lumped with an extortionate bill at the end of our stay.’\nSlippers… and bathrobes?\nHotels with spas usually have at least two pairs of light-duty slippers in each room for guests to use in their rooms or take home with them. But they should double check before stuffing them in their suitcase.\nBathrobes are usually a no-no. Exclusive hotels may offer free ones, but that’s a rare scenario.\nIf guests check the information book or card in their room, they will notice in almost all cases that the robes are not free, but can be purchased from the front desk.\nMr Atkinson said: ‘Do not be tempted to snaffle dressing gowns, towels, ornaments, pictures on the wall, fixtures, TV remote controls, irons and hairdryers. ‘All of these are not “free” gifts however tempting they may be and you face having your card debited for these items. And that charge will not be cheap. If in any doubt at all then check with reception.’\nStationery\nNotepads, panes, magazines and newspapers are all complimentary.\nAt the Trump Hotel Central Park in New York, guests request and receive personalized business cards and stationary at no cost.\nWhen guests stay a second time they receive free luggage tags.\nA study by Laterooms.com found that 34,000 Bibles are lifted from hotels by British travellers every year\nBibles and bathmats\nA study by Laterooms.com found that 34,000 Bibles are lifted from hotels by British travellers every year, along with light bulbs, towels and TV remotes – thus breaking the eighth commandment.\nSome light-fingered guests even took plants, bathmats and duvet covers, which are not complimentary.\nNearly half (45 per cent) of the 8,000 hotels who participated said the items most commonly taken are everyday objects like batteries and light bulbs.\nIn a separate study of nearly 1,330 British holidaymakers, more than two thirds admitted to stealing from hotels while on holiday abroad, said MyVoucherCodes.co.uk, which commissioned the survey.\nSome of the most common items that people admitted to stealing were towels and linen, cutlery, picture frames, artwork, curtains and kettles.\nFree gifts for kids (and pets)\nHotels are more than eager to welcome their youngest guests, showing children with all kinds of freebies to keep them and their parents happy.\nAt the Jefferson Hotel in Washington, DC, children can choose a free toy from a red wagon upon arrival.\nFamilies who stay at Great Wolf Lodge, a chain of hotels and indoor water parks, can create a Shutterfly photo book for free with a promo code found in rooms.\nThe hotel also offers goodies for four-legged visitors, and will put dog bowls and beds inside the room before the guest arrives.\nUltimately, Mr Atkinson said, guests should make sure they know what is included in their nightly rate before they throw something in their luggage to take back home.\nHe said: ‘Items such as wifi, breakfast and parking are usually listed in the hotel details. If you’ve not planned ahead and budgeted for items that could be classed as extras, it can be a nasty surprise to realise you need to folk out on the day.’", "external_links": ["http://dailym.ai/1WQJU8d"], "published": "2015-10-09T16:27:00.000+03:00", "crawled": "2015-10-09T16:50:50.736+03:00", "highlightTitle": ""}