{"organizations": [], "uuid": "4bc035408576f82f41d36d633c489eff0a89f440", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/65062/business-travel-coalition-chief-appeals-united-airlines-acting-c", "country": "US", "title": "Business Travel Coalition chief appeals to United Airlines Acting CEO", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Business Travel Coalition chief appeals to United Airlines Acting CEO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:45:00.000+03:00", "replies_count": 0, "uuid": "4bc035408576f82f41d36d633c489eff0a89f440"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/65062/business-travel-coalition-chief-appeals-united-airlines-acting-c", "ord_in_thread": 0, "title": "Business Travel Coalition chief appeals to United Airlines Acting CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Travel Coalition chief appeals to United Airlines Acting CEO \nMr. Brett Hart Chicago, IL 60606 \nDear Mr. Hart, \nI want to bring to your attention the growing risk to your airline, its workers, shareholders and customers resulting from the war on new entry that the troika of United Airlines, Delta Air Lines and American Airlines are waging against Gulf carriers Emirates Airline, Etihad Airways and Qatar Airways. \nThe vast, vast majority of your very best corporate customers and distribution partners reject that protectionist campaign, which also includes politically blocking Norwegian Air International’s application to serve the U.S. \nAs Business Travel Coalition wrote in June and September of this year, such protectionism is being carefully watched by airlines and labor groups worldwide. The toxic negotiating environment your campaign has created is increasingly undermining liberal bilateral aviation agreements. “If America can walk away from open markets, why can’t we?” \nThe fact of the matter is that the painstakingly created international system for aviation liberalization is now under a cloud of uncertainty and could quickly unravel if competitive self-interest is allowed to prevail over national and consumer interests. \nIndeed, the influential CAPA published an insightful analysis today, “US Attack On Gulf Airlines May Prove A Tragic Miscalculation By Delta & Partners As Mexico Rebels.” CAPA strongly reinforces the risks associated with the commercial protectionism that you and your partners seek. \nHere are a few excerpts of CAPA’s important points: \n“By attacking the Gulf airlines on the alleged grounds that they were subsidised, there was always a serious danger that the clearly protectionist action would spark a wider threat to the very concept of open skies that has served US airlines so well in expanding their international influence.” \n“Now that risk may be materialising as Mexican airline unions take to the streets to protest the threat to their existence if Mexico signs a very liberalised, almost open skies agreement with the US. Certainly there is talk in aviation administrations around the world that the open skies concept is under review in the US. This is not good news for anyone, least of all the US airlines.” \n“Perhaps the intent was simply to place a cap on the level of capacity of Emirates, Etihad and Qatar in the US. Perhaps this view was supported by the controversial way the US Department of Transportation has squatted uncomfortably on the application of Norwegian International to fly to the US (although this may be backfiring, as Norwegian adds capacity under its own brand).” \n“Mexico’s pilot and flight attendant unions have weighed in on the enhanced aviation agreement, recently staging a protest at Mexico City Juarez Airport, claiming the deal is imbalanced. According to Facebook posts union officials have also met with Senators to express their opposition to the agreement.” \n“But the protests and opposition of the unions is against a backdrop of an unprecedented time in global aviation when the essence of open skies agreements are in the spotlight.” \n“The protests also cast a light on the larger issue of the Big 3 taking a protectionist stance against the largest Gulf carriers while aiming to capitalise on the benefits of certain open skies (or very liberalised) agreements with other countries.” \n“It is a delicate path to walk as governments attempt to navigate open skies pacts within the context of the three largest US global network airlines picking and choosing the agreements that work best for their own advancement.” \n“The question arising over the protests by Mexico’s unions about an agreement that is not technically an open skies framework is if other global labour groups will start to question the balance of current US open skies agreements.” \nMr. Hart, I appeal to you to heed the concerns of your best customers and disengage from this misguided campaign that is doomed to failure and that will continue to generate serious unintended consequences. Indeed, this injudicious adventure has been a major distraction that has taken management time and attention away from efforts to make United Airlines the competitive powerhouse that it should be. \nCorporate travel managers – your best hope for moving your business to sustainable and adequate financial returns – are deeply concerned over your airline’s efforts to frustrate foreign carrier new entry whether it is the Gulf carriers or Norwegian Air International. The antitrust immunity that United benefits from with its global joint venture partners is predicated upon open and robust new entry. The troika is putting this valuable competitive advantage at great risk. \nAs I have done at the request of your predecessors, I would be pleased to assemble a group of corporate travel and conference managers so that you could hear first hand and unfiltered their concerns and aspirations for your company. \nSincerely,", "external_links": [], "published": "2015-10-21T19:45:00.000+03:00", "crawled": "2015-10-22T01:01:58.938+03:00", "highlightTitle": ""}