{"organizations": [], "uuid": "509adf51ec2a0dd24815eaf659e2c8647b76a405", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/texas/20151010-tra_regnotes_1011tra_46408641.ece/BINARY/original/TRA_REGNOTES_1011TRA_46408641", "site_section": "http://www.dallasnews.com/lifestyles/travel/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/texas/20151010-texas-neighbors-moody-gardens-becomes-an-ice-paradise.ece", "country": "US", "title": "Texas & Neighbors: Moody Gardens becomes an ice paradise", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Texas & Neighbors: Moody Gardens becomes an ice paradise | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T04:19:00.000+03:00", "replies_count": 0, "uuid": "509adf51ec2a0dd24815eaf659e2c8647b76a405"}, "author": "MARY DUNKLIN", "url": "http://www.dallasnews.com/lifestyles/travel/texas/20151010-texas-neighbors-moody-gardens-becomes-an-ice-paradise.ece", "ord_in_thread": 0, "title": "Texas & Neighbors: Moody Gardens becomes an ice paradise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ABBEVILLE, LA.\nEgg celebration is an annual ode to the omelette\nSome people like eggs. Others really, really like eggs and want to celebrate in a gigantic way. Those folks should make the trek to Abbeville for the 5,000 Egg Giant Omelette Celebration on Nov. 7-8.\nThere’s even an official Sunday Mass for the event at St. Mary Magdalen Catholic Church, where the eggs, bread and festival itself are blessed. Highlights of the event include watching the preparation of the omelette and eating the free samples on Sunday. Don’t miss the other food vendors, entertainment, art show, music and more throughout the weekend.\nTraveler’s tip: The event takes place in Vermilion Parish, which also offers bird-watching, crawfish eating and plantation touring this time of year, so consider adding those activities during your visit.\nContact: giantomelette.org ; mostcajun.com\nMary Dunklin\nDENVER\nFilm lovers can get their fix at 12-day festival\nPlan an end-of-the-year getaway to Colorado in time for the Denver Film Festival, Nov. 4-15.\nThe event, which attracts nearly 55,000 filmgoers, is screening more than 200 independent films. Other offerings include industry panels, workshops, achievement awards and tributes. The full 12-day program will be announced Oct. 19.\nThe Sie FilmCenter will be the anchor venue for the fest with all red-carpet presentations at the Ellie Caulkins Opera House.\nTickets go on sale to Denver Film Society members on Oct. 21 and online to the public on Oct. 23.\nContact: d enverfilm.org/festival\nNEW ORLEANS\nCrescent City fest welcomes readers of all ages\nThe New Orleans Book Festival offers family-friendly fun for readers of all ages. The free event includes panel discussions, children’s activities, live music and more.\nEnjoy an outdoor show from 6:30 to 8 Friday night on the Latter Branch Library lawn at 5120 St. Charles Ave.\nOn Saturday, visit the shores of Big Lake at City Park from 10 a.m. to 4 p.m. for more book-themed fun. Visit with local and national authors and stay for live readings.\nEvery child who attends will get free books, snacks and bus transportation.\nPlus, the nearby New Orleans Museum of Art is offering half-price admission the days of the event.\nContact: nolabookfest.org\nGALVESTON\nMoody Gardens will transform into a paradise of ice\nA team of master carvers is transforming 2 million pounds of ice at Moody Gardens into Ice Land: Ice Sculptures With SpongeBob SquarePants. The attraction will be open Nov. 14 through Jan. 10.\nMore than 100,000 guests visited the inaugural Ice Land last year. The theme this year is SpongeBob’s Christmas Party, where guests can walk through a full-size Krusty Krab, explore an all-ice Flying Dutchman pirate ship and see other sites made famous by the Nickelodeon cartoon. Plus, last year’s popular 100-foot ice slides will be back with an all-new sled race.\nAdmission is $26.95 for adults, $21.95 for seniors (65 and older) and $15.95 for children (4-14). A $5 discount is available Sunday through Thursday Nov. 15-Dec. 17, excluding Thanksgiving. Other holiday attractions on-site include the Festival of Lights, ice skating and a gift market.\nContact: 1-800-582-4673; moodygardens.org", "external_links": ["http://enverfilm.org/festival"], "published": "2015-10-11T04:19:00.000+03:00", "crawled": "2015-10-19T07:05:41.397+03:00", "highlightTitle": ""}