{"organizations": [], "uuid": "4ec10d82d40ba89bec8352488733cdcabac99507", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03464/Security_officer_w_3464229k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-05.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/11912804/avoid-cyber-attacks.html", "country": "US", "title": "How to avoid cyber-attacks", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "How to avoid cyber-attacks - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:06:00.000+03:00", "replies_count": 0, "uuid": "4ec10d82d40ba89bec8352488733cdcabac99507"}, "author": "Iain Aitch", "url": "http://www.telegraph.co.uk/sponsored/11912804/avoid-cyber-attacks.html", "ord_in_thread": 0, "title": "How to avoid cyber-attacks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Continuing problems with internet-connected cars in the US have brought the issue of cyber-security to the fore lately, with the Senate now intervening to question automobile manufacturers on the threats they face. Even tech giants are not always immune, as the recent Apple App Store issue demonstrates. Are cyber-attacks becoming the norm and what can you do about them? Secure your data– and don’t forget about your customers’ The extramarital dating agency Ashley Madison saw the damage that a security breach can do to a business that relies on discretion, but any business can be harmed by a data leak, especially when it relates to customer data. “It's important to take a pragmatic approach to security and be aware of the risks that cyber-attacks present and how best to reduce that risk and impact,” says Alex Davies, security consultant at MWR InfoSecurity. “This is also true of any products a company makes, as security issues in products will often result in reputation damage and customer data loss.” Control access, but don't overdo it “You have to build in trust and risk management of your supply chain and your employees,” says Dr Christopher Richardson, of the cyber-security unit at Bournemouth University. “If you set strict rules, people will breach what you miss. You have to make people want to work with you. SMEs are about teamwork, so you have to have a sensible approach, not a draconian one.” Costlier does not always mean better Paying an external agency to monitor cyber-security can reassure SMEs and their customers, but this can seem like a luxury when you are struggling to pay bills and staff salaries. The Department for Business, Innovation and Skills runs a voucher scheme that SMEs can apply for but there are efficient ways to secure your data free of charge. “There are a number of excellent free tools available,” says Stephanie Hankey, executive director at Tactical Tech, which works with activist and advocacy groups. “There are also resources that can help you figure out what your security questions are in the first place and how you might go about addressing them.” Tactical Tech’s websites Me and My Shadow and Security in-a-box are both worth looking at. Stay up to date Many SMEs will think about security when setting up and then forget all about it, assuming that software package they installed will do all the work for them. But out-of-date systems and software can cause as many problems as failing to update firewalls or virus protection. “Patching is one of the simple cardinal rules,” says Dr Richardson. “If you have software, then update it. Whatever software or security you have, people will exploit it. If you don't patch then you are exposed to risk. “Once you understand it, you realise that you need this basic hygiene doing it. Even once a month is too much for some people, but that would make a huge impact for SMEs.” Assume they are out to get you, but don't get paranoid “The best approach is to assume that a compromise will occur at some point and take a defence-in-depth approach to security to properly minimise impact,” says Alex Davies. “It's easy to read the media hype and be scared into thinking the security bogeyman is out to get us all. Cybergeddon is unlikely to happen tomorrow, but it's important to recognise the real risks faced by most organisations. • For more advice on preparing your business for the tech challenges of the future, visit HP BusinessNow You may also be interested in: • Should small businesses borrow money to grow? • A first sight of the Small Business Saturday 100 • How to pitch to a Silicon Valley Venture Capitalist • Set your people free with the ultimate in flexible working • Confessions of a crowdfunder • MPs unaware of Government help for small businesses", "external_links": [], "published": "2015-10-06T01:06:00.000+03:00", "crawled": "2015-10-05T19:59:42.708+03:00", "highlightTitle": ""}