{"organizations": [], "uuid": "e856c7d126d3bc87038823d57edc97a033ca61f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151020Fuel.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/10/20/regulatory-authority-updates-fuelprices-formula", "country": "US", "title": "Regulatory Authority updates formula for calculating fuel prices", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Regulatory Authority updates formula for calculating fuel prices", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:19:00.000+03:00", "replies_count": 0, "uuid": "e856c7d126d3bc87038823d57edc97a033ca61f2"}, "author": "L. Arias", "url": "http://www.ticotimes.net/2015/10/20/regulatory-authority-updates-fuelprices-formula", "ord_in_thread": 0, "title": "Regulatory Authority updates formula for calculating fuel prices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nARESEP officials believe changes in the formula for calculating fuel prices will increase transparency and benefit consumers. (Via RECOPE) \nCosta Rica’s Public Services Regulatory Authority ( ARESEP ) announced this week that it will begin to take into account the actual amount paid for oil by the Costa Rican Oil Refinery ( RECOPE ) when calculating the price of fuel at the pump, rather than relying on reference prices for international oil. \nIn addition, ARESEP will stop using the dollar exchange rate on the day it sets new prices, and instead will use the average exchange rate over the previous 15 days. \nThe regulatory agency said the changes in the way it calculates gas prices are designed to bring more transparency to the process. \nARESEP also said the new formula would ensure that motorists pay prices closer to the actual costs paid and incurred by RECOPE. \nARESEP Energy Manager Juan Quesada Espinoza said the new methodology will allow for more transparency in terms of the costs taken into account in setting fuel prices. “This new calculation formula provides a more rigorous, timely, transparent and reliable process, allowing us to transfer the benefits to the people,” he said. \nARESEP also announced it will conduct a yearly financial audit of all costs associated with RECOPE’s services, in order to ensure that income from prices paid at the pump is used to assure quality, reliability and optimum service delivery. \nThe new methodology will enter into force following its publication in the official newspaper La Gaceta. Contact L. Arias at larias@ticotimes.net", "external_links": [], "published": "2015-10-21T00:19:00.000+03:00", "crawled": "2015-10-21T06:48:51.192+03:00", "highlightTitle": ""}