{"organizations": [], "uuid": "2c70305bde8baa1c06caac8f6ab874c09c34751f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03474/awards-india_3474450a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-16.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travel-competitions/11931935/Telegraph-Travel-Awards-201516-win-a-38700-private-tour-of-India-and-Dubai.html", "country": "US", "title": "Telegraph Travel Awards 2015/16: win a £38,700 private tour of India and Dubai", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Telegraph Travel Awards 2015/16: win a £38,700 private tour of India and Dubai - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T22:18:00.000+03:00", "replies_count": 0, "uuid": "2c70305bde8baa1c06caac8f6ab874c09c34751f"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/travel/travel-competitions/11931935/Telegraph-Travel-Awards-201516-win-a-38700-private-tour-of-India-and-Dubai.html", "ord_in_thread": 0, "title": "Telegraph Travel Awards 2015/16: win a £38,700 private tour of India and Dubai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From the magical romance of the Taj Mahal by moonlight to the world’s tallest building, a 12-night private tour of India and Dubai’s finest sights and sounds, worth £38,700; tailor-made by Greaves India ( greavesindia.com ), with all-suite accommodation provided by Oberoi Hotels & Resorts ( oberoihotels.com ), and international return flights with British Airways World Traveller Plus. The lucky winner gets a chance to indulge in the romantic, exotic East and experience the legendary Oberoi service. Greaves India will provide personal guides, historians, shoppers and chauffeurs to help you get under the skin of each destination – whether it’s the fast-paced capitals of New Delhi, Mumbai and Delhi or the vibrant legacy of the erstwhile kingdoms of Agra, Jaipur and Udaipur. Or help you go in search of the elusive tiger at Ranthambhore National Park. The award winning luxurious The Oberoi Amarvilas, Agra; TheOberoi Rajvilas, Jaipur, The Oberoi Vanyavilas, Ranthambhore and The Oberoi Udaivilas, Udaipur will each reveal a destination in themselves, boasting unparalleled locations and architecture that pays homage to each region’s culture and design. While the contemporary luxury city hotels, the ICONIC The Oberoi, New Delhi – celebrating its 50 years, The Oberoi, Mumbai and The Oberoi, Dubai offer a unique world­class experience as you embark on a journey of discovery. How to enter Follow this link to tell us about your favourite travel companies and destinations - and to enter the draw for one of 27 prizes . You will need to leave your name, telephone number and a valid email address. See here for full terms and conditions . The prize Experience the best of India and Dubai in luxury with Oberoi Hotels & Resorts and Greaves India. From the serenity of the Taj Mahal to bustling spice bazaars and elephant back rides; the awe inspiring forts and palaces of Rajasthan to the city slicker sky scrapers of Dubai, this 12 night itinerary offers a window into vibrant cultures, historic monuments and extraordinary landscapes. Destination specialist Greaves India will be on hand to ensure you savour every moment and Oberoi Hotels & Resorts will welcome you with their unparalleled levels of service, suite accommodation and unique Oberoiexperiences at every stage of your journey. The trip starts at the iconic The Oberoi, New Delhi, ideally located in the heart of the capital. The hotel celebrates its 50thanniversary this year and was the first to offer its guests 24 hour butler service, which is yours to enjoy. Explore the architectural legacy of past dynasties including the 13thCentury Qutub Minar and Shajahanabad – where the magnificent Red Fort, the bustling Chandni Chowk and India’s largest mosque, Jama Masjid make up the symbolic heart of the city. Take a short rickshaw ride through the narrow lanes of Old Delhi and take in the delicious smells of Asia’s largest spice market at Khari Baoli. The next stop is on everyone’s ‘bucket list’; marvel at the Taj Mahal, Agra from dawn till dusk – a view which you can enjoy from the comfort of your suite at The Oberoi Amarvilas, located a mere 600 metres away. From the Taj to Tigers – the journey continues to the Ranthambhore National Park, the best place in the world to see the Royal Bengal tiger. The Oberoi Vanyavilas, set within 20 acres of landscaped gardens, offers elegantly appointed Luxury Tents and is the perfect base from which to explore the territory of this majestic beast. The Oberoi Spa will welcome weary limbs with a range of beauty and wellness therapies. While from the top of the observation tower, one can admire panoramic views of the bordering jungle, spot wildlife at the nearby watering hole and sip champagne at sundown. Next stop is the wondrous ‘Pink City’ of Jaipur. The majestic Amber Fort has recently been anointed UNESCO World Heritage Status and you can enjoy the city views while ascending on the top of an elephant. An expert guide will be on hand to show you the rest of the treasures including the City Palace, Hawa Mahal – the Palace of the Winds and source the best quality textiles and gem stone jewellery, for which Jaipur is renowned. The Oberoi Rajvilas, is the ideal place to retreat after a day’s sightseeing. This idyllic hotel evokes princely Rajasthan in a fort like setting with Luxury Villas, Suites and Royal Tents overlooking a restored 280 year old Shiva temple and Haveli (mansion) set within 32 acres of lush gardens. Driving through the ancient Aravalli Hill range, Udaipur – the city of the lakes is the next stop. Take in the views of the Lake Pichola from The Oberoi Udaivilas, Udaipur – an award­winning luxury hotel conceived as a traditional Indian palace. Indulge in rejuvenating therapies at The Oberoi Spa which is a sanctuary of peace and tranquillity and attend meditation sessions with the in­house Yogacharya; as well as visit the exquisite City Palace, gaze on the largest private collection of crystal in the world at the Crystal Gallery and take a boat ride on the sparkling Lake Pichola. Leaving Rajasthan behind, take an evening flight into Mumbai, India’s City of Dreams. Stay at the contemporary chic TheOberoi, Mumbai, with its unrivalled position on the Marine Drive, and enjoy views of the ocean, and the Queen’s Necklace. The hotel is ideally placed to visit the main attractions and you will take a guided walking tour of world renowned Chhatrapati Shivaji Terminus to the frenzied efficiency of the Dabbawalas at Churchgate station, assembling and distributing the Dabbas (Tiffin Lunch boxes) to their respective areas. The Kala Ghoda (Black Horse) art district, Dobhi Ghat – the open air laundromat all contribute to the energy and creativity so unique to the city. From India to the UAE, experience The Oberoi Group’s first property in the region, The Oberoi, Dubai. The contemporary luxury hotel embodies height, light and space, and offer spectacular views of the iconic Burj Khalifa and the city skyline. Enjoy the central location of Downtown Dubai, with the opportunity to indulge in some tax­free shopping in the Dubai Mall. The prize providers The family-owned award­winning Greaves India was established in 1979, with the professional and cultural root of the company lying in India and stretching back over generations. Armed with specialist knowledge of the subcontinent, having taken clients there for over 30 years, Greaves India offers unique and expert experience to the modern traveller. Greaves can provide their exclusive private plane to remote safari parks, a private chauffeur driven car to navigate the Golden Triangle, or a traditional train journey with panoramic views through some of India’s remotest countryside. With such passionate and trustworthy personal attention from Greaves’ staff in the UK and on the ground in India, you can relax completely and enjoy a stress­free, inspirational and truly unforgettable holiday. Oberoi Hotels & Resorts are synonymous the world over for providing the right blend of service, luxury and quiet efficiency. Internationally acclaimed for all­round excellence and unparalleled levels of service, Oberoi Hotels & Resorts have received innumerable awards and accolades. A distinctive feature of the Group’s hotels is their highly motivated and well trained staff who provides exceptionally attentive, personalised and warm service. The Group’s luxury hotels have established a reputation for redefining the paradigm of luxury and excellence in service amongst hotels around the world. Terms and conditions From The Oberoi Group: Suite Category / Accommodation only at: The Oberoi, New Delhi (x 2 nights) The Oberoi Amarvilas, Agra (1 x night) The Oberoi Rajvilas, Jaipur (2 x nights) The Oberoi Vanyavilas, Ranthambhore (2 x nights) The Oberoi Udaivilas, Udaipur (2x nights) The Oberoi, Mumbai (1 x night) The Oberoi, Dubai ( 2 x nights) One Oberoi Experience at each of the hotels depending on which hotels are selected by the prize winner. The validity of will be one year and subject to availability. Hence, please make your reservation at least three weeks in advance. The original copy of the certificate must be presented to the hotel upon arrival, without which, the prevailing best available rate of the reserved room category shall apply. Please note that Ranthambhore National Park is closed from June –September, 2016. Please make reservations at least four weeks in advance. From Greaves India: • Return adult airfare on British Airways in World Traveller Plus class London – Delhi / Dubai ­ London • Internal flight for Udaipur – Mumbai sector • International airfare using Jet Airways flight for Mumbai – Dubai sector • Transfers, sightseeing and excursions as per programme using an air- conditioned Toyota Innova car at all palaces • A brief cycle rickshaw ride in Old Delhi • 01 visit to Taj Mahal in Agra • 1 x Game Drive at Ranthambhore National Park for 2 people in a shared jeep • Excursion to Amber Fort with an Elephant ride up the hill and descend by jeep in Jaipur • Visit to Crystal Gallery in Udaipur • Heritage walking tour in Mumbai • Day with personal shopper Mumbai • English speaking local guide during sightseeing as per itinerary • Entrance fees and video / still camera fees at monuments as per itinerary • Porterage at airport The above does not include the following: • Meals except where stated, telephones, laundry or personal items • Any changes you may choose to make during your holiday • Travel Insurance • India visa charges • Gratuities • Any surcharge levied on payment by Credit Cards (details on our booking form) Telegraphtravel", "external_links": [], "published": "2015-10-16T22:18:00.000+03:00", "crawled": "2015-10-16T16:41:46.619+03:00", "highlightTitle": ""}