{"organizations": [], "uuid": "0907c35a52f70ebff149549057761382450af153", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/08/GBTA_Tagline.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/gbta-and-vdr-announced-speakers-of-gbta-conference-2015/", "country": "US", "title": "GBTA and VDR announced speakers of GBTA Conference 2015 - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "GBTA and VDR announced speakers of GBTA Conference 2015 - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "0907c35a52f70ebff149549057761382450af153"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/gbta-and-vdr-announced-speakers-of-gbta-conference-2015/", "ord_in_thread": 0, "title": "GBTA and VDR announced speakers of GBTA Conference 2015 - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GBTA and VDR announced speakers of GBTA Conference 2015 Published on : Saturday, October 17, 2015\nThe Global Business Travel Association (GBTA) – the voice of the global business travel industry – and German business travel buyer association VDR – announced that Alan Rich, CEO, Chrome River; Bill Glenn, President and CEO, American Express Global Business Travel and Patrick Diemer, Managing Director and Chairman, AirPlus International, will be featured speakers at their joint conference taking place in Frankfurt, 9-11 November.\nRich, Glenn and Diemer will come together in the CEO Industry Outlook Panel looking at the transformational trends such as big data; the rise of mobility; the sharing economy; developments in technology; consumerization and the new world order. GBTA Executive Director and COO Michael W. McCormick will moderate the panel.\nCatherine McGavock, GBTA’s Regional Vice President – EMEA said: “We are pleased to welcome this distinguished panel. In their roles as industry leaders, they are poised to provide delegates an insightful perspective on these changes and how they are set to shape our industry.”\nDirk Gerdom, President of VDR added, “The world around us is changing at an unprecedented rate – bringing with it both new challenges and opportunities. The smart professionals will seek to equip themselves with the skills and knowledge to meet these challenges to not just survive – but to adapt and thrive in the new world. This panel will help them on their journey to better understand what is in store so they can better prepare for and better perform in the future.”\nFollowing the success of last year’s conference, the event brings together GBTA’s annual conference in Europe with German partner association VDR’s autumn symposium to create Europe’s foremost business travel conference, expected to attract more than 900 delegates from over 20 countries.", "external_links": [], "published": "2015-10-17T03:00:00.000+03:00", "crawled": "2015-10-17T21:14:05.473+03:00", "highlightTitle": ""}