{"organizations": ["Indonesian TV ONE", "Complete Electric Skateboard in Southeast Asia Airwheel Self-balancing Complete Electric Skateboard"], "uuid": "bd446d4c914178e33fa15847f0896f5f1295a813", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/airwheel_self_balancing_complete_electric_skateboard_in_southeast_asia/", "country": "US", "title": "Airwheel Self-balancing Complete Electric Skateboard in Southeast Asia", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Airwheel Self-balancing Complete Electric Skateboard in Southeast Asia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T02:01:00.000+03:00", "replies_count": 0, "uuid": "bd446d4c914178e33fa15847f0896f5f1295a813"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/airwheel_self_balancing_complete_electric_skateboard_in_southeast_asia/", "ord_in_thread": 0, "title": "Airwheel Self-balancing Complete Electric Skateboard in Southeast Asia", "locations": ["USA", "Thailand", "Indonesia", "Southeast Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mos Patiparn"], "text": "Airwheel Self-balancing Complete Electric Skateboard in Southeast Asia Since the Airwheel has become a world famous brand in electric self-balancing scooter industry, what is the riders’ reaction to using the Airwheel electric self-balancing scooter? USA, 9 October 2015 -- Within several years’ development, the brand Airwheel makes up a huge share of the market of electric self-balancing scooter. Since the Airwheel has become a world famous brand in electric self-balancing scooter industry, what is the riders’ reaction to using the Airwheel electric self-balancing scooter? Today, the Airwheel editor will lead us to the Southeast Asia, taking Indonesia and Thailand as an example. There is an increasing presence in Thailand and Indonesia. Two weeks ago, the Indonesian TV ONE had reported Airwheel M3 electric skateboards in detail, including the operation systems. It explains the terms used in Airwheel electric scooter operation systems, such as aerospace attitude control theory, fuzzy software algorithm and gyroscope system.In Thailand, Mos Patiparn, a super star, rode Airwheel electric unicycle at the concert, which made his fans feel amazing. On the stage, Mos Patiparn rode Airwheel X8 electric unicycle freely. He could make circles and other difficult stunts by riding Airwheel electric self-balancing scooter. His dance team members were also riding Airwheel electric unicycles and they put it into the dance movement. His fans were all shocked and screamed loudly to show their love for him. Mos Patiparn’s riding of Airwheel electric scooters created a buying spree. And after listening to the concert, many people have bought the Airwheel electric scooter and they have found many other applications. In daily life, Airwheel can be used to work, to go to school, to go shopping and many other usages. All the intelligent electric scooters in Airwheel family are maintained balance by leaning forward and backward. Riders can control the scooter to go forward, accelerate, decelerate, and brake, etc. by leaning forward or backward. They are all has original Japan-made lithium battery inside. The Airwheel electric self-balancing scooter will be recognized and loved by more and more people in Southeast Asia, due to its trendy design. # # #", "external_links": [], "published": "2015-10-09T02:01:00.000+03:00", "crawled": "2015-10-10T09:00:40.132+03:00", "highlightTitle": ""}