{"organizations": [], "uuid": "2dcad2e1e817128201de1d212887cc3115674d52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/h/1/1/p/image.related.StuffLandscapeSixteenByNine.620x349.17gqti.png/1444790382107.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/business/73004742/Motel-and-hospitality-associations-combine", "country": "AU", "title": "Motel and hospitality associations combine", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Motel and hospitality associations combine", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:39:00.000+03:00", "replies_count": 0, "uuid": "2dcad2e1e817128201de1d212887cc3115674d52"}, "author": "Alan Wood", "url": "http://www.stuff.co.nz/business/73004742/Motel-and-hospitality-associations-combine", "ord_in_thread": 0, "title": "Motel and hospitality associations combine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Motel and hospitality associations combine ALAN WOOD Last updated 15:39, October 14 2015 KENT BLECHYNDEN/FAIRFAX NZ \nHospitality New Zealand president Adam Cunningham says the combined accommodation body will better serve members and present a united voice. \nAt a time when renting out a spare bedroom on Airbnb is making inroads into the commercial accommodation sector, two industry bodies have combined. \nAn amalgamation between Hospitality New Zealand and the Motel Association of New Zealand has been formalised, with a contract between the two recently signed. They will work on tackling accommodation issues the industry is worried about. \nThe new body, Hospitality NZ comes after six months of talks between the organisations, Hospitality New Zealand president Adam Cunningham said. \nHospitality NZ would bring together more than 3300 members across New Zealand, combining all parts of the hospitality sector – including motels, hotels, cafes, bars, restaurants and retail beverages. \nMotel Association chief executive Michael Baines said there were changes within the overall commercial accommodation sector and part of that was driven by the emergence of Airbnb as a distributor. \nWith the help of such distributors Kiwis are renting out rooms in their homes, baches or even house boats. They also use websites such as Bookabach, HolidayHouses.co.nz. \nBaines has previously been vocal about the commercial accommodation sector, including motels, not having a level playing field against the domestic model, where people who rent out a room in their house pay lower fees for rates and rubbish collection. \nCommercial providers had to meet regulations that were enforced by local authorities, while bach owners did not. \n\"It's an opportunity for the two organisations to pool their resources and look at the issues surrounding accommodation,\" Baines said. \n\"The voice that the combined organisation can offer, as opposed to the two separately [is important]. In accommodation there is going to be a huge amount of work needed to be done about those that are commercially rated accommodation selling rooms and those that are domestically rated.\" Ad Feedback \nPeter Nash, president of the Motel Association, said there would be an opportunity \"to really support the accommodation sector\" with the launch of an Accommodation NZ sub-brand within Hospitality New Zealand,. \nNash will be chairman of the advisory council set up to help develop the future of the Accommodation NZ brand. \nBaines said the merged brand would include about 500 Hospitality NZ and 820 Motel Association accommodation members. \nNeither Baines nor Hospitality NZ chief executive Bruce Robertson would comment on potential new roles in the new organisations. \nCunningham said the new organisation was about helping members get more support, resources, supply partnerships and a united voice both locally and at a national level on policies. \nTourism Industry Association (TIA) chief executive Chris Roberts said he was sorry to be saying goodbye to the Motel Association. \n\"However, we already have a close working relationship with HNZ and we expect that to continue.\" \nTIA represents accommodation, transport, attractions and activities operators. TIA members make up about 85 per cent of New Zealand's tourism turnover. \n\"TIA will continue to look after the tourism interests of all accommodation providers, including hotels, motels, apartments, lodges, backpackers, holiday parks and B&Bs,\" Roberts said. - Stuff", "external_links": [], "published": "2015-10-14T05:39:00.000+03:00", "crawled": "2015-10-14T05:52:13.548+03:00", "highlightTitle": ""}