{"organizations": [], "uuid": "1999bdf960d22c32fb7b7ab6f4db9f75cb58e451", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1009/20151009__SJM-ORCABREED-1010~1.JPG", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/201121.xml", "section_title": "Travel", "url": "http://www.mercurynews.com/eat-drink-play/ci_28947043/san-diego-facing-ban-orca-breeding-seaworld-contemplates?source=rss", "country": "IL", "title": "San Diego: Facing ban on orca breeding, SeaWorld contemplates next move", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "San Diego: Facing ban on orca breeding, SeaWorld contemplates next move", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:21:00.000+03:00", "replies_count": 0, "uuid": "1999bdf960d22c32fb7b7ab6f4db9f75cb58e451"}, "author": "Julie Watson \n\nAssociated Press", "url": "http://www.mercurynews.com/eat-drink-play/ci_28947043/san-diego-facing-ban-orca-breeding-seaworld-contemplates?source=rss", "ord_in_thread": 0, "title": "San Diego: Facing ban on orca breeding, SeaWorld contemplates next move", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Diego: Facing ban on orca breeding, SeaWorld contemplates next move By Julie Watson Posted: 10/09/2015 02:21:15 PM PDT Updated: 10/09/2015 02:21:15 PM PDT Click photo to enlarge Animal rights activist Kirby Kotler, with his daughter Kirra, 12, from Malibu, Calif., holds up signs as opponents and supporters fill the room during a California Coastal Commission meeting, Thursday, Oct. 8, 2015, in Long Beach, Calif. The commission is considering a vast expansion to the tanks that SeaWorld uses to hold killer whales in San Diego. (AP Photo/Damian Dovarganes) « 1 » SAN DIEGO -- SeaWorld says denying orcas' their ability to breed is cruel, but it was unclear Friday whether the corporation will fight such a ban at its California park and risk further hurting attendance. \nCompany officials said they were reviewing their options a day after the California Coastal Commission approved a $100 million expansion of the tanks SeaWorld uses to hold killer whales in San Diego -- but banned breeding of the captive orcas that would live in them. The panel's decision raised an array of questions, including whether the company would proceed with the project or raise a legal challenge, possibly on whether the commission overstepped its authority. \nDeciding the next step could be tricky for SeaWorld. The company has been struggling with falling stock prices and park attendance numbers since the release of the 2013 documentary \"Blackfish,\" which suggests SeaWorld's treatment of captive orcas provokes violent behavior. \nIf SeaWorld abandons its expansion for its orca facility to get around having a ban on its breeding program, then it risks giving the public the perception that it never intended to build bigger tanks to benefit the park's 11 killer whales but rather to simply breed more in captivity, said Jennifer Fearing, a lobbyist for The Humane Society of the United States. Advertisement \nThe ban on breeding, including through artificial insemination, would apply only to the California park and not SeaWorld facilities in other states. The commission also prohibited the sale, trade or transfer of captive orcas. The amendment does provide a potential exemption for certain whales caught in the wild. \nSuing the state over the ruling could be costly and time-consuming. A ruling in its favor would mean the company must return to the commission again to get another permit for its \"Blue World\" project, set to open in 2018, which would triple the size of existing killer whale enclosures. \nSeaWorld should learn from Ringling Brothers and Barnum & Bailey, Fearing said. That company announced in March that its three touring circuses would phase out elephant acts by 2018 because of a shift in public attitudes. \nIf SeaWorld moved forward with its plans under the commission's various conditions, it would win back many of its critics, Fearing said. \n\"It's clear where public opinion is and the unanimous vote from the California Coastal Commission only added to the barrage over the last couple years,\" she said. \"The writing is on the wall and it's time for them to stop fighting and evolve.\" \nAnimal rights activists praised the decision as marking the end of the ocean park's use of orcas. \nSeaWorld officials expressed concern: \"A ban on breeding would sentence these animals to a slow extinction in our care,\" said John Reilly, president of SeaWorld San Diego, who rushed out of the building after the vote. \nThe company declined to answer questions Friday on the ruling but sent a statement from Joel Manby, SeaWorld's president and chief executive, saying: \"Depriving these social animals of the natural and fundamental right to reproduce is inhumane and we do not support this condition.\" \nDuring Thursday's heated meeting attended by hundreds, SeaWorld attorney David Watson told the panel \"the state of California does not have jurisdiction to regulate the management and care of marine mammal collections.\" \n\"We believe that federal law expressly pre-empts all state regulation\" of the orcas, he said. \"All marine mammal exhibits are regulated exclusively by the federal government.\" \nThe condition was among several set by the commission that regulates land and water use along the California coast, including that no new whales from the wild will be kept in the new tanks. SeaWorld says it hasn't captured wild orcas in more than 30 years. \nDeborah A. Sivas, director of Stanford University's Environmental Law Clinic, said she believes the ruling has a good chance of withstanding a legal challenge. \nSeaWorld draws saltwater from Mission Bay for its killer whale pools. That means the facility would use a marine resource for the tanks and therefore the commission has a say over the animals living in them, she said.", "external_links": [], "published": "2015-10-10T00:21:00.000+03:00", "crawled": "2015-10-10T05:13:42.892+03:00", "highlightTitle": ""}