{"organizations": [], "uuid": "e29357861b55b97746bb5ca83e27663fde50b0fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297754536112_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.calgarysun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.calgarysun.com/2015/09/29/whats-new-in-canadian-travel-from-manitoba-to-the-west", "country": "CA", "title": "What's new in Canadian travel, from Manitoba to the west", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "What's new in Canadian travel, from Manitoba to the west", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:21:00.000+03:00", "replies_count": 0, "uuid": "e29357861b55b97746bb5ca83e27663fde50b0fd"}, "author": "", "url": "http://www.calgarysun.com/2015/09/29/whats-new-in-canadian-travel-from-manitoba-to-the-west", "ord_in_thread": 0, "title": "What's new in Canadian travel, from Manitoba to the west", "locations": ["Manitoba", "Ontario"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What's new in Canadian travel, from Ontario to the east \nWhether you want to fly high on the longest zipline in North America or seek out and relax in one of Parks Canada's new signature red chairs, there are so many travel experiences to discover across Canada. These are the hottest new events and attractions -- live from the Canadian Tourism Commission 's GoMedia 2015 conference -- from Manitoba west to British Columbia. For the latest on travel from Ontario to the east, click here . Get planning your next Canadian vacation! More from GoMedia: See the Okanagan Valley from the sky and by rail \nBRITISH COLUMBIA \n- In the Kootenay Rockies , outdoor adventure rules! The destination has just added a via ferrata -- a protected climbing route with steel cables climbers can secure themselves to -- at Kicking Horse Mountain Resort and is offering heli-adventures (skiing, hiking and glacier trekking) in the Selkirk Mountains via Revelstoke Mountain Resort and Selkirk Tangiers Heli-Skiing. \n- The B.C. Coast & Mountains region includes Vancouver, Whistler, Richmond and the Fraser Canyon, and holds many exciting new travel opportunities. Whistler is celebrating its 50th anniversary, as well as the opening of the longest zipline in North America . Plus, experience the Olympic games at the only IOC -sanctioned Olympic museum in North America in Richmond and discover Squamish, home to the world's highest concentration of wintering bald eagles . \n- Penticton , the host city for the GoMedia 2015 conference, is one of only two cities in the world situated between two major lakes - Okanagan Lake to the north and Skaha Lake to the south. A channel connects the two lakes and locals have taken to floating the channel each summer. Tourists can get in on the fun with Coyote Cruises , who will drop you and a tube at one end of the channel and pick you up at the other once you've completed your float. \nIn response to the Float Thru video posted by A & W local legend 'Relvis' puts his own unique spin on things - which... Posted by Visit Penticton on Wednesday, August 19, 2015 \n- Canada's second largest ski resort, Sun Peaks , is opening two new advances ski runs in time for winter to give the resort more diverse skiing options for the entire family. Sun Peaks is also now offering guided, private tours for backcountry skiing and a mountain skills camp where skiers learn basic survival skills.- It's all about the fat bike in Banff-Lake Louise this winter! These bikes, with their extra big tires, are perfect for riding in the snow. \nMANITOBA \n- The Canadian Human Rights Museum has only been open in Winnipeg for a year, but 400,000 visitors have already passed through the world's only museum dedicated to human rights. What are human rights? What are the laws? What human rights issues exist in Canada? These are all questions asked through exhibits that draw on various examples of human rights violations and successes to get a conversation started. Future exhibits will focus on the 100th anniversaries of the Armenian genocide and Canadian women's right to vote. Catch a sight like this at Saguenay-St. Lawrence National Marin Park! @ParksCanada #sharethechair pic.twitter.com/8ridGD3ZmX — My Parks Pass (@myparkspass) September 29, 2015 \nPARKS CANADA \n- Can you find the red chair? Parks Canada has launched a nation-wide program that sees red Adirondack chairs placed in various locations around national parks and historic sites by local staff. For some red chairs, travellers must search the park or historic site to find them, but the hunt is always worthwhile as the views from the chairs are considered the best in each location. See where travellers have found chairs by searching the hashtag #sharethechair on Twitter . Sponsored Links", "external_links": [], "published": "2015-10-01T03:21:00.000+03:00", "crawled": "2015-10-01T03:41:24.837+03:00", "highlightTitle": ""}