{"organizations": [], "uuid": "d926348fb7951ed400cbc813cd18d2fefe7b2543", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/article/Clarksville-student-eulogizes-local-man-killed-in-6589517.php", "country": "US", "title": "Clarksville student eulogizes local man killed in WWII", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Clarksville student eulogizes local man killed in WWII - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "d926348fb7951ed400cbc813cd18d2fefe7b2543"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/article/Clarksville-student-eulogizes-local-man-killed-in-6589517.php", "ord_in_thread": 0, "title": "Clarksville student eulogizes local man killed in WWII", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ELIZABETHTON, Tenn. (AP) — Scott Moore is a student at Clarksville's Northeast High School , halfway across Tennessee.\nBut recently, he took time from his studies to make a return trek to Carter County.\nWhy?\nBecause Broadway Sims grew up there.\nHardly anyone, even in Carter County, remembers Broadway Sims. That's exactly the reason Moore returned to Carter County, to present the findings of his research about the World War II soldier.\nIt's why, last summer, he crossed the Atlantic Ocean to eulogize Sims at his grave.\nSpeaking one recent Saturday to a gathering at Tipton-Haynes State Historic Site , Moore discussed the findings of his historical research into the life and death of a man born in 1916 in the Ripshin community and given the name Broadway Valentine Sims .\nSims, a member of the 101st Airborne Division, would die in Normandy on June 11, 1944, just days after D-Day in the bloody battles before the breakout of Normandy.\nThe student was inspired to begin his research by teacher Whitney Joyner . She is a teacher at Northeast Middle School and taught Moore for three years. Joyner told Moore about the National History Day program and its efforts to allow high school students to come to a deeper understanding of World War II by learning about one of the soldiers who fought in it.\nMoore admitted in a previous interview with the Johnson City Press that he chose Sims to research because of his first name, which he said was \"cool.\" But Moore had already narrowed the choices to just those who had been members of the 101st, where his father is currently serving as a chief warrant officer.\nMoore said he averaged working about 10 hours a week on his research project, not only learning more about Sims, but about the time and place the young man grew up. He even found a member of the Sims Family, Janice Sims Keller . She was born after World War II, but remembered family talk about Broadway.\nThe culmination of the research came when Moore, 14 other students and their 15 teachers traveled to Normandy to eulogize the men who had become so much more than a name.\nAfter touring the D-Day battlefields, place names they had heard many times in their research, it was now time to go to the cemetery.\nMoore said \"when I first stood by Broadway's grave, I felt a nervous excitement. I realized I was standing there next to a great man, and that was the closest I would ever be to him.\n\"It was an honor to even stand by his grave and deliver my eulogy. I wanted to make him proud and somehow let him know that we had not forgotten him. That his life had not been in vain.\"\nIn his eulogy, Moore said \"I stand here today to honor the life of one of America's bravest, most fearless servants. As I stand here, I am reminded of General George S. Patton 's words: 'It is foolish and wrong to mourn the men who died. Rather, we should thank God that such men lived.' And that is exactly what my purpose here today is, to thank God for allowing such men as Mr. Broadway Valentine Sims to have fought for us and to have honorably given his life, so that others may live.\nMoore closed by reciting a poem \"Airborne All the Way,\" which describes the heroism and gallantry of the airborne soldiers.\n___\nInformation from: Johnson City Press, http://www.johnsoncitypress.com", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T12:46:14.094+02:00", "highlightTitle": ""}