{"organizations": [], "uuid": "fcd56d7a4450db1ce4d68f8cb1e71b211e1d61af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151014PaulWatsonParis01.jpg", "site_section": "http://www.ticotimes.net/categories/topics/global", "section_title": "Global Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/14/sea-shepherds-paul-watson-turns-to-human-rights-commission-to-block-costa-ricas-legal-chase", "country": "US", "title": "Sea Shepherd’s Paul Watson turns to human rights commission to block Costa Rica’s legal chase", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Sea Shepherd’s Paul Watson turns to human rights commission to block Costa Rica’s legal chase -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:33:00.000+03:00", "replies_count": 0, "uuid": "fcd56d7a4450db1ce4d68f8cb1e71b211e1d61af"}, "author": "David Boddiger", "url": "http://www.ticotimes.net/2015/10/14/sea-shepherds-paul-watson-turns-to-human-rights-commission-to-block-costa-ricas-legal-chase", "ord_in_thread": 0, "title": "Sea Shepherd’s Paul Watson turns to human rights commission to block Costa Rica’s legal chase", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "See also: Costa Rica government vows to no longer support international shark protections\nPaul Watson is fed up with Costa Rica’s attempts to prosecute him. For 13 years, this tiny Central American country that promotes itself as a model of environmental responsibility has tried to put the bushy-haired marine conservationist in jail over an incident that occurred in 2002 in Guatemalan waters.\nBy now, that high-seas confrontation involving Sea Shepherd and Costa Rican fishermen allegedly shark-finning in Guatemala has become infamous both in Costa Rica and abroad, and was the subject of the 2006 documentary film “ Sharkwater .”\nCosta Rica still has Watson, 64, posted on Interpol’s Red List of international fugitives, saying he is wanted on charges of attempted shipwrecking , which carries a prison term of up to 15 years if he’s convicted. At the bottom of the notice, Interpol advises tipsters: “If you have any information, please contact your national or local police.”\nBut Watson isn’t hiding – he lives in the open at his home and new base of operations in Paris, in plain view of both Interpol and the French government, which, like the United States, has ignored Costa Rica’s flustered attempts to extradite him.\nFlying in the face of Costa Rica’s self-proclaimed quest for justice on behalf of eight local fishermen, Watson’s people actually are working with Interpol on a separate case to convict toothfish poachers nabbed recently in the Southern Ocean. A few weeks ago, Watson’s officers testified in a trial against three of those poachers in São Tomé and Príncipe, an island off the western coast of Africa.\nOn Tuesday, Interpol issued a news release highlighting its work – with Sea Shepherd – on the toothfish poaching case, noting that, “A court in Sao Tomé and Principe found the captain, chief engineer and second engineer of the Thunder guilty of various illegal fishing charges. The vessel, which sank off the coast of the West African nation in April, was the focus of multiple international investigations into illegal toothfishing activities.”\nAlso yesterday, Watson addressed members of the French military at France’s Senate, a pretty bold move for someone who’s supposed to be on the run.\nIn a recent telephone conversation with The Tico Times from Paris, Watson said he is actually better able to coordinate Sea Shepherd’s global campaigns from his Parisian base than he could while captaining a fleet of ships at high sea. (Japan also wants to extradite him over his war on Japanese whaling in the Southern Ocean.)\nThe Costa Rican government has said repeatedly that Watson’s case is a criminal – not political – one, and it respects the separation of powers between the executive and judicial branches. Prosecutors and a criminal court here are demanding that Watson come to Costa Rica to resolve the matter, and judges have refused to respond to a series of motions filed by Watson’s legal team in his absence.\nRead more Paul Watson stories here\n(Interpol Screengrab)\nA legal standoff Watson’s Costa Rica attorney is Abraham Stern, a partner in Pacheco Coto , one of the country’s oldest law firms. In the past two years, Stern has filed several motions in the First Circuit Criminal Court of San José over alleged procedural irregularities, he told The Tico Times.\nHe also filed an appeal at the Constitutional Chamber of the Supreme Court, or Sala IV, alleging that Costa Rica had violated Watson’s rights by not advising him during his arrest and questioning that he had the right to a representative from his home country’s consulate, which at the time was Canada. (Watson has since become a U.S. citizen.)\nStern argued that the entire case should be thrown out due to this violation, but Sala IV justices ruled that although Watson was entitled to damages, the Sala IV has no jurisdiction to rule on the criminal aspects of the case. They tossed it back to the San José court that has refused to rule on Stern’s motions until Watson shows up in court. Stern now wants those judges recused.\nRead the Sala IV ruling from April 30, 2015, in Spanish, here:\nStill, the Sala IV ruling was a partial victory for Watson, because it acknowledged that Costa Rica violated his rights. “We’re happy about that decision,” Watson said.\nBut with the criminal court refusing to rule on Stern’s motions until Watson presents himself, and with Watson refusing to come to Costa Rica, citing Japan’s extradition request and alleged death threats from the fishing mafia, the case is at a standoff.\nAnd no one seems to know – including Watson’s lawyer – when the statute of limitations will expire on the charge of attempted shipwrecking. That’s partly because in 2002, when Watson was initially arrested, he was charged with attempted murder. Because Watson’s crew had been filming for “Sharkwater” during the confrontation with the Costa Rican fishing boat Veradero I, they presented video evidence to Costa Rican prosecutors and the charges were dropped. But then he was charged with assault. Those charges also were dropped. Years later, he was charged with attempted shipwrecking.\n“Nobody gets on [Interpol’s] red list for that charge,” Watson said. “I don’t think there’s a case in the history of Interpol where those are extraditable offenses.”\nThe Sala IV ruling was handed down on April 30 and Stern was notified in September. Watson and Stern told The Tico Times they would seek $50,000 in damages and donate half of the funds to Cocos Island, a national marine park in the Pacific Ocean, and the other half to protect sea turtle nesting sites along the Caribbean coast, in honor of slain Costa Rican conservationist Jairo Mora .\nRead more Jairo Mora stories here\nWatson also wants an apology from the Costa Rican government.\n“An apology would be nice,” he told The Tico Times. “But what I’d really like is for them to drop this ridiculous charge.”\nHe continued: “The prosecution’s accusation contradicts itself. They claim the Veradero I was in international waters, but its exact position was deep in Guatemalan waters. My theory is they don’t want to put me on trial. They want to send me to Japan.”\nSea Shepherd’s Paul Watson, center, with supporters on board the Brigitte Bardot, which is moored in Paris, on Jan. 15, 2015.\nLoic Venance/AFP\nTaking the case to Washington On Sept. 25, Stern filed a petition on Watson’s behalf before the Inter-American Commission on Human Rights seeking precautionary measures against the Costa Rican government.\nThe petition to the Washington, D.C.-based rights commission, part of the Organization of American States, seeks the dismissal of all Interpol Red Notices of Watson until Costa Rica’s criminal court rules on Stern’s request to recuse the judges. It also requests the dismissal of extradition processes requested by Costa Rica. Stern said he expects a ruling within five months.\nA spokeswoman from Costa Rica’s Foreign Ministry said officials had not yet received notification of the IACHR petition and, therefore, had no comment.\nWatson’s legal team also plans to file a full petition against Costa Rica before the IACHR by the end of October, alleging “the constant and permanent violation of [Watson’s] human rights.”\nThe Costa Rican courts, said Stern, “are violating fundamental rights. It’s due process, access to justice, presumption of innocence, liberty, personal integrity, dignity and no discrimination, among others,” he said, referring to the basis of the forthcoming IACHR petition.\nA ‘battle of egos’ For Stern, the case is being influenced by xenophobia and “a battle of egos.”\n“If [Watson] comes to Costa Rica and he wins this case, they’re going to immediately extradite him to Japan,” Stern said. “Unfortunately this is a battle of egos, and for me personally, as a Costa Rican, this nationalism surrounding the case hurts. … Paul Watson only wanted to help this country, … because without the ocean, there is no life.”\nStern added that his team had “sufficient proof to show Costa Rica violated Watson’s rights.”\n“This has gone far enough,” he said. “Every time we try to do something, it has generated a type of nationalism that I’ve never seen before in Costa Rica. [Watson] didn’t take the law into his own hands – he was in Guatemala and the law allows for citizen arrests. But the judges don’t want to hear anything until Paul Watson is arrested.”\nIn the meantime, Watson said filming has begun on the follow-up documentary “Sharkwater 2.” On the list of upcoming film locations: Costa Rica’s Cocos Island.", "external_links": ["http://www.oas.org/en/iachr/mandate/docs/MedidasTramitacionPeticiones-en.pdf", "http://www.pachecocoto.com/", "http://www.oas.org/en/iachr/decisions/precautionary.asp", "https://www.documentcloud.org/documents/2458057-15-006192.js", "http://www.interpol.int/notice/search/wanted/2013-60414", "http://www.interpol.int/News-and-media/News/2015/N2015-160", "https://www.facebook.com/captpaulwatson", "http://www.animalplanet.com/tv-shows/whale-wars/"], "published": "2015-10-15T03:33:00.000+03:00", "crawled": "2015-10-15T02:31:21.233+03:00", "highlightTitle": ""}