{"organizations": [], "uuid": "c3b0fc450ccddb44a6818819cf3ca804c63a9562", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goamsterdam.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/175075612.jpg", "site_section": "http://z.about.com/6/o/m/goamsterdam_t2.xml", "section_title": "About.com Amsterdam Travel: What's Hot Now", "url": "http://goamsterdam.about.com/od/daytripsexcursions/p/Kinderdijk.htm", "country": "US", "title": "Day Trip to Kinderdijk", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Day Trip to Kinderdijk", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:07:00.000+03:00", "replies_count": 0, "uuid": "c3b0fc450ccddb44a6818819cf3ca804c63a9562"}, "author": "", "url": "http://goamsterdam.about.com/od/daytripsexcursions/p/Kinderdijk.htm", "ord_in_thread": 0, "title": "Day Trip to Kinderdijk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo © Flickr User Zhenzation \nWhat is Kinderdijk?: \nKinderdijk, located 15 miles east of Rotterdam, is a UNESCO-listed site that boasts 19 pristinely preserved windmills. The windmills were erected in the 1600s to drain the Alblasserwaard polders, which had suffered floods since the 13th century. One such flood, the Saint Elizabeth Flood of 1421, is both the source of the name Kinderdijk and of the associated fairy tale, \"The Cat and the Cradle\": after the storm, a wooden cradle was spotted on the flood waters, in which a cat jumped to and fro to keep the cradle afloat. When the cradle approached the dry land of the dyke, the locals discovered a baby inside -- hence the name Kinderdijk, Dutch for \"children's dyke\". \nNowadays the windmills have been relieved by more efficient screw pumps, but you can still visit the monumental 17th-century windmills that comprise the incredible man-made landscape of Kinderdijk. Views of the landscape are free; admission fees apply only to the visitors' windmill and special tours. \nHow to Get There: By train and bus - Kinderdijk is accessible from Amsterdam via both Rotterdam and Utrecht. Take the NS train to Rotterdam CS; from there, take the metro to Rotterdam Zuidplein, and then bus 154 to Kinderdijk. To reach Kinderdijk via Utrecht, take the NS train to Utrecht CS, then bus 154 to Kinderdijk. See the NS web site for schedules and fares. By boat - From April 3 to October 3, visitors can take a boat from Rotterdam to Kinderdijk. From Rotterdam CS, take tram 8 or 25 or the metro line \"Erasmuslijn\" to the Leuvehaven stop; boats depart from the Boompjeskade. See the Rebus web site for the most current information. By car - Drivers can also reach Kinderdijk from Amsterdam via Rotterdam or Utrecht. From Amsterdam via Rotterdam, take the A4, A13, A20, A16, and A15 to exit 22. Via Utrecht, take the A2, A27, and A15 to exit 22. \nWhat's to Do at Kinderdijk: Walk or cycle the network of monumental windmills. The Kinderdijk web site provides a map of the pedestrian and bicycle route that takes visitors past all 19 mills on the picturesque dyke. Visit an authentic 17th-century windmill. The simply-named \"Windmill 2\" in the Nederwaard is open daily from April to the end of October, 9:30 a.m. to 5:30 p.m.; from November to March, this is reduced to weekends from 11 a.m. to 4 p.m. (Note that the mill sometimes closes due to inclement weather, so call ahead to be sure.) Admission is € 3.50 for adults, € 2.00 for children. Take in the scenery by water. From April 1 to October 1, 30-minute canal tours depart daily from 10am to 5pm. This is an excellent option for mobility-impaired visitors; there is also limited space for wheelchairs on each boat. Tickets are € 3.00 for adults, € 2.50 for children from 4-9. Check out one of dozens of Kinderdijk's special events. Events are held the entire windmill season, from April to the end of October; a schedule of markets, concerts and festivals is available on the Kinderdijk web site . \nWhere to Eat: \nRestaurant options are limited at Kinderdijk, but visitors can also dine in nearby Rotterdam or Utrecht. Partycentrum de Klok serves a limited menu of lunch and continental dinners for affordable prices in a homey atmosphere. Open daily from 10 a.m. to 1 a.m. Grand Cafe Buena Vista offers lunch and a diverse dinner menu of international dishes with a wide assortment of Dutch pancakes . Open Wed. - Sun. from 12 p.m. (kitchen open until 9 p.m.). Related Articles", "external_links": [], "published": "2015-10-12T14:07:00.000+03:00", "crawled": "2015-10-13T02:28:12.019+03:00", "highlightTitle": ""}