{"organizations": [], "uuid": "64bab4311fb255f14a20da42b252c6038bfcdba2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/Dia-Del-Huevo-2014_311.jpeg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/10/09/cultural-center-anniversary-vegan-fair-and-more-events-around-costa-rica", "country": "US", "title": "Cultural Center anniversary, vegan fair, and more events around Costa Rica", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Cultural Center anniversary, vegan fair, and more events around Costa Rica", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T11:30:00.000+03:00", "replies_count": 0, "uuid": "64bab4311fb255f14a20da42b252c6038bfcdba2"}, "author": "Amanda Zuniga", "url": "http://www.ticotimes.net/2015/10/09/cultural-center-anniversary-vegan-fair-and-more-events-around-costa-rica", "ord_in_thread": 0, "title": "Cultural Center anniversary, vegan fair, and more events around Costa Rica", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get the day started off right at Alajuela’s World Egg Day celebrations. (Courtesy of Para Sentirse Bien Group) World Egg Day \nJoin the fun as Alajuela celebrates World Egg Day: kick things off with a yummy egg breakfast and participate egg contests, music and cultural activities. The activity is sponsored by the National Chamber of Aviculture to promote egg s as a healthy and nutritious food. \n“Día Mundial del Huevo” takes place Oct. 9 at Juan Santamaría Plaza in Alajuela. 7 a.m. – 12 p.m. Free. More info here . Expo Anime-Comics-Cartoons \nThis Expo will create a world of fiction this upcoming weekend in Heredia, featuring art shows, contests, exhibits and markets. \n“Expo Anime-Comics-Cartoons” takes place Oct. 9 – 11, starting each day at 10 a.m., at Paseo de las Flores Mall in Heredia. Free. More info at the Expo Facebook page . CAA Oktober Fest \nIf you missed last week’s Oktoberfest celebrations, don’t worry. You still have a chance with the annual Oktober Fest organized by the Community Action Alliance (CAA) of San Ramón, featuring Chef Andy’s Homemade Bratwurst, Knockwurst, Sauerkraut, German Potato Salad, and Apfelkuchen. And, of course, beer. \n“CAA Oktober Fest” takes place Oct. 10 at Magallanes Community Center, San Ramón, Alajuela. 1 p.m. – 5 p.m. Members pay ₡5,000 ($10) and non-members ₡6,000 ($12). Music: National Symphony Orchestra of Costa Rica \nIn celebration of the 70th anniversary of the Costa Rican-North American Cultural Center, a National Symphony Orchestra concert will feature four musical theater artists from Northern Iowa University. The show, “American Broadway Spectacular,” will include some of the Great White Way’s most famous musical themes. \n“Concierto Orquesta Sinfónica Nacional y artistas de Northern Iowa University” will be performed Oct. 9 at the Eugene O´Neill Theater, Barrio Dent, 7:30 p.m. Free, but limited space. Art Fair: The Four Elements \nContinuing the anniversary celebrations for the Costa Rican-North American Cultural Center, the Sophia Wanamaker Gallery has united 20 artists for a three-day exhibition at Multiplaza del Este. \n“Feria de Arte de los Cuatro Elementos” takes place Oct. 9 – 11 at Multiplaza del Este, in Curridabat. 10 a.m. Free. More info at the Fair Facebook page . \nArt piece part the fire element exhibition (Courtesy of Feria de Arte de los 4 Elementos) Vegan Fair \nChat with experts who can answer questions regarding protein, calcium, recipes, meat, dairy and egg substitutes, – in short, everything you need to know to become vegan or vegetarian. Sample homemade and gourmet food and other vegan products along the way. \n“Feria Vegana Sabanilla” takes place Oct. 10 at the Casa Juventud in Barrio San Marino, 200 meters south and 150 west of the Sabanilla Church. Free. 10 a.m. More info at the event’s Facebook page. Skapolis Festival \nThe second edition of the country’s best ska music festival takes place this upcoming Saturday. Guests bands are Askatasuna, Milly Majuc, Adaptados, Endemia, UFO, and Sr. Mephisto. \n“Festival Skapolis” takes place Oct. 17 at Amón Solar, Barrio Amón, San José. 5 p.m. ₡4,000 ($8). More info at the Festival Facebook page . Dance: Zumba Classes \nDance classes for people 50 years and over will be offered during the whole month of October at La Libertad Park, Desamparados. The goal is to offer a comfortable space where people can exercise, taking into account varying levels of physical condition and musical tastes. \n“Clases de Zumba” take place every week from Monday tthrough Friday during October at La Libertad Park, Desamparados. Free. 10 a.m. For more information call the National Cultural Center (CENAC), 2221-2154. Dance: Urban Shaman \nSwedish group ADN Dialect joins with Costa Rican group Los Innato to present a special performance the attempts to unify their different cultures in one unique dance, using it as an international language. \n“Urban Shaman” performs Oct. 9 – 11 at Montes de Oca Theater, University of Costa Rica (UCR), San Pedro. 8 p.m. ₡3,000 ($6). For more information call 2511-4595. Pop-Up Playground \nA celebration of child-directed play with cardboard boxes, fabrics, strings, cardboard cylinders and more. The activity is held in a public space and seeks to increase recycling consciousness. The goal is for children, in the company of adults, to use their imagination and create toys with the materials given; at the end of the event they can take their toys home. \n“Pop-Up Playground” takes place Oct. 11 at Escazú Park. 9:30 a.m. Free. More information at the event Facebook page . (Courtesy of Pop-Up Playground) Tableo Flamenco \nTo celebrate its fourth anniversary, Spanish restaurant La Tosca,is organizing a “Tableo Flamenco” night with renowned Spanish artists: dancer Lydia Cabello, singer Pilar Sierra, and guitarist Beto Campos. \n“Tableo Flameco” performs Oct. 10 at La Tosca Restaurant, San José, Av. 8 Streets 45 – 47. 9 p.m. Presale ₡6,000 ($12), Day of the event ₡8,000 ($16). For more information call 2283-5500. Theatre: “A Ciegas” \nThis free adaptation of the play “No Exit” by Jean-Paul Sartre will be performed at the Casa Museo in Barrio Amón. Check out our preview . \n“A Ciegas” will be performed Oct. 8, 9 and 10 at 8 p.m., and Oct. 11 at 5 p.m. and 7 p.m. At Casa Museo, Barrio Amón. For more information call 8420-9161 / 8997-5813, or visit the event’s Facebook page . Shnit Short Film Festival \nSan José is the only Central American host city in this year’s shnit International Shortfilmfest , and will offer four days of the best short films from around the world. The festival started Oct. 7, but events will continue until Oct. 11., including a national and an international short films competition, free workshops, and parties. \nThe Shortfilmfest takes place Oct. 7 – 11 at Cine Magaly, San José. $6 per event. Find the whole program at the shnit Website or check out our preview. Upcoming Concerts: \nSeñor Loop + Infibeat: Panamanian band Señor Loop will join Costa Rican band Infibeat to offer a concert for rock and funk lovers. Oct. 9 at Jazz Café Escazú. 9 p.m. ₡10,000 ($20). For more information call 2253-8933. \nBoca a Boca: Club Vertigo presents its new edition of the Boca a Boca concert, featuring artists Roger Sobrado, DiSTO, Enzo Ruisi B2B Carlos Montenegro, Macho Iberico, Dj FRiGiD, Eddie Busanello, and Y-an Esquivel Bryan B2B Meli Rodriguez. Oct. 10 at Club Vertigo, downtown San José. For more information call 2257-8424. \nThe Awakening: The gothic rock band will play in alongside Fractured Souls, Vórtice, Seres, and Evening Star. Oct. 11 at OZ Bar, Paseo Colón. 4 p.m. ₡2,000 ($4). For more information call 4702-1986 or visit the event Facebook page . \nThe Shame of Man: Costa Rican rock and roll band Mumble Riot will be presenting its new EP “The Shame of Man,” alongside the bands Señorita Abril and Movement in Codes. Oct. 15 at Hoxton Pub, San Pedro. 9 p.m. ₡4,000 ($8). For more information call 6105-9296. Contact Amanda Zuniga at azuniga@ticotimes.net", "external_links": [], "published": "2015-10-09T11:30:00.000+03:00", "crawled": "2015-10-09T12:46:40.451+03:00", "highlightTitle": ""}