{"organizations": [], "uuid": "9e25976a336083f51643ab0f7738e513ecf0a55d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64537/thailand-tourism-promote-tastes-thainess", "country": "US", "title": "Thailand Tourism promote the tastes of Thainess", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Thailand Tourism promote the tastes of Thainess", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T05:51:00.000+03:00", "replies_count": 0, "uuid": "9e25976a336083f51643ab0f7738e513ecf0a55d"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64537/thailand-tourism-promote-tastes-thainess", "ord_in_thread": 0, "title": "Thailand Tourism promote the tastes of Thainess", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thailand Tourism promote the tastes of Thainess   \nBy Andrew J. Wood, eTN Thailand Correspondent | Oct 06, 2015 All photos © Andrew J. Wood eTN   \nBANGKOK, Thailand – The Tourism Authority of Thailand (TAT) offered its generous support to this year's Asian Organic Gourmet Festival, which was held from October 2-4, 2015 at the Riva Surya Bangkok on the banks of the Chao Phraya River. Mr. Chattan Kunjara Na Ayudhya, TAT’s Executive Director, delivers the opening speech at the Asian Organic Gourmet Festival 2015. \nThe three-day event highlighted healthy gourmet dishes especially prepared by outstanding Thai culinary masters – Chef Sompong Suksuwan, Chef Satawat Kunarasai, Chef Surasing Viratsakul and Chef Arnon Masalong, who worked with coordinating Executive Chef Apirak O-para of the Riva Surya. \nThe festival organizers presented multiple activities including live cooking demonstrations; healthy bread baking; a farmer’s market outdoor; nutritional talks and Thai dessert classes. \nOrganized by Riva Surya Bangkok & SilverNeedle Collection, the three-day event was designed to promote healthy living, along with Thai and Asian cooking techniques. Encouraging the development of healthy gourmet cuisine within the Thai and expat community and building support for Thai organic farming and organic produce. \nMr. Chattan Kunjara Na Ayudhya, TAT’s Executive Director delivered the opening speech at the commencement of the Festival. In his opening remarks he said, “The Asian Organic Gourmet Festival 2015 coincides with TAT’s Discover Thainess campaign in which the promotion of Thailand’s culinary heritage plays a large part alongside the kingdom’s cultural and artistic legacy. Healthy living also forms a core part of the Thai way of life; such as, the use of exotic herbs and spices to enrich the flavors to offer nutrition and health.” \nAs one of the key advocates of health and organic cuisine, Riva Surya will include menus developed by the event’s guest chefs at its restaurants for the next three months. Following which, the hotel will create and promote a new organic menu on a monthly basis. \nRiva Surya Bangkok’s Asian Organic Gourmet Festival Dinner’s revenue was partly donated to FOOD4GOOD program – whose focus is malnutrition among under-privileged children in Thai society.", "external_links": [], "published": "2015-10-06T05:51:00.000+03:00", "crawled": "2015-10-06T07:12:42.135+03:00", "highlightTitle": ""}