{"organizations": [], "uuid": "400e3f98c5ce99692c753d2683e75d620f039543", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30267134/caridcom-announces-exclusive-online-availability-of-truck-bed-storage-systems-from-decked", "country": "US", "title": "CARiD.com Announces Exclusive Online Availability of Truck Bed Storage Systems from DECKED", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CARiD.com Announces Exclusive Online Availability of Truck Bed Storage Systems from DECKED - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "400e3f98c5ce99692c753d2683e75d620f039543"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30267134/caridcom-announces-exclusive-online-availability-of-truck-bed-storage-systems-from-decked", "ord_in_thread": 0, "title": "CARiD.com Announces Exclusive Online Availability of Truck Bed Storage Systems from DECKED", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " CARiD.com\nAutomotive ecommerce retailer to be the authorized and preferred online reseller of DECKED's industry-leading product line\nCRANBURY, N.J. , Oct. 15, 2015 /PRNewswire/ -- CARiD.com, an online retailer of all things automotive and more, today announced it has become the authorized online reseller of truck bed storage systems from industry leader DECKED. CARiD.com began carrying DECKED's product line at the end of August of this year.\nPhoto - http://photos.prnewswire.com/prnh/20151014/276948\nCARiD.com will carry DECKED's full line of approximately 30 products, including its flagship truck bed storage system . CARiD.com also will run a promotion through the holidays, giving free shipping on all DECKED truck bed storage solutions. Any DECKED accessory purchased with a storage solution will ship free as well.\n\"We're excited to offer our clients a fantastic product line from DECKED, and to be the only authorized online reseller,\" said Leslie Pritchard , Marketing Specialist, CARiD.com. \"We take pride in giving our clients access to the best aftermarket auto parts and accessories on the market, and are glad to add DECKED to the CARiD.com family, while continuing to offer a diverse product line to fit any automotive need.\"\nDECKED's innovative truck bed storage systems fit nearly every short and standard sized truck bed made since the late 1990's. Built tough, DECKED's storage kits are great for gear for work and play, and are built to handle UV light, moisture, and extreme heat or cold.\n\"Partnering with CARiD.com as an online reseller of our truck bed storage solutions was a natural fit for us, as it provides us the opportunity to showcase our brand to a large client base of auto lovers,\" said Denis McNamara , VP of Business Development, DECKED. \"We look forward to providing CARiD.com clients with durable solutions for their most prized possessions – their trucks.\"\nCARiD.com's mission is to revolutionize the online shopping experience for the automotive parts and accessories industry by providing its customers with the top brands available on the market, and a customer service experience to match. For more information, please visit http://www.CARiD.com .\nAbout CARiD.com\nCARiD.com has become one of the fastest growing aftermarket automotive online retailers by offering the widest variety of parts, using state of the art technologies, and employing the most dedicated and creative team members in the industry.\nBased in Cranbury, NJ , CARiD.com caters to the needs of all levels of automotive enthusiasts worldwide – from the do-it-yourselfer home mechanic to custom shops and dealers.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/caridcom-announces-exclusive-online-availability-of-truck-bed-storage-systems-from-decked-300159961.html\n ", "external_links": ["http://www.carid.com/decked/truck-bed-storage-system.html", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/caridcom-announces-exclusive-online-availability-of-truck-bed-storage-systems-from-decked-300159961.html", "http://photos.prnewswire.com/prnh/20151014/276948", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH28487&Transmission_Id=201510150737PR_NEWS_USPR_____PH28487&DateId=20151015", "http://www.carid.com/"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T15:28:38.451+03:00", "highlightTitle": ""}