{"organizations": [], "uuid": "6d5864a2b5333d4bec83f382d56af210d83258eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://247PRESS.images.worldnow.com/images/9028882_G.png", "site_section": "http://www.cbs8.com/category/278882/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30275157/sheraton-atlanta-perimeter-hotel-offers-superior-lodging-for-georgia-tech-homecoming", "country": "US", "title": "Sheraton Atlanta Perimeter Hotel Offers Superior Lodging for Georgia Tech Homecoming", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Sheraton Atlanta Perimeter Hotel Offers Superior Lodging for Georgia Tech Homecoming - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T11:18:00.000+03:00", "replies_count": 0, "uuid": "6d5864a2b5333d4bec83f382d56af210d83258eb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30275157/sheraton-atlanta-perimeter-hotel-offers-superior-lodging-for-georgia-tech-homecoming", "ord_in_thread": 0, "title": "Sheraton Atlanta Perimeter Hotel Offers Superior Lodging for Georgia Tech Homecoming", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sheraton Atlanta Perimeter hotel, located near Dunwoody, Georgia, offers superior lodging for Georgia Tech Homecoming Weekend on October 22-24, 2015.\n ATLANTA, GA, October 16, The Sheraton Atlanta Perimeter Center hotel North near Dunwoody, Georgia, offers comfortable lodging for alumni and families attending Georgia Tech Homecoming Weekend on October 22-24. Weekend festivities will include an alumni reception, reunions, the Ramblin' Wreck Parade, and tailgating. The Yellow Jackets will take on ACC rival Florida State on Saturday.\n\"We are happy to welcome alumni and fans for Georgia Tech Homecoming,\" notes Alex Morales, Director of Sales and Marketing at the Sheraton. \"Our proximity to the Dunwoody MARTA Station makes it easy for guests to take a train to the game and avoid the traffic,\" explains Morales.\nThe Sheraton Atlanta Perimeter North is a leading Atlanta Perimeter hotel . Guests will relax in comfort in contemporary rooms with Sheraton Sweet Sleeper Beds. Club Level rooms allow access to Sheraton's private Club Lounge, where guests can enjoy continental breakfast, evening hors d'oeuvres, and complimentary high speed Internet access. Hotel amenities include a business center, fitness center, and seasonal outdoor pool. Sheraton's full service restaurant, Parkside Grille and Lounge, is a convenient choice for breakfast, lunch, and dinner. Room service is available. As a guest convenience, the hotel provides complimentary weekday shuttle service within a 3-mile radius including Perimeter Mall and the Dunwoody MARTA Station. This Perimeter Hotel received the 2015 TripAdvisor Certificate of Excellence Award.\nStarwood Preferred Guests will enjoy complimentary Internet access and earn points toward free hotel nights. AAA and senior rates are available. The Sheraton Atlanta Perimeter North is located on Hammond Drive near the junction of I-285 and GA 400.\n about Georgia Tech Homecoming Weekend, visit www.gtalumni.org . To book your stay at the Sheraton Atlanta Perimeter Hotel North, call 404-564-3000 or visit online at www.ATLANTAPERIMETERHOTEL.com .\nAbout Sheraton Atlanta Perimeter North\nFrom the moment you enter this Perimeter hotel's warm and stylish lobby until you rest your head on The Sheraton Sweet Sleeper Bed, you'll feel at ease and at home. Enjoy breakfast in the Parkside Grille before heading out for the day's activities. The Georgia Aquarium, New World of Coca-Cola, CNN Center, and Six Flags Over Georgia are all a short distance away. This Perimeter hotel's complimentary courtesy shuttle will take you to the nearby Perimeter Mall featuring Nordstrom, Macy's, Von Maur, and Dillard's. Experience all that Atlanta has to offer while escaping the rush of the city at the new Sheraton Atlanta Perimeter North.\n visit: http://www.ATLANTAPERIMETERHOTEL.COM\nFor all media inquiries, please contact:\nAllison Reinert\nCardinal Web Solutions\nhttp://www.CardinalWebSolutions.com\nInformation release/sheraton-atlanta-perimeter-hotel-offers-superior-lodging-for-georgia-tech-homecoming-414275.php", "external_links": ["http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/sheraton-atlanta-perimeter-hotel-offers-superior-lodging-for-georgia-tech-homecoming-414275.php"], "published": "2015-10-16T11:18:00.000+03:00", "crawled": "2015-10-16T14:19:34.516+03:00", "highlightTitle": ""}