{"organizations": [], "uuid": "43904d379112724b460dd5a91b8cc14a9e7bc483", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/rss/press-releases-1/168.xml", "section_title": "PR.com Press Releases: Travel Arrangement & Reservation Services News", "url": "http://www.pr.com/press-release/641154", "country": "US", "title": "Medical Tourism Association® Recognizes Dominican Republic Hospital with \"International Patient Experience Award\"", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Medical Tourism Association® Recognizes Dominican Republic Hospital with \"International Patient Experience Award\"", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T10:00:00.000+03:00", "replies_count": 0, "uuid": "43904d379112724b460dd5a91b8cc14a9e7bc483"}, "author": "Medical Tourism Association™", "url": "http://www.pr.com/press-release/641154", "ord_in_thread": 0, "title": "Medical Tourism Association® Recognizes Dominican Republic Hospital with \"International Patient Experience Award\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Receive press releases from Medical Tourism Association: By Email RSS Feeds: Medical Tourism Association® Recognizes Dominican Republic Hospital with \"International Patient Experience Award\" Hospital General de la Plaza de la Salud, first healthcare provider in the Dominican Republic to achieve International Patient Services Certification® (IPSC), honored at 8th World Medical Tourism & Global Healthcare Congress. Orlando, FL, October 10, 2015 --( PR.com )-- In recognition of its part in a rigorous education and training program and commitment to raising standards, Hospital General de la Plaza de la Salud, the first healthcare provider in the Dominican Republic to achieve International Patient Services Certification® (IPSC), has received the International Patient Experience Award, the Medical Tourism Association announced.Dr. Julio Amado Castaños Guzmán, President of the Board of the Hospital General de la Plaza de la Salud and dean of Universidad Iberomericana, said IPSC® complements existing tourism strategies and reinforces the Dominican Republic’s status as a destination of choice for health and wellness travelers.“Incorporating healthcare into the ‘tourism’ equation makes perfect sense,” said Renée-Marie Stephano, president of the Medical Tourism Association®, at an awards ceremony during the 8th World Medical Tourism & Global Healthcare Congress, Sept. 27-30, 2015, in Orlando, Fla. “When patients contemplate treatment abroad, hospital accreditation is of primary concern and, often times, a starting point for choosing a destination. Confidence in services based on validated continuous education, quality and proven outcomes will attract more international patients to Hospital General, serve as a model for local healthcare providers to follow and strengthen economic initiatives designed to promote medical tourism to the Dominican Republic.”Through a collaboration between the Medical Tourism Association® and UNIBE, Hospital General de la Plaza de la Salud was evaluated and audited in the areas of corporate transparency, operational infrastructure, quality and safety of health services, risk management and international patient services including post-surgical education and communication, cultural sensitivity, and accommodation and coordination of continuity of care.The World Medical Tourism & Global Healthcare Congress accepts nominations to honor leadership, innovation, education, service and top facilities and destinations in the care and treatment of both international- and domestic-traveling patients.Stakeholders who make up the billion-dollar medical tourism industry are encouraged to forward news of tremendous performances that recognize customer-focused care, international quality and standards, patient safety and satisfaction, effective leadership and state-of-the-art technology within the calendar year 2015-2016. For complete information about award categories and the nominating process for significant contributions by staff, colleagues and facilities and organizations, go to: www.medicaltourismawards.comThe Medical Tourism Association® is host to the world’s largest medical tourism event: The 9th annual World Medical Tourism & Global Healthcare Congress, Sept. 25-28, 2016, in Washington, D.C. Participants, sponsors and invited speakers can keep abreast of Congress updates at www.MedicalTourismCongress.com. The association’s business-to-business educational platform regarding all industry information and up-to-date news can be found at www.MedicalTourismMagazine.com and social network at www.MedicalTourismCity.comAbout the Medical Tourism Association®As the first membership-based international nonprofit trade organization and think-tank for the medical tourism and healthcare industries, the Medical Tourism Association® develops and implements creative and sustainable strategies for attracting direct foreign investments. The MTA provides advisory services to investors researching the industry and matches these financiers with medical tourism-related projects. www.MedicalTourismAssociation.com", "external_links": [], "published": "2015-10-10T10:00:00.000+03:00", "crawled": "2015-10-10T13:28:07.644+03:00", "highlightTitle": ""}