{"organizations": [], "uuid": "14d1b0822bb19038bcd9a62ed34501a69d480520", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64624/iacc-board-directors-elects-new-global-president", "country": "US", "title": "IACC Board of Directors elects new Global President", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "IACC Board of Directors elects new Global President", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:14:00.000+03:00", "replies_count": 0, "uuid": "14d1b0822bb19038bcd9a62ed34501a69d480520"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64624/iacc-board-directors-elects-new-global-president", "ord_in_thread": 0, "title": "IACC Board of Directors elects new Global President", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IACC Board of Directors elects new Global President   \nOct 08, 2015 eTN   \nChicago, IL – The International Association of Conference Centres (IACC) announced the election of Alex Cabañas as Global President, effective immediately. \nAlex Cabañas, CEO of Benchmark Hospitality International near Houston, will serve a two-year term as head of the association, which has over 350 conference and meeting venue members in 22 countries worldwide. Cabañas has been active with IACC for a number of years and serves as Vice President of the IACC-Americas chapter, having joined the IACC-Americas Board in 2011 and the IACC Global Board in 2012. During his tenure, Cabañas co-chaired a task force to conduct a review of IACC on a global basis. He leads the IACC 2020 task force, which is developing a strategy that will take IACC on a 5-year journey and will set the goals for the organization to achieve further success. \nAlex Cabañas commented, “IACC is a global community of people and meeting venues committed to delivering exceptional meeting experiences. We lead the small meetings industry and create trust with meeting planners and our clients through the delivery of the most productive meeting environments available.” Cabañas continued, “Perhaps most importantly, our members support and learn from each other. There is a kinship within IACC like no other association that I’ve been affiliated with. It is a privilege to step into the Global President’s role and support the continued growth of IACC.” \nAlex Cabañas joined Benchmark Hospitality International in January 2006. Prior to this, he worked for The Boston Consulting Group from 2000 through 2005. While with Boston Consulting, he worked with clients in a number of different industries including: travel and tourism, government, consumer/retail, telecommunications, e-commerce, financial services and energy. \nCabañas earned his MBA at Harvard Business School and holds a BBA and MS in Finance from Texas A&M University. \nOutgoing Global President, Peter Stewart commented, \"Alex comes to the role of Global President after a significant contribution at a global level, where IACC has developed a strategy for the future, through IACC 2.0. He comes to his new role with great enthusiasm and is very well placed to lead the association over the coming years.” \nThe IACC Vision: IACC is a community of passionate people and organisations delivering innovative and exceptional meeting experiences. \nAbout IACC: Founded in 1981, the International Association of Conference Centres is a not-for-profit association dedicated to promoting understanding and awareness of the meetings venue industry and to giving member properties the tools necessary to provide an exceptional IACC meeting experience. Active members meet a set of stringent Quality Standards and agree to a Code of Ethics. Currently, the association includes approximately 400 members from the United States, Canada, Australia, Japan, China, Kenya, Nigeria, Denmark, Sweden, Belgium, France, Switzerland, Italy, Spain, England, Scotland, Ukraine, The Netherlands, Germany, Hungary and the Philippines.", "external_links": [], "published": "2015-10-08T21:14:00.000+03:00", "crawled": "2015-10-09T00:49:03.982+03:00", "highlightTitle": ""}