{"organizations": [], "uuid": "9261c0e5baf6602e67b36e6be8d641eda018ba68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30257933/7-out-of-13-top-oems-work-on-lidar-technology-for-automated-driving-passenger-vehicles", "country": "US", "title": "7 out of 13 Top OEMs Work on LiDAR Technology for Automated Driving Passenger Vehicles", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "7 out of 13 Top OEMs Work on LiDAR Technology for Automated Driving Passenger Vehicles - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "9261c0e5baf6602e67b36e6be8d641eda018ba68"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30257933/7-out-of-13-top-oems-work-on-lidar-technology-for-automated-driving-passenger-vehicles", "ord_in_thread": 0, "title": "7 out of 13 Top OEMs Work on LiDAR Technology for Automated Driving Passenger Vehicles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Frost & Sullivan\nEnd-user market will mostly use LiDAR for active safety functions, finds Frost & Sullivan\nLONDON , Oct. 14, 2015 /PRNewswire/ -- Light Detection and Ranging (LiDAR) technology, as part of an advanced driver assistance system sensor suite, will be mostly deployed for active safety functions with only 29 percent fitted for fully automated driving purposes by 2021. Out of the top 13 original equipment manufacturers (OEMs), 7 are working on automated driving passenger vehicles using a LiDAR. A new analysis from Frost & Sullivan, LIDAR-based Strategies for Active Safety and Automated Driving from Major OEMs in Europe and North America ( http://www.frost.com/mb42 ), finds that the LiDAR-enabled passenger vehicle market earned revenues of $51.1 million in 2014 and estimates this to reach $141.0 million in 2021.\nFor complimentary access to more information on this research, please visit: http://corpcom.frost.com/forms/EU_PR_KFeick_MB42-18_03Sep15 .\nThe need to deploy improved sensors that support active safety and automated driving in future passenger vehicles has driven the European and North American automotive industry towards exploring LiDAR technology. Compared to other products on the market, LiDAR is a better sensor in terms of object detection and mapping in low-visibility conditions. The use of reflective infrared lasers to capture data and the independence from ambient light enables LiDAR to perceive objects the same way in a wide range of conditions.\n\"Legislations have been passed in parts of North America in support of the use of LiDAR technology in vehicles to enable automated driving,\" said Frost & Sullivan Automotive & Transportation Senior Research Analyst, Anirudh Venkitaraman . \"While this has encouraged adoption in the region, the higher cost of LiDAR systems when compared with other sensors has been a major constraint for growth.\"\nThe European and North American markets do offer some cost-effective LiDAR solutions but they have a resolution that is poor-to-modest at best. Reliability issues also plague these systems as they consist of a few moving parts.\nOther problems associated with LiDAR systems are its limited range and packaging constraints. The average LiDAR system available on the market can scan up to 100 meters ahead with limited reflectivity. This, however, is inferior to camera-based systems, which provide a range up to 500 meters.\n\"As LiDAR technology is still in its nascent stages, achieving market acceptance will take some time,\" noted Venkitaraman. \"Once the future generation of technologically-advanced, affordable LiDARs hit the market shelves towards 2020, the end-user market will be more willing to invest in these products.\"\nOriginal equipment manufacturers (OEMs) in Europe and North America are rigorously working with tier-one suppliers to create an advanced LiDAR solution for use in passenger vehicles. Those OEMs tying up with tier-one suppliers to develop LiDAR systems for automated driving vehicles will manage successful and faster introduction of their products.\nLIDAR-based Strategies for Active Safety and Automated Driving from Major OEMs in Europe and North America is part of the Automotive & Transportation (MB42-18) ( http://ww2.frost.com/research/industry/automotive-transportation ) Growth Partnership Service program. Frost & Sullivan's related studies include: Rise of Virtual Cockpits in Cars, Future of Intelligent Mobility & its impact on Transportation, Strategic Analysis of the European and North American Market for Automated Driving, The Global Advent of 5G in Cars, and Future of Automotive Retail. All studies included in subscriptions provide detailed market opportunities and industry trends evaluated following extensive interviews with market participants.\nAbout Frost & Sullivan\nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants.\nOur \"Growth Partnership\" supports clients by addressing these opportunities and incorporating two key elements driving visionary innovation: The Integrated Value Proposition and The Partnership Infrastructure.\nThe Integrated Value Proposition provides support to our clients throughout all phases of their journey to visionary innovation including: research, analysis, strategy, vision, innovation and implementation. The Partnership Infrastructure is entirely unique as it constructs the foundation upon which visionary innovation becomes possible. This includes our 360 degree research, comprehensive industry coverage, career best practices as well as our global footprint of more than 40 offices. For more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organisation prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies?\nContact Us: Start the discussion\nJoin Us: Join our community\nSubscribe: Newsletter on \"the next big thing\"\nRegister: Gain access to visionary innovation\nContact:\nKatja Feick\nCorporate Communications – Europe\nP: +49 (0) 69 / 77 0 33 43\nE: katja.feick@frost.com\nTwitter: @Frost_Sullivan or @FS_Automotive\nFacebook: FrostandSullivan\nLinkedin: Future of Mobility – A Frost & Sullivan Forum\nhttp://www.frost.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/7-out-of-13-top-oems-work-on-lidar-technology-for-automated-driving-passenger-vehicles-300158589.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "https://twitter.com/Frost_Sullivan", "http://www.frost.com/", "http://www.prnewswire.com/news-releases/7-out-of-13-top-oems-work-on-lidar-technology-for-automated-driving-passenger-vehicles-300158589.html", "http://www.frost.com/mb42", "http://www.frost.com/c/10046/sublib/display-report.do?searchQuery=MB42&ctxixpLink=FcmCtx3&ctxixpLabel=FcmCtx4&id=MB42-01-00-00-00&bdata=aHR0cHM6Ly93d3cuZnJvc3QuY29tL3NyY2gvY3Jvc3MtY29tbXVuaXR5LXNlYXJjaC5kbz9zZWFyY2hUeXBlPWFkciZxdWVyeVRleHQ9TUI0MiZ4PTAmeT0wQH5AU2VhcmNoIFJlc3VsdHNAfkAxNDQxMTY3MzQ1MTU5", "http://ww2.frost.com/research/industry/automotive-transportation", "https://www.linkedin.com/grp/home?gid=4480787", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA26483&Transmission_Id=201510140830PR_NEWS_USPR_____DA26483&DateId=20151014", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Register", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Contact", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=PRFooter", "https://twitter.com/FS_Automotive", "https://www.facebook.com/FrostandSullivan", "http://corpcom.frost.com/forms/EU_PR_KFeick_MB42-18_03Sep15", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Join"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T18:23:23.147+03:00", "highlightTitle": ""}