{"organizations": [], "uuid": "2f041854f4262c446a6b7dfd4221bbf359cb85ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03457/old-mutual-retirem_3457356a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-16.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/finance/new-pension-rules/11899418/retirement-golden-age.html", "country": "US", "title": "Retirement: a golden age for the family | New Pension Rules", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Retirement: a golden age for the family | New Pension Rules - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:16:00.000+03:00", "replies_count": 0, "uuid": "2f041854f4262c446a6b7dfd4221bbf359cb85ca"}, "author": "Rhiannon Edwards", "url": "http://www.telegraph.co.uk/sponsored/finance/new-pension-rules/11899418/retirement-golden-age.html", "ord_in_thread": 0, "title": "Retirement: a golden age for the family | New Pension Rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learn more about new pension rules » When Kath Moore’s son rang her one day with a problem, she knew what she had to do. Her daughter-in-law had broken a shoulder bone and her son was struggling to find someone to look after their baby girl while he went to work. Ms Moore decided to retire immediately from her job as a manager of child welfare officers to help her family. She cared for her granddaughter Amelia for six weeks while Amelia’s mother got back to full strength. “I was 58 and had I not had a grandchild I might have held on for a couple more years,” says Ms Moore. “But I wanted to be there for them.” For many grandparents, retirement has given them time to bring their family together and see their grandchildren in those all important early years, imparting wisdom, as well as having fun. A total of 63pc of UK grandparents provide childcare for their grandchildren, according to the campaign group Grandparents Plus . A total of 63pc of UK grandparents provide childcare for their grandchildren In a survey of more than 9,000 Saga customers over 50, 57pc felt their age was an asset to their family, and 86pc said they tried to pass their values on to their family. Retirement doesn’t only mean more quality time with grandchildren. It can also mean you see more of your children, as Rob Booty found out when he started a company with his family after he retired. Asked to provide teepees for his daughter’s wedding reception, he worked out where the best teepees were made and came up with the idea that if he bought some, the family could make a business from renting them out. Two years later, teepee rental business Boutipi is run by Mr Booty, his two daughters and his wife Carole – and employs both his daughter’s partners, meaning the family is usually together. “We work any time that suits the business and I think that’s been the trick to having a good relationship with the customers and making deals,” says Mr Booty. “Starting a business was a big learning curve; now I can pass that learning to my daughters so that they have a head start.” Judy Rich, founder of high street chain Long Tall Sally and now a life coach specialising in retirement ( richcoaching.co.uk ) says family time for retirees can often tie in with other pastimes. Retirement is a time to explore new avenues, have fun and enjoy life “Many of my clients develop their creative skills, start businesses and explore further education, in addition to spending more time with family. \"Retirement is a time to explore new avenues, have fun and enjoy life. If the retired person combines his or her own interests with quality time spent with family, everyone benefits.” In between paperwork and teepee building, Mr Booty also gets more time to be a grandparent, says his daughter Samantha. “When we launched the business I was pregnant with my first child and my sister had just had her son. The company is based at our parents’ house, and so we all have a hand in childcare and Mum and Dad get to see their grandchildren more often. At times it has been manic, but it is one of the best things that we have all ever done.” Seven years on from her day of decision, Ms Moore has four grandchildren. Having been brought up alongside five siblings and motivated by a need to see her family, she travels weekly to help her daughter with childcare for Josie, five and Sam, two, as well as keeping in touch with her siblings. “Family has become so important to me since I retired,” says Ms Moore. “My relationship with my grandchildren is the most wonderful I’ve had in my whole life. You give them the love and care that a nanny just couldn’t give – because the nanny is not part of your family. I can only manage to do it because I am retired.” You may also be interested in: • Six questions to ask your pension adviser • The new shape of retirement • Balancing pensions against retirement income", "external_links": [], "published": "2015-10-16T23:16:00.000+03:00", "crawled": "2015-10-16T18:42:41.732+03:00", "highlightTitle": ""}