{"organizations": [], "uuid": "f96cb4c62a474fb87b7ded1073f1fe829efe2909", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30270913/kia-motors-america-and-brakes-support-national-teen-driver-safety-week-with-free-hands-on-defensive-driver-training", "country": "US", "title": "Kia Motors America And B.R.A.K.E.S. Support National Teen Driver Safety Week With Free Hands-On Defensive Driver Training", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Kia Motors America And B.R.A.K.E.S. Support National Teen Driver Safety Week With Free Hands-On Defensive Driver Training - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "f96cb4c62a474fb87b7ded1073f1fe829efe2909"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30270913/kia-motors-america-and-brakes-support-national-teen-driver-safety-week-with-free-hands-on-defensive-driver-training", "ord_in_thread": 0, "title": "Kia Motors America And B.R.A.K.E.S. Support National Teen Driver Safety Week With Free Hands-On Defensive Driver Training", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Kia Motors America\nNo-Cost, Behind-the-Wheel Training Provides Teens and Their Parents with Advanced Safe Driving Skills\n- Motor vehicle crashes are the leading cause of death for 15-17 year olds[1]\n- Kia and B.R.A.K.E.S. provide four hours of behind-the-wheel training to help teens develop safe and responsible driving habits\nIRVINE, Calif. , Oct. 15, On average eight teens lose their lives every day in vehicle crashes, or approximately 3,000 teens per year.[2] B.R.A.K.E.S. (Be Responsible and Keep Everyone Safe) and Kia Motors America (KMA) are working together to make the streets in cities across the U.S. safer. Registration for the lifesaving B.R.A.K.E.S. Teen Pro-Active Driving School instruction is open now at PutOnTheBrakes.org/Schedule .\nThe 501(c)(3) charity's free advanced driver training is coming to the North Carolina State Trooper Training Center in Raleigh, North Carolina , Oct. 17 - 18 ; zMax Dragway in Concord, North Carolina , Oct. 24 - 25 ; New England Dragway in Epping, New Hampshire , Oct. 31 - Nov. 1 ; zMax Dragway in Concord, North Carolina , Nov. 14 - 15 ; Atlanta Dragway in Commerce, Georgia , Nov. 21 - 22 ; zMax Dragway in Concord, North Carolina , Dec. 5 - 6 and Fairplex in Pomona, California , Dec. 19 - 20 .\nIn conjunction with Teen Driver Safety Week ( Oct. 18 – 24), B.R.A.K.E.S.' highly skilled professional instructors will provide four hours of intensive hands-on defensive driving education for hundreds of teens in the U.S., adding to the more than 17,000 teens nationwide that have graduated from B.R.A.K.E.S. since 2008. Instruction includes a distracted driving exercise, emergency braking using the anti-lock braking system (ABS), evasive maneuvering and skid-control practice. Kia is the Official Vehicle and presenting sponsor of the B.R.A.K.E.S. Teen Pro-Active Driving School and provides a fleet of 32 new vehicles for the students and parents to drive during the training. With Kia's support, B.R.A.K.E.S. has been able to increase the number of schools offered and expand into new markets.\n\"Kia is committed to working with B.R.A.K.E.S. to eliminate the epidemic of teen traffic fatalities,\" said Tim Chaney , vice president of marketing communications, KMA. \"The B.R.A.K.E.S. program provides unmatched tools to help teens and their parents become better drivers and thus save lives.\"\nAt any given daylight moment across America, approximately 660,000 drivers are using cell phones or manipulating electronic devices while driving, a number that has held steady since 2010.[3] A quarter of teens respond to at least one text message or have multi-message text conversations while driving.[4] As a result, drivers under the age of 20 have the largest proportion of fatal accidents involving distracted driving.[5] Vehicle accidents also remain the leading cause of death for teens globally. Working together, Kia and B.R.A.K.E.S. aim to change this statistic.\n\"B.R.A.K.E.S. is committed to providing teens with the training they need to make safer decisions on the road and prepare for the hazardous conditions they will encounter,\" said Doug Herbert , founder of B.R.A.K.E.S. and recent recipient of the Peter K. O'Rourke Special Achievement Award from the Governors Highway Safety Association (GHSA). \"By working together with Kia, B.R.A.K.E.S. has been able to expand into new markets in an effort to reduce teen driving accidents nationwide.\"\nB.R.A.K.E.S.' free safe-driving instruction provides a low three-to-one student-to-teacher ratio to ensure personal attention. Teens with parents who set driving rules and monitor their activities are half as likely to crash, 71 percent less likely to drive intoxicated, and 30 percent less likely to use a cell phone when driving and less inclined to speed.[6] Parents participate in the courses to ensure proper driving techniques are reinforced following the session. The first six months are the most dangerous for a new driver,[7] however, only 25 percent of parents have had a serious talk with their teen about the key components of driving.[8] B.R.A.K.E.S. provides both teens and parents with the tools they need to be safe on the road.\nThe B.R.A.K.E.S. Training Curriculum includes the following:\nAccident Avoidance/Slalom: The two-part course simulates an animal or object jumping out in front of a car. It forces students to make a split-second reaction to help negotiate a quick, evasive lane change without losing control of the vehicle. Students must navigate their vehicle around cones while focusing on weight transfer, hand positioning and eye scanning. Distracted Driving: In 2009 it was estimated more than 5,400 people died in crashes that were reported to involve a distracted driver and about 448,000 people were injured.[9] The course demonstrates the danger that cell phones, text messaging, and other distractions can pose while driving. Drop Wheel/Off Road Recovery: The drop-wheel recovery course teaches students how to effectively recover when one or more of their wheels veers off the road surface and onto the shoulder, regaining control of the car and safely returning to the roadway. Panic Stop: Teens often lack the experience needed to judge a safe following distance. The panic-stop course instructs students on proper braking techniques to help stop a vehicle in the shortest distance possible while maintaining control. Students experience firsthand the pulsating brake pedal effects of ABS and how to control the vehicle when ABS is engaged . Car Control and Recovery: A wet skid pad simulates wet-road conditions. Students learn how to recover from both oversteer (rear wheel) and understeer (front wheel) skids. Other learning experiences vary by school but can include an eye-opening view from the driver's seat of a big-rig truck with a discussion about safe zones and blind spots, as well as demonstrations from police and fire-rescue agencies. About Kia Motors America\nKia Motors America (KMA) is the marketing and distribution arm of Kia Motors Corporation based in Seoul , South Korea. KMA proudly serves as the \"Official Automotive Partner\" of the NBA and LPGA and set an all-time annual sales record in 2014, surpassing the 500,000 unit mark for the third consecutive year. KMA offers a complete line of vehicles, including the rear-drive K900[10] flagship sedan, Cadenza premium sedan, Sorento CUV, Soul urban passenger vehicle, Soul Electric Vehicle[11], Sportage compact CUV, Optima midsize sedan, Optima Hybrid, the Forte compact sedan, Forte5 and Forte Koup, Rio and Rio 5-door subcompacts and the Sedona midsize multi-purpose vehicle, through a network of more than 765 dealers across the United States. Kia's U.S. manufacturing plant in West Point, Georgia , builds the Optima* and Sorento* and is responsible for the creation of more than 15,000 plant and supplier jobs.\nInformation about KMA and its full vehicle line-up is available at www.kia.com . For media information, including photography, visit www.kiamedia.com . To receive custom email notifications for press releases the moment they are published, subscribe at www.kiamedia.com/us/en/newsalert .\nAbout B.R.A.K.E.S.\nB.R.A.K.E.S. (Be Responsible And Keep Everyone Safe), is a 501(c)(3) non-profit organization founded by NHRA Mello Yello Series Top Fuel drag racer Doug Herbert in memory of his two sons, Jon and James, who were tragically killed in a car accident. The B.R.A.K.E.S. Teen Pro-Active Driving School is a free, defensive driving program. By training and educating teenage drivers and their parents, the program aims to promote safe driving in an attempt to prevent injuries and save lives. To volunteer, obtain more information or donate please visit www.putonthebrakes.org .\n* The Sorento and Optima GDI (EX, SX & Limited and certain LX Trims only) are assembled in the United States from U.S. and globally sourced parts\n[1] http://apps.who.int/iris/bitstream/10665/162176/1/WHO_NMH_NVI_15.3_eng.pdf?ua=1&ua=1\n[2] http://www.cdc.gov/parentsarethekey/\n[3] http://www-nrd.nhtsa.dot.gov/Pubs/811719.pdf\n[4] http://www.distraction.gov/stats-research-laws/facts-and-statistics.html\n[5] http://www.distraction.gov/stats-research-laws/facts-and-statistics.html\n[6] http://www.ghsa.org/html/media/pressreleases/2013/20131017ntdsw.html\n[7] http://www.trafficsafetymarketing.gov/newtsm/teens/2013/TeenWeek/10038_TeenDriverWeek2013_SocialMedia_102113_v1a_tag.pdf\n[8] http://www.trafficsafetymarketing.gov/teens\n[9] http://www-nrd.nhtsa.dot.gov/Pubs/811379.pdf\n[10] K900 available in select trims and in select markets with limited availability.\n[11] Soul EV in select markets with limited availability.\nPhoto - http://photos.prnewswire.com/prnh/20151015/277375\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/kia-motors-america-and-brakes-support-national-teen-driver-safety-week-with-free-hands-on-defensive-driver-training-300160608.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.cdc.gov/parentsarethekey/", "http://www.kia.com/", "http://www.xmlnews.org/ns/", "https://photos.prnewswire.com/prnvar/20151015/277375", "http://www-nrd.nhtsa.dot.gov/Pubs/811379.pdf", "http://www.kiamedia.com/", "http://www.ghsa.org/html/media/pressreleases/2013/20131017ntdsw.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA29671&Transmission_Id=201510151341PR_NEWS_USPR_____LA29671&DateId=20151015", "http://putonthebrakes.org/Schedule", "http://www.trafficsafetymarketing.gov/newtsm/teens/2013/TeenWeek/10038_TeenDriverWeek2013_SocialMedia_102113_v1a_tag.pdf", "http://www.kiamedia.com/us/en/newsalert", "http://www.distraction.gov/stats-research-laws/facts-and-statistics.html", "http://www.putonthebrakes.org/", "http://apps.who.int/iris/bitstream/10665/162176/1/WHO_NMH_NVI_15.3_eng.pdf?ua=1&ua=1", "http://photos.prnewswire.com/prnh/20151015/277375", "http://www.prnewswire.com/news-releases/kia-motors-america-and-brakes-support-national-teen-driver-safety-week-with-free-hands-on-defensive-driver-training-300160608.html", "http://www.trafficsafetymarketing.gov/teens", "http://www-nrd.nhtsa.dot.gov/Pubs/811719.pdf"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T22:57:05.376+03:00", "highlightTitle": ""}