{"organizations": ["Oak Tree Village", "Yucaipa"], "uuid": "295803f7bbd2c6a1d458829723fe834b35ba525a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellaonline.com", "main_image": "http://www.bellaonline.com/images/editors/california.jpg", "site_section": "http://www.bellaonline.com/channel.rss?id=15", "section_title": "Travel and Culture @ BellaOnline", "url": "http://www.bellaonline.com/articles/art7480.asp", "country": "US", "title": "Oak Glen", "performance_score": 0, "site": "bellaonline.com", "participants_count": 0, "title_full": "Oak Glen", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T08:00:00.000+02:00", "replies_count": 0, "uuid": "295803f7bbd2c6a1d458829723fe834b35ba525a"}, "author": "", "url": "http://www.bellaonline.com/articles/art7480.asp", "ord_in_thread": 0, "title": "Oak Glen", "locations": ["Los Rios", "Southern California", "California Editor Oak Glen Southern California", "Palm Springs", "Los Angeles", "Oak Glen"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Parrish", "Riley", "Oak Glen BellaOnline", "Oak Glen"], "text": "BellaOnline's California Editor Oak Glen Southern California isnt known for apples, but the area around Oak Glen is out to change that fact. Located in the mountains between the Inland Empire and the Palm Springs metropolis, the area is just up the road from Yucaipa. The various Oak Glen businesses stretch along a five mile stretch of road that forms a semi-circle connecting to the 10 freeway at both ends. On fall weekends, the area is thronged with city folk looking to re-connect with nature by breathing in crisp mountain air, picking apples, and shopping for countrified food and crafts. Oak Glen is a family friendly destination, but adults who enjoy a taste of country life will also enjoy the area. For those coming from the Los Angeles area, the usual way is to leave the freeway at the Oak Glen exit in Yucaipa, a small bedroom community. The road gains elevation fairly quickly, and the cacti and scrub soon changes to Southern California montane forest, as well as small farms and orchards. Visitors can pick their own apples, although the best varieties are saved for sale in the stores. Raspberries can also be picked early in the season, and chestnuts are available later on; its fun to try and time ones visit to be able to find both. Many different varieties of apples are available, changing from week to week, many of which are not available in city supermarkets. The various farm stores are also stocked with different autumn vegetables such as pumpkins and other squash, as well as jams, jellies, pickles, and other canned goods associated with country cuisine. Apple cider is made fresh, and different flavors are sold. Cooking utensils, cookbooks, and various gifts can also be found in the different stores, including antiques, candy, Western wear, and even fruit wine tasting. Visitors usually move from store area to store area, stopping four or five times to sample, browse, and walk. Nature trails circle the area, and taking the time to walk and explore allows the visitor to experience the forest setting as well as the orchards. The major orchards (Rileys, Laws, Parrish, and Snow-Line) all offer different merchandise, and its worth the time to check out each one. Prepared meals are available as well  there is a coffee shop at Laws, a deli at Los Rios, and restaurants at Rileys and Parrish. In the middle of the loop, Oak Tree Village boasts 14 acres of shops, restaurants, stages, and even an animal park and petting zoo. Country bands usually play on weekends, and craft booths can often be found here. Apple Annies Restaurant and Bakery, at the front of the Village, is very popular, and there is often an hour-long wait for a table. The food is very simple country fare, but dessert choices include apple dumplings, apple or cherry pie, and other bakery items. Claustrophobes, take note: the Village is the most crowded area in Oak Glen, and it can be overwhelming. Families will enjoy the different activities for children, while adults may choose to avoid the crowds and stick to the ranches for their shopping. While Oak Glen is a bit of a drive from the Los Angeles area, it makes a nice (if long) day trip. Those who wish to stay the night can try the Serendipity Ranch Bed and Breakfast or one of several campsites close to the area. There are also group campsites and retreat centers available for those who wish to bring small groups up to the mountains.", "external_links": [], "published": "2015-10-25T08:00:00.000+02:00", "crawled": "2015-10-25T10:18:38.619+02:00", "highlightTitle": ""}