{"organizations": [], "uuid": "d9cd219d688a14ca33fececc1ee0bbb9127f6326", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/11/Mandarin-Oriental-Pudong.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/press-release-and-notice-regarding-mandarin-oriental-credit-card-breach-5/", "country": "US", "title": "Press Release And Notice Regarding Mandarin Oriental Credit Card BreachTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Press Release And Notice Regarding Mandarin Oriental Credit Card BreachTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "d9cd219d688a14ca33fececc1ee0bbb9127f6326"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/press-release-and-notice-regarding-mandarin-oriental-credit-card-breach-5/", "ord_in_thread": 0, "title": "Press Release And Notice Regarding Mandarin Oriental Credit Card BreachTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Press Release And Notice Regarding Mandarin Oriental Credit Card Breach Published on : Thursday, October 8, 2015\nEarlier this year, Mandarin Oriental discovered a malware attack on our credit card systems in a number of our hotels listed below. In response, we issued a public statement on our website to alert guests to the attack so they could take proactive measures to monitor their credit card activity. We also immediately engaged law enforcement, cyber-forensic specialists, and appropriate credit card companies to coordinate investigation efforts and to take further steps to assist our guests. After a thorough investigation, we now know more about the incident and are notifying affected guests. We have established a call center that is prepared to address any questions our guests may have about the breach. We regret that this incident occurred and are sorry for any inconvenience it may cause. We take the safety and security of our guests and their personal information very seriously, and the trust our guests place in us remains an absolute priority.\nFrom our investigation, it appears that a hacker used malware to obtain access to certain credit card systems in a number of Mandarin Oriental hotels. We believe this hacker may have used the malware to acquire the names and credit card numbers of guests who used a credit card for dining, beverage, spa, guest rooms, or other products and services at the following Mandarin Oriental properties during these time periods; we have not, however, found any evidence of acquisition or misuse of credit card pin numbers or security codes, or any other personal guest data:\n– Mandarin Oriental, Boston between June 18, 2014 and March 12, 2015\n– Mandarin Oriental, Geneva between June 18, 2014 and March 3, 2015\n– Mandarin Oriental, Hong Kong between June 18, 2014 and February 10, 2015\n– Mandarin Oriental Hyde Park, London between June 18, 2014 and March 5, 2015\n– Mandarin Oriental, Las Vegas between June 18, 2014 and October 16, 2014\n– Mandarin Oriental, Miami between June 18, 2014 and March 3, 2015\n– Mandarin Oriental, New York between June 18, 2014 and January 18, 2015\n– Mandarin Oriental, San Francisco between June 18, 2014 and February 14, 2015\n– Mandarin Oriental, Washington DC between June 18, 2014 and January 20, 2015\n– The Landmark Mandarin Oriental, Hong Kong between June 18, 2014 and February 3, 2015\nSince we were first alerted to this attack, we have been investigating this incident across multiple countries and properties, and working in coordination with law enforcement and the credit card companies. We have timed this notice to avoid disrupting or impeding their concurrent investigations. We have also taken comprehensive steps to ensure that the malware has been removed and that the hacker is no longer in our systems.\nIn some instances, a credit card company may have already replaced the potentially affected credit card if it determined that the guest was at risk. We encourage potentially affected guests to remain vigilant for instances of fraud and identity theft, and to regularly review and monitor relevant account statements and credit reports to ensure the information contained in them is accurate. If any unauthorized charges on credit or debit card(s) are detected, guests should contact their card issuer. If anything is seen that is incorrect on credit reports, guests should contact the credit reporting agency. Suspected incidents of identity theft should be reported to local law enforcement. Even if no signs of fraud are found on reports or account statements, security experts suggest that credit reports and account statements should be checked periodically.\nSource:-Mandarin Oriental", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T07:40:56.068+03:00", "highlightTitle": ""}