{"organizations": [], "uuid": "0381fc6a59a660b974d3f2499f8a171c83a05c42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2012/12/04/tokyo-sexwale-xxx-high-res/ALTERNATES/crop_100x100/Tokyo+Sexwale+XXX+high+res", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/sport/soccer/2015/10/26/tokyo-sexwale-tosses-name-in-hat-for-top-fifa-post", "country": "ZA", "title": "Tokyo Sexwale tosses name in hat for top Fifa post | Soccer", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Tokyo Sexwale tosses name in hat for top Fifa post | Soccer | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T19:30:00.000+02:00", "replies_count": 0, "uuid": "0381fc6a59a660b974d3f2499f8a171c83a05c42"}, "author": "Simon Evans and Brian Homewood", "url": "http://www.bdlive.co.za/sport/soccer/2015/10/26/tokyo-sexwale-tosses-name-in-hat-for-top-fifa-post", "ord_in_thread": 0, "title": "Tokyo Sexwale tosses name in hat for top Fifa post | Soccer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Human Settlements Minister Tokyo Sexwale. Picture: MARTIN RHODES Related articles Beckenbauer backs Sexwale for top Fifa job Is Sexwale the man for football’s top job? Fifa bans former South African soccer official Kika In this article Companies and organisations: South African Football Association | Fifa People: Tokyo Sexwale SOUTH African businessman and former political prisoner Tokyo Sexwale is to run for the presidency of world soccer’s governing body Fifa, a spokesman said on Saturday as the deadline for nominations neared.\nSexwale is the fifth candidate to declare that he will bid to replace the outgoing Sepp Blatter in the February 26 election.\n\"He is SA’s candidate and we hope he will be all of Africa’s candidate,\" spokesman Peter Paul Ngwenya told Reuters.\nThe South African Football Association (Safa) said it fully supported Sexwale’s bid.\nProspective candidates must submit their paperwork to Fifa, including nominations from five football associations, by Monday and they then face an integrity check from the organisation’s Ethics group before being cleared to run.\nPrince Ali Bin Al Hussein of Jordan, former Trinidad and Tobago midfielder David Nakhid, ex-Fifa official Jerome Champagne and Michel Platini, president of European soccer’s ruling body Uefa, also say they have submitted nominations.\nPlatini’s chances are slim because he is currently suspended, along with Swiss Blatter, pending an Fifa ethics investigation into a Sf2m ($2.04m) payment by soccer’s ruling body to the former France midfielder in 2011.\nThe president of the Asian Football Confederation Sheikh Salman Bin Ebrahim Al Khalifa of Bahrain is also considering a bid and canvassed opinion among Asian federations last week.\nFriend of Mandela\nThe unusually high number of nominees could lead to a long and complex election with Fifa’s voting system eliminating the candidate with the smallest support after each round of voting.\nA close friend of the late former South African president Nelson Mandela, the pair having spent 13 years together at the Robben Island prison, Sexwale was a member of the African National Congress and a post-apartheid government minister before moving into business.\nA charismatic figure, he has been involved with Fifa’s Anti-Discrimination Task Force and in talks between the Palestinian and Israeli federations.\nThe 62-year-old was a founder member of the Makana Football Association, the unofficial soccer organisation for Apartheid-era prisoners on Robben Island.\nSexwale will now look for backing from the Confederation of African Football (CAF) which holds executive committee meetings on Tuesday and Wednesday.\nThe suspensions of Blatter and Platini earlier this month were the latest twists in Fifa’s worst crisis in its 111-year history.\nSwiss authorities are also investigating the decision to award the 2018 and 2022 World Cups to Russia and Qatar respectively while the US Department of Justice has indicted 14 soccer officials and sports marketing executives on a series of corruption charges.\nReuters", "external_links": [], "published": "2015-10-26T19:30:00.000+02:00", "crawled": "2015-10-26T20:02:15.502+02:00", "highlightTitle": ""}