{"organizations": [], "uuid": "cc24ce0015f7bb8a497b60ab5d6f77132544582c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03458/family-expense-flo_3458604a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-10-26.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/finance/retirement-investments/11902109/enterprise-investment-schemes.html", "country": "US", "title": "Enterprise investment schemes are a match for pensions", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Enterprise investment schemes are a match for pensions - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T16:12:00.000+02:00", "replies_count": 0, "uuid": "cc24ce0015f7bb8a497b60ab5d6f77132544582c"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/finance/retirement-investments/11902109/enterprise-investment-schemes.html", "ord_in_thread": 0, "title": "Enterprise investment schemes are a match for pensions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover more about retirement investments » Annuity rates have plummeted by 22 per cent in the past 10 years, and in April next year the lifetime pension saving allowance is set to fall from £1.25m to £1m. Although the new pension freedoms have meant retirees can be more flexible in how they take their income, they could also spell danger for pensioners. They could withdraw too much, cutting future income dramatically. That risk is even more acute during periods of stock market turmoil. So what can pension savers do? The only option that combines the tax efficiency of pensions and the wealth-building opportunities of stock market investing is the Enterprise Investment Scheme (EIS). EIS is far more generous than a pension, particularly for high-earners. EIS compares favourably with pensions, particularly in terms of the annual cap on tax relief - £1 million compared with £40,000 – and in terms of access. You only have to hold EIS shares for three years, whereas you have to wait until the age of 55 to access your pension. If the company you invest fails you are able to claim loss relief against capital gains or against income. Quick guide to EIS • The EIS was launched in 1993 to help smaller companies raise finance by offering tax relief on new shares. • With maximum reliefs on income and capital gains tax, you could save 58p for every £1 you invest: if you include IHT relief, you could save 98p. With investment growth, the saving could be even more but the tax benefits depend on your circumstances. • It provides an opportunity for individuals to invest directly in private UK companies. • Your investment could be completely outside your estate for inheritance tax purposes. • Reinvesting increases relief. Say you held an EIS share for five years, then reinvested it. You would get 30 per cent cashback in year one, 30 per cent in year five and 30 per cent in year 10 - totalling 90 per cent relief. 1. Meet Rockpool to decide on the most suitable investment strategy for your risk appetite 2. Choose the self-select service, where you are in control; or the Managed Service, where you give us discretion to build a portfolio for your needs 3. Invest in a portfolio of private companies – often around three or four. You can set the minimum diversity 4. Receive upfront relief on income and capital gains taxes 5. Hold the shares for a minimum of three years 6. Offset any losses against income tax 7. Cash in after a minimum of three years; reinvest to increase tax relief; and/or keep the portfolio for the rest of your life to protect against inheritance tax How it works Rockpool's investments into private companies qualify for tax reliefs through the Enterprise Investment Scheme. You can choose from two portfolio services: • the self-select service, where you are in control • the managed service, where you give Rockpool discretion to build your portfolio You can set the minimum number of companies you want to invest in, you can choose to reinvest to claim further tax relief income and mitigate inheritance tax. Rockpool’s goal is to help people build wealth through direct investment in private companies. Alongside EIS, Rockpool uses Business Property Relief (BPR) to offer inheritance tax exemption after two years and Business Investment Relief (BIR), which allows investors to bring money into the UK without paying tax on foreign income. This all helps make the most of investors’ money, The four types of EIS investor 1. The inheritance tax saver You want to protect your wealth for your heirs, but do not want to lose control of your assets. Rockpool’s strategy typically chooses shares in companies with a lower risk profile, based on factors such as consistent profitability, a strong balance sheet, contracted revenues or which are asset-rich. The focus is on saving 40 per cent inheritance tax by holding the shares for two years. 2. The diverse investor You want to spread your investment across many companies to control risk. Rockpool’s Managed Service lets you choose the minimum number of companies you want to invest in, ensuring you get the diversity you’re after. 3. The adventurous investor You have exhausted all other tax-saving possibilities, or perhaps you have enough “safe” investments and are prepared to take more risk, like one of Rockpool’s ‘Growth’ opportunities. These arise when ambitious businesses use capital to establish a competitive advantage, which could multiply your capital three times or more over five years. 4. The pension investor You are a high earner set to breach your pension lifetime allowance and looking for alternative tax shelters or have used up your annual allowance. EIS offers more generous tax reliefs than pensions, and Rockpool can help you invest in companies with a proven model and strong profit records. • To find out more about private investment opportunities, visit Rockpool.uk.com Please note: your capital is at risk and there is no guarantee of return. Tax benefits depend on your personal circumstances and compliance with relevant rules. You may not be able to sell your investment when you want .", "external_links": [], "published": "2015-10-26T16:12:00.000+02:00", "crawled": "2015-10-26T12:27:38.701+02:00", "highlightTitle": ""}