{"organizations": ["Fig & Olive", "Facebook", "Le Clos St Basile", "Michelin", "Mougins", "Yahoo Travel"], "uuid": "12e2754613d3d69373da7a98ecabac86509b335a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/JsKWRA7G_zxfIt_PxCxNZQ--/aD04MDY7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/cd/resizer/2.0/FIT_TO_WIDTH-w1200/57b1a90dfdeab1eaa21d0ea9b7114e3f3b60217c.jpg", "site_section": "https://www.yahoo.com/travel/rss", "section_title": "Yahoo Travel", "url": "https://www.yahoo.com/travel/the-best-international-food-festival-youve-never-001206685.html?src=rss", "country": "US", "title": "The Best International Food Festival You’ve Never Heard of", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "The Best International Food Festival You’ve Never Heard of", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:12:00.000+03:00", "replies_count": 0, "uuid": "12e2754613d3d69373da7a98ecabac86509b335a"}, "author": "", "url": "https://www.yahoo.com/travel/the-best-international-food-festival-youve-never-001206685.html?src=rss", "ord_in_thread": 0, "title": "The Best International Food Festival You’ve Never Heard of", "locations": ["United States", "Miami", "Morocco", "Greece", "Dar Moha", "Chicago", "Mougins", "D.C.", "French Riviera", "South of France", "France", "New York", "U.S.", "Paris", "Marrakech", "Cyprus", "L.A"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hocquet", "Lestrade", "Pinterest", "Kasia Wandycz/Paris Match", "Roth", "Mougins", "Nicolas Decherchi", "Paloma", "Oliver Roth", "Fedal", "David Gussin", "Assouline", "Moha Fedal", "Laurent Halazs", "Matthieu Lestrade", "Wilfrid Hocquet"], "text": "Send Mougins (Photo: niceartphoto / Alamy Stock Photo) Mougins is a beautiful little hill-top town in the South of France, surrounded by pine, olive and, Cyprus, trees. It’s known for its art (Picasso famously lived and died there), and perhaps more importantly, for its food. For foodies, the town’s annual Les Etoiles de Mougins food festival is a must-do. Still relatively unknown stateside, it packs a big punch in the culinary community, bringing together chefs with more than 300 Michelin Guide stars among them, as well as 25,000 visitors every year. “You have Cannes for movies, but you have Mougins for food,” said Moha Fedal, chef at Dar Moha in Marrakech, who attended the 2015 festival. This year, along with chefs from France, Morocco, and Greece, the United States represented — restaurant group Fig & Olive sent executive chefs Wilfrid Hocquet and David Gussin, as its founder, Laurent Halazs, grew up in Mougins. Related: How to Eat French Food Like a French Person “Mougins is a city known for big gastronomy,” said Oliver Roth, pastry chef at the Michelin starred La Mas Candille. “It’s a good idea to get the chefs together and we have fun and we can see the other chefs and their work. Mougins has a big reputation for good food.\" The festival, held every September, offers cooking classes for just 20 euros. This year, Roth held a dessert-making class in which visitors could participate. There are also demonstrations that take place throughout the weekend, where tourists can watch gastro gurus whip up some of their favorite dishes. \"The cooking show is always a great moment,” said Hocquet, who is French himself, but oversees Fig & Olive’s U.S. locations, including L.A, New York, Chicago, Miami and D.C. “[It’s] so nice to interact with the public, make them discover what we do and how we do the cuisine we realize everyday in our restaurants,” added the chef, who demonstrated a scallop dish. “The objective is that people can do it at home,” explained Matthieu Lestrade, head chef and owner of Le Clos St Basile in Mougins, who prepared lobster ravioli during a cooking demonstration. Lestrade participated in the first Les Etoiles de Mougins 10 years ago, and has been returning annually to mingle with chefs from all over the world. “In my opinion, it has become one of the top five gastronomic events in the world. That’s why people come from so very far away,” said Lestrade. The three-day event culminates with a 500-person gala on Sunday evening, at which the chefs each serve small portions of their favorite dishes. (Visitors can purchase tickets.) Read More Photo: Kasia Wandycz/Paris Match via Getty Images “I’m happy to meet all the many, many, many chefs of the world and sometimes I like to do something different outside of my country,” said Fedal of cooking for the big final night. His pastilla of duck with foie gras and argan oil was a crowd-pleaser at the gala. Fig & Olive’s Hocquet served up another gala guest favorite — the scallop dish from his cooking demonstration. Diners stood in line and watched the pan-seared scallops sizzle; the mollusks were then served over tabouleh. “To be on the French Riviera with so many chefs from all over the world is great,” said Hocquet. Even without the festival, Mougins is known for it’s vibrant food scene. Local restaurant Paloma, is a Michelin-starred restaurant headed up by 33-year-old Chef Nicolas Decherchi. “[Paloma] opened two years ago; we got a Michelin star in seven months,” he said through a translator. “Last year I was chef of the year.” (His creation for the gala this year was an unusual tart masquerading as dessert, that actually had foie gras inside.) Related: Cheap and Chic Paris For those who aren’t able to travel to the South of France or who can’t wait until next September, the team behind Fig & Olive is releasing a cookbook dedicated to recipes of the region: Fig & Olive: The Cuisine of the French Riviera [Assouline, November 2015, $50.00]. The restaurant’s founder, Laurent Halazs, developed the cookbook, which features recipes from his mother’s own kitchen in Mougins and from Fig & Olive. Let Yahoo Travel inspire you every day. Hang out with us on Facebook , Twitter , Instagram , and Pinterest. Watch Yahoo Travel’s original series “ A Broad Abroad .” For more on Yahoo Travel’s travel policy, click here .", "external_links": [], "published": "2015-10-13T03:12:00.000+03:00", "crawled": "2015-10-13T06:54:15.822+03:00", "highlightTitle": ""}