{"organizations": [], "uuid": "200e9caa1a55679b73d8a5f3a6962fae858441bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/c/t/j/s/image.related.StuffLandscapeSixteenByNine.620x349.17cqej.png/1444344421647.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/kiwi-traveller/72817579/Kiwi-invents-revolutionary-backpack-jacket", "country": "AU", "title": "Kiwi invents revolutionary backpack jacket", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Kiwi invents revolutionary backpack jacket", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:47:00.000+03:00", "replies_count": 0, "uuid": "200e9caa1a55679b73d8a5f3a6962fae858441bd"}, "author": "Elena McPhee", "url": "http://www.stuff.co.nz/travel/kiwi-traveller/72817579/Kiwi-invents-revolutionary-backpack-jacket", "ord_in_thread": 0, "title": "Kiwi invents revolutionary backpack jacket", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kiwi invents revolutionary backpack jacket ELENA MCPHEE Last updated 11:47, October 9 2015 SUPPLIED \nDesign student Taylor Burn's \"All Weather Day Pack\", modelled by his friend Willem Van Buskirk, has been nominated for a national design award. \nA former Marlborough Boys' College student who invented a backpack jacket is excited to be in the running for a national design award. \nAuckland University of Technology second-year design student Taylor Burn, 20, was nominated in the Best Product student category, with 15 other students from around New Zealand. \nThe Best Design Awards, run by the Designers Institute of New Zealand, will be held at the Viaduct Events Centre in Auckland on Friday night and more than 1000 people are expected to attend. \nAn institute spokesperson described the evening as the \"biggest night of the Australasian design year\". \nBurn came up with his design, a backpack which is also a rain jacket, after he went on a camping trip with classmates while they were working on a project with Kathmandu. His group was focusing on hybrid products. \n\"It was about asking the question, 'could it happen?'\" he said. \nThe \"All Weather Day Pack\", modelled in pictures for the awards by one of Burn's friends, unfolded from pockets on the sides and the top to create a jacket. \nThe jacket was completely wind and waterproof, and featured some \"cool leather designs\", Burn said. \nBurn did all the sewing of the jacket and backpack himself, and the project took 12 weeks. \n\"I didn't expect to get any recognition from it, it was a personal thing,\" he said. \nOne of his inspirations for the design was British artist Lucy Orta, who worked with wearable architecture. \nBurn said the backpack had plenty of room to hold other things as well. \n\"I have a second prototype without the jacket, that I take to university everyday.\" \nBurn said he was always interested in design and art at school. \n\"I thought 'if you like something, why not do it for a living?'\" \nHe wanted to travel overseas after university, and his \"dream job\" was working in a design studio in Europe. \nDuring his course, Burn had the chance to work on projects with businesses from different industries. Projects ranged from designing chocolate gifts to designing furniture. \nNext year, he would be able to choose an area in which to specialise. \n\"I'm really interested in lighting design and furniture, but I want to explore more wearable stuff as well. We'll see what happens,\" he said. \nHe was looking forward to the awards and thought they would be \"really exciting\". - The Marlborough Express", "external_links": [], "published": "2015-10-09T01:47:00.000+03:00", "crawled": "2015-10-09T02:46:59.844+03:00", "highlightTitle": ""}