{"organizations": [], "uuid": "2ea500d29a6f915fecf123a1fc00098068943166", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30237769/norwegian-cruise-line-announces-its-entry-to-the-china-cruise-market", "country": "US", "title": "Norwegian Cruise Line Announces Its Entry To The China Cruise Market", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Norwegian Cruise Line Announces Its Entry To The China Cruise Market - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "2ea500d29a6f915fecf123a1fc00098068943166"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30237769/norwegian-cruise-line-announces-its-entry-to-the-china-cruise-market", "ord_in_thread": 0, "title": "Norwegian Cruise Line Announces Its Entry To The China Cruise Market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Norwegian Cruise Line\nWorld's Leading Large Ship Cruise Line Will Homeport Purpose-Built Breakaway Plus Class Ship in China\nSales Offices opened in Beijing, Hong Kong and Shanghai to Support International Expansion\nSHANGHAI , Oct. 12, Norwegian Cruise Line will introduce the first purpose-built ship customized for the China market in 2017, Norwegian Cruise Line Holdings Ltd. (Nasdaq: NCLH) CEO Frank Del Rio announced today during the CruiseWorld China summit in Shanghai. Currently under construction, the new ship is designed specifically for the China market with accommodations, cuisine and onboard experiences that cater to the unique vacation preferences of Chinese guests.\n\"Our new purpose-built ship for China will have characteristics that are authentic to Norwegian Cruise Line and yet distinctively Chinese in all of its sensibility,\" said Del Rio . \"With this new ship, Norwegian will unquestionably offer our Chinese guests a superior product and introduce a new standard of innovation and excellence into the marketplace, with an unrivaled level of customization for the Chinese consumer. It will perfectly suit what modern Chinese travelers value from an upscale cruise experience.\"\nThe new ship will be the second of Norwegian Cruise Line's Breakaway Plus class and features the line's unique style of cruising known as Freestyle Cruising. Aboard NCL ships, Chinese guests will indulge in a resort-style vacation experience, with the freedom and flexibility to joyfully spend time doing whatever they wish, from enjoying world-class entertainment to fine Mandarin, Cantonese and Continental dining; from duty-free luxury shopping to participating in any number of incredible first-at-sea activities onboard; all on their own time schedule.\nNorwegian Cruise Line is widely recognized as the leading innovator in the cruise industry. Not only will Norwegian Cruise Line's new ship offer the highest-level of purpose-built customization, it will clearly be the most innovative ship ever built exclusively for the China market. With a capacity of 4,200 guests, this new Breakaway Plus-class vessel will provide the same sense of freedom and flexibility found on all Norwegian Cruise Line ships, but with experiences and amenities designed specifically with Chinese guest in mind. The level of customization will go beyond the physical design of the ship. Working with partners in China and local experts on the subtleties of Chinese culture, Chinese guests who sail on this new ship will be provided with an unmatched quality-level for service, cuisine, entertainment and overall experience that is simply not available in the China market today. Additional details, including the ship's name, homeport, accommodations, dining and entertainment will be shared in the coming months.\nTo better support the company's expansion efforts in China , Norwegian Cruise Line Holdings has opened offices in Beijing (Guomao CBD) and Hong Kong (Quarry Bay) and today opens its Shanghai office in Xintiandi. These China -based offices support all three brands in the company's portfolio – Norwegian Cruise Line, Oceania Cruises and Regent Seven Seas Cruises which span the upper end of the contemporary, premium, and luxury cruise categories and relevant to each segment and each stage in the Chinese consumer life cycle.\n\"Our China offices house a dedicated leadership team uniquely focused on ensuring the success of our local travel agent partners, which is crucial to the success of our expansion in what will soon be the world's second largest cruise market,\" said Del Rio . \"These offices will provide sales and marketing support to our travel partners whose customers not only wish to sail on our new China -based ship, but also on any of the incredible voyages around the world offered across our portfolio of brands.\"\nThe new ship will be delivered in Spring 2017. Norwegian will take delivery of the line's first Breakaway Plus class ship, Norwegian Escape, next week on October 22 . Two additional ships in this class are on order for delivery in 2018 and 2019.\nFor more information on Norwegian Cruise Line visit www.goncl.cn or www.ncl.com .\nAbout Norwegian Cruise Line Holdings\nNorwegian Cruise Line Holdings Ltd. (Nasdaq: NCLH) is a diversified cruise operator of leading global cruise lines spanning market segments from contemporary to luxury under the NCL, Oceania Cruises, and Regent Seven Seas Cruises brands. These brands operate a young fleet of 21 ships with approximately 40,000 lower berths visiting more than 420 destinations worldwide. The Company's brands will introduce six more ships through 2019.\nNorwegian Cruise Line is the most innovative brand in cruise travel with a 50-year history of breaking the boundaries of traditional cruising, most notably with the introduction of Freestyle Cruising, which revolutionized the industry by giving guests the freedom and flexibility of a resort style vacation at sea. With unparalleled entertainment and dining choices, the concept is perfect for China's younger cruising demographic.\nFor Chinese guests who are looking for a luxury vacation experience on Norwegian Cruise Line ships, The Haven is an exclusive key-card access only enclave with the line's most well-appointed and spacious accommodations and personalized service, including a private concierge and butler. NCL's award-winning fleet also offers a rich stateroom mix, from studios to private suite complexes that are particularly well-suited to China's multi-generational family vacations.\nNorwegian Cruise Line delivers world-class experiences to its guests in an array of destinations in Europe , the Caribbean , and the U.S., including Alaska and Hawaii . New cruise itineraries are further proof of the company's international expansion. In fall 2016, NCL will cruise to China for the first time since 2002, with the recently renovated Norwegian Star sailing to the region for several unique routes appealing to the brand's loyal guests who wish to explore new parts of the world. Ports of call include Sanya and Hong Kong .\nOceania Cruises is the market leader in the upper-premium cruise segment. It offers guests gourmet culinary experiences, elegant and spacious accommodations, a casual dress environment and personalized service. Oceania's five ships offer destination-oriented cruise vacations to more than 330 ports around the globe. Itineraries to China have been sailed by Oceania Cruises for decades. Oceania Insignia and Oceania Nautica will visit Sanya, Hong Kong , Xiamen , Shanghai , and Tianjin in 2016.\nRegent Seven Seas Cruises is the market leader in the luxury cruise segment and operates three award-winning, all-suite ships. The line's fares include all-suite accommodations, round-trip air*, highly personalized service, acclaimed cuisine, fine wines and spirits, sightseeing excursions in every port, gratuities, and a pre-cruise luxury hotel package and complimentary Wi-Fi for those guests staying in concierge and higher suites. Three award-winning, all-suite vessels, Seven Seas Navigator, Seven Seas Mariner, and Seven Seas Navigator, are among the most spacious at sea and visit nearly 350 destinations around the globe. In July 2016 , the line will introduce the most luxurious ship ever built with the 750-guest Seven Seas Explorer.\n*In select markets\nPhoto - http://photos.prnewswire.com/prnh/20151011/275933\nPhoto - http://photos.prnewswire.com/prnh/20151011/275934\nLogo - http://photos.prnewswire.com/prnh/20150803/254188LOGO\n releases/norwegian-cruise-line-announces-its-entry-to-the-china-cruise-market-300157694.html\n ", "external_links": ["http://photos.prnewswire.com/prnvar/20150803/254188LOGO", "http://www.prnewswire.com/news-releases/norwegian-cruise-line-announces-its-entry-to-the-china-cruise-market-300157694.html", "http://photos.prnewswire.com/prnh/20150803/254188LOGO", "http://www.xmlnews.org/ns/", "http://www.ncl.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL25377&Transmission_Id=201510120615PR_NEWS_USPR_____FL25377&DateId=20151012", "https://photos.prnewswire.com/prnvar/20151011/275933", "http://photos.prnewswire.com/prnh/20151011/275933", "https://photos.prnewswire.com/prnvar/20151011/275934", "http://www.goncl.cn/", "http://photos.prnewswire.com/prnh/20151011/275934"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T14:11:57.073+03:00", "highlightTitle": ""}