{"organizations": [], "uuid": "22ff44dfceb7739772673575c03cd638da08c2ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://247PRESS.images.worldnow.com/images/8971379_G.jpg", "site_section": "http://www.cbs8.com/category/278882/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30213241/hilton-garden-inn-columbia-sc-northeast-offers-affordable-lodging-for-university-of-south-carolina-homecoming", "country": "US", "title": "Hilton Garden Inn Columbia SC Northeast Offers Affordable Lodging for University of South Carolina Homecoming", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hilton Garden Inn Columbia SC Northeast Offers Affordable Lodging for University of South Carolina Homecoming - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:53:00.000+03:00", "replies_count": 0, "uuid": "22ff44dfceb7739772673575c03cd638da08c2ce"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30213241/hilton-garden-inn-columbia-sc-northeast-offers-affordable-lodging-for-university-of-south-carolina-homecoming", "ord_in_thread": 0, "title": "Hilton Garden Inn Columbia SC Northeast Offers Affordable Lodging for University of South Carolina Homecoming", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hilton Garden Inn Columbia Northeast offers affordable lodging for the University of South Carolina Homecoming Weekend October 16-18, 2015.\n COLUMBIA, SC, October 08, The Hilton Garden Inn Northeast in Columbia, South Carolina offers affordable lodging for the University of South Carolina Homecoming Weekend on October 16-18. Festivities will include class reunions, an Alumni Welcome Party, Homecoming Street Party, and tailgating. South Carolina will play SEC rival Vanderbilt on Saturday, October 17 at 4pm.\n\"We are happy to welcome University of South Carolina alumni and football fans for Homecoming Weekend,\" comments Amber Cobia, Director of Sales at the Hilton Garden Inn Columbia Northeast. \"Our hotel provides a quiet location just a few minutes away from all the Homecoming excitement,\" explains Ms. Cobia.\nThis Columbia SC hotel received the 2015 Hotel Success Award, the highest accolade for the Hilton Garden Inn brand. Contemporary non-smoking guest rooms and suites feature a microwave, refrigerator, and free high speed Internet. Travelers will rest comfortably on Garden Sleep System adjustable beds. The property's fitness center and heated indoor pool provide opportunities to exercise year round. Other amenities include a 24-hour business center and Pavilion Pantry Market for snacks. The Hilton Garden Inn's restaurant, Garden Grille and Bar, is open for breakfast, dinner, and evening room service.\nCurrent lodging specials include the Bed N' Breakfast Deal, with cooked to order breakfast for four, and the 2X Points Package for Hilton Honors members. AAA, senior, and military discounts are available. This Columbia South Carolina hotel is located off I-77 at Exit 19 (Farrow Road).\nFor additional information about Homecoming Weekend, visit www.sa.sc.edu/homecoming/ . To book your stay at the Hilton Garden Inn Columbia Northeast, call 803-807-9000 or visit online at www.ColumbiaSouthCarolinaHotel.com .\nAbout Hilton Garden Inn Columbia SC Hotel (Northeast)\nThe recently opened Hilton Garden Inn Columbia/Northeast hotel is located just off I-77 at exit 19, near the Northeast business district and is conveniently situated just 11 miles from downtown Columbia. This Columbia, South Carolina hotel was built with features and amenities to ensure you'll truly have a great stay with us including complimentary Wi-Fi, 24-hour business center, meeting space, heated indoor pool with hot tub, and The Garden Grill and Bar restaurant. Guests can enjoy staying at The Hilton Garden Inn Columbia SC hotel, where everything is right where you need it.\nFor more information visit: http://www.ColumbiaSouthCarolinaHotel.com\nFor all media inquiries, please contact:\nAllison Reinert\nCardinal Web Solutions\nhttp://www.CardinalWebSolutions.com\n release/hilton-garden-inn-columbia-sc-northeast-offers-affordable-lodging-for-university-of-south-carolina-homecoming-413872.php", "external_links": ["http://www.sa.sc.edu/homecoming/", "http://purl.org/rss/1.0/modules/content/", "http://hiltongardeninn3.hilton.com/en/hotels/south-carolina/hilton-garden-inn-columbia-northeast-CAENOGI/index.html", "http://www.24-7pressrelease.com/press-release/hilton-garden-inn-columbia-sc-northeast-offers-affordable-lodging-for-university-of-south-carolina-homecoming-413872.php"], "published": "2015-10-08T11:53:00.000+03:00", "crawled": "2015-10-08T15:09:57.707+03:00", "highlightTitle": ""}