{"organizations": [], "uuid": "f9fe3cd76eb0546eda3152b1825d5d48b5e08bc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/10/151003TPPProtest-700x475.jpg", "site_section": "http://www.ticotimes.net/categories/topics/politics", "section_title": "Politics Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/10/03/trans-pacific-partnership-negotiators-push-hard-for-deal", "country": "US", "title": "Trans-Pacific Partnership negotiators push hard for deal", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Trans-Pacific Partnership negotiators push hard for deal -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T04:09:00.000+03:00", "replies_count": 0, "uuid": "f9fe3cd76eb0546eda3152b1825d5d48b5e08bc5"}, "author": "Paul Handley | AFP", "url": "http://www.ticotimes.net/2015/10/03/trans-pacific-partnership-negotiators-push-hard-for-deal", "ord_in_thread": 0, "title": "Trans-Pacific Partnership negotiators push hard for deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA, Georgia – Officials from 12 countries including the United States, Japan and Australia appeared close to a deal on an ambitious Pacific Rim trade pact Saturday as negotiations went into the second day of overtime.\nLate Friday officials said an agreement on the Trans-Pacific Partnership was within reach, though it was not clear if the final grudging issues of protections for certain drug patents, and lowered trade barriers on auto parts and dairy products, were fully resolved.\nPressure was intense on negotiators, especially those from Australia, Canada, Japan, New Zealand and the United States, not to undercut important home industries as they bargain over the remaining unresolved points of the broad-ranging treaty.\nThe auto and dairy trade issues were still apparently on the table late Friday.\nBut the main barrier to a final deal was the length of intellectual property (IP) protection for biologics, a promising class of treatments derived from living materials.\nThe United States is seeking longer protections than the five years common in many countries.\nIn the United States, pharmaceutical companies get 12 years of IP protection before rivals can produce “biosimilar” copycat drugs that sell more cheaply. But in most countries, the U.S. protections for drug developers are seen as far too long, and costly, for health care systems.\nThe issue has raised objections from civil society groups and government health programs across many of the countries involved in the negotiations.\nRather than a problem of just cutting tariffs or other trade barriers, lengthening protections could in many places require changing well-established national laws and IP protection policies.\nAccording to one source informed on the progress of the talks, strong resistance to Washington’s stance was coming from Australia, Chile and Peru.\nRelated: Let’s see a Trans-Pacific Partnership that respects workers’ right\nProtesters call for the rejection of the Trans-Pacific Partnership trade deal under negotiation in Atlanta, Georgia, on Oct. 1, 2015.\nPaul Handley/AFP\nPressure to finish deal The talks between top trade officials in Atlanta have gone well past the original Thursday deadline.\nA number of trade ministers in the group had their eyes on their travel schedule: the G-20 group of leading economies is holding a meeting of trade ministers on Monday and Tuesday in Istanbul.\nThe arrival of officials from the U.S. Congress at the hotel venue for the TPP talks on Friday also suggested that an agreement was in the air.\nTheir presence though underscored the stakes in the U.S.-led effort to create the world’s largest trade and investment zone that would comprise 40 percent of the global economy.\nTrade ministers had entered this week’s TPP negotiations under pressure to strike a final deal, after their talks in Hawaii two months ago failed.\nThey have already addressed many other issues, including some other industrial and agricultural trade areas, competition with state enterprises, digital economy protections and investment-dispute mechanisms.\nBut the details of many of those specific TPP chapters remain secret to the public, with the idea that negotiators will produce a complete, unalterable final document for their governments or legislatures to ratify on an up-or-down basis, with no room left to negotiate.\nStill undecided in the TPP talks is how much Canada’s dairy market will be opened to products from Australia and New Zealand, and how much the U.S. auto market, which currently favors parts and cars built in Canada and Mexico, is opened up to Japanese parts and autos made in other countries.\nThat explained why Michigan Congressman Sandy Levin, whose district includes major auto plants, and aides of Congressman Paul Ryan, of a dairy-heavy Wisconsin district, were in Atlanta, to ensure that the final deal is acceptable for Congress’s ratification.\nBut similar pressure arose from Canada, where the trade treaty is an issue in the Oct. 19 national elections.\nThe leader of the New Democratic Party, which until recently was leading the polls, declared Friday that they would not feel bound to back the TPP treaty negotiated by the current Conservative government of Prime Minister Stephen Harper.", "external_links": ["https://ustr.gov/tpp", "http://www.cbc.ca/news/politics/harper-trans-pacific-partnership-1.3255564", "http://www.businessinsider.com/r-exclusive-tpp-would-include-auto-market-opening-for-japan---source-2015-10"], "published": "2015-10-04T04:09:00.000+03:00", "crawled": "2015-10-04T03:02:15.314+03:00", "highlightTitle": ""}