{"organizations": [], "uuid": "4a5d30a1d5cb4b8e34a5a2e5e0be4cbb1e5e684e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vvdailypress.com", "main_image": "http://www.vvdailypress.com/storyimage/VV/20151023/NEWS/151029859/AR/0/AR-151029859.jpg", "site_section": "http://www.vvdailypress.com/entertainment/travel?template=rss&mime=xml", "section_title": "TRAVEL - VVdailypress.com", "url": "http://www.vvdailypress.com/article/20151023/NEWS/151029859/13007/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Trip sparks Cajon Pass comparisons", "performance_score": 0, "site": "vvdailypress.com", "participants_count": 1, "title_full": "Trip sparks Cajon Pass comparisons", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:33:00.000+03:00", "replies_count": 0, "uuid": "4a5d30a1d5cb4b8e34a5a2e5e0be4cbb1e5e684e"}, "author": "Steve Hunt Editor", "url": "http://www.vvdailypress.com/article/20151023/NEWS/151029859/13007/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Trip sparks Cajon Pass comparisons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trip sparks Cajon Pass comparisons Comment Posted Oct. 23, 2015 at 4:33 PM By Steve Hunt Posted Oct. 23, 2015 at 4:33 PM » Social News I had a chance to take a vacation to the mountains of Colorado recently, which is why this column took a break for a couple of weeks. It was a great trip, accomplished by heading north on Interstate 15 to Interstate 70 and then taking it east to Highway 82 in Colorado. There is some beautiful country along the way, both in Utah and Colorado, much of it in parts of the country we had never seen before. As I was driving, I thought often of the Cajon Pass, because on I-70 we came upon three segments where the grades were 5 or 6 percent. It was very reminiscent of the Cajon Pass, only at much higher elevation, in the 7,000- to 8,000-foot range. I am always amazed at how much of the West is still uninhabited. At the same time, I want it to stay that way, as it is so beautiful, particularly along I-70 in Utah and Colorado. For much of our considerable time on I-70, we were virtually alone on the highway. Coming home, I probably didn't count more than 20 other cars or trucks ahead or behind us the whole day. It was surreal, and actually a little unnerving. There is one stretch of I-70 where there are no services of any kind — restaurants, gas stations, you name it — for more than 100 miles. I'm not even sure if there is cellphone service. I made sure we had plenty of gas, water and even a little food before we hit that stretch. The contrast to Southern California and the Cajon Pass, of course, was amazing. Here, it is nonstop traffic it seems. We went down the hill last Saturday and drove to Anaheim Hills and couldn't believe the traffic on the 57 Freeway both going and coming. You would have thought it was rush hour during the week. We've noticed just about every time we go into Los Angeles County now, even on the weekend, that you can count on lots of traffic and reduced speeds. There seems to be no good time to travel anymore. I can't imagine how bad it must be for Cajon Pass commuters anymore, but would welcome your emails to let me know. When I started this column a year and a half ago, I wasn't sure I would have enough material to make it through a year. Thanks to the construction work on Interstate 15 in the Cajon Pass, I have. But as the construction winds down I sense the days of this column may be numbered, for me anyway. If I were still making the daily commute to West Covina it might be one thing. I'd no doubt have plenty of day-to-day observations to share. But I pretty much only go down the hill on weekends now, and not even every weekend. So if any of you true Cajon Pass commuters has a knack for writing and might want to take over this column early next year, call or email me and send me some writing samples. I know there is a lot of interest in this column, so I don't want to just end it. But by the same token, I'm not sure how much more I can share and still keep it interesting. I would be happy to pass the torch to a true Cajon Pass commuter — or even a few of them — if there is interest. — Music to drive by : In honor of Bob Seger's latest tour, and in celebration of \"Night Moves\" going Gold 39 years ago, this week's musical recommendation for stressed out Cajon Pass commuters is that album by one of my favorite artists. The story behind the song \"Night Moves\" is fascinating, if Wikipedia is to be believed. Seger was said to have been inspired by George Lucas' film \"American Graffiti,\" so he penned this largely autobiographical tune about a girl he had dated in Michigan when he was 19. Seger supposedly took six months to finish the song, writing some of it at an A&W Root Beer restaurant, according to the Detroit News. Although he had already recorded and released a great live album, \"Live Bullet,\" the success of \"Night Moves\" made him a true rock star. As good as the title track is, probably my favorite song on the album is \"Main Street,\" although \"Rock and Roll Never Forgets\" also is a classic. There were only nine songs on the album, released on Capitol Records on Oct. 22, 1976, but they are all good. Though this album is a bit more uptempo than most I recommend — it is rock, after all — I still think it will help Cajon Pass commuters unwind after a hard day on the road. Seger knew all about hard days on the road, of course. One of my favorite Seger songs is \"Turn the Page.\" Though not on \"Night Moves,\" consider that a bonus track for you this week. Whether you're a trucker hauling a load cross country or just coming home to the High Desert, you will enjoy this mellow masterpiece. Steve Hunt can be reached at 760-951-6270 or at SHunt@VVDailyPress.com. Follow him on Twitter at @stevehunteditor. By Steve Hunt", "external_links": [], "published": "2015-10-24T00:33:00.000+03:00", "crawled": "2015-10-24T16:20:52.520+03:00", "highlightTitle": ""}