{"organizations": [], "uuid": "77d1f43c25bdc7cb1b95a9ea2faa893b46b46318", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/police-museums-and-abandoned-train-tracks-paris-at-its-best.html", "country": "US", "title": "Police Museums and Abandoned Train Tracks: Paris at its Best", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Police Museums and Abandoned Train Tracks: Paris at its Best", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T08:40:00.000+03:00", "replies_count": 0, "uuid": "77d1f43c25bdc7cb1b95a9ea2faa893b46b46318"}, "author": "Lisa Jeeves-2015-10-23T06:40:55-0400", "url": "http://www.articlesfactory.com/articles/travel/police-museums-and-abandoned-train-tracks-paris-at-its-best.html", "ord_in_thread": 0, "title": "Police Museums and Abandoned Train Tracks: Paris at its Best", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | October 23, 2015 \nOnce you've arranged a Charles de Gaulle airport shuttle to your hotel, it’s time to start deciding on attractions. Here are two unusual ones to start with. \nTravelling to Paris from the UK is a pretty straightforward and relaxed affair. If you live near London and would rather not fly, the Eurostar will take you straight from King’s Cross St. Pancras to the famous Gare du Nord, in the centre of Paris.On the other hand, if flying is convenient for you, you can get some very cheap flights to Charles de Gaulle airport. Shuttle transport from the airport to your accommodation is super easy to book and will take you straight to your hotel. Once you've settled in and recharged your batteries, get ready to explore these two very unusual attractions!La Petite Ceinture: The Train Tracks Less Travelled This abandoned railway, known as 'The Little Belt', in English, was built over 150 years ago right in the centre of Paris. Encircling the Boulevards des Maréchaux and the city’s walls as they stood at the time of Napoleon III’s reign, this beautiful infrastructure is one of Paris’s best lesser-known treasures.Undulating from street level to deep within the French capital’s underbelly, La Petite Ceinture has preserved 17 of its original 29 stations. Building started in 1851 and, eventually, the railway became an indispensable structure that helped transport goods from depot yards into the city’s core. It grew into a vital passenger service, which remained its main purpose until its closure to the public in 1934, due to the development of the Métro. After its final cargo shipment in 1993, La Petite Ceinture was wholly abandoned.If you're looking for a thrilling urban exploration during your stay in Paris, make sure to do some thorough research on this predecessor to the Métro. Take a leap of faith and follow the tracks wherever they may take you.Le Musée de la Préfecture de Police: A Tour of Crime and Its FoeIf you are not feeling up to doing the iconic 'touristy' things Paris has on offer right after your Charles de Gaulle airport shuttle has dropped you off, but you don’t want to waste the rest of the day in the hotel room either, this little museum explaining the history of the French police is a marvellous compromise.Located on the second floor of the fully functioning police station of the 5th arrondissement, it may be slightly intimidating queuing at the reception booth to ask to be let in to the museum while locals go about their police-related business. Nevertheless, if you have even a basic knowledge of French and an interest in criminology, this exhibition is well worth a visit.Starting in the early 17th century and covering hundreds of years' history up to the Nazi occupation, the museum showcases plenty of intriguing artefacts. These include a section on the Anarchist bombings of the last decade of the 19th century; the original prison register where Ravaillac, Henri IV’s assassin, was logged into custody; the automatic pistol used to murder President Doumer in 1932; a slightly intimidating collection of murder weapons, including knives and ice-picks; and, last but not least, a working guillotine.Paris Is Full of Hidden Gems Like These - Go Explore!These are just two examples of the wonderfully niche but fascinating attractions the City of Lights hides beneath the surface. Although visiting the main attractions is still important, of course, there is an electrifying delight in discovering a tiny piece of history that many would overlook.Getting ThereThere are plenty of cheap trains and flights into Paris from anywhere in Europe. The former will leave you at the Gare du Nord, from where you can catch Métro or a taxi to your final destination; the latter will most likely have you land at Charles de Gaulle, airport. Shuttle transport can be pre-booked and is the most hassle free way to get in to the city. Planning the logistics of your trip is important, but make sure in the organisation of your itinerary you don't overlook how many hidden gems this wonderful city has to discover. Source: Free Articles from ArticlesFactory.com ABOUT THE AUTHOR \nLukas Johannes is a driver for Shuttle Direct. If you’re looking for a Charles de Gaulle airport shuttle , Shuttle Direct provide pre-booked shuttles to major destinations all over Europe. Wherever you travel, Shuttle Direct can make sure that you don’t miss your car on your holiday abroad.", "external_links": [], "published": "2015-10-23T08:40:00.000+03:00", "crawled": "2015-10-24T00:46:44.686+03:00", "highlightTitle": ""}