{"organizations": [], "uuid": "4ce63a611fddb1114fa85d23b6211ff6aea81425", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30208089/5-million-room-renovation-creates-a-new-desert-oasis-at-courtyard-scottsdale-old-town", "country": "US", "title": "$5 Million Room Renovation Creates A New Desert Oasis At Courtyard Scottsdale Old Town", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "$5 Million Room Renovation Creates A New Desert Oasis At Courtyard Scottsdale Old Town - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "4ce63a611fddb1114fa85d23b6211ff6aea81425"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30208089/5-million-room-renovation-creates-a-new-desert-oasis-at-courtyard-scottsdale-old-town", "ord_in_thread": 0, "title": "$5 Million Room Renovation Creates A New Desert Oasis At Courtyard Scottsdale Old Town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Courtyard Scottsdale Old Town\nHotel in Old Town Scottsdale updates accommodations with modern decor, new beds, upgraded high-speed Internet access\nSCOTTSDALE, Ariz. , Oct. 7, 2015 /PRNewswire/ -- Celebrating the renovation of its guest rooms, Courtyard Scottsdale Old Town invites guests to depart for the desert and experience a new level of hospitality in the heart of Arizona .\nThe $5 million facelift to the South Scottsdale hotel's guest rooms and suites now complements its premier location, first-rate services, modern amenities and high-tech event spaces.\nGuests will feel right at home in spacious rooms with areas for living, working and sleeping in style. Sophisticated tone-on-tone decor gives each space a tranquil feel, while color accents add a pop of inspiration. From carpet and wall fixtures to wall art and vinyl, everything is new. Other updated amenities include residential-style TV cabinets, refrigerators, bed frames and mattresses, integrated lighting, upgraded high-speed wireless Internet access and complete bathroom improvements.\nIn addition to the fresh features, each guest room boasts plush bedding and flat-panel TVs with premium movie and cable channels. Business travelers will appreciate large work desks with ergonomic chairs as well as complimentary Wi-Fi that makes it simple to stay connected 24/7 to friends, family and colleagues while on the road.\nThe hotel's ideal location positions guests near upscale shopping, delightful dining and endless entertainment. Located near Scottsdale Fashion Square, Arizona's largest shopping mall, the hotel offers a chance to experience an unmatched retail experience in the American Southwest. Other nearby attractions include Scottsdale Stadium, the Spring Training home of the San Francisco Giants; US Airways Center; Chase Field ; the Phoenix Zoo and the Desert Botanical Gardens. Additionally, just minutes away are historic shops, eateries, sites and art displays in Scottsdale's Old Town. Visitors can hop on a chauffeured golf cart or downtown trolley by day and ride people-powered pedicabs by night for a unique experience.\nWhen not exploring the surrounding area or getting down to work at local businesses, visitors can spend time at the hotel's outdoor heated pool, state-of-the-art fitness center, cozy courtyard terrace or modern lobby area. Featuring Courtyard's signature restaurant, The Bistro – Eat. Drink. Connect. , the lobby is an ideal place for gathering with friends or colleagues during downtime. Start the day with a balanced meal and specialty Starbucks beverage and return at night to enjoy a wide selection of flatbreads, soups, salads and starters. Top off the meal with a refreshing cocktail, or choose from the beer and wine menu.\nAbout Courtyard Scottsdale Old Town\nCourtyard Scottsdale Old Town at 3311 N. Scottsdale Road in Scottsdale, AZ is near downtown, US Airways Center, Chase Field and other top desert attractions. The hotel features 5 floors with 180 renovated rooms and suites, 4 meeting rooms totaling 2,200 square feet of event space, an on-site bistro, outdoor pool and state-of-the-art fitness center. For information, visit www.marriott.com/PHXSC , call 1-480-429-7785 and visit the hotel's Facebook page.\nJoin Marriott Rewards now and earn points that can be redeemed for free hotel stays and room upgrades at 3,800 hotels in over 70 countries.\nLearn more about Courtyard and Marriott International Inc.\nPRESS CONTACT\nLisa Moore\n1-813-995-5752\nlisa.moore@marriott.com\nPhoto - http://photos.prnewswire.com/prnh/20151006/274610\n releases/5-million-room-renovation-creates-a-new-desert-oasis-at-courtyard-scottsdale-old-town-300155633.html\n ", "external_links": ["http://www.marriott.com/hotels/hotel-rooms/phxsc-courtyard-scottsdale-old-town/", "https://photos.prnewswire.com/prnvar/20151006/274610", "http://www.marriott.com/rewards/rewards-program.mi", "http://www.marriott.com/corporateinfo/boilerplate.mi", "https://www.facebook.com/CourtyardScottsdaleOldTown", "http://www.marriott.com/hotels/travel/phxsc-courtyard-scottsdale-old-town/", "http://photos.prnewswire.com/prnh/20151006/274610", "http://www.courtyard.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG21545&Transmission_Id=201510071222PR_NEWS_USPR_____CG21545&DateId=20151007", "http://www.xmlnews.org/ns/", "http://www.marriott.com/hotels/fact-sheet/travel/phxsc-courtyard-scottsdale-old-town/", "http://www.marriott.com/hotels/hotel-information/restaurant/phxsc-courtyard-scottsdale-old-town/", "http://www.prnewswire.com/news-releases/5-million-room-renovation-creates-a-new-desert-oasis-at-courtyard-scottsdale-old-town-300155633.html", "http://www.marriott.com/hotels/local-things-to-do/phxsc-courtyard-scottsdale-old-town/"], "published": "2015-10-07T03:00:00.000+03:00", "crawled": "2015-10-08T02:46:38.228+03:00", "highlightTitle": ""}