{"organizations": [], "uuid": "c1efbc2b0ce66ef7694b8043de1fd2eb9b217eff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-5ddb122fb4c425bfcae60ea504a5e778.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/pharmacies-skirt-regs-to-compete-against-high-prices/article/2574837?custom_click=rss", "country": "US", "title": "Pharmacies skirt regs to compete against high prices", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Pharmacies skirt regs to compete against high prices | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:01:00.000+02:00", "replies_count": 0, "uuid": "c1efbc2b0ce66ef7694b8043de1fd2eb9b217eff"}, "author": "Robert King", "url": "http://www.washingtonexaminer.com/pharmacies-skirt-regs-to-compete-against-high-prices/article/2574837?custom_click=rss", "ord_in_thread": 0, "title": "Pharmacies skirt regs to compete against high prices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With anger over rising generic drug prices reaching a fever pitch, some pharmacies are taking advantage of a lax regulatory process to step in.\nCompounding pharmacies can offer an alternative to a high-priced drug without having to go through the federal approval process like pharmaceutical companies. That is what small California-based Imprimis Pharmaceuticals is doing to compete with the anti-parasite drug Daraprim whose price has soared.\nDaraprim's maker, Turing Pharmaceuticals, jacked up the price of the treatment from $13.50 a pill to $750. The drug maker isn't the only company to adopt this strategy, as several other manufacturers have raised prices on older generic drugs that don't have any competition.\n  Hillary: 'I'm just getting warmed up' \n \nBy Curt Mills • 10/25/15 12:10 AM Related Story: http://www.washingtonexaminer.com/article/2574118/ In response, Imprimis said Thursday it would make a formulation of Daraprim for $1 a pill, or $99 for a 100-count bottle. The head of the small company previously adopted a similar strategy for eye medications and said other pharmacies could step in.\n\"This is just the tip of the iceberg,\" CEO Mark Baum said.\nBaum said he has seen an unprecedented response to the news of the Daraprim alternative, but declined to say how many orders he has received. Daraprim has a small market, with only about 10,000 prescriptions.\nSo how exactly can a formulation of Daraprim get approved without the Food and Drug Administration's say-so?\nImprimis is not a drug maker. It is a compounding pharmacy, which makes a custom preparation of a drug based on a doctor's prescription and is tailored to the patient's needs.\nAlso from the Washington Examiner Press takes Planned Parenthood's word videos were 'edited' Many reporters claim that the tapes have been deceptively edited, but few have admitted to watching them.\nBy Becket Adams • 10/25/15 12:01 AM For example, a compounding pharmacy could offer a preparation of a drug for a different strength than one offered by the manufacturer.\nIt is illegal for a compounding pharmacy to make an exact copy of a brand name or generic drug, both of which require FDA approval. However, the formulation by Imprimis is not an exact copy.\nDaraprim has an active ingredient called pyrimethamine, but the formulation Imprimis is offering also has leucovorin, which can prevent bone marrow loss that occurs from the treatment. Currently leucovorin is prescribed separately.\nBy adding that second ingredient, Imprimis can bypass the FDA prohibition on copying a commercial drug, Baum said.\nCompounding pharmacies are traditionally overseen by the states, but the federal government regulates some of them.\nAlso from the Washington Examiner Meet the three Republicans likely to vie for Ryan's Ways and Means gavel Pat Tiberi of Ohio, Kevin Brady of Texas and Devin Nunes of California are all running for the position.\nBy Joseph Lawler • 10/25/15 12:01 AM A 2013 law boosted the FDA's power to regulate a pharmacy that makes a batch of custom drugs without a prescription. The impetus for the law was tainted drugs from a Massachusetts pharmacy that ended up killing more than 60 people.\nBut after intense lobbying from the compounding pharmacy industry, Congress decided to make the new FDA program voluntary. A compounding pharmacy that makes drugs without a prescription can sign up for federal oversight.\nSuch a company would be inspected by the FDA and have to report safety incidents surrounding its products, which aren't required now. Such pharmacies are traditionally inspected by states but don't have to meet the FDA's strict manufacturing standards.\nThe idea behind the voluntary scheme was to create a market where hospitals would flock to FDA-registered compounding pharmacies to do business, hence enticing other pharmacies to volunteer.\nNot surprisingly, greater federal oversight hasn't been popular with the industry.\nSince November 2013, 56 pharmacy facilities had volunteered as of Oct. 16 for agency oversight, according to the FDA's website. The agency doesn't have an exact number of the large pharmacies that make drugs without a prescription, but officials previously estimated it is in the thousands.\nImprimis has not volunteered for agency oversight. Baum said the company is building a facility in New Jersey that would apply for it.\nAlso, Imprimis does not provide a batch of the Daraprim formulation. It can only be doled out by a single prescription.\nThe company's website says it follows voluntary manufacturing standards from the U.S. Pharmacopeia, a respected nonprofit that sets standards for all kinds of medicines, food ingredients and dietary supplements.\nThis isn't the first time a compounding pharmacy has stepped in to undercut a drug maker.\nIn 2011, KV Pharmaceuticals received FDA approval for the drug Makena to reduce the risk of pre-term birth. It subsequently raised the price of the drug, which prompted compounders to offer a cheaper version.\nKV lowered the price of the drug and demanded the agency take action against the pharmacies but the FDA declined, saying it wanted to ensure continued access for patients, according to an investor report from Amag Pharmaceuticals, which acquired KV.\nKV Pharmaceuticals eventually changed its name to Lumara Health and was bought last November by Amag.\nDespite the competition from compounders, the company still makes a hefty profit from Makena. The drug generated $63 million in sales in the second quarter of this year, and Amag plans to get $285 million by the end of the year, according to the company's latest financial report.\nTop Story Trump: I tried to tell Carson about his Iowa lead 'but he was sleeping'   while Trump lagged behind.\nBy Gabby Morrongiello • 10/24/15 1:10 PM", "external_links": [], "published": "2015-10-25T02:01:00.000+02:00", "crawled": "2015-10-25T11:30:04.600+02:00", "highlightTitle": ""}