{"organizations": [], "uuid": "a148154a0525edb98f41a05741c04f21cab3e5fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-ac6a84b0864092fcedb4790efad69bd5.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/critics-obamas-new-syria-plan-still-a-misfire/article/2573828?custom_click=rss", "country": "US", "title": "Critics: Obama's new Syria plan still a misfire", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Critics: Obama's new Syria plan still a misfire | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:01:00.000+03:00", "replies_count": 0, "uuid": "a148154a0525edb98f41a05741c04f21cab3e5fd"}, "author": "Charles Hoskinson", "url": "http://www.washingtonexaminer.com/critics-obamas-new-syria-plan-still-a-misfire/article/2573828?custom_click=rss", "ord_in_thread": 0, "title": "Critics: Obama's new Syria plan still a misfire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Obama administration's tweaks to its program to aid Syrian rebels has disappointed those who hoped the initiative's shortcomings would lead to a broader strategic reassessment in which U.S. military power would also be directed against President Bashar al-Assad.\nLawmakers have been pressing President Obama for an urgent change in policy in the wake of Russia's intervention in Syria on behalf of Assad, including attacks by Russian aircraft and sea-based cruise missiles against U.S.-supported rebels that also have forced U.S. planes attacking the Islamic State to change their flight paths to avoid getting too close to Russian planes.\nBut the White House has chosen only to chastise Russian President Vladimir Putin for his strategic \"mistake,\" and is focused on trying to persuade the Kremlin to help peacefully ease Assad out of power. Though U.S. forces have conducted a year-long bombing campaign against the Islamic State, Obama has consistently refused to use force against Assad and has dismissed the idea that Putin has outmaneuvered the United States in Syria.\nIn an interview with \"60 Minutes\" set to air Sunday night, Obama reacted derisively when asked if Putin was challenging U.S. global leadership\n  Obama: Yes to pot, no to oil The administration makes it easier to grow marijuana on Indian lands than to produce oil and gas.\nBy John Siciliano • 10/10/15 12:01 AM \"In what way? Let's think about this.\" he said. \"If you think that running your economy into the ground and having to send troops in in order to prop up your only ally, then we've got a different definition of leadership.\"\nIn a conference call with reporters Friday, White House adviser Ben Rhodes repeated the administration's contention that there is no military solution to the four-year-old civil war against Assad's dictatorship.\n\"We didn't expect then and don't expect now that you can end the conflict in Syria through support for an opposition group,\" he said.\nThe $500 million train-and-equip program for moderate Syrian rebels, which has trained only about 100 of an expected 5,400 fighters, will be redirected toward aiding existing rebel leaders with weapons, equipment and air support.\nThough Pentagon officials admitted that the program had been undermined by Washington's unwillingness to aid groups that wanted to go after Assad, the White House continued to insist it would be open only to groups fighting the Islamic State.\nAlso from the Washington Examiner 'Disgrace': NY Times story on Jewish temples irks press Story asks whether two ancient temples ever actually stood at Jerusalem's holiest site, the Temple Mount.\nBy Becket Adams • 10/10/15 12:01 AM The changes announced Friday were in response to pressure from lawmakers in both parties stunned by the admission of Central Command chief Gen. Lloyd Austin at a Sept. 18 hearing that only \"four or five\" rebels trained to that point were still fighting. Many declared the program, which had been rushed through Congress late last year in response to Obama's request for quick action, a failure.\nBut the changes don't go nearly as far as many in Congress want.\n\"The Pentagon's revised train and equip program suffers the same fundamental flaw that harmed this effort from the beginning, squandered the chance to make a strategic difference in Syria, and undermined American credibility,\" Senate Armed Services Chairman John McCain, R-Ariz., said Friday.\n\"As President Obama conceded last week, the administration's insistence that U.S.-trained Syrian forces only fight [the Islamic State] — even as the Assad regime has slaughtered over 200,000 Syrians — has made it impossible to generate a viable indigenous ground force in Syria that can produce significant effects on the battlefield. It is inexplicable that the administration acknowledges this problem yet refuses to fix it.\"\nLawmakers from both parties have been pushing the administration to consider setting up a \"safe zone\" inside Syria for civilians that would include using force to prevent attacks against them by Assad's air force and Islamic State terrorists. Though the massive flow of hundreds of thousands of Syrian refugees into Europe has made this concern more urgent, the growing Russian intervention on Assad's behalf is making it significantly more difficult to implement.\nAlso from the Washington Examiner Dems poke fun at Trump with 'America is already great' hats The words are a play off of Trump's oft-repeated \"Make America Great Again\" slogan.\nBy Daniel Chaitin • 10/09/15 10:08 PM \"We need to see the administration take aggressive action to create a safe zone within Syria over which the Assad regime is barred from dropping bombs — this is something I have been pushing for — and which Russian jets cannot violate,\" House Foreign Affairs Chairman Ed Royce, R-Calif., told the Syrian American Medical Society in a speech Friday.\n\"It is time for the administration to stop looking away from Syria as 'someone else's civil war' and instead move decisively, with our regional partners, to give the Syrian people some semblance of safety.\"\nBut in the call with reporters, Rhodes dismissed the idea.\n\"We see significant resourcing challenges associated with focusing on the establishment of a no-fly zone that could take away from the counter-[Islamic State] campaign,\" he said.\nTop Story Obama: Yes to pot, no to oil The administration makes it easier to grow marijuana on Indian lands than to produce oil and gas.\nBy John Siciliano • 10/10/15 12:01 AM", "external_links": [], "published": "2015-10-10T03:01:00.000+03:00", "crawled": "2015-10-10T11:19:26.306+03:00", "highlightTitle": ""}