{"organizations": ["MSNBC", "Mercy Medical Center", "Umpqua Community College"], "uuid": "68b3de7561d774c6abaecf60ee97a68d20fe6861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150921204615-jeb-bush-september-18-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/02/politics/jeb-bush-donald-trump-stuff-happens/index.html?eref=rss_politics", "country": "US", "title": "Bush defends 'stuff happens' remarks, Democrats pounce", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Bush defends 'stuff happens' remarks, Democrats pounce", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T19:30:00.000+03:00", "replies_count": 0, "uuid": "68b3de7561d774c6abaecf60ee97a68d20fe6861"}, "author": "", "url": "http://edition.cnn.com/2015/10/02/politics/jeb-bush-donald-trump-stuff-happens/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Bush defends 'stuff happens' remarks, Democrats pounce", "locations": ["Roseburg", "Oregon", "Washington", "South Carolina", "Stewart Park", "D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hannah Miles", "Jeb Bush", "Allie Brandenburger", "John Hanlin", "Hailey", "Trump", "Donald Trump", "Barack Obama", "Bush", "Gary"], "text": "Jeb Bush defended his \"stuff happens\" comment made in the wake of the Oregon college shooting Democrats were quick to criticize the wording as tone deaf Washington (CNN) Jeb Bush is defending a comment he made Friday afternoon in the wake of the Oregon college shooting, when he said \"stuff happens,\" and argued that officials should fight the impulse to react to tragedies with more government. \"We're in a difficult time in our country and I don't think more government is necessarily the answer to this. I think we need to reconnect ourselves with everybody else. It's very sad to see. I resist the notion,\" Bush said at a campaign stop in South Carolina. \"I had this challenge as governor, 'cause we had, look, stuff happens, there's always a crisis. And the impulse is always to do something and it's not necessarily the right thing to do.\" Democrats were quick to hop on the language as tone deaf, and President Barack Obama indirectly criticized his remarks when asked about it during a White House briefing. 15 photos: Shooting at Oregon community college 15 photos: Shooting at Oregon community college Community members attend a candlelight vigil at Stewart Park for those killed during a shooting at Umpqua Community College in Roseburg, Oregon, on Thursday, October 1. The massacre left nine people dead and nine wounded. The gunman also died. Hide Caption 1 of 15 15 photos: Shooting at Oregon community college In response to the shooting on October 1, President Barack Obama delivers the 15th statement of his presidency addressing gun violence. \"Somehow this has become routine,\" he said. \"The reporting is routine. My response here at this podium ends up being routine, the conversation in the aftermath of it. We've become numb to this.\" Hide Caption 2 of 15 15 photos: Shooting at Oregon community college Students and faculty are reunited with friends and family at the county fairgrounds on October 1. Hide Caption 15 photos: Shooting at Oregon community college People wait for information at the fairgrounds on October 1. Hide Caption 15 photos: Shooting at Oregon community college Hannah Miles, center, is reunited with her sister Hailey and father, Gary, on October 1. Hide Caption 15 photos: Shooting at Oregon community college A student waits to walk off a school bus at the fairgrounds on October 1. Hide Caption 15 photos: Shooting at Oregon community college Friends and family are reunited on October 1. Hide Caption 7 of 15 15 photos: Shooting at Oregon community college A woman is comforted after the deadly shooting at Umpqua Community College in Roseburg, Oregon, on October 1. Douglas County Sheriff John Hanlin announced at a news conference that the shooter was dead. Hide Caption 15 photos: Shooting at Oregon community college Authorities secure the campus after the shooting on October 1. Hide Caption 15 photos: Shooting at Oregon community college Students, staff and faculty leave the school on October 1. Hide Caption 15 photos: Shooting at Oregon community college A bullet casing is marked at the scene of the shooting on October 1. Hide Caption 15 photos: Shooting at Oregon community college People gather at a roadblock near the entrance to the college on October 1. Hide Caption 15 photos: Shooting at Oregon community college Authorities respond after reports of the shooting on October 1. Hide Caption 15 photos: Shooting at Oregon community college Police search students outside the school on October 1. Hide Caption 14 of 15 15 photos: Shooting at Oregon community college A patient is wheeled into the emergency room at Mercy Medical Center in Roseburg on October 1. Hide Caption 15 of 15 \"I don't even think I have to react to that one. I think the American people should hear that and make their own judgments based on the fact that every couple of months we have a mass shooting,\" he said. \"And they can decide if they consider that 'stuff happening.'\" Bush clarified later to reporters that his comment was \"not related to Oregon.\" \"There are all sorts of things that happen in life,\" Bush said. \"Tragedies unfold almost, look, you just read the papers, and you see a child dies in a pool and drowns. And parents want to pass a law to do something, and you got to be careful that you want to solve the problem. If there's a problem, a defect in the law, fine, then we did that all the time, but sometimes you're imposing solutions to problems that doesn't fix the problem and takes away people's liberties and rights, and that's the point I was trying to make.\" GOP candidates: Gun laws won't stop 'crazies' Bush's campaign called the Democratic attacks -- and the media's response \"beyond craven.\" \"It is sad and beyond craven that liberal Democrats, aided and abetted by some in the national media, would dishonestly take Governor Bush's comments out of context in a cheap attempt to advance their political agenda in the wake of a tragedy,\" Bush spokesperson Allie Brandenburger said in a statement. \"Taking shameless advantage of a horrific tragedy is wrong and only serves to prey on people's emotions.\" Oregon shooting shakes D.C., campaign trail The remark was similar to one Donald Trump said earlier that if he became president, he doesn't expect to halt all mass shootings because there will always be people that society can't stop. \"You're going to have these things happen and it's a horrible thing to behold, horrible,\" Trump said on MSNBC's \"Morning Joe.\" \"It's not politically correct to say that, but you're going to have difficulty and that will be for the next million years, there's going to be difficulty and people are going to slip through the cracks,\" Trump added. \"What are you going to do, institutionalize everybody?\"", "external_links": [], "published": "2015-10-03T19:30:00.000+03:00", "crawled": "2015-10-03T20:55:54.136+03:00", "highlightTitle": ""}