{"organizations": [], "uuid": "ed8ebfbaef4d6894d175f1c0aa4600e19f5c3d8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/49/0edbfeb9d9e7422a0b0f7a9aae88e2/media:d0ee7260ff4e400591b195196c1b9b0dObama.JPEG", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/politics/articles/2015/10/08/obama-touts-immigration-reform-in-speech-to-hispanic-leaders", "country": "US", "title": "Obama touts immigration reform in speech to Hispanic leaders", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Obama touts immigration reform in speech to Hispanic leaders - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ed8ebfbaef4d6894d175f1c0aa4600e19f5c3d8f"}, "author": "USNews", "url": "http://www.usnews.com/news/politics/articles/2015/10/08/obama-touts-immigration-reform-in-speech-to-hispanic-leaders", "ord_in_thread": 0, "title": "Obama touts immigration reform in speech to Hispanic leaders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama cites differences with GOP on immigration in speech to Hispanic leaders President Barack Obama speaks at the Congressional Hispanic Caucus Institute’s (CHCI) 38th Anniversary awards gala in Washington, Thursday, Oct. 8, 2015. The gala is the signature event in its Hispanic Heritage Month list of events that include the Public Policy Conference. (AP Photo/Susan Walsh)\nAssociated Press Oct. 8, 2015 | 9:40 p.m. EDT + More By KEVIN FREKING, Associated Press\nWASHINGTON (AP) — President Barack Obama promised Hispanic leaders on Thursday he'll continue to champion a comprehensive change to the nation's immigration laws and said America's greatness comes from building opportunities, not walls.\nWhile prospects for an immigration overhaul are negligible during the remainder of his presidency, Obama used the speech to highlight differences with several of the Republican presidential candidates on the issue, which will help define the 2016 elections.\nObama said he wishes GOP lawmakers had followed the lead of former President George W. Bush when he sought changes that would have provided legal status and a path to citizenship for undocumented immigrants. He noted that Bush had said that uniting the country cannot be done by inciting people to anger.\n\"Think how much better our economy would be if the rest of his party got the message,\" Obama told about 2,000 people during an awards dinner for the Congressional Hispanic Caucus Institute, which seeks to open the halls of Congress to more Latinos.\nObama said he believes in changes in the law that would allow people here illegally to pay a fine, pay their fair share of taxes and then \"go to the back of the line\" before they earn citizenship. He contrasted that message to some GOP candidates calling for more walls on the U.S. border with Mexico.\n\"You can't just feed on fear,\" he said. \"You should be feeding hope.\"\nObama used the speech to highlight gains he said Hispanics have made under his presidency, noting that 4 million more Latinos have health insurance and that the unemployment rate for the group has about fallen in half from 13 percent to about 6.4 percent.\nPrior to Obama's arrival, Democratic presidential candidate Hillary Rodham Clinton spoke briefly, saying that too many people in the U.S. don't see how vital Latinos are to the nation.\n\"It's a problem when a leading Republican candidate for president says that immigrants from Mexico are rapists and drug dealers,\" Clinton said, referencing comments that Republican presidential front-runner Donald Trump made last summer.\nShe said it was a problem when candidates \"use offensive terms like 'anchor babies,'\" a phrase that Republican Jeb Bush used to describe infants whose parents come to America specifically so their children are born in the U.S. and granted automatic citizenship. Bush has said he was referring mostly to the so-called birth tourism industry.\nTo that, Clinton said, \"Basta. Enough. End this,\" using the Spanish term for \"enough.\"\n___\nAssociated Press writer Ken Thomas contributed to this report.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe0xvb%3Fsrc=usn_rd&title=Obama%20touts%20immigration%20reform%20in%20speech%20to%20Hispanic%20leaders", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe0xvb%3Fsrc=usn_gp", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe0xvb%3Fsrc=usn_tw&via=usnews&text=Obama%20touts%20immigration%20reform%20in%20speech%20to%20Hispanic%20leaders", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe0xvb%3Fsrc=usn_su", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe0xvb%3Fsrc=usn_fb", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe0xvb%3Fsrc=usn_li&title=Obama%20touts%20immigration%20reform%20in%20speech%20to%20Hispanic%20leaders&summary=&source=U.%20S.%20News"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T05:31:43.702+03:00", "highlightTitle": ""}