{"organizations": ["Cabinet", "NACC", "Narong Pipatanasai", "National Anti-Corruption Commission", "Commerce Minister Apiradi Tantraporn", "Information and Communications Technology", "Rungruang Mahasetti Co"], "uuid": "a3c827dad936f6eb2d90b05dd581c92ee5678731", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/10/14/politics/images/30270837-01_big.JPG", "site_section": "http://www.nationmultimedia.com/home/rss/politics.rss", "section_title": "NationMultimedia.com - Politics", "url": "http://www.nationmultimedia.com/politics/Finance-minister-the-richest-30270837.html", "country": "TH", "title": "Finance minister the richest", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "Finance minister the richest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:00:00.000+03:00", "replies_count": 0, "uuid": "a3c827dad936f6eb2d90b05dd581c92ee5678731"}, "author": "", "url": "http://www.nationmultimedia.com/politics/Finance-minister-the-richest-30270837.html", "ord_in_thread": 0, "title": "Finance minister the richest", "locations": ["Phra Khanong", "Bangkok", "Nakhon Ratchasima", "Saraburi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Atchaka Sibunruang", "Chatchai Sarikalya", "Apisak Tantivorawong", "Somkid Jatusripitak", "Prachuap Khiri Khan", "Dapong Ratanasuwan", "Uttama Savanayana", "Don Pramudwinai", "Sirichai Dithakul", "Tanasak Patimapragorn", "Piyasakol Sakolsatayadorn", "Pichet Durongkaveroj", "Anantaporn Kanjanarat", "Suvit Maesincee", "Prajin Juntong"], "text": "Home » politics » Finance minister the richest Finance minister the richest The Nation October 14, 2015 1:00 am FINANCE MINISTER Apisak Tantivorawong appears to be the richest member of the current Cabinet, with his net worth standing at Bt394 million, according to the asset-declaration report released by the National Anti-Corruption Commission yesterday. The NACC unveiled the assets and liabilities report of Prime Minister Prayut Chan-o-cha's third Cabinet after its members were sworn in on August 23. Deputy Somkid Jatusripitak, his wife and his under-age children have assets worth Bt146 million, Information and Communications Technology Minister Uttama Savanayana has a net worth of Bt168 million, while Commerce Minister Apiradi Tantraporn reported a net worth of Bt33 million. Deputy Commerce Minister Suvit Maesincee reported a net worth of Bt97 million, which includes 134 ancient artefacts worth Bt22 million. Health Minister Piyasakol Sakolsatayadorn reported a net worth of Bt99 million, which includes a plot of land in Bangkok's Phra Khanong area worth Bt30 million and condominiums in Prachuap Khiri Khan province worth Bt8 million. Education Minister Thirakiat Charoensethasilp reported a net worth of Bt37 million, Transport Minister Omsin Chivapruek reported Bt68 million and Industry Minister Atchaka Sibunruang has assets worth Bt87 million. The industry minister also reported that she had extended a loan worth Bt39 million to Rungruang Mahasetti Co, which has the same address as her residence. Energy Minister General Anantaporn Kanjanarat reported a net worth of Bt47 million, including five plots of land in Saraburi and Nakhon Ratchasima provinces, plus watches and jewellery. Labour Minister General Sirichai Dithakul reported a net worth of Bt92 million, including 150 valuable amulets. Deputy Prime Minister General Tanasak Patimapragorn's assets stand at Bt184 million, Deputy Prime Minister Air Chief Marshal Prajin Juntong is worth Bt26 million, Deputy Prime Minister ACM Narong Pipatanasai's reported assets of Bt10 million and Agriculture and Cooperatives Minister General Chatchai Sarikalya's net worth stands at Bt34 million. Foreign Affairs Minister Don Pramudwinai is worth Bt138 million, Transport Minister Akom Termpitayapaisit Bt28 million, Science and Technology Minister Pichet Durongkaveroj Bt26 million and Education Minister General Dapong Ratanasuwan Bt93 million. 351 Viewed", "external_links": [], "published": "2015-10-13T21:00:00.000+03:00", "crawled": "2015-10-15T02:56:40.039+03:00", "highlightTitle": ""}