{"organizations": [], "uuid": "1db12a990454098cc2bddd2167c73f6a73de21b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "", "site_section": "http://www.fox8live.com/category/13571/political-news?clienttype=rss", "section_title": "FOX 8 News WVUE-TV - Political - Headline", "url": "http://www.fox8live.com/story/30265412/activists-occupy-baltimore-city-hall-oppose-commissioner", "country": "US", "title": "Activists occupy Baltimore City Hall; oppose commissioner", "performance_score": 0, "site": "fox8live.com", "participants_count": 0, "title_full": "Activists occupy Baltimore City Hall; oppose commissioner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:21:00.000+03:00", "replies_count": 0, "uuid": "1db12a990454098cc2bddd2167c73f6a73de21b1"}, "author": "", "url": "http://www.fox8live.com/story/30265412/activists-occupy-baltimore-city-hall-oppose-commissioner", "ord_in_thread": 0, "title": "Activists occupy Baltimore City Hall; oppose commissioner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JULIET LINDERMANAssociated Press"], "text": "Activists occupy Baltimore City Hall; oppose commissioner By JULIET LINDERMANAssociated Press \nBALTIMORE (AP) - Activists opposed to the permanent appointment of Baltimore's interim police commissioner occupied City Hall on Wednesday night and told police they wouldn't leave until the commissioner and mayor agreed to a list of their demands, including changes to police tactics and significant investment in education and social services. \nMembers of the Baltimore Uprising coalition, which includes both high school and community activists, had begun shouting from the upper gallery of City Council chambers as a Council subcommittee prepared to vote for Kevin Davis as permanent commissioner. The full council will vote on the appointment Monday. \n\"All night, all day, we will fight for Freddie Gray!\" the activists chanted amid calls to postpone the vote. \"No justice, no peace!\" \nFreddie Gray was the black man who died in April from injuries received while in police custody. His death sparked unrest and rioting in the city. \nThree of the subcommittee's five members voted in favor of Davis. Councilman Nick Mosby, who is married to State's Attorney Marilyn Mosby, voted against the confirmation, while Carl Stokes, who is running for mayor, abstained. \nAfter the vote, committee members began to leave but the protesters refused to go. Police spokesman T.J. Smith said in an email that 35 protesters were inside and that police were \"monitoring the situation.\" \nA member of the group who identified herself as Ralikh Hayes told an Associated Press reporter over the telephone Wednesday night that 32 protesters were inside and that they \"have no access to bathrooms, food or water currently.\" \n\"People are sitting, relaxing,\" she said. \"We are waiting to see if we'll get a meeting with anyone tonight. We want to meet with the interim commissioner and the mayor, but that meeting doesn't mean we're leaving. We'll be here.\" \nShortly after midnight Wednesday, five of the protesters left the building. One of them, Lawrence Brown, said the activists \"really wanted to challenge the coronation process for commissioner Davis and ask some critical questions about how police have handled protests since he's been in charge, and other questions about fairness and equity around policing.\" \nHe said that during the subcommittee meeting, \"people from outside the city could come and praise the commissioner, but people in the city got only three minutes.\" \n\"Local voices are not being heard,\" he said. \nBrown, 36, did not say why he and four others decided to leave, but added, \"I'm just glad to be here to support it and witness it, and to see what happens. ... Morale is great.\" \nEarlier Wednesday, a spokesman for the group said the protesters would not leave until Davis and Mayor Stephanie Rawlings-Blake agreed to a list of demands. Among them: that police avoid using military-type equipment such as armored vehicles, and only use riot gear as a last resort to protect officers. \nIn the interest of constitutional rights, the protesters said, they also want officers to always wear badges and name tags. And they want to be able to protest in larger areas and for longer periods of time than \"would normally be tolerated.\" \nIn addition, they are asking police to be \"more tolerant of minor law breaking,\" such as the throwing of water bottles, \"when deciding whether to escalate the use of force.\" \nRawlings-Blake appointed Davis interim commissioner in July after his predecessor, Anthony Batts, was fired amid the most severe violent crime spike the city had seen in 43 years. \nMarilyn Mosby had decided to prosecute six officers in connection with Gray's death. All of the officers are currently awaiting trial. In the aftermath of Mosby's decision and the widespread unrest, homicides began to rise and residents in crime-addled neighborhoods accused police officers of abandoning their posts. \nFollowing the subcommittee's vote, Davis called Wednesday night's protest an \"act of civil disobedience\" that \"is just part of this moment.\" \n\"It's all part of the healing process,\" he said. \"The fact that this occurred isn't upsetting. It's just part of where the city is right now. I understand where they are. I understand their frustration. ... I promised the citizens of Baltimore and the protesters that I'll be the type of police commissioner that they deserve. This is just part of where the city is right now, and if we're going to get to the other side of this, we have to go through these moments.\" \nAddressing the council subcommittee earlier, Davis said that he remains committed to training officers to actively engage and interact with community members. Davis also emphasized his commitment to \"respect and fight for the right for Americans to assemble and peacefully protest.\" \n\"2015 is the year that things change,\" Davis said, referring to the task of repairing the tense relationship between the police and the public in Baltimore. \nIf approved by the full council, Davis will earn $200,000 a year. His contract will run through June of 2020. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-15T13:21:00.000+03:00", "crawled": "2015-10-15T14:12:44.384+03:00", "highlightTitle": ""}