{"organizations": [], "uuid": "f1915d47d9483647376db387f0ff4d451f6c735b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30314930/nonprofits-engage-supporters-through-email-multiple-channels-miss-opportunities-for-online-fundraising-and-prompt-acknowledgement", "country": "US", "title": "Nonprofits Engage Supporters Through Email, Multiple Channels; Miss Opportunities for Online Fundraising and Prompt Acknowledgement", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Nonprofits Engage Supporters Through Email, Multiple Channels; Miss Opportunities for Online Fundraising and Prompt Acknowledgement - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "f1915d47d9483647376db387f0ff4d451f6c735b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30314930/nonprofits-engage-supporters-through-email-multiple-channels-miss-opportunities-for-online-fundraising-and-prompt-acknowledgement", "ord_in_thread": 0, "title": "Nonprofits Engage Supporters Through Email, Multiple Channels; Miss Opportunities for Online Fundraising and Prompt Acknowledgement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Abila\nData from Abila's Fundraising Advisor Report show how often and through what channels nonprofits interact with constituents\nAUSTIN, Texas -- Abila released today its Fundraising Advisor Report based on aggregated data from 270 nonprofit professionals from its recently launched Fundraising Advisor tool . Highlights of the report show that most nonprofit professionals (68 percent) use four or more channels to engage constituents, and that the most popular engagement channels are email (86 percent), website (72 percent) and in-person events (71 percent).\nHowever, while most nonprofits use multiple channels to engage their supporters, there are missed opportunities when it comes to online fundraising and the time it takes to acknowledge donations. Sixty percent of organizations have only one online fundraising page or no fundraising page at all. Seventy-six percent of organizations take 72 hours or more to acknowledge a donation.\n\"What we're seeing based on this data is that many organizations push a tremendous amount of content to their constituents through many different channels,\" said Rich Dietz , director of fundraising strategy for Abila. \"But, basic opportunities may be missed in the mad scramble to merely do more through as many channels as possible.\"\nKey Findings from the Data Include:\nAggregated data from more than 270 nonprofit professionals . 37 percent of organizations know either basic vital information (such as name, address, email, phone number) or less (just the name, for example) about their constituents. Email (86 percent), website (72 percent), and in-person events (71 percent) are the most popular means of engaging supporters. By contrast, TV/radio (11 percent) is the least popular. The most popular strategy for online fundraising is a single donation page (44 percent). Most organizations (68 percent) use four or more channels to engage supporters. 76 percent of organizations take 72 hours or longer to acknowledge donations. Peer-to-peer events/fundraising are undertaken by only 10 percent of organizations. You can download the full report at: Abila.com/FundraisingAdvisorBenchmark .\nAbila's Fundraising Advisor\nThe Fundraising Advisor is a powerful, automated tool designed to provide personalized fundraising advice to organizations based on six questions. Data for the report are aggregated from answers to the six questions and span a broad range of organization sizes and types.\nAbout Abila\nAbila is the leading provider of software and services to nonprofits, associations, and governmental entities that help them improve decision making, execute with greater precision, increase engagement, and generate more revenue. With Abila solutions, association and nonprofit professionals can use data and personal insight to make better financial and strategic decisions, enhance member and donor engagement and value, operate more efficiently and effectively, and increase revenue to better activate their mission. Abila combines decades of industry insight with technology know-how to serve more than 8,000 customers across North America . For more information, please visit www.abila.com .\nMedia Contact:\nJenna Overbeck\njenna.overbeck@abila.com\n512.861.3248\nLogo - http://photos.prnewswire.com/prnh/20150901/262646LOGO\n releases/nonprofits-engage-supporters-through-email-multiple-channels-miss-opportunities-for-online-fundraising-and-prompt-acknowledgement-300163764.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20150901/262646LOGO", "http://abila.com/FundraisingAdvisorBenchmark", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/nonprofits-engage-supporters-through-email-multiple-channels-miss-opportunities-for-online-fundraising-and-prompt-acknowledgement-300163764.html", "http://fundraisingadvisor.abila.com/", "http://www.abila.com/", "http://photos.prnewswire.com/prnvar/20150901/262646LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA34340&Transmission_Id=201510210837PR_NEWS_USPR_____DA34340&DateId=20151021"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T17:39:25.555+03:00", "highlightTitle": ""}