{"organizations": [], "uuid": "09da3ff0f9555000da1eafd574ff0ee094750a15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/03/National-Politics/Images/m8152541443897370.jpg", "site_section": "http://www.washingtonpost.com/politics", "section_title": "Politics - The Washington Post", "url": "http://www.washingtonpost.com/politics/the-potholes-of-colorado-springs-draw-the-attention-of-koch-brothers-group/2015/10/03/7bd7d64a-566c-11e5-8bb1-b488d231bba2_story.html", "country": "US", "title": "The potholes of Colorado Springs draw the attention of Koch brothers’ group", "performance_score": 1, "site": "washingtonpost.com", "participants_count": 1, "title_full": "The potholes of Colorado Springs draw the attention of Koch brothers’ group - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "09da3ff0f9555000da1eafd574ff0ee094750a15"}, "author": "Corey Hutchins", "url": "http://www.washingtonpost.com/politics/the-potholes-of-colorado-springs-draw-the-attention-of-koch-brothers-group/2015/10/03/7bd7d64a-566c-11e5-8bb1-b488d231bba2_story.html", "ord_in_thread": 0, "title": "The potholes of Colorado Springs draw the attention of Koch brothers’ group", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Suthers, left, as Colorodao attorney general in 2011. Now mayor of Colorado Springs, Suthers has run into opposition from a conservative group over his proposal to raise the sales tax to improve roads. (Andrew Harrer/Bloomberg News) By Corey Hutchins October 3 at 3:48 PM COLORADO SPRINGS — This much everyone can agree on: The streets of this large city on the Rocky Mountain Front Range are a wreck. Sixty percent are in disrepair, cracked and rutted; driving on them is often a game of vehicular Minesweeper. One local TV news channel runs a segment called “Pothole Patrol.”\nBut when this city’s newly elected conservative mayor urged voters to approve an increase in the sales to pay to improve the roads, he drew fire from an unexpected source: a branch of Americans for Prosperity, a powerful conservative advocacy group backed by the billionaire industrialists Charles and David Koch.\nThe group’s involvement in a municipal infrastructure issue spotlights how AFP is seizing on local issues around the country as it works to build a permanent grass-roots army.\n[ Americans for Prosperity plows millions into building conservative ground force ]\nThe group helped derail a recent roads bill in South Carolina. It faced off with Wichita’s city council over an apartment development deal and with Milwaukee’s over a streetcar project. In Coralville, Iowa, the group pushed back on a tax increment financing plan. Near Denver, it was in the middle of the fierce fight for control of the Jefferson County school board.\nAnd in Colorado Springs, it’s taken on the road tax. The organization started an online petition and took out Facebook ads to oppose the tax. The group produced a 23-page report on the issue and even hired an out-of-state accountant to examine the city’s budget. In a City Hall presentation, the accountant told local leaders they should be able to find money to fix the roads without raising taxes.\nNow nervous civic leaders wonder if AFP will wade into the ballot initiative over the tax this fall.\nMayor John Suthers, a Republican and former Colorado attorney general, has been pushing hard for the 0.62 percent sales tax increase. “The money,” he told a group of business leaders at a town hall meeting last month, “would go to a separate fund to be used for roads only.”\nSuthers has called", "external_links": ["http://americansforprosperity.org/colorado/files/2015/09/Colorado-Springs-Infrastructure-and-Tax-Increase-Issue-.pdf", "http://action.americansforprosperity.org/americansforprosperity/app/write-a-letter?0&engagementId=125874"], "published": "2015-10-03T03:00:00.000+03:00", "crawled": "2015-10-03T23:54:55.203+03:00", "highlightTitle": ""}