{"organizations": [], "uuid": "ea661d96e0798d06b69278b8df744bd0cce983e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wlky.com", "main_image": "http://www.wlky.com/image/view/-/35852864/highRes/2/-/maxh/630/maxw/1200/-/3sn6jv/-/Sanders-at-fundraiser-jpg.jpg", "site_section": "http://www.wlky.com/9366980?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.wlky.com/politics/bernie-sanders-strategy-shift/35844716", "country": "US", "title": "Sanders shifts strategy to more intimate campaign", "performance_score": 0, "site": "wlky.com", "participants_count": 0, "title_full": "Sanders shifts strategy to more intimate campaign", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:09:00.000+03:00", "replies_count": 0, "uuid": "ea661d96e0798d06b69278b8df744bd0cce983e6"}, "author": "", "url": "http://www.wlky.com/politics/bernie-sanders-strategy-shift/35844716", "ord_in_thread": 0, "title": "Sanders shifts strategy to more intimate campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sanders"], "text": "Sanders shifts strategy to more intimate campaign Now that he's established, organizers will work to convince more voters UPDATED 6:09 PM EDT Oct 15, 2015 Photos David McNew/Getty Images \nBernie Sanders' insurgent campaign has been largely built and defined by big, booming rallies with enthusiastic crowds mostly in liberal and progressive locales. Videos Clinton sent GOP 2016ers copies of... \nNow, his campaign strategists say they will start to put a new emphasis on placing the candidate in smaller, more intimate settings, especially in early states like Iowa. \nThe goal will be less about creating excitement around the campaign -- his advisers they feel they've largely achieved that -- and is now more about convincing voters the Vermont self-described \"democratic socialist\" can win the nomination and the White House. \n\"At the beginning we had to do something to create that excitement, we started from nothing,\" said Sanders adviser Tad Devine. \"Now that we've gotten this going, we're going to move towards a period of persuasion. We've got something to work with now. Now we go and persuade voters.\" \nThis weekend, Sanders will take a two-day swing through Iowa, attending house parties, a barbeque and holding two town hall meetings. But no large rally. \nEven his television appearances and fundraisers will be more intimate. \nSanders taped an appearance on \"The Ellen DeGeneres Show\" Wednesday night, part of the overall strategy for the campaign to introduce Sanders to a broader spectrum of voters -- and show off his dancing skills. \n\"Forcing a debate\" \nAt the first of two Beverly Hills fundraising events Wednesday evening, Sanders emphasized the difficulty of cutting through and getting his message across. \n\"If I slipped on a banana peel leaving here it would be on the front page of the papers,\" Sanders said. \"But when we talk about the great crisis facing this country very hard to get media attention for a lot of obvious reasons. And if I was standing here tonight and making some vicious attack against Hillary Clinton or anybody else it'd be a front page story. \n\"But if we talk about why the middle class is disappearing and almost all new wealth is going to the top 1 percent, not a big story,\" he added. \"So what the political revolution is, is forcing a debate. Not about trivial, but the real issues.\" \nThe appearances in Los Angeles build on the momentum of Sanders' debate fundraising success. The campaign raised roughly $2 million since Tuesday night's debate, according to Jeff Weaver, Sanders' campaign manager, with an average contribution of $30. \nThe overall change in strategy will bring Sanders back to how he started his campaign, when he was viewed as a fringe candidate looking to push Hillary Clinton to the left -- before the excitement around him brought out thousands of people across the country. \nWhen Sanders was just teasing a run he regularly spoke to audience of 100-200 people in Iowa, New Hampshire and elsewhere. The format allowed him deliver his stump speech and take questions from the audience. \nBut as the fascination around his campaign grew, aides hoped to tap into that spring of excitement and throw massive events across the country. The trade-off: Sanders rarely took questions from voters or the media. \nThe large rallies will continue, campaign strategists note, saying that they will continue doing what they see working for them. \nBeverly Hills fundraisers \nSanders attended two fundraisers in the Los Angeles area Wednesday night. \nThe first was at The Avalon, described by the campaign as a \"mini-rally\" with 1,300 people expected. Ticket prices were kept low, the campaign says -- at $25-- to encourage a more open event and has already raised $50,000. \nThere, he touted the successful post-debate fundraising drive. \n\"Right now there are many pundits who believe that the only way a candidate can run a successful campaign is to have a super PAC, get down on one's knees before the millionaires and billionaires - beg them for money,\" he said. \"And what we are showing is we can run a people oriented campaign funded by the people\" \nThe second event was a high-dollar fundraiser of the type more associated with the Clinton campaign. The event at the home of long-time Democratic donors Syd and Linda Leibovitch has a higher price point: tickets start at $250 per person and go up the maximum $2,700 for a pre-event reception and has already raised more than $110,000 with about 250 people expected.", "external_links": [], "published": "2015-10-16T01:09:00.000+03:00", "crawled": "2015-10-16T01:26:08.644+03:00", "highlightTitle": ""}