{"organizations": ["Iowa Carson"], "uuid": "b9b2e56c0375b65336d2736811a82f153230b819", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ketv.com", "main_image": "http://www.ketv.com/image/view/-/35802880/highRes/2/-/maxh/630/maxw/1200/-/u4stbdz/-/presidential-supporters-grammar---Ben-Carson.jpg", "site_section": "http://www.ketv.com/9675468?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.ketv.com/politics/carson-knocks-trump-from-top-spot-in-iowa/35978344", "country": "US", "title": "Carson knocks Trump from top spot in Iowa", "performance_score": 0, "site": "ketv.com", "participants_count": 0, "title_full": "Carson knocks Trump from top spot in Iowa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:42:00.000+03:00", "replies_count": 0, "uuid": "b9b2e56c0375b65336d2736811a82f153230b819"}, "author": "", "url": "http://www.ketv.com/politics/carson-knocks-trump-from-top-spot-in-iowa/35978344", "ord_in_thread": 0, "title": "Carson knocks Trump from top spot in Iowa", "locations": ["Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jennifer Agiesta CNN Carson", "Carson", "Trump", "Tom LoBianco"], "text": "By Tom LoBianco and Jennifer Agiesta CNN Carson knocks Trump from top spot in Iowa Carson opens 8 percentage point lead over Trump with the help of women, white evangelicals UPDATED 7:42 AM CDT Oct 22, 2015 Photos \nKevork Djansezian/Getty Images \nBen Carson has knocked Donald Trump from his perch atop the field in Iowa, according to the latest Quinnipiac University poll of Iowa Republicans. Media Galleries Walker suspends campaign for president \nCarson has opened up an 8 percentage point lead over Trump with the help of women and white evangelicals, who overwhelmingly favor the soft-spoken former neurosurgeon over the outspoken billionaire. About 28% of likely caucusgoers said they support Carson, 20% back Trump, 13% support Florida Sen. Marco Rubio and 10% are for Texas Sen. Ted Cruz. \nThe survey is the first major poll to find Trump trailing by a significant margin nationally or in the four early states since a CNN national poll taken June 26-28, which showed Trump behind Florida Gov. Jeb Bush 12% to 19%. \nThe latest Quinnipiac poll shows Carson winning big with two key groups: women back Carson over Trump 33%-13% and white evangelicals support him 36% to Trump's 17%. \nCarson is the only candidate in the GOP field to consistently poll in the top tier near Trump, running a strong second in most national polling in the past month and easily outpacing other competitors. Former tech CEO Carly Fiorina's post-debate bump recently evaporated, although Rubio has been steadily rising in the polls. \nTrump joked Tuesday on CNN's \"New Day\" that he might consider Carson for a spot on his ticket. \n\"I mean, stranger things have happened,\" he said. \nThe poll shows Trump does well with Iowa Republicans on issues like taxes, the economy and illegal immigration. But he fares less well on his personal attributes: 89% call Carson honest, versus 48% who see Trump that way. And 87% say Carson cares about their well-being, compared to 49% for Trump. \nQuinnipiac surveyed 574 likely Republican Iowa caucusgoers from October 14-20 for a margin of error of plus or minus 4.1%.", "external_links": [], "published": "2015-10-22T15:42:00.000+03:00", "crawled": "2015-10-22T16:37:41.108+03:00", "highlightTitle": ""}