{"organizations": ["Broward State College", "Associated Press"], "uuid": "18957ccbdce31b1fff9d7242451b47b779f5d6d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/06/450a22a6-b470-42bd-99b9-fef993a54cb4/thumbnail/620x350/ded03e6eaf05c832e7e678587e1037f2/2015-10-02t214031z2087403484gf10000230500rtrmadp3usa-election-clinton.jpg", "site_section": "http://www.cbsnews.com/latest/rss/politics", "section_title": "Politics - CBSNews.com", "url": "http://www.cbsnews.com/news/clinton-has-edge-in-nevada-ahead-of-first-dem-debate/", "country": "US", "title": "Election 2016: Clinton has edge in Nevada, ahead of first Democratic debate", "performance_score": 0, "site": "cbsnews.com", "participants_count": 0, "title_full": "Election 2016: Clinton has edge in Nevada, ahead of first Democratic debate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:01:00.000+03:00", "replies_count": 0, "uuid": "18957ccbdce31b1fff9d7242451b47b779f5d6d5"}, "author": "", "url": "http://www.cbsnews.com/news/clinton-has-edge-in-nevada-ahead-of-first-dem-debate/", "ord_in_thread": 0, "title": "Election 2016: Clinton has edge in Nevada, ahead of first Democratic debate", "locations": ["Davie", "U.S.", "Florida", "Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Clinton"], "text": "Associated Press October 12, 2015, 1:07 PM Clinton has edge in Nevada, ahead of first Dem debate U.S. Democratic presidential candidate Hillary Clinton holds a 'Grassroots' organizational event at Broward State College in Davie, Florida, October 2, 2015. REUTERS/Joe Skipper REUTERS More + \nLAS VEGAS - - When the Democratic candidates for president take the stage for their first debate this week in Nevada, they'll do so in a state that serves as a reminder of why Hillary Rodham Clinton is the front-runner for the nomination. \nOne of the first four states to cast ballots in the presidential contest , Nevada is home to large communities of immigrant families, including many who have only recently arrived in the state. When combined with the state's baroque caucus system, which is so complex that the rules surrounding it run 51 pages, that means winning the state and the largest share of delegates requires a higher degree of organization and effort to get-out-the-vote than in most others. \nAnd so for all the excitement generated to date by Vermont independent Sen. Bernie Sanders, and for all the anticipation about whether Vice President Joe Biden will decide to make a late entry into the race, it is Clinton and her campaign that are set up to win when Nevada Democratic caucus next February. \nClinton installed staff on the ground in Nevada six months ago, and she now has 22 paid operatives in the state. They have recruited more than 3,000 volunteers, who have already held events in remote desert towns as well as the state's urban centers. Clinton herself has made wooing immigrants a keystone of her campaign; she announced her immigration policy approach at a Las Vegas high school this spring. \n\"That's a lot of shoe leather, and they've been on the ground for 5-6 months,\" Billy Vassiliadis, a veteran Democratic strategist in Nevada who isn't involved in the current race, said of the Clinton campaign's efforts. \"That's going to be a challenge that I don't think a Sanders can overcome, that - God bless his heart - I don't think Joe can overcome.\" \nMeanwhile, Sanders put a single paid staffer in the state less than two weeks ago, and recently added a few more. Biden has yet to decide whether to run and does not have any formal campaign operation. \nNone of the other candidates Clinton will debate Tuesday night - former Maryland Gov. Martin O'Malley, former Rhode Island Sen. Lincoln Chaffee and former Virginia Sen. Jim Webb - have a campaign organization that can match Clinton's. All are largely afterthoughts in early preference polls. \nThe differences in the structural strength of the campaigns were evident this past weekend. While Sanders' single Nevada staffer had his first meeting with hundreds of Sanders volunteers at a community college on Saturday, Clinton's campaign flew in Democratic rising star Rep. Joaquin Castro of Texas in Las Vegas and former NBA player Jason Collins in Reno to cheer on volunteers and staffers who had been knocking on doors and making calls for months. \n\"We gave - and we know we have - the best candidate for president of all the candidates for president, Democrat or Republican - Hillary Clinton,\" Castro told about two dozen Clinton volunteers who, armed with clipboards filled with computer-generated lists of potential voters, were about to set out for an afternoon of door-knocking in heavily Latino East Las Vegas. \nSanders supporters argue they can catch up. \"There is a movement here, even in Nevada, for Bernie Sanders,\" said Jim Farrell, Sanders' Nevada state director. \"This is not a normal election cycle.\" \nYet neither was 2008, when Clinton won the Nevada caucus. Her state director then was Robby Mook, who is now her national campaign manager. Her field director that year was Marlon Marshall, now the national campaign's director of public engagement. Emmy Ruiz, who worked on the Clinton 2008 effort and then ran Obama's successful 2012 race in Nevada, is now overseeing Clinton's 2016 effort in the state. \nVassiliadis, who worked on the 2008 Obama campaign, said it had staff on the ground in the spring of 2007 and nabbed the coveted endorsement of the Culinary Workers Union, which represents tens of thousands of casino workers in the state. And yet they couldn't catch up to Mook and the campaign he built for Clinton in Nevada. \nClinton's team is doing it all over again, including targeting the state's diverse electorate. The campaign hosts Filipino-style potluck dinners and is courting black pastors as well as Nevada's influential corps of immigrant-rights activists. And what the campaign does in Nevada, Marshall said, will pay off across the country. \n\"The diversity of Nevada and the outreach programs you use there can help us reach out to those communities in other states,\" he said. \nYet for all her successes in Nevada in 2008, Clinton left the state with one fewer delegate than did Obama. It's something noted by some Sanders backers, who cite the complex rules that can generously apportion delegates to runners-up as they tout the potential for the enthusiasm for his campaign to ultimately trump Clinton's structural edge. \n\"We'll go to the Democratic clubs and see a Hillary person will get up - they're all very nice people, but it's like they memorized a speech,\" said Tazo Schafer, 67, a retired academic who is volunteering for Sanders, his first involvement in presidential politics since Eugene McCarthy's campaign. \"Then the Bernie people get up and say, 'Enough is enough,' and there's real passion.\" Associated Press", "external_links": [], "published": "2015-10-13T00:01:00.000+03:00", "crawled": "2015-10-12T20:25:32.530+03:00", "highlightTitle": ""}