{"organizations": [], "uuid": "2d2f5392068cb12ddaee1f93501b3e38cc46e2e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-bfb233cbe02f36f6f55ddf71d0b238ef.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/drudge-clinton-obviously-induced-by-meds/article/2574791?custom_click=rss", "country": "US", "title": "Drudge: Clinton 'obviously induced by meds'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Drudge: Clinton 'obviously induced by meds' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:32:00.000+03:00", "replies_count": 0, "uuid": "2d2f5392068cb12ddaee1f93501b3e38cc46e2e9"}, "author": "Eddie Scarry", "url": "http://www.washingtonexaminer.com/drudge-clinton-obviously-induced-by-meds/article/2574791?custom_click=rss", "ord_in_thread": 0, "title": "Drudge: Clinton 'obviously induced by meds'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Matt Drudge, founder and editor of the influential Drudge Report, believes Hillary Clinton was hopped up on anti-anxiety medication during her testimony Thursday in front of the Republican-led House Benghazi Select Committee.\nOn Twitter, Drudge said it was clear.\nHillary health was biggest revelation at hearing. Coughing fit. Slow-speaking, obviously induced by meds. Choose not to believe if you must\n— MATT DRUDGE (@DRUDGE) October 23, 2015 Last time she showed up with prism glasses from blod clot, vertigo. Today obvious anti-anxiety meds, hypothyroid issues. #BenghaziCommittee \n  Romney admits: 'Without Romneycare, I don't think we would have Obamacare' Romney explained that his signature achievement helped pave the way for the Affordable Care Act's passage\nBy Al Weaver • 10/23/15 2:01 PM — MATT DRUDGE (@DRUDGE) October 23, 2015 \"Hillary health was biggest revelation at hearing,\" Drudge wrote Thursday night after the hearing was over. \"Coughing fit. Slow-speaking, obviously induced by meds. Choose not to believe if you must.\"\nIn a follow-up tweet, Drudge said, \"Today obvious anti-anxiety meds, hypothyroid issues.\"\nClinton's doctor Lisa Bardack said publicly over the summer that the Democratic presidnetial frontrunner was in \"excellent physical health,\" but did admit that she was taking blood thinning medication for her thyroid.\nDrudge, along with some other conservatives, have suggested in the past that Clinton is hiding serious health issues. In his latest book, Unlikeable: The Problem With Hillary , controversial author Ed Klein wrote that Clinton is facing \"mounting health issues.\"\nRepresentatives for the Clinton campaign did not respond to a request for comment.\nAlso from the Washington Examiner Clinton wins endorsement from major public-sector union AFSCME A union for state and local government workers says she has the best chance among labor-friendly candidates.\nBy Sean Higgins • 10/23/15 1:41 PM Top Story House Republicans vote to repeal key pieces of Obama's health law House GOP   Obamacare.\n  11:59 AM", "external_links": [], "published": "2015-10-23T15:32:00.000+03:00", "crawled": "2015-10-23T21:41:55.902+03:00", "highlightTitle": ""}