{"organizations": [], "uuid": "157d56e1bfdeb11917d0c1699560b82181bfaf31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/20/us/20climate-web2/20climate-web2-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Politics.xml", "section_title": "NYT &gt; Politics", "url": "http://www.nytimes.com/2015/10/20/us/politics/obama-carbon-emissions-climate-nike-mcdonalds-procter-gamble.html", "country": "US", "title": "White House Emphasizes Companies’ Commitment to Cutting Emissions", "performance_score": 2, "site": "nytimes.com", "participants_count": 1, "title_full": "White House Emphasizes Companies’ Commitment to Cutting Emissions - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T20:36:00.000+03:00", "replies_count": 0, "uuid": "157d56e1bfdeb11917d0c1699560b82181bfaf31"}, "author": "Gardiner Harris", "url": "http://www.nytimes.com/2015/10/20/us/politics/obama-carbon-emissions-climate-nike-mcdonalds-procter-gamble.html", "ord_in_thread": 0, "title": "White House Emphasizes Companies’ Commitment to Cutting Emissions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " WASHINGTON — The Obama administration announced Monday that 81 major companies have committed to large reductions in carbon emissions, part of a broad push by the White House to show progress ahead of international climate talks in Paris this year.\nThe companies that have made the pledge include such iconic American brands as Levi Strauss & Co., McDonald’s, I.B.M. and Procter & Gamble. They have operations in all 50 states, employ over nine million people, have more than $3 trillion in annual revenue and a combined market capitalization of over $5 trillion, according to the White House.\nBut many of the newly announced commitments were in fact issued before. Part of the White House campaign is simple theatrics: convincing both domestic and international audiences that the United States — long the world’s greatest source of carbon emissions — is serious about making significant reductions in its carbon footprint.\n Related Coverage U.S. and Chinese Climate Change Negotiators to Meet in Los Angeles SEPT. 15, 2015 Many Conservative Republicans Believe Climate Change Is a Real Threat SEPT. 28, 2015 Senate Democrats Offer Climate Change Bill Aimed Not at Success Now, but in 2016 SEPT. 22, 2015 Guardian Industries Settles Allegations It Violated Clean Air Act SEPT. 29, 2015 Obama Makes Urgent Appeal in Alaska for Climate Change Action AUG. 31, 2015 Many of the chiefs of the companies met with President Obama on Monday morning, part of a continuing push by the administration to use both carrots and sticks to persuade businesses to move away from operations that rely on coal and oil toward ones that use more wind and solar power .\nSome of the companies, including Nike, have pledged to power their operations entirely with renewable energy or to reduce their carbon emissions to zero.\n“The bottom line is this: These commitments show that international action on climate are not only good for our climate but good for the bottom line,” said Brian Deese, a senior adviser to the president.\nTodd Brady, global environmental director at Intel, acknowledged Monday morning that his company’s pledge is a combination of prior and new commitments.\nThe administration’s leadership on the issue “has caused us to step back and see if we can do more,” Mr. Brady said.\nThe administration is also using significant new regulations, including the newly released Clean Power Plan, to drive down carbon emissions in the United States over the next 15 years. Republicans have denounced such regulations as job killers that will result in significant costs to both businesses and consumers. By showing that many major businesses are making large reductions in carbon emissions voluntarily while still being profitable, the Obama administration hopes to prove that its new rules will lead to greater economic growth, not less.\nThe administration expects to persuade even more businesses to sign its climate pledge before climate talks in Paris begin in six weeks. Such pledges, Mr. Deese said, “will really help drive the conversation and drive progress going into Paris.”", "external_links": ["http://static01.nyt.com/images/2015/09/16/us/16CLIMATE1/16CLIMATE1-thumbStandard.jpg", "http://static01.nyt.com/images/2015/09/30/us/30enviro/30enviro-thumbStandard.jpg", "https://www.whitehouse.gov/the-press-office/2015/10/19/fact-sheet-white-house-announces-commitments-american-business-act", "http://static01.nyt.com/images/2015/09/01/us/01climate/01climate-thumbStandard-v2.jpg", "http://static01.nyt.com/images/2015/09/22/us/23climate/23climate-thumbStandard.jpg", "http://static01.nyt.com/images/2015/09/29/us/29enviro/29enviro-thumbStandard.jpg"], "published": "2015-10-19T20:36:00.000+03:00", "crawled": "2015-10-19T20:08:16.368+03:00", "highlightTitle": ""}