{"organizations": [], "uuid": "f2d2679e1f07aa8131708770303db85bb7833182", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://www.afmc.af.mil/shared/media/ggallery/webgraphic/2015/09/AFG-150902-007.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/military/2015/09/afmc-promotes-depression-awareness-month-2-2474756.html", "country": "US", "title": "AFMC promotes Depression Awareness Month | Military", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "AFMC promotes Depression Awareness Month | Military", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:08:00.000+03:00", "replies_count": 0, "uuid": "f2d2679e1f07aa8131708770303db85bb7833182"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/military/2015/09/afmc-promotes-depression-awareness-month-2-2474756.html", "ord_in_thread": 0, "title": "AFMC promotes Depression Awareness Month | Military", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nAir Force Materiel Command Health and Wellness Team\n9/30/2015 - WRIGHT-PATTERSON AIR FORCE BASE, Ohio – During the month of October, Air Force Materiel Command will promote Depression Awareness. As part of its Mental Fitness Campaign, AFMC will inform the workforce about the signs and symptoms of depression, offer anonymous behavioral health screenings, and promote mental fitness assistance programs and services. According to the National Institute of Mental Health, depression is highly treatable when an individual receives competent care.\n“The campaign's goal is to reduce the stigma associated with seeking help for depression and other mental health issues,” said Greg Chadwick, AFMC Health and Wellness Coordinator. This question and answer guide explains depression and the importance of seeking professional consultation.\nHow does depression differ from feeling sad?\nEveryone occasionally feels sad or down, but these feelings usually pass within a few days. The NIMH reports that someone with depression experiences extreme sadness or despair for at least two weeks or longer. Depression can have enormous depth and staying power, and it can weaken one's joy and interest in activities of daily living. The difference between depression and feeling down is how severe the symptoms are and how long they last.\nWhat are the signs and symptoms of depression?\nPeople with depression do not experience all of the same symptoms. The physical and psychological signs and symptoms of depression may include:\n· Feeling sad or “empty”\n· Losing interest in favorite activities\n· Feeling hopeless, worthless or helpless\n· Not being able to sleep, or sleeping too much\n· Having difficulty concentrating, remembering details and making decisions\n· Experiencing fatigue and decreased energy\n· Overeating, or not wanting to eat at all\n· Having thoughts of suicide, or attempting suicide\nIf you are feeling depressed and hopeless, and these feelings are interfering with activities of daily living, you may be interested in a mental health screening. An anonymous and confidential depression online screening is offered on our website at AFMCwellness.com. Screening results are educational, not diagnostic, but are provided so participants may find out quickly if a professional consultation would be helpful.\nWhere can I go for help?\nProfessional counseling services are available for the AFMC workforce and their families.\nActive-duty personnel can contact their local mental health clinic for services. Military OneSource is another option for military members and their families. For more information, call (800) 342-9647 or visit militaryonesource.mil.\nCivilian employees may contact the Employee Assistance Program for free, confidential counseling services at (800) 222-0364 or visit the EAP website at FOH4You.com.\nFor more information about depression education materials, visit AFMCwellness.com or contact your local Civilian Health Promotion Services team.", "external_links": ["http://www.afmc.af.mil/shared/media/ggallery/webgraphic/2015/09/AFG-150902-007.jpg"], "published": "2015-09-30T23:08:00.000+03:00", "crawled": "2015-10-01T01:31:05.487+03:00", "highlightTitle": ""}