{"organizations": [], "uuid": "649a7eccb389e490e4e4c13c797d04422221521d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/10/26/nurses.jpg", "site_section": "http://www.dispatch.com/content/syndication/news_ohio_politics.xml", "section_title": "Political News - Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/26/bill-would-give-nurses-latitude.html", "country": "US", "title": "Bill would give Ohio nurses more latitude in treating patients", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Bill would give Ohio nurses more latitude in treating patients", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T11:12:00.000+02:00", "replies_count": 0, "uuid": "649a7eccb389e490e4e4c13c797d04422221521d"}, "author": "Misti Crane", "url": "http://www.dispatch.com/content/stories/local/2015/10/26/bill-would-give-nurses-latitude.html", "ord_in_thread": 0, "title": "Bill would give Ohio nurses more latitude in treating patients", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bill would give Ohio nurses more latitude in treating patients Health Headlines Enlarge Image Request to buy this photo Adam Cairns | Dispatch State Rep. Dorothy Pelanda, right, comments about the physical weight of House Bill 216, which she is sponsoring, while talking with Candy Rinehart, head of Ohio State University’s College of Nursing. By Misti Crane The Columbus Dispatch • Monday October 26, 2015 5:12 AM \nNurse practitioners and other advanced-practice nurses say Ohio law makes it harder for them to do their jobs well and is forcing talent to states where they can practice without physician oversight and other challenges. \nLawmakers are expected to begin hearings in January on a sweeping “modernization” bill introduced this year by Rep. Dorothy Pelanda, a Marysville Republican. \nOn Wednesday, advanced-practice nurses chatted with her and lobbied her colleagues. \nAlthough legislative wrangling over the bill is months off, interest groups already are formulating their arguments and looking for ways to temper a proposal that would free the nurses from having to enter into formal agreements with physicians. \nThe Ohio State Medical Association, which represents doctors, has called the proposal unreasonable, alarming and dangerous and argues that a team approach works well and leads to optimal patient care. \nThe group says the bill would erode protections against prescription drug abuse and fragment health care. It also stresses that doctors are better-educated and have deeper medical knowledge. \nThe nurses say they’re already making their own decisions in patient care and shouldn’t have to pay a physician as much as $25,000 a year for oversight that can amount to little actual collaboration or advice. \nFurthermore, they say, those arrangements can be hard to find in Ohio, prompting good nurses to leave for states where oversight is not required. \nAdvanced-practice nurses routinely collaborate with doctors and other nurses when they’re looking for advice or feedback, and that won’t change if the law changes, said Christine Williams, a nurse practitioner in Cleveland and director of full practice authority and reimbursement for the Ohio Association of Advanced Practice Nurses. \nAdvanced-practice nurses include nurse practitioners, certified registered nurse anesthetists, clinical nurse specialists and certified nurse midwives. \nIn Ohio, about 4,600 nurses graduate from advanced-degree programs every year and about 12,000 practice in the state, said Lori Chovanak, CEO of the Ohio Nurses Association and a nurse practitioner. \nFreeing nurses to operate independently would help keep more of them here and help remove barriers to primary care that many Ohioans face, she said. Better access to primary care means healthier patients, fewer emergency visits and lower health-care costs. \n“Ohio has some of the most stringent laws surrounding practice for nurse practitioners. We’re doing a good job of educating them, and then they leave the state to go practice in a state where they can confidently take care of patients and not rely on a physician’s signature,” Chovanak said. \nNurse practitioners have that ability in 21 states and the District of Columbia. \nTwenty-six states allow certified nurse midwives to practice without physician oversight and 33 states allow independent nurse anesthetists. \nA 2010 study paid for by the American Association of Nurse Anesthetists analyzed Medicare data from 1999 and 2005 and found no evidence that nurse anesthetists who work without physician oversight resulted in an increase in deaths or complications. \nBut members of the Ohio State Medical Association say the relationship with a physician is critical because doctors receive more training. \nThat education better prepares an anesthesiologist to figure out the root cause of a complication — such as rocketing blood pressure — and respond appropriately, said Dr. Erica Stein, an anesthesiologist at Ohio State University’s Wexner Medical Center. \nStein said she values the professional strengths of the nurse anesthetists she works with at Ohio State’s Ross Heart Hospital, but she said her role in that relationship is important because she’s better prepared to understand the complex interplay between health problems and medications. \nCathy Hoffman, a nurse anesthetist who practices in southeastern Ohio, said she collaborates with the entire surgical team when she cares for patients. If a heart-rhythm problem arises, for example, “I’m going to call the cardiologist, just like the anesthesiologist would,” she said. \nNurse anesthetists don’t have the same type of practice agreements with individual physicians that nurse practitioners do, but they have limits on their practice that would be erased with this proposed law, said Hoffman, spokeswoman for the Ohio Association of Advanced Practice Nurses. \nThat includes not being able to order post-surgical pain or anti-nausea drugs that she herself doesn’t administer, which serves as an obstacle to better, more expedient care for her patients, Hoffman said. \nMonica Hueckel, director of government affairs for the medical association, said although her group hasn’t seen any data showing poor outcomes for patients treated by independent advanced-practice nurses in other states, it doesn’t want to wait to see what bad things could happen here. \nThe association is eager to work with the nurses on compromises to the legislation, she said. \nPelanda said her bill likely will change before a House committee takes it up next year.", "external_links": [], "published": "2015-10-26T11:12:00.000+02:00", "crawled": "2015-10-26T12:11:28.608+02:00", "highlightTitle": ""}