{"organizations": [], "uuid": "16e7f51d4118bf47ef438099aefae1d6b524c313", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30226116/cubesat-to-demonstrate-miniature-laser-communications-in-orbit", "country": "US", "title": "CubeSat to Demonstrate Miniature Laser Communications in Orbit", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CubeSat to Demonstrate Miniature Laser Communications in Orbit - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "16e7f51d4118bf47ef438099aefae1d6b524c313"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30226116/cubesat-to-demonstrate-miniature-laser-communications-in-orbit", "ord_in_thread": 0, "title": "CubeSat to Demonstrate Miniature Laser Communications in Orbit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " NASA\nWASHINGTON , Oct. 9, 2015 /PRNewswire-USNewswire/ -- NASA and The Aerospace Corporation of El Segundo, California , have received confirmation the Optical Communications and Sensor Demonstration (OCSD) CubeSat spacecraft is in orbit and operational. OCSD launched aboard an Atlas V rocket Thursday from the Vandenberg Air Force Base in California .\nOCSD is the first in a new series of six NASA-managed technology demonstration missions set to launch during the coming months using CubeSats to test technologies that can enable new uses for these miniature satellites, which measure 10 cm x 10 cm x 10 cm (about 4 inches per side). NASA, other government agencies, academia and commercial companies can incorporate these technologies, which range from high-speed communications to novel propulsion systems to technologies that enable rendezvous and docking, into future space missions.\n\"Technology demonstration missions like OCSD are driving exploration,\" said Steve Jurczyk , associate administrator for the Space Technology Mission Directorate (STMD) at NASA Headquarters in Washington . \"By improving the communication capability of small spacecraft to support data-intensive science missions, OCSD will advance the potential to become a more viable option for mission planners.\"\nOCSD differs from other space-based laser communication systems because the laser is hard-mounted to the spacecraft body, and the orientation of the CubeSat controls the direction of the beam. This makes the laser system more compact than anything previously flown in space. The CubeSat will evaluate the ability to point a small satellite accurately as it demonstrates data transfer by laser at rates of up to 200 Mb/s -- a factor of 100 increase over current high-end CubeSat communications systems.\nThe second OCSD mission, scheduled to launch no earlier than Feb. 1 , will use two CubeSats to demonstrate the ability to maneuver small spacecraft in close proximity to one another using low-cost sensors and a novel propulsion system that uses water as a propellant. This technology can enhance the ability of small spacecraft to work in coordination with other satellites to explore asteroids, planets and moons, as well as inspecting other spacecraft.\nAlso aboard the Atlas V were four CubeSats selected through the CubeSat Launch Initiative (CSLI) as part of the Educational Launch of Nanosatellite (ELaNa) XII mission. The satellites successfully deployed from their protective cases and are in orbit. The CubeSats' transmitters turned on, and ground stations listened for their beacons to determine the small satellites' functionality. These CubeSats will test new small satellite control and communications systems, Earth observations, amateur radio communications and an X-Band radio science transponder.\nCSLI provides innovators from non-profit organizations, educational institutions and NASA-sponsored missions with an accessible way to participate in space exploration. ELaNa missions, managed by the Launch Services Program at NASA's Kennedy Space Center in Florida , provide a ride-share opportunity for CubeSats selected through CSLI.\nNASA's Small Spacecraft Technology Program (SSTP) within STMD funds the OCSD project. Aerospace built and operates the OCSD spacecraft. The SSTP office at NASA's Ames Research Center in Moffett Field, California , manages the OCSD project for STMD.\nSmall satellites, including CubeSats, are playing an increasingly larger role in exploration, technology demonstration, scientific research and educational investigations at NASA. They provide a low-cost platform for NASA missions, including planetary space exploration; Earth observations; fundamental Earth and space science; and developing precursor science instruments like cutting-edge laser communications, satellite-to-satellite communications and autonomous movement capabilities. CubeSats also allow an inexpensive means to engage students in all phases of satellite development, operation and exploitation through real-world, hands-on research and development experience on NASA-funded rideshare launch opportunities.\nFor more information about NASA's use of CubeSats, visit:\nhttp://www.nasa.gov/cubesats\nFor more information about NASA's space technology, visit:\nhttp://www.nasa.gov/spacetech\nFor more information about NASA's Small Spacecraft Technology Program, visit:\nhttp://www.nasa.gov/smallsats\nLogo - http://photos.prnewswire.com/prnh/20081007/38461LOGO\n releases/cubesat-to-demonstrate-miniature-laser-communications-in-orbit-300157321.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/cubesat-to-demonstrate-miniature-laser-communications-in-orbit-300157321.html", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnvar/20081007/38461LOGO", "http://photos.prnewswire.com/prnh/20081007/38461LOGO", "http://www.nasa.gov/spacetech", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC24758&Transmission_Id=201510091237PR_NEWS_USPR_____DC24758&DateId=20151009", "http://www.nasa.gov/cubesats", "http://www.nasa.gov/smallsats"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T20:38:09.601+03:00", "highlightTitle": ""}