{"organizations": [], "uuid": "6b06973e082ebe43e79d51b2255901b6087a9d3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/50/e1/6837a2bb417ca91b5cbe610969ac/151009-barack-obama-1160-gty.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/obama-trump-immigration-214635", "country": "US", "title": "Obama slams Trump on immigration", "performance_score": 3, "site": "politico.com", "participants_count": 4, "title_full": "Obama slams Trump on immigration - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:32:00.000+03:00", "replies_count": 3, "uuid": "5a93def386cb070c9515828a445c84c30e47c00a"}, "author": "Jennifer Shutt", "url": "http://www.politico.com/story/2015/10/obama-trump-immigration-214635#post-0", "ord_in_thread": 0, "title": "Obama slams Trump on immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Barack Obama used a campaign stop in Washington State on Friday to criticize the Republican presidential candidates on immigration policy and Donald Trump, specifically, for the way he talks about Latinos. \"How many folks here got a little Irish in them?\" Obama asked. \"There was a time they were talking about the Irish just like Mr. Trump is talking about Mexicans right now.\n\"How many Italians,\" Obama continued. \"They were talking about you, too.\"\nReferring to a proposal from the former reality television star to construct a wall on the U.S.-Mexico border to keep undocumented immigrants from entering the country on foot from Mexico, Obama said that America's \"greatness doesn't come from walls, it comes from opportunity.\"\nThe line appeared to sideswipe the Trump campaign's \"Make America Great Again\" slogan.\n\"Why are all these Republicans so down on America?\" Obama said. \"Listening to them is really depressing and it doesn't match up with the truth.\"\nObama urged those attending a fundraiser for Washington Sen. Patty Murray to get involved in local, state and national politics.\nWhite House\nObama to Putin: Good luck with that By Michael Crowley\n\"Our system is only as good as what we put into it,\" he said, criticizing the \"false prophets who spout things that under examination don't really make any sense, but feed your biases and your fears.\"\n\"I'm proud of the fact that we are not just the party that is against everything,\" Obama said.\nObama stayed away from the leadership chaos in the House on Thursday when Republicans canceled elections for Speaker of the House after Majority Leader Kevin McCarthy withdrew at the last minute.\nHe also did not mention the Democratic presidential primary, which could soon include a match up between Vice President Joe Biden and former Secretary of State Hillary Clinton.\n<div", "external_links": [], "published": "2015-10-09T18:32:00.000+03:00", "crawled": "2015-10-10T06:15:08.265+03:00", "highlightTitle": ""}