{"organizations": [], "uuid": "17c42ab97f1b5b5f230fc0ae6dcace12b992d83d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-07256c2d5cdc7106d912bf1accdad4d4.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/ny-times-wants-to-strip-alien-from-immigration-laws/article/2574477?custom_click=rss", "country": "US", "title": "NY Times wants to strip 'alien' from immigration laws", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "NY Times wants to strip 'alien' from immigration laws | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T11:25:00.000+03:00", "replies_count": 0, "uuid": "17c42ab97f1b5b5f230fc0ae6dcace12b992d83d"}, "author": "Eddie Scarry", "url": "http://www.washingtonexaminer.com/ny-times-wants-to-strip-alien-from-immigration-laws/article/2574477?custom_click=rss", "ord_in_thread": 0, "title": "NY Times wants to strip 'alien' from immigration laws", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American laws that refer to a foreigner residing in the U.S. as an \"alien\" should be scrubbed of that \"dehumanizing\" word, according to the New York Times editorial board.\nOn Tuesday, the Times called on Congress to pass legislation that would strip the word from U.S. immigration laws, as California has done on the local level. The Times said that while the term can be found in various federal laws, many see it as a \"loaded, disparaging word\" that implies immigrants are a \"less-than-human\" burden on the country.\n[T]he term remains firmly embedded in conservative discourse, used by Republicans to appeal to the xenophobic crowd,\" the Times said. \"[Donald] Trump, the leading Republican presidential candidate, uses the term 12 times in his ruinous immigration plan, which calls for the mass deportation of millions of unauthorized immigrants and proposes that Washington bill Mexico to build a wall along the border.\"\n\"It was often uttered by former Gov. Mitt Romney, the 2012 Republican presidential nominee, whose idiotic immigration plan called for 'self-deportation' by unauthorized immigrants,\" the paper added.\n  Muslims oppose U.K.'s tough new counter-extremism program The initiative removes passports of teenagers whose parents suspect of having connections to extremists.\nBy Daniel Chaitin • 10/20/15 12:40 PM The Times continued, \"The federal government should scrub it (\"alien\") from official documents where possible. In the end, though, it will be up to Congress to recognize that there is no compelling reason to keep a hostile term in the law that sets out how immigrants are welcomed into the country.\"\nSeveral mainstream news organizations, including the Associated Press and the Los Angeles Times, have also stopped using the term \"illegal immigrant,\" which editors deemed offensive. The New York Times' policy is to avoid the term, though it has not been entirely banned.\nTop Story Biden: 'I actually like Dick Cheney'   Hillary Clinton's skills working with others.\n  11:33 AM", "external_links": [], "published": "2015-10-20T11:25:00.000+03:00", "crawled": "2015-10-20T20:28:49.223+03:00", "highlightTitle": ""}