{"organizations": [], "uuid": "b2510368033e8ba9100f15e0e0ce0cf3e9696429", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/06/19/ginther2.jpg", "site_section": "http://dispatch.com//content/syndication/news_ohio_politics.xml", "section_title": "Political News - Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/08/Ginther_ethics_proposal.html", "country": "US", "title": "Ginther proposes tougher city ethics laws as questions continue", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Ginther proposes tougher city ethics laws as questions continue | The Columbus Dispatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:57:00.000+03:00", "replies_count": 0, "uuid": "b2510368033e8ba9100f15e0e0ce0cf3e9696429"}, "author": "The Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/08/Ginther_ethics_proposal.html", "ord_in_thread": 0, "title": "Ginther proposes tougher city ethics laws as questions continue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Columbus City Council President and mayoral candidate Andrew J. Ginther has a new plan to improve ethical conduct at City Hall as federal investigations and ethics questions have swirled around him and other Columbus elected officials. \n\nGinther announced today at City Hall that he wants more disclosure from lobbyists and elected officials and assigning city employees to act as ethics advisers for officeholders. \n\nGinther’s announcement comes a few weeks after his mayoral opponent, Franklin County Sheriff Zach Scott, announced his plan for tougher ethics rules. \n\nUnder Ginther’s plan: \n\nThe city would expand the definition of what a lobbyist is and require them to disclose their activities at City Hall. Lobbyists would face tougher penalties for noncompliance than they do now. \n\nElected officials would have to provide a description of all gifts. State law now requires them to disclose only the source fo the gift. \n\nOfficials would be required to adopt an ethics policy, conduct yearly ethics training and appoint someone as an ethics officer. Elected officials would face increased penalties for failure to follow new city laws. \n\nThe city would create an online database of campaign finance reports and require campaign finance filings beyond those the state requires. During election years, candidates would file nine reports – the five required by the state and four more required by the city. \n\nDuring non-election years candidates would file four reports – two more than what is required by the state. \n\nGinther has appointed State Rep. Mike Curtin, D-Marble Cliff, attorney Marchelle Moore and adjunct Ohio State University professor Herb Asher to a committee that will make recommendations to the City Council in the next 90 days, Ginther said. \n\nGinther said the additional campaign finance filing requirement is an important measure to protect the public. \n\n“Our last campaign finance report was (filed) in June,” Ginther said. “Nobody has any idea how much money and who it came from for months. It’s a total dark period that’s a mystery for the people of Columbus until (mid) October when we file.” \n\nCatherine Turcer, a policy analyst with the nonpartisan group Common Cause Ohio, said “real reform” must include limits on campaign contributions. The city has no limits on those contributions. \n\nCouncilman Zach Klein, who is supporting Ginther’s ethics reforms, said he welcomes a discussion about campaign limits. \n\n“I am always interested in talking about campaign finance reforms,” he said. “I am always open to that dialogue to ensure there is openness and so we can be held accountable for our actions.” \n\nScott proposed three weeks ago that city employees should be barred from accepting anything of value from lobbyists, contractors and any person or corporation that has business with the city. Representatives from those groups would be banned from paying or offering to pay any costs to a city employee. \n\nEmployees who participate in trips organized by those groups would have to pay their proportionate share based on current market value. \n\nScott also wants to ban city council members from working for nonprofits that receive city money. \n\nScott said Ginther’s proposals are “weak.” \n\n“Ginther wants to be able to continue his joy rides with his lobbyists,” Scott said. “It’s embarrassing what he’s doing and the voters see right through that stuff.” \n\nFederal investigators have been looking into bribes a former red-light camera company official said she funneled through lobbyist John Raphael and then through the Ohio Democratic and Franklin County Democratic parties to elected officials. \n\nFederal court records show that Redflex sent money through Raphael to the campaigns of Ginther in 2011 and Mayor Michael B. Coleman in 2007. The records also point to a contribution made to the county party at the request of then-City Council President Michael C. Mentel in 2009. \n\nRaphael signed a plea agreement last week on one federal charge of extortion by threats. He faces anywhere up to 20 years in prison. \n\nA second investigation involves the sale of Coleman’s home in 2010 to a Chinese businesswoman who then received help from the city as she tried to open a business to Columbus. \n\nBoth investigations are ongoing. \n\nRaphael also escorted four city council members, including Ginther, Michelle M. Mills, Eileen Y. Paley and Shannon G. Hardin to the Big Ten Championship football game in Indianapolis in December. \n\nThe group traveled in a chartered bus and watched the game from a suite. \n\nGinther paid $250 for the trip using campaign funds weeks after the football game. Paley, Hardin and Mills paid $250 each this summer after news of Raphael’s involvement in the FBI investigation broke in June. \n\nThe fair-market value of the trip would have been $750, according to a travel agency that specializes in such trips, Lucas Oil Stadium officials and three different charter bus companies. \n\nState law requires elected officials to disclose the difference in the cost paid compared to the fair market value if the difference in the value is greater than $75. \n\nHardin and Paley disclosed the trip of their forms. Mills and Ginther did not. Ginther’s campaign said it consulted ethics laws and commission opinions and determined Ginther did not also have to disclose the trip on an ethics form because it was reported on a campaign finance report. \n\nMills abruptly resigned from Council in August and removed herself from the ballot after receiving a subpoena for records from the U.S. Department of Justice.", "external_links": [], "published": "2015-10-08T17:57:00.000+03:00", "crawled": "2015-10-08T22:33:25.103+03:00", "highlightTitle": ""}