{"organizations": ["Nazis", "Fox News", "Treasury", "Muslim", "CNN", "USA Today", "New York Times", "ABC", "Armstrong Williams", "GOP", "Republican Party of New Hampshire", "NBC", "White House", "House", "Nazi Germany"], "uuid": "38dd4423ef8e797043435e6412af4ace942161c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_144382687370642.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/politics/index.rss2", "section_title": "Politics", "url": "http://www.startribune.com/dr-ben-carson-is-a-candidate-unbound/332262102/", "country": "US", "title": "Dr. Ben Carson seems to be a candidate unbound", "performance_score": 0, "site": "startribune.com", "participants_count": 0, "title_full": "Dr. Ben Carson seems to be a candidate unbound", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:42:00.000+03:00", "replies_count": 0, "uuid": "38dd4423ef8e797043435e6412af4ace942161c4"}, "author": "", "url": "http://www.startribune.com/dr-ben-carson-is-a-candidate-unbound/332262102/", "ord_in_thread": 0, "title": "Dr. Ben Carson seems to be a candidate unbound", "locations": ["United States", "Oregon", "America", "Texas", "Germany", "Iowa", "Waterloo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Martha Johnston", "Reagan", "Williams", "Donald Trump", "Giles", "Carly Fiorina", "Obama", "Carson", "Hitler", "Ben Carson", "Fergus Cullen", "Bennett", "Terry Giles", "Merrie Spaeth", "Leon H. Wolf", "Barry Bennett"], "text": "Purchase: Order Reprint For a long time, Ben Carson’s campaign team feared that his habit of inflammatory remarks would sink his presidential hopes. They sent him to media training in Texas. The candidate pledged to police his words. But ever since Carson remarked on Sept. 20 that he did not think a Muslim should be president, then refused to retract the statement amid a furious blowback, his campaign has watched grass-roots support grow and donations pour in — and advisers have backtracked, deciding, in the words of one, to “let Carson be Carson.” Carson, a retired neurosurgeon seeking the Republican nomination, has seemed lately to be a candidate unbound. He has uttered a string of remarks on policy and national events, some divisive and some seemingly uninformed, that have led commentators on the right as well as on the left to question his fitness for the presidency. And yet none of this has deterred elements of the Republican base, which in making 2015 the year of the political outsider see in Carson’s provocative comments a more palatable variation on the bombastic insults of Donald Trump. Both accuse critics of “political correctness.” Now Carson is edging up behind Trump in many polls, with Carly Fiorina, a third outsider candidate, close behind. The three candidates’ collective lack of governing experience is not a disqualification in the eyes of supporters, and is instead seen as their chief asset, particularly as Republicans in the House descend into chaos and many in the party view President Obama as an abject failure. In recent days, Carson seemed to blame the inaction of victims of the massacre at an Oregon community college for their own fate; sounded confused in an interview on public radio on whether there was any difference between the budget deficit and the national debt; and linked the Holocaust to Nazi gun control, later calling an objection by the Anti-Defamation League “total foolishness.” “I respect Dr. Carson for his accomplishments in life, but he’s not prepared to be president of the United States,” said Fergus Cullen, a former chairman of the Republican Party of New Hampshire. “I don’t take his ­policy comments seriously.” Carson’s remarks two weeks ago about a Muslim president came in answer to a question on NBC’s “Meet the Press” about whether a president’s faith should matter. “I would not advocate that we put a Muslim in charge of this nation,” he said. His campaign team cringed at the statement and advised him to retract it, said Armstrong Williams, Carson’s business manager and a top outside adviser. They feared the comment “could be a game changer for him, and not in a good way,” Williams said. But Carson refused, explaining to follow-up interviewers, who noted that the Constitution forbids religious tests for public office, that he meant a Muslim who followed “sharia law” should not be president. “In the past, Dr. Carson was very sensitive to the people in his campaign,” Williams said. “He would listen to others and abandon sometimes what he feels deep down. But for the last two weeks he has said, ‘No.’” “He came alive” following the uproar over the Islam question, Williams said, and a poll for USA Today showed that 3 out of 4 Republicans agreed with him. “He has not backed down from that moment,” Williams said. Campaign manager Barry Bennett said he never suggested Carson retract his statement about a Muslim president. “The left is hyperventilating, thinking that somehow he thinks there is a prohibition on Muslims ­running,” he said. Over three days last week, Bennett added, small donors sent Carson $1 million in reaction to the criticism he was receiving, including his statements about the Oregon shooting. When asked how he would respond to a gunman demanding to know his religion, Carson said on Tuesday, “I would not just stand there and let him shoot me.” Critics interpreted the remark as implying that the victims had not done enough to save themselves. Carson held his ground. “I’m laughing at them and their silliness,” he told Fox News, referring to his critics. Carson also refused to modify a subsequent statement last week about gun control under Hitler. “I think the likelihood of Hitler being able to accomplish his goals would have been greatly diminished if the people had been armed,” he told CNN last week. In response, the Anti-Defamation League issued a statement: “The notion that Hitler’s gun-control policy contributed to the Holocaust is historically inaccurate. The small number of personal firearms available to Germany’s Jews in 1938 could in no way have stopped the totalitarian power of the Nazi German state.” “That’s total foolishness,” Carson said in reply on ABC’s “Good Morning America,” explaining that his point was that tyrants disarm the populace on the way to taking control. Carson has a history of comparing Nazi Germany and the United States, stirring appalled reactions. He has likened political correctness in America to the silence of Germans under the Nazis. Terry Giles, Carson’s former campaign chairman, acknowledged there were some words a politician should avoid. “Hitler and Nazi are two of them,” he said. Carson once seemed to agree. Before declaring his candidacy, he visited Texas for TV coaching from Merrie Spaeth, a White House director of media relations in the Reagan administration. “I’ve come to recognize that when you use certain terms, people can no longer hear anything else you say,” he told the New York Times before his announcement in May. But now Carson seems to have cast off such constraints. As he has climbed in polls and drawn increasing scrutiny, some GOP leaders and right-leaning commentators increasingly doubt his qualifications — based less on his intemperate remarks than his vagueness about policy. Deficit vs. debt In an interview with the public radio broadcast “Marketplace” last week, Carson sounded confused about the difference between budget deficits and the national debt. Asked if he favored lifting the debt ceiling when the Treasury runs out of borrowing authority next month, he said he “would provide the kind of leadership that says, ‘Get on the stick, guys, and stop messing around, and cut where you need to cut, because we’re not raising any spending limits, period.’” Leon H. Wolf, a contributor to the conservative news site RedState, wrote: “It is time to become concerned with the personal diligence of Ben Carson, with respect to the preparation he has put into running for president.” Giles, the former campaign chairman, said Carson understood the difference between the debt and the deficit. He suggested he was tired during the interview, in a week he did dozens to promote a new book. Supporters of Carson often insist he could handle the presidency because he would surround himself with experts. “That is the problem we have now,” said Martha Johnston, a retired surgical nurse in Waterloo, Iowa, who wants a Trump-Carson ticket, or perhaps Trump-Fiorina. “There is no one in those administrative positions that is qualified to be doing the jobs they’re doing.”", "external_links": [], "published": "2015-10-13T03:42:00.000+03:00", "crawled": "2015-10-13T17:42:28.466+03:00", "highlightTitle": ""}