{"organizations": [], "uuid": "1d2bb5943a5bb22f73781e2c538751d0be5cd727", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3215234.1444347969!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/turkey-syria-refugees.jpg", "site_section": "http://rss.cbc.ca/lineup/politics.xml", "section_title": "CBC | Politics News", "url": "http://www.cbc.ca/news/politics/syrian-refugee-crisis-stephen-harper-pmo-audit-1.3262902?cmp=rss", "country": "IL", "title": "Syrian refugee crisis rears up again as campaign issue", "performance_score": 1, "site": "cbc.ca", "participants_count": 1, "title_full": "Syrian refugee crisis rears up again as campaign issue", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:18:00.000+03:00", "replies_count": 0, "uuid": "1d2bb5943a5bb22f73781e2c538751d0be5cd727"}, "author": "Mark Gollom", "url": "http://www.cbc.ca/news/politics/syrian-refugee-crisis-stephen-harper-pmo-audit-1.3262902?cmp=rss", "ord_in_thread": 0, "title": "Syrian refugee crisis rears up again as campaign issue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Syrian refugee crisis makes unexpected return as campaign issue PMO had asked Canadian immigration officials to halt the processing of Syrian refugee cases By Mark Gollom, CBC News Posted: Oct 08, 2015 8:18 PM ET Last Updated: Oct 08, 2015 8:25 PM ET A Syrian refugee carries a sick woman on his back in Akcakale, southeastern Turkey, as they flee intense fighting in northern Syria between Kurdish fighters and Islamic State militants. The PMO had asked for an audit of Syrian refugee cases, temporarily halting their processing. (Lefteris Pitarakis/Associated Press) Stephen Harper says political staff didn't interfere in Syrian refugee applications 0:34 Related Stories Stephen Harper says Canada will not airlift refugees without proper security screening \nIt's unlikely to be a so-called October surprise — an event that could have a drastic effect on the course of the election — but the re-emergence of the Syrian refugee crisis as an issue was unexpected, given how other issues had overtaken the campaign. \nWith the niqab, the recently signed Trans-Pacific Partnership and the results of daily polling making the headlines, the refugee crisis had mostly fallen off the radar, save for its appearance at the election debates. Stephen Harper says Canada will not airlift refugees without proper security screening \nBut a report in the Globe and Mail on Thursday changed the channel, at least for the day. The newspaper reported that the Prime Minister's Office and Harper himself intervened to stop Canadian immigration officials from processing Syrian refugee cases in the spring. \nNot only had the Prime Minister's Office halted the process, the paper said, but it had asked Citizenship and Immigration for the files of some Syrian refugees so they could be vetted by the PMO, a move that would have forced families already declared refugees by the United Nations to wait longer to come to Canada. Mulcair offers strongest rebuke \nNot surprisingly, the reaction poured in from all sides. NDP Leader Tom Mulcair offered the strongest rebuke, saying Harper had already been holding up the refugee process before he \"appeared before us to emote, talking about his own family after seeing the body of that little child on that beach in Turkey.\" \n\"That is abject behaviour on the part of the Canadian prime minister. It is a shame on Canada.\" \nIt seemed to be a tougher stance than the one he took last month, when the picture of Alan Kurdi, the boy who was found dead on the beach, had pushed they Syrian refugee crisis, and Canada's response to it, into the headlines. \nBack then, it seemed, Mulcair was reluctant to cast blame for that particular incident. Instead, it was Liberal Leader Justin Trudeau who was asking for Harper to apologize to the father of the boy. \nOn Thursday, though, Trudeau seemed a little more muted in his comments. He said he wasn't surprised the government intervened in the refugee file, but then went on to criticize it on a more general scale, saying it \"has always behaved in an irresponsible manner and interferes.\" \nWhile the Globe's story said the PMO did not directly respond to a request for comment, on Thursday, the Conservatives certainly reacted. 'Screening out threats' \nFirst came a statement from Citizenship and Immigration Minister Chris Alexander, who said the government doesn't normally comment on leaks, but he acknowledged that it had indeed put a temporary halt to the refugee process and that an audit had taken place. \nHe said an audit of the first tranche of Syrian government-assisted refugees was undertaken as a \"prudent step to ensure the integrity of our refugee referral system.\" \nThat processing resumed \"only after there was confidence that our procedures were adequate to identify those vulnerable persons in most need of protection while screening out threats to Canada,\" he said. \nBut Alexander later sent another updated statement specifically to address the allegations that PMO staffers had vetted the refugee applications themselves. \n\"Political staff are not involved in the approval of refugee applications,\" Alexander added. \"In addition, no change in the status of those approvals occurred, nor could have occurred, as a result of the audit.\" \nAlexander also noted that the process was eventually restarted after a few weeks of delay after no threats were found. It did not affect the processing of privately sponsored files \nHarper himself then addressed the issue at a campaign stop in B.C. Before diving into his stump speech, he insisted that \"political staff are never involved in approving refugee applications.\" \nThose decisions, he said, are made by officials in the Department of Citizenship and Immigration. \nBut why the government decided to conduct an audit at that particular moment seems unclear. A Canadian Press story said the review resulted after U.S. intelligence reports suggested those refugees could pose a risk. \nAnd while the PMO may not have been involved in approving or vetting the refugee applications, it is not known whether it had access to or saw those files. \nConservative candidate Lisa Raitt told CBC's Power & Politics host Rosemary Barton that it was not her understanding that the government has done this before with other refugees. \n\"But I can tell you this, that this was a very unique case,\" she said. \n\"We know that there's lots of strife there. And you want to make sure that you get the most vulnerable, those ethnic and those religious minorities that are truly being wiped off the face of the earth in that place.\" With files from The Canadian Press", "external_links": [], "published": "2015-10-09T03:18:00.000+03:00", "crawled": "2015-10-09T04:34:29.287+03:00", "highlightTitle": ""}