{"organizations": [], "uuid": "7eb4a93c571e3160421cae0841b372b5ab86b9b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww3.hdnux.com/photos/41/43/51/8796762/5/rawImage.jpg", "site_section": "http://www.chron.com/news/politics/collectionRss/RD-Politics-National-heds-18603.php?cmpid=rrpolitics", "section_title": "RD Politics National heds", "url": "http://www.chron.com/news/politics/article/NKorea-to-top-agenda-as-Obama-meets-SKorean-leader-6573688.php", "country": "US", "title": "NKorea to top agenda as Obama meets SKorean leader", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "NKorea to top agenda as Obama meets SKorean leader", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T11:01:00.000+03:00", "replies_count": 0, "uuid": "7eb4a93c571e3160421cae0841b372b5ab86b9b5"}, "author": "MATTHEW PENNINGTON, Associated Press", "url": "http://www.chron.com/news/politics/article/NKorea-to-top-agenda-as-Obama-meets-SKorean-leader-6573688.php", "ord_in_thread": 0, "title": "NKorea to top agenda as Obama meets SKorean leader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 3 Vice President Joe Biden greets South Korean President Park Geun-hye as she arrives for lunch at the Naval Observatory, Thursday, Oct. 15, 2015, in Washington. Vice President Joe Biden greets South Korean President Park Geun-hye as she arrives for lunch at the Naval Observatory, Thursday, Oct. 15, 2015, in Washington. Photo: Andrew Harnik, AP Image 2 of 3 South Korean President Park Geun-hye speaks to the U.S. Chamber of Commerce and the U.S.-Korea Business Council annual meeting in Washington, Thursday, Oct. 15, 2015. South Korean President Park Geun-hye speaks to the U.S. Chamber of Commerce and the U.S.-Korea Business Council annual meeting in Washington, Thursday, Oct. 15, 2015. Photo: Manuel Balce Ceneta, AP Image 3 of 3 South Korean President Park Geun-hye speaks to the U.S. Chamber of Commerce and the U.S.-Korea Business Council annual meeting in Washington, Thursday, Oct. 15, 2015. South Korean President Park Geun-hye speaks to the U.S. Chamber of Commerce and the U.S.-Korea Business Council annual meeting in Washington, Thursday, Oct. 15, 2015. Photo: Manuel Balce Ceneta, AP NKorea to top agenda as Obama meets SKorean leader 1 / 3 Back to Gallery WASHINGTON (AP) — President Barack Obama is welcoming the leader of South Korea to the White House in a show of unity between close allies looking to deter nuclear-armed North Korea while leaving the door open to negotiations. The visit Friday by South Korea President Park Geun-hye follows heightened tensions this summer at the heavily militarized border between the two Koreas, and speculation that North Korea could be planning another rocket launch into space or a nuclear test explosion in defiance of U.N. Security Council resolutions. Park has cultivated closer relations with China as she looks to coax Beijing away from its traditional embrace of Pyongyang. Last month, she prompted handwringing in Washington when she attended a Chinese military parade marking the end of World War II that was snubbed by leaders of most major democracies. Friday's Oval Office meeting and working lunch with Obama is a chance to show that the diplomatic overture to Beijing hasn't weakened South Korea's strong ties with the U.S., which retains 28,500 troops in South Korea, a legacy of the 1950-53 Korean War and the fact that it ended with a truce but not a peace treaty. Park and Obama are expected to compare notes on their respective recent meetings with Chinese President Xi Jinping . They'll also discuss the often-touchy relations among China, Japan and South Korea, whose leaders are to hold a long-awaited summit in Seoul in early November. Park said Thursday that the summit will be an opportunity to improve South Korea's relations with another key U.S. ally, Japan, which would be welcomed by Washington. But it's North Korea that will top the agenda at the White House, and little is likely to change in the allies' stance: standing tough against the threat of any North Korean provocations while remaining open to aid-for-disarmament talks if Pyongyang shows it is sincere about the goal of abandoning nuclear weapons. The North 's leader, Kim Jong Un , however, shows little appetite to engage on those terms. The Obama administration has reconciled with longtime adversaries Cuba and Myanmar, and forged a nuclear deal with Iran, but the administration has faced criticism from hawks and doves alike for a lack of high-level attention on North Korea. The North has conducted three nuclear tests since 2006 and is developing a mobile ballistic missile that could potentially hit the U.S. In August, the two Koreas threatened each other with war after two South Korean soldiers were wounded by land mines Seoul says were planted by the North. The tensions have since eased, and the two sides have agreed to resume next week reunions of Korean families divided by the Korean War. ___", "external_links": [], "published": "2015-10-16T11:01:00.000+03:00", "crawled": "2015-10-16T11:09:03.776+03:00", "highlightTitle": ""}