{"organizations": [], "uuid": "938e973382e3c3793c4ad33cde901388398b1681", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3518154/images/o-BEN-CARSON-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/politics/feed", "section_title": "Politics on Huffington Post", "url": "http://www.huffingtonpost.com/norman-lear/ben-carson-and-the-americ_b_8353156.html", "country": "US", "title": "Norman Lear: Ben Carson and the American Way", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Norman Lear: Ben Carson and the American Way", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:43:00.000+03:00", "replies_count": 0, "uuid": "938e973382e3c3793c4ad33cde901388398b1681"}, "author": "Norman Lear", "url": "http://www.huffingtonpost.com/norman-lear/ben-carson-and-the-americ_b_8353156.html", "ord_in_thread": 0, "title": "Norman Lear: Ben Carson and the American Way", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nI titled my recently published memoir Even This I Get to Experience to express an attitude of openness and even gratitude that I have tried to bring toward the ups and downs of life. I can now add another to the list: Out of the blue, a former business colleague published a column taking me to task for what he thinks are my views on religion and politics, even while he defended irresponsible remarks from presidential candidate Ben Carson. Fay Vincent's recent column recalls that he was one of the people I met with nearly 35 years ago when I was putting together People For the American Way. Fay, as I recall, was known as one of the real gentleman in the entertainment industry at the time. He would later serve honorably as commissioner of major league baseball. I was glad to be reminded of him when I was forwarded his column. But I was surprised by his recollection of our long-ago conversation. Fay writes that I argued that religious beliefs \"should not inform political activity\" and that the purpose of our new organization was \"to try to persuade voters that political actions should not be linked to religious beliefs.\" People For the American Way has never argued that people should not bring their religious and moral perspectives into public life. In fact, I have frequently and publicly chastised political liberals for ceding the language of faith and spirit to those on the far right. What troubled me about the political televangelists of the day was not that they were encouraging fellow conservative Christians to get involved in politics, but that they disparaged the faith and patriotism of people who didn't share their religious beliefs and right-wing political views. And that is exactly what Ben Carson did when he said that he would \"absolutely not\" support a Muslim becoming president of the United States. I am surprised that Fay was moved to write in Carson's defense. I believe it is wrong, and, yes, un-American, to say that a person's faith is a disqualifying factor, the same way it was wrong when some Americans declared that John F. Kennedy could not be trusted to be president because he was Catholic. Fay suggests it was a good thing that Kennedy \"was pressured to assure voters in 1960 his religious beliefs were never going to restrict his freedom to serve as president.\" What Kennedy did in his historic speech to a group of Baptist ministers was to avow his strong support for separation of church and state. As Kennedy made clear, what unites us as Americans is not a set of religious beliefs but the U.S. Constitution, which guarantees freedom of religion for all people and prohibits any religious test for public office. \nAs for Carson's remarks, I note that Kennedy said he did not \"look with favor upon those who would work to subvert Article VI of the Constitution by requiring a religious test -- even by indirection -- for it. If they disagree with that safeguard, they should be out openly working to repeal it.\" \nFollow Norman Lear on Twitter: www.twitter.com/TheNormanLear More:", "external_links": [], "published": "2015-10-21T23:43:00.000+03:00", "crawled": "2015-10-22T04:25:18.236+03:00", "highlightTitle": ""}