{"organizations": [], "uuid": "9149e3331eee4bd46d83fbf2f7d45aaf9d0f0f71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz//politics/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/nation-lisa-owen-interviews-richard-dawkins/5/233455", "country": "US", "title": "On The Nation: Lisa Owen interviews Richard Dawkins", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "On The Nation: Lisa Owen interviews Richard Dawkins", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:46:00.000+03:00", "replies_count": 0, "uuid": "9149e3331eee4bd46d83fbf2f7d45aaf9d0f0f71"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/nation-lisa-owen-interviews-richard-dawkins/5/233455", "ord_in_thread": 0, "title": "On The Nation: Lisa Owen interviews Richard Dawkins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saturday, 3 October, 2015 - 11:46 \nOn The Nation: \nLisa Owen interviews evolutionary biologist and author Richard Dawkins \nLisa Owen: You're back with The Nation. Well, world-famous scientist Richard Dawkins is no stranger to controversy. The evolutionary biologist shot to fame with his book The Selfish Gene and cemented his reputation as a strident atheist with another best-seller, The God Delusion. Professor Dawkins has just published the second volume of his memoirs, Brief Candle in the Dark. In it, he discusses his job as Oxford University's Professor of Public Understanding of Science. Yet recent research suggests a growing gulf between the views of scientists and the public on issues like vaccines and climate change. So I asked him, does he fear people are losing their faith in science? \nRichard Dawkins: I’m not that pessimistic. I think that we have a job to do. I think scientists have a job to do to try to get the message across. There may be a certain amount of organised opposition. In the case of climate change, the organised opposition comes from industry, perhaps especially the oil industry. I’m not sure. And in the case of creationism, of course, it comes from religion. Not sure where it comes from in the case of the anti-vaxers. \nYou’ve talked about the fact that science is evolving, so I’m wondering what bits of science that you would swear by now do you think might be proved wrong in, say, a hundred years or more down the line? \nYeah. That’s a very good question, because, of course, science does advance by rejecting old hypotheses. There are some things that we definitely don’t know yet, and science rejoices in that. So at the outset, I should say, we definitely don’t want to be complacent and say we already know everything, because we don’t, and there’s a lot of exciting new stuff to come in. There are things we do definitely know. Obviously, we know that the planets orbit the sun. I think evolution has now come into that category, for in Darwin’s time, it was controversial. I mean controversial among scientists. It’s still controversial among people who don’t know anything. But I think now it’s probably safe to say that the fact of evolution is an established fact which will never change. So it is a fact that we are cousins to chimpanzees and slightly more distant cousins to monkeys and more distant cousins again to wallabies and so on. So that’s never going to change. There may be things in physics which are going to change. If you look at the history of physics in the 20th century, there’s a rather bewildering series of reversals, and I think that that may change. \nBut when you talk about the fact that evolution is given, there are people who obviously believe other things, so I’m wondering as science evolves and we evolve in our thinking, do you think science and reason will triumph over religious belief? \nEventually, I think they will triumph because I think that education is going to improve. There is no dispute about evolution in the scientific community. The dispute all comes from people who don’t know anything, and so what we’ve got to do is make sure that the number of people who don’t know anything decreases, and that means education. And that’s, of course, difficult sometimes, but that’s our goal. That’s what we’ve got to do. The evidence is there. The evidence is irrefutable. All it should take would be education. \nSo I suppose the counterpoint to thinking that perhaps religion - our thinking about religion - will evolve with education is that it’s already survived thousands of years, and I suppose you could arguably say that in some way that is natural selection in that the belief has survived. \nYes, it has survived, and science has been advancing during that time, especially sort of since, what, the 17th century, 16th century. And science is advancing all time and religion is not, and religion is slowly dying. It’s dying much faster in some countries than others. It’s dying very fast in western and northern Europe, I suspect in New Zealand as well. I don’t know that. It’s dying more slowly in America. America is lagging behind, but it’s still moving in the right direction. \nOne of the fastest-growing religions in the world is Islam, and you seem to be particularly critical of that religion. Why is that? \nWell, Islam is the only religion that’s at the moment positively dangerous. It’s the only religion that is actually attempting to infiltrate the rest of the world and to take it over and, in some cases, actually by violent means. So I think anybody just looking at the politics of the situation would have to worry about it. I mean, if you’d asked me that question 500 years ago, I’d have said Christianity, but Christianity’s teeth have been drawn, comparatively speaking, today. \nIn your book, Professor Dawkins, you talk a lot about poetry and Schubert and music and love. Those things arguably are irrational things, are they? If your argument is religion is irrational, some of the things that we truly love don’t seem to be rational things either. \nOh, well, no. I mean, I think they’re rational. I mean, they have a rational explanation. Things like love, poetic sensibility, music, these are very, very real, very important human experiences, and I talk about them a lot, not just in Brief Candle but in other books as well. So although we may not yet have a scientific explanation for what goes on in the brain, we do know that - well, I think we know - that it’s things that are going on in the brain when you do fall in love or when you swoon at a piece of Schubert or something like that. \nDoes religion work in the same way, though? \nVery probably it does, but, of course, that doesn’t make it true, because religion is not just an emotion. I mean, religion actually does make factual claims about the universe, which, in my view, are false, and the mere fact that people have emotional reactions to them doesn’t make them true. \nBut could it still have some value, then, if you’re having an emotional reaction to it and it fills a space? In that sense, does it have a value? \nI doubt it. \nWhat makes you say that? \nWell, if it’s false, I think that you get a much- you have a much better life and much fuller life, more emotionally rich life if you get to grips with the truth about the universe in which you live, which is poetically wonderful and which dwarfs into insignificance the rather piddling emotions that you can get from religion. \nSo if religion motivates some people to do positive things, even it’s, say, the woman around the corner who drops off some soup to someone from the church, or William Wilberforce, who moves to end slavery, Desmond Tutu, who fought against apartheid, can religion be all bad? \nThose happen to be religious people, but there are much better reasons to be good than religious reasons. Being good for purely religious reasons would probably mean sucking up to God, which would be a rather ignoble reason for doing good. It’s much better to be good because you know it’s good. \nAt the beginning of the book, you talk about how you were involved in exams or interviews for people who were wanting to get into Oxford or Cambridge University, and you were asking lateral questions, if you like, things like why does an animal have a head? Now, I’m curious. What was your motivation in asking those kinds of questions? \nOkay, that’s very interesting. I think you don’t really want to just ask how much an entrance candidate knows. You want to know whether they have the kind of intelligence which will respond to teaching. Is this person going to be teachable? Can I lead this person through a line of reasoning? If you just say, ‘Why do animals have heads?’ I should imagine that the unfortunate student would be a bit sort of baffled, but then that gives me an opportunity to lead the conversation and to have a friendly conversation about a biological question. I never actually did ask that one. I asked things like why do mirrors reverse left-right and not up-down, that kind of question. \nTell me, then, can I ask this question in that same vein, then? How do you know that you’re not dreaming right now? \nVery good question, and that’s one that was asked by a philosophical friend of mine. I don’t think you do know absolutely for certain, but that’s a very beautiful example of that kind of question which doesn’t have a right answer, but you can see whether the student’s eyes light up with interest, ‘Yes, that’s a good question. Let’s talk about that. Let’s discuss that. Let’s bat that back and forth.’ That’s the kind of thing you want to get going in an interview to reduce the student’s fear and let the student show that they’re teachable, let the student show that they’re ready to have an interesting discussion. \nThank you so much for joining me this morning. Professor Dawkins, author of Brief Candle in the Dark, thank you for your time. \nThank you very much. \nTranscript provided by Able. www.able.co.nz \nThe Nation on TV3, 9.30am Saturdays and 10am Sundays. Proudly brought to you by New Zealand on Air’s Platinum Fund. \n ", "external_links": [], "published": "2015-10-03T02:46:00.000+03:00", "crawled": "2015-10-03T08:51:01.817+03:00", "highlightTitle": ""}