{"organizations": [], "uuid": "d0167e98f84c1ac4875e08059b7a27aff04558b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.vice.com", "main_image": "https://news-images.vice.com/images/articles/meta/2015/09/30/911-families-suing-saudi-arabia-suffer-setback-but-theres-hope-in-congress-1443630704.jpg?crop=0.6647173489278753xw:1xh;0.26900584795321636xw,0xh", "site_section": "https://news.vice.com/topic/politics/page/2", "section_title": "Politics | VICE News", "url": "https://news.vice.com/article/911-families-suing-saudi-arabia-suffer-setback-but-theres-hope-in-congress", "country": "US", "title": "9/11 Families Suing Saudi Arabia Suffer Setback — But There's Hope in Congress", "performance_score": 0, "site": "vice.com", "participants_count": 1, "title_full": "9/11 Families Suing Saudi Arabia Suffer Setback — But There's Hope in Congress | VICE News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "d0167e98f84c1ac4875e08059b7a27aff04558b3"}, "author": "Samuel Oakford", "url": "https://news.vice.com/article/911-families-suing-saudi-arabia-suffer-setback-but-theres-hope-in-congress", "ord_in_thread": 0, "title": "9/11 Families Suing Saudi Arabia Suffer Setback — But There's Hope in Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A lawsuit filed by the families of victims and survivors of the 9/11 attacks against Saudi Arabia, alleging that its government was involved in the terror plot, has been dismissed by a federal judge in New York. The ruling determined that the suit's allegations, including that the Saudi government was involved in the terror plot, do not exempt the kingdom from sovereign immunity under American law, which protects it from such legal actions.\nTuesday's decision is the latest blow to the plaintiffs, who have seen their case meander through the courts for over a decade. The case against Saudi Arabia was previously dismissed on similar grounds, only to be reinstated by a federal appeals court in 2013 on the understanding that the extraordinary circumstances surrounding the allegations potentially constituted an exemption to sovereign immunity.\nUS District Judge George Daniels ruled that lawyers for the families and victims had not proven that Saudi Arabia could be sued under the tort exception in the Foreign Sovereign Immunity Act (FSIA), which allows for legal proceedings against foreign government officials if they have committed what is considered a harmful act inside the United States.\n\"Dismissal of the Complaint as to Saudi Arabia and the SHC [Saudi High Commissioner for Relief of Bosnia & Herzegovina — a charity that was also named as a defendant] based upon sovereign immunity is proper,\" wrote Daniels in his decision.\"To strip a presumptive sovereign of immunity, the tortious conduct must be that of the sovereign itself 'or of any official or employee of that foreign state while acting within the scope of his office or employment.' \"\nRelated: White House Considers Declassifying 28 Pages on Alleged Saudi Government Role in 9/11\nLawyers for the plaintiffs have argued that evidence shows that Saudi officials and clerics were involved with several 9/11 hijackers in the months before the attacks. They also complain that many pieces of evidence which could help prove their attempt at achieving a tort exemption remain classified, including a controversial 28-page portion of the US Senate's Joint Inquiry Into Intelligence Community Activities Before and After the Terrorist Attacks of September 11, 2001.\nSeveral legislators who have seen the pages say they directly implicate Saudi Arabia, including former Sen. Bob Graham, who chaired the Joint Inquiry. Graham filed an affidavit on behalf of the plaintiffs in their suit against the kingdom.\n\"I am convinced that there was direct line between at least some of the terrorists who carried out the September 11th Attacks and the government of Saudi Arabia, and that a Saudi government agent living in the United States, Omar al Bayoumi, provided direct assistance to September 11th hijackers Nawaf al Hazmi and Khalid al Mihdhar,\" Graham wrote. \"Based on the evidence discovered by the Joint Inquiry, I further believe that al Bayoumi was acting at the direction of elements of the Saudi government and that an official from the Islamic and Cultural Affairs of the Saudi Consulate in Los Angeles, Fahad al Thumairy, likely played some role in the support network for the September 11th Attacks.\"\nLawyers for Saudi Arabia, referring to wording in the 9/11 Commission report, have dismissed this account as \"speculation,\" and say that the plaintiffs \"have no evidence that Fahad al Thumairy did anything to help al Hazmi or al Mihdhar.\" The government has consistently denied that it played no part in al Qaeda's plot to attack the United States.\nBills have been introduced in both houses of Congress calling on President Barack Obama to declassify the redacted section; even Saudi Arabia's government at one point called for the pages to be released so that it could clear itself of allegations. Families of 9/11 victims have said that the president has privately pledged to do so, but have grown frustrated as no action is taken by his administration.\nRelated: This Bill Would Allow a Lawsuit Over Saudi Government's Alleged Role in 9/11 to Proceed\nApart from the declassification campaign, the latest court decision will invigorate a congressional effort to reform FSIA law and make it impossible for states like Saudi Arabia to use sovereign immunity as a defense in litigation stemming from terrorist attacks in the US. Earlier this month, Sen. Charles Schumer (D-NY) and Sen. John Cornyn (R-Texas) reintroduced the Justice Against Sponsors of Terrorism Act (JASTA), a bill that would do so. Both senators have explicitly tied the legislation to the 9/11 lawsuit against the Saudi kingdom.\n\"The bottom line is that victims of terror on American soil ought to have an ability to hold accountable the foreign powers and other entities that fund the hate-filled organizations that inflict injury and death on our fellow citizens,\" Schumer said in a statement. \"Unfortunately, our courts have prevented that and allowed countries like Saudi Arabia that have provided financial support to terror-linked operations to escape any repercussions.\"\nSean Carter, one of the lawyers representing the plaintiffs, said he would appeal Daniel's ruling.\n\"It's disappointing, but it was always a possibility, given the current state of law and confusion that continues to exist about the law of immunity, which is why Congressional action in passing JASTA is so critical at this moment\" Carter told VICE News.\n\"It also underscores why it's so important for the US government to finally release the evidence in its possession that speaks to Saudi involvement in the emergence of al Qaeda and the events of 9/11,\" he added. \"The fact that the government continues to treat all that evidence as classified has allowed Saudi Arabia to get away with issuing denials and avoiding any inquiry on the merits.\"\nFollow Samuel Oakford on Twitter: @samueloakford\nPhoto via Wikimedia Commons", "external_links": ["https://twitter.com/samueloakford", "https://commons.wikimedia.org/wiki/File:9-11-11_WTC_Tribute_In_Light_from_Jersey_City,_NJ.jpg"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-02T02:46:58.233+03:00", "highlightTitle": ""}