{"organizations": [], "uuid": "2b1d2d16cee084f64a00364c018af3b1993a0e92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/politics/", "section_title": "Politics | ArcaMax Publishing", "url": "http://www.arcamax.com/politics/politicalnews/s-1743091?fs", "country": "US", "title": "How states responded to the gun control debate: a Q&A | Political News", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "How states responded to the gun control debate: a Q&A | Political News | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "2b1d2d16cee084f64a00364c018af3b1993a0e92"}, "author": "arcamax.com", "url": "http://www.arcamax.com/politics/politicalnews/s-1743091?fs", "ord_in_thread": 0, "title": "How states responded to the gun control debate: a Q&A | Political News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With efforts by the Obama administration to toughen gun laws stymied in Congress, states and some cities are stepping into the void, passing laws on both sides of the fiercely contested issue.\nAfter the 2012 attack on Sandy Hook Elementary School in Newtown, Conn., states including New York and Connecticut passed stricter laws, banning assault weapons and limiting high-capacity ammunition magazines. This past week, a federal appeals court upheld the key provisions of those laws, the first time such state bans have been ruled constitutional.\nMeanwhile, the National Rifle Association and other gun-rights groups have been pushing their own pro-gun and pro-hunting laws and count successes in more than 30 states. The NRA filed a friend-of-the court brief seeking to bring the New York and Connecticut laws before the U.S. Supreme Court.\nHere is a scorecard on the complex legal fray and players:\nQ: When did the latest fights begin?\nA: There have always been battles over gun control, but the issue moved to the fore on Dec. 14, 2012, when Adam Lanza invaded Sandy Hook and opened fire using an assault rifle fed by a high-capacity ammunition magazine. He fired 154 rounds in less than five minutes, killing 20 children and six educators in a rampage that began in the morning when he shot his mother to death and ended with Lanza killing himself as police and emergency personnel responded to the school attack. The horror of the violence, particularly the 6- and 7-year-old victims prompted numerous calls for tougher regulation.\nQ: How did the federal government respond?\nA: Within weeks, President Obama announced some executive actions on mental health issues and said he would push Congress to approve mandatory universal background checks on gun sales. That effort failed in the Senate in April 2013, shelving federal gun control legislation.\nQ: How did the states respond?\nA: Although the federal effort was blocked, action on the state level has picked up as states looked at gun-related issues, especially assault weapons and ammunition.\n\"What we are seeing is a number of state legislatures stepping in to do the job that Congress failed to do,\" said Adam Skaggs, senior counsel for Everytown for Gun Safety, a group fighting gun violence.\nBoth Connecticut and New York passed tougher gun-control laws focused on banning assault weapons and high-capacity ammunition magazines. Maryland has passed a similar law, and Colorado banned ammunition magazines that held 15 or more bullets.\nCalifornia has long had some of the nation's toughest laws. For example, possession of automatic firearms and short-barreled shotguns and rifles is generally prohibited. There is also a 10-day waiting period on arms sales. Gov. Jerry Brown this month signed a law that banned concealed weapons on K-12 and college campuses.\nIn June, Texas lawmakers made carrying a concealed weapon on public college campuses legal as of August 2016. Similar measures are being debated in Florida, Michigan and Ohio.\nThe New York and Connecticut laws passed after Sandy Hook were immediately challenged in federal court by a coalition of firearms dealers, sports enthusiasts, gun owners and Second amendment advocates. A separate suit on the Maryland law is pending in the courts, as are some suits involving municipal ordinances, including one in Wheaton, Ill., which Skaggs said banned assault weapons and high-capacity magazines.\nThis summer, the Los Angeles City Council unanimously approved a ban on possessing firearm magazines that can hold more than 10 rounds of ammunition. On Friday, a coalition of gun rights supporters, including the California Rifle and Pistol Association and California Reserve Police Officers Association, filed suit to overturn the ban.\nQ: What happened to the legal challenge?\nA: Federal courts upheld the New York and Connecticut laws in separate cases that were consolidated on appeal to the 2nd U.S. Circuit Court of Appeals in Manhattan. That court upheld the key parts of the laws on Monday, but not all.\nThe court struck down as unconstitutional a Connecticut provision that banned a non-semiautomatic Remington 7615, saying that the state had failed to present any argument about the weapon. In the New York case, the court struck down the part of the law that said only seven bullets could be loaded in a 10-bullet magazine.\nQ: What do those who lost say?\nA: Tom King, president of New York State Rifle and Pistol Association, the lead plaintiff, said the group plans to appeal to the U.S. Supreme Court. King is also a member of the national board of the NRA, which has been involved in the case. In its brief, the NRA argued that the states' restrictions infringe upon the \"core\" Second amendment right of self-defense. \"So now we must look to the highest court in the land to reverse this decision and reaffirm our constitutional right to self protection,\" the group said.\nQ: What other gun issues have been fought on the local levels?\nA: The state level -- whether legislative or through ballot measures -- is an important battleground, said Skaggs of Everytown for Gun Safety.\nSince Sandy Hook, six states have expanded requirements for comprehensive background checks for the private sale of weapons, bringing the total to 18 states that require criminal background checks on handguns.\nThe group has pushed strongly for protection for victims of domestic abuse, and in nine states -- Alabama, Delaware, Louisiana, Maine, Nevada, Oregon, South Carolina, Vermont and Washington -- succeeded in passing laws to keep guns out of the hands of abusers. Similar legislation has passed in New Jersey and now awaits action by the governor. Similar laws were passed in 2014 in Minnesota, New Hampshire and Wisconsin, according to the group.\nLegislatures are gearing up for their 2016 sessions, and Skaggs said he expects more states to act on gun violence issues related to domestic abuse, an issue that seems to cross party lines and has been supported by some Republican governors and lawmakers.\nQ: What has the NRA done?\nA: The NRA is at work at the state level promoting pro-gun and pro-hunting legislation, said spokeswoman Amy Hunter.\n\"The states continue to pass pro-Second Amendment legislation by a more than a 3-to-1 margin,\" she said in an email.\nAccording to the group's count, 33 states approved 98 NRA-backed pro-gun or pro-hunting bills in 2013. That same year, 10 states signed 21 anti-gun bills.\n\"There does seem to be more gun-control action on the state level,\" Hunter said, and she blamed well-financed opponents like Everytown for generating headlines.\n\"The issue is getting more coverage because we're in the midst of a presidential primary season and all the Democratic contenders are racing to the left of each other to generate votes,\" she stated. \"Additionally, there is a concerted effort among the gun-control groups, the media, and pro-gun-control public officials like ... President Obama to exploit recent high profile tragedies to generate headlines and drive a political agenda.\"\nQ: What has been President Obama's role?\nA: As much as Sandy Hook pushed the gun debate in 2012, the recent shooting at Umpqua Community College in Roseburg, Ore., is driving it now. Christopher Harper-Mercer, 26, killed nine people at the school then killed himself on Oct. 1.\n\"That is an area where ... I feel that I've been most frustrated and most stymied,\" Obama said of gun control at a nationally televised news conference, his 15th response to a mass shooting since taking office.\nObama has asked his administration to look for executive actions he could take to get around the congressional stalemate. Among the options being considered is a change in federal regulations to ensure that high-volume gun show and Internet purchasers are subject to background checks, a move that would almost certainly be challenged in court.\n(c)2015 Los Angeles Times\nVisit the Los Angeles Times at www.latimes.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/politics/politicalnews/s-1743091&h=How+states+responded+to+the+gun+control+debate%3A+a+Q%26A", "http://twitter.com/share?url=http://www.arcamax.com/politics/politicalnews/s-1743091&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/politics/politicalnews/s-1743091"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T00:01:10.042+02:00", "highlightTitle": ""}