{"organizations": ["House"], "uuid": "3790ffb47f43c2a88ded9a31b77c0fc5aec11c91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local21news.com", "main_image": "http://local21news.com///template/stories/2015/10/07/images/NDE0MTAxNThmMzc0.jpg", "site_section": "http://local21news.com/news/features/politics-and-government/rss.xml", "section_title": "whp Politics and Government", "url": "http://www.local21news.com/news/features/politics-and-government/stories/House-expected-to-vote-on-Governor-39-s-tax-plan-215539.shtml", "country": "US", "title": "House expected to vote on Governor's tax plan", "performance_score": 0, "site": "local21news.com", "participants_count": 0, "title_full": "House expected to vote on Governor's tax plan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T09:00:00.000+03:00", "replies_count": 0, "uuid": "3790ffb47f43c2a88ded9a31b77c0fc5aec11c91"}, "author": "", "url": "http://www.local21news.com/news/features/politics-and-government/stories/House-expected-to-vote-on-Governor-39-s-tax-plan-215539.shtml", "ord_in_thread": 0, "title": "House expected to vote on Governor's tax plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House expected to vote on Governor's tax plan \nUpdated: Wed, Oct 07 2015, 06:00 AM \nBy: Michael Gorsegner \nHARRISBURG, Pa. -- The Governor’s latest tax package plan is expected to go before the House Wednesday for a vote. After months of negotiating, the Governor changed the numbers just the day before, in hope of convincing at least 18 Republican lawmakers to jump ship and vote in favor of his broad based tax increase.“Twelve point seven million are faced with a problem and that is, if we don't balance this budget after years of not doing it in a bipartisan way, we are going to have serious problems this year and even bigger problems next year,” said Governor Tom Wolf on Monday when he presented the problems facing the state’s finances. The newest plan includes a $1.4 billion tax increase, with the Governor pushing for much of that money to go towards education and health and human services. But some of the numbers have changed and now it’s up to the House today to determine if these numbers will live or be dead on arrival.One of the biggest changes to the tax structure could be an increase in the personal income tax increase, from the current 3.07 percent to 3.57 percent. That increase represents a $250 rise a year for a person making $50,000.The new numbers also include a severance tax on gas drillers while providing property tax relief for seniors and the disabled. The Governor says last year's budget was balanced by a practice of shifting around money, not really taking care of the budget holes. That method put the state in a dire financial position for the next two years.“It's one thing to say we are not raising taxes and that we are going to cut expenditures but we need to do it honestly. This is not at all honest and we need to stop it,” Governor Wolf said.These are numbers that are not presumably going to sit well with Republican lawmakers. The GOP generally opposes any broad based tax increases. They are still mad the governor vetoed a stop-gap measure that would have released some funding to schools and human services in need of the cash.Wednesday is expected to be a test. House republicans called for the vote to prove to the Governor that he doesn't have the 102 votes in the House to get his tax increases passed. They hope that if the Governor's measure fails, he will scrap those numbers and begin negotiating in a different direction. Related Stories", "external_links": [], "published": "2015-10-07T09:00:00.000+03:00", "crawled": "2015-10-08T11:39:05.407+03:00", "highlightTitle": ""}