{"organizations": [], "uuid": "f44a535ca72a248b60182eaa638be130ce77d52c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com/asset/1200_630/562a2a211400001b013c8f5e.jpeg?cache=j4ZMn3wDup", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/news.xml", "section_title": "Politics News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/jon-stewart-beard_562a2974e4b0ec0a38940511", "country": "US", "title": "Jon Stewart Looks Different In New Life As A Bearded Farmer", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Jon Stewart Looks Different In New Life As A Bearded Farmer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:38:00.000+03:00", "replies_count": 0, "uuid": "f44a535ca72a248b60182eaa638be130ce77d52c"}, "author": "Todd Van Luling", "url": "http://www.huffingtonpost.com/entry/jon-stewart-beard_562a2974e4b0ec0a38940511", "ord_in_thread": 0, "title": "Jon Stewart Looks Different In New Life As A Bearded Farmer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jon Stewart Looks Different In New Life As A Bearded Farmer The daily grow. Todd Van Luling Senior Staff Writer, The Huffington Post Posted: 10/23/2015 09:38 AM EDT | Edited: 16 minutes ago Brad Barket via Getty Images \nIt has only been a few months since Jon Stewart's departure from \"The Daily Show,\" but with the changing of seasons comes a new, hirsute Stewart. \n\"CBS This Morning\" anchor Gayle King traveled to the comedian's farm in New Jersey for a segment titled \"Animal House,\" which made it to air yesterday. (Tracey Stewart, Jon's wife, recently published Do Unto Animals , about helping pets and wildlife.) King attempted to get the dirt on Stewart's new life, but instead discovered Stewart was happy to be \"surrounded by manure.\" \nFarmer Stewart's greatest crop is his new beard, which will presumably continue to grow under the coming winter sun. \"CBS This Morning\" \nDuring the segment, Stewart talked about his new life of car washes and eating pizza while driving. \nStewart also joked about giving Pope Francis the idea for the mantra, \"Do unto others as you would have them do unto you.\" \"His original message was much different ... something like, 'Get it while the gettin's good,\" Stewart joked. \"I told him, I don't think that's gonna fly.\" \n\"The Daily Show\" recently won yet another Emmy, which led to Stewart joking during his acceptance speech, \"To everybody on television, I just want to tell you: cling to it, as long as you can.\" Stewart continued, \"Like death. Like in Titanic … I have been off of television for six or seven weeks and this is the first applause I've heard. It is a barren wasteland out there.\" \nIn King's segment, Stewart said that he hasn't \"for a moment\" missed \"The Daily Show\" besides the people with whom he'd worked. According to Stewart, he felt it was \"completed\" and that the final product was best he'd ever do with the show. Stewart spoke about \"the joys in creating it, in growing it, in evolving it, maintaining it,\" most likely referring to the show, but maybe that was just beard talk. \nStewart's beard may just be the cash crop that saves this economically ailing country. If only there was still a television program that would show us daily what's going on with this perpetually bushy world.", "external_links": [], "published": "2015-10-23T16:38:00.000+03:00", "crawled": "2015-10-23T17:05:16.165+03:00", "highlightTitle": ""}