{"organizations": [], "uuid": "4d4067c59b4bfb8c7bb0e0f173700851c185265b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "http://d1u4oo4rb13yy8.cloudfront.net/facebook-vtjxfhapck-1445340302.jpg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/763702/gopalkrishna-gandhi-the-governments-response-to-rising-intolerance-is-most-worrisome", "country": "SG", "title": "Gopalkrishna Gandhi: The government's response to rising intolerance is most worrisome", "performance_score": 1, "site": "scroll.in", "participants_count": 1, "title_full": "Gopalkrishna Gandhi: The government's response to rising intolerance is most worrisome", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:30:00.000+03:00", "replies_count": 0, "uuid": "4d4067c59b4bfb8c7bb0e0f173700851c185265b"}, "author": "Binoo K John", "url": "http://Scroll.in/article/763702/gopalkrishna-gandhi-the-governments-response-to-rising-intolerance-is-most-worrisome", "ord_in_thread": 0, "title": "Gopalkrishna Gandhi: The government's response to rising intolerance is most worrisome", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "INTERVIEW Gopalkrishna Gandhi: The government's response to rising intolerance is most worrisome The former West Bengal governor feels that the Modi government has a Yogic detachment from the abrasive nationalism dominant in India today. · Today · 06:30 pm Photo Credit: IANS Gopalkrishna Gandhi is the former governor of West Bengal and a retired civil servant. In this interview, the grandson of the Mahatma discusses the air of intolerance in the country, the associated climate of fear and the government's response to it. Gandhi also expresses his pain at the country careening away from its core values and supports the idea of writers being an integral part of the resistance. Do you think the general atmosphere of intolerance today is the creation of the central government and has its silent sanction? Or are the incidents of intolerance spontaneous and unconnected? There is a sense of anxiety over rising intolerance and a sense of fear over the government not stopping or condemning acts of intolerance. The rise in intolerance and fear of the immunity that intolerance seems to enjoy are intimately connected. Is the apprehension over a created climate of fear valid? Ask the kin of those who have been murdered and those who have been assaulted and intimidated. You will find the answer. Is the Narendra Modi government caught in the tricky position of having to remain silent and at the same time show some token opposition? Does what the prime minister or the Bharatiya Janata Party say satisfy you? The government's response is not only unsatisfying, but is also most worrisome. Do you recall a similar situation or climate in the past? In the past, there have been acts of vandalism in connection with artwork as well as threats to artists and writers. There have been cases of self-appointed guardians of public morality turning violent. But today, those sporadic acts have been joined by a menu of intolerant vegetarianism, ferocious religiosity and abrasive nationalism. And overarching this is a kind of unknowing, undisturbed Yogic detachment on the part of the government, which does not convince me of its benignity. Should writers always be at the forefront of resistance? Are they conscience keepers of the nation? Writers use words, which are the vehicles of thought. They have a natural responsibility to speak up when free thought and free speech are under attack. Writers like Paul Zacharia have questioned the logic of returning awards presented at another time by another set of writers. Does this argument make sense? The Sahitya Akademi award links the recipient to the ethos of the organisation. And when a recipient feels that the Akademi has committed a grave error such as not condemning the attacks on free expression, then severing that link by returning the award is most natural. Is the Sahitya Akademi a body that reflects the political thinking of the day? It should reflect Sahitya, not Rajya.  ", "external_links": [], "published": "2015-10-21T21:30:00.000+03:00", "crawled": "2015-10-21T16:44:01.511+03:00", "highlightTitle": ""}