{"organizations": [], "uuid": "b9b412372d96e9189e7feebfe3c015ea82a4fdbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30328368/maryland-live-casino-and-uso-metro-celebrate-record-breaking-stars-stripes-benefit-for-the-troops", "country": "US", "title": "Maryland Live! Casino And USO-Metro Celebrate Record-Breaking \"Stars & Stripes Benefit for the Troops\"", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Maryland Live! Casino And USO-Metro Celebrate Record-Breaking \"Stars & Stripes Benefit for the Troops\" - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "b9b412372d96e9189e7feebfe3c015ea82a4fdbf"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30328368/maryland-live-casino-and-uso-metro-celebrate-record-breaking-stars-stripes-benefit-for-the-troops", "ord_in_thread": 0, "title": "Maryland Live! Casino And USO-Metro Celebrate Record-Breaking \"Stars & Stripes Benefit for the Troops\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Maryland Live! Casino\nAnnual Casino Night Fundraiser, Presented by Live! Casino, Raises $185,000 to Benefit Active Duty Troops and Their Families\nHANOVER, Md. , Oct. 22, 2015 /PRNewswire/ -- Maryland Live! Casino, an affiliate of The Cordish Companies, and the USO of Metropolitan Washington-Baltimore are celebrating the success of one of the most anticipated USO fundraisers of the year. The annual \"Stars & Stripes Benefit for the Troops,\" a casino night fundraiser sponsored by Maryland Live! for three consecutive years, raised $185,000 , making it the USO's most profitable event to date.\nOne of the more unique aspects of the \"Casino Night\" event is the presence of actual Maryland Live! Dealers, who volunteer their time to work the table games, adding a level of excitement and authenticity not found in typical casino-themed fundraisers.\n\"Maryland Live!'s title sponsorship of the event made all the difference and pushed us to exceed our fundraising goals,\" said Elaine Rogers , President/CEO, USO Metropolitan Washington-Baltimore. \"Without the support of corporate partners like Live!, the USO would not be able to do the programs we deliver 365 days a year to active military personnel and their families. Not only do they offer financial support to us, but they bring their employees as volunteers, which is a very special way to say thank you to the men and women who serve our country.\"\nAs the State of Maryland's premier gaming and entertainment destination, as well as one of the largest commercial casinos in the country, Maryland Live! Casino takes great pride in its role as a leading corporate partner and community steward. From its executive team to its family of employees, Maryland Live! embraces its commitment to make a positive difference in the lives of those living and working all across Maryland and Metro DC through its financial support and volunteer efforts to help meet the critical needs of the community.\nLocated in close proximity to Fort Meade, Maryland Live! is dedicated to supporting USO endeavors to benefit military personnel with philanthropic outreach and volunteerism on a regular basis.\n\"The USO and Fort Meade are our neighbors and partners, so we are very pleased that our sponsorship could make such a tremendous impact on the success of the Stars & Stripes event,\" said Doug Shipley , General Manager, Maryland Live ! Casino. \"I'm proud of our team, which takes part in the event every year, and proud that our company makes community service and involvement a key component of our corporate culture.\"\nAbout Maryland Live! Casino\nMaryland Live! Casino is conveniently located at the Arundel Mills Mall, halfway between Baltimore and Washington , directly off the Baltimore-Washington Parkway at Arundel Mills Blvd. and Route 100 in Hanover, MD ( Anne Arundel County ), with easy access off I-95 at Route 100. Open 24/7, the $500+ million Maryland Live! Casino is one of the largest commercial casinos in the country with more than 200 live action table games, including Blackjack, Craps, Roulette, Baccarat, Pai Gow , and a Poker Room; approximately 4,000 of the latest slot machines; and two High Limit rooms. A variety of irresistible dining options include Bobby's Burger Palace, from celebrated chef Bobby Flay ; The Cheesecake Factory®; Phillips® Seafood; the Zagat-rated #1 steakhouse The Prime Rib®; the multi-station Live! Buffet; Noodles, featuring traditional Ramen noodles, bánh mì sandwiches and phð soups; Luk Fu , serving authentic South East Asian cuisine; and Morty's Delicatessen, a traditional New York-style deli. A sizzling nightlife, including live entertainment at Rams Head Center Stage and the unique, interactive R Bar, completes the world-class gaming and entertainment experience. Other first-class amenities include the Shop Live! retail store; a bus lounge, and a secure covered 5,000-space parking garage with valet service, free self-parking and direct elevator access to the casino floor. Maryland Live! is owned and operated by a company that is affiliated with The Cordish Companies. Call 855-5MD-LIVE (855-563-5483); or visit www.marylandlivecasino.com or www.myliveonlinecasino.com Follow Maryland Live! Casino on Facebook and Twitter. For employment opportunities, visit www.jobsatmarylandlivecasino.com .\nAbout The Cordish Companies\nThe Cordish Companies' origins date back to 1910 and encompass four generations of privately-held, family ownership. During the past ten decades, The Cordish Companies has grown into a global leader in Real Estate Development, Gaming & Hospitality, Entertainment Management and International Urban Planning & Development. One of the largest and most respected developers in the world, The Cordish Companies has been awarded an unprecedented seven Urban Land Institute Awards for Excellence for public-private developments that are of unique significance to the cities in which they are located. Prime examples are The Cordish Companies' prominent role in the redevelopment of Baltimore's world famous Inner Harbor; Philadelphia, PA ; Atlantic City, NJ ; Charleston, SC ; Houston, TX ; Louisville, KY ; Kansas City, MO and St. Louis, MO. In addition, The Cordish Companies has developed and operates multiple highly acclaimed entertainment destinations throughout the United States which welcome over 50 million visitors per year and are the most visited destinations in their respective regions. Over the generations, The Cordish Companies has remained true to the family's core values of quality, entrepreneurial spirit, long-term personal relationships and integrity. As a testimony to the long-term vision of its family leadership, The Cordish Companies still owns and manages virtually every business it has created. For more information visit www.cordish.com .\n\"The Cordish Companies,\" \"The Cordish Company\" and \"Cordish\" are trademarks used under license by independent corporations, legal liability companies and partnerships (\"Cordish Entities\"). Each Cordish Entity is a separate, single-purpose legal entity that is solely responsible for its obligations and liabilities. No common operations or financial interdependency, and no intermingling of assets or liabilities of the Cordish Entities exists, or should be deemed to exist, as a result of the potential common reference to multiple independent entities operating under the names \"Cordish,\" \"The Cordish Companies\" or \"The Cordish Company\" here or elsewhere.\nPhoto - http://photos.prnewswire.com/prnh/20151022/279718\n releases/maryland-live-casino-and-uso-metro-celebrate-record-breaking-stars--stripes-benefit-for-the-troops-300164926.html\n ", "external_links": ["http://www.cordish.com/", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20151022/279718", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH36195&Transmission_Id=201510221507PR_NEWS_USPR_____PH36195&DateId=20151022", "http://www.marylandlivecasino.com/", "http://www.prnewswire.com/news-releases/maryland-live-casino-and-uso-metro-celebrate-record-breaking-stars--stripes-benefit-for-the-troops-300164926.html", "http://www.myliveonlinecasino.com/", "http://www.jobsatmarylandlivecasino.com/", "https://photos.prnewswire.com/prnvar/20151022/279718"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T23:09:02.371+03:00", "highlightTitle": ""}