{"organizations": [], "uuid": "e14eb3619a6a067d7e5aa4060ac3d13bde93b1a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/169585/ap-political-news-video", "section_title": "AP Political Video - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30154711/latest-oklahoma-prison-director-takes-no-questions-on-stay", "country": "US", "title": "Latest: Oklahoma prison director takes no questions on stay", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Latest: Oklahoma prison director takes no questions on stay - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "e14eb3619a6a067d7e5aa4060ac3d13bde93b1a6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30154711/latest-oklahoma-prison-director-takes-no-questions-on-stay", "ord_in_thread": 0, "title": "Latest: Oklahoma prison director takes no questions on stay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OKLAHOMA CITY (AP) - The latest on the scheduled execution of an Oklahoma death row inmate Richard Glossip, who was convicted of ordering the 1997 beating death of his boss but claims he was framed by the actual killer (all times are local):\n4:30 p.m.\nThe head of Oklahoma's prison system refused to answer questions from the media after Gov. Mary Fallin issued a last-minute execution stay for inmate Richard Glossip.\nDepartment of Corrections Director Robert Patton spoke briefly to reporters shortly after the execution was postponed until November. The corrections department had said it was prepared to go forward with Glossip's execution earlier Wednesday but all came to a halt by mid-afternoon.\nThe governor said in a statement that questions arose over the use of potassium acetate, which would have been the third drug in the lethal injection. Oklahoma has previously used potassium chloride in that role.\nPatton said his office requested the stay \"out of due diligence.\" He walked away from reporters at the Oklahoma State Penitentiary without answering questions.\n___\n4 p.m.\nGov. Mary Fallin has granted a last-minute stay for an Oklahoma inmate who was set to be executed Wednesday afternoon.\nFallin's stay for Richard Glossip came about an hour after the U.S. Supreme Court rejected Glossip's request to halt his execution. In her order, Fallin granted a 37-day stay for Glossip, saying the state needed to determine whether its use of a new drug - potassium acetate - was in compliance.\nFallin reset Glossip's execution for Nov. 6.\nGlossip has maintained his innocence in the 1997 beating death of an Oklahoma City motel owner.\n___\n3:10 p.m.\nAbout 30 people have gathered in front of the Oklahoma Governor's Mansion to protest the scheduled execution of death row inmate Richard Glossip.\nThe protesters held signs that read \"Don't Kill For Me, Stop Executions\" and \"Save Richard Glossip.\" Glossip was scheduled to be executed Wednesday for his role in the 1997 beating death of the man who owned the motel where he worked.\nA spokesman for the group, the Rev. Adam Leathers, says death penalty opponents hope Glossip's execution will be halted. Leathers says the state is executing a person with little evidence against him.\nACLU of Oklahoma executive director Ryan Kiesel says he believes Glossip is not guilty of a death-penalty offense. Kiesel says there is no justification for Glossip's execution other than \"the politics of convenience.\"\n___\n2:55 p.m.\nThe U.S. Supreme Court has denied an Oklahoma death row inmate's request to halt his execution, paving the way for his lethal injection to be carried out at the Oklahoma State Penitentiary in McAlester.\nIn a brief order Wednesday, the court denied Richard Eugene Glossip's petition to have the justices take up his case and stop his scheduled execution.\nGlossip has maintained his innocence despite being convicted twice for his role in the 1997 beating death of Barry Van Treese, the owner of an Oklahoma City motel Glossip managed. Glossip's attorneys claim they have new evidence that suggests co-defendant Justin Sneed acted alone. The new evidence includes a signed affidavit from another inmate who said he heard Sneed say he framed Glossip.\n___\n2:25 p.m.\nOklahoma prison officials are delaying a scheduled execution while waiting on the U.S. Supreme Court to consider a request to halt the punishment.\nLawyers for Richard Glossip say the death row inmate deserves a hearing on a claim that he is innocent. The Oklahoma Court of Criminal Appeals rejected the request Tuesday.\nGlossip was due to die at 3 p.m. Wednesday, but Department of Corrections spokeswoman Terri Watkins says the agency will wait until hearing from the Supreme Court on whether Glossip's execution should move forward.\nGlossip was convicted of having a co-worker kill their boss at an Oklahoma City motel in 1997. The motel's owner had found a discrepancy in the motel's books.\nSuch a delay is not unprecedented. Before Charles Warner was executed in January, Oklahoma prison officials waited about an hour before proceeding while justices considered whether the sedative midazolam was an appropriate drug to use.\n___\n11:35 a.m.\nBritish billionaire Richard Branson took out a full-page ad in The Oklahoman newspaper urging the state to stop the planned execution of an inmate who argues he's innocent.\nThe Virgin Group founder placed the ad in Wednesday editions, the same day Richard Glossip is scheduled to be executed for ordering the 1997 killing of a motel owner in Oklahoma City. The notice is also posted on Branson's blog.\nThe ad encourages residents to contact Gov. Mary Fallin's office and request a 60-day stay of execution. The ad says there is a \"breathtaking\" lack of evidence in the case, and that Glossip deserves more time to prove his innocence.\nBranson is the latest high-profile person to come out against Glossip's execution. Hollywood actress Susan Sarandon and death penalty opponent Sister Helen Prejean also have taken up Glossip's cause.\n___\n11:05 a.m.\nOklahoma's attorney general is urging the U.S. Supreme Court to not halt Wednesday's execution of an inmate who maintains his innocence in a 1997 killing.\nIn a court filing, Attorney General Scott Pruitt says justices should not issue a stay for Richard Glossip's execution, which is set for 3 p.m.\nGlossip was initially scheduled to be executed Sept. 16. But just hours earlier, he was granted a two-week reprieve by the Oklahoma Court of Criminal Appeals. The court later declined to hold a hearing in Glossip's case, so he asked the U.S. Supreme Court to intervene.\nPruitt says granting another stay to Glossip would be \"a travesty of justice.\"\nGlossip's attorneys argued in a brief Wednesday morning that too much doubt exists for Glossip's execution to go forward.\n9:30 a.m.\nA representative for Pope Francis has asked Oklahoma Gov. Mary Fallin to commute the death sentence of a man set to be executed Wednesday afternoon.\nThe letter from Archbishop Carlo Maria Vigano is dated Sept. 19, but was released Wednesday by the governor's office. Vigano, who is Francis' diplomatic representative in the U.S., requested that Fallin commute the death sentence of inmate Richard Glossip.\nThe letter says a commutation \"would give clearer witness to the value and dignity of every person's life.\"\nA spokesman for Fallin says the governor does not have the authority to grant a commutation.\nVigano sent a similar letter Tuesday to officials in Georgia, but that didn't prevent the execution of Kelly Renee Gissendaner. During the pontiff's visit last week to the U.S., Francis urged Congress to abolish the death penalty.\n___\n12:15 a.m.\nA death row inmate's scheduled execution for his role in a 1997 motel killing would be the first in Oklahoma since the nation's highest court upheld the state's three-drug lethal injection formula.\nRichard Glossip is scheduled to be executed Wednesday at the Oklahoma State Penitentiary in McAlester, despite his claim of innocence. A request for a stay of execution is pending with the U.S. Supreme Court.\nGlossip was the lead plaintiff in a separate case in which his attorneys argued the sedative midazolam did not adequately render an inmate unconscious before the second and third drugs were administered.\nThey said that presented a substantial risk of violating the Eighth Amendment prohibition on cruel and unusual punishment. But in June, the justices voted 5-4 that the sedative's use was constitutional.\n ", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T01:21:24.461+03:00", "highlightTitle": ""}