{"organizations": [], "uuid": "2491cfc6a715fffc161aa294dd1f03765bb954a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/06/25/be/b0/200x200-social-media-icon_GENERIC.jpg", "site_section": "http://www.palmbeachpost.com/s/floridanews/", "section_title": "Florida Politics and Legislative News | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/news/opinion/commentary-politics-not-safety-is-behind-uber-back/nnsHc/", "country": "US", "title": "Commentary: Politics, not safety, is behind Uber backlash", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Commentary: Politics, not safety, is behind Uber backlash | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:00:00.000+03:00", "replies_count": 0, "uuid": "2491cfc6a715fffc161aa294dd1f03765bb954a0"}, "author": "Abigail R. Hall", "url": "http://www.palmbeachpost.com/news/news/opinion/commentary-politics-not-safety-is-behind-uber-back/nnsHc/", "ord_in_thread": 0, "title": "Commentary: Politics, not safety, is behind Uber backlash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A judge in Tampa recently ruled that Uber could operate in the city and surrounding area. Uber, a U.S.-based international company whose smartphone app enables consumers to find rides efficiently any time, has come under fire throughout the country and world for threatening the traditional regulated taxi industry.\nDespite the ruling, however, Uber and its competitor, Lyft, aren’t out of the woods. The Hillsborough County Public Transportation Commission voted unanimously to appeal the ruling, and, strangely, the police continue to write Uber drivers tickets for picking up passengers.\nThe stated reason that government agencies give for wanting to ban or restrict Uber is safety. Taxicabs are safer, so the argument goes, because their drivers are specially licensed by a government regulatory agency and are subject to background checks. Uber and Lyft drivers are not licensed in this way, putting passengers at risk, or so it is said.\nThis allegation was made clear in Tampa. In discussing the ruling, Public Transportation Commission Executive Director Kyle Cockream stated, “These elected officials … do not want to see the day when the front page of the (newspapers) say there are two bodies of two University of Tampa females found in a ditch.”\nNow that statement hits home. I live in Tampa and teach at the University of Tampa. Those two females could be my students. I care about my students dearly and would never advocate anything that would place them unnecessarily in harm’s way.\nWhile Cockream might be well-intentioned, he’s wrong. Banning Uber has had little to do with safety and everything to do with bureaucratic logrolling and bloated government paternalism.\nTrue, a cursory Google search produces reports of Uber drivers mistreating their passengers — from petty crimes to heinous felonies. However, a second quick Google search finds just as many, if not more, stories of licensed taxi drivers doing the same. So while getting into an Uber car may be risky, no substantive evidence indicates that it’s more dangerous than riding in a taxi. In fact, multiple reports have found that rideshare companies like Uber and Lyft are just as safe as taxis, perhaps safer.\nThe argument that Uber is unsafe falls apart on any critical inspection. First, drivers must undergo full background checks by Uber; their backgrounds and driving records are monitored continually during their time as Uber drivers. Second, Uber drivers are insured, with more than $1 million of liability coverage per incident, $1 million of bodily injury coverage, and collision insurance. Uber’s insurance even covers accidents caused by uninsured drivers.\nHow does that compare to taxicab companies? It varies by state. In Florida, cab companies are not required to provide uninsured-motorist coverage. So in Tampa, where the supposed case against Uber is about protection, you may be much better protected in one of its cars than in a cab!\nIf it’s not safety that’s driving the backlash against Uber, why are so many local and state agencies looking to ban or severely restrict the company? It’s all about politics. Several decades ago government officials and cab companies realized they could both benefit from regulation. Government would grant the companies licenses in exchange for a fee. The number of licenses was limited to keep fares artificially high. This filled government coffers while protecting the cab companies from competition.\nUber, Lyft and other rideshare companies now threaten this cozy system: if Uber and the others are free to operate, government will lose out on licensing fees and cab companies will have to face the harsh light of market competition.\nThere is another element to consider in this discussion. Who should make decisions about how we as individuals live our lives? If instead of lining up for a cab, I use the Uber app to summon a driver to pick me up at the airport, it’s because I believe Uber better suits my needs and preferences.\n</span", "external_links": [], "published": "2015-10-05T08:00:00.000+03:00", "crawled": "2015-10-05T07:53:55.135+03:00", "highlightTitle": ""}