{"organizations": [], "uuid": "1e4f3276abd593cb449d7279ebd6ea8f285c482e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/08/Editorial-Opinion/Images/04968679-1627.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/the-key-to-solving-the-puzzle-of-afghanistan/2015/10/08/1ebfa63a-6df1-11e5-aa5b-f78a98956699_story.html", "country": "US", "title": "The key to solving the puzzle of Afghanistan is Pakistan", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "The key to solving the puzzle of Afghanistan is Pakistan - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "1e4f3276abd593cb449d7279ebd6ea8f285c482e"}, "author": "Fareed Zakaria", "url": "http://www.washingtonpost.com/opinions/the-key-to-solving-the-puzzle-of-afghanistan/2015/10/08/1ebfa63a-6df1-11e5-aa5b-f78a98956699_story.html", "ord_in_thread": 0, "title": "The key to solving the puzzle of Afghanistan is Pakistan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Fareed Zakaria Opinion writer October 8 at 8:19 PM Follow @FareedZakaria Recent setbacks in Afghanistan — from the fall of Kunduz to the errant U.S. bombing of a hospital in that city — again raise a question. Why, after 14 years of American military efforts, is Afghanistan still so fragile? The country has a democratically elected government widely viewed as legitimate. Poll after poll suggests that the Taliban are unpopular. The Afghan army fights fiercely and loyally. And yet, the Taliban always come back.\nThe answer to this puzzle can be found in a profile of the Taliban’s new leader, Akhtar Mohammad Mansour. It turns out that Mansour lives part time in Quetta, the New York Times reports, “in an enclave where he and some other Taliban leaders . . . have built homes.” His predecessor, Mohammad Omar, we now know, died a while ago in Karachi. And of course, we remember that Osama bin Laden lived for many years in a compound in Abbottabad . All three of these cities are in Pakistan.\nFareed Zakaria writes a foreign affairs column for The Post. He is also the host of CNN’s Fareed Zakaria GPS and a contributing editor for The Atlantic. View Archive Facebook RSS We cannot solve the problem of Afghanistan without recognizing that the insurgency against that government is shaped, aided and armed from across the border by one of the world’s most powerful armies. Periodically, someone inside or outside the U.S. government points this out. Yet no one knows quite what to do, so it is swept under the carpet and policy stays the same. But this is not an incidental fact. It is fundamental, and unless it is confronted, the Taliban will never be defeated. It is an old adage that no counterinsurgency has ever succeeded when the rebels have had a haven. In this case, the rebels have a nuclear-armed sponsor.\nPakistan has mastered the art of pretending to help the United States while actually supporting its most deadly foes. Take the many efforts that U.S. officials have recently made to start talks with the Taliban. It turns out that we were talking to ghosts. Omar has been dead for two years, while Pakistani officials have been facilitating “contacts” and “talks” with him. This is part of a pattern. Pakistani officials, from former president Pervez Musharraf down, categorically denied that bin Laden or Omar was living in Pakistan — despite the fact that former Afghan president Hamid Karzai repeatedly pointed this out publicly. “I do not believe Omar has ever been to Pakistan,” Musharraf said in 2007 .\nThe Pakistani army has been described as the “ godfather ” of the Taliban. That might understate its influence. Pakistan was the base for the U.S.-supported mujahideen as they battled the Soviet Union in the 1980s. After the Soviets retreated from Afghanistan in 1989, the United States withdrew almost as quickly, and Pakistan entered that strategic void. It pushed forward the Taliban, a group of young Pashtun jihadis schooled in radical Islam at Pakistani madrasas. (“Talib” means student.) Now history is repeating itself. As the United States draws down its forces, Pakistan again seeks to expand its influence through its long-standing proxy.\nWhy does Pakistan support the Taliban? Pakistan’s former ambassador to the United States, Husain Haqqani, whose book “ Magnificent Delusions ” is an essential guide, says that “Pakistan has always worried that the natural order of things would be for Afghanistan to come under the sway of India, the giant of the subcontinent. The Pakistani army came to believe that it could only gain leverage in Afghanistan through religious zealots. Afghanistan’s secular groups and ethnic nationalists are all suspicious of Pakistan, so the only path in is through those who see a common, religious ideology.” This strategy is not new, Haqqani points out, noting that funding for such groups began in the mid-1970s, before the Soviets invaded Afghanistan in 1979.\nWhat should the United States do? First, says Haqqani, it needs to see reality for what it is: “When you are lied to and you don’t respond, you are encouraging more lies.” He argues that Washington has to get much tougher with the Pakistani military and make clear that its double-dealing must stop. To do this would be good for Afghanistan and stability in that part of the world, but it would also be good for Pakistan.\nPakistan is a time bomb. It ranks 43rd in the world in terms of its economy, according to the World Bank, but has the sixth-largest armed forces . It has the fastest-growing nuclear arsenal , and the most opaque. It maintains close ties with some of the world’s most brutal terrorists. By some estimates, its military consumes 26 percent of all tax receipts, while the country has 5.5 million children who don’t attend school . As long as this military and its mind-set are unchecked and unreformed, the United States will face a strategic collapse as it withdraws its forces from the region.\nRead more from Fareed Zakaria’s archive , follow him on Twitter or subscribe to his updates on Facebook .\nRead more on this issue:\nThe Post’s View: What a Taliban in disarray could mean for Afghanistan and Pakistan\nThe Post’s View: Afghanistan’s president’s outreach to Pakistan is a positive step\nCarter Malkasian: The Taliban after Omar\nDavid Ignatius: The U.S. cannot afford to forget Afghanistan and Pakistan\nDavid Petraeus and Michael O’Hanlon: The U.S. needs to keep troops in Afghanistan", "external_links": ["https://twitter.com/@FareedZakaria", "http://databank.worldbank.org/data/download/GDP.pdf", "http://www.facebook.com/fareedzakaria", "http://www.cnn.com/2011/WORLD/asiapcf/05/02/bin.laden.abbottabad/index.html", "https://www.facebook.com/fareedzakaria", "http://www.cnn.com/2012/12/30/world/meast/mullah-mohammed-omar---fast-facts/index.html", "http://www.defensenews.com/story/defense/2015/06/05/pakistan-boosts-defense-budget/28565379/", "http://www.amazon.com/exec/obidos/ASIN/1610394739", "http://www.newyorker.com/magazine/2012/01/23/looking-for-mullah-omar", "http://nsarchive.gwu.edu/NSAEBB/NSAEBB227/", "http://www.uis.unesco.org/Education/Documents/fs-31-out-of-school-children-en.pdf", "http://www.nytimes.com/2015/10/05/world/asia/kunduz-fall-validates-mullah-akhtar-muhammad-mansour-talibans-new-leader.html", "https://twitter.com/fareedzakaria", "http://data.worldbank.org/indicator/MS.MIL.TOTL.P1?order=wbapi_data_value_2013+wbapi_data_value+wbapi_data_value-last&sort=desc"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T04:12:17.616+03:00", "highlightTitle": ""}