{"organizations": [], "uuid": "55f19d4a3de26a1d6cfb91c7913720fc00c2edf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/news/local-news/20151016-tailgate.ece/BINARY/original/tailgate", "site_section": "http://www.dallasnews.com/news/politics/", "section_title": "Dallas-Fort Worth, Texas and National Politics and Elections News - News for Dallas, Texas ", "url": "http://www.dallasnews.com/news/local-news/20151016-no-security-changes-planned-in-response-to-att-stadium-shooting.ece", "country": "US", "title": "No security changes planned in response to AT&T Stadium shooting", "performance_score": 0, "site": "dallasnews.com", "participants_count": 2, "title_full": "No security changes planned in response to AT&T Stadium shooting | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T07:04:00.000+03:00", "replies_count": 1, "uuid": "55f19d4a3de26a1d6cfb91c7913720fc00c2edf7"}, "author": "JEFF MOSIER", "url": "http://www.dallasnews.com/news/local-news/20151016-no-security-changes-planned-in-response-to-att-stadium-shooting.ece", "ord_in_thread": 0, "title": "No security changes planned in response to AT&T Stadium shooting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No security changes are planned in response to Sunday night’s fatal shooting next to an AT&T Stadium parking lot, Arlington police and the Dallas Cowboys said Friday.\nBut the death of 43-year-old Rick Sells is expected to generate debate about what more stadium officials can do to secure parking lots.\nThe head of the National Center for Spectator Sports Safety and Security said he plans to bring this issue to one of the organization’s best practices meetings next year and ask whether tailgating should be limited to ticket holders. The shooting suspect, Marvin Rodriguez, 28, was in the AT&T Stadium parking lot but didn’t have a ticket for the game against the New England Patriots.\n“What happened in Dallas woke us up,” said Lou Marciani, director of the security center based at the University of Southern Mississippi in Hattiesburg. “It wasn’t just the fight, but the death part that made a difference in our minds.”\nHe said security officials at college and professional venues told him there has been an increase in tailgating in the past five years. Stadiums and arenas have responded with more security officers on parking lot foot patrols and the addition of security cameras.\n“It’s getting harder than it had been in the past because of the volume of people,” Marciani said about policing parking lots.\nThe Cowboys have a bye week and then play on the road against the New York Giants. The team returns to Arlington on Nov. 1 against the Seattle Seahawks.\n‘We are confident’ During this year’s preseason and regular-season games, Arlington police have had at least 69 offense reports at AT&T Stadium. Some are inside and some are outside the stadium.\nThe 19 public intoxication cases were the largest single group. But there were six assaults reported and an assortment of thefts, lost property reports and criminal trespass warnings. Police officials said they were unaware of any other previous shootings at AT&T Stadium.\nIn this case, police said Rodriguez was involved in two fights before he shot Sells once in the neck. Sells was taken off life support Wednesday.\nSgt. Paul Rodriguez said there are no plans to increase patrols or staffing at Cowboys games because of this shooting. He said the fact that officers quickly captured Marvin Rodriguez shows that the department was well staffed and positioned.\n“We have a robust plan out there,” he said. “We are confident that we can provide the highest level of public safety out there for all of our patrons.”\nHe said that the department is constantly reviewing its plans to determine whether tweaks are needed. Guns are generally banned at AT&T Stadium.\nRich Dalrymple, a Cowboys spokesman, said he would defer to Arlington police about whether security changes were needed. He said the lots are patrolled by police officers and private security, and there are a large number of security cameras on the property.\nThe Cowboys and Arlington police do not disclose details about security staffing levels or numbers of security cameras.\nAlcohol consumption The concern about having non-ticket holders in the parking lots is partly about the dangers of excessive alcohol consumption. The parking lots open five hours before the game and stay open for two hours after it ends. Sunday night’s shooting happened about two hours after the game ended when parking lots were being cleared.\n“You can’t ban alcohol, so they [outsiders] can go on for approximately eight hours of alcohol consumption,” Marciani said.\nInside the stadium, fans can still drink. But it’s more costly, and drunks are more likely to be flagged by security or vendors. It’s not clear what role alcohol played in Sunday’s shooting.\nThe Texas Rangers announced in 2013 that only ticket holders would be allowed to tailgate in the team’s parking lots. But officials also said that the rule would be enforced only during games with sellout or near-sellout crowds. The rule was meant to ensure that there were enough parking spaces for those with tickets.\nOverall, security precautions available for parking lots are far more limited than ones available inside stadiums, Marciani said.\nIn recent years, the National Football League and Major League Baseball have mandated metal detectors at entrances. Women attending NFL games must generally leave their regular purses at home and instead carry see-through bags. Cars at AT&T Stadium are searched if they are parked within 100 feet of the stadium.\nBanning non-ticket holders from stadium parking would keep some cars out of the lots. But it wouldn’t necessary deter people on foot. There are large numbers of independent parking lots, some of which provide tailgating space. People are generally free to wander among the lots.\nOn Twitter:\n @jeffmosier", "external_links": ["https://twitter.com/jeffmosier"], "published": "2015-10-17T07:04:00.000+03:00", "crawled": "2015-10-17T17:02:43.034+03:00", "highlightTitle": ""}