{"organizations": ["Liberal Democrats"], "uuid": "58e8ce5bb7d4d9d61150b2f1593b2b02873edb18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.basingstokegazette.co.uk", "main_image": "http://www.basingstokegazette.co.uk/resources/images/4351698/", "site_section": "http://www.basingstokegazette.co.uk/news/politics/rss/", "section_title": "Basingstoke Gazette | Politics", "url": "http://www.basingstokegazette.co.uk/news/politics/13882606.Liberal_Democrats_party_calls_on_borough_council_to_support_Syrian_refugees/?ref=rss", "country": "GB", "title": "Liberal Democrats party calls on borough council to support Syrian refugees", "performance_score": 0, "site": "basingstokegazette.co.uk", "participants_count": 0, "title_full": "Liberal Democrats party calls on borough council to support Syrian refugees", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:00:00.000+03:00", "replies_count": 0, "uuid": "58e8ce5bb7d4d9d61150b2f1593b2b02873edb18"}, "author": "", "url": "http://www.basingstokegazette.co.uk/news/politics/13882606.Liberal_Democrats_party_calls_on_borough_council_to_support_Syrian_refugees/?ref=rss", "ord_in_thread": 0, "title": "Liberal Democrats party calls on borough council to support Syrian refugees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2 comments \nTHE borough’s Liberal Democrats party will call on Basingstoke and Deane Borough Council to support refugees affected by the Syrian crisis at a meeting on Thursday. \nIn a motion, which will be tabled at a full council meeting this Thursday, the Liberal Democrats group has said that an estimated nine million people from Syria have fled their homes. \nAccording to the United Nations High Commissioner for Refugees (UNHCR), over three million people have fled to immediate neighbouring countries including Turkey, Lebanon, Jordan and Iraq and 6.5m people are internally displaced within Syria. \nLast month, Prime Minister David Cameron announced the UK would take up to 20,000 refugees over the next four-and-a-half years. \nThe motion calls on the borough council’s decision-making Cabinet to work with colleagues at Hampshire County Council to co-ordinate an effort to help refugees and explore the opportunities for foster care for children orphaned by the conflict. \nIn addition, it seeks to establish a system to assist households who can provide accommodation for refugees by working with community groups and churches and to designate a specialist refugee officer to lead this project. \nIt also calls for the local authority to write to the Prime Minister to assure him that Basingstoke and Deane “stands ready and willing to help at this time of international crisis and continue with the long standing British tradition of helping refugees”. \nThe group’s leader, Councillor Gavin James , said the UK had a “long and important tradition of offering sanctuary to those who need protection”, adding: “After four years of war, things are worse than ever. Four in every five Syrians are now living in poverty – 30 per cent of them in abject poverty. Syria's education, health and social welfare systems are in a state of collapse. Promoted stories \n“UN bodies working with millions of refugees in Jordan, Turkey and Lebanon are running out of money, making camp conditions harsher than in the past and life more untenable for Syrians who depend on UN subsidies. \n“People in some refugee camps are being expected to live on food vouchers worth just 33p a day. There is a gap of almost 40 per cent between what it needs and what has been donated.” Share article \nCllr James added: “I believe that the residents of Basingstoke and Deane want to play their part in offering help to people in the most desperate circumstances. \n“Let’s keep things in proportion. Given that there are over nine million people who have fled their homes after some of the most brutal and barbaric conflict of the 21st Century, Basingstoke and Deane is being asked to play a very small part in a very big situation.” Promoted Stories Liberal Democrats party calls on borough council to support Syrian refugees   John Hampshire 3:38pm Tue 20 Oct 15 \nAny chance the borough council could just concentrate on running local services? Any chance the borough council could just concentrate on running local services? John Hampshire \nAny chance the borough council could just concentrate on running local services? Report Score: 0 JTH6767518PHILIP 3:50pm Tue 20 Oct 15 \nIs there no bandwagon the Lib Dems wont jump on ? No wonder they are totally discredited. Is there no bandwagon the Lib Dems wont jump on ? No wonder they are totally discredited. JTH6767518PHILIP \nIs there no bandwagon the Lib Dems wont jump on ? No wonder they are totally discredited. Report", "external_links": [], "published": "2015-10-20T17:00:00.000+03:00", "crawled": "2015-10-21T00:56:42.069+03:00", "highlightTitle": ""}