{"organizations": [], "uuid": "3a28588e7da6f2b3083b7ecbd51e85511ae9f9f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9082001_G.jpg", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30334731/clinton-revels-in-signs-that-dems-are-coalescing-around-her", "country": "US", "title": "Clinton revels in signs that Dems are coalescing around her", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Clinton revels in signs that Dems are coalescing around her - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a28588e7da6f2b3083b7ecbd51e85511ae9f9f8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30334731/clinton-revels-in-signs-that-dems-are-coalescing-around-her", "ord_in_thread": 0, "title": "Clinton revels in signs that Dems are coalescing around her", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By LISA LERER and KEN THOMAS\nAssociated Press WASHINGTON (AP) - Hillary Rodham Clinton took a celebratory lap around Washington on Friday, reveling in signs Democrats are coalescing around her White House candidacy after an 11-hour grilling by House Republicans.\nJoking about her \"long day,\" Clinton told female supporters gathered for a party breakfast address that she tried to \"rise above partisanships and reach for statesmanship\" in her testimony before a Republican-led congressional committee investigating Clinton's handling of the 2012 deadly attacks in Benghazi, Libya.\n\"Sometimes when a woman talks, some people think it's shouting,\" an energized Clinton told supporters in Northern Virginia later in the day. \"I won't be silenced and I hope you won't be either. I will keep speaking out.\"\nAmid questioning that at times bordered on a courtroom-style interrogation, Clinton avoided any major gaffes in her Thursday testimony as she sought to portray herself above the partisan fray as committee members bickered.\nThe hearing surfaced little new information about the attacks in Benghazi and landed no blows to Clinton's presidential aspirations, leaving Republicans without a memorable moment to promote as Clinton approaches the first primary contests.\n\"You ended up having 11 hours of the reason why Hillary Clinton should be the next president of America,\" said Virginia Gov. Terry McAuliffe, a longtime Clinton confident, at a Friday afternoon campaign event. \"She looked like a commander in chief yesterday.\"\nWhile Clinton's aides acknowledged the run of good news, they stressed she was not taking anything for granted. But they also noted that her commanding performance in both last week's debate and her congressional testimony both showed off her foreign policy credentials and command of the issues for a broader audience.\n\"You cannot knock her down,\" said Clinton campaign communications director Jen Palmieri. \"People see that and they can easily see that that this woman could be our next president.\"\nThere were some early signs Friday the marathon session in front of Congress, coming one day after Vice President Joe Biden announced his decision not to run, may have helped Clinton solidify support within her party. The American Federation of State, County and Municipal Employees endorsed Clinton on Friday, giving her the backing of an important union.\nCharleston Mayor Joe Riley, a longtime Biden supporter, also announced his endorsement for Clinton on Friday afternoon.\n\"Hillary will make an excellent president,\" he said in a statement. \"No other candidate has such a deep connection to women, children, families and their day-to-day struggles.\"\nHer campaign said contributions flooded in after her testimony, with the hour between 9 p.m. and 10 p.m. becoming the best fundraising period of the campaign to date.\n\"She was glowing,\" said Pamela Eakes, a major Clinton donor from Seattle who met privately with Clinton before her Friday speech. \"We're grateful to Republicans for giving her the best week ever.\"\nAlong with Biden, two of her other challengers - former Virginia Sen. Jim Webb and former Rhode Island Gov. Lincoln Chafee - dropped out of the Democratic race this past week.\n\"Obviously it's a good week for Secretary Clinton,\" Chafee said. \"I'm moving on now. It's time to move on and support the party any way I can.\"\nOn Saturday, Clinton will travel to Iowa for an appearance at the party's annual Jefferson-Jackson dinner before more than 6,000 activists. The event marked then-Illinois Sen. Barack Obama's breakout performance in the fall of 2007, setting him on a path toward a surprise win in the Iowa caucuses.\nClinton will be joined by her husband, former President Bill Clinton, who is making one of his first appearances on the campaign trail since his wife launched her campaign.\n___\nAssociated Press writer Bill Barrow contributed to this report from Auburn, Alabama.\n___\nFollow Lisa Lerer and Ken Thomas on Twitter at: http://twitter.com/llerer and http://twitter.com/kthomasdc\n ", "external_links": ["http://twitter.com/kthomasdc", "http://twitter.com/llerer"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T23:07:02.843+03:00", "highlightTitle": ""}