{"organizations": [], "uuid": "da8111f0dccc00db91bd79729d2670f79c88164d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/09/383701-ranbir.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/sport/report-why-pepsico-no-longer-wants-to-be-the-title-sponsor-of-ipl-2133088", "country": "SG", "title": "Why PepsiCo is unwilling to be the title sponsor of IPL", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "Why PepsiCo is unwilling to be the title sponsor of IPL | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:55:00.000+03:00", "replies_count": 0, "uuid": "da8111f0dccc00db91bd79729d2670f79c88164d"}, "author": "Zee Media Bureau", "url": "http://www.dnaindia.com/sport/report-why-pepsico-no-longer-wants-to-be-the-title-sponsor-of-ipl-2133088", "ord_in_thread": 0, "title": "Why PepsiCo is unwilling to be the title sponsor of IPL", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ranbir Kapoor from an older Pepsi IPL Ad in 2013 In a big blow to the BCCI, global beverage giants PespsiCo want to pull out as title sponsors of IPL, and have sent a notice to the board. It’s believed that Pepsico has informed the IPL’s Chief Operating Officer (COO) Sundar Raman about its intention to withdraw from the title sponsorship for which it had paid Rs 396 crore ($71.77 million) for the period 2013-2017. Raman is believed to have informed newly elected BCCI president Shashank Manohar about the development.\nIt’s believed that they wish to do so because the controversy surrounding the spot-fixing case has brought the game into ‘disrepute’.\nPepsiCo had earlier hinted that it was considering such a move: “Last season, Pepsi wanted to withdraw, especially in the aftermath of the spot-fixing case but the BCCI managed to convince it to stick on for another year. However, this time it was firm that it will not continue its association with the IPL, more so after the Lodha Committee recommended the suspension of Chennai Super Kings and Rajasthan Royals. The conflict of interest issues also had an impact,” said an IPL source. (Read: Top 10 IPL controversies )\nThe BCCI will take up PepsiCo’s notice during its working committee meeting in Mumbai on October 18.\nSome facts about Pepsi’s IPL Sponsorship\nGlobal beverage giant PepsiCo bagged the IPL title sponsorship rights for the five years (2013-17) for Rs 396.8 crore ($71.77 million approx.), almost double the original title sponsorship deal done in 2008. Along with PepsiCo, the only other contender for the title sponsorships rights was Airtel, an Indian telecommunications company, who bid Rs 316 crore ($57.27 million approx).\nFor the next five years the tournament is to be called Pepsi-IPL. Before Pepsi, the IPL’s title sponsor was DLF.\nIn 2008, DLF, Indian's biggest real estate company, had paid a sum of Rs 200 crore ($36.25 million approx.), to own title rights for the first five years (2008-12) of the tournament. But in August DLF decided not to renew its contract, forcing the BCCI to issue a new tender. The BCCI had set Rs 300 crore as the base price for the title sponsorship.\nControversies surrounding IPL\nEver since its inception in 2008, the Indian Premier League (IPL) has been ridden with controversies. Be it the former Commissioner Lalit Modi's alleged involvement in money laundering or the inappropriate ways used by him to award franchise licenses to some of the new teams, IPL has been one of the most talked about T20 cricket leagues in the world but mostly for all the wrong reasons. The league, once valued by brand valuation company Brand Finance at $4.31 billion, has been constantly getting eroded with a new controversy hitting the sports league almost every year. (Read: Guru always had links to Chennai bookies )\nThe latest blow is of course the verdict of the Justice Lodha committee (appointed by the Supreme Court), suspending two of the most successful franchises of the league, Chennai Super Kings and Rajasthan Royals for two years on charges of betting and match-fixing. The co-owners of Chennai Super Kings and Rajasthan Royals, Gurunath Meiyappan and Raj Kundra respectively, have been banned from cricket for life.", "external_links": [], "published": "2015-10-10T18:55:00.000+03:00", "crawled": "2015-10-10T09:11:52.547+03:00", "highlightTitle": ""}