{"organizations": [], "uuid": "6ccccc46b6c288c8d6d95d81e6d3a13e21178fa6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.postandcourier.com", "main_image": "http://www.postandcourier.com/storyimage/CP/20151008/PC1603/151009429/AR/0/AR-151009429.jpg", "site_section": "http://www.postandcourier.com/apps/pbcs.dll/section?Category=PC1603&template=rss&mime=XML", "section_title": "Politics", "url": "http://www.postandcourier.com/article/20151008/PC1603/151009429/1031&ampsource=RSS", "country": "US", "title": "‘Storm of the millennium’ reveals disaster response strengths, weaknesses", "performance_score": 0, "site": "postandcourier.com", "participants_count": 1, "title_full": "‘Storm of the millennium’ reveals disaster response strengths, weaknesses - Post and Courier", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "6ccccc46b6c288c8d6d95d81e6d3a13e21178fa6"}, "author": "postandcourier.com", "url": "http://www.postandcourier.com/article/20151008/PC1603/151009429/1031&ampsource=RSS", "ord_in_thread": 0, "title": "‘Storm of the millennium’ reveals disaster response strengths, weaknesses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Katherine Lambert’s infant daughter, Courtlyn, is passed to her after the South Carolina National Guard gave them a ride in an amphibious vehicle along Cainhoy Road on Monday. Wade Spees/Staff × Despite 17 deaths statewide, disaster experts generally gave South Carolina high marks for its preparation and response to the “storm of the millennium,” saying 24 inches of rain in a weekend is an almost unheard of event that few, if any, emergency responders train for.\nWhat has been exposed in the last seven days is the state’s outdated infrastructure, as dams have been breached, roads washed away and bridges deemed too weak to trust.\n“I’m seeing this everywhere,” S.C. Department of Transportation worker Radames Zambrana said of the bridges he’s seen where floodwaters have washed out the support underneath.\nWhile federal assistance is likely to be called on for some of the repairs, there’s sure to be renewed discussion in the Legislature in January about the state’s commitment to infrastructure after decades of holding down spending to keep taxes low. The total cost of repairs is expected in the billions of dollars.\nWhile the state warily watches rivers as the flood surge heads downstream toward waterlogged coastal communities, experts nationally say South Carolina was as prepared as it could be for the disaster, primarily because it was bracing for bad weather well in advance as Hurricane Joaquin approached offshore.\n“A lot of citizens stepped up to the plate and did what had to be done to save lives and rescue people,” said Irwin Redlener, director of the National Center for Disaster Preparedness at Columbia University in New York, rating the state’s performance from afar.\nThe state issued weather alerts, closed flood-prone roads and called for evacuations of low-lying areas. More than 3,200 National Guardsmen have been deployed to assist in evacuations, road closures and rescues.\nRedlener said that the true test of how South Carolina and its leaders will be graded still lies ahead, as untold thousands of people will rely on state, federal and their private insurance resources to help rebuild. He is less optimistic that the recovery will be graded a success.\n“Nobody has gotten this right after a situation like this,” Redlener said, pointing to the displacements, infrastructure woes, and the lingering legal and housing disputes that still plague the Hurricane Katrina and Superstorm Sandy aftermaths.\nWhile the financial damage tabulation won’t be known for days, at least 17 people died as a result of the storm in South Carolina, several from trying to drive through floodwaters or ignoring barricades. None of the deaths were in the Charleston area.\nLarry Swanson, a professor in marine policy and management at Stony Brook University and who is part of the New York State Resiliency Institute for Storms & Emergencies that studied Superstorm Sandy in the Northeast, said the loss of life is unfortunate, but reinforces the need to heed warnings.\n“You can warn people, you can take certain precautions, but at some point you know you have to say ‘it’s arrived,’ and there’s not much we can do other than to try to save people on an emergency basis until it’s over,” he said.\nMore than a dozen dams failed throughout the state, forcing hurried evacuations in the Columbia area and raising questions about whether they were adequately inspected and managed.\nState officials have been reluctant to discuss the dam breaks and whether steps were taken ahead of the breaches. Haley deflected questions at a news conference Thursday saying the focus was on keeping people safe still, not trying to assess if anyone was to blame for the 14 dams that had burst.\nOn Oct. 1, the S.C. Department of Health and Environmental Control, which oversees dams, sent out the following warning:\n“Owners and operators of reservoirs statewide should check their dams today, and through the next several days, for possible problems caused by heavy rainfall from Hurricane Joaquin.\n“According to the National Weather Service, a significant amount of rain is expected in the Southeastern and Mid-Atlantic United States.\n“Dam owners should be aware of the conditions at their dams during such events,” said Chuck Gorman with DHEC’s dam safety program. “If such problems develop that failure of the dam might be imminent, the owner or operator of the dam should contact the downstream property owners and the local public safety officials.”\nLocally in the Charleston area, officials said they were still assessing their responses, but some of the early takeaways include:\nNorth Charleston Mayor Keith Summey said efforts to get residents in low-lying areas to go to shelters were hampered by their having made no arrangements for residents with pets.\n“I think the pet issue was the big issue,” he said, adding that officials went through neighborhoods two or three times asking residents to leave but were met with resistance from those who wanted to protect their pets, and also their property, from potential looting or theft.\nTom Smith, Berkeley County’s emergency preparedness director, said he believed the county’s storm preparation “was about as good as it could get.”\nNo matter what government does, he said, everyone needs to take responsibility for keeping themselves safe.\n“The weather service told the people the rain was coming and told them how much,” he said. “You can’t really outguess Mother Nature.”\nCharleston County Emergency Services Director Jason Patnor said the biggest plus the county had was that effective lines of communication had been created with local police, agencies and governments across the region.\n“I think we had accurate reporting of incidents of flooding,” he said.\nOne area that could be addressed is to rehearse for larger scale disasters, including a 1,000-year storm.\n“I don’t think we ever exercised that particular scenario,” he said.\nDorchester County Emergency Management Director Mario Formisano said officials already were on guard days ahead of the storm because of Hurricane Joaquin.\nBut officials had no accurate readings on the rise of the Ashley River because federal agencies had earlier removed a rain gauge. The nearest monitor is miles away from on the William Westmoreland Bridge in North Charleston.\nMark Wilbert, director of emergency management for the city of Charleston, credited early planning for having sufficient staffing, offering and delivering sandbags, pre-positioning high-water vehicles and prepping traffic diversion plans ahead of the storm.\nThe Associated Press contributed.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-10T08:49:56.806+03:00", "highlightTitle": ""}