{"organizations": [], "uuid": "95cb544f41c594aa98df529663dc665f18016deb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/8c/2a/8ef70e71483b9cbef502e3e63f5a/kim-davis-ap.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/pope-francis-kim-davis-meeting-vatican-explains-214357", "country": "US", "title": "Pope's meeting with Kim Davis wasn't an endorsement, Vatican says", "performance_score": 2, "site": "politico.com", "participants_count": 26, "title_full": "Pope's meeting with Kim Davis wasn't an endorsement, Vatican says - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T14:43:00.000+03:00", "replies_count": 57, "uuid": "ed6d53d370b9e08b16263cc59e585f845c8692c7"}, "author": "Nick Gass", "url": "http://www.politico.com/story/2015/10/pope-francis-kim-davis-meeting-vatican-explains-214357#post-0", "ord_in_thread": 0, "title": "Pope's meeting with Kim Davis wasn't an endorsement, Vatican says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pope Francis' meeting with Kentucky clerk Kim Davis last week should not be considered an endorsement of her views and the two did not \"enter into the details\" of her specific situation, a spokesman for the Vatican said Friday. \"The brief meeting between Mrs. Kim Davis and Pope Francis at the Apostolic Nunciature in Washington, DC has continued to provoke comments and discussion. In order to contribute to an objective understanding of what transpired I am able to clarify the following points: Pope Francis met with several dozen persons who had been invited by the Nunciature to greet him as he prepared to leave Washington for New York City,\" said Vatican spokesman Rev. Federico Lombardi in a statement on the pope's encounter with Davis, who has refused to issue same-sex marriage licenses in her rural Kentucky county.\n\"Such brief greetings occur on all papal visits and are due to the Pope’s characteristic kindness and availability. The only real audience granted by the Pope at the Nunciature was with one of his former students and his family,\" Lombardi explained. \"The Pope did not enter into the details of the situation of Mrs. Davis and his meeting with her should not be considered a form of support of her position in all of its particular and complex aspects.\"\nThe statement follows an anonymously sourced report from Chicago's CBS affiliate, which claimed that the pope was \"blindsided\" by the meeting with Davis and her husband, citing a close adviser who is said to have tweeted that the pontiff felt \"exploited\" by those who arranged the encounter.\nAfter the meeting, which wasn't revealed until Pope Francis had left the United States, Davis told ABC News she \"had tears coming out of my eyes\" during their brief encounter.\n“I'm just a nobody, so it was really humbling to think he would want to meet or know me,\" she said. \"I put my hand out and he reached and he grabbed it, and I hugged him and he hugged me. ... And he said, ‘Thank you for your courage.’”\n<div", "external_links": ["http://abcnews.go.com/US/exclusive-kim-davis-recounts-secret-meeting-pope-francis/story?id=34143874", "http://chicago.cbslocal.com/2015/10/01/vatican-source-pope-blindsided-by-meeting-with-controversial-kentucky-clerk/", "http://www.news.va/en/news/holy-see-press-office-issues-statement-on-popes-me"], "published": "2015-10-02T14:43:00.000+03:00", "crawled": "2015-10-02T16:14:23.366+03:00", "highlightTitle": ""}