{"organizations": [], "uuid": "f8e4545224ec07e1dcf93d9cac91a7ec6e8eb847", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/politicsNews", "section_title": "Reuters: Politics", "url": "http://www.reuters.com/article/2015/10/08/us-usa-congress-republicans-idUSKCN0S222D20151008?feedType=RSS&feedName=politicsNews", "country": "US", "title": "Republicans prepare to nominate candidate for House speaker", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Republicans prepare to nominate candidate for House speaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:39:00.000+03:00", "replies_count": 0, "uuid": "f8e4545224ec07e1dcf93d9cac91a7ec6e8eb847"}, "author": "", "url": "http://www.reuters.com/article/2015/10/08/us-usa-congress-republicans-idUSKCN0S222D20151008?feedType=RSS&feedName=politicsNews", "ord_in_thread": 0, "title": "Republicans prepare to nominate candidate for House speaker", "locations": ["WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Susan Cornwell", "Andy Sullivan"], "text": "WASHINGTON | By Susan Cornwell and Andy Sullivan \nWASHINGTON Hardline conservatives in the U.S. House of Representatives on Thursday made a play for more power in deeply divided Republican ranks as the party prepared to vote on its nominee for the next speaker of the House. \nHouse Majority Leader Kevin McCarthy was the favorite to be selected as the official party choice to replace John Boehner in the secret ballot scheduled to take place later on Thursday. \nBut McCarthy's bid to become speaker in three weeks has become uncertain after a minority group of right-wing conservatives pledged on Wednesday to back a longshot candidate, Representative Daniel Webster of Florida. \nConservative \"Freedom Caucus\" members said they would support Webster on Thursday and again in the vote of the full chamber on Oct. 29 unless House operations change. If they vote as a bloc on Oct. 29, they could keep McCarthy from getting the majority of votes required. \nAmong other things, conservatives want to be allowed to offer more of their own amendments on the House floor. They say Webster, 66, a former speaker of the Florida statehouse, is better suited to meet their demands for a greater voice in the House as they push for a more confrontational stance with President Barack Obama. \n“We need to see some real commitments,\" Representative John Fleming, a Louisiana conservative, said on Thursday outside a forum where candidates made last-minute pitches. \"We feel that conservatives have been greatly marginalized by the current leadership.\" \nMcCarthy, 50, has been one of Boehner's lieutenants since 2011. He is vying for the speaker's post with Webster, as well as Representative Jason Chaffetz, chairman of the powerful Oversight and Government Reform Committee. \nBoehner announced last month he would resign effective Oct. 30, after five years of battles with the same House conservatives now trying to extract promises from McCarthy about overhauling the chamber. \nThe fight over the speakership is likely to affect Congress' dealings with Obama, especially on upcoming fiscal measures to keep the government operating. \nMcCarthy’s ability to communicate Republican initiatives came into question last week when he made a connection between a House committee investigating a 2012 attack in Benghazi, Libya, and Democratic presidential candidate Hillary Clinton’s falling public opinion poll numbers. \nHis statement bolstered Democrats' charges that the House panel was created as a forum for attacking Clinton. \n(Reporting by Susan Cornwell, Andy Sullivan and David Lawder ; Editing by Richard Cowan and Lisa Von Ahn)", "external_links": [], "published": "2015-10-08T18:39:00.000+03:00", "crawled": "2015-10-08T19:09:43.770+03:00", "highlightTitle": ""}