{"organizations": ["Eddystone Rocks"], "uuid": "2c5298fc60475811e1ca35a572e03fd655b5f169", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.watchmojo.com", "main_image": "/uploads/mojothumbs/PH-H-Top10-Inventors-Killed-by-Their-Own-Inventions-720p30_100.jpg", "site_section": "http://www.watchmojo.com/rss/feeds.php?id=12", "section_title": "WatchMojo.com Politics and History", "url": "http://www.watchmojo.com/index.php?id=14504", "country": "US", "title": "Top 10 Inventors Killed By Their Own Inventions", "performance_score": 0, "site": "watchmojo.com", "participants_count": 0, "title_full": "Top 10 Inventors Killed By Their Own Inventions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:58:00.000+03:00", "replies_count": 0, "uuid": "2c5298fc60475811e1ca35a572e03fd655b5f169"}, "author": "", "url": "http://www.watchmojo.com/index.php?id=14504", "ord_in_thread": 0, "title": "Top 10 Inventors Killed By Their Own Inventions", "locations": ["Eddystone", "New Hampshire", "Southern England", "Francestown", "Berlin", "Paris", "Atlantic Ocean"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Henry Smolinski", "Max Valier", "Abakovsky", "Thomas Midgley", "Valier", "Horace Lawson Hunley", "Richard March Hoe", "Jean-François Pilâtre de Rozier", "De Rozier", "Jr.", "Franz Reichelt", "Ismail ibn Hammad", "William Bullock", "Hunley", "H. L. Hunley", "Henry Winstanley", "Alexander Bogdanov", "Sylvester H. Roper", "Roper", "Reichelt", "Fred Duesenberg", "Andrews", "Midgley", "Sylvester H. Roper Roper", "Thomas Andrews", "Francis Edgar Stanley"], "text": "  Top 10 Inventors Killed By Their Own Inventions Top 10 Inventors Killed By Their Own Inventions These people had ideas that were to die for. Welcome to WatchMojo.com, and today we’re counting down our picks for the top 10 inventors killed by their own inventions. For this list, we’re looking at those innovators that were killed, either directly or indirectly, by their own inventions or discoveries. We’re excluding those that simply died experimenting with others’ inventions, such as Alexander Bogdanov, who died while trying to perfect and explain the process of blood transfusions. #10: Sylvester H. Roper Roper Steam Velocipede Born in Francestown, New Hampshire, Sylvester H. Roper was a pioneer when it came to the subject of motor vehicles, and more specifically, motorcycles and automobiles. Roper created what is often considered one of the first motorcycles, the roper steam velocipede. It was while riding this steam-powered land vehicle in 1896 that spectators noticed Roper wobbling upon it at a considerable 40 miles per hour, only for him to fall off and suffer a head wound following several laps. He was found dead at the scene, with an autopsy revealing heart failure as the cause of death, though whether his loss of balance was a catalyst for the stress on his heart or if his heart failed prior to the crash is unknown. #9: Horace Lawson Hunley Hand-Cranked Submarine During the American Civil War, Horace Lawson Hunley served as a Confederate marine engineer and he invented various forms of hand-powered submarines to use in battle against Union troops. Unfortunately, during a routine exercise in 1863, one of his submarines took on too much water and sank, killing all men inside, including Hunley. This submarine, called the H. L. Hunley after its inventor, was eventually raised and became the first sub to sink an enemy vessel in naval history, so at least his death wasn’t completely in vain. #8: Henry Winstanley Eddystone Lighthouse This English painter and engineer had such a thing for mechanical and hydraulic gadgets that most of the county of Essex knew about it. He indulged in this fascination by ensuring he was always surrounded by mechanisms that he designed and constructed – and the Eddystone lighthouse was no exception. After becoming a merchant and suffering the loss of two of ships on the Eddystone Rocks, Henry Winstanley had the lighthouse built with lavish decorations and a glass lantern-room in 1696. However, his death is perhaps proof that you must think before you speak; in 1703, after previously proclaiming his wish to witness the greatest storm there ever was from inside of it, the Great Storm of Southern England destroyed the lighthouse – and killed him along with it. #7: Max Valier Rocket-Powered Car Automobile inventions are definitely at the forefront of accidental deaths, taking the lives of Fred Duesenberg, Henry Smolinski, Francis Edgar Stanley, andValerian Abakovsky, just to name a few. Max Valier’s self-named Valier-Heylandt Rak 7 was the first successful rocket car to run with liquid propulsion. Unfortunately, that liquid was alcohol-based, and less than a month after his successful Rak 7 run, while making tests for a rocket engine, a canister of it exploded on his workbench in Berlin. Valier was killed within minutes on that day in 1930. Today, he is remembered as one of the brilliant individuals who helped pave the way for spaceflight. #6: Jean-François Pilâtre de Rozier Rozière Balloon Considered one of the first pioneers of aviation, Jean-François Pilâtre de Rozier was a notable French physics and chemistry teacher. De Rozier is perhaps best known as the man who made the first manned free balloon flight, along with the Marquis d’Arlandes. Unfortunately, his ambition got the best of him, and he crashed while attempting to fly his Roziere balloon across the English Channel in 1785. The hydrogen-hot air balloon deflated in midair, and he and his companion fell 1,500 feet to their deaths. The crash gave these men the distinction of becoming some of the first fatalities of an air crash. #5: William Bullock Web Rotary Press While Richard March Hoe invented the rotary printing press in 1843, William Bullock made numerous additions to it and made it his own. This included automatic paper feeding rather than laborious paper pushing. Unfortunately, his additions proved his demise, as he kicked a driving belt onto a pulley of his web rotary press and got his leg stuck, which eventually led to gangrene. He finally died during an operation to amputate his leg a few days later. The moral of this story is to actually take care when fixing your machine rather than just kicking it and hoping for the best. #4: Thomas Midgley, Jr. Pulley System Thomas Midgley, Jr. was a renowned chemist and mechanical engineer, perhaps best known for his involvement with the addition of a compound known as Tetraethyllead, or TEL, to gasoline. After a successful career, Midgley, Jr. was diagnosed with poliomyelitis, a disease which left him bedridden and unable to move. As a solution to his problems, he devised a complex pulley system that would help others lift him out of bed. This genius invention unfortunately led to his death in 1940, as he was ultimately strangled by its strings. #3: Franz Reichelt Parachute Suit Franz Reichelt was a pioneer of aviation safety, most famous for his ill-advised jump off Paris’ Eiffel Tower in order to test his full body parachute in 1912. After numerous unsuccessful tests from his apartment using a dummy, Reichelt decided to test a parachute he designed and refined himself, and what better way to do that than jumping from the Eiffel Tower? After multiple attempts to dissuade him landed on deaf ears, a hesitant Reichelt jumped and landed square on his face on the icy Paris ground, and died on the scene, even though spectators rushed him to hospital. #2: Thomas Andrews, Jr. RMS Titanic While not entirely his fault, Andrews’ Titanic turned out to be the end of him, and many others on board. An Irish shipbuilder, Andrews was the naval architect of the ocean liner, before it fatefully struck an iceberg in 1912 and sank into the Atlantic Ocean. Reports state that Andrews wanted 46 lifeboats instead of the 20 that were onboard, as well as watertight bulkheads, but superiors ignored these wishes. Unfortunately, these turned out be the fateful mistakes that drew Titanic into legend. Before we look at our top pick, here are a few honorable mentions. - Ismail ibn Hammad al-Jawhari", "external_links": [], "published": "2015-10-14T23:58:00.000+03:00", "crawled": "2015-10-15T02:02:03.513+03:00", "highlightTitle": ""}