{"organizations": [], "uuid": "d3da7da14db9817528f08bfe5c016f776cb664d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "martini.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/3812465/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://martini.heraldscotland.com/politics/political_news/13804235.Osborne__councils_to_keep___26bn_from_business_rates_in__devolution_revolution_/?ref=rss", "country": "", "title": "Osborne: councils to keep £26bn from business rates in 'devolution revolution'", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Osborne: councils to keep £26bn from business rates in 'devolution revolution'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:36:00.000+03:00", "replies_count": 0, "uuid": "d3da7da14db9817528f08bfe5c016f776cb664d0"}, "author": "", "url": "http://martini.heraldscotland.com/politics/political_news/13804235.Osborne__councils_to_keep___26bn_from_business_rates_in__devolution_revolution_/?ref=rss", "ord_in_thread": 0, "title": "Osborne: councils to keep £26bn from business rates in 'devolution revolution'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Osborne"], "text": "6 comments \nCouncils are to be allowed to keep rates totalling £26 billion which they raise from business, in a \"devolution revolution\" to shake-up the way local government is funded, Chancellor George Osborne has announced. \nThe system under which cash raised from rates is sent to Whitehall to be redistributed in grants to town halls around the country is to be abolished, along with the uniform business rate which imposes a single tax rate on every council. \nIn future, councils will be freed to cut business rates to attract new jobs, and elected mayors in big cities like London, Manchester and Sheffield will be allowed to add a premium to rates to pay for major infrastructure projects. \nLoading article content \nThe reform was announced in the Chancellor's speech to the Conservative annual conference in Manchester, as he claimed the mantle for the Tories as \"the builders\" with a plan for a prosperous future for working people. \nConservatives were now \"the party of work, the only true party of labour\", while Jeremy Corbyn's Labour were \"wreckers\" who had \"completely abandoned\" working people as they lurched \"off to the fringes of the left\", he claimed. Promoted stories \nMr Osborne confirmed the establishment of a new National Infrastructure Commission chaired by former Labour cabinet minister Lord Adonis, to drive forward major projects like roads, railways, airports and power stations which require planning and construction over a period of decades. \nAnd he said he would step up asset sales to fund £5 billion of investment, sweep away planning rules delaying home-building on brownfield sites and create British Wealth Funds to encourage local government pension funds to invest in infrastructure. \nMr Osborne said devolving the raising and spending of business rates was one of \"the biggest transfer of power to our local government in living memory\" and would help restore local government, which had had its wings clipped \"again and again\" over the past decades by all parties, including the Conservatives. \nHe said: \"It's time to face facts. The way this country is run is broken. People feel remote from decisions that affect them. Initiative is suffocated. Our cities held back. \n\"There's no incentive to promote local enterprise. It's time we fixed it.\" \nTo applause from delegates, the Chancellor said: \"This is what our plan means. Attract a business, and you attract more money. Regenerate a high street, and you'll reap the benefits. Grow your area, and you'll grow your revenue too.\" \nAnnouncing that his plan would mean \"money raised locally, spent locally, every council able to cut business taxes, every mayor able to build for their city's future, a new way to govern our country\", he declared: \"Power to the people. Let the devolution revolution begin.\" \nTreasury aides confirmed that the reforms will apply only to England, as local government finance is devolved to national executives. \nThe Chancellor hopes the new system will provide an incentive for councils to compete with one another to attract firms and promote business growth. There will be no limit on how low a town hall can cut the local business rate. \nElected mayors seeking to impose a premium will have to demonstrate business support, and the extra levy will be capped - probably at 2p a year. The Chancellor believes the power to set a premium will encourage more councils to opt for directly-elected mayors. \nLocal business rates have been set by central government since the uniform national rate was introduced in 1990 by Margaret Thatcher as part of the reform of local government financing which also included the short-lived Poll Tax. \nIn 2013, councils were enabled to retain 50% of the proceeds of rates, and this will now be increased to 100% by 2020, increasing the cash controlled by local government by £13 billion. \nA complex system of tariffs and top-ups, designed to ensure that disadvantaged areas do not lose out by comparison with thriving councils, will be frozen in its current state, meaning that any gains from future growth will go direct to the councils involved. \nCentral government currently takes in around £11.5 billion in business rates and redistributes £9.4 billion in grants to councils. But sources close to the Chancellor said that the change will not represent a loss to the Treasury, as it will be offset by the devolution of extra responsibilities to local authorities. Share article \nThe chief executive of manufacturers' organisation EEF, Terry Scuoler, said that the proposed reforms to business rates would be \"a real test of local authorities and their ability to better enable local growth\", adding: \"Local authorities will now be able to prove that they can deliver savings and pass these on to local businesses, enabling them to further invest and create jobs.\" \nMark Littlewood, director general at the free market thinktank the Institute of Economic Affairs, said: \"Today's announcement to devolve business rates and allow councils to collect revenues locally is brilliant news. Not only will it create better incentives for councils to encourage local economic growth, it will also instill discipline as their decisions will affect where businesses locate and the wider prosperity of the area.\" Promoted Stories", "external_links": [], "published": "2015-10-05T15:36:00.000+03:00", "crawled": "2015-10-09T08:40:16.233+03:00", "highlightTitle": ""}