{"organizations": [], "uuid": "2fcf211b3574102f1a6a2c60c9b4187fa086d8f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/icons/t_logo_291_black.png", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Politics.xml", "section_title": "NYT &gt; Politics", "url": "http://www.nytimes.com/2015/10/13/us/politics/in-choreographed-campaigns-candidates-stumble-over-choice-of-music.html", "country": "US", "title": "In Choreographed Campaigns, Candidates Stumble Over Choice of Music", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "In Choreographed Campaigns, Candidates Stumble Over Choice of Music - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T04:27:00.000+03:00", "replies_count": 0, "uuid": "2fcf211b3574102f1a6a2c60c9b4187fa086d8f1"}, "author": "Ben Sisario", "url": "http://www.nytimes.com/2015/10/13/us/politics/in-choreographed-campaigns-candidates-stumble-over-choice-of-music.html", "ord_in_thread": 0, "title": "In Choreographed Campaigns, Candidates Stumble Over Choice of Music", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " It has become as much a part of the presidential campaign season as the baby kiss or the candidate selfie: the inevitable moment when a musician denounces a politician for using his or her song without permission.\nIt happened in January, when the punk band Dropkick Murphys asked Gov. Scott Walker of Wisconsin to stop using its music. It happened last month, when R.E.M. made an expletive-laden complaint about Donald J. Trump using “It’s the End of the World as We Know It (And I Feel Fine).” And it happened over the weekend, when Steven Tyler of Aerosmith demanded that Mr. Trump stop using his band’s 1973 hit “Dream On” at campaign events.\n“If Trump for President does not comply with our demands,” a lawyer for Mr. Tyler wrote to the campaign on Saturday, “our client will be forced to pursue any and all legal or equitable remedies which our client may have against you.”\n Ben Carson Finds Momentum in Provocative Remarks OCT. 12, 2015 Candidates Seek Unity at Nonpartisan Event, With Mixed Results OCT. 12, 2015 CNN Sees Smaller Field, With Greater Focus, as Lure for Democratic Debate OCT. 12, 2015 interactive Who’s Winning the Presidential Campaign? SEPT. 16, 2015 Mr. Tyler and Mr. Trump have since spoken, and Mr. Trump agreed not to play the song at his events, Dina LaPolt, Mr. Tyler’s lawyer, said. But then on Monday, Mr. Trump walked out to the song once again, at an event in Manchester, N.H., according to CNN .\nPhoto Donald J. Trump Credit John Locher/Associated Press At a time when every detail in a political campaign seems minutely choreographed, it can be puzzling why so many politicians risk a public shaming from popular musicians. One theory attributes the problem simply to the wide gulf between the worlds of politics and entertainment.\n“There are more candidates, more media, and fewer campaign staff who are knowledgeable about these issues,” said Jonathan Lamy, a spokesman for the Recording Industry Association of America, which circulates to political campaigns a set of guidelines about copyright issues in music. “The bench of people who know about music licensing can’t be that deep.”\nThe disputes also point to what experts say is a legal gray area over licensing rules for music in political campaigns.\nAfter Neil Young complained in June that Mr. Trump had used his song “Rockin’ in the Free World” without permission, Mr. Trump’s campaign responded that it had obtained a so-called public performance license from Ascap, the music rights agency. In addition, the venues where most major campaign events are held — convention halls, hotels, sports arenas — often carry their own licenses from Ascap and BMI, another rights agency, that allow them to play the millions of songs in those agencies’ catalogs.\nThe issue gets more complicated when the uses of these songs are captured on video and shared on social media — as they almost inevitably are.\nThe history of disputed song endorsements goes back decades. In 1984, Ronald Reagan’s campaign made reference to Bruce Springsteen’s “Born in the U.S.A.,” to Mr. Springsteen’s chagrin. In 2008, the Ohio Republican Party used part of Jackson Browne’s “Running on Empty” in a YouTube video without permission, and in 2010, Gov. Charlie Crist of Florida used the Talking Heads’ “Road to Nowhere” — written by David Byrne — when campaigning for the Senate.\nAdvertisement\n Advertisement\n Mr. Browne and Mr. Byrne both sued over those uses, and their cases were settled; as part of his settlement, Governor Crist made an apologetic video . But music lawyers and copyright experts say that these cases rarely make it to the courts — often, campaigns simply stop playing a disputed song to avoid more bad publicity. Those cases that do reach the courts seldom result in a judgment, leaving the law somewhat unclear on what rights candidates — as well as musicians — may have. And the use of music in campaigns is not always unauthorized. Mr. Springsteen has campaigned for President Obama , and Kid Rock let Mitt Romney use his song “Born Free” for his 2012 campaign.\n First Draft Newsletter Subscribe for updates on the 2016 presidential race , the White House and Congress, delivered to your inbox Monday - Friday.\nBut the problematic cases continue, in part because of legal complexities. The letter from Mr. Tyler’s lawyer mentions the Lanham Act, a federal law covering trademark and false advertising — which essentially says the song could be seen as a false endorsement. The letter also said that Mr. Tyler’s right of publicity was violated.\nBut some lawyers and copyright experts say that can be a difficult legal argument to make.\n“You have to show that people actually think it is an endorsement,” said Sherwin Siy, the vice president of legal affairs at Public Knowledge, a consumer advocacy group.\nA representative for Mr. Trump’s campaign did not respond to a request for comment.\nIn the music industry, even the complaints over copyright use can be politicized. David Israelite, the president of the National Music Publishers’ Association, a trade group that complains loudly about what it says are unfair regulations over music licensing, said that the dispute between Mr. Tyler and Mr. Trump pointed to the need to change the federal consent agreements that govern Ascap and BMI. Those groups issue so-called blanket licenses that give songwriters little ability to refuse permission to someone who wants to license their song.\nMs. LaPolt said that the Trump dispute was particularly troubling for Mr. Tyler, who is a Republican but has made an effort in recent years to meet with legislators of both parties over copyright reform. It was also the second time that she has sent a cease-and-desist letter to the Trump campaign over “Dream On.” The first was in August, after Mr. Trump played the song at an event in Mobile, Ala.\nAfterward, Ms. LaPolt said, a number of members of Congress asked her whether Mr. Tyler was supporting Mr. Trump.\n“It creates this implication that Steven is endorsing the campaign,” Ms. LaPolt said. “But everyone he met with in Washington knows that’s not the truth.”", "external_links": ["http://static01.nyt.com/images/2015/09/16/us/elections/presidential-candidates-dashboard-1442376909418/presidential-candidates-dashboard-1442376909418-thumbStandard-v3.png", "http://static01.nyt.com/images/2015/10/13/us/13CNNDebate-sub/13CNNDebate-sub-thumbStandard.jpg", "http://www.huffingtonpost.com/2015/01/26/dropkick-murphys-scott-walker_n_6548316.html", "http://static01.nyt.com/images/2015/10/13/us/13CARSON-BW/13CARSON-BW-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/13/us/13SONGPOLITICS-2/13SONGPOLITICS-2-superJumbo.jpg", "http://www.rollingstone.com/music/videos/springsteen-performs-obama-campaign-song-in-virginia-20121024", "http://static01.nyt.com/images/2015/10/13/us/13SONGPOLITICS-2/13SONGPOLITICS-2-master315.jpg", "http://www.cnn.com/2015/10/12/politics/donald-trump-steven-tyler-dream-on/index.html", "http://www.hollywoodreporter.com/news/rem-slams-donald-trump-using-821609", "http://gawker.com/neil-young-to-donald-trump-please-stop-rockin-in-the-f-1711869669", "http://www.google-analytics.com/ga.js", "http://www.politico.com/story/2011/04/crist-apologizes-to-david-byrne-053058"], "published": "2015-10-13T04:27:00.000+03:00", "crawled": "2015-10-13T03:48:19.381+03:00", "highlightTitle": ""}