{"organizations": ["DHS"], "uuid": "920681632010733b612f2d80610279bd8bd6b6e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arktimes.com", "main_image": "http://media1.fdncms.com/arktimes/imager/u/slideshow/4124745/week_that_was1-1-e0d9e790ae787656.jpg", "site_section": "http://www.arktimes.com/arkansas/Rss.xml?id=ArkansasTimesTwitterFeeds", "section_title": "Arkansas news, politics, opinion, restaurants, music, movies and art, Arkansas Times", "url": "http://www.arktimes.com/arkansas/now-hiring-dhs-director/Content?oid=4124748", "country": "US", "title": "Now hiring: DHS director", "performance_score": 0, "site": "arktimes.com", "participants_count": 0, "title_full": "Now hiring: DHS director", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T09:00:00.000+03:00", "replies_count": 0, "uuid": "920681632010733b612f2d80610279bd8bd6b6e2"}, "author": "", "url": "http://www.arktimes.com/arkansas/now-hiring-dhs-director/Content?oid=4124748", "ord_in_thread": 0, "title": "Now hiring: DHS director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "click to flip through (3) \nQuote of the Week \n\"Look, these are trying times for our nation. It's important to have a steady hand on the helm during times like this. ... And as you know the speaker doesn't have to be a member of the House. So, therefore: Vice President Cheney for speaker.\" \n— U.S. Sen. Tom Cotton, explaining to Politico with a straight face why Dick Cheney should be the next speaker of the House. Republican congressman Kevin McCarthy — the presumptive heir to the speakership after John Boehner leaves the position — dropped out of the running last week. \nJudge Griffen halts executions \nLast Friday, Circuit Judge Wendell Griffen stayed the scheduled executions of eight men on Arkansas's Death Row, pending a hearing on their request for an injunction. Two of the inmates were set to die on Oct. 21. The eight have filed suit to stop their executions because the state, under a law passed earlier this year, refuses to provide information about the drug cocktail to be used in lethal injections. \nGriffen's order allows the inmates their day in court, explaining that \"immediate and irreparable injury will result to Plaintiffs absent a temporary restraining order enjoining Defendants from executing Plaintiffs as scheduled.\" Well, that's hard to argue with. \nNow hiring: DHS director \nArkansas Department of Human Services Director John Selig will leave his position at the end of the year, the agency announced last week. Selig has been running DHS for a decade. He was appointed by Republican Gov. Mike Huckabee, then served for eight years under Democrat Mike Beebe, during which time he oversaw the implementation of the private option, Arkansas's expansion of Medicaid. \nWho's to replace him? Running the sprawling bureaucracy of DHS — which handles everything from foster care to food stamps — is among the hardest jobs in the state. Gov. Asa Hutchinson will need someone who's at once a technocratic wizard, a capable manager, a shrewd political operator and a willing punching bag for irony-challenged legislators looking to beat up on Big Government. \n1982 all over again? \nState Rep. John Walker (D-Little Rock), the civil rights attorney who has crusaded for decades for racial equity in local public education, filed a federal suit last week seeking to reverse the takeover of the Little Rock School District by the state in January. It's been less than two years since the LRSD reached a final legal settlement with the state in the desegregation suit originally brought by Walker in 1982. \nThe 71-page complaint argues that the ousting of a democratically elected (and majority black) LRSD board was the result of a conspiracy \"rooted in racial considerations.\" To argue his case, Walker has included pages and pages of exhibits, including emails that seem to show some within the (mostly white) Little Rock business community lobbying members of the state Board of Education for takeover long in advance of the decision. The suit also says the state has done little to address academic deficiencies in the LRSD since the takeover, which after all was motivated by low test scores. \nDon't stroll in Dover \nA federal jury last week declined to award damages to a Dover family that sued local and state law enforcement over a 2011 incident in which Eva Robinson and her son, Matthew, were accosted by an officer while walking their dog near their home. Read the details of the case online, but suffice it to say that before the encounter was over, Matthew (then 16) had been tased multiple time and he and his mother were both arrested, for no crime other than being resistant to the cops. \nWhile the jury deliberated last week, a jittery attorney for one of the defendants — Pope County Deputy Sheriff Kristopher Stevens — made the bad call to reach an 11th-hour settlement with the plaintiff's lawyer, for $225,000. About 30 minutes later, the jury returned its verdict siding with the defendants and awarding no damages. Too late: The settlement is still binding. The Robinsons at least will get $225,000 for their troubles.", "external_links": [], "published": "2015-10-15T09:00:00.000+03:00", "crawled": "2015-10-15T11:08:01.108+03:00", "highlightTitle": ""}