{"organizations": [], "uuid": "eec31b4a72979def10bc4088f06bcb1b99e5adf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz/taxonomy/term/3/all/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/govt-launches-first-national-science-strategy/5/233517", "country": "US", "title": "Govt launches first national science strategy", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Govt launches first national science strategy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T00:45:00.000+03:00", "replies_count": 0, "uuid": "eec31b4a72979def10bc4088f06bcb1b99e5adf4"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/govt-launches-first-national-science-strategy/5/233517", "ord_in_thread": 0, "title": "Govt launches first national science strategy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Monday, 5 October, 2015 - 09:45 \nScience and Innovation Minister Steven Joyce has today launched the inaugural National Statement of Science Investment (NSSI), which sets the long-term strategic direction for the Government’s investment in science. \n\"The NSSI provides a timely stocktake on the overall shape of our science system that will help determine where the next investments should be made.\" Mr Joyce says. \n\"Over the next five to 10 years, the science system will be increasingly prominent as it both shapes and is shaped by an economy that is increasingly innovation-led, with New Zealanders who are more engaged with science in their daily lives than ever before. \n\"This first NSSI responds to the need to plan more strategically, target New Zealand’s growing science investments more effectively, and leverage them to maximise their long-term value to New Zealand.\" \nA Draft NSSI was released for public feedback in May of last year. It reviewed the entire cross-government investment in research and development, and proposed potential reforms to the sector-specific research funds administered by the Ministry of Business, Innovation and Employment (MBIE). \n\"As a result of the feedback on the Draft NSSI, we have redesigned the contestable fund managed by MBIE to be a single, more agile fund that is able to respond to emerging opportunities,\" Mr Joyce says. \n\"Funding will be offered through two investment mechanisms with an Investment Plan to signal how, when and why the Government will invest over a three-year horizon. The Investment Plan will align with the future direction signalled in the NSSI to ensure investment is targeted in high-impact areas.\" \nOther actions include: \n- Introducing Annual System Performance Reports as well as a comprehensive sector-wide evaluation, monitoring and reporting system for public science; \n- Developing a new International Science Strategy to maximise the benefit from international science engagement; \n- Establishing new Regional Research Institutes; \n- Reviewing Crown Research Institutes’ core funding; and \n- Undertaking a strategic refresh of the Health Research Council. \n\"It’s vital that our science system responds to the unique economic, environmental and cultural challenges that New Zealand faces now and in the future,\" Mr Joyce says. \"The NSSI outlines actions to deliver a highly dynamic science system that will make a greater and more measurable contribution to our productivity and wellbeing. \n\"This Government has increased New Zealand’s public science investment by 70% since 2008, to $1.5 billion annually. Along the way we have introduced a number of new initiatives including the National Science Challenges, Callaghan Innovation and the Primary Growth Partnerships,\" Mr Joyce says. \n\"The New Zealand science system is critical to our long-term prosperity. The NSSI will allow us to capitalise on opportunities to increase the value and effectiveness of our $1.5 billion investment, and to maximise the contribution of science to New Zealand’s economic growth, prosperity, and the wellbeing of all New Zealanders.\" \nThe National Statement of Science Investment spans a 10-year horizon and will be refreshed every three years. It is available at: http://www.mbie.govt.nz/info-services/science-innovation/national-statement-science-investment \n ", "external_links": [], "published": "2015-10-05T00:45:00.000+03:00", "crawled": "2015-10-05T03:00:58.572+03:00", "highlightTitle": ""}