{"organizations": [], "uuid": "2046c2555d8a62ab8fde0e64a2a4129ecad39c6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/sitelogo/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://www.heraldscotland.com/politics/political_news/13839544.SNP_MP_gives_office_job_to_boyfriend/?ref=rss", "country": "", "title": "SNP MP gives office job to boyfriend", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "SNP MP gives office job to boyfriend", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T02:07:00.000+03:00", "replies_count": 0, "uuid": "2046c2555d8a62ab8fde0e64a2a4129ecad39c6e"}, "author": "", "url": "http://www.heraldscotland.com/politics/political_news/13839544.SNP_MP_gives_office_job_to_boyfriend/?ref=rss", "ord_in_thread": 0, "title": "SNP MP gives office job to boyfriend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 comments \nA new SNP MP has been criticised after she gave a job in her office to her boyfriend. \nAnne McLaughlin, who represents Glasgow North East, provided Graham Campbell with a post that involves liaising with local community groups. \nFollowing a review in 2009 by Sir Neil McIntosh, Holyrood implemented a two stage ban on MSPs hiring relatives. \nLoading article content \nA curb on giving jobs to family members not already on the payroll was introduced immediately, with existing relatives getting a stay of grace until 2016. \nHowever, MPs are still allowed to employ loved ones on condition that the jobs are declared. \nIn a political podcast after her election in May, McLaughlin ran through her new hires: \"I’ve got Graham Campbell working two days a week, and his role is to do funding with local community groups. I am getting a lot of groups coming to me, worried about losing their funding, and he’s going to be working with them to ensure that they don’t lose funding, and that they open up the applications that they are doing.” \nCampbell is an anti-capitalist campaigner and McLaughlin’s long-term partner. \nHe was reported to the procurator fiscal last year after an incident involving SNP councillor Billy McAllister in August 2014, but the case was dropped. Promoted stories \nA Crown Office spokesman said at the time: \"After full and careful consideration of the specific circumstances of the case and the available evidence, Crown Counsel instructed that there should be no criminal proceedings at this time.\" \nThe MP also mentioned Campbell in her maiden speech: “My partner, Graham Campbell, is an English-Scottish-Jamaican socialist who led Africans for an Independent Scotland during the referendum. Scotland’s referendum engaged everyone.” \nCampbell stood as a candidate for Solidarity in the 2012 local council election and for the Trade Unionist and Socialist Coalition in the 2010 general election in Glasgow North East, where he polled 0.6%. \nOn his Linkedin profile, the left-winger describes himself as “managing director” of Graham Campbell Fundraising & Consulting Services. \nHis biography states: “My objective is to help you build and sustain meaningfully and financially viable independent community organisations. \n“My rates are very reasonable quite simply because I believe all the funds should go to the charity, not into the pockets of overcharging con-insultants [sic]. Give it a go, the time you spend with me learning how to fundraise, earns itself back in no time.” \nMcLaughlin was an SNP List MSP for two years from 2009 before losing out in the 2011 Holyrood election. \nShe lost a Westminster by-election but defeated Labour’s Willie Bain in May. \nTory MSP Murdo Fraser said: “The SNP has tried to set itself up as bringing a new style of politics to Westminster, but it seems that some of their number are falling short. Here we have an SNP MP using public funds to support a partner – how many others will be up to the same trick? This is hardly the ‘new politics’ that the SNP has been talking about.” Share article \nCentral Scotland MSP John Wilson said: “It's unfortunate that Anne McLaughlin has decided to employ her partner. Once again it raises the issue of SNP MPs falling into the Westminster habit of ignoring public opinion when it comes to using parliamentary resources.” \nAn SNP spokesperson: \"Anne McLaughlin employs Graham Campbell two days a week. She has declared this to the parliamentary authorities but as he is neither her husband nor cohabiting with her, the parliamentary authorities do not class him as a 'connected party'. The parliamentary authorities decided, on that basis, not to publish Ms McLaughlin's employment of Mr Campbell despite her requests that they do so.' Promoted Stories", "external_links": [], "published": "2015-10-11T02:07:00.000+03:00", "crawled": "2015-10-11T03:27:15.182+03:00", "highlightTitle": ""}