{"organizations": [], "uuid": "7d47e68c4ff670b3bbf7883e311968ea87d1802a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/a01_jd_10oct_million-263x400.jpg", "site_section": "http://www.abqjournal.com/category/politics", "section_title": "Politics | Albuquerque Journal News", "url": "http://www.abqjournal.com/657612/news/louis-farrakhan-returns-to-mall.html", "country": "US", "title": "Louis Farrakhan returns to Mall", "performance_score": 0, "site": "abqjournal.com", "participants_count": 6, "title_full": "Louis Farrakhan returns to Mall | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:05:00.000+03:00", "replies_count": 5, "uuid": "fc4c1877a75d8d955c4e16a42a16e955a51563fb"}, "author": "Jesse J. Holland / The Associated Press", "url": "http://www.abqjournal.com/657612/news/louis-farrakhan-returns-to-mall.html#post-0", "ord_in_thread": 0, "title": "Louis Farrakhan returns to Mall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON – The Million Man March is remembered by many who were there as a watershed event, despite the fact that its impact on the way America regards African-American men remains an open question 20 years later.\nIt was something the United States has not seen for decades: thousands upon thousands upon thousands of men, most of them black, congregated peacefully on the National Mall, clapping, cheering, testifying, promising they would work for a better future for themselves and their families.\nParticipants in the Million Man March gather on Capitol Hill and the National Mall on Oct. 16, 1995. Estimates of the crowd ranged from 400,000 to 800,000. (AP Photo/Mark Wilson)\nNation of Islam leader Louis Farrakhan, who led the first Million Man March, will commemorate that event on Saturday with a “Justice or Else” march on the National Mall. The goal, organizers say, is to incorporate calls for justice for the recent deadly shootings mostly of black men with the anniversary of the original gathering.\nAttention has been focused on the relationship of African-American men with the police and law enforcement since the fatal shootings of 17-year-old Trayvon Martin in 2012 in Florida and 18-year-old Michael Brown in 2014 in Ferguson, Mo.\nSince then, deaths of other unarmed black males at the hands of law enforcement officers have inspired protests under the “Black Lives Matter” moniker around the country.\n“Even though, if you talk about 2015, we’ve had some problems – a lot of problems in this past year – I think that since the first Million Man March a lot has happened, things have moved forward and I’m looking forward to seeing us do some of the remaining things that need to be done,” said Harvard professor Charles Ogletree, who attended the original march with his son and namesake back on October 16, 1995.\nMillions watched live coverage of the 1995 march on television as Farrakhan and other civil rights leaders spoke about increasing pride and responsibility and condemned negative racial stereotypes about black men.\nImmediately afterward, organizers said that around 1.7 million black men registered to vote and participation by black men in social and civil organizations skyrocketed.\nThe National Park Service estimated the attendance at around 400,000, but subsequent counts by private organizations put the number at 800,000 or higher. The National Park Service has refused to give crowd estimates on Mall activities since.\nFarrakhan called the original march “a magnificent and important day” but said today “conditions we face and rising levels of tyranny and oppression have brought us to another point in our sojourn in America.”\nSaturday’s event “is not a march, but a gathering of those who are sober-minded and serious about placing a demand on the United States government and putting power behind that demand to force the government to give us what we deserve,” said Farrakhan, who has also recently focused on black-on-black crime in cities like Chicago.\nFarrakhan has called for federal and state government intervention in police investigations, and for greater responsibility in the black community for the violence in the inner city.\nBut there is no doubt that the 1995 Million Man March struck a chord in the American psyche, and imitations followed: a Million Mom March, a Million Mask March, a Million Father March.\n“That march, the men, was a symbol of what America needed to address and still needs to address in terms of justice, equality, education and appreciation for young men, particularly young men of color,” said Myrlie Evers-Williams, former chair of the NAACP and widow of slain civil rights activist Medgar Evers.", "external_links": ["http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/a01_jd_10oct_million-394x600.jpg"], "published": "2015-10-10T08:05:00.000+03:00", "crawled": "2015-10-12T09:31:06.200+03:00", "highlightTitle": ""}