{"organizations": ["Associated Press", "AP"], "uuid": "31068c4af7e3db7da7f2851aa814bc1a5224ff0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.naplesnews.com", "main_image": "http://sharing.naplesnews.com/sharetcp/photo/2015/09/30/Clinton_Emails__JPEG-056c2_24609638_ver1.0_640_480.jpg", "site_section": "http://www.naplesnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100108&categoryId=60013", "section_title": "Politics | NPDN", "url": "http://www.naplesnews.com/news/politics/for-hillary-clinton-october-presents-series-of-risks-and-rewards-5-things-to-watch_83242578", "country": "US", "title": "Big month ahead for Clinton: 5 things to watch", "performance_score": 0, "site": "naplesnews.com", "participants_count": 0, "title_full": "Big month ahead for Clinton: 5 things to watch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T02:05:00.000+03:00", "replies_count": 0, "uuid": "31068c4af7e3db7da7f2851aa814bc1a5224ff0b"}, "author": "", "url": "http://www.naplesnews.com/news/politics/for-hillary-clinton-october-presents-series-of-risks-and-rewards-5-things-to-watch_83242578", "ord_in_thread": 0, "title": "Big month ahead for Clinton: 5 things to watch", "locations": ["Iowa", "Des Moines"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Clinton", "Hillary Rodham Clinton", "LISA LERER", "KEN THOMAS"], "text": "For Hillary Clinton, October presents series of risks and rewards: 5 things to watch KEN THOMAS and LISA LERER, Associated Press 7:05 PM, Sep 30, 2015 Democratic presidential candidate Hillary Rodham Clinton speaks earlier this month in Des Moines, Iowa. Clinton faces an October full of opportunity and risk for her presidential campaign. (AP Photo/Charlie Neibergall, File) Charlie Neibergall   Show Caption Previous Next \nWASHINGTON (AP) — With a presidential debate and a contentious appearance in Congress coming, Hillary Rodham Clinton faces an October full of opportunity and risk for her presidential campaign. \nPOLL: Do you think Hillary Clinton will win the Democratic primary in 2016? Scroll down to vote. \nThe former secretary of state has spent months watching her poll numbers sink in crucial early voting states and faced endless questions about her email practices at the State Department. \nThe first Democratic primary debate in Las Vegas and her congressional testimony before a Republican-led panel investigating the 2012 terrorist attacks in Benghazi, Libya, will give Clinton a big platform to make the case for her candidacy and challenge her Republican critics. \nThese events, of course, are equally a platform for opponents to try to weaken her. \nAlso in October, Clinton’s campaign will disclose details about its fundraising and expenditures. The full Democratic field will appear at the Iowa Democratic Party’s annual Jefferson-Jackson dinner, which was a turning point for Barack Obama in his upstart bid against Clinton in the fall of 2007. \nThe most pivotal development could come from Vice President Joe Biden. His potential entry into the Democratic field could shake up the race and offer the party another alternative to Clinton, along with her chief rival now, Vermont Sen. Bernie Sanders. \nA preview of Clinton’s October: \n\n1. BIDEN: Will he or won’t he? \nBiden’s decision could have major ramifications for Clinton’s standing in the primaries. If the vice president runs, he would give wary Democrats an excuse to abandon Clinton, even though she has locked up lots of congressional endorsements and financial donors. If Biden stays out, Clinton would campaign from a stronger position and could further make the case that she is the most electable Democrat against Sanders, former Maryland Gov. Martin O’Malley and others. Biden has said he is unsure whether he and his family will have the “emotional energy” for a campaign so soon after the death of his 46-year-old son, Beau Biden. But his appearances around the country have turned into a parlor game for political insiders, creating a distraction for Clinton as she tries to consolidate support. \n\n2. FUNDRAISING \nClinton raised $47.5 million after launching her campaign in April. Her next fundraising report will show how she fared during the typical summer lull and give insiders a look into how efficiently her campaign is running. Clinton’s team has built a massive operation at its Brooklyn, New York, headquarters and has hired dozens of field organizers in the early voting states of Iowa and New Hampshire, where it has been spending about $400,000 a week on television advertising. Sanders is running a much leaner operation, and most of his $15.2 million haul in his first report came from donors giving $200 or less. Any signs that Clinton’s fundraising edge is dwindling or she is burning through cash would set off more alarm bells in the party. \n\n3. FIRST DEBATE \nThe Oct. 13 debate in Nevada will give voters their first opportunity to measure Clinton on stage against Sanders and the rest of the field. Clinton has avoided directly criticizing Sanders’ policy positions or his role in the primaries but her campaign has indicated voters may soon see a contrast between the two candidates. Clinton needs to tread carefully because she will need Sanders’ supporters to help her campaign if she wins the nomination. Millions of people have tuned into the first two Republican debates, raising the potential stakes for Democrats. \nThere could be an element of surprise: CNN will allow Biden to participate even if he decides to become a candidate in the hours before the debate. Clinton’s team sees debates as a strong suit for her. But observers remember her struggles, in an October 2007 debate, to answer a question about whether immigrants in the U.S. illegally should be issued driver’s licenses. \n\n4. BENGHAZI TESTIMONY \nFor months, Clinton has tried to provide public testimony before the panel investigating her response to the Benghazi attack while she was President Obama’s top diplomat. She will get that opportunity Oct. 22. Supporters hope for a reprise of her fiery January 2013 appearance before lawmakers. Clinton’s advisers view the October testimony as a chance for her to take on her Republican critics and predict some GOP lawmakers will overreach to the point of bullying her — imagery that could make the inquiry look like a political vendetta and boost her campaign. Still, the appearance could bring more attention to her use of a private email address and server and to questions about whether she exchanged classified information at the time. \n\n5. THE J-J \nIf Clinton hopes to project strength in Iowa, the Iowa Democratic Party’s annual Jefferson-Jackson dinner is the place to do it. The Oct. 24 dinner typically draws thousands of hard-core Democratic activists. It’s where eventual Democratic nominee John Kerry took on Howard Dean in the fall of 2003, and where Obama electrified Democrats in 2007. Some of Clinton’s stronger moments during this campaign have come at large party events such as her speech before the New Hampshire state party convention, her address to the Democratic National Committee in Minneapolis and her “Wing Ding” speech in Iowa, when she railed against Republicans playing “partisan games.” Clinton’s 2007 appearance at the dinner fell flat next to Obama’s. How she stacks up in the hall against Sanders and potentially Biden could set the tone for the remainder of the Iowa campaign. \n ", "external_links": [], "published": "2015-10-01T02:05:00.000+03:00", "crawled": "2015-10-01T11:58:33.593+03:00", "highlightTitle": ""}