{"organizations": [], "uuid": "f8e38e35749d1c6ed4b1dbacbafa504a545a625d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/154657/politics", "section_title": "Politics - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30349165/ted-cruz-adds-billionaire-backer-to-presidential-campaign", "country": "US", "title": "Ted Cruz adds billionaire backer to presidential campaign", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Ted Cruz adds billionaire backer to presidential campaign - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "f8e38e35749d1c6ed4b1dbacbafa504a545a625d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30349165/ted-cruz-adds-billionaire-backer-to-presidential-campaign", "ord_in_thread": 0, "title": "Ted Cruz adds billionaire backer to presidential campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JULIE BYKOWICZ\nAssociated Press HOUSTON (AP) - Republican presidential candidate Ted Cruz has picked up the backing of a Texas billionaire and the state's lieutenant governor, his campaign said Monday.\nDarwin Deason, a technology entrepreneur, and his son, Doug, had given millions of dollars to the 2016 efforts of former Texas Gov. Rick Perry, who ended his bid for the White House last month.\nLt. Gov. Dan Patrick - a one-time foe of the Texas senator - also will now serve as the Texas chairman of Cruz's presidential campaign.\nCruz is one of several Republican presidential candidates with Texas ties, but he has dominated the state's generous donor class. In the first nine months of the year, Cruz raised more than three times as much in the state as did Jeb Bush, according to an Associated Press analysis of donations.\nBush, a former Florida governor, spent much of his youth in Texas, and his father and brother, both former presidents, still call the state home.\nThe Bush family is rallying around Jeb Bush on Monday at a donor event that's taking place less than 6 miles from where Cruz is announcing his team's additions.\nPatrick's backing of Cruz gives him a powerful surrogate in a delegate-rich state where Republican primary voters go to the polls on March 1. And adding the Deasons to his financial team could significantly boost Cruz's presidential campaign accounts.\nEarlier this year, Darwin Deason poured $5 million into pro-Perry super PACs - making him one of the biggest contributors in presidential politics. After Perry's withdrawal from the race, the super PACs returned much of that money.\nCruz also has super PACs working on his behalf. Those groups can take unlimited amounts of money from donors, while the campaigns themselves cannot accept contribution checks from each donor of more than $2,700 per election.\nWhen super PACs are factored into the mix, Cruz's fundraising is second only to Bush's in the GOP field. Together, the pro-Cruz groups had raised at least $64 million by the end of September, fundraising documents show.\nBush and Cruz have both shown they can land big contribution checks. But Cruz holds a sharp fundraising advantage over Bush when it comes to small donors.\nWhile only about 4 percent of Bush's campaign haul has come from contributors giving $200 or less, 41 percent of Cruz's campaign money is coming from such small donors, fundraising records show.\nThose kinds of givers are especially valuable because they can provide a constant stream of cash without taking up the candidate's time attending traditional fundraising events.\nThe Deasons are marquee names for Cruz, but he has quietly consolidated the support of many former donors to Perry and another 2016 dropout, Wisconsin Gov. Scott Walker. The Cruz campaign added five other former Perry backers to its finance team, officials said on Monday.\nCruz gained a larger share of those candidates' donors than anyone else in the race, according to an analysis by crowdpac.com, a nonpartisan political analytics company.\n___\nFollow Julie Bykowicz on Twitter at: http://twitter.com/bykowicz\n ", "external_links": ["http://twitter.com/bykowicz"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T17:58:55.714+02:00", "highlightTitle": ""}