{"organizations": [], "uuid": "d73bcb3e31648b70d7936ad34372cc1428fc1a52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://feeds.feedburner.com/~r/MychalMassie/~4/uZ0wawezvS8", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/obama-attacks-second-amendment-but-rewards-illegals-3062416.html", "country": "US", "title": "Obama Attacks Second Amendment but Rewards Illegals | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Obama Attacks Second Amendment but Rewards Illegals | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T07:43:00.000+03:00", "replies_count": 0, "uuid": "d73bcb3e31648b70d7936ad34372cc1428fc1a52"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/obama-attacks-second-amendment-but-rewards-illegals-3062416.html", "ord_in_thread": 0, "title": "Obama Attacks Second Amendment but Rewards Illegals | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nMychal Massie is Chairman of the National Leadership Network of Black Conservatives-Project 21 – a conservative black think tank located in Washington, D.C. He was recognized as the 2008 Conservative Man of the Year by the Conservative Party of Suffolk County, N.Y. In December, 2011, he was recognized as one of the 20 most influential black Republicans. Mychal is a prolific blogger, a nationally recognized political activist, pundit, and columnist. He has appeared on Fox News Channel, Fox Business Channel, CNN, MSNBC, C-SPAN, NBC, and talk-radio programming worldwide. A former self-employed business owner of more than 30 years, Mychal’s website is mychal-massie.com\nI was educated to understand that The United States of America is a sovereign nation. As such I was taught that there are laws that people who wanted to come into our sovereign nation had to obey. But Obama has turned America into a doormat, allowing people to be rewarded for coming here illegally.\nBut Obama and politicians on both sides of the aisle treat law-abiding gun owners and firearms enthusiasts as criminals. There are now upward of 30,000 gun laws and statutes, none of which have prevented, let alone stopped criminals from committing violent crimes, yet legal Americans are having their Second Amendment rights impinged upon.\nMuslims (those here legally and illegally) continue to murder innocent Americans in our cities nationwide and threaten to murder more. If nothing else, Muslims have proven to be true to their promise of murdering Americans but no one from Obama down to the lowest politician is calling for a ban on Muslims.\nIn 2015, California Law AB60 went into effect, which allowed illegals to obtain driver’s licenses. The spin was that driver’s licenses issued to illegals would amount to 1.4 million applicants over three years. But as The Sacramento Bee reported July 17, 2015 nearly half a million illegal aliens had applied for driver’s licenses the first half of the year.\nErgo, illegals are rewarded for breaking sovereign law. But nearly 100 million law-abiding gun owners are terrorized and threatened by draconian attempts to have their Second Amendment rights denied, every time a pharmaceutically addicted loner goes on a killing spree.\nIn a rare moment of honesty, the New York Times reported in 2010 that some 4.5 million illegal aliens in the U.S. drive vehicles without licenses or insurance. Even more egregious is included in that numbers are those who are unable to read road signs written in English. (Some Unlicensed Drivers Risk More Than a Fine; Julia Preston/Robert Gebeloff; 12/9/2010)\nCongressman Steve King, R-IA, estimated that illegal aliens driving drunk were responsible for killing 4,745 Americans annually; that’s 13 Americans a every day. (See: Illegal Alien Crime and Violence by the Numbers: We’re All Victims; Peter B. Gemma, National Executive Committee Member; Constitution Party)\nObama, his former Attorney General Eric Holder, Al Sharpton, the NAACP, and every leftist front group one can name, consistently argue that it is racist to require identification to vote. But legal, law-abiding citizens must show identification to purchase ammunition. A rhetorical question would be which is more of a threat to our national sovereignty: tens of millions of illegals falsely voting along with those persons given to voter villainy or a law-abiding firearms enthusiast buying ammunition for their firearm(s)?\nWhen is the last time Congress and/or a president honored their oath to protect the Untied States and uphold her laws – which includes protecting legal citizens from invasion by illegals? Conjunctive to that question, which group is responsible for more crime, more murders, more terrorism, ad nauseum – illegals or law abiding gun owners and enthusiasts?\nWe know the answer to these questions, but the question that no one asks is why are those who took an oath to protect and defend the Constitution of The United States eager to reward illegal aliens and punish law-abiding citizens who happen to enjoy firearms?\nThat said, I argue it is the fault of We the People that this abortion of justice takes place. If We the People refused to support or vote for anyone who remotely favored illegal aliens and anyone who even hinted at not embracing the Second Amendment as written, we could begin to change this practice. But we accept the lies, obfuscation, and deceit of politicians to our own peril.\nThere are roughly 95 million Americans who are no longer in the labor force. The labor force participation rate is the lowest in 38 years, which dates to the Jimmy Carter presidency. There are approximately 57 million women not in the labor force, which is a record low. And even more abysmal, the Washington Examiner reported: “For a third month in a row, native-born Americans saw their job numbers tumble while [illegal aliens] experience solid [job] gains. … According to the monthly Bureau of Labor Statistics numbers just released, ‘foreign-born’ [read illegal aliens] jobs numbers increased by 14,000, while those for ‘native-born’ Americans [read legal citizens] fell off a cliff, by 262,000. (Jobs Up Only For Immigrants; Paul Bedard; 10/2/2015)\nWith these horrific reminders of the demoralizing affect this administration has had on our economy, one would think there were things of greater importance for Obama and our elected officials s to attend to than trying to violate our Constitutional right to own and bear arms.\nTAKE ACTION: Every $1 helps The Daily Rant reach 1,000 new readers with this article.\nPLEASE CHOOSE ONE: $20 $50 $100", "external_links": ["http://feeds.feedburner.com/~r/MychalMassie/~4/uZ0wawezvS8", "http://feeds.feedburner.com//https://mf182.infusionsoft.com/app/orderForms/The-Daily-Rant-Digital-Door-Knock", "http://feeds.feedburner.com//https://mf182.infusionsoft.com/app/orderForms/The-Daily-Rant-Digital-Door-Knock-100", "http://feeds.feedburner.com//https://mf182.infusionsoft.com/app/orderForms/The-Daily-Rant-Digital-Door-Knock-50"], "published": "2015-10-08T07:43:00.000+03:00", "crawled": "2015-10-08T13:45:51.895+03:00", "highlightTitle": ""}