{"organizations": [], "uuid": "6321bc01014f82c50b1810df26f94c77a4042846", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/digital/images/FBSharingIcons_dispatch.png", "site_section": "http://dispatch.com//content/syndication/news_ohio_politics.xml", "section_title": "Political News - Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/21/issue-1-not-well-funded-but-is-well-received.html", "country": "US", "title": "Issue 1 on Ohio redistricting not well funded but is well received", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Issue 1 on Ohio redistricting not well funded but is well received | The Columbus Dispatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T11:16:00.000+03:00", "replies_count": 0, "uuid": "6321bc01014f82c50b1810df26f94c77a4042846"}, "author": "The Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/21/issue-1-not-well-funded-but-is-well-received.html", "ord_in_thread": 0, "title": "Issue 1 on Ohio redistricting not well funded but is well received", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The campaign to pass Issue 1 doesn’t have much money, and there have been reports of internal issues, but it does have wide-ranging support and no organized opposition.\nThe AFL-CIO, Columbus Chamber of Commerce, Ohio Farm Bureau and Fraternal Order of Police of Ohio gathered on Tuesday to voice their support for the proposed constitutional amendment on legislative redistricting.\n“When trying to address pressing issues in our communities through the legislative process, the FOP has been stymied by partisan politics that result from the current gerrymandered districts,” said Gary Wolske, vice president of the FOP of Ohio.\nIssue 1 seeks to change Ohio’s hyper-partisan process for drawing legislative districts, in which the majority party gerrymanders the lines for its own benefit. The process leads to few competitive districts and a Statehouse that doesn’t necessarily reflect the political leanings of the voting public.\n>> Dispatch Voters Guide: Check out all the contested races on your ballot \nCo-campaign chairmen, former state Reps. Matt Huffman, a Republican from Lima, and Vernon Sykes, an Akron Democrat, said polls have Issue 1 passing, especially when people hear the ballot summary. A poll released on Tuesday by the University of Akron’s Bliss Institute found that Issue 1 is supported 55 percent to 16 percent, though a sizable group remains undecided.\nThe official Issue 1 campaign, Fair Districts for Ohio, has raised less than $300,000. The group has done a targeted mailing and will soon run radio spots across the state.\n“When a campaign raises a quarter-million dollars, there’s not much to fight about,” Huffman said, responding to a question about dysfunction in the campaign.\nSykes said there has been agreement on how money is spent. “We’ve run a campaign as strong as we can with the funds available to us.”\nHuffman said a key to the campaign has been getting organizations and the political parties to spread the message. A separate Yes on Issue 1 campaign, led by the League of Women Voters of Ohio, Common Cause Ohio and Ohio Voice, has been gathering endorsements and using grass-roots efforts to promote the issue.\n>> Keep up on political news and insights with our Dispatch Politics newsletter. Sign up today. \nThe marijuana-related Issues 2 and 3 have been soaking up far more money and attention than Issue 1.\nUnder Issue 1, a seven-member commission — the governor, auditor, secretary of state and four legislative appointees — will approve House and Senate maps drawn under a new set of criteria. A 10-year map requires support from at least two minority-party members; otherwise, it must be redrawn again in four years.\nIssue 1 says the redistricting commission shall attempt to draw a map that does not primarily favor a political party, and corresponds closely to the statewide preferences of voters.\nThe plan “will go a long way toward restoring balance in the General Assembly and opening up policy views that are more reflective of the electorate as a whole,” said Tim Burga, president of Ohio AFL-CIO.\nBased on its legislative report cards, the Chamber of Commerce has seen largely positive results from a Republican Statehouse majority bolstered by gerrymandered districts. But Michael Dalby, president of the Columbus Chamber of Commerce, said Issue 1 is about being fair, equitable and representative.\n“We’re trying to create the best democracy that we can,” he said, adding that the issue “makes for sound, smart government.”\njsiegel@dispatch.com \n@phrontpage", "external_links": [], "published": "2015-10-21T11:16:00.000+03:00", "crawled": "2015-10-21T15:23:10.497+03:00", "highlightTitle": ""}