{"organizations": ["Vanity Fair"], "uuid": "4fe35e40920391d44472f1ce259ede7fd241e3ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ketv.com", "main_image": "http://www.ketv.com/image/view/-/35881028/highRes/1/-/maxh/630/maxw/1200/-/lseanfz/-/Donald-Trump-arrives-in-Virginia-jpg.jpg", "site_section": "http://www.ketv.com/9675468?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.ketv.com/money/donald-trump-renews-feud-with-vanity-fair-editor-graydon-carter/35888048", "country": "US", "title": "Trump renews feud with Vanity Fair editor Carter", "performance_score": 0, "site": "ketv.com", "participants_count": 0, "title_full": "Trump renews feud with Vanity Fair editor Carter", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T06:23:00.000+03:00", "replies_count": 0, "uuid": "4fe35e40920391d44472f1ce259ede7fd241e3ed"}, "author": "", "url": "http://www.ketv.com/money/donald-trump-renews-feud-with-vanity-fair-editor-graydon-carter/35888048", "ord_in_thread": 0, "title": "Trump renews feud with Vanity Fair editor Carter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Carter Trump", "Carter"], "text": "Trump renews feud with Vanity Fair editor Carter Sniping goes back 25 years UPDATED 10:23 PM CDT Oct 17, 2015 Photos Chip Somodevilla/Getty Images \nAccording to Donald Trump, there's a new rumor that Vanity Fair editor Graydon Carter is about to be ousted. Links Trump promises plan, sees small... \nTrump tweeted the same rumor a year and a half ago, and it hasn't come true yet. \nThis time, in a tweet on Friday evening, he said \"rumor has it\" that Carter \"is going to be fired or replaced very soon?\" \nTrump despises Carter and Carter doesn't much like him, either. \nIn 2012 Trump tweeted, \"Can't wait for Vanity Fair to fold which, under Graydon Carter, will be sooner rather than later.\" \nThe feud between the two New York City A-listers dates back more than 25 years, to the days when Trump was a brash real estate billionaire on the rise and Carter was co-editing Spy, the legendary satirical magazine he founded with Kurt Andersen. \nThe magazine took delight in trashing Trump. \"In modern media terms, Donald Trump was our clickbait,\" Spy contributing editor Bruce Feirstein recalled in August. \nCarter took credit for coming up with the phrase \"short-fingered vulgarian\" to describe Trump in 1988. And Trump has never forgotten it. \nSpy magazine struggled to stay afloat, and Trump celebrated when it stopped publishing. \nIn 2012 Trump's first tweet about Carter was a prediction that the famed editor would \"preside over the end of Vanity Fair\" in the same way he \"drove Spy Magazine into bankruptcy.\" \nIn two dozen tweets since, he has lambasted Carter for having \"no talent,\" for being a \"real loser,\" and for being \"sleepy\" and \"dopey.\" Once he wrote that \"Graydon Carter is a major loser, just ask his wife!\" \nCarter is an investor in several prominent restaurants in Manhattan, and Trump isn't a fan of those, either. \"Worst food in city,\" he wrote about the Waverly Inn in 2013. \nThis time last year, he said he loved seeing Carter and Vanity Fair \"failing so badly\" and added, \"He's only focused on his bad food restaurants.\" \nCarter recounted his history with Trump in his editor's note in Vanity Fair's November issue. \n\"The myriad vulgarities of Donald Trump — examples of which are retailed daily on Web sites and front pages these days — are not news to those of us who have been living downwind of him for any period of time,\" he wrote. \nCarter brought up the \"short-fingered vulgarian\" insult and said that \"to this day, I receive the occasional envelope from Trump.\" \nInside it, he wrote, \"There is always a photo of him — generally a tear sheet from a magazine. On all of them he has circled his hand in gold Sharpie in a valiant effort to highlight the length of his fingers. I almost feel sorry for the poor fellow because, to me, the fingers still look abnormally stubby.\"", "external_links": [], "published": "2015-10-18T06:23:00.000+03:00", "crawled": "2015-10-18T15:50:11.387+03:00", "highlightTitle": ""}