{"organizations": [], "uuid": "b37769e82e536a1288a38daa584999f2a5e0f141", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz/taxonomy/term/3/all/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/rotorua-annual-report-update-shows-59m-improvement/5/234996", "country": "US", "title": "Rotorua annual report update shows $5.9m improvement", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Rotorua annual report update shows $5.9m improvement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:20:00.000+03:00", "replies_count": 0, "uuid": "b37769e82e536a1288a38daa584999f2a5e0f141"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/rotorua-annual-report-update-shows-59m-improvement/5/234996", "ord_in_thread": 0, "title": "Rotorua annual report update shows $5.9m improvement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Wednesday, 21 October, 2015 - 10:20 \nRotorua Lakes Council finished the 2014/15 year in good shape and $5.9 million better than budget, according to a progress report on the council’s 2014/15 annual report. \nThe progress report was presented by the council’s chief financial officer, Thomas Collé, to an Operations and Monitoring Committee meeting this morning (Wednesday 21 October). Mr Collé covered key points of the draft annual report ahead of a full council meeting on 29 October where the 2014/15 annual report is scheduled for final adoption. \nMr Collé said $8.3 million in operating costs had been removed from the budget during the year. \n\"Cash flow is $5.9 million better than budget, and we repaid debt instead of borrowing.\" \nHe said the draft annual report had also received a clear government audit. \nStanding in for Operations and Monitoring Committee chair Janet Wepa, deputy chair Charles Sturt said he was particularly impressed with the council’s financial performance in the past year and noted that council finances were \"on track.\" \n\"Finishing the 2014/15 year $5.9 million better than budget is an outstanding position. This very good result is a reflection of a methodical and well-managed approach. \n\"We had planned to borrow $4.2 million, and we finished up $1.7 million better off in cash. This has meant we’ve been able to pay down $1.2 million in debt - the first such debt payment in many years - and still finish with a cash reserve that’s increased by $500,000. \n\"That’s an outstanding result and I want to congratulate my fellow councillors for being prepared to make the hard decisions to get us into this much improved position, and also council staff who’ve shown admirable commitment to reducing costs across the council. \n\"It’s not been easy to get where are today, but we’re now a much leaner, more transparent and more accountable council, and our community can have confidence in our determination to maintain that momentum,\" he said. \nMr Sturt’s confidence was reinforced by a separate report presented to councillors by Mr Collé on the council’s financial performance for the first three months (July-September) of the current 2015/16 year. \nMr Collé said the council was tracking on budget with only minor variances from some expenditure timing and budget phasing. \n\"Revenue from fees and charges is already $111,000 ahead of budget, with a good early result by the museum which has increased retail, café and admission income by $61,000 above budget. \n\"Our operational expenses are tracking $127,000 below budget, partly a result of lower electricity prices. And financial costs to date are $95,000 lower than budget, largely due to our starting the year with lower debt than planned, along with lower interest rates on short term borrowing. \nMr Collé said the council’s capital works budget was in line with budget levels and he expected the council would be able to continue operating within its approved \"budget envelope.\" \n ", "external_links": [], "published": "2015-10-21T01:20:00.000+03:00", "crawled": "2015-10-21T07:28:16.056+03:00", "highlightTitle": ""}