{"organizations": [], "uuid": "c2b6f6a4faecb12a335bc401826d71bbd353074d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30185823/vonage-granted-seven-new-patents", "country": "US", "title": "Vonage Granted Seven New Patents", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Vonage Granted Seven New Patents - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "c2b6f6a4faecb12a335bc401826d71bbd353074d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30185823/vonage-granted-seven-new-patents", "ord_in_thread": 0, "title": "Vonage Granted Seven New Patents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Vonage\nCompany now owns more than 90 U.S. Patents\nHOLMDEL, N.J. , Oct. 5, 2015 /PRNewswire/ -- Vonage Holdings Corp. (NYSE: VG), a leading provider of cloud communications services for businesses and consumers, was granted seven new patents in the third quarter of 2015 by the United States Patent and Trademark Office. The Company now owns 93 U.S. patents, with 249 U.S. patent applications pending, along with many foreign patents and pending applications in jurisdictions worldwide.\n\"These recent patents cover solutions that enhance the customer experience, including seamlessly integrating a business's cloud phone system with business software applications for CRM and productivity, helping to enhance efficiency and client relationships,\" said Chief Legal Officer Kurt Rogers .\nBusiness Patents\nU.S. Pat. No. 9,112,747 , \"Dynamic Application Integration Associated with Telephony Communications Through Hosted VoIP PBX Using Client-Side Integration Proxy,\" facilitates integration between a business VoIP system and third-party software applications. The VoIP system provides an application programming interface (API) that allows the software to automatically annotate call history data with the caller's full contact information and call notes.\nEnhanced Call Experience Patents\nU.S. Pat. No. 9,106,673 , \"Systems and Methods for Connecting Telephony Communications,\" provides an algorithm for determining when two parties to a recently terminated telephone call are trying to call each other back at the same time, and automatically connects the call, bypassing a busy signal.\nU.S. Pat. No. 9,100,475 , \"Routing Communications Based on History of Previous Communications,\" is directed to the situation where a phone number has been reassigned but still receives calls intended for the individual or company that previously held the number. This patented technology analyzes characteristics of the incoming call, such as caller ID, to assess whether the call is intended for the prior owner of the number and then reroutes the call or plays a message to help the caller determine if they have, in fact, reached their intended party.\nU.S. Pat. No. 9,148,508 , \"Systems and Methods of Intercepting Telephony Communications to Provide Information to Communicants,\" provides a system for determining when it would be desirable to play a message before the start of a telephone call. For example, if calling rates have recently changed, the calling party may wish to know this before they make a call.\nMobile Solutions\nU.S. Pat. No. 9,116,808 , \"Method and System for Determining Device Configuration Settings,\" improves efficiency for developers testing their apps on a variety of mobile devices by crowdsourcing the correct configurations, such as screen resolution, for each device model.\nU.S. Pat. No. 9,124,693 , \"Method and System for On-Hold Messaging for Off Network Calls,\" enables a user of a mobile VoIP application who receives a call over their cellular network to automatically put the VoIP call on hold when the cellular call is answered.\nU.S. Pat. No. 9,137,267 , \"Secure Transmission of Media During a Communication Session,\" provides a method for securely transmitting data by embedding it in a voice communication session between two devices.\nAbout Vonage\nVonage (NYSE: VG) is a leading provider of cloud communications services for consumers and businesses. The Company provides a robust suite of feature-rich residential and business communication solutions that offer flexibility, portability and ease-of-use across multiple devices designed to meet the needs of a wide range of customers.\nVonage's portfolio of business products covers the full spectrum of business communications needs, serving single-person companies to those with thousands of employees spread over multiple locations. Vonage provides bring-your-own-broadband (BYOB) cloud products and those that offer carrier-grade reliability and Quality of Service (QoS) across BYOB options and the Company's private, national MPLS IP network. For more information, visit www.vonage.com .\nVonage Holdings Corp. is headquartered in Holmdel, New Jersey . Vonage ® is a registered trademark of Vonage Marketing LLC, owned by Vonage America Inc.\nTo follow Vonage on Twitter, please visit www.twitter.com/vonage . To become a fan on Facebook, go to www.facebook.com/vonage . To subscribe on YouTube, visit www.youtube.com/vonage .\n(vg-f)\n releases/vonage-granted-seven-new-patents-300153931.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=1&f=G&l=50&co1=AND&d=PTXT&s1=9,112,747.PN.&OS=PN/9,112,747&RS=PN/9,112,747", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=1&f=G&l=50&co1=AND&d=PTXT&s1=9,124,693.PN.&OS=PN/9,124,693&RS=PN/9,124,693", "http://www.prnewswire.com/news-releases/vonage-granted-seven-new-patents-300153931.html", "http://www.facebook.com/vonage", "http://www.youtube.com/vonage", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=1&f=G&l=50&co1=AND&d=PTXT&s1=9,100,475.PN.&OS=PN/9,100,475&RS=PN/9,100,475", "http://www.twitter.com/vonage", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=1&f=G&l=50&co1=AND&d=PTXT&s1=9116808.PN.&OS=PN/9116808&RS=PN/9116808", "http://www.vonage.com/", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=1&f=G&l=50&co1=AND&d=PTXT&s1=9,148,508.PN.&OS=PN/9,148,508&RS=PN/9,148,508", "http://vonage.com/corporate/kurt-rogers.php", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY18978&Transmission_Id=201510050830PR_NEWS_USPR_____NY18978&DateId=20151005", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=1&f=G&l=50&co1=AND&d=PTXT&s1=9,106,673.PN.&OS=PN/9,106,673&RS=PN/9,106,673", "http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=1&f=G&l=50&co1=AND&d=PTXT&s1=9,137,267.PN.&OS=PN/9,137,267&RS=PN/9,137,267"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T16:49:47.513+03:00", "highlightTitle": ""}