{"organizations": [], "uuid": "78adb3df4f6845bb11a6234a2466da0ab3c513a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/3921509/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13847758.SNP_MP_urges_Government_to_boost_armed_forces_veterans__mental_health_care/", "country": "GB", "title": "SNP MP urges Government to boost armed forces veterans' mental health care", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 1, "title_full": "SNP MP urges Government to boost armed forces veterans' mental health care (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T05:38:00.000+03:00", "replies_count": 0, "uuid": "78adb3df4f6845bb11a6234a2466da0ab3c513a7"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/politics/13847758.SNP_MP_urges_Government_to_boost_armed_forces_veterans__mental_health_care/", "ord_in_thread": 0, "title": "SNP MP urges Government to boost armed forces veterans' mental health care", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MPs have called on the Government to do more to improve mental health care for armed forces veterans, describing the current state of affairs as a \"great stain\" on the UK.\nThe issue was raised in the House of Commons by Dr Lisa Cameron, SNP MP for East Kilbride, Strathaven and Lesmahagow, who said care for veterans needs to be prioritised.\nAnd former soldier Johnny Mercer, the Conservative MP for Plymouth Moor View, echoed a similar view, telling the Government that \"in five years time it will be too late\".\nHe said: \"The subject before us this evening refers to that great stain on this nation of ours... the way we look after our veterans' mental health in this country, putting aside some excellent individual practices and charitable work, I regret to say it remains poor.\n\"Many of our young men and women who by good training and fortune walked away from battle without any physical scars have been stricken in later years by an underlying sickness that can tear at the very core fabric of the strongest and the most enduring individual.\"\nHe said he supported the Government and its plans but \"on this issue whilst it remains in its current state I'm afraid I will not be silenced\".\nPromoted stories He said: \"Let's now win this fight and take our place again as a country at the vanguard of contemporary veterans' care.\n\"In five years time it will be too late. The momentum in the battle will be lost and we will simply be fighting fires.\"\nMs Cameron urged the Government to address the issues of \"help seeking, stigma, referral processes, assessment and availability of appropriate treatments\".\nShe said: \"Veterans are individuals who would have put their lives on the line for their country.\n\"The least we can do is prioritise their care and treatment to support them in their recovery.\"\nShe also raised the issue during Prime Minister's Questions today and David Cameron said there is an opportunity to look at provision as part of the Government's strategic defence and security review.\nSpeaking during the debate in reference to current service provision, the health minister Alistair Burt said \"palpably it's not enough\".\nShare article He said that current provision \"good that it is and better than it was, is not yet meeting the demands and the needs\".\nHe said: \"It is plain from what colleagues are saying that you want us to do more and look for more.\"", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-15T05:38:00.000+03:00", "crawled": "2015-10-15T04:34:28.251+03:00", "highlightTitle": ""}