{"organizations": [], "uuid": "36f4ef0a9aa3b0ff517f2f6899286e2f40255a96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "http://media.washtimes.com.s3.amazonaws.com/media/image/2015/10/25/5c3090a3f635cc2f850f6a7067007691.jpg", "site_section": "http://washingtontimes.com/rss/headlines/news/politics/", "section_title": "www.washingtontimes.com stories: Politics", "url": "http://www.washingtontimes.com/news/2015/oct/25/louisiana-governor-runoff-candidates-focus-on-jind/", "country": "US", "title": "Louisiana governor runoff candidates focus on Jindal, Obama", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Louisiana governor runoff candidates focus on Jindal, Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T09:24:00.000+02:00", "replies_count": 0, "uuid": "36f4ef0a9aa3b0ff517f2f6899286e2f40255a96"}, "author": "MELINDA DESLATTE", "url": "http://www.washingtontimes.com/news/2015/oct/25/louisiana-governor-runoff-candidates-focus-on-jind/", "ord_in_thread": 0, "title": "Louisiana governor runoff candidates focus on Jindal, Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Louisiana governor runoff candidates focus on Jindal, Obama Republican Sen. David Vitter celebrates with wife, Wendy, after reaching a runoff with Democrat John Bel Edwards in the gubernatorial election, Saturday, Oct. 24, 2015, in Kenner, La. (Scott Threlkeld/The Advocate via AP) more > By MELINDA DESLATTE - Associated Press - Sunday, October 25, 2015 \nBATON ROUGE, La. (AP) - As the two men vying to be Louisiana’s next governor move into the campaign ahead of a Nov. 21 runoff, they’re asking the state’s voters to decide who’s more unpopular in the state: term-limited Republican Gov. Bobby Jindal or Democratic President Barack Obama. \nRepublican U.S. Sen. David Vitter and Democratic state Rep. John Bel Edwards highlighted their strategies Saturday night as the candidate list was whittled to two in the governor’s race. \nVitter called Edwards a liberal and said supporting the state representative would “be the same as voting to make Barack Obama governor of Louisiana.” Edwards said Vitter represents a “third Jindal term” in office. \nObama remains highly unpopular in the conservative state, but so does Jindal. The two-term governor’s policies are criticized as causing continued financial problems at home, and his absenteeism while he runs for the GOP presidential nomination has drawn ire. \nVitter and Edwards were the top two vote-getters in Saturday’s open primary, which pit all candidates regardless of party in a competition against each other. \nEdwards always seemed assured of a runoff spot because of his standing as the only major Democratic candidate. Vitter bested two other major Republicans to secure his position on the November ballot, eclipsing Public Service Commissioner Scott Angelle and Lt. Gov. Jay Dardenne, rivals who called Vitter’s eight-year-old prostitution scandal a stain on Louisiana. \nThe senator apologized in 2007 for a “very serious sin” after he was linked through phone records to Washington’s “D.C. Madam.” \nThe race was tighter than Vitter had hoped, with Edwards taking 40 percent of the primary vote and Vitter advancing with 23 percent, according to unofficial returns. \nMonths ago, Vitter was atop the polls, flush with millions in campaign cash and running like an incumbent. But amid continued talk of the prostitution scandal and a drumbeat of criticism about his attack-heavy campaign tactics, Vitter’s negatives spiked among voters. One PAC has been running an “Anybody But Vitter” campaign. \nVitter, however, maintained a strong conservative base that propelled him into the runoff. \nThe two runoff contenders immediately took swipes at each other, suggesting the themes voters can expect next. \nVitter is making the competition a partisan one, which has worked well for other Republican candidates in recent years as Louisiana became an increasingly red state. \n“We have a stark difference in this runoff,” Vitter said as he described Edwards’ votes for Obama. He added: “John Bel Edwards is not a casual supporter of Barack Obama. He is a true believer.” \nWhile he tied Vitter to Jindal, Edwards also described the U.S. senator as “Nixonian.” \n“Over the next few weeks David Vitter is going to spend millions of dollars lying about my record, lying about my values, lying about my service to our country and to our state,” Edwards said.", "external_links": [], "published": "2015-10-25T09:24:00.000+02:00", "crawled": "2015-10-25T10:47:05.625+02:00", "highlightTitle": ""}