{"organizations": [], "uuid": "e1a16a8d2e1f54bf7a0c9ab64507716a3524fcd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.providencejournal.com", "main_image": "http://www.providencejournal.com/storyimage/PJ/20151018/NEWS/151019362/AR/0/AR-151019362.jpg", "site_section": "http://www.providencejournal.com/politics?template=rss&mime=xml", "section_title": "Politics - providencejournal.com", "url": "http://www.providencejournal.com/article/20151018/NEWS/151019362/13809?rssfeed=true", "country": "US", "title": "Old debts haunt a fresh start for Central Coventry Fire District", "performance_score": 0, "site": "providencejournal.com", "participants_count": 1, "title_full": "Old debts haunt a fresh start for Central Coventry Fire District", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T18:53:00.000+03:00", "replies_count": 0, "uuid": "e1a16a8d2e1f54bf7a0c9ab64507716a3524fcd0"}, "author": "John Hill  Journal Staff Writer", "url": "http://www.providencejournal.com/article/20151018/NEWS/151019362/13809?rssfeed=true", "ord_in_thread": 0, "title": "Old debts haunt a fresh start for Central Coventry Fire District", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Old debts haunt a fresh start for Central Coventry Fire District End of state receivership exposes district to $4.5 million in claims Comment Posted Oct. 18, 2015 at 10:53 AM By John Hill Posted Oct. 18, 2015 at 10:53 AM » RELATED CONTENT • Fire fiefdoms: The downside of direct democracy COVENTRY — It took three years of lawsuits and receivership to finally return financial control of the Central Coventry Fire District to its governing board, and now another legal storm is brewing over the district's old debts. It's possible that storm will subside Monday night, depending on the size of the budget voters approve at the fire district's annual meeting, set for 7 p.m. at Coventry High School. When the state Department of Revenue announced last month it was ending its takeover of the district's finances, the district board got its authority back. But it also got about $4.5 million in claims tossed into its fiscal lap. The state bankruptcy filing had shielded the district from those debts and would have required creditors to take less than they were owed. But with the end of the receivership, and its bankruptcy protection, the district’s firefighters union has raised this specter: creditors could go to court and seek tax increases to get what they are owed. The union has cited an 1878 state Supreme Court ruling that, under some circumstances, a court can order a tax increase. The case revolved around two real-estate agents, Edward and Henry Cole, who won a $1,150 judgment, plus $93 in court costs, against the East Greenwich fire company in 1875. The company refused to pay. The Coles sued, and in 1878 the state Supreme Court found in their favor. What makes the case significant to the Central Coventry district in 2015 is that in finding for the Coles, the court said, \"We think the power to tax, though permissive in form, creates, under the circumstances, a duty which can be enforced.\" Elizabeth Wiens, the union’s lawyer, said that while the Coles decision is 137 years old, \"it’s still good law.\" The district’s lawyer, David D’Agostino, says talk of a massive tax increase to cover old debts is premature. Those debts would have to be certified by a court before an increase could be sought, he said, and it was possible the board could negotiate settlements with creditors. He also said there was a philosophical argument to be made as well: \"Do the taxpayers, must the taxpayers, fund something they don’t want to fund?\" --jhill@providencejournal.com", "external_links": [], "published": "2015-10-18T18:53:00.000+03:00", "crawled": "2015-10-19T04:04:27.241+03:00", "highlightTitle": ""}