{"organizations": [], "uuid": "c1127fd1cc6c9465d10231f332af0446d5499a84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30191727/bay-area-lgbt-refugees-forced-to-flee-their-homelands-honored-with-first-ever-horizons-foundation-courage-award", "country": "US", "title": "Bay Area LGBT Refugees Forced to Flee Their Homelands Honored With First-Ever Horizons Foundation Courage Award", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bay Area LGBT Refugees Forced to Flee Their Homelands Honored With First-Ever Horizons Foundation Courage Award - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "c1127fd1cc6c9465d10231f332af0446d5499a84"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30191727/bay-area-lgbt-refugees-forced-to-flee-their-homelands-honored-with-first-ever-horizons-foundation-courage-award", "ord_in_thread": 0, "title": "Bay Area LGBT Refugees Forced to Flee Their Homelands Honored With First-Ever Horizons Foundation Courage Award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Horizons Foundation\n35th Anniversary Gala celebrated the work of Evan Wolfson, founder and president of Freedom to Marry, for his lifelong leadership helping achieve Marriage Equality\nSAN FRANCISCO , Oct. 5, 2015 /PRNewswire/ -- Several LGBT refugees now living in the Bay Area after fleeing their homelands in fear of persecution were honored for their courage and leadership during Horizons Foundation 35 th anniversary Gala on Saturday, October 3 rd .\nPhoto - http://photos.prnewswire.com/prnh/20151005/274203\nPhoto - http://photos.prnewswire.com/prnh/20151005/274204\nHorizons presented its first-ever Courage Awards to11 people, including Subhi Nahas and Getrude Metsiegoum and Carine (last name withheld for fear of retaliation), who escaped Syria and Cameroon , respectively, and shared their stories of persecution and escape.\nEvan Wolfson , founder of Freedom to Marry, widely considered the \"godfather of gay marriage\" was presented the 2015 Leadership Award for his lifelong work to achieve marriage equality.\n\"Horizons is proud to honor both Evan Wolfson for his history-changing work on marriage equality, as well as this courageous group of LGBT refugees, who weren't afforded even the most basic human rights and protections in their home countries,\" said Roger Doughty , executive director of Horizons. \"Together, these awards show clearly both how much the LGBT community has achieved and how very far there is to go before all LGBT people enjoy safety, equality, and dignity.\"\nHorizons Foundation has become a leading funder of international LGBT rights, launching the Global Faith and Equality Fund, an $8 million donor-advised initiative in 2013. Horizons also provides grants to local organizations that provide assistance to LGBT refugees/asylum seekers who are already in the San Francisco area. These grants help provide critical services such as housing, food, medicine, medical and mental health services and legal aid.\nTheir Personal Stories: Escaping Syria and Cameroon\nA Syrian gay refugee, Subhi Nahas escaped his homeland after being terrorized for being gay by the country's military, insurgent militias and his own family. Nahas was caught up in a routine sweep at a checkpoint while on his way to school; soldiers took him to a secluded area where they physically assaulted the detainees. He was afraid for his life. He knew the soldiers might rape and kill him. Miraculously, they let him go, but his fear didn't end there: One night, his father violently attacked him, sending him to the hospital with permanent scars. Nahas escaped to Lebanon and Turkey , where he stayed at LGBT safe houses with hundreds of other LGBT refugees from the Middle East before finally coming to the United States. Today, Nahas works with the Organization for Refugee, Asylum and Migration (ORAM) to improve other refugees' access to protection systems around the world.\nGertrude, Carine and their daughter , sought refuge in the Bay Area after they were forced to flee Cameroon where LGBT people face discrimination, intimidation, harassment and other forms of attacks. In fact, more people are arrested for being gay in Cameroon than in any other country in the world. Gertrude agreed to be included in the 2013 film Born This Way, a documentary that followed four gay Cameroonians. Despite assurances that the film would never be screened in Cameroon , while Gertrude was in the United States touring with the film, bootleg copies made it into Cameroon and life took a dramatic turn. Carine and their daughter were forced into hiding when they began to receive death threats. Then their friend, and fellow LGBT activist, Eric Lembembe, was brutally murdered, and it was clear that Cameroon was no longer safe for them. With help from refugee advocates and local supporters, Gertrude, Carine and their daughter were finally reunited and now live in the Bay Area.\nHonoring the \"Godfather of Gay Marriage\"\nEvan Wolfson , founder and president of Freedom to Marry, widely considered to be the \"godfather of gay marriage\" received the 2015 Horizons Leadership Award. Evan is a long-time LGBT civil rights leader, who in 2003 launched Freedom to Marry, the campaign to win marriage nationwide.\nWolfson spent more than a decade working at Lambda Legal Defense & Education Fund, where he created the National Freedom to Marry Coalition and began leading the ongoing national marriage equality movement for equal marriage protections. He was co-counsel in Hawaii's landmark Baehr case, which launched the current global marriage equality movement. Wolfson also contributed his expertise to the team in Baker v. Vermont , the Vermont Supreme Court ruling that led to the creation of \"civil union,\" a new legal marital status for same-sex couples, and to the Gay & Lesbian Advocates & Defenders team in Goodridge v. Department of Public Health , which on May 17, 2004 led to the freedom to marry in Massachusetts .\nWolfson has also played a part in work to win the freedom to marry in other nations, including Canada , Argentina , the United Kingdom , New Zealand and Australia. Wolfson published Why Marriage Matters: America, Equality, and Gay People's Right to Marry by Simon & Schuster in July 2004. In 2012, Wolfson was awarded the Barnard Medal of Distinction alongside President Barack Obama . He has been called \"the godfather of gay marriage\" by Newsweek, The Daily Beast, and, \"the indispensable man in bringing marriage equality to America\" by Andrew Sullivan .\n\"It's a great privilege for Horizons to recognize the extraordinary accomplishments of each of the 2015 honorees, especially at this major anniversary celebration,\" said Doughty. \"Their presence and their words made a most inspiring evening for all.\"\nHorizons Foundation presented these awards during its 35 th Anniversary gala on Saturday, October 3 rd at San Francisco's Fairmont Hotel. The event brought together more than 700 supporters to celebrate more than $32 million in grants Horizons has made since being established in 1980 to help meet the needs, secure the rights and celebrate the lives of LGBT people.\nFor additional information about Horizons and its work visit www.horizonsfoundation.org or follow the organization on Facebook @ Horizons Foundation or Twitter @Horizonsfdn.\nContact:\nKevin Herglotz\nHPA Strategic Communications\n415-963-2601\nEmail\n releases/bay-area-lgbt-refugees-forced-to-flee-their-homelands-honored-with-first-ever-horizons-foundation-courage-award-300154520.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/bay-area-lgbt-refugees-forced-to-flee-their-homelands-honored-with-first-ever-horizons-foundation-courage-award-300154520.html", "http://www.horizonsfoundation.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH20616&Transmission_Id=201510051845PR_NEWS_USPR_____PH20616&DateId=20151005", "http://photos.prnewswire.com/prnh/20151005/274203", "http://pressreleaseheadlines.com/contact?pid=291757", "http://photos.prnewswire.com/prnh/20151005/274204"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T03:56:50.104+03:00", "highlightTitle": ""}