{"organizations": [], "uuid": "5ae8bbda564ce8e7584437786e302c100c8d9a74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/4b/7bd2fc4211f0f4bcb1dc2ff09cd463/media:1b54dd81a3c541ddb715051ac9f84ae1AustriaMigrants.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/23/the-latest-thousands-spend-night-at-serbia-croatia-border", "country": "US", "title": "The Latest: Refugee agency raises child exploitation concern", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "The Latest: Refugee agency raises child exploitation concern - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ae8bbda564ce8e7584437786e302c100c8d9a74"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/23/the-latest-thousands-spend-night-at-serbia-croatia-border", "ord_in_thread": 0, "title": "The Latest: Refugee agency raises child exploitation concern", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERKASOVO, Serbia (AP) — The latest news as asylum-seekers make their way across Europe by the tens of thousands, fleeing war or seeking a better life. All times local:\n12:30 p.m.\nThe U.N. refugee agency reports a growing number of cases in which children in southeastern Europe have been forced into sex to pay for the continuation of their journeys as they flee war and poverty.\nUNHCR spokeswoman Melissa Fleming says the agency is still assessing how many children might be affected but is going public with concerns to pressure governments along the route to do more to help children.\nSpeaking to reporters Friday, Fleming said extortion of children appears to be happening \"in every single country\" along the route. UNHCR estimates at least 644,000 people have arrived in Europe across the Mediterranean this year — about one-third of them women and children.\nFleming said it appears that smugglers, criminal gangs and other refugees could potentially be behind the abuse. The agency says unaccompanied children are particularly vulnerable.\n___\n12:15 p.m.\nMany migrants are avoiding an Austrian border collection point set up for new arrivals from Slovenia, and police say some are endangering themselves and others by walking on railway tracks leading away from the border.\nPolice say that hundreds of people made a detour Friday around the collection center at the Spielfeld crossing. They marched over tracks leading from Slovenia into Austria instead of the regular entry point and then continued walking on foot.\nReporters estimated the number at more than 1,000 but say some then were persuaded to join others at the center waiting for processing and transport to shelters.\nOfficials say about 6,000 people crossed into Austria at Spielfeld on Thursday. With shelters full, blankets were provided to hundreds sleeping in the open with temperatures near the freezing point.\n___\n12 p.m.\nParis authorities have evacuated a former high school that hundreds of Syrian, Afghan and other migrants had called home for months.\nFrance has been criticized for not finding enough housing for asylum-seekers, even as other European countries have taken in hundreds of thousands of new arrivals this year.\nAmid health and safety concerns, authorities moved in Friday to evacuate the Jean-Quarre school in northern Paris. Its unused classrooms, hallways and schoolyard became an informal refuge over the summer.\nThe migrants boarded buses and were being taken to shelters and residences in the Paris region, according to city hall. The operation unfolded calmly. Some wrapped themselves in blankets as they waited for buses.\nThousands of migrants are still living in a filthy camp in the English Channel port city of Calais.\n___\n11:45 a.m.\nGermany's interior minister says measures meant to streamline the country's handling of the migrant influx and make it easier to deport rejected asylum applicants will take effect this weekend, more than a week earlier than planned.\nThe package approved by lawmakers last week aims to cut red tape, speed deportations and curb cash benefits. Albania, Kosovo and Montenegro — from which large numbers of people have arrived this year — join other Balkan countries in being declared safe states, meaning their citizens can be sent back faster.\nInterior Minister Thomas de Maiziere said Friday the number of deportations will rise, but didn't specify when and by how much. He said there have been 11,000 deportations so far this year and four or five times as many people left voluntarily.\n___\n11 a.m.\nGerman automaker Daimler AG says it's giving the German Red Cross more than 600,000 euros ($667,000) it collected through a company employee donation program to help the agency deal with the flood of asylum-seekers into the country.\nDaimler said Friday it collected 300,666 euros from employees in the monthlong internal fundraising drive and that the company was matching the donations euro-for-euro, doubling the sum.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T13:50:30.450+03:00", "highlightTitle": ""}