{"organizations": [], "uuid": "7cff7c7194df1ed9597873c48f5df9b1391d61fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30351167/new-survey-finds-strong-support-among-law-enforcement-leaders-for-gun-violence-prevention-strategies-to-protect-communities-keep-guns-out-of-the", "country": "US", "title": "New survey finds strong support among law enforcement leaders for gun violence prevention strategies to protect communities, keep guns out of the hands of those posing risks to themselves and others", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New survey finds strong support among law enforcement leaders for gun violence prevention strategies to protect communities, keep guns out of the hands of those posing risks to themselves and others - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "7cff7c7194df1ed9597873c48f5df9b1391d61fd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30351167/new-survey-finds-strong-support-among-law-enforcement-leaders-for-gun-violence-prevention-strategies-to-protect-communities-keep-guns-out-of-the", "ord_in_thread": 0, "title": "New survey finds strong support among law enforcement leaders for gun violence prevention strategies to protect communities, keep guns out of the hands of those posing risks to themselves and others", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Police Executive Research Forum\nUniversal background checks, gun violence restraining orders among measures backed by nation's law enforcement executives\nWASHINGTON , Oct. 26, 2015 /PRNewswire-USNewswire/ -- U.S. law enforcement leaders strongly support measures to protect communities by keeping guns out of the hands of those who pose a risk to themselves and others, such as universal background checks and gun violence restraining orders to remove firearms temporarily from those in crisis due to mental illness or domestic violence.\nThese are among findings of a new report from the Police Executive Research Forum (PERF), a research and membership organization of executives from state and local law enforcement agencies.\nThe full report can be found at http://www.policeforum.org/assets/gunpolicyreport2015.pdf .\nThe findings are based on two research components: a survey of member police executives from more than 250 agencies, and regional summits in Minneapolis , Portland ( Oregon ), Las Vegas , and Milwaukee . The summits were attended by approximately 200 police chiefs, sheriffs, prosecutors, mayors, researchers, and public health officials offering strategies for reducing gun crimes.\n\"One theme comes through loud and clear in our report: We must find a way to 'de-politicize' gun crime issues and talk about gun crime as a public health matter,\" said Chuck Wexler , executive director of PERF. \"There are common-sense measures that can be taken to make it more difficult for felons and dangerously mentally ill persons to acquire firearms. Local police chiefs and mayors, working with federal ATF officials, also are developing innovative programs under existing laws, such as Crime Gun Intelligence Centers, which help police process ballistic and crime gun trace evidence quickly in order to identify suspects and build cases against violent offenders.\"\nThe PERF project, supported by the Joyce Foundation, found that most of the participating law enforcement executives are strongly united on major gun violence prevention policy issues:\nUniversal background checks: There is overwhelming support for universal background checks to curb the easy availability of firearms through unregulated private sales such as at gun shows and person-to-person transactions. \"There is a slow-motion mass murder of our young people, and it's done with high-quality, high-capacity firearms, often purchased privately without any background checks,\" said Milwaukee Police Chief Edward Flynn at the PERF summit in his city. In a survey conducted by PERF in early 2013, 95 percent of responding law enforcement officials said they support such laws. \"This is not an attack on the Second Amendment; this is about preventing guns from getting into the hands of repeat offenders,\" said Chicago Police Superintendent Garry McCarthy . Gun violence restraining orders: Of the 266 law enforcement leaders who responded to the PERF survey in early 2015, 81 percent said they would support laws creating a civil restraining order process. This would allow family members to petition courts to request that firearms be temporarily removed from a family member or intimate partner who poses a credible risk of harm to himself or herself or to others. Restraining orders for domestic violence: 94 percent of responding police executives support a temporary ban on firearms ownership for a person under a restraining order for domestic violence. Dangerous mental illness: 96 percent support temporary bans on firearm purchases or possession by persons who have had a short-term involuntary hospitalization with a clinical finding of being a danger to self or others. Sherwood, Oregon Police Chief Jeff Groth said homicides and suicides often result from situations involving domestic violence and/or mental illness: \"Because of the circumstances people find themselves in, they lose their temper, there is a gun present, and suddenly we have a shooting.\" About PERF\nThe Police Executive Research Forum is an independent research organization that focuses on critical issues in policing. Since its founding in 1976, PERF has identified best practices on fundamental issues such as reducing police use of force, developing community policing, evaluating crime reduction strategies, and other issues. To learn more, please visit www.policeforum.org .\nContact: Craig Fischer , Director of Communications\nPolice Executive Research Forum, 202-454-8332\ncfischer@policeforum.org\nPhoto - http://photos.prnewswire.com/prnh/20151026/280456-INFO\n releases/new-survey-finds-strong-support-among-law-enforcement-leaders-for-gun-violence-prevention-strategies-to-protect-communities-keep-guns-out-of-the-hands-of-those-posing-risks-to-themselves-and-others-300166087.html\n ", "external_links": ["http://www.policeforum.org/assets/gunpolicyreport2015.pdf.", "http://www.prnewswire.com/news-releases/new-survey-finds-strong-support-among-law-enforcement-leaders-for-gun-violence-prevention-strategies-to-protect-communities-keep-guns-out-of-the-hands-of-those-posing-risks-to-themselves-and-others-300166087.html", "http://www.xmlnews.org/ns/", "https://photos.prnewswire.com/prnvar/20151026/280456-INFO", "http://www.policeforum.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC38269&Transmission_Id=201510261326PR_NEWS_USPR_____DC38269&DateId=20151026", "http://www.policeforum.org/assets/gunpolicyreport2015.pdf", "http://photos.prnewswire.com/prnh/20151026/280456-INFO"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T20:53:06.978+02:00", "highlightTitle": ""}