{"organizations": [], "uuid": "252659f38c7f0360c601ccb48e752db861180e5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/000/000/295_200x200_796006606.svg_200x200.png", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/Tunisia-Suspicious-Deaths-in-Custody-1", "country": "IE", "title": "Tunisia: Suspicious Deaths in Custody", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "Tunisia: Suspicious Deaths in Custody - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T07:00:00.000+02:00", "replies_count": 0, "uuid": "252659f38c7f0360c601ccb48e752db861180e5f"}, "author": "Content Admin", "url": "https://www.oximity.com/article/Tunisia-Suspicious-Deaths-in-Custody-1", "ord_in_thread": 0, "title": "Tunisia: Suspicious Deaths in Custody", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two men have died in custody recently in Tunis under suspicious circumstances in separate incidents. Relatives of both men provided photographs showing marks and bruises on their faces and bodies, and said that authorities had failed to inform them promptly about the deaths.\nSofien Dridi’s family found him dead in the Charles Nicole Hospital morgue on September 18, 2015, seven days after the police arrested him at passport control at the Tunis-Carthage airport. Neither prison nor police authorities had informed the family of his death. The National Guard anti-drugs brigade arrested the second man, Qaïs Berrhouma, on October 5. Two witnesses told Human Rights Watch that the officers violently beat him in the street. The following day, his family learned through a relative that his body was at the Charles Nicole Hospital.\n“The credibility of Tunisia’s judicial system will take a big hit if it can’t explain how and why these two detainees died,” said Amna Guellali , Tunisia researcher. “The authorities’ failure to promptly notify the next of kin heightens the suspicion of foul play.”\nThe Tunisian authorities should carry out a thorough and impartial investigation of these deaths, Human Rights Watch said.\nThe United Nations Special Rapporteur on Torture, during his follow-up mission to Tunisia in May 2014, noted, “Although there was progress in fighting torture, and victims now are less afraid to file complaints, there is unfortunately very little action by prosecutors and by judges” in pursuing the complaints for torture both from the Ben Ali era and for the post-uprising cases.\nThere have been several suspicious deaths in custody since 2013. Human Rights Watch has documented three others: Mohamed Ali Snoussi on October 3, 2014, Walid Denguir on November 1, 2013, and Abdelmajid Ejday , on May 13, 2015.\nThe UN Principles on the Effective Prevention and Investigation of Extra-Legal, Arbitrary, and Summary Executions call for the “thorough, prompt and impartial investigation” of all suspicious deaths in custody to “determine the cause, manner and time of death, the person responsible, and any pattern or practice which may have brought about that death.” The principles state that “families of the deceased and their legal representatives shall be informed of, and have access to, any hearing as well as to all information relevant to the investigation, and shall be entitled to present other evidence.”\nSofien Dridi Switzerland deported Sofien Dridi to his native Tunisia on September 11. Police arrested him at the Tunis-Carthage airport and took him to the Borj Louzir neighborhood station. The family said that he had an arrest warrant against him relating to a fight, dating to 2011. He spent four days in pre-charge detention in Bouchoucha Jail in Tunis and was interrogated first at Borj Louzir and then at the Soukra police station, according to his lawyer.\nA September 15 report of the assistant general prosecutor, which Human Rights Watch has reviewed, states that he interrogated Sofien and examined his physical condition and observed no signs of torture or mistreatment. The investigative judge of the Tunis First Instance Court issued a detention order that day, and Sofien was transferred to the Mornaguia Prison, with a court session scheduled for September 18.\nMaroua Dridi, Sofien’s sister, said that at 4 a.m. that morning, two plain-clothes officers came to the family’s house in Tunis and asked Sofien’s brother to accompany them. They told him that Sofien was very sick and that his brother should go to the Charles Nicole Hospital to visit him. She said that family members went to the hospital and from there to the courthouse and back to the hospital, but that no one could give them any information about where he was or his condition. Finally, at about 1 p.m., a cousin who had gone to the hospital told his mother that staff in the hospital reception area said that he had died and his body was in the morgue.\nSofien’s mother, Rebh Merdassi, told Human Rights Watch that she went to the hospital morgue at 1:15 p.m.:\nWhen I took the cover off his body the smell was unbearable. It was not the smell of someone who had died just that day. I was shocked when I saw big blue bruises on the level of his right and left kidney. I saw another blue spot at the level of his heart and a big red-blue-like bruise under his right eye and at the level of his neck. There was coagulated blood near his ears.\nHuman Rights Watch reviewed four photographs of Sofien’s body, which the family took in the morgue on September 18, before any autopsy. They show a big dark-blue spot on the left part of his forehead, and a big dark-blue circular spot under his right eye.\nThe family told Human Rights Watch that they received the body on September 19. The death certificate stated that the death occurred at 2:10 p.m. on September 17.\nRidha Zaghdoudi, spokesperson for Mornaguia Prison, said in a television interview that Sofien suffered from diabetes, which caused a fatal heart attack.\nThe family’s lawyer, Mohamed Dbara, told Human Rights Watch that an investigative judge at the Tunis First Instance Court has opened an investigation into the death.\nQais Berrhouma Men whom witnesses thought were plain-clothes officers arrested Qaïs Berrhouma, 36, at about 4 p.m. on October 5, in the Ouardia neighborhood, where Berrhouma lives. The following day, Berrhouma’s family heard from a relative that his body was in the Charles Nicole Hospital. Two people told Human Rights Watch that they witnessed plain-clothes men severely beating Berrhouma.\nHaithem Bel Haj Younes, 25, a waiter in the café 10 meters from where the incident occurred, told Human Rights Watch that several plain-clothes security officers whom he knew to be from the National Guard anti-drug brigade in Ouardia rushed toward Berrhouma when they saw him walking toward the tramway stop. They surrounded him; one of them immobilized his arms, and another one kicked him on his legs and shoved him to the ground, Younes said.\nThe men beat Berrhouma and handcuffed him behind his back as Berrhouma screamed, Younes said. He said he then saw one of the men lift Berrhouma, who was very thin, and violently drop him, his head hitting the ground. Younes said that after that, Berrhouma was quiet. When the men lifted him, Younes said that Berrhouma’s head was hanging, his neck limp. The police put him in a white Ford Focus, two of them went to another car with “National Guard” written on the side, and both cars left.\nLotfi Ouartani, an electrician who lives in France and was on vacation in Tunisia, told Human Rights Watch that he had been returning to his family home in Ouardia when he saw a group of men beating another who was on the ground, near the tram station. Initially, he thought it was a fight until he saw that several were carrying guns and he inferred they were security officers. He saw them twisting the man’s arms and putting him in handcuffs while still kicking him. When they lifted him, his head was hanging and his mouth was bleeding.\nThe family’s lawyer, Sonia Jelassi, told Human Rights Watch that the prosecutor of the First Instance Tribunal in Tunis decided to open a preliminary inquiry into the suspicious death of Berrhouma, against the National Guard anti-drug brigade in Ouardia. He charged the judicial police of Gorjani to investigate the case. Both Younes and Ouartani told Human Rights Watch that they were called to testify at Gorjani, in Tunis, on October 9. Authorities have issued no statement about Berrhouma’s death, to Human Rights Watch’s knowledge.\nAmel Berrhouma, Qaïs Berrhouma’s sister, told Human Rights Watch that the family heard of his arrest only from neighbors. At 7 p.m. the day of the arrest, his father went to the National Guard station in Ouardia, but they told him that his son was not there. The following morning, a relative who works at Charles Nicole Hospital called Amel Berrhouma to say he had seen Qaïs Berrhouma’s name on the list of dead.\nFamily members went to the hospital, but officials there did not allow them see the body. They only saw him the next day, October 7, when they were allowed to take his body home from the morgue, following an autopsy. His sister said that they saw bruises on his left shoulder and his neck, and that his left shoulder seemed broken.", "external_links": ["https://www.hrw.org/middle-east/n-africa/tunisia", "https://www.hrw.org/about/people/amna-guellali"], "published": "2015-10-25T07:00:00.000+02:00", "crawled": "2015-10-25T19:58:11.482+02:00", "highlightTitle": ""}