{"organizations": [], "uuid": "0b80914c4e3a861053db1721096d4650456fd66e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westword.com", "main_image": "http://images1.westword.com/imager/u/original/7218198/nicole.r.match.com.800.jpg", "site_section": "http://www.westword.com/news", "section_title": "Denver, Colorado News: Politics, Crime, Sports, Marijuana and Education Journalism | Westword", "url": "http://www.westword.com/news/meet-matchs-11-hottest-athletic-trainers-including-one-in-denver-7218166", "country": "US", "title": "Meet Match's 11 Hottest Athletic Trainers — Including One in Denver", "performance_score": 0, "site": "westword.com", "participants_count": 1, "title_full": "Meet Match's 11 Hottest Athletic Trainers — Including One in Denver | Westword", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T15:13:00.000+03:00", "replies_count": 0, "uuid": "0b80914c4e3a861053db1721096d4650456fd66e"}, "author": "Michael Roberts", "url": "http://www.westword.com/news/meet-matchs-11-hottest-athletic-trainers-including-one-in-denver-7218166", "ord_in_thread": 0, "title": "Meet Match's 11 Hottest Athletic Trainers — Including One in Denver", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Additional photos below. Courtesy of Match.com A couple of months back, the folks behind the Hinge dating app shared their list of the seven most eligible young professionals in Denver .\nNot to be outdone, Match is now featuring the eleven hottest and healthiest athletic trainers in America — and one of them just happens to live in the Mile High City.\nThis roster represents both a charitable endeavor — Match.com will donate $1 to the American Heart Association for every unique profile view of the eleven trainers in question — and a contest. According to a Match.com release, the trainer who collects the most views through October 18 will \"receive the ultimate fitness prize package including a $5,000 cash prize to help further his or her career in fitness, an opportunity to work out with top celebrity trainer, Jeanette Jenkins, and the chance to be a featured expert on AHA’s digital properties.\"\nCheck out the eleven contestants below, including the entrant from Denver, with each name hyperlinked to his or her Match.com profile; photos and details from the pages are also included.\nAmanda. Courtesy of Match.com Amanda\nLos Angeles, CA\nAge: 32\nRelationship: Never married\nHave kids: No\nWants kids: Definitely\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 5'2\" (157 cms)\nFaith: Spiritual but not religious\nSmoke: No Way\nDrink: Social drinker\nIn her own words\nI’m passionate about healthy living and forming meaningful connections with the people around me, so I find people who keep themselves healthy, physically and emotionally, very attractive. I am striving to become a better person every day by practicing self-awareness and enjoying each of life’s little moments – and those are the qualities I’m also looking for in a partner.\nI want to build a loving and affectionate relationship, where there is mutual trust and respect, with a man who is sweet, sensitive, and comfortable communicating his thoughts and feelings. I hope to meet someone who takes the lead in the relationship, and most importantly, someone who can make me belly laugh.\nAs a personal trainer, it’s fulfilling to help my clients transform themselves, in body and mind, so they can do the things they never believed would be possible. And as an actress, I am also able to satisfy the creative and artistic side of myself. With an already rewarding life, I’m ready for a partner to explore the world with — but first, I just need to meet him.\nIf you think we would be a match, I would love to hear from you.\nDarian. Courtesy of Match.com Darian\nSherman Oaks, CA\nAge: 40\nRelationship: Never married\nHave kids: No\nWants kids: Defintely\nEthnicity: Black/African descent\nBody type: Athletic and toned\nHeight: 6'0\" (182 cms)\nFaith: Christian/Other\nSmoke: No Way\nDrink: Social drinker\nIn his own words\nOwning a business that strives daily to make a positive impact on people’s lives brings so much joy and positivity into my life, and yet, I still haven’t found that special woman to raise a family with… so after a long break from online dating, I’m back! I’ve always known that dating in LA would be hard for me because of my busy work schedule and the sheer size of the city, but hopefully, Match can help make it a little bit smaller. At 40, I have more to offer a woman than ever before and I’m ready to settle down and start a family. I believe that finding love with the right woman is a strong foundation on which to build my future, so if you already have a child of your own, I’m ready to welcome you all into my life and heart. All I ask is that you consider having another kid with me — a confident black man with a college degree who’s passionate about his career, his ability to help others transform their lives by getting into shape, and traveling the world. Above all else, I believe that everything in life should be fun.\nThe woman I’m searching for will be beautiful inside and out, intelligent yet humble, open-minded and adventurous. Someone who loves going on weekend getaways with me and enjoys staying active (some favorite activities of mine include snowboarding, bowling, dancing and playing football, since I played for 13 years before becoming a fitness trainer). But seriously, enough about me — tell me all about you! I’ll respond faster if you have a photo posted.\nLynne. Courtesy of Match.com Lynne\nArlington, MD\nAge: 36\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: Middle Eastern, White/Caucasian\nBody type: Athletic and toned\nHeight: 5'2\" (157 cms)\nFaith: Spiritual but not religious\nSmoke: No Way\nDrink: Social drinker\nIn her own words\nPhysical fitness and good nutrition are important to me for three reasons: I do it out of respect for myself, to set a good example for my clients and in order to live the longest and healthiest life I possibly can. I’m smart, ambitious, outgoing and love discovering innovative new ways to help others take better care of themselves through exercise and proper nutrition. Life is already such a blessing, I can only imagine how much more fulfilling and fun it could be when shared with a significant other. In my ideal relationship there would be equal give-and-take between partners, mutual trust and respect, lots of love and of course, laughter. I’m looking for a man who sees all of me and what I have to offer, not just the surface. So, I’m keeping an open mind and a willing heart in hopes that our paths may eventually cross here. If you like what I’ve written here, feel free to say hi — and best of luck to everyone out there searching for their peeps!\nRelated Stories Seven Most Eligible Young Professionals in Denver According to Hinge Mike. Courtesy of Match.com Mike\nHouston, TX\nAge: 29\nRelationship: Never married\nHave kids: No\nWants kids: Definitely\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 5'11\" (180 cms)\nFaith: Christian/Catholic\nSmoke: No Way\nDrink: Social drinker\nIn his own words\nI’m a MovNat-certified trainer who leads and assists with group classes in parkour and natural movement for a company called Urban Movement. If you don’t know what parkour is, close your eyes and imagine any of the chase scenes from a Bond movie: jumping, running, vaulting – basically, it’s the art of navigating obstacles while efficiently traveling through urban terrain using nothing more than your own body. Ever since I was a kid, I’ve been constantly moving and could never slow down. As an adult, I’m blessed to keep moving each day and motivating others to do the same. I’m also very driven and focused on my other job as a high school administrator, which allows me to be active during the day chasing kids and putting out fires all over campus. I invest a lot of time and energy into my students and the teachers I’m helping.\nAre you sick of shouting over the music in loud bars/clubs every weekend? Me too! With so many fun, active ways to spend my time here in Houston, I’m completely over the bar scene and ready to find a girl who understands the need for work/life balance while spending the occasional lazy Sunday on the couch together. I love Southern girls, (though you don’t have to be one!), but can’t stand overly aggressive or competitive types. Oh, and I love being outdoors! If you’re not really an “outdoorsy” type, that’s okay – just know that I’ll probably come home with mud on my boots sometimes after one of my trips to the ranch. I was raised on country, but really, I love almost all types of music. Whether it’s going to a concert or playing and instrument and harmonizing together at home, music really moves me. If you’re the type of girl who loves karaoke nights and gets my sarcastic sense of humor, then we might just be perfect for each other. I work hard, but also believe that life’s pointless without your friends and family. That’s why I’m looking for a serious relationship with a partner who knows that life is about more than just your job; I’d like to meet a woman who keeps herself active because she enjoys it, and is also very family-oriented. I don’t have a particular “type,” so if I seem like someone you’d get along with, message me and say hello. I’m looking forward to sharing all of life’s “firsts” with someone: marriage, kids, and establishing a life of our own together. So if you’ve already been married or had kids, we probably wouldn’t be a good fit. I figure it’s better to be honest and upfront about this issue, since it’s kind of a deal-breaker for me.\nShalana. Courtesy of Match.com Shalana\nAtlanta, GA\nAge: 33\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: Native American, Other, White/Caucasian\nBody type: Athletic and toned\nHeight: 6'2\" (187 cms)\nFaith: Spiritual but not religious\nSmoke: No Way\nDrink: Social drinker\nIn her own words\nI’m a certified spin instructor and cycling addict whose track and field career got sidelined after college by a few surgeries. Despite loving and being good at many different sports, there’s one that I haven’t tried: Can you teach me to play golf? Unfortunately, I haven’t found a good instructor… yet. If you’re an active guy who loves to travel with a laid-back personality, hey, even better. But first, let me introduce myself (feel free to hum along with the Fresh Prince of Bel-Air theme song):\nNow, this is the story all about how\nMy life got flipped, turned upside down\nAnd I’d like to take a minute, just grab a banana,\nI’ll tell you how I came to be chilling in Atlanta.\nIn Texas and Holland I was born and raised,\nBut on an airplane I spent most of my days…\nOkay, moving on (but seriously, who didn’t love that show growing up?). Born and raised in Texas and the Netherlands, I’ve lived in different places and traveled all across the U.S. as well as many other countries. I actually just returned to Atlanta in February after living abroad in Asia for most of 2014. My goal of visiting a different country each year has been met since I turned 27, and I don’t plan on stopping anytime soon.\nWhat kind of man am I looking for? For me, it’s all about versatility and being open to trying new experiences, but someone who’s also cool with relaxing over a glass of wine and a good book at home would be great for balancing me out. I’d like to find a man to walk through an art gallery with me and visit the symphony, but gets just as much joy from people-watching on the MARTA. Are you a basketball and football fan? Me too! We should catch a game sometime and go out for Mexican, Thai or Italian food afterwards. I love all kinds of music but don’t really get into the bar/club scene much, unless it’s specifically to go dancing. Mostly, I am addicted to seeing the world and all the amazing sights and experiences that international travel has to offer. Some of my standout memories include: shark cage diving in Gansbaai (look it up!), skydiving in Key West and trekking the Annapurna Circuit in Nepal. So, hopefully, you have a passport already and enjoy vacationing abroad. Oh, and one more thing: I’m tall. As in, I tried out for America’s Next Top Model but didn’t get accepted because they said I was “too tall.” If you’d like to know more, then you should get at me. You never know where I’ll be jetting off to next, so don’t wait — send me an email and let’s see where this goes.\nTommaso. Courtesy of Match.com Tommaso\nOak Park, IL\nAge: 38\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 5'11\" (180 cms)\nFaith: Christian/Other\nSmoke: No Way\nDrink: Social drinker\nIn his own words\nEuropean transplant who believes that physical fitness is the foundation of a happy life. Running is something I’ve been doing more than half my life (completed my first half-marathon at age 12), so being able to translate that into a career that helps my clients achieve a healthier lifestyle is a real blessing. I’m constantly learning and growing as a person, because nothing in life really bores me. When it comes to love, I don’t believe in settling, because settling is the recipe for a bitter dish and I’ll never be that hungry. Being true to one’s self is one of life’s greatest gifts, so I hope to meet a woman who knows exactly what she wants and doesn’t waste time being too hard on herself (or anyone else) when mistakes happen. My ideal partner would be a woman with a taste for fine wines and a compassionate nature who appreciates my Nutella addiction. I’m looking for someone who loves to dance and grows younger in spirit with each birthday that passes. With a fearless woman by my side, we can conquer the world together – are you her? Are you close? I’m not overly picky and know that we are all individuals, not some grocery list of things that we like or don’t like. So if you have some but not all of these qualities, then we should meet and see if the chemistry sizzles in person! We are only here for a short time, so if the spark isn’t there, no hard feelings. I know that when the right person comes along, we’ll both feel it. I send you all hugs and lots of luck finding the person who won’t settle for anyone else but you.\nNicole K. Courtesy of Match.com Nicole K.\nNew York, NY\nAge: 27\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 5'2\" (157 cms)\nFaith: Christian/Catholic\nSmoke: No Way\nDrink: Social drinker\nIn her own words\nFitness is my life, so I’m looking for a workout partner that gives me butterflies and rock-hard abs from laughing and joking around constantly with each other. And you’ve got plenty of workouts to choose from, guys: CrossFit, running half or full marathons, yoga, cycling, spin classes, HIIT… I’m not exactly picky. As long as you keep a positive mindset, I’m sure we’ll get along fine. If you hate Tom Brady and love New York City as much as I do, want to watch a Jets game with me sometime? (I’m a die-hard fan, though it’s been kind of hard lately.) If you’re not that into the Jets, that’s okay – as long as you’re a sports fan, any game will do. Bonus points if you love to travel and think wine and sushi should be an occasional indulgence instead of an average meal. I absolutely love NYC and everything it has to offer since moving here from Long Island four years ago. Since I’m a fan of trying new things, why don’t we pick out someplace in the city neither of us has been to and go there together? Whether it’s shopping or a new restaurant, a wine bar or just walking through a neighborhood I’ve never seen before, I’m game. Vegging out with my family and friends can be fun, too – I’m as down-to-earth as they get, but nothing thrills me quite as much as making a difference in someone else’s life.\nJon-Erik. Courtesy of Match.com Jon-Erik\nArlington, VA\nAge: 31\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 6'4\" (193 cms)\nFaith: Christian/Catholic\nSmoke: No Way\nDrink: Social drinker\nIn his own words\nStaying healthy isn’t a vanity issue for me – in my rotating weekly shift as a volunteer firefighter, it’s crucial for me to keep physically fit so I can help save other people’s lives. At my office job, I help motivate my coworkers to stay active by inviting them to join me at the gym before work or during lunch; we also participate in weekly competitions for the highest step count by tracking them on our FitBits. As someone with a huge heart who loves to help others, it’s pretty obvious that my schedule revolves around giving back to my community and improving the lives of friends, coworkers, and my family. I’d love to meet a woman who is outgoing, goal-driven and confident, smart, generous and family-oriented. You can imagine how hard it is for me to meet people with my unpredictable schedule, so feel free to make the first move. If you’d drive all night to help out a friend who’s in trouble, please send me a wink – kindness is utterly irresistible to me.\nTraveling is another passion of mine, so please have your passport ready. (Don’t have one yet? That’s okay – we can plan some fun road trips together until you sort it out.) If the weather’s nice, I’d much rather get out and explore the world with you than sit on the couch. A healthy lifestyle fosters a positive outlook on life, so I’d love for you to hit the gym with me and share a few laughs afterwards. Communication is key, so don’t be afraid to speak your mind — I’m looking for a woman who understands the value of trustworthiness and honesty in building a strong relationship together.\nDrew. Courtesy of Match.com Drew\nChicago, IL\nAge: 31\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 6'1\" (185 cms)\nFaith: I'll tell you later\nSmoke: No Way\nDrink: Moderately\nIn his own words\nHealth and fitness are my main priorities in life. As a formerly super skinny guy determined to stop at nothing to build muscle, I’ve learned that improved health and looking/feeling your best go hand in hand. Next is finding someone to marry and have children with, but that’s a goal that I haven’t managed to accomplish just yet.\nI want to find a woman I’m wildly attracted to who would make a wonderful mom and also makes me laugh. Who wants to go through life alone? Not me — but first, I need to meet a woman who already feels happy and fulfilled in her own life and then take it from there. (FYI, flat butts are kind of a deal-breaker for me. Other than that I don’t have a specific type.)\nJoe. Courtesy of Match.com Joe\nPhiladelphia, PA\nAge: 26\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 5'9\" (175 cms)\nFaith: Christian/Catholic\nSmoke: No Way\nDrink: Social drinker\nIn his own words\nAs someone who’s passionate about building up people’s confidence by helping them get fit and embrace a healthier lifestyle, I believe that challenges make life interesting, and overcoming those challenges makes life meaningful. I believe that if you surround yourself with positive people, positive things will happen — and that’s why I’m passionate about helping others build confidence by living a healthier lifestyle. If you’re an outgoing woman who’s passionate about helping others, a favorite hobby or what you do for a living, I’d love to meet you. I’m looking for someone who finds fun ways to stay active and has a genuinely kind and caring heart; if you have that, then I think everything else will fall into place.\nNicole R. Courtesy of Match.com Nicole R.\nDenver, CO\nAge: 25\nRelationship: Never married\nHave kids: No\nWants kids: Someday\nEthnicity: White/Caucasian\nBody type: Athletic and toned\nHeight: 5'9\" (175 cms)\nFaith: Christian/Catholic\nSmoke: No Way\nDrink: Never\nIn her own words\nMy passion for life is equaled by my devotion to preventive medicine through proper nutrition and exercise, so I’d love to find a man with a great sense of humor who’s physically active to go out for sushi with me. (Have a favorite sushi spot in Denver? Let’s meet there for lunch or dinner sometime, since I’m still getting to know my way around the city.) Just don’t order any sake for me, please – I don’t drink alcohol. That said, happy hours are still fun for me as I’m a naturally social person who can have a good time anywhere, so long as the atmosphere is full of friendly faces. I’m originally from Minneapolis, so if you’re from the area and know of any hidden gems where I should eat, shop or hike to get an amazing view of the sunset, please let me know. I also love to travel, so swapping stories about the places we’ve visited over coffee sounds great. Healthy living is a huge priority for me, so I’m looking for a man who feels the same and who will be open to us growing and trying new things together as a couple. I’m a thrill-seeker who loves anything that gets my pulse racing, especially skydiving, waterskiing and zip-lining. Aren’t you ready for life’s next adventure? I know I am. Life isn’t boring, and relationships shouldn’t be, either. C’mon, I’m ready — grab my hand and let’s go!\nContact: Michael Roberts Follow: Michael Roberts Westword Westword", "external_links": ["http://www.match.com/aha/shelana/", "http://www.match.com/cpx/en-us/match/aha/trainers/?trackingid=530804&bannerid=7002204", "http://www.match.com/aha/lynne/", "https://www.facebook.com/pages/Michael-RobertsWestword/111180895657427", "http://www.match.com/registration/registration.aspx", "http://www.match.com/aha/drew/", "http://www.match.com/aha/jon-erik", "http://www.match.com/aha/amanda/", "http://www.match.com/aha/nicoler/", "http://www.match.com/aha/darian/", "http://www.match.com/aha/nicolek/", "https://www.facebook.com/DenverWestword", "http://www.match.com/aha/mike/", "http://www.match.com/aha/joe/", "http://www.match.com/aha/tommaso/", "http://www.twitter.com/denverwestword"], "published": "2015-10-07T15:13:00.000+03:00", "crawled": "2015-10-08T04:35:26.891+03:00", "highlightTitle": ""}