{"organizations": [], "uuid": "32ee8497c17c1a2f20b5784fe7a3f1fffac8c67f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livemint.com", "main_image": "http://www.livemint.com/rf/Image-621x414/LiveMint/Period1/2015/10/20/Photos/telecom-km9F--621x414@LiveMint.jpg", "site_section": "http://www.livemint.com/politics", "section_title": "Breaking Political News, Politics, Headlines &amp;amp; Opinion - Livemint", "url": "http://www.livemint.com/Industry/DCtytdPZR3O2KEA2z6SKdP/Govt-likely-to-order-audit-of-telecom-firms.html", "country": "IN", "title": "Govt likely to order audit of telecom firms", "performance_score": 0, "site": "livemint.com", "participants_count": 1, "title_full": "Govt likely to order audit of telecom firms - Livemint", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:18:00.000+03:00", "replies_count": 0, "uuid": "32ee8497c17c1a2f20b5784fe7a3f1fffac8c67f"}, "author": "Shauvik Ghosh", "url": "http://www.livemint.com/Industry/DCtytdPZR3O2KEA2z6SKdP/Govt-likely-to-order-audit-of-telecom-firms.html", "ord_in_thread": 0, "title": "Govt likely to order audit of telecom firms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi: The government is likely to order financial audits of all 10 private telecom companies that are similar to the ones commissioned in 2009 on a few, even as it continues to spar with them on quality of service issues.\nIt will soon call for applications from auditors, a senior telecom department official who spoke on condition of anonymity said. It could take another two to three weeks to issue a tender, said a second government official, who asked not to be named. The audit will be done for the period after 2008.\nThe 2009 special audit led to the department of telecommunications (DoT) demanding an additional amount of more than Rs. 1,600 crore in fees from five companies for two assessment years starting 2006-07. Companies typically pay a share of their revenue, defined according to a formula prescribed by the government, as fees. The government claimed they had under-reported these revenues. The demand led to several legal challenges that are still being heard by the court.\nLast year, the Supreme Court upheld the government’s powers to examine the accounts of telcos.\nSuch audits add compliance and legal costs for companies and does little for the government, analysts said.\n“Nothing has really come out of the audits that were carried out the last time. I am unable to understand the point of the exercise,” said Hemant Joshi, a partner at Deloitte Haskins and Sells Llp. “It only leads to additional costs to show compliance and unnecessary litigation. The government needs to start closing the curtains on some things at least. This perpetual state of uncertainty in the sector is not good for anyone. The sector needs billions of dollars to deploy new technologies and networks and that money has to come from outside. How can that happen with all this happening?”\nNews of the audits comes at a time when the telcos are already at the receiving end of the government’s crackdown on call drops. The Telecom Regulatory Authority of India issued new rules last week to curb call drops with heftier penalties for quality of service violations. It imposed a fine of up to Rs. 3 per day for call drops. The sum will be credited to the mobile phone user. The government is also looking at carrying out network audits to ensure operators meet quality standards.\nThe financial audits will be along the lines of the ones carried out in 2009-2010, when the telecom department hired Comptroller and Auditor General of India-empanelled (CAG-empanelled) auditors to scrutinize the books of the top five telcos—Bharti Airtel Ltd, Vodafone India Ltd, Idea Cellular Ltd, Reliance Communications Ltd and Tata Teleservices Ltd.\nThe audits opened a can of worms with various issues cropping up, including the definition of adjusted gross revenue (AGR) as well as the jurisdiction of the CAG to audit the private telecom companies. The new audits could lead to another round of legal battles between the government and telecom companies.\nAGR refers to the revenue on which telcos pay the government the necessary revenue share, including licence fee and spectrum usage charges. Items that don’t accrue directly to the telcos’ books, such as service tax and interconnection charges, are not included in AGR.\nThe audits found that the five operators had understated revenue by more than Rs. 10,000 crore for the two-year period, and consequently, notices were issued to them demanding more money. The issue is currently being argued in court.\nThe telcos argue that the revenue that was not accounted for was from non-telecom streams such as investments (dividends, interest, etc), real estate rent and sale, and miscellaneous items arising from branding and events, among others. To this, DoT said that this revenue would not exist without the telecom licence and spectrum, for which the telcos pay revenue share.\nEarlier this year, Trai recommended that revenue from non-core telecom activities be excluded from the definition of AGR.\nThe audits also led to the government instituting a uniform licence fee regime to reduce the space for arbitrage amongst the telecom licences and services .", "external_links": [], "published": "2015-10-20T15:18:00.000+03:00", "crawled": "2015-10-20T05:11:21.308+03:00", "highlightTitle": ""}