{"organizations": [], "uuid": "ca704acc666facbec430e00beddfbe02869977e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/154657/politics", "section_title": "Politics - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30278456/judge-hears-arguments-to-dismiss-benghazi-prosecution", "country": "US", "title": "Judge hears arguments to dismiss Benghazi prosecution", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Judge hears arguments to dismiss Benghazi prosecution - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "ca704acc666facbec430e00beddfbe02869977e6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30278456/judge-hears-arguments-to-dismiss-benghazi-prosecution", "ord_in_thread": 0, "title": "Judge hears arguments to dismiss Benghazi prosecution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ERIC TUCKER\nAssociated Press WASHINGTON (AP) - A federal judge heard arguments Friday on whether to dismiss charges against a suspected Libyan militant accused in the 2012 deadly attacks at the U.S. diplomatic compound in Benghazi, an incident that's become a political flashpoint in the U.S. presidential campaign and which remains under investigation by a special House committee.\nU.S. District Judge Casey Cooper did not immediately rule on the motions, but at times appeared receptive to arguments from a lawyer for Ahmed Abu Khattala that prosecutors had overreached on some of the counts against their client.\nKhattala, captured by U.S. special forces in Libya in a nighttime raid in June 2104, appeared in court for the most significant hearing in the case in months. Wearing a green prison suit, he listened silently to the proceedings through earphones as an interpreter translated the arguments.\nThe September 2012 attacks at the compound in Libya killed Ambassador Chris Stevens and three other Americans, raising questions in Congress and at the State Department about diplomatic security at the post. Hillary Rodham Clinton, who is seeking the Democratic presidential nomination, was secretary of state at the time of the attacks and is expected to appear next week before a House select committee investigating the violence.\nAn 18-count indictment charges Khattala with crimes including murder of an internationally protected person, providing material support to terrorists and destroying U.S. property while causing death.\nDefense lawyers laid out multiple challenges to the indictment. Mary Petras, one of Khatalla's attorneys, urged Cooper to dismiss the two counts accusing her client of providing support to terrorist groups. Though that statute is a favored prosecution tool, particularly in its cases against U.S. followers of the Islamic State, Petras said the charges in this case are vague about exactly who is a terrorist. That makes the charge unconstitutional, she said.\n\"Essentially what the government is saying to the court is, 'Leave it to us. We know when to use the statute',\" Petras said.\nDefense lawyers also urged Cooper to dismiss other counts, such as carrying and firing a firearm during a crime of violence, that were brought under laws they said were intended by Congress to cover domestic crimes, not international ones.\nThe presumption is that statutes do not apply outside the country unless the law explicitly says so, said defense lawyer Jeffrey Robinson.\nThough Cooper did not reveal how he would rule, he posed several questions to prosecutors - including how the government should draw the line on extending its reach into foreign countries - that suggested that the argument resonated with him.\n____\nFollow Eric Tucker on Twitter at http://www.twitter.com/etuckerAP\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": ["http://www.twitter.com/etuckerAP"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T21:03:05.933+03:00", "highlightTitle": ""}