{"organizations": ["NZ Pig Farmers Commitment to Environmental Stewardship NZ Pig Farmers Commitment"], "uuid": "ae225f4b835f3854969a9c6b2b001c620826c929", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00299/nz-pig-farmers-commitment-to-environmental-stewardship.htm", "country": "US", "title": "NZ Pig Farmers Commitment to Environmental Stewardship", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "NZ Pig Farmers Commitment to Environmental Stewardship", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T05:15:00.000+03:00", "replies_count": 0, "uuid": "ae225f4b835f3854969a9c6b2b001c620826c929"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00299/nz-pig-farmers-commitment-to-environmental-stewardship.htm", "ord_in_thread": 0, "title": "NZ Pig Farmers Commitment to Environmental Stewardship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NZ Pig Farmers Commitment to Environmental Stewardship Monday, 19 October 2015, 3:15 pm \nNZ Pig Farmers Commitment to Environmental Stewardship Endorsed \nNew Zealand pig farmers commitment to environmental stewardship has been endorsed by Environment Canterbury (ECan). \nECan Chief Executive Bill Bayfield approved the NZPork Industry’s first Farm Environment Plan template this week following the two organisations collaborative approach and commitment to ensure good environmental outcomes. \nFEPs are required under ECan’s proposed Land & Water Regional Plan. \nNZPork Environmental Advisor, Anita Murrell says the FEP template helps farmers to document their already excellent environmental on-farm practices. \n“We are small industry but extremely proactive when it comes to committing to best environmental practice and this is evidenced by the enthusiasm and success our Canterbury farmers in trialling the farm environment plan template,” she says. \nThe NZPork FEP will assist compliance with district and regional rules and resource consents, as well as managing environmental risk and issues. It aims to support sustainable land management, efficient use of resources, and provide a framework to progress environmental protection and enhancement. Measuring, monitoring and mitigating potential impacts will have economic, social and environmental benefits. \n“Both ECan and industry have been working collaboratively for better water quality for the region. This adoption of the FEP also assures our consumers and the public of the New Zealand pork industry’s commitment to environmental stewardship,” says Mrs Murrell. \nThere are 109 commercial pig farms in New Zealand, 65 per cent of which are based in Canterbury. \nENDS", "external_links": [], "published": "2015-10-19T05:15:00.000+03:00", "crawled": "2015-10-19T11:28:18.565+03:00", "highlightTitle": ""}