{"organizations": [], "uuid": "fa2e0af6cbe77f809d4e3b43859916d14cc11307", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.austinchronicle.com", "main_image": "http://www.austinchronicle.com/imager/b/original/1682032/e676/item3_bastropfire_Rosie_M._Dierkens_Luevano-Young.jpg", "site_section": "http://www.austinchronicle.com/gyrobase/rss/newsdesk.xml", "section_title": "Newsdesk: politics, opinions, and other news staples", "url": "http://www.austinchronicle.com/daily/news/2015-10-20/bastrop-fire-volunteer-opportunities/", "country": "US", "title": "Bastrop Fire Volunteer Opportunities", "performance_score": 0, "site": "austinchronicle.com", "participants_count": 0, "title_full": "Bastrop Fire Volunteer Opportunities", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:00:00.000+03:00", "replies_count": 0, "uuid": "fa2e0af6cbe77f809d4e3b43859916d14cc11307"}, "author": "", "url": "http://www.austinchronicle.com/daily/news/2015-10-20/bastrop-fire-volunteer-opportunities/", "ord_in_thread": 0, "title": "Bastrop Fire Volunteer Opportunities", "locations": ["Alum Creek Road", "Bastrop County"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rosie M. Dierkens Luevano-Young"], "text": "The brush fire that began in Bastrop County last week first appeared on the verge of containment, but has instead swelled in the week since, burning 4,500 acres and destroying more than 60 structures. The view from 71E and Alum Creek Road on Tuesday, Oct. 13 Photo by Rosie M. Dierkens Luevano-Young \nSmoke from the fire traveled over the city of Austin, causing disrupted 911 dispatchers to beg that concerned citizens stop calling in reports. On Oct. 15, Gov. Greg Abbott signed a disaster declaration. By Tuesday, the blaze, which has consumed swathes of Smithville and Buescher State Park, was near 80% contained. \nIn 2011, the Bastrop County Complex fire torched the Lost Pines Forest and a substantial portion of Bastrop State Park. Two people were killed, and 32,000 acres burned, along with 1,696 structures. Memories of the 2011 fire and subsequent recovery linger over what’s been dubbed as the Hidden Pines Fire. \nThe Bastrop County Office of Emergency Management announced on Tuesday (Oct. 20) that residents from evacuated areas could begin to return to their homes, and the Bastrop County Long Term Recovery Team would remain at the Smithville Recreation Center indefinitely. \nHere are some ways to help: \nBastrop County Long Term Recovery Team . Find long-term recovery information on the BCLTR website. Donations can be made to www.bcltrt.org or mailed to P.O. Box 1975, Bastrop TX 78602. www.bastropcountylongtermrecovery.org. \nAustin Disaster Relief Network , a group of Christian organizations that provides support to families in need, dispatched their Crisis Intervention teams last week. Tomorrow (Wednesday, Oct. 21) they host, alongside 104.9 The Horn, the Bastrop Fire Match Drive . Every dollar raised will be matched (up to $10,000) by Tito's Vodka. Donate through www.adrntx.org or text FIRE15 to 444999. \nVolunteers are also welcomed at ADRN's Hope Family Thrift Store, where they will be offering resources to those in need. Hope Family Thrift Store, 1122 East 51st Street, 512/467-4940. Email about specific shifts at volunteer@hopefamilythrift.org. \nThe Austin Animal Shelter , the Humane Society , Austin Pets Alive! , and the Animal Services Office have teamed up to receive animals from the Bastrop County Shelter to free space for pets evacuated due to the fire. See those (adoptable) pets at the Austin Humane Society, 124 W. Anderson Lane (512/646-7387), or at Austin Pets Alive, 1156 W. Cesar Chavez (512/961-6519). Necessary items include Clorox wipes, hand sanitizer, leashes and collars, clean towels, etc., and can be dropped off at the Bastrop County Animal Shelter . They are also still dealing with an influx of kitten refugees. \nState Rep. John Cyrier (R-Lockhart) will change his previously scheduled campaign kick-off on Tuesday, Oct. 27, into a benefit for those affected by the disaster. Suggested donations of $20 will get you a barbecue dinner (plus to-go options!). Contact Cyrier's campaign manager, Jacob Reagan, at jacob@johncyrier.com.", "external_links": [], "published": "2015-10-21T00:00:00.000+03:00", "crawled": "2015-10-21T06:26:25.994+03:00", "highlightTitle": ""}