{"organizations": [], "uuid": "0780613a3edc9227adb01c4349f1ce61a1c8e70d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "article.wn.com", "main_image": "http://i.ytimg.com/vi/slX0NvMdfGs/0.jpg", "site_section": "http://rss.wn.com/English/keyword/politics", "section_title": "WN.com - Politics News", "url": "http://article.wn.com/view/2015/10/08/A_History_of_Nearly_Everything_new_exhibition_University_of_/", "country": "GB", "title": "`A History of Nearly Everything’ – new exhibition (University of Dundee)", "performance_score": 0, "site": "wn.com", "participants_count": 1, "title_full": "`A History of Nearly Everything’ – new exhibition (University of Dundee) - Worldnews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0780613a3edc9227adb01c4349f1ce61a1c8e70d"}, "author": "wn.com", "url": "http://article.wn.com/view/2015/10/08/A_History_of_Nearly_Everything_new_exhibition_University_of_/", "ord_in_thread": 0, "title": "`A History of Nearly Everything’ – new exhibition (University of Dundee)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Source: University of Dundee) Published On Thu 8 Oct 2015 by Roddy Isles Visitors to the University of Dundee this autumn are being invited to enter the fantastical world of the scientific imagination. The University of Dundee Museum Collections contain many hundreds of scientific instruments and related equipment, as well as charts, models and other teaching aids. These are normally shown in a conventional fashion in exhibitions and other displays around campus. However, a rummage through the collections by guest curator and author Reif Larsen has uncovered an alternative history and, in particular, the astonishing tale of explorer, inventor, cosmologist, professor, tenor, liar and rogue scholar Sir Gavin Hawkly-Longfarthing. This fantastical history can be explored at the exhibition `A History of Nearly Everything: The Rise & Fall of Sir Gavin Hawkly-Longfarthing (1925-1966)', which opens in the University's Tower Foyer Gallery on Monday October 12th. From his humble origins as the son of a peat farmer on the island of Taransay to his mysterious death in the Congo 41 years later, Sir Gavin's astonishing career in botany, cosmology, geology, entomology, trichology, spermology, kymatology, thermology and mixology (among others) is laid bare in this astonishing and frankly ridiculous exhibition, curated by author Reif Larsen. 'Reif Larsen has done an amazing job in uncovering this hidden, and possibly mythical, history from our collections,' said Matthew Jarron, Curator of Museum Services at the University. The exhibition is open in the Tower Foyer Gallery, Tower Building, University of Dundee Monday to Friday, from October 12th to November 27th, from 9.30am to 6.30pm. Roddy Isles Head of Press TEL: +44 (0)1382 384910 MOB: 07800 581902 Email: r.isles@dundee.ac.uk distributed by This content was issued by University of Dundee on the 2015-10-08 and was initially posted on www.dundee.ac.uk. It was distributed, unedited and unaltered, by noodls on 2015-10-08 10:29:14 UTC. The original issuer is solely responsible for the accuracy of the information contained therein. (noodl: 30235724)", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T13:56:03.004+03:00", "highlightTitle": ""}