{"organizations": [], "uuid": "f221feb35f22cefb3ae86a4939127cdd103de5bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crikey.com.au", "main_image": "", "site_section": "http://www.crikey.com.au/Politics/Politics-rss.xml", "section_title": "Crikey » POLITICS", "url": "http://www.crikey.com.au/2015/10/05/malcolm-turns-over-a-new-leaf-on-muslim-relations-but-it-needs-work/", "country": "AU", "title": "Malcolm turns over a new leaf on Muslim relations, but it needs work", "performance_score": 0, "site": "crikey.com.au", "participants_count": 1, "title_full": "Malcolm turns over a new leaf on Muslim relations, but it needs work", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T04:58:00.000+03:00", "replies_count": 0, "uuid": "f221feb35f22cefb3ae86a4939127cdd103de5bf"}, "author": "Shakira Hussein", "url": "http://www.crikey.com.au/2015/10/05/malcolm-turns-over-a-new-leaf-on-muslim-relations-but-it-needs-work/", "ord_in_thread": 0, "title": "Malcolm turns over a new leaf on Muslim relations, but it needs work", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shakira Hussein | Oct 05, 2015 12:58PM   \nIt is plain common sense for the authorities to work with, rather than against, Muslim community leaders and elders. \nLet’s start by acknowledging that after the divisive and dysfunctional rhetoric of the Abbott years, Malcolm’s Turnbull’s response to the death of Curtis Cheng at the hands of a Muslim teenager sounded refreshingly sane. No talk of Team Australia and death cults, no co-opting Cheng’s death as a vehicle for this week’s national security “announceable”, no haranguing Muslim community leaders for their supposed failure to describe Islam as a religion of peace often enough and sincerely enough. \nInstead, Turnbull noted that “the Australian Muslim community will be especially appalled and shocked by this,” and the talk from both him and from assistant minister for multicultural affairs Concetta Fierravanti-Wells has been of partnership, inclusion and cohesion. Julie Bishop continued this theme on yesterday’s Insiders, describing Muslim families as “our front line of defence against radicalised young people”. \nIt is plain common sense for the authorities to work with, rather than against, Muslim community leaders and elders. After all, the shooter, Farhad Jabar, was identified after his brother contacted police to say he thought his younger sibling might have been involved in the Parramatta shooting. The government’s shift in tone is significant for communities that remain shell-shocked by the attack. \nAs George Williams points out in today’s Sydney Morning Herald, Abbott’s citizenship bill remains before the federal Parliament, despite Turnbull’s reported lack of personal support for it. And there is no prospect of a shift in direction on other substantial issues of concern for Muslims living in Australia. Australia’s participation in the United States-led military intervention in Iraq and Syria has effectively put us in alliance with Syria’s Assad regime, for all the talk of transitional arrangements and the continued denunciation of the use of chemical weapons against civilian populations. And the refugee intake from that region will prioritise those described as “persecuted minorities” over the persecuted but non-minority Sunni Muslim population of Syria—the population whose prime source of oppression has been the Assad regime rather than Islamic State. \nFriday’s report in The Australian on Turnbull’s plan to “reset” the government’s relationship with the Muslim community quoted go-to “moderate Muslim” Jamal Rifi as saying that he had been reassured during a teleconference between Muslim community leaders and the head of the Refugee Resettlement Advisory Council, Paris Aristotle, that selection for the refugee intake would be based entirely on need rather than religious identity. If this were so, then it would represent a significant change of direction not only in federal government policy but also in Malcolm Turnbull’s personal outlook. \nAs a lowly communications minister, Turnbull was one of those who expressed support for taking more Christians in the Syrian refugee intake, telling journalists that post-war Syria was unlikely to provide a space to its “ancient” Christian communities. And on Friday, Immigration Minister Peter Dutton’s office confirmed that there had been no change to Abbott’s original announcement that the enhanced intake would focus on persecuted minorities, referring to Julie Bishop’s description of them as people who would never be able to safely return to Syria even after the cessation of hostilities. \nCommentators have mostly accepted the claim that the focus on persecuted minorities does not amount to religious discrimination because the new arrivals will include members of persecuted Muslim minorities. But that is like saying that the signs that used to read “no dogs or Catholics” did not discriminate against Christians because, after all, Protestants were still made welcome. Of course, religious identity is one of the factors that may lead to persecution—but the focus ought surely to be on the persecution itself. \nAnd speaking of persecution, Muslim youth will not magically feel less persecuted now that their community and family elders are being so carefully wooed by the new Prime Minister. Despite the kinder, gentler approach, Turnbull, along with NSW Police Commissioner Andrew Scipione and Premier Mike Baird, still described the shooting as an act of terrorism at the same time as admitting that they knew almost nothing about the 15-year-old who had committed it. Scipione oscillated between referring to offender (who at that stage was still to be named) as “this man” and expressing shock at his youth. All concerned said that parents needed to be enlisted to watch over their offspring for signs of “radicalisation”. This is dangerous language when the Muslim community in general, and young people in particular, already resent the sense of being under unrelenting surveillance. \nThere is a fine line between co-operation and co-option. Muslim community leaders may be under far less pressure since the downfall of Tony Abbott—but they continue to tread a fine line.", "external_links": [], "published": "2015-10-05T04:58:00.000+03:00", "crawled": "2015-10-05T18:21:20.533+03:00", "highlightTitle": ""}