{"organizations": [], "uuid": "5ce87321fdc50fbd2b36d9204b6bdfe1cdf201d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/53/5b/JN_Facebook_Icon.png", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/political/gallup-leaving-2016-primary-horse-race/nnxWQ/", "country": "US", "title": "Gallup leaving 2016 primary horse race", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Gallup leaving 2016 primary horse race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T22:10:00.000+03:00", "replies_count": 0, "uuid": "5ce87321fdc50fbd2b36d9204b6bdfe1cdf201d3"}, "author": "", "url": "http://www.journal-news.com/ap/ap/political/gallup-leaving-2016-primary-horse-race/nnxWQ/", "ord_in_thread": 0, "title": "Gallup leaving 2016 primary horse race", "locations": ["WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["EMILY SWANSON"], "text": "Updated: 3:10 p.m. Wednesday, Oct. 7, 2015 | Posted: 3:10 p.m. Wednesday, Oct. 7, 2015 Gallup leaving 2016 primary horse race By EMILY SWANSON WASHINGTON — \nA major name in presidential polling is backing away from the horse race. \nIn a significant shift from the last presidential election, Gallup said Wednesday it won't be testing who's up and who's down in the 2016 primary. The organization won't be doing daily \"horse race\" tracking polls in the general election either, preferring instead to focus on the issues over the next 13 months. \nThe development, first reported by Politico, comes as national polls play a growing role in the presidential nomination process — especially in the crowded Republican field. Debate participation has been determined solely by national polls, despite questions raised about the wisdom of using polling to distinguish candidates sometimes separated by one or two points. \nGallup Editor-in-Chief Frank Newport said such concerns were not a factor in Gallup's decision-making process. Polling, he said, is \"actually a very good criteria for deciding who gets into the debate.\" \nHe said Gallup felt resources spent on tracking the presidential race last time around would be better spent on other measures of public opinion on the campaign. The move doesn't mean the organization plans to stay away from presidential politics entirely. Newport said it could do occasional horse race polls during the general election. \nGallup will continue regularly tracking candidate favorability. The organization will also focus heavily on testing Americans' opinions of the issues and candidates' policies, Newport said, adding that it will examine how closely voters are paying attention to various issues and events as well. \n\"In the big picture, an obsessive focus on trying to be more accurate in predicting the outcome doesn't help society move forward as much as other polling would,\" Newport said. \nGallup missed the mark in the last presidential contest. \nThe group conducted an internal review of its own polling methods after the 2012 election, when its final poll conducted in the days before the election showed 49 percent of likely voters nationally supporting Republican Mitt Romney and 48 percent supporting President Barack Obama . Obama went on to win the national popular vote by nearly 4 percentage points. \nNewport said that review did not play a role in this week's decision. Copyright The Associated Press", "external_links": [], "published": "2015-10-07T22:10:00.000+03:00", "crawled": "2015-10-08T08:34:44.131+03:00", "highlightTitle": ""}