{"organizations": ["PTI", "Samajwadi Party", "BJP"], "uuid": "43e90dec45162348568d6b1c271cd95a659696e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-09/11/full/1441918055-8065.jpg", "site_section": "http://www.business-standard.com//rss/politics-155.rss", "section_title": "Politics", "url": "http://www.business-standard.com/article/politics/dadri-lynching-was-due-to-inefficiency-of-up-govt-heptulla-115101100403_1.html", "country": "IN", "title": "Dadri lynching was due to \"inefficiency\" of UP govt: Heptulla", "performance_score": 0, "site": "business-standard.com", "participants_count": 0, "title_full": "Dadri lynching was due to \"inefficiency\" of UP govt: Heptulla", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T12:52:00.000+03:00", "replies_count": 0, "uuid": "43e90dec45162348568d6b1c271cd95a659696e1"}, "author": "", "url": "http://www.business-standard.com/article/politics/dadri-lynching-was-due-to-inefficiency-of-up-govt-heptulla-115101100403_1.html", "ord_in_thread": 0, "title": "Dadri lynching was due to \"inefficiency\" of UP govt: Heptulla", "locations": ["Meerut", "Bhagalpur", "Bihar", "Uttar Pradesh", "Moradabad"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mahesh Sharma", "Modi", "Arun Jaitley", "Rajnath Singh", "Muslims", "Heptulla"], "text": "ALSO READ: Mahesh Sharma defends PM Modi's silence on Dadri case \"The Prime Minister has his own language. He has in his own way conveyed his dislike or his like, whichever he wants. We, as individuals, cannot put words into the mouth of the Prime Minister,\" Heptulla said in an interview to PTI while underscoring that Modi has already made priorities of his government clear which was development of all. The minister was reacting to the criticism by rival parties that Modi had not condemned the Dadri lynching where a man was killed over rumours that he was eating beef. Heptulla said Modi has from the beginning espoused 'Sabka Saath, Sabka Vikas'. Heptulla asserted that Home Minister Rajnath Singh and Finance Minister Arun Jaitley too had made the view of the government clear on the incident.\"The Finance Minister, not only condemned this incident in Delhi itself but when he went abroad he sent a message from there that look these incidents make his job difficult,\" she said. Attacking the Samajwadi Party which is in power in Uttar Pradesh, Heptulla said it is the state government which is responsible for law and order and it should answer questions as to why it could not prevent the \"condemnable incident\". On the charge by rival parties that it was BJP- RSS leaders who had contributed to a polarised environment ahead of Bihar polls, Heptulla hit back saying why the state government could do nothing to prevent it.\"What are you (UP government) there for? It means you are not capable to stop this polarisation. It shows your inefficiency,\" she said. Asked about charges that Muslims feel more alienated under Modi government, she said, \"Muslims have been feeling alienated since 1947. It is not now. So if you think this was a condemnable one incident, I might remind you how many condemnable incidents took place.\"Not one Muslim but many Muslims and Hindus died. They died in Moradabad, they died in Bhagalpur, they died in Meerut. And just because that government said they are secular, so we accepted the killings of minorities and the majority.", "external_links": [], "published": "2015-10-11T12:52:00.000+03:00", "crawled": "2015-10-11T18:41:46.632+03:00", "highlightTitle": ""}