{"organizations": [], "uuid": "07d1972ad1751ce510b7be2b737065484be622dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151020&t=2&i=1088419561&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9J16E", "site_section": "http://www.reuters.com/politics", "section_title": "Politics &amp; Political News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/20/us-usa-congress-idUSKCN0SE2B620151020", "country": "US", "title": "House returns to infighting over next speaker, fiscal woes", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "House returns to infighting over next speaker, fiscal woes | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:07:00.000+03:00", "replies_count": 0, "uuid": "07d1972ad1751ce510b7be2b737065484be622dd"}, "author": "Richard Cowan", "url": "http://www.reuters.com/article/2015/10/20/us-usa-congress-idUSKCN0SE2B620151020", "ord_in_thread": 0, "title": "House returns to infighting over next speaker, fiscal woes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON The U.S. House of Representatives returns on Tuesday from a Columbus Day recess with no clear plan for choosing someone to replace retiring Speaker John Boehner and little to no progress on budget negotiations, according to congressional aides.\nHouse Republicans will huddle behind closed doors late on Tuesday and early on Wednesday to discuss the two matters, which have become intertwined, according to aides who asked not to be identified.\nMeanwhile, Treasury Secretary Jack Lew and Fed Governor Jerome Powell met on Tuesday with Senate Finance Committee members to discuss a third pressing issue, the need for fast action on raising federal borrowing authority before a Nov. 3 deadline.\nHouse and Senate Republican and Democratic leadership staff have been meeting over the 10-day recess that just ended in an attempt to find a winning formula for funding federal agencies beyond Dec. 11, when current money runs out.\nUnless progress comes soon, lawmakers' goal of writing a two-year budget deal could evaporate with the focus shifting to just paying for agency programs through Sept. 30, 2016, when the presidential campaigns will be in full throttle.\nOne veteran House Republican aide said there had been no progress in those staff-level discussions over the recess.\nBoehner, who is scheduled to leave Congress on Oct. 30, is aiming to pass a debt limit increase as early as this week, according to the House Republican aide.\nHouse leadership spokesmen would not comment on timing for a bill that has little Republican backing.\nQuick passage of a debt limit bill with strong Democratic support, besides calming jittery financial markets, would save whoever the next speaker is from an early, divisive Republican Party fight.\nMany House Republicans are hoping that House Ways and Means Committee Chairman Paul Ryan agrees to run for speaker, a job he has been saying he does not want. Other Republicans are lining up in case Ryan stays out.\nRepresentative Xavier Becerra, a member of the House Democratic leadership, said failure to raise the debt limit in a timely manner could place in doubt Washington's ability to pay November benefits to 25 million Social Security recipients who are among the program's oldest and poorest.\n(Reporting by Richard Cowan; Editing by Dan Grebler)", "external_links": [], "published": "2015-10-20T21:07:00.000+03:00", "crawled": "2015-10-20T20:44:32.419+03:00", "highlightTitle": ""}