{"organizations": [], "uuid": "ac7ad06844deec4ad7187dbb02a3db453463f8f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Nepal-fuel-blockade.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151015/world-neighbours/article/fuel-blocked-border-nepal-plans-talks-india", "country": "US", "title": "With fuel blocked at border, Nepal plans talks with India | Deccan Chronicle", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "With fuel blocked at border, Nepal plans talks with India | Deccan Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:39:00.000+03:00", "replies_count": 0, "uuid": "ac7ad06844deec4ad7187dbb02a3db453463f8f4"}, "author": "AP", "url": "http://www.deccanchronicle.com/151015/world-neighbours/article/fuel-blocked-border-nepal-plans-talks-india", "ord_in_thread": 0, "title": "With fuel blocked at border, Nepal plans talks with India | Deccan Chronicle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AP | October 15, 2015, 18.47 pm Nepalese wait to fill fuel in their motorbikes at a gas station in Kathmandu, Nepal (Photo: AP) Birganj: The line of parked cargo trucks stretches at least 18 miles (30 kilometers) from the Nepalese border. Some have been waiting on the Indian side for 45 days.\nOn the other side, hundreds of ethnic Madhesis are protesting against Nepal's new constitution. With them blocking the road, Indian truck drivers say they're stuck\nThe border impasse - now in its third week - has halted the majority of shipments into Nepal and left the Himalayan nation hobbled by a shortage of fuel and goods. Nepal said Thursday one of its newly appointed deputy premiers, Kamal Thapa, was invited to go to New Delhi on Saturday for talks to resolve the stalemate.\nNepal has accused India of imposing an economic blockade to support the Madhesis, who have strong links with India, in their demand for more constitutional representation. But India insists the problem is Nepal's, and that Indian truck drivers won't resume their deliveries because they are afraid to cross into the middle of a protest camp.\nThere, the Madhesis have erected tents and set tires alight. On Wednesday, some 1,500 were rallying at the camp, and no Indian or Nepalese police or border guards were patrolling anywhere nearby.\n\"You cannot fight for your rights without suffering any pain,\" 57-year-old protester Prem Babu Patel said. \"There is no fuel, very little food and the prices for everything have shot up ... but we have to fight to get our rights as Nepalis.\"\nSeveral checkpoints dot the 1,000-mile (1,700-kilometer) border, but most shipments into Nepal go through this checkpoint at the northern edge of the Indian state of Bihar.\nIndian Oil Corp. - which supplies all of Nepal's fuel - has said only 6,000 tons of gasoline and diesel had been delivered in the first half of October - not even a quarter of the usual two-week supply of about 30,000 tons. The company has yet to assess its losses.\nThe largest Madhesi group, called the United Democratic Madhesi Front, has vowed to continue agitating until the government agrees to their demands. They have argued that the new constitution unfairly divides Nepal into seven states with borders that through the Madhesis' ancestral homeland in the southern plains. The Madhesis, along with several other small ethnic groups, also want the states to be larger and to be given more autonomy over local matters.\n Fuel blockade Nepal India Madhesis Also Read Roaring welcome for master blaster India and Pakistan to benefit from improved relationship: United States IS 'brand' gains ground in Asia, around 1000 Indians said to have joined the group Domingo to stick to 7 batters in playing XI in Tests", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "http://twitter.com/share?url=http://www.deccanchronicle.com/151015/world-neighbours/article/fuel-blocked-border-nepal-plans-talks-india", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Nepal-fuel-blockade.jpg", "https://apis.google.com/js/plusone.js", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Nepal-fuel-blockade.jpg", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-16T04:39:00.000+03:00", "crawled": "2015-10-15T18:12:03.447+03:00", "highlightTitle": ""}