{"organizations": ["EC"], "uuid": "cff0689c903a02d581d5de400841a7c3ba359302", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://www.modernghana.com/logo/final_log.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/647185/1/church-president-urges-ec-to-change-voters-registe.html", "country": "US", "title": "Church President urges EC to change Voters' Register", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Church President urges EC to change Voters' Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T19:00:00.000+03:00", "replies_count": 0, "uuid": "cff0689c903a02d581d5de400841a7c3ba359302"}, "author": "", "url": "http://www.modernghana.com/news/647185/1/church-president-urges-ec-to-change-voters-registe.html", "ord_in_thread": 0, "title": "Church President urges EC to change Voters' Register", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Politics | 5 October 2015 17:00 CET Church President urges EC to change Voters' Register By GNA \nAgona Mensakrom (C/R), Oct 5, GNA - The National President of the Twelve Apostles Church of Ghana, Odiifo Dadezebo Acquah the Second, has added his voice to appeals to the Electoral Commission (EC), to change the Voters Register, to ensure acceptable election results in 2016. \nThe President said the expectation of Ghanaians was to see and witness credible, fair and transparent elections that would avoid mayhem. \nOdiifo Dadesebo Acquah made the call after two weeks of fasting and prayers organized by the Wady Haris Twelve Apostles Church at Agona Mensakrom in the Central Region. \nIt coincided with the ordination of five new pastors who were posted to their new stations. \nHe said Ghanaians were a peace-loving and law-abiding people, and everything should be done to sustain the country's democracy. \nAccording to the President, the EC should not be adamant about the many calls and appeals emanating from the Clergy, Traditional Rulers, Political Parties and the Civil Society. \nHe stated that another vital expectation from Ghanaians was that the results of the 2016 elections would be accepted by all political parties and other civil society organizations, to promote development. \nOdiifo Dadezebo Acquah warned that Ghanaians would not expect any election dispute that could plunge the country into chaos.. \nHe appealed to the EC boss to access the proposals submitted to her, a consider them and do the wishes of the political parties and other civil society groups, to avoid doubts about the alleged bloated voters register. \nThe National President called on political parties to refrain from using abusive language as the elections campaign approached, to ensure peace and stability. \nHe said the socio-economic advancement of the country must be enhanced to improve the living standards of the people. \nOdiifo Dadezebo Acquah urged the newly ordained pastors to desist from acts that could undermine the progress of the church. \nHe urged them to intensify the evangelism drive to help win more souls for Christ Jesus, adding that their duty was to preach the gospel to the masses. \nPastor Kwame Baffoe, in charge of the Twelve Apostles Church at Dansoman in Accra, asked Christians to refrain from engaging in negative tendencies. \nPastors Baffoe urged the new pastors to see themselves as the true servant of God, and not to use their positions to amass wealth to the detriment of members of the church. \nGNA", "external_links": [], "published": "2015-10-05T19:00:00.000+03:00", "crawled": "2015-10-06T02:20:17.373+03:00", "highlightTitle": ""}