{"organizations": [], "uuid": "49cbfd7bf084e4151773c42dc5f23f054c4af472", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2013/06/26/06/19/ITOmR.AuSt.79.jpeg", "site_section": "http://www.kentucky.com/329/index.rss", "section_title": "Kentucky.com -- Politics and Government", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/24/4103333_kentucky-voters-will-determine.html", "country": "US", "title": "Jack Conway, Mitch McConnell quick to challenge federal rule to cut carbon pollution", "performance_score": 0, "site": "kentucky.com", "participants_count": 1, "title_full": "Jack Conway, Mitch McConnell quick to challenge federal rule to cut carbon pollution", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:38:00.000+03:00", "replies_count": 0, "uuid": "49cbfd7bf084e4151773c42dc5f23f054c4af472"}, "author": "bestep@herald-leader.com (Bill Estep)", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/24/4103333_kentucky-voters-will-determine.html", "ord_in_thread": 0, "title": "Jack Conway, Mitch McConnell quick to challenge federal rule to cut carbon pollution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jack Conway, Mitch McConnell quick to challenge federal rule to cut carbon pollution By Bill Estep bestep@herald-leader.com October 23, 2015 Updated 16 hours ago 2015-10-24T11:12:56Z \nObama would like to see restrictions on coal-fired power plants like this one: LG&E's Trimble County plant in Bedford. JANET WORNE | 1990 STAFF FILE PHOTO — Lexington Herald-Leader Buy Photo \nKentucky opponents of a federal mandate to cut carbon pollution from power plants were quick to challenge the rule, which the U.S. Environmental Protection Agency published Friday. \nShortly after the EPA made the rule official, U.S. Senate Majority Leader Mitch McConnell, a Republican, and state Attorney General Jack Conway, a Democrat running for governor, issued news releases blasting the regulation. \nMcConnell said he will join in a resolution designed to stop the EPA from implementing the rule and Conway announced he had joined officials representing 23 other states in a lawsuit to block the rule. \nOpponents argue the rule will put coal-fired power plants out of business, drive down coal jobs, increase electricity prices and jeopardize the reliability of the electricity supply. \n\"Here's what is lost in this administration's crusade for ideological purity: the livelihoods of our coal miners and their families,\" McConnell said in a statement. \"These are Kentuckians who just want to work, provide for their families, and deliver the type of low-cost energy that attracts more jobs to Kentucky.\" \nConway said the EPA does not have the legal authority to force Kentucky to comply with \"the most sweeping energy regulation in the nation's history.\" \n\"This rule is an insult to the hard-working men and women of Kentucky and their families, whose jobs will be put at risk if Kentucky energy rates rise as a result,\" Conway said in a statement. \nEast Kentucky Power Cooperative, which distributes electricity to 520,000 customers in 87 counties through member co-ops, said it had joined a lawsuit by a national association seeking review of the rule. \nThe co-op association also asked the court to block the EPA from pushing ahead on timelines to implement the rule while it is being challenged. \nThe risk is that the co-op and members could spend hundreds of millions of dollars developing facilities to comply with the EPA mandate only to have the courts decide that was unnecessary, said Anthony \"Tony\" Campbell, president and chief executive officer of East Kentucky Power. \n\"That is neither prudent nor acceptable to our owner-members,\" he said. \nSupporters of the rule on reducing carbon pollution argue it will not only clean up the air and cut health problems such as heart attacks and asthma, but also drive creation of jobs in renewable-energy production and energy-efficiency programs, such as weatherizing homes, which also would help cut electricity bills. \n\"The environmental community supports this,\" said Lane Boldman, executive director of the Kentucky Conservation Committee. Bill Estep: (606) 678-4655. Twitter: @billestep1", "external_links": [], "published": "2015-10-24T00:38:00.000+03:00", "crawled": "2015-10-25T05:24:31.004+02:00", "highlightTitle": ""}