{"organizations": [], "uuid": "a78ebfa18d6f6e2e37ec22f8ed540658ed9ed480", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "snn.bz", "main_image": "http://i2.wp.com/snn.bz/wp-content/uploads/2015/10/Clinton-Obama700.jpg?resize=700%2C350", "site_section": "http://SyndicatedNews.NET/feed/", "section_title": "Syndicated News - Live News Entertainment Political Music News", "url": "http://snn.bz/45441-2/", "country": "US", "title": "HILLARY TO BARACK: CALL OFF YOUR F*CKING DOGS", "performance_score": 0, "site": "snn.bz", "participants_count": 1, "title_full": "HILLARY TO BARACK: CALL OFF YOUR F*CKING DOGS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T14:46:00.000+03:00", "replies_count": 0, "uuid": "a78ebfa18d6f6e2e37ec22f8ed540658ed9ed480"}, "author": "SyndicatedNews", "url": "http://snn.bz/45441-2/", "ord_in_thread": 0, "title": "HILLARY TO BARACK: CALL OFF YOUR F*CKING DOGS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWS \nDuring his 1992 campaign for the presidency, Bill Clinton was fond of promising America, “You get two for the price of one,” indicating Hillary Clinton would act as his co-president. \nBut the nation got much more than it bargained for, as the top power couple brought a load of baggage with them into the White House from their days in Arkansas. \nAfter the Clintons moved into the presidential mansion, the political scandals multiplied – from use of the IRS and FBI to target political opponents to stalking and harassing subjects of Bill Clinton’s sexual advances and even attempts to loot taxpayer-funded items from the White House. Americans also witnessed capers such as Travelgate, Chinagate, Filegate and Pardongate. \nBill Clinton’s sexual escapades and subsequent impeachment by the U.S. House of Representatives on charges of perjury and obstruction of justice consumed more than a year of American public life and bitterly divided the nation.In the years since the memorable Clinton presidency, Hillary has brought America Emailgate and the Benghazi scandal, among others. New developments in the Clinton Foundation scandals emerges almost daily . \nWhat do YOU think? Is Hillary fit to be president? Sound off in today’s WND poll! \nBut in 2015, America is still apparently suffering from “Clinton fatigue.” Results from a Quinnipiac poll published in April revealed between 49 and 56 percent of voters in three significant swing states – Colorado, Virginia and Iowa – believe Hillary is neither honest nor trustworthy. \nEven former California Democratic Party Chairman Bill Press told WND that controversies surrounding Hillary should convince members of his own party an uncontested coronation of Clinton as the party’s 2016 nominee for the White House is a very risky idea and should encourage other Democrats to throw their hats in the ring. \nSen. Marco Rubio, a Republican candidate for president, said Sunday he believes voters will reject Hillary because of the “cloud of constant scandal she brings to the political process.” Rubio told Fox News Sunday , “Unfortunately, both under her husband’s presidency, her time in the Department of State, her campaign for the president last time and even now, there seems to be this cloud of constant scandal and things that distract us from the core issues of the moment.” image: http://www.wnd.com/files/2015/05/hillary3.jpg Hillary’s “drama” could become a distraction, Rubio warned, at a time when the stakes are high for America in the 2016 election.“I just think that at this hinge moment in our history, where we are asked to make a transition from the past into this new future, with all the challenges and the opportunities of our time that we really – the American people are not at a point now where they are going to be supportive of more drama surrounding the political process,” he said. In 2003, ABC News’ Barbara Walters referenced numerous Clinton scandals from Whitewater to Travelgate and the death of Hillary law partner Vince Foster in an interview with then-Sen. Clinton. Walters asked Hillary, “How did you get in this mess where your whole credibility is being questioned?” Hillary’s response: “Oh, I ask myself that every day, Barbara, because it’s very surprising and confusing to me.” With Hillary making another run for president, don’t get caught up in the lies and spin! In “Hillary Unhinged: In Her Own Words,” find out who the true Hillary is with this raw and humorous collection of quotes that pitilessly underscores her hypocrisy With the prospect of another “two-for-one” Clinton presidency looming, is America ready for a repeat of the Bill and Hillary “drama” in the White House? If, as psychologists say, “The best predictor of future behavior is past behavior,” then a fresh look at the top 20 scandals involving Hillary is in order. \nimage: http://www.wnd.com/files/2015/05/IRS_audit.jpg 1) Clintons turn IRS into ‘gestapo’ Few federal agencies are more feared and loathed by Americans than the Internal Revenue Service – especially when corrupt presidents abuse the power of the IRS to harass and exact revenge on political enemies. As WND has reported , during Bill Clinton’s terms in office, IRS audits were conducted against individuals and groups who caused problems for the administration. Several prominent conservative groups found themselves facing IRS audits following their criticism of the president and his policies. Among the conservative groups targeted for audits were the Heritage Foundation, the National Rifle Association, Concerned Women of America, Citizens Against Government Waste, National Review, American Spectator (which was burglarized three times), the National Center for Public Policy Research, the American Policy Center, American Cause, Citizens for Honest Government, Progress and Freedom Foundation, David Horowitz’s Center for the Study of Popular Culture and the Western Journalism Center. Individuals singled out for audits during the administration included Clinton paramours Gennifer Flowers and Liz Ward Gracen, sexual assault accusers Paula Jones and Juanita Broaddrick, fired White House Travel Office Director Billy Dale and attorney Kent Masterson Brown. Fox News’ Bill O’Reilly, an outspoken critic of both Bill and Hillary Clinton, said he was audited three times during the Clinton presidency. A 1996 survey by the Washington Times could not identify a single liberal public policy organization that had been audited during the entire Clinton administration. \n2) Covering Bill’s dirty The Clintons have been accused of hiring private investigators to not only dig up dirt on perceived adversaries – such as Juanita Broaddrick, the woman allegedly raped by Bill, and other abused women such as Gennifer Flowers, Kathleen Willey and Paula Jones – but to stalk, scare and threaten them. Willey asserts Hillary was behind a campaign of intimidation and harassment against her that fit a pattern employed against numerous other women whose claims of sexual impropriety or assault by Bill Clinton threatened the couple’s political fortunes. As WND reported, Willey and her husband, Ed, were Democratic activists who founded Virginians for Clinton and helped send Bill and Hillary to the White House in 1992. While serving as a volunteer in the White House and facing financial hard times, Willey says she met with Bill Clinton in the Oval Office to request a paying position. But instead of getting help, she says, she was subjected to “nothing short of serious sexual harassment.” Distraught, Willey fled Clinton’s presence, only to discover that her husband Ed had committed suicide that same tragic afternoon. Later, she was drawn “unwillingly” into the Paula Jones lawsuit, the Ken Starr investigation and impeachment proceedings. Willey, author of the 2007 book, “Target: Caught in the Crosshairs of Bill and Hillary Clinton,” has claimed the Clinton tag team used mob-style intimidation campaign to keep her silent, even purportedly breaking into her home to steal her memoirs of the events. Despite Bill’s 20 years of alleged and admitted extra-marital relationships, Hillary famously came to his defense shortly after the Monica Lewinsky affair broke in 1998. Asked about the accusations, the then-first lady said, “Certainly, I believe they’re false. Absolutely.” Then, in a memorable interview with the “Today” show’s Matt Lauer, she explained years of accusations by women such as Willey, Gennifer Flowers and Dolly Kyle Browning: “Bill and I have been accused of everything, including murder, by some of the very same people who are behind these allegations,” she said, pointing to a “vast right-wing conspiracy. … So from my perspective this is part of a continuing political campaign against my husband.” What makes a book about Bill and Hillary Clinton so explosive that someone would STEAL it? Kathleen Willey tells America the shocking story in her book, “Target: Caught in the Crosshairs of Bill and Hillary Clinton.” Later, however, when placed under oath, Bill Clinton admitted to an affair with Flowers, as he did with Lewinksy. But Hillary’s actions, Willey contends, indicated by word and deed that her main concern was to ensure her husband’s proclivities didn’t ruin their political careers. In her book, Willey cites sources who contend Hillary began engaging private investigators during their time in Arkansas so she could head off any repercussions from her husband’s behavior. The first to be dispatched were her own father and brother when she committed to marry Bill, according to author Jerome Levin in “The Clinton Syndrome.” Bill had left Yale University for Arkansas to teach law, and she went to work in Washington, D.C. When Bill was governor, Hillary sent out a group of investigators known at the “Truth Squad” to discourage many of her husband’s lovers from going public. \n3) Looting the White House image: http://www.wnd.com/files/2015/04/whitehoue-300.png When the Clintons left 1600 Pennsylvania Avenue in 2001, they reportedly vandalized and looted the White House. Hillary tried to ship furniture to the Clintons’ personal home in Chappaqua, New York . The Clintons came under fire when they reportedly tried to take $190,000 in gifts and furnishings from the presidential mansion. Additionally, the General Accounting Office, an investigative arm of Congress, reported that ”damage, theft, vandalism and pranks did occur in the White House complex” during the presidential transition from Bill Clinton to George W. Bush – including the theft of a presidential seal. According to the General Accounting Office, the cost of the White House vandalism reached about $14,000 and included $4,850 to replace computer keyboards with damaged or missing “W” keys. The agency said some of the destruction was intentional, including glue smeared on desks, broken furniture, offices full of trash and graffiti in a men’s restroom stall that disparaged Bush. There were also missing doorknobs, medallions and office signs.During their time in the White House, the Clintons also reportedly auctioned off and sold taxpayer-financed government goods and services in exchange for political campaign contributions and personal profit. Among the items sold by the Clintons, which Judicial Watch uncovered in various lawsuits, and the media and Congress in their investigations, were: 1) seats on overseas trade missions; 2) export licenses for high technology sales to communist China and elsewhere; 3) commissionerships and judgeships; 4) rides on Air Force One; 5) overnight stays in the White House’s Lincoln Bedroom; 6) graves at Arlington Cemetery; 7) meetings with key Clinton-Gore administration leaders; and other favors. \n4) Filegate: FBI files on GOP enemies image: http://www.wnd.com/files/2015/05/top_secret.jpg The Clinton duo was involved in a scandal known as “Filegate” in which they illegally obtaining FBI files on perceived adversaries , most of whom served in previous Republican administrations.“In an effort to discredit the women who charged President Clinton with sexual misconduct, personal files and papers were illegally obtained and released. The courts found, under the Privacy Act, that the privacy of Linda Tripp and Kathleen Willey had been violated,” a Judicial Watch report said , citing just a few of more than 900 relevant files. Judicial Watch said Hillary had been linked “directly to the center” of the controversy. The scandal was first detected by the House Government Reform and Oversight Committee, which investigated the Clintons’ Travelgate caper. The committee found that the FBI files had been improperly accessed by Craig Livingstone, a former bar bouncer Hillary had hired to work in the White House Counsel’s Office. However, Hillary called the whole affair a “completely honest bureaucratic snafu.” In “Whores: Why and How I Came to Fight the Establishment,” Judicial Watch and Freedom Watch Founder Larry Klayman details the stunning incompetence and corruption of Bill and Hillary Clinton \n5) Hillary’s ‘Muslim Brotherhood princess’ Huma Abedin, who served as Hillary’s longtime deputy chief of staff and has worked with her for nearly 20 years, has known ties to the Muslim Brotherhood – a group bent on “destroying Western civilization from within” – and other Islamic supremacists. As WND has extensively reported , the Muslim Brotherhood and Islamic supremacist connections not only extend to Abedin’s mother and father, who are both deeply tied to al-Qaida fronts, but to Abedin herself . As WND reported , a manifesto commissioned by the ruling Saudi Arabian monarchy places the work of an institute that employed Abedin at the forefront of a grand plan to mobilize U.S. Muslim minorities to transform America into a Saudi-style Islamic state, according to Arabic-language researcher Walid Shoebat. Abedin was an assistant editor for a dozen years for the Journal of Muslim Minority Affairs for the Institute for Muslim Minority Affairs. The institute – founded by her late father and currently directed by her mother – is backed by the Muslim World League, an Islamic organization in the Saudi holy city of Mecca that was founded by Muslim Brotherhood leaders. The 2002 Saudi manifesto shows that “Muslim Minority Affairs” – the mobilizing of Muslim communities in the U.S. to spread Islam instead of assimilating into the population – is a key strategy in an ongoing effort to establish Islamic rule in America and a global Shariah, or Islamic law, “in our modern times.” WND reported Abedin also was a member of the executive board of the Muslim Student Association, which was identified as a Muslim Brotherhood front group in a 1991 document introduced into evidence during the terror-financing trial of the Texas-based Holy Land Foundation. At her father’s Saudi-financed Islamic think tank, WND reported , Abedin worked alongside Abdullah Omar Naseef, who is accused of financing al-Qaida fronts. Naseef is deeply connected to the Abedin family. WND was first to report Huma’s mother, Saleha Abedin, was the official representative of Naseef’s terror-stained Muslim World League in the 1990s. Shoebat previously reported that as one of 63 leaders of the Muslim Sisterhood, the de facto female version of the Muslim Brotherhood, Saleha Abedin served alongside Nagla Ali Mahmoud, the wife of Muslim Brotherhood figure Mohammed Morsi, Egypt’s now ousted president. Saleha Abedin and Morsi’s wife both were members of the Sisterhood’s Guidance Bureau, Shoebat found . WND also recently reported Abedin used emails hosted on HIllary’s private server while she was secretary of state . \n6) Vince Foster’s 1993 death Vince Foster was deputy White House counsel and Hillary’s friend and law partner who had connections to the Travelgate and Whitewater scandals. In 1993, Foster was found dead in a park with a fatal gunshot wound to his mouth. As WND reported , his suicide was the subject of much speculation and three official investigations. Investigations by the U.S. Park Police, the Department of Justice, the FBI, Congress, Independent Counsel Robert B. Fiske and Independent Counsel Kenneth Starr concluded Foster’s death was a suicide. However, as WND reported in 2003 , one of Starr’s key investigators challenged the official line, insisting the probe’s result was predetermined, only a few plotters were required to engineer the result, the crime scene was altered and that major newspaper editors killed stories by reporters pursuing the truth. The Washington Post reported that federal investigators were not allowed to enter Foster’s office after his death, but “White House aides enter[ed] Foster’s office shortly after his death, giving rise to speculation that files were removed from his office.” In his 2005 book “The Truth about Hillary: What She Knew, When She Knew It, And How Far She’ll Go to Become President,” Edward Klein wrote of Hillary’s involvement in the effort to remove Foster’s files: \nThe night of [Foster’s] death, Hillary launched one of the most shameful – and illegal – cover-ups of her entire career. She sent two of her most trusted White House loyalists – Maggie Williams, the First Lady’s chief of staff, and Patsy Thomasson, who was in charge of White House administration – into Foster’s office to retrieve embarrassing and incriminating documents related to Whitewater and Hillary’s other personal affairs. While White House Counsel Bernard Nussbaum barred investigators from entering Foster’s office, Maggie Williams, Patsy Thomasson, and Craig Livingston, Hillary’s director of White House security, removed armloads of files and loose-leaf binders. “In addition, a White House staffer allegedly tampered with the titles of several memos and removed the First Lady’s initials in an effort to erase her role in improper behavior.” \n\n7) Emailgate: ‘She should go to prison for this’ image: http://www.wnd.com/files/2015/05/Hillary_email.jpg In March 2015, WND reported Hillary kept all her official correspondence as secretary of state, as well as her personal emails, on a private email server located at her home – instead of using the government-mandated process while serving in the high appointed position. Her email system was unsecured for months while she used it for government business, and she did not sign a standard agreement when she left office that promised she had left government property behind. The Hill reported Hillary did not encrypt her private email service with a digital certificate for the first three months of her tenure as secretary of state.” That was while she was traveling to China, Egypt, Israel, Japan and South Korea. Several present and former members of the U.S. intelligence community said Hillary’s private email server was a major security risk, and America, going forward, ought to assume enemies of the state all had access to it. “The name Clinton right on the email handle meant this was not a difficult find,” said John Schindler, a former National Security Agency counterintelligence officer, Investors Business Daily reported. With Hillary making another run for president, don’t get caught up in the lies and spin! In “Hillary Unhinged: In Her Own Words,” find out who the true Hillary is with this raw and humorous collection of quotes that pitilessly underscores her hypocrisy In April, J. Michael Waller – a longtime consultant to government entities ranging from the secretary of defense to the U.S. Senate to the U.S. Marine Corps Warfighting Laboratory – told WND the Russians hack into the U.S. government, and so does any foreign intelligence worth its salt, most likely through Hillary’s private server. Waller said Hillary deserves prison time for insisting on an email system that clearly left the nation vulnerable to attack. “This is the national-security equivalent of drunken driving,” he said. “She should go to prison for this. When you drink and drive, you know in advance that you’re putting other people in danger. Yet, you think because you’re so smart or so clever or just don’t care, that nothing’s going to happen and then something does, so it’s your fault. This is precisely what she did on the national security sphere.” Hillary gave 55,000 emails from her private email account to the State Department in December. On March 10, Clinton announced she had deleted 30,000 emails she considered personal. She was warned by Congress way back in 2012 against using a private email account for government business – and her response? Silence. \nimage: http://www.wnd.com/files/2015/05/Hillary_Clinton.jpg 8) Chinagate: Sale of high-tech secrets Chinagate, documented by Judicial Watch , was uncovered by Judicial Watch founder Larry Klayman. Technology companies allegedly made donations of millions of dollars to various Democratic Party entities, including President Bill Clinton’s 1996 re-election campaign, in return for permission to sell high-tech secrets to China. B ernard Schwartz and his Loral Space & Communication Ltd. later allegedly “helped China to identify the cause of [a rocket failure], thereby advancing China’s missile program and threatening U.S. national security,” according to records. In a 2013 column titled “Proof Hillary isn’t fit to be president,” Klayman wrote: \nNot to be outdone by her prior scandals, Hillary … masterminded a scheme whereby the Clinton-Gore presidential campaign of 1996 took bribes from communist Chinese banks and their government to bankroll the president’s and the Democratic Party’s re-election efforts when it appeared, due to their low standing in the polls, that all the stops needed to be pulled out. It was the lawsuit that I brought against Secretary of Commerce Ron Brown, where at Hillary’s instruction, he literally sold seats on Department trade missions to China and elsewhere, which principally uncovered this. In late 1996 and early 1997, the scandal had burgeoned to such a level that joint congressional hearings were empaneled, ultimately to be shut down when Democrats uncovered illegal fundraising by some Republicans. The two parties, faced with mutual assured destruction, simply took an exit stage left. However, I soldiered on with my lawsuit. And, while I uncovered a lot about Bonnie and Clyde and their Chinese ‘friends,’ this scandal ultimately took back seat to the Monica Lewinsky scandal, since the media preferred sex to foreign espionage and graft. Hillary and Bill were ironically saved by Monica, who became the lightening rod drawing attention away to what at the time was perhaps the biggest scandal – Chinagate – in American history. \n\n9) Travelgate: Always room for friends In the Travelgate scandal, the staff of the White House travel office was fired to make way for Clinton cronies, including Bill’s 25-year-old cousin, who was reportedly promised the position of office director. Hillary allegedly fired seven employees and gave the positions to her Arkansas friends. According to the Washington Post , there was an effort to award a White House airline contract to a Clinton friend. Also, Hillary reportedly had the FBI investigate the former head of the travel office, Billy Dale, who was fired without notice and removed from White House grounds. Dale was charged with embezzlement but found not guilty of the crime in 1995. He was later audited by the IRS. \nimage: http://www.wnd.com/files/2015/05/Bill_Hillary_Clinton.jpg 10) Whitewater: Jail for friends, but not Clintons The Whitewater investigation by independent counsel Kenneth Starr began in 1994 with accusations of impropriety against the Clintons and others concerning improper campaign contributions, political and financial favors, and tax benefits. Its initial subject was a failed Arkansas real-estate venture involving the Clintons in the 1980s that was linked to the collapse of Madison Guaranty Savings and Loan, a Little Rock savings bank run by the Clintons’ Whitewater business partners. Clinton friends James and Susan McDougal went to jail for fraud (James died while serving his sentence), as did former Arkansas Gov. Jim Tucker and municipal judges David Hale and Eugene Fitzhugh. The probe eventually expanded to include the death of deputy White House counsel Vincent Foster, the dismissal of White House travel office employees, receipt by the White House of a number of FBI files and the issue of whether President Clinton lied or obstructed justice to hide an affair with White House intern Monica Lewinsky. \n11) ‘Landing under sniper fire’ in Bosnia In her March 17, 2008, foreign-policy speech on Iraq, then-Sen. Hillary Clinton recalled a trip she made to Tuzla, Bosnia, in 1996. “I remember landing under sniper fire,” Hillary said of her visit while she was first lady. “There was supposed to be some kind of a greeting ceremony at the airport, but instead we just ran with our heads down to get into the vehicles to get to our base.” But news footage of her visit revealed her “sniper fire” claim wasn’t just exaggerated. It was completely false. And Hillary had repeated the claim several times, including during her time on the presidential campaign trail in 2007. Rather, Hillary landed on a tarmac and greeted a crowd, including an 8-year-old child who gave her a poem, under no duress. According to the Washington Post, a review of more than 100 news articles revealed no security threats to Hillary at the time. \n\nAfter the 2008 speech, Hillary was asked about her statements, and she stood by them: “There was no greeting ceremony, and we basically were told to run to our cars. Now that is what happened.” But, a week later, Hillary told the Philadelphia Daily News that she “misspoke.” Hillary claimed she had been told there was a threat of sniper fire in the area. The following day, she declared: “So I made a mistake. That happens. It shows I’m human, which for some people is a revelation.” \n12) Hillary’s ‘missing’ law firm billing records In 1994, federal investigators subpoenaed Hillary’s billing records from her days as a partner in the Rose Law firm during the Watergate scandal. The White House said it didn’t have the 115 pages of files. While Hillary claimed she had a minor role in the affair, the Washington Examiner reported that “when the records mysteriously turned up in the White House in 1996 , they showed she met repeatedly with key figures in the scandal.” \n13) Pardongate: Hillary Senate contributions Before Bill Clinton left the White House in 2001, he granted numerous controversial pardons – including to convicted tax evader Marc Rich , whose wife made significant contributions to Hillary’s 2000 Senate campaign and the Clinton presidential library. The Associated Press reported that Rich had been “indicted by a U.S. federal grand jury on more than 50 counts of fraud, racketeering, trading with Iran during the U.S. Embassy hostage crisis and evading more than $48 million in income taxes – crimes that could have earned him more than 300 years in prison.” Rich fled to Switzerland in 1983 after his indictment and remained on the FBI’s Most Wanted List until President Clinton pardoned him. Also, Hillary’s brothers, Tony and Hugh Rodham, reportedly received large amounts of money from people who were pardoned by Bill Clinton. Hillary said she and Bill were unaware of the scheme. Accuracy in Media reported , “Hugh Rodham, Hillary’s brother, was taking money and promising access to help get pardons. Two such high profile cases were those of drug kingpin Carlos Vignali and convicted swindler Glenn Braswell. Rodham received hundreds of thousands of dollars from each, and they were both granted pardons. Rodham was quoted as telling a top White House aide that the pardon for Vignali was ‘very important’ to Hillary.” \nimage: http://www.wnd.com/files/2015/05/cow.jpg 14) Hillary’s cash cows and 9,987 percent profit In March 1994, it was revealed Hillary – with no previous experience – had made massive profits from cattle futures trading between 1978 and 1979, when Bill Clinton’s salary as Arkansas attorney general had been modest. She reportedly made $99,537 in profit on a $1,000 investment (a 9,987 percent profit) in just nine months because of a highly placed connection at Tyson Foods, which was the largest employer in Arkansas and a big Clinton donor. The New York Times reported: “During Mr. Clinton’s tenure as Governor, Tyson benefited from several state decisions, including favorable environmental rulings, $9 million in state loans, and the placement of company executives on important state boards. … The commodities trades were the most successful investment the Clintons ever made. The nearly $100,000 profit enabled them to buy a house, invest in securities and real estate and provide a nest egg for their daughter, Chelsea.” \nimage: http://www.wnd.com/files/2015/05/body_count.jpg 15) Clinton body count: ‘You find dead people’ “The Clinton body count,” first published in WND and later circulated by Linda Tripp to Monica Lewinsky, is a collection of names of people associated with Clinton administration scandals who have died mysterious and often violent deaths. Reporter David Bresnahan broke the story of the list during the summer of 1997 while researching his book, “Cover Up: The Art and Science of Political Deception.” “I started looking into all the various deaths of people that were involved in various Clinton scandals,” Bresnahan said. “I started to investigate the entire picture instead of just one focused event. “Nobody out there was putting it all together,” he said. “If you look at one scandal, you’ll find one dead guy. When you investigate all Clinton scandals, you find similarities, you find common tactics, you find common actions and you find dead people.” The list was not just a source of terror among sworn enemies of the administration. It was an even greater terror for those close to Clinton – for those closest, it appeared, died younger and more inexplicably than those on the outside looking in. In his research, Bresnahan came up with more than one list. “Not only did I find a list of dead people, but I also found that there are over 100 people who have refused to testify,” he said at the time. “There is also a list of people who have gone to jail. There are 45 people who have gone to jail, some of them White House staff, Cabinet members as well as people from the Justice Department. So many of those (lists) developed when I started to pursue the big picture.” \n16) Hillary’s radical pal, Saul Alinsky As WND has reported , the exact nature and extent of Hillary’s relationship with radical community organizer Saul Alinsky has long been the subject of speculation and intrigue. The interest has been largely fueled by her suppressed and later released 92-page senior thesis for Wellesley College offering an extensive, largely positive critique of Alinsky and his work. WND recently found that long after Alinsky’s death in June 1972, a group Clinton co-chaired maintained a working relationship with Alinsky’s main community organizing outfit, the Industrial Areas Foundation, or IAF. The partnership extended into the 1990s and yielded influence over the education policy of the Clinton presidency. Dick Morris, a former top political adviser to Bill Clinton both as governor of Arkansas and as president, noted to WND that education reform “is the key issue Hillary Clinton used to propel herself independently to the forefront of Arkansas politics during Bill’s governorship.” “The revelation of how closely linked her efforts were back in the 80s – and have been since – to an Alinsky radical front group is deeply disturbing and expands our understanding of Hillary’s fundamental radicalism and commitment to the new left of Saul Alinsky,” Morris said. Hillary was said to have met with Alinsky several times in 1968, when she was writing her thesis. In her most recent memoir, Hillary wrote that she rejected a job offer from Alinsky to instead attend law school. The Hillary-Alinsky relationship received more media attention last September, when the Washington Free Beacon uncovered direct correspondence between Clinton and Alinsky from the archives of Alinsky’s IAF. The correspondence dates to the summer of 1971, when the 23-year-old Clinton was living in Berkeley, California, and interning at the law firm Treuhaft, Walker and Burnstein. In a July 8, 1971, letter to Alinsky marked “personal,” Hillary wrote: “Dear Saul, When is that new book [Rules for Radicals] coming out – or has it come and I somehow missed the fulfillment of Revelation? “I have just had my one-thousandth conversation about Reveille [for Radicals] and need some new material to throw at people,” she wrote, referring to a 1948 Alinsky treatise on community organizing. The Free Beacon’s Alana Goodman noted the letter documents Hillary and Alinsky had kept in touch since she entered Yale and that Alinsky even offered her advice on campus activism. Hillary wrote that she missed their regular conversations and asked if Alinsky would be able to meet her the next time he was in California. “I am living in Berkeley and working in Oakland for the summer and would love to see you,” she wrote. “Let me know if there is any chance of our getting together.” \n17) Hillary laughs about defending child rapist As WND reported , Hillary explained her defense of a child-rape suspect as just part of the job. But she hasn’t explained her laughing about his passing of a lie-detector test, which “destroyed” her faith in such evaluations. “Once I was appointed I fulfilled that obligation,” she said in an interview with Mumsnet, a U.K. community of parents providing and sharing information on a variety of subjects and issues. In the video she is asked, “As a lawyer, you defended the rapist of a 12-year-old girl, calling the victim ’emotionally unstable’ and saying that girls have a tendency to ‘exaggerate or romanticize sexual experiences especially when they come from disorganized families.'” Comments? Clinton said: “When I was a 27-year-old attorney doing legal aid work at the law school where I taught in Fayetteville, Arkansas, I was appointed by the local judge to represent a criminal defendant accused of rape. I asked to be relieved of that responsibility. But I was not and I had a professional duty to represent my client to the best of my ability, which I did. “He later pled guilty to a lesser included offense. When you’re a lawyer you often don’t have the choice as to who you will represent, and by the very nature of criminal law there will be those who you represent you don’t approve of, but at least in our system, you have an obligation and once I was appointed, I fulfilled that obligation.” However, she did not address the reports of unearthed recordings in which she almost boasts of knowing of her client’s guilt and laughing about the case. The tapes reveal her discussing the case of Thomas Alfred Taylor, then 41, who was accused of raping a 12-year-old in Springdale, Arkansas, on May 10, 1975. “It was a fascinating case, it was a very interesting case,” Clinton said on the tape. “This guy was accused of raping a 12-year-old. Course he claimed that he didn’t, and all this stuff. … I had him take a polygraph, which he passed – which forever destroyed my faith in polygraphs.” She laughed at the statement. Listen to the audio of the interview. ( Warning: Description of the case may disturb some listeners) : \n\nThe Washington Free Beacon report on the recordings also confirmed she was laughing several other times while discussing the case, including “when discussing the crime lab’s accidental destruction of DNA evidence that tied Taylor to the crime.” Published profiles of the case reveal that Clinton’s strategy at the time was to attack the 12-year-old. She submitted an affidavit that said she was told the girl was “emotionally unstable” and was viewed as having a “tendency to seek out older men and engage in fantasizing.” She claimed the child “in the past made false accusations” and she exhibited “an unusual stubbornness and temper when she does not get her way.” The woman who says she was raped by the defendant blasted Hillary in 2014, accusing her of intentionally lying about her in court documents. “Hillary Clinton took me through hell,” she told the Daily Beast . \n18) Hill ca$hes in: Iranian fundraising As WND recently reported , Hillary received funds from an arm of the Iranian government and hired a convicted Iranian-American multimillionaire with ties to Tehran as her national campaign finance director in 2008. The Bill, Hillary, and Chelsea Clinton Foundation accepted $30,000 between April 2005 and March 2006 and another contribution of between $25,000 and $50,000 in 2008 from the New York-based Alavi Foundation, which U.S. government prosecutors have identified as an arm of the Iranian government. For her 2008 presidential campaign, Clinton hired Hassan Nemazee as her national campaign finance director , who was known for his efforts to normalize relations with the theocratic Iranian regime. In 2010, Nemazee pleaded guilty to running a Ponzi scheme in which he obtained $292 million in fraudulent loans. He was sentenced to 12 years in prison. In his explosive bestseller, “Clinton Cash,” Peter Schweizer follows the Clinton money trail, revealing the connection between their personal fortune, their “close personal friends,” the Clinton Foundation, foreign nations and some of the highest ranks of government. Rachel Ehrenfeld, director of the American Center for Democracy, spelled out the problem with the Clinton Foundation receiving funds from the Alavi Foundation in a Jan. 5, 2009, article published by Forbes. “Alavi’s contribution [in 2008] to Clinton came just two days after the Treasury Department also designated Alavi’s partner, the New York-based Assa Corp., as a terrorist entity, and the New York Southern District’s attorney seized and forfeited its assets,” Ehrenfeld wrote. \nimage: http://www.wnd.com/files/2015/05/clinton_foundation.jpg 19) Clinton Foundation: Scandals keep coming As WND reported , the Clintons appear to have siphoned off tens of millions of dollars annually from funds the Bill, Hillary, and Chelsea Clinton Foundation has received from a United Nations-sponsored program that uses levies on airline tickets to help HIV/AIDs victims in the Third World, charges Wall Street analyst and investor Charles Ortel. The Clinton Foundation also reportedly distributed useless drugs to AIDS patients in Third-World countries . Although Hillary was appointed to the board of directors of the Clinton Foundation in 2013, after she had resigned as secretary of state, Ortel contends she is complicit in what he has described as systematic financial fraud warranting a criminal investigation . After months of tedious investigation, Ortel has concluded the foundation has filed financial and tax forms that were materially misleading, incomplete and in error with the goal of enriching the Clintons and their close associates. Ortel alleges Hillary advanced an “inurement” scheme – enriching oneself through a nonprofit organization – in complicity with her husband by positioning various key associates within the Clinton Foundation structure while she served as U.S. senator from New York and subsequently as secretary of state under President Obama. “Ongoing analysis of legally required public disclosures reveals that while Mrs. Clinton served as director, the Clinton Foundation and its principal constituent elements, filed false and materially misleading tax returns with the IRS and with other governmental authorities, for multiple years,” Ortel charges in his second report on alleged Clinton Foundation mismanagement. As WND also recently reported , based on Ortel’s findings, a prominent lawyer and a top government watchdog in the nation’s capital are calling for the Clinton Foundation to be shut down. Like the reporting you see here? Sign up for free news alerts from WND.com, America’s independent news network. In April, the New York Times reported , “Cash flowed to Clinton Foundation as Russians pressed for control of uranium company.” Hillary has said, “I am very proud of the work the Foundation does,” but just 9 percent of the Foundation’s money went to charity in 2013. Fox News’ John Stossel noted , “Charity Navigator, the biggest charity rating service, won’t even list the Clinton Foundation in its rankings. This is repulsive. If a Republican candidate ran a charity that did that, it would be a scandal. But the Clintons must be immune.” WND reported Sunday that before Hillary completed her first year as President Obama’s secretary of state, Ortel calculates $17 million went missing from Clinton Foundation financial reports. The New York Post recently reported Hillary’s former chief of staff and counselor, Cheryl Mills, “knows where the bodies are buried” in many Clinton scandals, has been at Hillary’s side since the 1990s and “has a long track record of hiding Clinton documents.” According to the Post, Hillary gave her the job of “identifying and preserving all emails that could potentially be federal records.” The Post added, “And, presumably, deleting.” Mills, who has officially been accused of perjury and obstruction of justice, is a key member of the Clinton Foundation board. \nimage: http://www.wnd.com/files/2013/11/Benghazi.jpg 20) Benghazi: 4 American lives lost On Sept. 11, 2012, while Hillary was secretary of state, Islamic militants attacked a U.S. special mission in Benghazi, Libya, and murdered U.S. Ambassador J. Christopher Stevens and U.S. Foreign Service Information Management officer Sean Smith. Two CIA contractors, Tyrone Woods and Glen Doherty, were also killed. In the months leading up to the attack, Hillary’s State Department cut security in Libya. Sen. Ron Johnson, R-Wis., accused Hillary of “dereliction of duty” that led to the deaths of the four Americans. “The State Department not only failed to honor repeated requests for additional security, but instead actually reduced security in Libya,” Johnson wrote in the Milwaukee Journal Sentinel . “Although no one can say with certainty, I firmly believe a relatively small contingent of armed military guards would have prevented the attack, and those four lives would not have been lost.” In “The REAL Benghazi Story: What the White House and Hillary Don’t Want You to Know,” New York Times bestselling author Aaron Klein provides shocking details about the central role Hillary Clinton actually played in the scandal As WND reported , a security decision finalized personally by Hillary may have unwittingly doomed the Americans in Benghazi. Hillary herself signed waivers that allowed the facility to be legally occupied, since it did not meet the minimum official security standards set by the State Department. The waiver legally allowed the CIA annex to be housed in a location about one mile from the U.S. special mission. According to accounts from Benghazi survivors, the delayed response time by those at the CIA annex may have cost the lives of Stevens and the three other Americans killed at the special mission. If the CIA annex had been co-located with the U.S. special mission, a rapid response team would have been on site during the initial assault in which Stevens was killed. Clinton’s waiver allowed the CIA annex to be housed at the separate location. As WND also reported , State Department emails show Clinton knew while the attack was under way that it was being carried out by terrorists. Judicial Watch has obtained previously classified documents from the U.S. Department of Defense and the Department of State revealing that DOD almost immediately reported that the attack on the U.S. Consulate in Benghazi, Libya, was planned and carried out by al-Qaida and Muslim Brotherhood-linked terrorists. A federal court ordered the government hand over more than 100 pages of previously secret documents that showed then-Secretary of State Hillary Clinton and other senior Obama officials were given reports within hours of the Sept. 11, 2012, attack. In those memos, the DOD described details of a plan 10 days in advance “to kill as many Americans as possible.” Nonetheless, Hillary falsely blamed it on “rage and violence over an awful Internet video” when she spoke at a ceremony at Andrews Air Force Base on Sept. 14, 2012, as the remains of the four Americans were returned to the U.S. To this day, Rep. Trey Gowdy, R-S.C., says the State Department has failed to comply with requests for information about Benghazi. \n21) Peter Franklin Paul: Another Hillary friend goes to prison As WND reported , Hillary was named in a lawsuit brought by Peter Franklin Paul for allegedly directing to her 2000 Senate campaign an illegal, in-kind contribution from Paul that included a fundraiser at the exclusive Spago restaurant in Beverly Hills, a tea hosted at the Beverly Hills home of socialite Cynthia Gershman and a lavish, A-list, million-dollar-plus Hollywood gala honoring Bill Clinton. At the trial of Clinton’s finance director for the 2000 senatorial campaign, David Rosen, the government told the jury Paul personally gave more than $1.2 million to produce the events. Paul, a former business partner of Spider-Man creator Stan Lee who sued Bill for fraud and accused Hillary of hiding nearly $2 million in Senate campaign donations, alleged they sabotaged the media company he formed with Lee to get out of a $17 million agreement made with Bill Clinton to serve as an international promoter for the company after he left the White House. Paul was indicted in June 2001 for manipulating the price of the stock in his company, Stan Lee Media, as it was collapsing. A judge determined Paul didn’t profit from the attempt to save his company, but he accepted a plea bargain and served three years in prison. WND reported in 2012 that Paul charged Attorney General Eric Holder and his Justice Department obstructed justice by reneging on a sentencing agreement. “Hillary is carrying out her promise to finally destroy my family to punish me for exposing the corruption that elected her to the Senate,” Paul told WND at the time. The Clintons were effusive in their praise of Paul until just days after an August 2000 Hollywood gala, when the Washington Post reported Paul’s 1970s criminal convictions in a story that accused the senator of being soft on crime. Clinton continued, however, to quietly solicit money from Paul and sent him letters expressing friendship . Paul has extensive video corroborating his contention he and Hillary spent hours together and sat next to each other at the fundraising events. \n22) Watergate: Fired for being a ‘liar’ Hillary actually played a role in the Watergate saga, and her actions as a young attorney may have set the tone for her career. The 27-year-old Clinton was fired from the staff of the House Judiciary committee investigating the Watergate scandal in 1974. She was fired by her supervisor, lifelong Democrat Jerry Zeifman, who called her a liar and much worse. “She was an unethical, dishonest lawyer,” he said. “She conspired to violate the Constitution, the rules of the House, the rules of the committee and the rules of confidentiality.” Zeifman also refused to give Clinton a letter of recommendation, making her one of only three employees he snubbed during his 17-year career. \nBonus! Gift-gate : Hillary blasted former Clinton adviser Dick Morris when he alleged in a New York Post article that the former first lady hadn’t disclosed “three or four” pricey handbags from designer Judith Leiber worth more than $3,000 each, five dresses received from the king of Morocco (one of which Hillary was seen wearing), a gold bracelet Chelsea Clinton accepted in India and other gifts Hillary was given during the Clinton administration. Morris wrote, “Hillary Clinton got many expensive and personal gifts during her eight years as first lady and never disclosed them.” A Clinton aide acknowledged the handbags were given to Hillary , but he said one was received before the inauguration, another was listed on a 1994 disclosure form and others were turned over to the National Archives. He said four dresses were returned to the king, and Hillary gave the fifth dress to the National Archives after she wore it. The aide claimed the bracelet was also sent to the National Archives. Read more at http://www.wnd.com/2015/05/here-they-are-hillarys-22-biggest-scandals-ever/#2ySX7WUrdsdbXfOg.99 \nHillary to Obama: ‘Call off your f—ing dogs!’ \n“Unlikeable: The Problem with Hillary,” by Ed Klein, alleges former Secretary of State Hillary Clinton screamed at President Obama to call off his “f–king dogs!” as her private server scandal exploded. Hillary Clinton allegedly barked at President Obama to call off his “f–king dogs” after it became obvious her private email server scandal wasn’t going to… Share this:", "external_links": [], "published": "2015-10-01T14:46:00.000+03:00", "crawled": "2015-10-01T16:37:51.648+03:00", "highlightTitle": ""}