{"organizations": [], "uuid": "ed2487fcfbdfd646a4ea5174100a7924cf65bb3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13571/political-news", "section_title": "Political News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30256141/justice-dept-to-name-coordinator-for-domestic-terror-cases", "country": "US", "title": "Justice Dept to name coordinator for domestic terror cases", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Justice Dept to name coordinator for domestic terror cases - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "ed2487fcfbdfd646a4ea5174100a7924cf65bb3f"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30256141/justice-dept-to-name-coordinator-for-domestic-terror-cases", "ord_in_thread": 0, "title": "Justice Dept to name coordinator for domestic terror cases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ERIC TUCKER\nAssociated Press WASHINGTON (AP) - The Justice Department is creating a new position to coordinate investigations into violent homegrown extremism, a department official said Wednesday.\nAssistant Attorney General John Carlin, head of the department's national security division, said that while the international terror threat occupies the public attention, federal officials remain just as concerned about the prospect of violence from Americans motivated by anti-government views and racist ideologies.\n\"We need to make sure we have the mechanisms in place so that we can continue to remain just as focused on the domestic terrorism threat while addressing the international terrorism threat,\" Carlin said in a question-and-answer session after a George Washington University speech.\nThe new position, the Domestic Terrorism Counsel, will serve as the main point of contact for U.S. Attorney offices nationwide and will work to identify trends across cases, help shape strategy and analyze legal gaps that need to be closed.\nCarlin's division in the last year has been heavily focused on the Islamic State, bringing roughly 60 cases to date tied to followers of the terror group.\nBut the speech Wednesday was an unusually blunt acknowledgment from the department's top national security official that Americans inspired by racial hatred - but without any ties to established terror groups - remain a \"clear and present danger\" to the public. He noted that more Americans have been killed in recent years in attacks by domestic extremists than in attacks associated with international terrorist groups.\nThough he said experts have identified commonalities among the Islamic State followers and domestic extremist groups, including their ability to attract disaffected individuals, the legal framework for dealing with them is intentionally different.\nThe Justice Department routinely charges Islamic State sympathizers with providing material support to foreign terror groups, though there's no comparable statute for aiding white supremacist organizations in part because of First Amendment concerns.\n\"To do that for a group here would mean, based on who the group is and what they're doing, that the entire group is designated as the terrorist group,\" he said.\n____\nFollow Eric Tucker on Twitter at http://www.twitter.com/etuckerAP\n ", "external_links": ["http://www.twitter.com/etuckerAP"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-16T06:48:34.261+03:00", "highlightTitle": ""}