{"organizations": [], "uuid": "677bf52957b01740d4178f2f7b25a7f10430b2ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "https://fellowshipofminds.files.wordpress.com/2015/10/nasa-blue-marble-1972-from-apollo-17-small.jpg?w=500&h=501", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/nasas-blue-marble-earth-is-a-fake-3061910.html", "country": "US", "title": "NASA’s “Blue Marble” Earth is a fake | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 5, "title_full": "NASA’s “Blue Marble” Earth is a fake | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T22:09:00.000+03:00", "replies_count": 5, "uuid": "677bf52957b01740d4178f2f7b25a7f10430b2ae"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/nasas-blue-marble-earth-is-a-fake-3061910.html", "ord_in_thread": 0, "title": "NASA’s “Blue Marble” Earth is a fake | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nWhen we think of Earth, this iconic image of the “Blue Marble” immediately comes to mind.\nWe’ll call the above image “Blue Marble I”.\nFrom Wikipedia :\nThe Blue Marble is a famous photograph of the Earth, taken on December 7, 1972, by the crew of the Apollo 17 spacecraft , at a distance of about 45,000 kilometers (28,000 miles). It is one of the most iconic, and among the most widely distributed images in human history….\nThe image is one of the few to show an almost fully illuminated Earth disk (slightly gibbous), as the astronauts had the Sun behind them when they took the image. To the astronauts, Earth had the appearance and size of a glass marble, hence the name.\nThe photograph was taken about 5 hours and 6 minutes after launch of the Apollo 17 mission, and about 1 hour 54 minutes after the spacecraft left its parking orbit around the Earth, to begin its trajectory to the Moon.\nOr maybe that’s not the Blue Marble you have in mind. Maybe it’s this iconic image of a more vividly-colored Blue Marble which was released by NASA in 2002. Let’s call it “Blue Marble II”.\nBlue Marble II is so familiar to us in part because it was the default image on the first iPhone.\nBut some sharp-eyed geeks discovered “anomalies” in Blue Marble II, specifically duplicate clouds, as you can see in a cropped section of Blue Marble II (below):\nThe discovery of duplicate clouds has led to accusations that not only is the 2002 image (Blue Marble II) a fake, the original Apollo 17 image (Blue Marble I) was likely a fake as well. That, in turn, has led some to question whether everything NASA did and said was fake. See, for example, this post from Plane Not A Planet blog.\nThe problem is that, in the years after the first Blue Marble photo was taken by Apollo 17, NASA has released many Blue Marbles, “Blue Marble II” being one of the best known and most popular.\nAs NASA explains about the 2002 “Blue Marble II”:\nMetadata\nData Date: February 8, 2002 Visualization Date: February 8, 2002 This spectacular “blue marble” image is the most detailed true-color image of the entire Earth to date. Using a collection of satellite-based observations, scientists and visualizers stitched together months of observations of the land surface, oceans, sea ice, and clouds into a seamless, true-color mosaic of every square kilometer (.386 square mile) of our planet. These images are freely available to educators, scientists, museums, and the public.\nMuch of the information contained in this image came from a single remote-sensing device-NASA’s Moderate Resolution Imaging Spectroradiometer, or MODIS. Flying over 700 km above the Earth onboard the Terra satellite, MODIS provides an integrated tool for observing a variety of terrestrial, oceanic, and atmospheric features of the Earth. The land and coastal ocean portions of these images are based on surface observations collected from June through September 2001 and combined, or composited , every eight days to compensate for clouds that might block the sensor’s view of the surface on any single day…. The cloud image is a composite of two days of imagery collected in visible light wavelengths and a third day of thermal infra-red imagery over the poles. Global city lights, derived from 9 months of observations from the Defense Meteorological Satellite Program, are superimposed on a darkened land surface map.\nIn other words, rendered in simple English, NASA is saying that the 2002 “Blue Marble II” is not a photo . Instead, the image is a COMBINATION and COMPOSITE of many “satellite-based observations” (whatever that means), which were “stitched together” (whatever that means) by scientists and “visualizers” (whatever that means).\nIn other words, Blue Marble II is a fake — which would explain the duplicate clouds.\nHere’s an admission by Robert Simmon , one of the “visualizers” who “stitched together” Blue Marble II, as related by David Yanofsky in his March 27, 2014 article for Quartz , “ The guy who created the iPhone’s Earth image explains why he needed to fake it “:\nAs it turns out, much of what one might assume about this beautiful image is not true…. It isn’t actually a photograph of earth. And that blackness surrounding it? That’s not space, either….\nSimmon, a data-visualizer and designer at NASA’s Earth Observatory , created the image in 2002. He told Quartz it’s not a photograph, but a sophisticated visualization.\nImages of the earth may seem commonplace, but there are actually very few pictures of the entire planet. The problem, Simmon said, is all the NASA earth-observing satellites are in low-earth or geostationary orbit, meaning none of them are far enough away to see a full hemisphere. The most familiar pictures of the entire Earth are from the 1960s and 1970s Apollo missions to the moon.\nAs realistic as it looks, the image is a composite of four months of light data collected in 2,300 km (1,429 mi) wide bands as NASA’s Terra satellite orbited from pole to pole, and the earth rotated beneath it.\nThat data was then stitched together and applied to the surface of a digital ball, then modified in Photoshop.\nSimmon readily admits there are numerous fakeries in his image. The atmosphere is Photoshop blur. Some of the clouds are collaged together using Photoshop’s clone tool to cover gaps in the satellite’s coverage. The black area around the earth is not the void of space. It is simply a background of black color that Simmon placed the earth on top of. (This is standard practice, Simmon says: most actual “photographs” of the earth—including the Apollo images—present the planet on a black background).\nWithout these alterations, the image wouldn’t look very earth-like. Simmon said he based his manipulations on reality, “in the sense that I’ve looked at a lot of imagery to see how thick should that be, how blue should that be.” But, he later added, “It’s more hyper-realistic than realistic.”\n“Without these alterations, the image wouldn’t look very earth-like.”\nThat’s a doozy of a sentence, because our visual images of earth all came from NASA in the first place as none of us has flown into space to actually see the entire Earth.\nGiven the admission that Blue Marble II is a fake, we have every reason to wonder about other NASA fakeries and lies, such as the 1986 Challenger explosion (see “ Are the crew members of 1986 Space Shuttle Challenger still alive? ”) and whether those photos taken on the Moon are real.\n~Éowyn", "external_links": ["http://www.nasa.gov/centers/goddard/about/people/RSimmon.html", "http://feeds.wordpress.com/1.0/comments/fellowshipofminds.wordpress.com/123445/", "http://fellowshipofminds.wordpress.com//feed/https://fellowshipofminds.files.wordpress.com/2015/10/blue-marble-on-iphone.png", "http://feeds.wordpress.com/1.0/gocomments/fellowshipofminds.wordpress.com/123445/", "https://fellowshipofminds.files.wordpress.com/2015/10/blue-marble-on-iphone.png?w=500", "http://modis.gsfc.nasa.gov/data/", "http://pixel.wp.com/b.gif?host=fellowshipoftheminds.com&#038;blog=11081320&#038;post=123445&#038;subd=fellowshipofminds&#038;ref=&#038;feed=1", "http://terra.nasa.gov/", "http://fellowshipofminds.wordpress.com//feed/https://fellowshipofminds.files.wordpress.com/2015/10/nasa-blue-marble-1972-from-apollo-17-small.jpg", "http://earthobservatory.nasa.gov/", "http://qz.com/192700/the-guy-who-created-iphones-earth-image-explains-why-he-needed-to-fake-it/", "http://fellowshipofminds.wordpress.com//feed/https://en.wikipedia.org/wiki/The_Blue_Marble", "http://aplanetruth.info/2015/10/05/nasa-blinks-again-still-where-are-the-billions-of-stars/#more-1412", "https://fellowshipofminds.files.wordpress.com/2015/10/2002-blue-marble-anomalies.png?w=500&#038;h=313", "https://fellowshipofminds.files.wordpress.com/2015/10/nasa-blue-marble-2002.jpg?w=500&#038;h=500", "http://fellowshipoftheminds.com/2015/04/30/are-the-crew-members-of-1986-space-shuttle-challenger-still-alive/", "http://visibleearth.nasa.gov/view.php?id=57723", "http://fellowshipofminds.wordpress.com//feed/https://fellowshipofminds.files.wordpress.com/2015/10/2002-blue-marble-anomalies.png", "https://fellowshipofminds.files.wordpress.com/2015/10/nasa-blue-marble-1972-from-apollo-17-small.jpg?w=500&#038;h=501", "http://modarch.gsfc.nasa.gov/", "http://fellowshipofminds.wordpress.com//feed/https://fellowshipofminds.files.wordpress.com/2015/10/nasa-blue-marble-2002.jpg"], "published": "2015-10-06T22:09:00.000+03:00", "crawled": "2015-10-07T21:56:52.999+03:00", "highlightTitle": ""}