{"organizations": ["Political Comment Police"], "uuid": "48ee6e69caa9d3ed1c53f1cd3b0fc80374cb6bc9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/3842105/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://www.heraldscotland.com/politics/political_news/13798208.Police_spying_report_into_journalists_completed/?ref=rss", "country": "", "title": "Police spying report into journalists completed", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Police spying report into journalists completed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T19:31:00.000+03:00", "replies_count": 0, "uuid": "48ee6e69caa9d3ed1c53f1cd3b0fc80374cb6bc9"}, "author": "", "url": "http://www.heraldscotland.com/politics/political_news/13798208.Police_spying_report_into_journalists_completed/?ref=rss", "ord_in_thread": 0, "title": "Police spying report into journalists completed", "locations": ["Scotland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Mainz"], "text": "Political Comment Police spying report into journalists completed Stirling - March 30: A general view of the new Police Scotland sign outside the Stirling Police HQ March 30, 2013 in Stirling. (Photo by Mark Mainz) (40466739) 0 comments \nTHE UK surveillance watchdog has finished its report into allegations Police Scotland unlawfully spied on journalists’ sources. \nHowever, Holyrood’s Justice Committee has been told that a final determination cannot be made as a special Commissioner for spying legislation is not currently in post. \nSince March 25th, police forces have been required to get judicial approval before using the Regulation of Investigatory Powers Act (RIPA) to flush out a reporter’s source. \nLoading article content \nThe law change was pushed through following human rights concerns over police officers using the legislation in this way on hundreds of occasions. \nIn July, the Interception of Communications Commissioner’s Office (IOCCO) announced that two unnamed forces had breached the new Code of Practice. \nThe Sunday Herald, the Herald’s sister newspaper, revealed that Police Scotland was one of the transgressors. \nHowever, the single force and the Scottish Government have refused to comment on the grounds that the IOCCO was continuing its investigation into the breaches. \nThe Justice Committee expressed a desire to launch a probe of its own and wrote to the IOCCO seeking clarification of when its report would be issued. \nIn response, the IOCCO said “historically” its inquiries took between three and six months. \nCommittee convener Christine Grahame said, if the allegations are true, she wanted to “publicly hold the body responsible to account as soon as practicably possible”. \nIn another letter to the Committee, published today, IOCCO head Joanna Cavan said the watchdog had completed its investigations and conclusions have been prepared for the Commissioner. Share article \nHowever, she added that a Commissioner was not in post and so the matter could not be progressed, a delay she described as “incredibly frustrating”. \nShe added: “We do expect this to be resolved very shortly - within a matter of weeks. At present however our hands are tied as until we have a determination from the Commissioner we cannot complete the inquiry.” Promoted Stories", "external_links": [], "published": "2015-10-01T19:31:00.000+03:00", "crawled": "2015-10-01T22:02:46.664+03:00", "highlightTitle": ""}