{"organizations": [], "uuid": "8466904e948c422ddc9288d081c6d0c0d6537080", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westword.com", "main_image": "http://images1.westword.com/imager/u/original/7206065/charles.sattler.1.800.cropped.jpg", "site_section": "http://www.westword.com/news", "section_title": "Denver, Colorado News: Politics, Crime, Sports, Marijuana and Education Journalism | Westword", "url": "http://www.westword.com/news/ex-mma-fighter-chuck-sattler-not-guilty-of-killing-blake-bostic-over-hot-sauce-7206064", "country": "US", "title": "Ex-MMA Fighter Charles Sattler Not Guilty of Killing Blake Bostic Over Hot Sauce", "performance_score": 0, "site": "westword.com", "participants_count": 1, "title_full": "Ex-MMA Fighter Charles Sattler Not Guilty of Killing Blake Bostic Over Hot Sauce | Westword", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T13:47:00.000+03:00", "replies_count": 0, "uuid": "8466904e948c422ddc9288d081c6d0c0d6537080"}, "author": "Michael Roberts", "url": "http://www.westword.com/news/ex-mma-fighter-chuck-sattler-not-guilty-of-killing-blake-bostic-over-hot-sauce-7206064", "ord_in_thread": 0, "title": "Ex-MMA Fighter Charles Sattler Not Guilty of Killing Blake Bostic Over Hot Sauce", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Charles \"Chuck\" Sattler in a photo from an online fundraiser created last year on his behalf. Additional images below. YouCaring.com From the beginning, it was a bizarre case.\nAs we reported in May 2014, Charles \"Chuck\" Sattler , a former semi-professional mixed-martial arts fighter, was accused of punching to death a much larger man: six-foot-nine-inch Blake Bostic , a popular chef who worked restaurants in Summit County.\nThe argument was reportedly spurred by a disagreement over some hot sauce.\nA lot's happened between now and then. An attempt to find Sattler guilty of second-degree murder resulted in a hung jury this past June, so prosecutors retried him on manslaughter and first-degree assault charges. Now, however, a new jury has found Sattler not guilty on all counts.\nThe jurors' conclusion: Sattler was merely defending a friend who was being beaten by Bostic — and his punches just happened to be lethal.\nIn our original post , we noted that Sattler hails from Michigan, where friends organized an online fundraiser that collected more than $2,000 on his behalf. An introduction on the item reads in part, \"This...is all for Chuck.... I love you, man.\"\nBlake Bostic. File photo Likewise, Bostic was well-liked in his community. The Summit County Journal Quote: d numerous pals and colleagues referring to Bostic as a \"gentle giant.\"\nWhat happened leading up to his death?\nAt about 2:20 a.m. on April 14, according to an arrest affidavit obtained by the Vail Daily , Frisco Police Department personnel responded to the town's Snowshoe Motel on a report of a fight in progress.\nRelated Stories Did semi-pro fighter Charles Sattler kill chef Blake Bostic over hot sauce? Upon their arrival, they found a man later identified as Bostic laying in the Snowshoe's rear parking lot. Before long, he was found to have died as a result of his injuries.\nThe Summit County coroner subsequently determined the cause of death as a result of blunt force trauma to his head and neck — the sort of injuries typically associated with a physical altercation.\nThe Snowshoe Motel in Frisco. Google Maps A second man, Ryan Stevens, was on top of Bostic when the cops turned up. The Daily notes that he \"appeared intoxicated and also displayed signs of recovering from being recently knocked unconscious.\"\nA short time later, Sattler and a man identified as Charles Upchurch approached officers working the scene. The affidavit Quote: s them as saying the men had encountered the other twosome at a Frisco restaurant called Ollie's Pub & Grub before heading to the Snowshoe, where Sattler and Upchurch were staying, to drink and smoke some marijuana.\nThere, a fight broke out, and while the document doesn't offer specifics, Sattler mentioned Bostic selling Upchurch what's described as \"several bottles of homemade habanero hot sauce or jelly.\"\nThe affidavit's narrative says Sattler told investigators, \"The jelly is what started this whole thing.\"\nSattler, for his part, insisted that he'd acted in self-defense. But he also mentioned that he \"hits like a champ,\" noting to Upchurch at one point, \"I do damage when I hit somebody, huh?\"\nCharles Sattler's mug shots. File photos The affidavit says Upchurch then turned to the officers. \"Don't you know who this is?\" he asked before providing the answer: \"That's Chuck Sattler. He's a pro fighter.\"\nThe Daily amends that to \"semi-professional.\" However, press clippings from 2002 describe him as having been named the light heavyweight division winner in the Toughman World Championship series.\nLater, officers asked Sattler if he'd punched Bostic or Stevens. His reply, as recorded in the affidavit: \"I could have hit them. I know I hit the big dude and after that, who knows. I snapped. If I snapped, I don't know what the (expletive) I did.\"\nIn the end, Upchurch avoided charges. However, Sattler was cuffed, jailed and accused of second-degree murder and third-degree assault.\nThe first jury that was presented this evidence found the circumstances too muddy to convict Sattler — hence the hung jury. And in the retrial, Sattler's attorney, public defender Thea Reiff, again argued that Sattler didn't strike out until after Bostic began pummeling Upchurch.\nA 2011 Facebook photo of Blake Bostic. Facebook “These poor men were getting along,\" the Summit Daily Quote: s Reiff as saying in court earlier this week. \"This was not some situation where there was some longstanding argument or planned assault. There was some offhand comment about some hot sauce, and immediately it turns. It’s as much of a mystery to them as it probably is to you.\nAs for Sattler's actions, Reiff maintained that \"he saw his friend, who was nearly a foot shorter than Mr. Bostic, and about sixty pounds lighter, being hit over the head, over and over and over. He was knocked unconscious after two punches, and Bostic didn’t stop.”\nProsecutors stressed that Sattler didn't either once he began attacking Bostic. But at about 4 p.m. yesterday , jury number two found in Sattler's favor. The Daily 's account points out that Sattler's family members burst into tears.\nToday, after 535 days behind bars, Sattler is free.\nContact: Michael Roberts Follow: Michael Roberts Westword Westword", "external_links": ["https://www.youcaring.com/other/charles-sattler-needs-us-/166394", "http://www.summitdaily.com/news/18450768-113/breaking-charles-sattler-found-not-guilty-on-all", "https://www.facebook.com/pages/Michael-RobertsWestword/111180895657427", "http://poststar.com/sports/local/mistake-costs-scarincio-shot-at-glory/article_12f8bdec-a37e-5c69-a8ef-5c9c8565edf5.html", "http://www.summitdaily.com/news/18435258-113/retrial-of-charles-sattler-decision-in-assault-case", "https://www.facebook.com/DenverWestword", "http://www.summitdaily.com/news/11081327-113/bostic-summit-frisco-motion", "http://www.vaildaily.com/news/11394415-113/dance-sattler-records-officers", "http://photos.mlive.com/baycitytimes/2013/12/toughman_finals_4_ws.html", "http://www.twitter.com/denverwestword"], "published": "2015-10-02T13:47:00.000+03:00", "crawled": "2015-10-02T18:23:33.973+03:00", "highlightTitle": ""}