{"organizations": [], "uuid": "bbebf2cbbe74c12f02438261e2482204c44d29ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/09/30/381075-lynch.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/india/report-after-mob-lynches-man-for-eating-beef-national-minorities-commission-seeks-report-from-dm-2130521", "country": "SG", "title": "After mob lynches man for 'eating beef', National Minorities Commission seeks report from DM", "performance_score": 0, "site": "dnaindia.com", "participants_count": 8, "title_full": "After mob lynches man for 'eating beef', National Minorities Commission seeks report from DM | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:43:00.000+03:00", "replies_count": 10, "uuid": "d5c5c3487c1608db0c7ecc1b3c5dddbb05bdda18"}, "author": "PTI", "url": "http://www.dnaindia.com/india/report-after-mob-lynches-man-for-eating-beef-national-minorities-commission-seeks-report-from-dm-2130521#post-0", "ord_in_thread": 0, "title": "After mob lynches man for 'eating beef', National Minorities Commission seeks report from DM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Representational Image dna Research & Archives Taking a strong note of the Dadri incident, National Commission for Minorities (NCM) on Wednesday sought a report from the district administration, after which it would take up the matter with Union Home Minister Rajnath Singh and Uttar Pradesh Chief Minister Akhilesh Yadav.\nResponding to concerns expressed by lawyer-activist Shehzad Poonawalla, the Commission stated it was monitoring the measures being taken by the district administration to bring the perpetrators of the \"ghastly\" crime to justice.\n\"The NCM strongly condemns this cowardly and reprehensible attack on an innocent Muslim which also resulted in severe injury to his 23-year-old son.\n\"The Chairman, NCM has already spoken to DM, Dadri and asked him to send a report on the incident to the NCM at the earliest. After receipt of the report, we will be taking up the matter with both the Union Home Minister and the Chief Minister. It will also be discussed in the next weekly meeting of NCM,\" Commission member Praveen Davar said.\nBatting for stringent punishment to the guilty, Davar said the incident shown communalism \"in its ugliest manifestation\" and \"cannot, and must not, go unpunished in a secular nation\". Earlier, in his petition to the NCM, the Centre and the state government, Poonawalla had sought \"immediate\" action against the perpetrators.\nHe demanded that the Commission issue direction for registration of an FIR against the perpetrators and their arrest. The lawyer-activist, also a founder-member of think-tank Policy Samvad, demanded the Commission to ensure that probe into the matter is carried out in a free, fair and impartial manner.\n\"The Ministry of Home Affairs must take cognisance of such communal incidents being done by certain elements to create social disharmony in the county to ensure that 'Sabka Sath, Sabka Vikas' doesn't become a mere slogan,\" he said.\nFifty-year-old Mohammad Iqlakh was allegedly beaten to death and his son, Danish, left severely injured by a mob on Monday night following rumours that his family consumed beef in a village in Dadri town of Uttar Pradesh. Danish (22) is undergoing treatment at a hospital. An FIR has been filed against 10 people for attacking the family, six of whom were arrested, police said.", "external_links": [], "published": "2015-09-30T19:43:00.000+03:00", "crawled": "2015-10-01T00:11:08.117+03:00", "highlightTitle": ""}