{"organizations": [], "uuid": "0c173061bced9f3d758deb200f25e3a0594d2919", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/0c/ef/a8e0ce8348e6ad54a1cc97b4ac2b/151006-taliban-editorial.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/06/in-afghanistan-taliban-and-kunduz-present-harsh-truths-for-obama", "country": "US", "title": "In Afghanistan, Taliban and Kunduz Present Harsh Truths for Obama", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "In Afghanistan, Taliban and Kunduz Present Harsh Truths for Obama - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "0c173061bced9f3d758deb200f25e3a0594d2919"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/06/in-afghanistan-taliban-and-kunduz-present-harsh-truths-for-obama", "ord_in_thread": 0, "title": "In Afghanistan, Taliban and Kunduz Present Harsh Truths for Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Afghanistan, Taliban and Kunduz Present Harsh Truths for Obama Taliban offensive at Kunduz combined with catastrophic hospital bombing tells Obama all he needs to know about Afghanistan. Afghanistan's security forces take their position during a clash with Taliban fighters on a highway near the city of Kunduz in Afghanistan, on Sept. 1, 2015.\nBy Paul D. Shinkman Oct. 6, 2015 | 2:54 p.m. EDT + More The Taliban has the ability to seize control of a city as big as Kunduz without Washington or its patrons in Kabul anticipating it. Afghan forces do not have the ability to conduct their own airstrikes, instead relying on the U.S., which most recently resulted in a catastrophic outcome . And the death of the Taliban’s symbolic leader does not seem to have fractured the insurgent network, but rather prompted his chosen successor to prove his ability to plan and execute fearsome offensives.\n2015 was supposed to serve as the bellwether in Afghanistan for whether the U.S. could leave its longest war and hand security for the perennially embattled nation off to its fledgling government. For anyone actually keeping score, it doesn’t look good.\nGen. John Campbell, the top U.S. officer for the war in Afghanistan, told Congress Tuesday he had provided the White House with options to change the plan President Barack Obama announced in 2014, which would reduce the U.S. troop presence after the end of 2016 down to less than a thousand at the embassy in Kabul. There, its duties would be limited to advising the central government and managing U.S. support, and would be stripped of any ability to conduct counter-terror operations or any other unilateral action.\nAs Campbell told the Senate Armed Services Committee, “since that decision was made in 2014, a lot has changed.”\nRELATED\nU.S. Changes Story on Deadly Doctors Without Borders Strike in Kunduz The need for a new White House plan follows a major black eye for the security effort in Afghanistan, following this year of tough results on the ground. Campbell confirmed Tuesday an errant U.S. airstrike over the weekend that killed dozens of medical workers and patients at a Doctors Without Borders facility in Kunduz was a “mishap” and a mistake. He again changed the Pentagon line saying U.S. special operations controllers on the ground nearby called in the airstrike after receiving a request from Afghan forces engaged in fighting with Taliban insurgents.\nCampbell refuted a claim from Doctors Without Borders that the U.S. may have intentionally targeted the hospital believing the Taliban was using it as a fighting position.\n“The decision to provide aerial fires was a U.S. decision made within the U.S. command,” he said. “A hospital was unintentionally struck.”\nThe U.S. would never willingly target such a building, Campbell said, contrasting that against what he calls routine Taliban tactics.\n“They target civilians. There’s a difference between targeting civilians and what happened at the hospital,” he said.\nThe desperation to retake Kunduz from a surprise Taliban attack highlights everything the Afghan military lacks, chiefly an air force, intelligence, an ability to command and control its own forces deftly and to mass significant numbers of forces in an area where they’re needed most.\nAfghan security forces and volunteer militias take a rest on their way to Kunduz, Afghanistan to fight against Taliban insurgents.\nIt also undercuts any argument that the hardline network has been weakened in recent month, particularly following the death of its spiritual leader Mullah Omar. Reporting emerged in July of this year the group had successfully kept his 2013 death a secret, calling into question whether lower level followers would accept Mullah Akhtar Mohammad Mansour as his chosen successor. Mansour’s ability to organize and execute the Kunduz offensive, however, proves the Taliban could attack anywhere within Afghanistan with effectiveness.\nIndeed, Campbell on Tuesday said the Taliban is now receiving money and weapons directly from Iran, and has solidified its ability to fund itself through narcotics trafficking, smuggling and kidnapping. This past year was a general exception to the usual fighting tempo, with continued combat taking place throughout the winter months when fighters have previously returned home or holed up while their mountain supply routes are snowed in.\nCampbell attributed governmental security failures to poor leadership and overworked police forces on the ground, and said the U.S. must capitalize on new opportunities presented by the cooperativeness of the Ghani government.\nRELATED\nRussia Begins Airstrikes in Syria as it Attempts to Overshadow Struggling U.S.-Led War “This is our best opportunity,” he said. “We haven’t had a government like this that reached out to not only the U.S. but the international community.”\nHe also claimed the Islamic State group has bolstered its presence inside the country, as the government under new President Ashraf Ghani has claimed for months. Called Islamic State, Khorasan Province or ISKP, Campbell said the presence has grown from what he described as “nascent” in February to “operationally emergent” now.\nThe general came about as close as any military man can to saying the current U.S. plan needs to change.\n“I do believe we have to provide our senior leadership options different than the current plan that we’re going with,” Campbell said.\nAnd some form of change to the U.S. finally ending its Afghanistan war looks as likely now as ever before.\n“Among analysts and think-tankers and even people on [Capitol Hill], there’s a real consensus that the decision needs to be revised,” says Scott Smith, director of the Afghanistan and Central Asia program at the U.S. Institutes of Peace. He observed that nobody on the dais at the Tuesday hearing appeared to advocate against some form of residual force. “Some of us wish it was going to be revised earlier. Now it looks like a panicked reaction to the fall of Kunduz, rather than an affirming gesture of support to the Afghan government.”\nWithdrawing from Afghanistan now would also make it exponentially harder to ever return, Smith adds, much more so than Iraq. Afghanistan is landlocked, and the U.S. presence there requires an extensive menu of international negotiations and treaties governing, among other things, logistics routes in and out. All of this seems to reach the obvious conclusion that the U.S. must change its plan to disengage militarily from Afghanistan, as it did in Iraq allowing for the precipitous rise of the Islamic State group.\nRELATED\nTaliban Names Successor to Mullah Omar, Delays Peace Talks “Right now, I’d be surprised if it didn’t,” Smith says.\nThe original plan for withdrawing from Afghanistan had called for a force of 10,000 at the beginning of this year to shrink down to fewer than 5,000, and on down to zero combat forces by December. Obama amended that slightly in March in joint remarks with Ghani, citing the sluggishness of the Afghan security forces in operating on their own.\nMuch of the plan to withdraw forces centers around simple math, or “physics” as Campbell indicated Tuesday. Combat forces require exponentially more support troops to feed them, maintain their equipment, organize supplies to be brought in and, perhaps most pressingly, protect themselves. Removing military equipment from a landlocked country like Afghanistan also represents a leviathan effort requiring months of advanced planning and execution.\nCampbell said Tuesday a force of 5,000 or fewer by this year would require him to have to close major U.S. military hubs in key corners of Afghanistan, including Jalalabad and Kandahar. According to this current plan, he would also likely have to close Bagram Forward Air Base near Kabul -- a sprawling combat air base, special operations headquarters and logistics hub considered the critical lifeline for the U.S. military effort.\n“We have had to close hundreds and hundreds of bases,” he said. “Every day we ‘descope.’”\nHe added, “I have not reached the point where if a decision is made to keep Bagram, that is irreversible.”\nTAGS: Taliban terrorism Obama, Barack Afghanistan military", "external_links": ["http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdy63k%3Fsrc=usn_su", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdy63k%3Fsrc=usn_tw&via=usnews&text=In%20Afghanistan%2C%20Taliban%20and%20Kunduz%20Present%20Harsh%20Truths%20for%20Obama", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdy63k%3Fsrc=usn_rd&title=In%20Afghanistan%2C%20Taliban%20and%20Kunduz%20Present%20Harsh%20Truths%20for%20Obama", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdy63k%3Fsrc=usn_gp", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdy63k%3Fsrc=usn_li&title=In%20Afghanistan%2C%20Taliban%20and%20Kunduz%20Present%20Harsh%20Truths%20for%20Obama&summary=Taliban%20offensive%20at%20Kunduz%20combined%20with%20catastrophic%20hospital%20bombing%20tells%20Obama%20all%20he%20needs%20to%20know%20about%20Afghanistan.&source=U.%20S.%20News", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdy63k%3Fsrc=usn_fb"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-06T22:41:17.264+03:00", "highlightTitle": ""}