{"organizations": ["Associated Press", "Congress"], "uuid": "e6978efa14c58f8c81b7bf33878cf97c62894b9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/53/5b/JN_Facebook_Icon.png", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/top-news/white-house-says-congress-must-act-to-help-puerto-/nn7Q2/", "country": "US", "title": "White House presses Congress to act on Puerto Rico", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "White House presses Congress to act on Puerto Rico", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:26:00.000+03:00", "replies_count": 0, "uuid": "e6978efa14c58f8c81b7bf33878cf97c62894b9b"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/white-house-says-congress-must-act-to-help-puerto-/nn7Q2/", "ord_in_thread": 0, "title": "White House presses Congress to act on Puerto Rico", "locations": ["WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MARTIN"], "text": "Updated: 7:27 a.m. Thursday, Oct. 22, 2015 | Posted: 7:26 a.m. Thursday, Oct. 22, 2015 White House presses Congress to act on Puerto Rico By MARTIN CRUTSINGER The Associated Press WASHINGTON — \nThe Obama administration on Thursday will take a blueprint for the economic rescue of Puerto Rico before a Republican controlled Congress dedicated to driving down government spending. \nThe administration said that it needs the cooperation of Congress to prevent an economic disaster in the U.S. territory, which is mired in a years-long recession. \nU.S. Treasury Secretary Jacob Lew, along with National Economic Council Director Jeff Zients, and Health and Human Services Secretary Sylvia Mathews Burwell, released a joint statement late Wednesday imploring Congress act. \nThe administration said it has done all that it can to help Puerto Rico through its crisis. \n\"Only Congress has the authority to provide Puerto Rico with the tools required to lay the foundation for the Commonwealth's recovery, and Congress must act,\" the joint statement read. \nThe administration proposed a four-step program that calls on Congress to approve restructuring of Puerto Rico's debt burden and then provide oversight for a credible recovery plan. The plan also calls for reforms to Puerto Rico's Medicaid program. \nThe administration says that without congressional action Puerto Rico will face a \"long and difficult recovery that could have harmful consequences for the residents on the island and beyond.\" \nThe administration proposal, if approved by Congress, would give Puerto Rico a way to restructure its $72 billion in debt. On Wednesday, Puerto Rico's Government Development Bank announced it was ending talks with a group of bondholders without reaching a deal on debt restructuring. \nThe administration's plan is scheduled to be presented on Thursday to the Senate Energy and Natural Resources Committee, which has jurisdiction over Puerto Rico and America's other territories. \nIn addition to debt restricting, the administration said Congress needs to approve reforms to the island's Medicaid program for poor people to provide better access to healthcare and also provide low-income residents of Puerto Rico with access to the Earned Income Tax Credit. Copyright The Associated Press", "external_links": [], "published": "2015-10-22T14:26:00.000+03:00", "crawled": "2015-10-23T00:45:00.908+03:00", "highlightTitle": ""}