{"organizations": [], "uuid": "a9b58c944fe0b9f5e4c9d7f40a5f9ee6ad8f4b7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/today/photo/18974807-standard.jpg", "site_section": "http://impact.oregonlive.com/politics/atom.xml", "section_title": "Politics & Elections", "url": "http://www.oregonlive.com/today/index.ssf/2015/10/government_corruption_is_now_o.html", "country": "US", "title": "Government corruption is now Americans' greatest fear, passing traditional nightmares: survey", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Government corruption is now Americans' greatest fear, passing traditional nightmares: survey", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:07:00.000+03:00", "replies_count": 0, "uuid": "a9b58c944fe0b9f5e4c9d7f40a5f9ee6ad8f4b7a"}, "author": "Douglas Perry | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/today/index.ssf/2015/10/government_corruption_is_now_o.html", "ord_in_thread": 0, "title": "Government corruption is now Americans' greatest fear, passing traditional nightmares: survey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Communists had a good, long run at the top. Then Islamic terrorists took over. All the while economic collapse hung around, looking for an opportunity to jump to the fore. \nBut now Americans have a new greatest fear: the corruption of government officials. \nTo be sure, there's always been government corruption, and only the crooks have been happy about it. But in the past Americans didn't believe it was all-pervasive and couldn't be controlled. \nNow they do, according to a survey by Chapman University researchers , who asked more than 1,500 Americans to rate \"their level of fear about 88 different fears across a huge variety of topics.\" \nFifty-eight percent of the survey takers listed corruption of government officials as their number one fear, beating out cyber-terrorism (44.8 percent) and corporate tracking of personal information (44.6 percent). Fear of terrorist attack is down to fourth. Fear of economic collapse has fallen to eighth. \nWhat's the reason government corruption leads the fear ranking? That was beyond the survey's purview, but an educated guess might land on the Tea Party effect. (Gun control is 11th on the fear list, way above any crime, like mugging or murder.) \nNew York Times columnist David Brooks, a conservative, created a stir this week by calling out Republicans for their intentional governing incompetence. GOP cant over the past few decades has focused on the idea that government is corrupt by definition, that government must be all but eliminated if we want to hold onto our constitutional freedoms. \"Hierarchy and authority were equated with injustice,\" Brooks wrote of the new Republican orthodoxy. \"Self-expression became more valued than self-restraint and coalition building. A contempt for politics infested the Republican mind.\" He pointed out that these Republican \"revolutionaries\" frequently made their point by comparing the U.S. government to Nazi Germany. The very idea of corruption expanded, so that now \"compromise is corruption.\" \nIt looks like that message has now reached far beyond the Republican echo chamber. In 2015, government corruption is the reigning bogeyman in America. \nNot all is lost for traditionalists, however. Some fears still haven't changed. Communism doesn't make our list of nightmares anymore, but clowns still do, coming in at number 85. \n-- Douglas Perry", "external_links": [], "published": "2015-10-15T19:07:00.000+03:00", "crawled": "2015-10-15T21:52:36.955+03:00", "highlightTitle": ""}