{"organizations": [], "uuid": "113ef3f701d0d0c3f10fa1500f33535490fd9fd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/a1/a1/a1d0164b4bb38d6289d76e0bcf0d/20150921-ben-carson-gty-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/ben-carson-debt-ceiling-marketplace-interview-214547", "country": "US", "title": "Ben Carson stumbles on debt limit question", "performance_score": 2, "site": "politico.com", "participants_count": 7, "title_full": "Ben Carson stumbles on debt limit question - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:22:00.000+03:00", "replies_count": 8, "uuid": "991d9b0584856d2a9e59a5f09e139400b73de813"}, "author": "Todd S. Purdum", "url": "http://www.politico.com/story/2015/10/ben-carson-debt-ceiling-marketplace-interview-214547#post-0", "ord_in_thread": 0, "title": "Ben Carson stumbles on debt limit question", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Carson appeared to have some difficulty in explaining exactly whether he would support raising the debt limit in a recent interview. \"Let me put it this way: if I were the president, I would not sign an increased budget. Absolutely would not do it. They would have to find a place to cut,\" Carson insisted in a Wednesday segment with Kai Ryssdal of the American Public Radio program \"Marketplace.\"\nRyssdal pressed: \"To be clear, it's increasing the debt limit, not the budget, but I want to make sure I understand you. You'd let the United States default rather than raise the debt limit.\"\n\"No, I would provide the kind of leadership that says, 'Get on the stick guys, and stop messing around, and cut where you need to cut, because we're not raising any spending limits, period,'\" Carson asserted.\n\"I'm really trying not to be circular here, Dr. Carson, but if you're not gonna raise the debt limit and you're not gonna give specifics on what you're gonna cut, then how are we going to know what you are going to do as president of the United States?\" Ryssdal asked.\nCarson then tried to explain what he meant in a different way, saying that if \"in fact, we have a number of different areas that are contributing to the increasing expenditures and the continued expenditures that are putting us further and further into the hole. You're familiar I'm sure with the concept of the fiscal gap.\"\nAsked to elaborate, Carson responded thusly: \"OK, well, the fiscal gap is all of the unfunded liabilities that the government owes. Medicare, Medicaid, Social Security, all the departmental programs, all the agency and sub-agency programs extending into the future, which is a lot of money, versus the amount of revenue that we expect to collect from taxes and other revenue sources. Now if we're being fiscally responsible, those numbers should be fairly close together. If we're not, a gap begins to occur.\n\"We bring that forward to modern day today's dollars, and that's the fiscal gap, which sits at over $200 trillion and is continuing to grow. Now the only reason that we can sustain that kind of debt is because of our artificial ability to print money, to create what we think is wealth, but it is not wealth, because it's based upon our faith and credit,\" he went on to say. \"You know, we decoupled it from the domestic gold standard in 1933, and from the international gold standard in 1971, and since that time, it's not based on anything. Why would we be continuing to do that?\"\n<div", "external_links": [], "published": "2015-10-08T14:22:00.000+03:00", "crawled": "2015-10-08T14:53:01.519+03:00", "highlightTitle": ""}