{"organizations": [], "uuid": "c4e928609c4277107f722fd347cd848f3565b7d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-e094610631b5a6bffe69ec1f6a6299ac.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/cruz-hits-dems-on-immigration-with-whom-do-you-stand/article/2574505?custom_click=rss", "country": "US", "title": "Cruz hits Dems on immigration: 'With whom do you stand?'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Cruz hits Dems on immigration: 'With whom do you stand?' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:53:00.000+03:00", "replies_count": 0, "uuid": "c4e928609c4277107f722fd347cd848f3565b7d1"}, "author": "Pete Kasperowicz", "url": "http://www.washingtonexaminer.com/cruz-hits-dems-on-immigration-with-whom-do-you-stand/article/2574505?custom_click=rss", "ord_in_thread": 0, "title": "Cruz hits Dems on immigration: 'With whom do you stand?'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sen. Ted Cruz, R-Texas, on Tuesday challenged Democrats to support a bill that would punish cities that don't adhere to federal immigration laws, and said today's vote on the bill will let voters see if Democrats favor illegal immigrants over Americans.\n\"For every Democratic senator, this vote today is a simple decision: With whom do you stand?\" Cruz said on the Senate floor. \"Do you stand with the violent, criminal illegal aliens who are being released over and over again?\"\nThe bill would block federal funding to any of the more than 200 cities around the country that have decided not to follow federal immigration laws and guidance. Republicans say San Francisco's status as a so-called \"sanctuary city\" was a major factor in the death of Kate Steinle, who was shot by an illegal immigrant who had just been released, even as the federal government was asking the city to hold him.\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ Cruz said Democrats have said they want to rein in or even prohibit cities from ignoring federal law, but said today's vote would likely show that Democrats oppose the idea of actually cracking down on these cities.\nMore from the Washington Examiner Rubio on Crist: 'Some people can't live without' running for office \"I'll let the voters in that area decide. I think they know we don't need more of Charlie Crist.\"\nBy Al Weaver • 10/20/15 5:24 PM \"It will be an opportunity for our friends on the Democratic side of the aisle to declare to the country on whose side they stand,\" he said. Cruz reminded his colleagues that voting against the bill Tuesday would be a vote to say, \"we should not enforce the laws, we shouldn't have a mandatory five-year prison sentence\" on illegal criminal aliens.\nCruz said the existence of sanctuary cities is creating additional incentives for criminal types to enter the U.S. and stay in areas where they know there is lax enforcement.\n\"These policies are inexcusable,\" he said. \"They are a threat to the public safety of the American people and they need to end.\"\nThe Senate will need to find 60 votes to advance the bill today, but they are expected to fall short. Several Democrats spoke out against it on the Senate floor, and President Obama has said he would veto the bill.\nSen. Bob Menendez, D-N.J., said the bill \"does nothing more than instigate fear\" that all immigrants are criminals. And Sen. Chuck Schumer, D-N.Y., insisted that the bill was just \"political theater\" and an attempt to score points against Democrats.\nAlso from the Washington Examiner Muslims oppose U.K.'s tough new counter-extremism program The initiative removes passports of teenagers whose parents suspect of having connections to extremists.\nBy Daniel Chaitin • 10/20/15 12:40 PM   5:07 PM", "external_links": [], "published": "2015-10-20T16:53:00.000+03:00", "crawled": "2015-10-21T01:00:08.368+03:00", "highlightTitle": ""}