{"organizations": ["Associated Press", "Arkansas State"], "uuid": "d5ffe0c53b2d6f8a000178e971afee345fc2d36b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arkansasbusiness.com", "main_image": "http://assets.inarkansas.com/58910/bart-hester-arkansas-senate-2015-90th-assembly-882.jpg", "site_section": "http://www.arkansasbusiness.com/rss/government", "section_title": "Government & Politics - ArkansasBusiness.com", "url": "http://www.arkansasbusiness.com/article/107703/arkansas-state-senator-chairing-rubios-campaign-in-arkansas", "country": "US", "title": "Arkansas State Senator Chairing Rubio's Campaign in Arkansas", "performance_score": 0, "site": "arkansasbusiness.com", "participants_count": 0, "title_full": "Arkansas State Senator Chairing Rubio's Campaign in Arkansas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T20:50:00.000+03:00", "replies_count": 0, "uuid": "d5ffe0c53b2d6f8a000178e971afee345fc2d36b"}, "author": "", "url": "http://www.arkansasbusiness.com/article/107703/arkansas-state-senator-chairing-rubios-campaign-in-arkansas", "ord_in_thread": 0, "title": "Arkansas State Senator Chairing Rubio's Campaign in Arkansas", "locations": ["Arkansas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andrew DeMillo", "Bart Hester", "Rubio"], "text": "by Andrew DeMillo, The Associated Press on Monday, Oct. 19, 2015 12:50 pm Bart Hester \nLITTLE ROCK - An Arkansas legislator who pushed for the state's religious objections law and a limit on local anti-discrimination protections is heading Marco Rubio's presidential bid in the state, the Florida senator's campaign announced Monday . \nRepublican state Sen. Bart Hester of Cave Springs is serving as Rubio's state chairman. Hester, who has served in the state Senate since 2013, praised Rubio as the candidate best positioned to win the general election next year. \n\"I think he represents a new century in America,\" Hester said. \"He's young and energetic. He's a proven conservative and at the end of the day what I think will propel him to the top is he's the best communicator in the field.\" \nHester earlier this year co-sponsored a state law aimed at preventing government from infringing on someone's religious beliefs without a compelling reason. The measure was rewritten in the final days of the legislative session over concerns an initial version was anti-gay. He was also the chief sponsor of a measure aimed at preventing cities and counties from banning discrimination based on sexual orientation or gender identity. \nHester said he didn't know of any campaign stops planned by Rubio but said he hoped the White House hopeful would visit as the state's March 1 primary approaches. Arkansas earlier this year moved up its primary from May to March, part of an effort to create a regional nominating contest in the South. \nRubio is the latest to tout support in rival Mike Huckabee's home state. Huckabee, who served 10 ½ years as governor, has been endorsed by most of the state's top Republicans, with Gov. Asa Hutchinson and U.S. Sen. John Boozman co-chairing his Arkansas campaign. \nTexas Sen. Ted Cruz visited Arkansas in August and announced that Rep. Bob Ballinger, who sponsored the religious objections and local anti-discrimination limits measures in the House, was co-chairing his campaign in the state. Other GOP hopefuls have visited Arkansas in recent months, including retired neurosurgeon Ben Carson and billionaire Donald Trump. Former Hewlett-Packard CEO Carly Fiorina is scheduled to speak in northwest Arkansas on Thursday night. \n(Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.)", "external_links": [], "published": "2015-10-19T20:50:00.000+03:00", "crawled": "2015-10-20T06:05:05.439+03:00", "highlightTitle": ""}