{"organizations": [], "uuid": "5fd67f52eaa083e7c74ba27875f92b3234406a36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/14/Editorial-Opinion/Images/Mideast_Syria_Russia-06f61-1604.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/mr-president-kill-the-new-cruise-missile/2015/10/15/e3e2807c-6ecd-11e5-9bfe-e59f5e244f92_story.html", "country": "US", "title": "Mr. President, kill the new cruise missile", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Mr. President, kill the new cruise missile - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "5fd67f52eaa083e7c74ba27875f92b3234406a36"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/mr-president-kill-the-new-cruise-missile/2015/10/15/e3e2807c-6ecd-11e5-9bfe-e59f5e244f92_story.html", "ord_in_thread": 0, "title": "Mr. President, kill the new cruise missile", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A Russian ship launches a cruise missile in the Caspian Sea on Oct. 7. (AP/AP) By William J. Perry and Andy Weber October 15 at 8:42 PM William J. Perry was U.S. secretary of defense from 1994 to 1997. Andy Weber was assistant secretary of defense for nuclear, chemical and biological defense programs from 2009 to 2014.\nBecause they can be launched without warning and come in both nuclear and conventional variants, cruise missiles are a uniquely destabilizing type of weapon. President Obama can lead the world to a stabler and safer future by canceling plans for a new U.S. nuclear-capable cruise missile . Moreover, taking such a step — which would not diminish the formidable U.S. nuclear deterrent in the least — could lay the foundation for a global ban on these dangerous weapons.\nTwo years ago, when Britain decided not to pursue a sea-launched nuclear cruise missile, Philip Hammond, then-British defense secretary and now-foreign secretary, explained the problem well : “A cruise-based deterrent would carry significant risk of miscalculation and unintended escalation. At the point of firing, other states could have no way of knowing whether we had launched a conventional cruise missile or one with a nuclear warhead. Such uncertainty could risk triggering a nuclear war at a time of tension.”\nRonald Reagan and Mikhail Gorbachev recognized the destabilizing nature of nuclear cruise missiles and prioritized the elimination of ground-launched versions in the 1987 Intermediate-Range Nuclear Forces Treaty . Similarly, in 1991, President George H.W. Bush unilaterally ordered all sea-launched Tomahawk nuclear cruise missiles taken off surface ships and attack submarines and put into storage. There they sat unused until Obama formally retired and directed their dismantlement in 2011.\nThe Defense Department’s 2010 Nuclear Posture Review Report stated that a decision would be made “whether and (if so) how” to replace the current air-launched cruise missile. This missile will reach the end of its operational life in about 2030, and the only bomber that can deliver it — the B-52 — dates to 1955. The vastly superior B-2 stealth bomber carries not the cruise missile but two types of nuclear gravity bombs, the B61 and megaton-plus B83.\nThe Obama administration deserves great credit for increasing investment in B-2 sustainment, command and control, and a costly but vital program to extend the life of the B61 nuclear bomb. The extended B61 will replace four existing models, including the tactical version deployed to Europe in support of NATO, and allow for the retirement of the very high-yield B83. With these efforts, the B-2 and B61 will provide the core capability of the bomber leg of the strategic air-land-and-sea nuclear triad for decades to come. The Air Force has also prioritized procurement of 80 to 100 next-generation stealth bomber aircraft, which will be called the Long-Range Strike Bomber, or B-3.\nOne of us (William J. Perry) led the Defense Department’s development and procurement of the current air-launched cruise missile and the B-2 stealth bomber in the late 1970s and early 1980s. At that time, the United States needed the cruise missile to keep the aging B-52, which is quite vulnerable to enemy air defense systems, in the nuclear mission until the more effective B-2 replaced it. The B-52 could safely launch the long-range cruise missile far from Soviet air defenses. We needed large numbers of air-launched nuclear cruise missiles to be able to overwhelm Soviet air defenses and thus help offset NATO’s conventional-force inferiority in Europe, but such a posture no longer reflects the reality of today’s U.S. conventional military dominance.\nWith the updated B-2 and B61 expected to remain in service for many decades, and the planned deployment of new B-3 penetrating bombers with B61 bombs starting in 2025, there is scant justification for spending tens of billions of dollars on a new nuclear air-launched cruise missile and related warhead life-extension program. The old Cold War requirement for such a capability no longer exists. We can, and should, maintain an extremely effective bomber leg of the triad without it.\nSome have argued that a new nuclear-capable air-launched cruise missile is needed to allow future presidents the “flexibility” to engage Russia or China in limited nuclear war. That is Cold War thinking, and it is dangerous. Such “tactical” use of nuclear weapons would be a grave mistake. As Bush told the nation in 1991 when he announced his path-breaking Presidential Nuclear Initiative: “We can enhance stability and actually reduce the risk of nuclear war. Now is the time to seize the opportunity.”\nWe therefore urge President Obama to cancel the current plan to develop and buy 1,000 to 1,100 new nuclear-capable air-launched cruise missiles. Such strong U.S. leadership, coupled with a challenge to the other major nuclear powers to eliminate or, in the cases of China and India, forgo deployment of this extremely destabilizing class of weapons, would reduce the risk of nuclear weapons use and be a historic practical step in the direction of a world without nuclear weapons.\nRead more:\nEliot A. Cohen: Five myths about cruise missiles\nDianne Feinstein: America’s nuclear arsenal is unsustainably large\nHenry A. Kissinger and Brent Scowcroft: Nuclear weapon reduction must be part of strategic analysis\nThe Post’s View: The world can’t ignore North Korea’s nuclear progression", "external_links": ["http://www.state.gov/t/avc/trty/102360.htm", "http://lewis.armscontrolwonk.com/archive/2560/why-the-navy-should-retire-tlam-n", "https://fas.org/blogs/security/2013/10/b61-12hearing/", "http://archive.defense.gov/npr/docs/2010%20Nuclear%20Posture%20Review%20Report.pdf", "http://www.forbes.com/sites/lorenthompson/2015/09/02/b-3-the-inside-story-of-americas-next-bomber/", "http://www.telegraph.co.uk/news/uknews/defence/9843848/The-alternatives-to-Trident-carry-an-enormous-risk.html", "https://books.google.com/books?id=0HNrCgAAQBAJ&pg=PA106&lpg=PA106&dq=%22maximize+flexibility+and+credibility+for+the+future%22&source=bl&ots=yiQ6kewfWX&sig=ycwxnzSqriQW4BCSfUCh2eOC1ls&hl=en&sa=X&ved=0CB0Q6AEwAGoVChMIgLjU-IvDyAIVyHE-Ch2MZQbR#v=onepage&q=%22maximize%20flexibility%20and%20credibility%20for%20the%20future%22&f=false", "https://www.armscontrol.org/ACT/2015_05/News/Air-Force-Wants-Thousand-New-Cruise-Missiles", "http://www.nytimes.com/1991/09/28/us/bush-s-arms-plan-remarks-president-bush-reducing-us-soviet-nuclear-weapons.html"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T04:11:25.843+03:00", "highlightTitle": ""}