{"organizations": [], "uuid": "336133ed60058c7f67a977e2cdcb11ccc480d357", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/93de4614-2276-4d27-93ad-60bd2cd633ed.img", "site_section": "http://www.ft.com/rss/world/mideast/politics", "section_title": "Middle East & North Africa Politics and Society News - FT.com", "url": "http://www.ft.com/cms/s/0/cec668a8-7714-11e5-933d-efcdc3c11c89.html?ftcamp=published_links%2Frss%2Fworld_mideast_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Putin challenges Nato in Mediterranean", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Putin challenges Nato in Mediterranean", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:50:00.000+03:00", "replies_count": 0, "uuid": "336133ed60058c7f67a977e2cdcb11ccc480d357"}, "author": "", "url": "http://www.ft.com/cms/s/0/cec668a8-7714-11e5-933d-efcdc3c11c89.html?ftcamp=published_links%2Frss%2Fworld_mideast_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Putin challenges Nato in Mediterranean", "locations": ["Mediterranean", "Syria", "Mediterranean Russia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Jones", "Putin", "Vladimir Putin", "Trapani"], "text": "Russia’s Syria strategy poses challenge to Nato in Mediterranean Sam Jones in Trapani ©Getty Vladimir Putin's military intervention against anti-regime forces in Syria is an immediate challenge for the west \nRussia’s military intervention in Syria is serving as a broader announcement of Moscow’s renewed determination to hold sway in the Middle East. \nBut beyond the immediate outcome of the civil war there, Nato military chiefs are now viewing it as a wider strategic play by Vladimir Putin’s Russia to challenge the west closer to home. According to a senior Nato civilian official, the Mediterranean “is a contested space again”. More Europe pushes on with bank bailout scheme \n“We have to be prepared for Russia to be [in Syria] as a factor for a long time,” Alexander Vershbow, Nato’s deputy secretary-general, told the Financial Times on Monday, speaking on the edge of Nato’s biggest war-game since 2002: Trident Juncture, which for the next two weeks will take place across the western Mediterranean. \nRussia’s deployment to fight anti-Assad rebel forces is an immediate challenge for the west. But Moscow’s permanent, disruptive presence south of the Bosphorus is the long-term one, Mr Vershbow says: “[We have to] think about the broader consequences of this build up in the Eastern Mediterranean and the capacity of these airbases.” \nRussia has not had any sizeable presence in the Mediterranean since the end of the cold war. And a lack of investment until recently in its decaying Black Sea fleet, based in Crimea, had led many strategic military planners to overlook the entire theatre as a possible source of concern when it came to Moscow. \nRussia’s renewed presence could be highly disruptive: it opens up Nato’s entire southern border to Russian provocation while threatening to restrict the “freedom of navigation” that allows Nato to quickly and easily deploy military assets. \nFor the US, for example, it could complicate its ability to readily project naval power into the Gulf. It would have made a Nato decision to intervene in the Libyan conflict in 2011 far more difficult to plan. \nThere are other repercussions: Russia’s return to the Mediterranean suddenly puts all of Europe within range of its fast-developing arsenal of ship-launched cruise and ballistic missiles. \nWith an enlarged fleet so far south, Russia’s recently inked agreement with Cyprus giving its navy berthing rights also presents fresh challenges. \nRussian surveillance and electronic warfare assets now have the potential to be legally and regularly brought close to the British Royal Air Force base at Akrotiri, home of one of Nato’s most important listening stations. \n“The deployment to support Assad is not the end of the story,” says Jonathan Eyal, international director at the Royal United Services Institute in London. “This is really a fundamental shift in Russian posture that will be long lasting.” \nRussia has not only begun and extensive set of upgrades on facilities in Latakia and Tartus, but it has for the first time since the cold war reconstituted its Mediterranean fleet. \nNato officials concede there is no “southern strategy” to match the alliance’s recent efforts in eastern Europe , where it has developed a range of responses intended to counter Russian belligerence following its meddling in eastern Ukraine. \nIn the run-up to the alliance’s twice yearly summit, due to be held in Warsaw next July, such matters will dominate discussions. This is really a fundamental shift in Russian posture that will be long lasting \n- Jonathan Eyal, Royal United Services Institute \n“Since Crimea we have worked on assuring our allies and now we have to look at how that assurance lends itself to deterrence,” General Philip Breedlove, Nato’s supreme allied commander, told reporters at Trapani in Sicily, at the opening ceremony of the exercises. “We’re not sure exactly what it will take to work in the future . . . and we need to be very aware of what is going on Nato’s borders.” \nTrident juncture will feature 36,000 troops engaged until early November in exercises involving 140 planes, 60 ships and 30 nations. It is no coincidence — in spite of what Nato has carefully said in public — that the event is taking place in the Mediterranean. \n“We have taken a lot of these new threats on board,” says General Denis Mercier, former head of the French air force and Nato’s current supreme commander for transformation — in which role he is responsible for helping Nato’s troops to train and adapt. In depth", "external_links": [], "published": "2015-10-21T19:50:00.000+03:00", "crawled": "2015-10-21T23:19:18.533+03:00", "highlightTitle": ""}