{"organizations": [], "uuid": "358fefd4c5714368cddcf6c1dae24e4df0269bbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/fd/7eb634f7186808cfcd4031d3589025/media:1a9fb1b2445f495e8661d7dac5526df8APTOPIXHouseRepublicans.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/21/ryan-demands-unity-for-speaker-but-may-not-get-it", "country": "US", "title": "Ryan Demands Unity For Speaker – But May Not Get It", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Ryan Demands Unity For Speaker – But May Not Get It - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "358fefd4c5714368cddcf6c1dae24e4df0269bbb"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/21/ryan-demands-unity-for-speaker-but-may-not-get-it", "ord_in_thread": 0, "title": "Ryan Demands Unity For Speaker – But May Not Get It", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ryan Demands Unity For Speaker – But May Not Get It Conservatives who ousted John Boehner were skeptical they could agree to Ryan's conditions. Rep. Paul Ryan told GOP lawmakers Tuesday that he will run for speaker, but only if they embrace him by week's end as their consensus candidate – an ambitious bid to impose unity on a disordered and divided House.\nBy Gabrielle Levy Oct. 21, 2015 | 8:28 a.m. EDT + More Paul Ryan is in the race for speaker – but his conditions for taking the job may be insurmountable.\nAt a meeting of the House GOP caucus Tuesday night, Ryan relented to pressure from colleagues who said he was the only one who could collect enough votes from the disparate factions of the caucus to be elected.\nSpeaking to reporters following the meeting, the Ways and Means chairman made it clear he was quite happy with his current job and was only willing to leave it out of a sense of duty to party and country.\nRELATED\nWhy Would Paul Ryan Want to Become Speaker of the House? \"This is not a job I ever wanted or I ever sought. I am in the job I've always wanted here in the Congress,” the Wisconsin Republican said. “I came to the conclusion that this is a very dire moment, not just for Congress, not just for the Republican Party, but for our country. I think our country is in desperate need of leadership.\"\nIn stepping forward, Ryan told his colleagues he would give them until Friday to decide if they wanted him on his terms, or he would withdraw.\nAmong his demands were endorsements from each of the three major groups – the Republican Study Committee, the moderate Tuesday Group, and the conservative Freedom Caucus – and a repeal of a procedural tool that allows representatives the ability to remove the speaker.\nBoth conditions were directly related to the intraparty clashes that led to current Speaker John Boehner’s decision to step down. Throughout his five-year tenure, the Ohio Republican has constantly fended off criticism from the very conservatives whose electoral victories swept him into power.\nAccording to lawmakers in the meeting, Ryan said he would not run for speaker if conservatives would not subject himself to that kind of frequent undermining from within the party.\n“I’m willing to take arrows in the chest, but not in the back,” he said, according to members in the room.\nImmediately after the meeting, Freedom Caucus members were skeptical.\nThe group has floated a list of demands of their own, including procedural changes that would take power from leadership and give it to rank-and-file members. They also have tried to exact promises for the next speaker to refuse to pass spending legislation that includes funding for Planned Parenthood or renews the Export-Import Bank, and a commitment not to punish members who vote against the party.\nRELATED\nProspective Speakers Multiply in House as All Wait on Ryan Rep. Raul Labrador of Idaho, a co-chairman of the Freedom Caucus, called Ryan’s demand to remove the motion to vacate the chair, the procedure that allows for the removal of the speaker, a “non-starter.”\nAnd Rep. Tim Huelskamp of Kansas, another outspoken member of the conservative group, said Ryan sounded too much like Boehner in his desire to “consolidate power.”\n“What Paul Ryan is asking for is even more power and less responsibility,” Huelskamp told National Review , calling his conditions “unmeetable.”\nThe Freedom Caucus requires 80 percent of its 40-some members to agree on a candidate to make an endorsement.\nFlorida lawmaker Daniel Webster, who had the Freedom Caucus’ initial blessing for speaker against Boehner’s presumptive heir, Majority Leader Kevin McCarthy, said he was still running. At least one member, Steve King of Iowa, said Tuesday he still planned to back Webster.\nBoehner has set a floor vote for speaker for Oct. 29. To be elected, a candidate must get votes from an absolute majority of members present – typically 218. Republicans currently hold 247 seats, and the opposition of the Freedom Caucus was enough to sink McCarthy’s bid.\nSeveral options remain if Ryan were not to become speaker. While it’s unlikely any candidate would be elected without the support of some members of the Freedom Caucus, moderates and Democrats have suggested the possibility of a coalition candidate who could earn votes from both parties and ignore the demands of the most conservative Republican members.\nOthers have proposed a “caretaker” speaker, perhaps a retiring member, who would serve only until January.\nBut the most likely scenario, should Ryan bow out, would be for Boehner to stay on for weeks or even months.\nTAGS: Ryan, Paul Congress Republican Party", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZeelgo%3Fsrc=usn_tw&via=usnews&text=Ryan%20Demands%20Unity%20For%20Speaker%20%E2%80%93%20But%20May%20Not%20Get%20It", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZeelgo%3Fsrc=usn_rd&title=Ryan%20Demands%20Unity%20For%20Speaker%20%E2%80%93%20But%20May%20Not%20Get%20It", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZeelgo%3Fsrc=usn_su", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZeelgo%3Fsrc=usn_fb", "http://www.nationalreview.com/corner/425871/speaker-ryans-conditions", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZeelgo%3Fsrc=usn_gp", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZeelgo%3Fsrc=usn_li&title=Ryan%20Demands%20Unity%20For%20Speaker%20%E2%80%93%20But%20May%20Not%20Get%20It&summary=Conservatives%20who%20ousted%20John%20Boehner%20were%20skeptical%20they%20could%20agree%20to%20Ryan%27s%20conditions.&source=U.%20S.%20News"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T16:02:28.848+03:00", "highlightTitle": ""}