{"organizations": [], "uuid": "e1cfbd3b34b3ecae510a124160cd1b11ad8e94b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151002164004-barack-obama-white-house-october-2-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/10/05/politics/tpp-trade-deal-obama-reaction-politics/index.html", "country": "US", "title": "Obama pitches TPP trade deal to Congress, American people", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Obama pitches TPP trade deal to Congress, American people - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "e1cfbd3b34b3ecae510a124160cd1b11ad8e94b3"}, "author": "Eric Bradner", "url": "http://www.cnn.com/2015/10/05/politics/tpp-trade-deal-obama-reaction-politics/index.html", "ord_in_thread": 0, "title": "Obama pitches TPP trade deal to Congress, American people", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) President Barack Obama got much closer Monday to locking in a major part of his legacy: the biggest regional free trade deal in history.\nBut first he has to win the political battle in Congress and on the 2016 presidential campaign trail.\nTrade negotiators' announcement that they've reached a deal on the 12-country Trans-Pacific Partnership starts the clock on a politically fraught process that will drop the deal into a combustible Congress, where populists in both parties oppose it, in the midst of a presidential campaign.\nAnd 2016 candidates will weigh in -- some with the potential to fan the flames of discontent on Capitol Hill and with both parties' most loyal voters.\nThe most intense scrutiny will fall on Hillary Clinton, the Democratic front-runner who was Obama's first-term secretary of state but has been mum on the Pacific Rim deal since launching her presidential campaign.\nShe's sandwiched between Obama, whose work on the Trans-Pacific Partnership extends the legacy of the North American Free Trade Agreement signed by Bill Clinton, and a Democratic base that has long soured on those pacts, arguing that they cause the United States to bleed jobs and wages -- in some cases to countries without protections for workers and the environment.\nVermont Sen. Bernie Sanders, Clinton's liberal rival, has already emailed supporters about blocking the \"disastrous\" deal.\n\"Wall Street and other big corporations have won again,\" Sanders said in a statement. \"It is time for the rest of us to stop letting multi-national corporations rig the system to pad their profits at our expense.\"\nOn the right, there is much less ideological resistance to free trade -- and in fact it was the new Republican House and Senate majorities that in June helped Obama seal the Pacific Rim deal by approving a bill that greased the wheels for its ultimate passage.\nBut GOP 2016 front-runner Donald Trump has bucked the party orthodoxy. He has blasted the Pacific deal, called for crackdowns on currency manipulation that aren't typically included in trade talks and even said he'd re-negotiate NAFTA.\n\"The incompetence of our current administration is beyond comprehension. TPP is a terrible deal,\" Trump tweeted Monday afternoon .\nThe incompetence of our current administration is beyond comprehension. TPP is a terrible deal.\n— Donald J. Trump (@realDonaldTrump) October 5, 2015 Other outsider candidates like Carly Fiorina and Ben Carson haven't been as critical as Trump, but they've signaled some problems of their own with the deal.\nWhat would imperil the Trans-Pacific Partnership the most is populists in both parties joining arms in an effort to defeat it in Congress.\nAlready, most Democrats are resistant to the deal. Sen. Elizabeth Warren of Massachusetts has led the opposition, highlighting the deal's inclusion of an international arbiter to settle disputes between companies and governments that impose regulations that might violate their trade obligations. Some conservatives have also opposed what they've dubbed \"Obamatrade,\" warning that they don't trust anything that the President negotiates.\nObama started making his pitch to the American people and Congress shortly after the 12 participating nations' trade ministers Monday morning announced -- after extending their stay during a negotiating session in Atlanta, where this round of talks took place, by four more days than they'd planned.\n\"If we can get this agreement to my desk, then we can help our businesses sell more Made in America goods and services around the world, and we can help more American workers compete and win,\" Obama said in a statement.\nIt's a deal years in the making.\nWhat evolved into the Trans-Pacific Partnership started as a small, regional negotiation late in George W. Bush's second term. Countries were added along the way -- but it was when Japan joined the talks in 2013 that the deal gained serious heft, opening a massive new market for automotive and agricultural exports and easing the process of selling more products like liquefied natural gas.\nThe deal also includes Canada and Mexico -- the countries that struck the North American Free Trade Agreement with the United States two decades ago.\nNegotiators had been hung up on a short list of issues for months -- and in some cases, years. The United States and Japan were squaring off over agriculture and automotives. U.S. pharmaceutical companies sought longer patent protections, while developing Asian countries wanted quicker access to inexpensive generics. New Zealand was pushing for more access to the Canadian and U.S. dairy markets. And negotiators for each country knew every concession they made would risk provoking political fights back home that could imperil the deal.\nAnnouncing a deal was just a first step. The 12 countries must put the finishing touches on the text and translate it into each of their languages -- a process likely to take months.\nThen, it must win approval in each country -- and clearing Congress in the midst of a presidential election will be no small task. The same issues that caused negotiators to stay four extra days in Atlanta are certain to prove controversial on Capitol Hill and on the campaign trail.\nLawmakers took the first step toward passage of the Trans-Pacific Partnership when the Republican-led House and Senate both approved a measure known as \"trade promotion authority.\"\nThat means the pact will be submitted to Congress for an up-or-down vote without amendments -- preventing U.S. negotiators from having to return to the table and ask other countries to agree to last-minute changes.\nIn his statement, Obama touted the potential benefits of the deal.\n\"This partnership levels the playing field for our farmers, ranchers, and manufacturers by eliminating more than 18,000 taxes that various countries put on our products,\" Obama said.\n\"It includes the strongest commitments on labor and the environment of any trade agreement in history, and those commitments are enforceable, unlike in past agreements. It promotes a free and open Internet. It strengthens our strategic relationships with our partners and allies in a region that will be vital to the 21st century,\" he said. \"It's an agreement that puts American workers first and will help middle-class families get ahead.\"\nFollow @CNNpolitics", "external_links": ["https://twitter.com/realDonaldTrump/status/651136309029834752", "https://twitter.com/CNNpolitics"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T03:01:56.429+03:00", "highlightTitle": ""}