{"organizations": [], "uuid": "50467acc41f3daef4a610e61ba76b29aa1e71ccc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/business/articles/2015/10/22/fda-adds-liver-warning-to-abbvie-hepatitis-c-drugs", "country": "US", "title": "FDA adds liver warning to AbbVie hepatitis C drugs", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "FDA adds liver warning to AbbVie hepatitis C drugs - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "50467acc41f3daef4a610e61ba76b29aa1e71ccc"}, "author": "USNews", "url": "http://www.usnews.com/news/business/articles/2015/10/22/fda-adds-liver-warning-to-abbvie-hepatitis-c-drugs", "ord_in_thread": 0, "title": "FDA adds liver warning to AbbVie hepatitis C drugs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FDA warns of safety risk with AbbVie drugs for patients with advanced liver disease Associated Press Oct. 22, 2015 | 4:40 p.m. EDT + More By MATTHEW PERRONE, AP Health Writer\nWASHINGTON (AP) — Federal health officials are warning doctors and patients that two hepatitis C drugs from AbbVie can cause life-threatening liver injury in patients with advanced forms of the disease.\nThe Food and Drug Administration said Thursday it will require AbbVie to add new warnings to Viekira Pak and Technivie about their risks for patients who already have advanced liver damage caused by hepatitis C.\nThe warning could reshape the growing field of high-priced drugs to treat the virus, which also includes Gilead Sciences' blockbuster medications Sovaldi and Harvoni.\nShares of North Chicago, Illinois-based AbbVie Inc. plummeted $5.56, or 10 percent, to close at $48.27 in trading Thursday.\nNearly 3 million Americans have the virus, which develops slowly over decades and, if left untreated, can cause liver failure and liver cancer, requiring transplant.\nThe FDA said in an online posting that AbbVie's drugs have been linked to multiple cases of severe liver damage — some of them fatal — in patients who already had liver cirrhosis, irreversible scarring of the organ. The agency determined 26 such events were likely related to the drugs, with the liver damage usually occurring within four weeks of starting treatment.\nAbbVie said in a statement it is adding a warning to the drugs that they must not be used in patients with moderate to severe liver impairment.\n\"Patient safety is of the utmost concern to AbbVie,\" the company said in an emailed statement.\nAbbVie's drugs are part of a new wave of pill-only combinations that cure more patients and cause fewer side effects than older hepatitis C treatments, which required injections and caused flu-like side effects.\nGilead Sciences initially dominated the space, raking in over $9.4 billion in sales for Sovaldi in its first full-year on the market. The company followed that approval with the launch of a combination pill, Harvoni, to treat a much broader group of hepatitis C patients.\nWhile doctors and patients have embraced the new drugs, insurers have pushed back over their sky-high prices — generally $83,000 or more for one course of treatment.\nThe launch of AbbVie's pill, Viekira Pak, was welcomed as a much-needed competitor in the field. Since then, insurers have been forcing Gilead and AbbVie to compete on price to get preferred standing in their formularies of approved drugs, and have been winning substantial discounts.\nShares of Foster City, California-based Gilead Sciences Inc. rose $5.87, or 5.8 percent, to close at $107.60.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZeg8zz%3Fsrc=usn_li&title=FDA%20adds%20liver%20warning%20to%20AbbVie%20hepatitis%20C%20drugs&summary=&source=U.%20S.%20News", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZeg8zz%3Fsrc=usn_tw&via=usnews&text=FDA%20adds%20liver%20warning%20to%20AbbVie%20hepatitis%20C%20drugs", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZeg8zz%3Fsrc=usn_gp", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZeg8zz%3Fsrc=usn_rd&title=FDA%20adds%20liver%20warning%20to%20AbbVie%20hepatitis%20C%20drugs", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZeg8zz%3Fsrc=usn_fb", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZeg8zz%3Fsrc=usn_su"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T23:52:04.456+03:00", "highlightTitle": ""}