{"organizations": [], "uuid": "7806e048dddbf659248a6abc0878da18ddc559cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jpost.com", "main_image": "http://www.jpost.com/HttpHandlers/ShowImage.ashx?ID=305487", "site_section": "http://www.jpost.com/Israel-News/Politics-And-Diplomacy", "section_title": "Israel politics and world diplomacy | The Jerusalem Post ", "url": "http://www.jpost.com/Opinion/Think-About-It-After-the-holidays-422631", "country": "IL", "title": "Think About It: After the holidays - Opinion", "performance_score": 0, "site": "jpost.com", "participants_count": 1, "title_full": "Think About It: After the holidays - Opinion - Jerusalem Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:41:00.000+03:00", "replies_count": 0, "uuid": "7806e048dddbf659248a6abc0878da18ddc559cf"}, "author": "SUSAN HATTIS ROLEF", "url": "http://www.jpost.com/Opinion/Think-About-It-After-the-holidays-422631", "ord_in_thread": 0, "title": "Think About It: After the holidays - Opinion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Since this year two of the holidays fell on Mondays, and since I am a woman of habit, I passed on offers to submit my column on other days. Had I written my usual columns I would have written about Netanyahu’s UN speech in one, and on the food shortages during the holidays in the other.\nOn Netanyahu’s speech – impressive as usual in terms of the language and delivery – I would have pointed out that the part of the speech focused on Iran was all true, but a red herring in terms of relevancy. For better or worse the agreement with Iran has been signed, and the time to try and influence its mere existence and content is now past. Unlike the criticism of most commentators, I thought that the moment’s silence in the course of the speech, to symbolize the absence of world reaction to statements by some of Iran’s leaders to the effect that in the foreseeable future Israel will cease to exist, was clever and effective.\nNetanyahu’s declaration that he is willing to sit down with the Palestinians to talk without any preconditions was both irrelevant – given the new outburst of mostly unorganized Palestinian acts of terrorism ignited by fears (some based on fact and some on fiction) of Israeli designs on the Temple Mount – and dishonest.\nThe immediate issue with regard to the Palestinians is now how to lower the flames – not opening talks on a solution to the conflict. Netanyahu’s dishonesty is in the fact that he has preconditions, just as the Palestinians have preconditions. Some of Netanyahu’s preconditions are a matter of wide consensus among Jews in Israel: that a Palestinian state, if and when it is established, will be demilitarized; that grosso modo the 1949 Palestinian refugees cannot return to what will remain Israeli territory after a settlement; and that Jerusalem shall remain united. Netanyahu’s other preconditions, that are not in consensus in Israel, and are rejected out of hand by most of the international community – including the US and Europe – are that the development of Jewish settlements in Judea and Samaria should continue; and that Jerusalem shall remain united under exclusive Israeli sovereignty.\nRegarding the two-state solution, Netanyahu has spoken out both in favor of and against it. However, almost no-one in Israel or abroad believes that he is seriously willing to consider a two-state solution in which a Palestinian state will be anything but an Israeli puppet, required to “behave itself” in accordance with Israeli diktat.\nAs to the scandal of shortages of certain staple foods during the holidays, all I have to say is that if our agriculture minister, Uri Ariel, were as determined about ensuring that there would be no shortages during the holidays as he is about the right of Jews to pray on the Temple Mount (even though all ultra-Orthodox rabbis and most national-religious rabbis object to Jews ascending the Temple Mount, and certainly to their praying there), there would have been no shortages.\nI know that “economic planning” is a dirty word in certain government circles in Israel, but we have ministers of finance and economics for whom “economic planning” is anything but a dirty word, and given that Israel hopes to send a rocket to the moon in the foreseeable future, ensuring that there are no shortages during the holidays ought to be a piece of cake. And incidentally, why didn’t Netanyahu say a word on this subject? But that’s all yesterday’s news. Today the issue is what to do about the current totally unacceptable wave of murderous terrorist attacks, mostly planned and carried out by very young Palestinians, without any organizational backing, and most of them involving knives rather than guns.\nBayit Yehudi, around a third of the Likud (including several Likud ministers and deputy ministers), part of Yisrael Beytenu (but apparently not party leader Avigdor Liberman himself), and those who voted for Eli Yishai’s defunct party call for an all-out Israeli military reaction, intensified and unconstrained construction in Judea and Samaria, and other activities to show the Palestinians “who’s boss.”\nNetanyahu and Defense Minister Moshe Ya’alon have adopted a much more moderate and responsible position, giving the Israeli forces responsible for confronting the terrorists more leeway, but at the same time avoiding provocations, such as the current intensification of construction in Judea and Samaria and visits to the Temple Mount by ministers and both Jewish and Muslim MKs.\nWhere the Israeli Center and moderate Left differ with this approach is that they are opposed in principle to Jewish settlement activities at any time in areas that will not remain under Israeli sovereignty if and when a settlement is reached, and advocate that Israel also offer confidence building measures.\nFor example, most experts agree that the motivation of young Palestinian residents of east Jerusalem, who hold blue identity cards, to carry out anti-Jewish terrorist acts would be much reduced if the Palestinian east Jerusalemites were offered better municipal services, such as garbage collection, road and sidewalk construction and maintenance, playgrounds, schools and kindergartens. One wonders when Jerusalem Mayor Nir Barkat or Netanyahu last visited any east Jerusalem neighborhood in our far from undivided capital.\nThe conventional wisdom after the previous elections was that the “people” had spoken, and what they wanted was a right-wing-religious government.\nI was and remain one of those who claimed that the Israeli public should experience such a government, free of any Center/Left fig-leaves and shock-absorbers.\nI still believe that this government is the only hope for a return of more moderate forces to lead this country.\nToday I am skeptical as to whether the current right-wing-religious government can be replaced without new elections, and this is not because I expect the results of new elections to be held today would be any different than the recent elections, but simply because I cannot see Netanyahu, at this juncture, being willing to throw Bayit Yehudi out of the government, or calling the Likud’s more extreme right-wing members to order – necessary preconditions for an alternative government.\nNevertheless I believe that even in the current Knesset there is a larger majority favoring a moderate Left to moderate Right government than the current government majority. This majority includes the moderate Left (the Zionist Union minus its more extreme-Left members, who constitute about a quarter of its current Knesset membership), Yesh Atid, Kulanu, Shas, United Torah Judaism, and the moderate Right (the Likud minus its more extreme right-wing members, who constitute about a third of its current Knesset membership).\nAll in all we are talking of about 72 MKs, compared to 61 who formally support the current Government but many of whom do not support the policy of Netanyahu-Ya’alon, and speak out publicly against it.\nI expect that at least in the internal security sphere things are going to get worse before they get better, and we do not know how the current situation will affect the regime in Ramallah. The first two intifadas lingered for quite awhile before things settled down.\nThe current outbreak of violence – whether another intifada or “merely” a fauda (chaos) – is also likely to complete a full cycle. Whether it will be followed by another long pause as in the previous cases, or whether it will be followed by a more satisfactory situation (not just to us Jews, but to the Palestinians as well), is the 64,000-dollar question at the moment.\nThe writer is a political scientist and retired Knesset employee.\n ", "external_links": [], "published": "2015-10-12T04:41:00.000+03:00", "crawled": "2015-10-11T20:43:20.393+03:00", "highlightTitle": ""}