{"organizations": ["Bolton"], "uuid": "bf5f2eae49da036b654a5314efbee2da3fb269c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theboltonnews.co.uk", "main_image": "http://www.theboltonnews.co.uk/resources/images/sitelogo/", "site_section": "http://www.theboltonnews.co.uk/news/politics/rss/", "section_title": "The Bolton News | Politics", "url": "http://www.theboltonnews.co.uk/news/politics/13874001.1_in_4_Bolton_children_living_in_poverty_____but_not_because_of_drugs__alcohol_and_unemployment/?ref=rss", "country": "GB", "title": "1 in 4 Bolton children living in poverty — but not because of drugs, alcohol and unemployment", "performance_score": 0, "site": "theboltonnews.co.uk", "participants_count": 0, "title_full": "1 in 4 Bolton children living in poverty — but not because of drugs, alcohol and unemployment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:03:00.000+03:00", "replies_count": 0, "uuid": "bf5f2eae49da036b654a5314efbee2da3fb269c3"}, "author": "", "url": "http://www.theboltonnews.co.uk/news/politics/13874001.1_in_4_Bolton_children_living_in_poverty_____but_not_because_of_drugs__alcohol_and_unemployment/?ref=rss", "ord_in_thread": 0, "title": "1 in 4 Bolton children living in poverty — but not because of drugs, alcohol and unemployment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 comments \nNEARLY one in four children in Bolton is living in poverty — but much of the deprivation is not caused by drugs, alcohol and unemployment, according to a report. \nThe annual report for the Bolton Safeguarding Children Board warned that 23 per cent of children are living in poverty, according to findings from HMRC. \nThe report said: \"Bolton is categorised as one of the most deprived boroughs in England. According to the Index of Multiple Deprivation 2010, Bolton is ranked 48th most deprived of 326 local authorities. \n\"Bolton has higher levels of severe deprivation than its statistical neighbours. According to statistics published annually by HMRC, 23 per cent of children in Bolton are living in poverty; 16 per cent are living in low income working families. \n\"This challenges beliefs which put poverty down to drug and alcohol dependency, family breakdown, poor parenting, or a culture of worklessness are not supported by the facts.\" \nCouncillors and charities have warned that more needs to be done to get the situation under control but have warned that incoming benefit reforms could make the issue worse. \nBolton Council 's lead councillor on children safeguarding Ann Cunliffe said: \"It's a very sad sign of the times. Bolton has a high deprivation figure due to a combination of reasons including welfare reform, zero hour contracts and families not having enough money to live on. Promoted stories \n\"Many families are relying on food banks to feed children. Child poverty has severe long term effects on education, health and that can lead to much shorter life expectancy. \n\"The government needs to address this issue to give children a positive future.\" \nDave Bagley, chief executive of charity Urban Outreach which works with disadvantaged and vulnerable people in the town, added: \"We know in terms of free schools meals, which are means tested, that 9,000 children are on free meals. Share article \n\"Poverty is a big thing on the council's agenda and it's just shocking that in the 21st century we have such poverty among children. It's shocking but not surprising. \n\"I think what Bolton is trying to do is do what they can with what they've got. We always look to the council for the money and that's not what we should be doing now.\" Promoted Stories 1 in 4 Bolton children living in poverty — but not because of drugs, alcohol and unemployment   Keep in touch with local news", "external_links": [], "published": "2015-10-16T09:03:00.000+03:00", "crawled": "2015-10-16T12:51:57.745+03:00", "highlightTitle": ""}