{"organizations": ["NBC"], "uuid": "ce773b00398ae8823fa7a543698181fdff1bae75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/81fd22dc6163ec9fa56f612a28b0573723af6bbd/c=0-51-1000-616/local/-/media/2015/10/05/WTSP/WTSP/635796390826578523-hillary-clinton-town-hall-on-today.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/107722232/wtsp/politicsandelections", "section_title": "WTSP - Politics", "url": "http://www.wtsp.com/story/news/politics/elections/2015/10/05/hillary-clinton-outlines-plan-tighten-us-gun-laws/73375686/", "country": "US", "title": "Hillary Clinton outlines plan to tighten U.S. gun laws", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Hillary Clinton outlines plan to tighten U.S. gun laws", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:51:00.000+03:00", "replies_count": 0, "uuid": "ce773b00398ae8823fa7a543698181fdff1bae75"}, "author": "", "url": "http://www.wtsp.com/story/news/politics/elections/2015/10/05/hillary-clinton-outlines-plan-tighten-us-gun-laws/73375686/", "ord_in_thread": 0, "title": "Hillary Clinton outlines plan to tighten U.S. gun laws", "locations": ["USA", "U.S.", "Hollis", "N.H."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Heidi Przybyla", "Hillary Clinton"], "text": "Hillary Clinton outlines plan to tighten U.S. gun laws Heidi Przybyla, USA TODAY 10:51 a.m. EDT October 5, 2015 Hillary Clinton participates in a town hall in Hollis, N.H., on Oct. 5, 2015. (Photo: (Scot Eisen/Getty Images for NBC), (Scot Eisen/Getty Images for NBC)) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nHillary Clinton offered a plan to stop individuals from purchasing guns over the Internet and at gun shows without background checks — and says she’ll act on it if Congress won’t. \nThe 2016 Democratic presidential front-runner outlined a series of steps to update the Brady Law that established background checks for all weapons purchases. The law, which took effect in 1994, was enacted before the Internet became a force in U.S. commerce. \nAn estimated 20% to 40% of all gun purchases in the U.S. occur without background checks because of loopholes that allow unlicensed online transfers as well as exchanges between anonymous strangers, including felons, at gun shows, according to a fact sheet provided by the campaign. Polls show broad public support for background checks. \nHer proposal comes in the wake of a mass shooting last week at an Oregon community college. \n“Enough,” Clinton said at a town hall in Hollis, N.H., broadcast on the Today show Monday. “We need universal background checks. We know that they will work,” she said. “I’m determined to do something about it,” Clinton said. \nShe outlined her plans in a state with high levels of gun ownership and emphasized that her focus is not law-abiding gun owners. Clinton said that even conservative Supreme Court Justice Antonin Scalia has said that the constitutional right to bear arms does not mean there can’t be restraints on gun ownership. \nThe most significant part of Clinton’s plan may be her vow to use executive action to update background check laws to account for Internet and gun show sales. The likelihood that Congress will pass new gun laws has been very low ever since Congress failed to act on a bipartisan plan to boost background checks in the aftermath of the December 2012 shootings that killed 20 schoolchildren and six educators at Sandy Hook Elementary in Newtown, Conn. Republicans also control both chambers of Congress and are unlikely to initiate votes on new gun laws. \nClinton’s plan would also close the “Charleston Loophole’’ that allows a gun sale to proceed without a background check if the check isn’t complete within three days. The alleged shooter who killed nine people at a Charleston church had a federal criminal record but was able to buy a gun anyway. \nOther components of the plan include repealing laws that prevent victims of gun violence from holding negligent manufacturers and dealers accountable; providing more funding to increase inspections of gun stores and a plan to revoke the licenses of dealers that knowingly sell to traffickers and straw purchasers. \nShe would also press for legislation to prohibit all domestic abusers from buying and possessing guns. Current law does not cover people in dating relationships or convicted stalkers. Her plan did not call for a reinstatement of the federal assault weapons ban that her husband, former president Bill Clinton, signed into law.", "external_links": [], "published": "2015-10-05T17:51:00.000+03:00", "crawled": "2015-10-05T18:01:23.863+03:00", "highlightTitle": ""}