{"organizations": [], "uuid": "90a57d56a20b44dfa60bc09bae4aca0ed4645895", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30238434/tom-hanks-to-receive-first-ever-alpia-juris-pride-award-for-james-donovan-role-in-bridge-of-spies", "country": "US", "title": "Tom Hanks to Receive First Ever ALPIA Juris Pride™ Award for James Donovan Role in Bridge of Spies", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Tom Hanks to Receive First Ever ALPIA Juris Pride™ Award for James Donovan Role in Bridge of Spies - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "90a57d56a20b44dfa60bc09bae4aca0ed4645895"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30238434/tom-hanks-to-receive-first-ever-alpia-juris-pride-award-for-james-donovan-role-in-bridge-of-spies", "ord_in_thread": 0, "title": "Tom Hanks to Receive First Ever ALPIA Juris Pride™ Award for James Donovan Role in Bridge of Spies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " American Lawyers Public Image Association\nAmerican Lawyers Public Image Association (ALPIA) Creates Juris Pride™ Award Just to Name Hanks Inaugural Honoree\nFORT LAUDERDALE, Fla. , Oct. 12, 2015 /PRNewswire/ -- On October 8, 2015 , the Board of Directors of the American Lawyers Public Image Association attended a screening of the new Steven Spielberg and Tom Hanks movie, Bridge of Spies. At the conclusion of the film and Q&A with Hanks and Spielberg that followed, the Board immediately conferred and passed a resolution to create the ALPIA Juris Pride™ award to hail this monumental film. \"Simply put, we were blown away,\" Nader Anise, Executive Director of ALPIA said.\nLogo - http://photos.prnewswire.com/prnh/20151012/275957LOGO\nPhoto - http://photos.prnewswire.com/prnh/20151012/275958\n\"After the movie, we just looked at each other and said, now what?\" Anise recalls with a chuckle. \"We knew that, due to the indelible significance of this movie, we had to make a big deal about it – but how?\"\nThat's when Anise suggested creating the Juris Pride™ award. \"I threw out the idea to the board members and everyone loved it,\" Anise says proudly. Calling it 'Juris Pride™' seemed like the perfect name,\" he adds. \"After watching Bridge of Spies, we felt pride in being lawyers.\"\n\" Tom Hanks will be the first ever recipient of the ALPIA Juris Pride™ award,\" Anise announced. He continued, \"What a great way to mark ALPIA's 15 year anniversary. From this point forward, ALPIA will continue to award Juris Prides™ to both lawyers and non-lawyers who project a positive light on the legal profession and instill a sense of pride in being an attorney.\"\nBridge of Spies depicts the real-life story of an insurance lawyer, James Donovan , who was recruited by the CIA to represent a Soviet spy on three criminal counts. Hanks, who plays Donovan, gives a masterful performance as an ethical and humble attorney and family man. \"Finally, an OSCAR®-caliber movie about lawyers that isn't lawyer bashing or disparaging to the profession. Actually, the lawyer is the good guy for a change – a hero!\" Anise proclaims.\nAnise is optimistic Bridge of Spies will be a turning point in how the public perceives lawyers. \"Through his acting genius, Tom was able to take the viewer into the inner sanctum of what real lawyers do – the trials and tribulations, the highs and lows. By channeling his inner Atticus Finch, Hanks spotlighted the credo of every conscientious lawyer: Zealous representation of client trumps all.\"\nAnise notes, \"We have already begun designing the Juris Pride™ award, although we haven't determined a date or location for the ceremony. We don't have the final product yet, but we know it will be a statue of Lady Justice . Don't you think Tom would look great with a Juris Pride™ in one hand and an OSCAR® in the other?\" Anise asks rhetorically.\nALPIA is the American Lawyers Public Image Association, founded in 2000. It is a 501(c)(3) and only organization in the world formed solely to promote a positive public image of lawyers. ALPIA is the world leader on attorney image issues. The website is www.alpia.org .\nCONTACT\nNader Anise, Executive Director\n(800) 946-5298\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/tom-hanks-to-receive-first-ever-alpia-juris-pride-award-for-james-donovan-role-in-bridge-of-spies-300157789.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151012/275958", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH25522&Transmission_Id=201510120812PR_NEWS_USPR_____PH25522&DateId=20151012", "http://photos.prnewswire.com/prnh/20151012/275957LOGO", "http://www.prnewswire.com/news-releases/tom-hanks-to-receive-first-ever-alpia-juris-pride-award-for-james-donovan-role-in-bridge-of-spies-300157789.html", "http://www.alpia.org/"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T15:46:35.953+03:00", "highlightTitle": ""}