{"organizations": [], "uuid": "3df03b258be2eb8e07c73879cf43b1930e9de64d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://pamelagellercom.c.presscdn.com/wp-content/uploads/2015/10/islamic-jew-hatred55.jpeg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/obama-calls-jihad-against-jews-in-israel-random-violence-3065608.html", "country": "US", "title": "Obama calls Jihad Against Jews in Israel “RANDOM VIOLENCE” | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Obama calls Jihad Against Jews in Israel “RANDOM VIOLENCE” | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:24:00.000+03:00", "replies_count": 0, "uuid": "3df03b258be2eb8e07c73879cf43b1930e9de64d"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/obama-calls-jihad-against-jews-in-israel-random-violence-3065608.html", "ord_in_thread": 0, "title": "Obama calls Jihad Against Jews in Israel “RANDOM VIOLENCE” | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nHow is this different from Obama calling the jihad at Fort Hood that resulted in the slaughter of 13 Americans in Texas as “workplace violence”?\nThere is nothing random about Islamic Jew-hatred.\n“Obama condemns violence in Israel,” CNN , October 16, 2015\nWashington (CNN)President Barack Obama condemned recent violence in Israel on Friday and reiterated that a two-state solution is the best answer to continued unrest.\nStanding side by side with South Korean President Park Geun-hye, Obama also said that South Korea and the U.S. would “never accept North Korea as a nuclear state” and added that he supports long-term efforts at reunification.\nViolence ramped up in Jerusalem this week after two Israelis were stabbed to death by a Palestinian; that spurred further violence and other stabbings. In the past month, eight Israelis died in 30 attacks involving knives and other weapons, with many more being wounded. Palestinian officials have said more than 30 Palestinians have been killed in the past month. More than 1,100 have been injured, mostly in fighting with Israeli forces.\nAt a White House press conference, Obama said his administration was “concerned about the outbreak of violence” and said people in Israel should have a basic expectation of law and order. But he also pointed a finger at Israeli Prime Minister Benjamin Netanyahu and Palestinian President Mahmoud Abbas.\n“We also believe that it’s important for both, Prime Minister Netanyahu and Israeli elected officials and President Abbas and other people in positions of power, to try to tamp down rhetoric that may feed violence or anger or misunderstanding and try to get all people in Israel and in the West Bank to recognize that this kind of random violence is not going to result in anything other than more hardship and more insecurity,” Obama said.\nObama also praised Park’s efforts at Korean reunification and had measured criticism for North Korea, even opening the door to the possibility of negotiations.\n“As my administration has shown with Iran and with Cuba, we are also prepared to engage nations with which we have had troubled histories, but Pyongyang needs to understand it will not achieve the economic development it seeks so long as it clings to nuclear weapons,” Obama said.", "external_links": ["http://www.cnn.com/2015/10/16/politics/obama-israel-north-korea/index.html", "http://pamelagellercom.c.presscdn.com/wp-content/uploads/2015/10/muslim-racists.jpeg", "http://pamelagellercom.c.presscdn.com/wp-content/uploads/2015/10/islamic-jew-hatred55.jpeg"], "published": "2015-10-16T23:24:00.000+03:00", "crawled": "2015-10-18T21:40:14.606+03:00", "highlightTitle": ""}