{"organizations": [], "uuid": "66fcca45f8246d8a2e905196469c1f53a12d0dc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://yallpolitics.com/index.php/yp/atom/", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/sen._cochran_challenges_obama_administration_on_federal_flood_risk_standard/", "country": "US", "title": "Sen. Cochran challenges Obama administration on federal flood risk standard", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Sen. Cochran challenges Obama administration on federal flood risk standard", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T14:08:00.000+03:00", "replies_count": 0, "uuid": "66fcca45f8246d8a2e905196469c1f53a12d0dc5"}, "author": "Frank Corder", "url": "http://yallpolitics.com/index.php/yp/post/sen._cochran_challenges_obama_administration_on_federal_flood_risk_standard/", "ord_in_thread": 0, "title": "Sen. Cochran challenges Obama administration on federal flood risk standard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COCHRAN CHALLENGES OBAMA ADMINISTRATION ON FEDERAL FLOOD STANDARD Letter to Interior Secretary Stresses Congressional Restrictions on Setting Federal Flood Standards WASHINGTON, D.C. - U.S. Senator Thad Cochran (R-Miss.), chairman of the Senate Appropriations Committee, today again challenged the Obama administration to provide detailed information to justify its work on a new federal flood risk standard in spite of congressional restrictions. Cochran today wrote Interior Secretary Sally Jewel to reiterate his concern with the administration's continued efforts to finalize guidelines to establish a Federal Flood Risk Management Standard (FFRMS) without adequately engaging the public and Congress. Cochran's letter was sent on day the controversial Water Resources Council-which has not been authorized or funded by Congress since the early 1980s-convened to finalize guidelines establishing a FFRMS. \"I am troubled by the administration's lack of transparency and apparent disregard of congressional prerogatives and the concerns of private property owners, and the state and local governments that will be affected by this new flood risk standard for federal properties,\" Cochran said. \"The administration must be more forthcoming, and work Congress and stakeholders.\" The detailed Cochran letter was written, in part, to determine compliance with a provision added to the FY2015 Consolidated and Further Continuing Appropriations Act (PL.113-235) that states the administration must solicit and consider input from governors, mayors and other stakeholders before implementing a FFRMS. In addition to asking for the technical, legal and scientific justification for the proposed policy change, as well as net cost-benefit and alternatives analyses, the letter also demands information on the cost associated with developing FFRMS and the government and non-government personnel working on the effort. The letter to Jewell follows previous efforts by Cochran and other Senators to ensure that the administration involves Congress and the public before establishing a FFRMS. 10/8/15 Posted October 9, 2015 - 5:07 am YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-09T14:08:00.000+03:00", "crawled": "2015-10-10T01:53:52.504+03:00", "highlightTitle": ""}