{"organizations": [], "uuid": "4fa5acdf647f28c7bb954de9a94263ab759705ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/101615_reporterhit_edson_1280.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/10/16/carson-fires-back-on-report-is-taking-time-off-to-promote-book/", "country": "US", "title": "Carson fires back on report he is taking time off to promote book", "performance_score": 0, "site": "foxnews.com", "participants_count": 9, "title_full": "Carson fires back on report he is taking time off to promote book | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 8, "uuid": "4fa5acdf647f28c7bb954de9a94263ab759705ad"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/10/16/carson-fires-back-on-report-is-taking-time-off-to-promote-book/", "ord_in_thread": 0, "title": "Carson fires back on report he is taking time off to promote book", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published October 16,\nGOP presidential candidate Ben Carson, who just announced that he raised $20.2 million in the last quarter and is one point behind GOP front runner Donald Trump in the latest Fox News poll , pushed back Friday against a report he has put his campaign on hold to promote his new book.\nABC News reported on Thursday that beyond private fundraising events, Carson was taking “two more weeks” off from the campaign trail to focus on the book, “A More Perfect Union,” which was released on Oct. 6. It was co-written with his wife Candy Carson.\nA political follow-up to \"One Nation,\" released in 2014, Carson, a retired neurosurgeon, says \"A More Perfect Union\" is supposed “to encourage every citizen to read and think about the Constitution, and to help defend it from those who misinterpret and undermine it.”\nThe ABC News report said Carson’s campaign likes to maintain a bright line between the book promotion and his GOP bid, and that beyond private fundraisers, he would not be making any public campaign appearances until the next CNBC-sponsored Republican debate on Oct. 28.\nThe story also points out that Carson’s last public campaign appearance was Oct. 2.\nBut Carson fired back Friday on Facebook, calling the ABC report “carelessly false.”\n“In the next three weeks, I have 25 fundraisers, a national debate, several public appearances and dozens of book signings from Texas to Iowa,” he writes to his supporters on Facebook. “I don’t see any time off in the coming three weeks.”\nThe ABC News story suggested that the campaign did not want to be perceived as “using campaign assets to sell books,” and noted that none of Carson's campaign staff would be accompanying him during promotional appearances.\nCarson spokesman Doug Watts said he has been raking in the donations, raising $3 million so far in October, and has been ubiquitous in the media throughout the month.\n“He’s been on TV. I think Wednesday through Friday I got sick of looking at him on TV,” Watts said. “So it’s pretty hard to suggest that he’s not out and about. Whether you make a distinction of it as a campaign thing or not.”", "external_links": ["http://abcnews.go.com/Politics/ben-carson-puts-public-campaign-events-hold-weeks/story?id=34481847", "http://www.realclearpolitics.com/epolls/2016/president/us/2016_republican_presidential_nomination-3823.html"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T03:56:05.259+03:00", "highlightTitle": ""}