{"organizations": [], "uuid": "b999311301c1b48386b9acfc9d390646a408ea33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/rtelander.jpg?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=0eBekwiaae0weggvfVm7DDG82Lg%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/baseball/7/71/1019859/get-ready-super-bowl-cubs-vs-cardinals", "country": "US", "title": "Get ready for the Super Bowl! Cubs vs. Cardinals", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Get ready for the Super Bowl! Cubs vs. Cardinals | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:48:00.000+03:00", "replies_count": 0, "uuid": "b999311301c1b48386b9acfc9d390646a408ea33"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/baseball/7/71/1019859/get-ready-super-bowl-cubs-vs-cardinals", "ord_in_thread": 0, "title": "Get ready for the Super Bowl! Cubs vs. Cardinals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PITTSBURGH—“It’s the World Series tonight, it really is,’’ said Joe Maddon before the wild-card game. “It’s the Super Bowl. It’s all that.’’\nIt wasn’t any of that. But we knew what he meant.\nWin and move on. Lose and be done.\nAnd away we go!\nSt. Louis, be ready. The Cubs’ bandwagon is on its way, and half-crazed fans who have been waiting since the Ark floated away are piling aboard.\nCubs-vs.-Cardinals?\nNow, we are talking Super Bowl. Or as close as you get before the World Series.\nJake Arrieta, the Cubs winning pitcher Wednesday night at PNC Field, is so aflame that if he were a prairie fire, he’d have scorched his way to the Atlantic by now.\nKyle Schwarber? Ice buckets, please.\nDexter Fowler? Dip tank.\nBut it was just one game, this 4-0 shutout of the Pirates. It’s over. It may not have been fair, a one-game playoff between the teams with the second and third best records in all of baseball.\n“It doesn’t necessarily determine the better team tonight,’’ said Maddon beforehand. But the one-and-done silliness is hot-stove-league discussion now.\nBecause on we go, and this is what we’ve all been waiting for, isn’t it? The Cubs against the Baddest Team on Earth? Make that the Baddest Team in the Solar System. Hyperbole comes fast these days.\nAnd not just in Chicago. The whole baseball world has to have been wondering when the men in blue would produce a real challenge to the men in red.\nThe Cardinals have become the nemesis of the Cubs, an army of small-town Darth Vaders with a system from the Galactic Empire, winning again and again in taunting monotony, something that has made the NL Central a near-joke and hasn’t helped the Cubs become more than a compilation of curses.\nFinally, we have a five-game series to see if the power structure has changed. To see if the globe has tilted toward the thirsty and starving.\nNobody expected the Cubs to be this good, but here they are.\nAnd if you look at what’s trending, it is this young ball club. Their 24-game turnaround from last season is the best in baseball. Their 46 wins in the last 65 games is the best in baseball.\nCould this be the worm turning? make that the caterpillar. Because somewhere within the Cubs dismal history thre must be a butterfly ready to hatch.\nThis series rivals the Bears against Packers for all the marbles. Yes, there is a lot that must happen before the Cubs could move on to the next round. But face it. Don’t either the Dodgers or Mets—the NLCS possibilities– seem like easier foes than the Cardinals?\nSt. Louis has won 90 or more games ten times since 2000. This year they have a league best 100 wins. Everybody on their entire roster has been injured, it seems. And none of it has mattered. Onward marches the enemy.\nSomebody said our city would calm down after this desperation win. But that’s impossible. The hyperventilating you hear is Cubs fans starting to think something is in the offing.\nCold towels and oxygen tanks are now being passed around. And sedatives for those whose constitutions can’t take the suspense.\nIt may have taken five years of being wretched—to go with many, many years of being forlorn—but the Cubs now have Arrieta, Jon Lester, Anthony Rizzo, Starlin Castro, and all those kids, and you never know.\nDo we dare thank owner Tom Ricketts and management guys like Theo Epstein and Jed Hoyer? Nah, let’s hold off until the next round. OK?\nFor now it’s enough to think the Cubs are actually going to St. Louis to do something more than gaze at the arch. They’re too young to choke, too good to fold.\nOh, and one more thing.\nThe Cardinals are used to this post-season stuff, and they know the Cardinal Way will get them into it again. For the Cubs, and their legion of fans, it’s seize the damned cursed moment right here.\nNext year may not be better. This is the perfect time to get that monkey—and the goat and his pal, the cat—off our backs, without drawing more blood.\nOn to the Mississippi!", "external_links": [], "published": "2015-10-08T19:48:00.000+03:00", "crawled": "2015-10-08T23:35:29.349+03:00", "highlightTitle": ""}