{"organizations": [], "uuid": "fb96e9584b5697f2c88216a257c31334aea8f54f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nation.co.ke", "main_image": "\r\n    http://www.nation.co.ke/image/view/-/2920064/medRes/1151900/-/jvqmvnz/-/DNRALLY1309.jpg", "site_section": "http://www.nation.co.ke/news/politics/Uhuru-Mzee-Jomo-Kenyatta-Mausoleum-Parliament/-/1064/2427554/-/view/asFeed/-/43hkos/-/index.xml", "section_title": "Daily Nation | Politics", "url": "http://www.nation.co.ke/news/politics/Raila-strengthens-strategy-team/-/1064/2919994/-/vtbkr2z/-/index.html", "country": "GB", "title": "Raila names new team to spearhead 2017 bid", "performance_score": 0, "site": "nation.co.ke", "participants_count": 0, "title_full": "Raila names new team to spearhead 2017 bid", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T21:18:00.000+03:00", "replies_count": 0, "uuid": "fb96e9584b5697f2c88216a257c31334aea8f54f"}, "author": "", "url": "http://www.nation.co.ke/news/politics/Raila-strengthens-strategy-team/-/1064/2919994/-/vtbkr2z/-/index.html", "ord_in_thread": 0, "title": "Raila names new team to spearhead 2017 bid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Raila"], "text": "More by this Author \nCord leader Raila Odinga is strengthening his presidential strategy team, as co-principal Moses Wetang’ula insisted the coalition’s torchbearer would be chosen in the boardroom. \nMr Odinga, who is focused on his presidential bid, hired former Special Projects Permanent Secretary Andrew Mondoh to lead a team of administrative advisers at his private office. \nMr Mondoh’s appointment is seen as a response by Mr Odinga to pressure from his strategists to strengthen his campaign team. \nAlso coming on board is city-based logistics expert George Mboya. He has been hired by Mr Odinga to re-engineer operations and reorganise the Okoa Kenya Secretariat, also key to the Cord leader’s 2017 politics. \nMr Mboya will assist Mr Carey Orege, the head of the Okoa Kenya Secretariat. He is expected to eventually join Mr Odinga’s new team currently being formed. \nPolitical advisers have called for an overhaul of the team around the former Prime Minister. They want its members to be replaced with less rigid and receptive personalities, capable of designing a powerful political ideology and formula that can work for the opposition leader and his supporters in 2017. \n“Yes, I have come on board as an adviser, largely on consultancy basis on administrative matters,” said Mr Mondoh when contacted. Mr Norman Magaya, who has been playing the role, is expected to be restricted to the Cord Secretariat while Mr Mondoh takes over the core of administrative management at Mr Odinga’s office. \nSeveral personalities identified as major hindrances to the well-being of Mr Odinga’s political welfare would be redeployed, according to ODM officials in the know. \nMr Mboya said: “I have already joined the Okoa Kenya team. And work is on. We are working well with the team in a bid to ensure the mission succeeds.” \nSuna East MP Junet Mohammed said Mr Odinga’s plans were for the general good of the entire Cord fraternity and that whoever becomes the flag bearer of the coalition would benefit from the execution of the planning. \n“Mr Odinga is not working in isolation. The moves, including the invitation of Mr Mondoh into the Cord system, are for the good of all the Cord parties, no matter who becomes the candidate. All we want is to work towards a Cord victory,” said Mr Mohammed. \nIn Mombasa, Mr Wetang’ula said the coalition’s presidential candidate would be chosen “the Pope way”, with the three of them being locked in a room “for as long as possible”. \nMr Wetang’ula urged Cord supporters not to worry about the issue as it would be handled well. \n“The issue will be decided by the three of us. We shall be locked in a room for as long as possible as you wait outside. When you finally see white smoke coming out of the room, then you will know you have your candidate,” he said. \nHe spoke when he presided over the award of Sh13 million bursaries for 2,000 students.", "external_links": [], "published": "2015-10-18T21:18:00.000+03:00", "crawled": "2015-10-19T01:00:28.082+03:00", "highlightTitle": ""}