{"organizations": [], "uuid": "bcca6670edb9088aab31ec370f60cee9929656ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150930200747-jason-chaffetz-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/10/05/politics/jason-chaffetz-house-speaker-race-confrontational/index.html", "country": "US", "title": "Speaker hopeful Jason Chaffetz vows to be more confrontational - CNNPolitics.com", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Speaker hopeful Jason Chaffetz vows to be more confrontational - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "bcca6670edb9088aab31ec370f60cee9929656ea"}, "author": "Manu Raju", "url": "http://www.cnn.com/2015/10/05/politics/jason-chaffetz-house-speaker-race-confrontational/index.html", "ord_in_thread": 0, "title": "Speaker hopeful Jason Chaffetz vows to be more confrontational - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) Utah Rep. Jason Chaffetz vowed Monday a more confrontational line as Speaker of the House, insisting that Republicans should be prepared to see a debt default and a government shutdown in order to pursue their party's agenda.\nIn a wide-ranging CNN interview, Chaffetz also signaled he wouldn't take the battle for Speaker to the House floor if he loses an internal party vote this Thursday, promised a more inclusive style of leadership and lambasted Republican leaders for being too quick \"to cave.\"\nAnd he demanded that the Obama administration name a special prosecutor to open up \"a criminal probe\" into allegations that the Secret Service leaked his personal information in an effort to intimate him.\n\"We don't know how far, wide and pervasive it was,\" he said of the Secret Service's snooping. \"I feel violated.\"\nThe comments by the 48-year-old Chaffetz come as his sudden decision to run for the House's most powerful position has upended the battle to succeed the outgoing Speaker, Rep. John Boehner, R-Ohio. The current House majority leader, Kevin McCarthy of California, had been seen as a shoo-in for the spot.\nRELATED: Why the House Speaker's race just got nasty\nBut McCarthy's comments last week -- when he suggested the Benghazi oversight panel was created to impugn Hillary Clinton -- gave Chaffetz an opening to pitch himself as a skilled communicator the party needs to sell its vision for the future.\nDuring a face-to-face meeting Friday at a New York fundraiser, McCarthy was surprised and angered when Chaffetz told him he would challenge him for the top post.\n\"He wasn't too happy,\" Chaffetz recalled to a group of reporters.\nIn the interview Monday with CNN, Chaffetz took pains not to criticize McCarthy directly, saying that the House majority leader acknowledged his mistake on the Benghazi remarks. But he was sharply critical of the current GOP team's leadership style, saying \"the communications war is not going well.\"\nHe added: \"We just seem to cede that at every level -- and we haven't been taking the fight to the Democrats and the President.\"\nChaffetz wants to take the fight to Senate Republicans, too. The fourth-term Utah Republican strongly rejected Senate Majority Leader Mitch McConnell's insistence that the GOP Congress would keep the government open and never default on the country's debt.\n\"I think it's wrong to signal that you're going to cave in the end,\" Chaffetz said when asked about McConnell's promise. \"I think the Senate majority leader is wrong. I disagree with him.\"\nWith the debt ceiling expected to be reached Nov. 5 and the White House saying it won't negotiate on the issue, Chaffetz added: \"I have no interest in just simply raising the debt ceiling without changing the trajectory of spending.\"\nHow far Chaffetz takes his leadership bid is one of the key questions facing Republicans this week. Chaffetz has been insisting that 50 Republicans would vote against McCarthy on the House floor, keeping the House majority well under the 218 votes necessary to secure the Speakership. But McCarthy has well over the 125 GOP votes needed to secure his conference's nomination to be a candidate for Speaker during a vote on the House floor later this month.\nChaffetz acknowledged he so far lacks the votes but hopes the math changes by Thursday's party elections. If the math doesn't change, Chaffetz acknowledged he would bow out of the fight and spare the party a potentially ugly floor fight.\n\"The candidacy goes through Thursday and then I'll support the nominee,\" Chaffetz said.\nChaffetz has been vague about the agenda he'd pursue as Speaker, other than saying he'd let House committees dictate the policies. Despite supporting bills that some conservatives dislike, including an online sales tax bill known as the Marketplace Fairness Act, he said he would listen to his caucus before pursuing his own ideological agenda.\nHe even said he would work with Democrats, noting that he shares a birthday with House Minority leader Nancy Pelosi.\nEach year, he sends her a note asking her to join him for burgers at \"Five Guys.\" But she has never responded to his invitation.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T23:23:33.590+03:00", "highlightTitle": ""}