{"organizations": [], "uuid": "d1748f5e80fafc9fb392bf5c2157bbca23ba8f0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/newspics/130/13074/1307407.jpg", "site_section": "http://www.arcamax.com/politics/", "section_title": "Politics | ArcaMax Publishing", "url": "http://www.arcamax.com/politics/politicalnews/s-1730669?fs", "country": "US", "title": "Senate isolation now fuels Ted Cruz's presidential bid | Political News", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Senate isolation now fuels Ted Cruz's presidential bid | Political News | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "d1748f5e80fafc9fb392bf5c2157bbca23ba8f0d"}, "author": "arcamax.com", "url": "http://www.arcamax.com/politics/politicalnews/s-1730669?fs", "ord_in_thread": 0, "title": "Senate isolation now fuels Ted Cruz's presidential bid | Political News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON -- Ted Cruz has never been more isolated in the Senate. And that isolation is fueling the Texan's \"outsider\" campaign for the presidency.\nThe latest indication came Monday night, when the tea party Republican sought a vote on scuttling Senate Majority Leader Mitch McConnell's effort to fund the federal government with Planned Parenthood money intact. Cruz sought a \"sufficient second\" on his motion for a roll call vote -- a request that is routinely granted to members of both parties. For the second time this year, he was denied.\nWhen Cruz sought a voice vote, the only \"yes\" in the chamber appeared to come from Utah Sen. Mike Lee. A chorus of Republicans, meanwhile, yelled \"no.\"\nCruz, shot down, let out a deep sigh.\nThen he launched into an hour-long speech excoriating his party leaders, one that captured the unique message driving Cruz's campaign for the Republican nomination at a time when the base's anger toward its leaders has reached a fever pitch.\n\"There is a reason the American people are fed up with Washington. There is a reason the American people are frustrated. The frustration is not simply mild or passing or ephemeral. It is volcanic,\" Cruz said. \"Over and over again, the American people go to the ballot box, over and over again, the American people rise up and say the direction we're going doesn't make sense. We want change. Over and over again, the American people win elections. In 2010, a tidal wave election. In 2014, a tidal wave election. And yet, nothing changes in Washington.\"\nThe feeling behind this anger, Cruz argues, is that Republican leaders make promises to the base while asking for their votes but aren't willing to take bold risks -- like shutting down the government -- to pursue those promises when the going gets tough. No other Republican in the crowded primary field channels that sentiment better than Cruz, and no one else has the same scars while battling GOP leaders.\n\"I will give President Obama and the Senate Democrats credit,\" Cruz said, because \"they are willing to crawl over broken glass with a knife between their teeth to fight for those principles. Unfortunately, leadership on my side of the aisle does not demonstrate the same commitment to principles.\"\nAsked about Cruz's motion, fellow Texas Sen. John Cornyn, the majority whip, said: \"He did get a voice vote, and he lost.\"\nKentucky Sen. Rand Paul offered an even more blunt assessment of the effect that Cruz's attacks on Republican colleagues have had.\n\"He is pretty much done for and stifled, and it's really because of personal relationships, or lack of personal relationships. And it is a problem,\" Paul said Tuesday on Fox News Radio, while granting that he shared many of Cruz's frustrations with Congress.\nThe quintessential irony is that the same actions and rhetoric that have turned Cruz into a pariah with Republican elites have transformed him into an icon with the conservative base. Last week, he received a hero's welcome at the Values Voters Summit of conservatives in Washington, with line after line in his speech receiving a standing ovation -- most notably when he took a parting shot at House Speaker John Boehner, who announced that same day he was resigning, undone by the same anti-establishment anger that Cruz has been stoking.\n\"I listened to (Cruz's) speech, and it was a very good portrayal of what's wrong here in Washington,\" Kentucky Rep. Thomas Massie told Bloomberg. The conservative lawmaker is backing Paul for president.\nAsked if Cruz's rhetoric against Republican leaders helps his presidential campaign, Dan Holler, a spokesman for the conservative pressure group Heritage Action, said: \"The better question is why won't Sen. McConnell use the power of the purse to confront President Obama? It was a promise that he made during the campaign. The unwillingness of the McConnell-led Senate to fight this president is causing many to wonder what difference it really makes.\"\nCruz has few allies left in the Senate. His colleagues are overwhelmingly behind McConnell in his ongoing struggle with Cruz over tactics, having concluded that they won't stick their necks out to fight fights that likely cannot be won while Obama holds the veto pen. In the House, Cruz's tactics have the backing of a group of several dozen dissidents who played a role in bringing down Boehner. But the more moderate Republicans detest his attitude -- and some question his motives.\n\"He's just trying to draw attention to himself for his campaign. I wouldn't use an institution in that way,\" said Rep. Carlos Curbelo, a first-term Republican from Florida who has endorsed Jeb Bush.\n\"People up here are getting tired of the games, of the demagoguery, the empty rhetoric, the grandstanding,\" Curbelo told Bloomberg. \"Politicians shouldn't be in the news for all these ridiculous reasons every day.\"\nTrent Lott, a former Mississippi senator and majority leader, turned angry when asked about Cruz's antics.\n\"I think it's totally inappropriate, out of order, and I resent the hell out of it, quite frankly,\" he said. \"It's not good for society. It's not good for the institution. It's not good for the party. It's not good for America. I don't like it. I don't think what he's doing is helpful at all.\"\nIn a remarkable twist, Cruz also went after Republican donors, saying that a \"very large percentage\" of them \"actively despise our base.\" He added: \"I can tell you when you sit down and talk with a New York billionaire Republican donor -- and I have talked with quite a few New York billionaire Republican donors, California Republican donors, their questions start out as follows. First of all, you've got to come out for gay marriage, you need to be pro-choice, and you need to support amnesty. That's where the Republican donors are. You wonder why Republicans won't fight on any of these issues? Because the people writing the checks agree with the Democrats.\"\nIf the last half-century of history is any indication, alienating Republican elites in this way is a losing strategy for those seeking the presidential nomination. Cruz is hoping to buck that trend with an impressive set of resources, including a fundraising haul that topped $52 million as of July between his campaign and allied super PACs. And the uniquely strong anti-establishment angst doesn't hurt.\nConservative radio host Erick Erickson predicted recently that the primary was headed toward a showdown between Sen. Marco Rubio as the establishment favorite and Cruz as the \"outsider\" candidate.\n\"I suspect we'll see the more conservative elements head to Cruz and the more establishment elements head to Rubio,\" he wrote last week. \"There's still a lot that could change. But right now to me it looks like we are headed toward a Cruz vs. Rubio primary and, given how well the outsiders are doing currently, Cruz has a slight advantage.\"\n(c)2015 Bloomberg News\nVisit Bloomberg News at www.bloomberg.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://twitter.com/share?url=http://www.arcamax.com/politics/politicalnews/s-1730669&hashtags=ArcaMax", "https://plus.google.com/share?url=http://www.arcamax.com/politics/politicalnews/s-1730669", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/politics/politicalnews/s-1730669&h=Senate+isolation+now+fuels+Ted+Cruz%27s+presidential+bid"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T05:17:04.506+03:00", "highlightTitle": ""}