{"organizations": [], "uuid": "5045f6ded0d2ac544b82b654f6c7b5d105125798", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://www.yallpolitics.com/index.php/yp/atom", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/wicker_jackson_desoto_counties_at_risk_of_non-attainment_from_epa_new_rules/", "country": "US", "title": "Wicker: Jackson, DeSoto Counties at risk of Non-Attainment from EPA new rules", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Wicker: Jackson, DeSoto Counties at risk of Non-Attainment from EPA new rules", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T14:05:00.000+03:00", "replies_count": 0, "uuid": "5045f6ded0d2ac544b82b654f6c7b5d105125798"}, "author": "Frank Corder", "url": "http://yallpolitics.com/index.php/yp/post/wicker_jackson_desoto_counties_at_risk_of_non-attainment_from_epa_new_rules/", "ord_in_thread": 0, "title": "Wicker: Jackson, DeSoto Counties at risk of Non-Attainment from EPA new rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wicker Says New Ozone Rule Costly and Unachievable for Many Jackson, DeSoto Counties Now at Risk of Non-Attainment WASHINGTON – U.S. Senator Roger Wicker, R-Miss., today stated that new ozone standards issued by the Environmental Protection Agency (EPA) could negatively impact economic growth, while providing little to no health benefits. The Obama Administration finalized the new standard at 70 parts per billion (ppb), down from a limit of 75 ppb under the Bush Administration. The plan is expected to cost businesses approximately $3.9 billion, most of which is likely to be passed on to consumers. “This new rule is a solution in search of a problem,” Wicker said. “Proponents of the plan argue that reducing the ozone levels will lead to a drop in asthma rates. However, history has shown that while ozone levels have been reduced dramatically over the past few decades, asthma rates continue to rise. I do not believe that EPA can scientifically demonstrate that this rule could have any health benefits for Americans.” Roger McClellan, former chairman of EPA’s Clean Air Scientific Advisory committee, recently said: “The EPA and the environmental lobby claim a stricter ozone standard is needed to reduce asthma cases. But these claims rely on much higher ozone levels from decades ago. Recent history does not support this claimed connection. In fact, for well over a decade, asthma cases have increased by millions while ozone concentrations have declined.” “For many areas around the country, these standards are simply unachievable,” Wicker continued. “Approximately 2,000 counties across the nation, including two in Mississippi, are at risk of being found in non-attainment. People living in these areas could see their federal highway dollars withheld or be forced to install expensive air pollution control technology – all in an effort to comply with the President’s mandate.” Data collected between 2012-2014 show that Jackson County, with an average of 71 ppb, would not meet the new standard. DeSoto County is also close to exceeding the limits with a three-year average of 69 ppb. The consequences of non-attainment also include emissions offset requirements, mandatory vehicles inspections, and economic penalties. 10/1/15 Posted October 2, 2015 - 5:04 am YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-02T14:05:00.000+03:00", "crawled": "2015-10-03T04:11:43.357+03:00", "highlightTitle": ""}