{"organizations": [], "uuid": "b6c08e51a4a3bec3884d052bff78926c02e5bff3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KR535_1008st_G_20151008174504.jpg", "site_section": "http://www.wsj.com/news/world/asia", "section_title": "Asia Business, Finance &amp; Political News - The Wall Street Journal", "url": "http://www.wsj.com/articles/if-a-giant-statue-rises-in-the-indian-jungle-1444783134", "country": "US", "title": "If a Giant Statue Rises in the Indian Jungle...", "performance_score": 0, "site": "wsj.com", "participants_count": 2, "title_full": "If a Giant Statue Rises in the Indian Jungle... - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:38:00.000+03:00", "replies_count": 1, "uuid": "b6c08e51a4a3bec3884d052bff78926c02e5bff3"}, "author": "Gabriele Parussini", "url": "http://www.wsj.com/articles/if-a-giant-statue-rises-in-the-indian-jungle-1444783134", "ord_in_thread": 0, "title": "If a Giant Statue Rises in the Indian Jungle...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS BARODA, India—When the ancient inhabitants of the Greek island of Rhodes built the Colossus, their giant tribute to the sun god Helios, they started a long-lasting trend. More than 2,000 years later, Asia is dotted with towering Buddhas; massive statues of Jesus stand in Poland, Colombia and Brazil.\nBut a huge new monument set to rise on a rocky island in a river surrounded by jungle in western India will dwarf them all. When the planned 590-foot-high tribute is done, it will stand roughly twice as tall as the Statue of Liberty. The subject of this soaring veneration: the late Indian independence leader Vallabhbhai Patel.\nENLARGE Vallabhbhai Patelstatue model Elevators will whisk up to 10,000 visitors a day to an observation deck in the statue’s chest, builders say. There are also plans for what local leaders call “icon-based development”—including helipads, research facilities for fish farming and educational institutions.\nThe project, designers say, would be bigger than the 502-foot-tall Zhongyuan Buddha in Henan, China—now the world’s tallest statue—which is part of a tourism complex that includes a spa and golf course. It would also outstrip a 394-foot-tall Buddha in Japan.\nBy comparison, the Christ the Redeemer statue in Rio de Janeiro, including its pedestal, stands about 130 feet tall, as does a similar-sized monument to Genghis Khan in Mongolia.\nLocal bureaucrats in the Indian state of Gujarat—Patel’s birthplace and the spot where the monument is to be built—say the huge statue has the potential to draw 12 million tourists a year, about twice as many as the Taj Mahal. Also planned: a man-made lake, a hotel and convention center and roads and railways to reach the remote spot.\n“Our question was: What kind of monument can generate the most public welfare?” said K. Srinivas, the state’s top civil servant. “We started looking at the statue’s potential in a scientific and methodical manner.”\nThe monument, called the Statue of Unity, would be a powerful symbol for India’s Prime Minister Narendra Modi, who was elected last year.\nFor most of its 68 years since independence, India has been led by the Congress party, now the main opposition to Mr. Modi, and members of the Nehru-Gandhi family. Their names are on everything from New Delhi’s airport to universities and government welfare programs.\nMembers of Mr. Modi’s Bharatiya Janata Party see Patel, known as “Iron Man” for melding hundreds of princely states into India, as a tough leader who embraced his Hindu roots—qualities supporters say Mr. Modi shares.\nA 33-foot-tall fiberglass model of the Patel statue towers in a courtyard at the studio of its sculptor, Ram Sutar, in a suburb of New Delhi. The figure of Patel is standing, clad in a dhoti, a traditional Indian garment.\nMr. Sutar, 90 years old, has long had a soft spot for monumental pieces, which he dates to his teenage years when a high-school teacher showed him photos of the Statue of Liberty and Mount Rushmore. “It was a seed that was planted in my head,” he said. “Big statues were all I wanted to do.”\nThe new Patel—Mr. Sutar has already done other versions—is going to be his biggest work yet, by far.\n“It’s a statue that is a building, really,” says James Wisniewski, a senior associate at New York-based Michael Graves Architecture & Design, which is working on the project. Construction is supposed to be complete by 2018.\nInside, two concrete tubes will run from the foundations to the top. Elevators will operate inside them. This skeleton will be covered by 20,000 square meters of bronze panels weighing 1,240 metric tons that will give the statue its shape.\nThe BJP-led government of Gujarat has budgeted $500 million for the project, including the statue and related development. As prime minister, Mr. Modi, who previously served as chief minister of Gujarat, set aside $30 million in federal funds to contribute.\nIn a political irony for Mr. Modi, who has launched a “Make In India” campaign designed to boost the country’s manufacturing prowess, the statue’s bronze sheath will be imported from China, according to executives of contractor Larsen & Toubro. One of the executives, who declined to be named, said India “simply doesn’t have the technical capabilities of doing it.”\nA spokesman for the BJP said he saw no contradiction, because even with a larger manufacturing output, India would still need international trade.\nThe statue’s colossal size was set by Mr. Modi when he was head of Gujarat’s state government, according to Mr. Srinivas, who was involved in planning and now heads a government department set up to manage construction.\nThe statue will stand out against surrounding hills and rise higher than a nearby dam, one of India’s largest, he said. The monument’s observation deck will offer sweeping views of the lake behind the dam, which feeds one of the largest webs of irrigation canals in the country.\nNot everyone is a fan. Arjun Modhwadia, who headed Congress opposition to Mr. Modi in the state’s Legislative Assembly from 2004 to 2007, said Patel, a lawyer who gave up his prosperous law practice to join Mahatma Gandhi’s freedom movement, would have disliked the statue as a waste of public money.\n“This huge memorial is against Mr. Patel’s own philosophy,” Mr. Modhwadia said.\nIn its search for new heroes to promote, the BJP has looked deeper into Indian history. In Mumbai, India’s financial capital, the local BJP government is planning a $350 million statue of Chhatrapati Shivaji Maharaj, a 16th-century Hindu ruler.\nMr. Sutar, the sculptor, has already built a model for the Mumbai piece—a giant figure of the king mounted on horseback. The statue, to be erected on an artificial island, is expected to be the tallest equestrian statue in the world.\n—Lilian Lin in Beijing contributed to this article.", "external_links": ["http://si.wsj.net/public/resources/images/HC-GT949_Monume_G_20151013162017.jpg"], "published": "2015-10-14T04:38:00.000+03:00", "crawled": "2015-10-14T03:54:38.717+03:00", "highlightTitle": ""}