{"organizations": [], "uuid": "b9d42796eb3104ce2323d656f646d43d17c35bce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crainsnewyork.com", "main_image": "http://www.crainsnewyork.com/assets/logos/main-logo/C-200x200.jpg", "site_section": "http://feeds.crainsnewyork.com/crainsnewyork/politics", "section_title": "Politics - Crain's New York Business News Feed", "url": "http://www.crainsnewyork.com/article/20151021/FINANCE/151029956", "country": "US", "title": "Dewey & LeBoeuf case is sign of the times for white collar crimes", "performance_score": 0, "site": "crainsnewyork.com", "participants_count": 1, "title_full": "Dewey & LeBoeuf case is sign of the times for white collar crimes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:20:00.000+03:00", "replies_count": 0, "uuid": "b9d42796eb3104ce2323d656f646d43d17c35bce"}, "author": "Bloomberg News", "url": "http://www.crainsnewyork.com/article/20151021/FINANCE/151029956", "ord_in_thread": 0, "title": "Dewey & LeBoeuf case is sign of the times for white collar crimes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 21, 2015 Updated 10/22/2015 Dewey & LeBoeuf case is sign of the times for white collar crimes Prosecutors are losing the fight to keep financial crime under control. By Bloomberg News Comments Email Print × \nFor close watchers of the interactions between the Justice Department and the financial industry, the mistrial in the Dewey & LeBoeuf case was about more than just the fact that a handful of jurors were too overwhelmed by the evidence presented to reach a verdict. The mistrial, after a four months in court and 22 days of deliberations, hints at a much deeper problem: Perhaps most financial crime has simply reached a level of such complexity that it's beyond the reach of the law. \nEver since the financial crisis sent the economy into a spiral, leading to millions of lost jobs and foreclosed homes, there have been public cries to see the bankers responsible for the frauds underpinning the crisis put in jail. This would have fit with the pattern of how things have gone since the beginning of time—booms and bubbles followed by market collapses and crises, followed by tightening of regulations and criminal prosecutions. In the case of 2008, however, the crackdown never really came. Only one high level banker went to prison, and the Justice Department pursued enormous multi-billion-dollar civil penalties against big banks rather than charges against individuals. \nThe U.S. attorney general, the Security and Exchange Commission, Manhattan U.S. Attorney Preet Bharara, and others have taken enormous amounts of criticism for this. But now, several years later, many high profile attempts to charge financial criminals have failed, raising the question of whether the crimes themselves have evolved to a point where the resources designed to combat them are hopelessly out of synch. \nPutting aside the question of whether the Dewey & LeBoef fraud case was a wise one to bring, reports suggest that jurors were overwhelmed by the volume and complexity of the evidence they were asked to consider, which lead to a deadlock. Manhattan District Attorney Cyrus Vance Jr. also suffered losses in a handful of other financial cases, one involving mortgage fraud at tiny Abacus Bank, in Chinatown, and another involving a former Goldman Sachs programmer. In 2009, two Bear Stearns hedge fund managers were acquitted after being charged with lying to their investors about their holdings in dicey mortgage securities, where jurors seemed to have little grasp of what they had done. More recently, the Supreme Court declined to revisit an appeals court decision in an insider trading case, which effectively means that trading on material nonpublic information is legal in New York as long as the person trading on it doesn't know too much about circumstances surrounding the source of the information. \nThe Justice Department acknowledged that things haven't been going too well in this area when it released new guidelines in September for prosecuting corporate crime. One of the key changes, it said, would be that it would focus more on individual financial criminals in the future. There's nothing wrong with bringing an ambitious case to trial and losing. But the pattern suggests that law enforcement may have lost the ability to choose the right cases, or lacks the expertise to try them in a courtroom in a way that makes sense to jurors who draw from the ranks of regular working people struggling to understand the vast and mind-boggling modern financial system.", "external_links": [], "published": "2015-10-21T23:20:00.000+03:00", "crawled": "2015-10-23T21:22:45.037+03:00", "highlightTitle": ""}