{"organizations": [], "uuid": "a8c5a3dd5df56cc80ebea00bd57df97c050bf90a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/cgw30ml88t_749081891_713094.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/649701/1/one-party-cant-develop-ghana-lets-end-winner-takes.html", "country": "US", "title": "One party can't develop Ghana; let's end winner takes all - K. B. Asante", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "One party can't develop Ghana; let's end winner takes all - K. B. Asante", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:06:00.000+03:00", "replies_count": 0, "uuid": "a8c5a3dd5df56cc80ebea00bd57df97c050bf90a"}, "author": "", "url": "http://www.modernghana.com/news/649701/1/one-party-cant-develop-ghana-lets-end-winner-takes.html", "ord_in_thread": 0, "title": "One party can't develop Ghana; let's end winner takes all - K. B. Asante", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["K. B. Asante"], "text": "Politics | 16 October 2015 17:06 CET One party can't develop Ghana; let's end winner takes all - K. B. Asante By MyJoyOnline \nFormer Secretary to Ghana’s first President, Dr. Kwame Nkrumah says building a better Ghana is not dependent on a particular political party or group of individuals. \nBuilding Ghana in K. B. Asante's view, involves a wide agenda, covering many aspects of national life and involving all the people. \n“Only a section of the country cannot build the great dynamics Ghana requires, all must be involved...different people have different ideas but all should lead to the creation of the great and prosperous Ghana we desire”. \nThis if done would make it easy for political parties to agree on particular methods of realising national goals, he said. \nHe believes that it should not be difficult for government to gather experts from the opposition parties to be invited to work on particular issues or projects because in the end, the larger picture should be the development of the nation and not an individual or party. \n“We often hear of the abolition of the winner takes all practice after elections, the phrasing is to suggest that elections are like lotto, but nevertheless the winner alone should not benefit, the money should be shared, all should benefit from the election win and gains... \n“...therefore it should not be impossible to find members of the opposite party whose competence and expertise may be most useful in the administration of the country. \n“It is not wise nor in the interest of the nation to deny such people the opportunity to assist the nation to realise its aims,” he said. \nAccording to him, a winning party should employ experts on the losing side to assist in the development of the nation when necessary. “Taking all give the impression of sharing booty – which unfortunately is prevalent”, he added. \nMany join a party and contribute openly and generously so that in the vent of victory they may be giving posts to make more money, this encourages corruption, he added. \nHe urged on non-political organisations who wish to see the end of the ‘winner takes all’ trend to put forward proposals strong enough to be accepted. \nStory by Ghana | Myjoyonline.com | Naa Sakwaba Akwa | [email protected]", "external_links": [], "published": "2015-10-16T19:06:00.000+03:00", "crawled": "2015-10-18T10:35:44.273+03:00", "highlightTitle": ""}