{"organizations": [], "uuid": "b68304a884d7f7e8bf67a32191ac9bd511eb50ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/10/23/trump-calls-on-super-pacs-supporting-his-bid-to-return-money/", "country": "US", "title": "Trump calls on super PACs supporting his bid to return money", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Trump calls on super PACs supporting his bid to return money | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "b68304a884d7f7e8bf67a32191ac9bd511eb50ce"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/10/23/trump-calls-on-super-pacs-supporting-his-bid-to-return-money/", "ord_in_thread": 0, "title": "Trump calls on super PACs supporting his bid to return money", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published October 23, 2015 Associated Press Facebook 0 Twitter 0 Email Print Republican presidential front-runner Donald Trump is denouncing the outside political action committees supporting his candidacy, demanding they return the money they've collected, and calling on his opponents to do the same.\nTrump's campaign announced Friday that its counsel had sent legal notices to a handful of what they describe as \"unauthorized\" Super PACs supporting his bid, demanding they return any money they've raised in support of his candidacy.\n\"I am self-funding my campaign and therefore I will not be controlled by the donors, special interests and lobbyists who have corrupted our politics and politicians for far too long,\" Trump said in a statement announcing the effort. \"I have disavowed all Super PAC's, requested the return of all donations made to said PAC's, and I am calling on all Presidential candidates to do the same.\"\nThe announcement comes after a series of negative reports by The Washington Post pointing to connections between Mike Ciletti, who was running the Super PAC Make America Great Again, and Trump's campaign. The paper reported that the PAC appeared to have used contact information provided by a Trump aide to contact potential donors.\nTrump's campaign has also been working with two companies associated with Ciletti, according to campaign finance and business records, the paper reported. And Trump appeared at several of the PACs events, including what the campaign described at the time as a meet-and-greet at Trump's daughter's in-laws home over the summer.\nIn the letter to Make America Great Again PAC sent Wednesday, a Trump campaign attorney notes the group's website uses Trump's name, image and slogan. He raised concern that \"potential supporters could be easily confused that when they make a contribution to your organization, they are supporting Donald J. Trump for President's campaign, or that your efforts have been sanctioned or otherwise authorized by him.\"\nThe group did not immediately respond to requests for comment.\nUnder campaign finance regulations, super PACs can raise unlimited contributions, but must disclose their donors and are specifically barred from coordinating with campaigns.\nPaul Ryan, of the Campaign Legal Center, said that makes it difficult for Trump's campaign to regulate the groups' actions.\n\"Under the campaign finance laws, they have zero authority,\" he said.\nTrump, a billionaire businessman and entertainer, has boasted about turning down big-dollar contributions and said he is self-funding his campaign -- a pitch that appeals to backers weary of the role of money in politics.\nBut financial disclosures released this month show the majority of Trump's expenses in recent months have, in fact, been covered by contributions from donors, including thousands of small-dollar checks.\nThe Supreme Court's Citizens United decision in 2010 dramatically changed the way campaigns operate, and this cycle has become a test of the boundaries for such big-money groups.", "external_links": ["http://www.ap.org/"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T23:04:47.051+03:00", "highlightTitle": ""}