{"organizations": [], "uuid": "b4d4a0a57bf79c7b7bf41c4e6c5764731d35cb60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theatlantic.com", "main_image": "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/RTS2C4U/facebook.jpg?1444942953", "site_section": "http://www.theatlantic.com/politics/", "section_title": "Politics - The Atlantic", "url": "http://www.theatlantic.com/politics/archive/2015/10/the-man-behind-the-dead-baby-signs/410845/", "country": "US", "title": "Q&A With Eric Scheidler, Head of the Pro-Life Action League", "performance_score": 1, "site": "theatlantic.com", "participants_count": 53, "title_full": "Q&A With Eric Scheidler, Head of the Pro-Life Action League - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:03:00.000+03:00", "replies_count": 96, "uuid": "b4d4a0a57bf79c7b7bf41c4e6c5764731d35cb60"}, "author": "Ruth Graham", "url": "http://www.theatlantic.com/politics/archive/2015/10/the-man-behind-the-dead-baby-signs/410845/", "ord_in_thread": 0, "title": "Q&A With Eric Scheidler, Head of the Pro-Life Action League", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In July, an activist group called the Center for Medical Progress began to release a series of undercover videos meant to “expose” Planned Parenthood. Most of the attention to the videos has focused on whether they prove the organization engaged in illegal sales of fetal-tissue harvesting. So far, despite multiple state investigations and four congressional hearings, they have not proved that. But the videos’ real aim seems to be prompting a purely visceral reaction among the public.\nRelated Story The Long GOP Fight to Defund Planned Parenthood\nThis is a tactic that some anti-abortion activists have been using for years in a more low-tech form: displaying graphic images of aborted fetuses in public places. This aggressive approach is extraordinarily unpopular outside activist circles for obvious reasons. And even within the anti-abortion community, it is sometimes viewed as an extreme tactic. In September, the president of the large anti-abortion organization Students for Life of America, Kristan Hawkins, wrote a column for the conservative website Townhall in which she compared the use of such images to screaming outside an abortion clinic, and questioned their relevance. (She did not condemn their use altogether.)\nBut overall, despite the revulsion it provokes, the tactic seems to be becoming more common within the anti-abortion community. Organizations including the Anti-Choice Project, Show the Truth, the Center for Bioethical Reform, and Survivors of the Abortion Holocaust now make such displays a significant part of their activism.", "external_links": ["http://townhall.com/columnists/kristanhawkins/2015/09/04/new-strategies-for-a-new-prolife-generation-n2047628"], "published": "2015-10-16T14:03:00.000+03:00", "crawled": "2015-10-16T13:28:04.464+03:00", "highlightTitle": ""}