{"organizations": [], "uuid": "08d5aeda5d24fb909fcc6d3ba760825ad180a439", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30276751/fci-federal-reaches-new-collective-bargaining-agreement-with-uscis-california-service-center-workers", "country": "US", "title": "FCi Federal Reaches New Collective Bargaining Agreement with USCIS California Service Center Workers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "FCi Federal Reaches New Collective Bargaining Agreement with USCIS California Service Center Workers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "08d5aeda5d24fb909fcc6d3ba760825ad180a439"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30276751/fci-federal-reaches-new-collective-bargaining-agreement-with-uscis-california-service-center-workers", "ord_in_thread": 0, "title": "FCi Federal Reaches New Collective Bargaining Agreement with USCIS California Service Center Workers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FCi Federal\nASHBURN, Va. , Oct. 16, 2015 /PRNewswire-USNewswire/ -- FCi Federal today announced that the firm has reached a new, five-year collective bargaining agreement with workers at the U.S. Citizenship and Immigration Service's California Service Center in Laguna Niguel . The agreement, struck late Thursday night between FCi Federal and leaders of Local 1008 of the United Electrical, Radio and Machine Workers of America, next moves to a ratification vote by the bargaining unit's approximately 350 workers.\nSharon D. Virts , Founder and Chief Executive of FCi Federal, hailed the agreement as the product of intensive but respectful negotiations.\n\"We are proud of this agreement because it strikes a balance between the need for fiscal responsibility in a time of economic challenges and our employees' desire for fair wages and benefits,\" Ms. Virts said. \"Most importantly, the agreement enables us to provide long-term stability and continuity of service to the immigrant population that relies on us.\"\nThe California Service Center provides vital record-keeping and document-processing services for immigrants in the Western United States .\nAbout FCi Federal\nOperating in more than 40 states and territories, FCi Federal is one of the fastest growing government services firms in the industry providing a wide range of managed professional, administrative and technical services to federal agencies. With 24 years of experience in the Federal market, FCi brings depth and breadth of resources and engaged leadership to manage complex Government programs, ranging from operating large production centers to providing integrated mission support services for geographically distributed operations. The company's nearly 3000 employees put their core expertise in program management support, records management, adjudication support, fraud detection and other administrative support services to work in ways that routinely outperform expectations. More information about FCi Federal can be found at http://www.fcifederal.com/ .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/fci-federal-reaches-new-collective-bargaining-agreement-with-uscis-california-service-center-workers-300161113.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY30296&Transmission_Id=201510160830PR_NEWS_USPR_____NY30296&DateId=20151016", "http://www.xmlnews.org/ns/", "http://www.fcifederal.com/", "http://www.prnewswire.com/news-releases/fci-federal-reaches-new-collective-bargaining-agreement-with-uscis-california-service-center-workers-300161113.html"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T16:10:20.887+03:00", "highlightTitle": ""}