{"organizations": [], "uuid": "7703d28a91b2e21b9fdd029559a2413d08df1a00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30262112/the-cap-foundation-strengthens-see-test-treat-cancer-screening-program-for-women-at-risk", "country": "US", "title": "The CAP Foundation Strengthens See, Test & Treat Cancer Screening Program For Women At Risk", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The CAP Foundation Strengthens See, Test & Treat Cancer Screening Program For Women At Risk - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "7703d28a91b2e21b9fdd029559a2413d08df1a00"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30262112/the-cap-foundation-strengthens-see-test-treat-cancer-screening-program-for-women-at-risk", "ord_in_thread": 0, "title": "The CAP Foundation Strengthens See, Test & Treat Cancer Screening Program For Women At Risk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " College of American Pathologists\nNORTHFIELD, Ill. , Oct. 14, 2015 /PRNewswire-USNewswire/ -- With the launch of yet another collaboration, the College of American Pathologists (CAP) Foundation's See, Test & Treat ® program, a pathologist-led cervical and breast cancer screening program, continues to gain validation as an innovative model for reaching at-risk populations.\nMost recently, the Cancer Prevention and Research Institute of Texas (CPRIT) and the CAP Foundation announced a pilot program that will extend the funding and scope of See, Test & Treat in Texas . Just last year, the Robert Wood Johnson Foundation awarded a grant to the CAP Foundation that affirmed See, Test & Treat is a well-articulated program that is implemented in a consistent manner across many different kinds of health care settings serving highly diverse populations.\n\"These are significant strides for See, Test & Treat, which is proving to be an effective coordinated care model to advance public health,\" said Rhode Island pathologist Latha Pisharodi , MD, FCAP, recent recipient of the CAP Foundation's Herbek Humanitarian Award, which awards a grant for continued program innovation to pathologists engaged in See, Test & Treat.\nCAP pathologists lead the coordination of each See, Test & Treat cervical and breast cancer screening programs, bringing together pathologists, gynecologists, radiologists, family medicine practitioners, laboratory technicians, nurses, outreach specialists and community advocates for screenings, test results, follow-up care and health education counseling. Each program serves medically at-risk populations faced with financial, linguistic, social, and cultural barriers to health care.\nThrough CPRIT's collaboration with the CAP, CPRIT will award up to $25,000 for each See, Test & Treat program to provide screenings with same-day results for uninsured and underserved women in Texas . Guidance and educational materials will be provided by the CAP Foundation. Applications must be submitted by January 7, 2016 .\n\"As physicians who diagnose disease, pathologists understand the value of routine cervical and breast cancer screening. We must help women realize the need for regular cancer screening,\" said CAP Foundation Board President Jennifer Laudadio , MD, FCAP. \"That's why we are thrilled to be collaborating with CPRIT and expanding our reach to serve more women in Texas .\"\n\"Our collaboration with the CAP Foundation underscores CPRIT's emphasis on targeting populations in Texas where significant disparities in cancer incidence and mortality exist,\" said Becky Garcia , PhD, CPRIT's chief prevention and communications officer. \"By providing Texas women screenings and opportunities to learn more about their risks, we can detect cancers earlier, when the potential for survival is greatest.\"\nBreast cancer is expected to take the lives of nearly 3,000 women in Texas this year and cervical cancer will account for close to 400 deaths, according to the Texas Cancer Registry. The incidence of both breast and cervical cancer among minority women is higher and is more likely to be fatal compared to the general population.\n\"See, Test & Treat allows women to be seen, tested, and referred for follow up care in one visit, removing significant barriers, including financial, language, transportation, or the need to take additional time off work,\" Dr. Garcia noted.\nSince 2010, the program has provided services to women in 12 U.S. cities, including three in Texas-Austin, Houston and Conroe. In Austin, more than 15 percent of the women screened had abnormal mammograms.\nFor general information on eligibility criteria, the application process and other details about the CPRIT grant visit www.cprit.state.tx.us/funding-opportunities .\nAbout the College of American Pathologists and CAP Foundation\nAs the leading organization for board-certified pathologists, the College of American Pathologists (CAP) serves patients, pathologists, and the public by fostering and advocating excellence in the practice of pathology and laboratory medicine worldwide. With 18,000 physician members, the CAP has led as the gold standard in laboratory accreditation for 50 years with more than 7,600 CAP-accredited laboratories in 50 countries. Find more information about the CAP at cap.org . Follow CAP on Twitter at @pathologists .\nThe CAP Foundation , its philanthropic arm, supports patient-centered and humanitarian initiatives led by pathologists, striving to connect people in underserved communities with the specialized skills of pathologists.\nCAP Foundation funding for See, Test & Treat is made possible through the continued generous support of CAP member pathologists, staff, foundations, industry, and private donations. Learn more and donate: foundation.cap.org . Contact the CAP Foundation capfnd@cap.org or follow us on Twitter at #seetesttreat.\nAbout CPRIT\nSince 2009, CPRIT has awarded more than $1.35 billion in grants to Texas researchers, institutions and organizations. CPRIT provides funding through its academic research, prevention and product development research programs. Programs made possible with CPRIT funding have reached all 254 counties of the state, brought nearly 100 distinguished researchers to Texas , advanced scientific and clinical knowledge, and provided nearly 2.5 million life-saving education, training, prevention and early detection services to Texans. Learn more at www.cprit.texas.gov . Follow CPRIT on Twitter @CPRITTexas and Facebook.\nLogo - http://photos.prnewswire.com/prnh/20151014/276920LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-cap-foundation-strengthens-see-test--treat-cancer-screening-program-for-women-at-risk-300159876.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "https://twitter.com/hashtag/SeeTestTreat?src=hash", "https://photos.prnewswire.com/prnvar/20151014/276920LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC28316&Transmission_Id=201510141627PR_NEWS_USPR_____DC28316&DateId=20151014", "http://www.cprit.state.tx.us/funding-opportunities", "http://www.foundation.cap.org/", "https://twitter.com/pathologists", "http://www.cprit.texas.gov/", "http://foundation.cap.org/", "http://twitter.com/CPRITTexas", "http://www.cap.org/", "http://www.prnewswire.com/news-releases/the-cap-foundation-strengthens-see-test--treat-cancer-screening-program-for-women-at-risk-300159876.html", "http://photos.prnewswire.com/prnh/20151014/276920LOGO"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:54:38.642+03:00", "highlightTitle": ""}