{"organizations": [], "uuid": "9d62e5096cc5f3d7e3bbce98aee7224a46f36727", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.contracostatimes.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1024/20151024__vigil~3.JPG", "site_section": "http://feeds.contracostatimes.com/mngi/rss/CustomRssServlet/571/200827.xml", "section_title": "Politics", "url": "http://www.contracostatimes.com/breaking-news/ci_29019380/hurricane-patricia-bay-area-latinos-relieved-catastrophe-was?source=rss", "country": "IL", "title": "Hurricane Patricia: Bay Area Latinos relieved catastrophe was averted", "performance_score": 0, "site": "contracostatimes.com", "participants_count": 1, "title_full": "Hurricane Patricia: Bay Area Latinos relieved catastrophe was averted", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T04:21:00.000+02:00", "replies_count": 0, "uuid": "9d62e5096cc5f3d7e3bbce98aee7224a46f36727"}, "author": "Tracy Seipel and Gary Peterson Bay Area News Group", "url": "http://www.contracostatimes.com/breaking-news/ci_29019380/hurricane-patricia-bay-area-latinos-relieved-catastrophe-was?source=rss", "ord_in_thread": 0, "title": "Hurricane Patricia: Bay Area Latinos relieved catastrophe was averted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted: 10/24/2015 06:15:01 PM PDT Updated: 10/24/2015 07:21:06 PM PDT Bay Area Latinos breathed a collective sigh of relief Saturday after all the roar about Hurricane Patricia, predicted to be \"the most dangerous storm in history,\" proved to be more of a purr. \nBut until then, the damage Patricia was expected to inflict on relatives and friends back in Mexico had kept many pacing, anxious about the possible disaster that lay ahead for loved ones. \nThe mounting worries were enough to send hundreds of Latino residents to churches and vigils where they leaned heavily on their faith. \n\"It just shows you the power of prayer,\" said a jubilant Alicia Lopez on Saturday morning, hours after news that the hurricane's strength had been significantly downgraded. Parishioners attend a vigil mass at Our Lady of Guadalupe Church in San Jose, Calif., Friday, Oct. 23, 2015. They were praying for their loved ones who live in areas of Mexico that may be impacted by Hurricane Patricia.(Patrick Tehan/Bay Area News Group) ( Patrick Tehan ) \nLopez, 66, was one of 60 members of a prayer group that had spent Friday night through Saturday morning at Our Lady of Guadalupe Parish in San Jose, singing, praying and meditating about her native country's safety, she said. \nPastor Jon Pedigo, who had held a special Mass attended by 300 on Friday night and about 90 parishioners early Saturday, said many of the church's members hail from Michoacan and Jalisco, two Mexican states that border the Pacific Ocean and were expected to be walloped by Patricia. \n\"I told them they have two options right now: Go home and watch your TV and the Internet and worry by yourself, or come to church to be with others and pray,\" Pedigo said. Advertisement \nBut their praying isn't over yet, he noted, because he expects many Mexicans still suffered even from the weakened hurricane and will need help in the form of donations. \nAcross the bay in Concord, Alejandra Macias was at St. Francis de Assisi School participating in an annual Aztec ceremony celebrating rain. \n\"We want the rain,\" Macias said ironically Saturday morning. \"My family doesn't want anymore rain.\" \nThe Concord resident said her parents and siblings, who live in her hometown of Guadalajara, were soaked but safe. \n\"It's a lot of water, but they're OK,\" she said. \"Their home is safe.\" \nWhen she first saw news reports of the colossal hurricane on Facebook, Macias said she wondered if it was a joke. \n\"Something told me, just call and find out,\" she said. \n\"My mom said, 'It's raining so much right now, it's lots of water.' My sister told me that her husband and my niece, they stopped working like noonish.\" \nMacias said the media there told her relatives: \"It's really, really bad; there's no category for this. It's never been seen in history, so go back home, don't go to school, nothing.' So they were at home all the time just praying.\" \nFollowing Saturday's daylong rain ceremony, Macias said participants were going to discuss how they could assist relief efforts. \n\"We're going to talk about it so we can do something -- contribute money or send clothing, anything that we can do,\" she said. Contact Tracy Seipel at 408-920-5343. Follow her at Twitter.com/taseipel .", "external_links": [], "published": "2015-10-25T04:21:00.000+02:00", "crawled": "2015-10-25T05:20:13.454+02:00", "highlightTitle": ""}