{"organizations": [], "uuid": "968cb008efb240b5d4cb9aa2deac1151f34181af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30323809/paper-eskimo-proudly-supports-the-stars-of-the-season-fundraiser-held-for-banner-childrens-at-cardon-childrens-medical-center", "country": "US", "title": "Paper Eskimo Proudly Supports the Stars of the Season Fundraiser Held for Banner Children's at Cardon Children's Medical Center", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Paper Eskimo Proudly Supports the Stars of the Season Fundraiser Held for Banner Children's at Cardon Children's Medical Center - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "968cb008efb240b5d4cb9aa2deac1151f34181af"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30323809/paper-eskimo-proudly-supports-the-stars-of-the-season-fundraiser-held-for-banner-childrens-at-cardon-childrens-medical-center", "ord_in_thread": 0, "title": "Paper Eskimo Proudly Supports the Stars of the Season Fundraiser Held for Banner Children's at Cardon Children's Medical Center", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Paper Eskimo\nThe 6th annual Stars of the Season fundraiser, supporting the philosophy 'Music IS Therapy,' is being held to help establish a Sophie's Place at Banner Children's Cardon Children's Medical Center. The soiree is being thrown on Saturday, October 24th, at the JW Marriott Camelback Inn Resort and Spa in Scottsdale, Arizona\nPHOENIX , Oct. 22, 2015 /PRNewswire/ -- Paper Eskimo has not only generously donated to the event, but one of the leading entrepreneurs at Paper Eskimo gives her time to serve as one of the Chairwomen of the event.\nLogo - http://photos.prnewswire.com/prnh/20151021/279213LOGO\nBanner Children's Cardon Children's Medical Center states the following mission: \"We exist to make a difference in people's lives through excellent patient care . \" They value patient care and health above all other things. The goal of the children's center is to create a colorful, engaging, and child-friendly heath center, which kids will be happy to visit.\nThe guiding philosophy 'Music IS Therapy,' emphasizes the importance of music therapy in pediatric care. Music therapy has been proven to help control pain, lower anxiety, and improve morale. It is also fun and engaging. It give children the opportunity to learn about music, and even become musicians themselves.\nPaper Eskimo is a global paper parties supply company whose goal is to turn life into a celebration. They make beautiful, boutique style paper party produces which can turn any party into a memorable delight. Paper Eskimo has donated generously to the Stars of the Season fundraising event. One of the cornerstones of the fundraising event is an auction. Among Paper Eskimo's donations were an Alaskan Cruise which is available to anyone who donates generously through the auction.\nJoanna Palmer , one of the passionate and enthusiastic entrepreneurs behind Paper Eskimo also donates her time by sitting on the advisory council that organizes the event.\n\"Working with Banner Children's at Cardon Children's Medical Center has been one of the most rewarding experiences of my life. I have been so happy to organize the Stars of the Season fundraiser. This is an incredible cause, and the support we have already received has been magnificent. I know Paper Eskimo feels very passionately about this cause and have been delighted to offer their support,\" said Joanna Palmer , a member of the Stars of the Season Advisory Council.\nAbout Paper Eskimo\nPaper Eskimo's award-winning designs have created joy and memories to many celebrations around the world for the past 10 years. Leading the market with a unique and stylish vision, Paper Eskimo has changed the way people celebrate their events.\nContact Information\nJoanna Palmer\ninfo@papereskimo.com\n800-597-5137\nhttp://papereskimo.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/paper-eskimo-proudly-supports-the-stars-of-the-season-fundraiser-held-for-banner-childrens-at-cardon-childrens-medical-center-300164100.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY34665&Transmission_Id=201510220700PR_NEWS_USPR_____NY34665&DateId=20151022", "http://www.prnewswire.com/news-releases/paper-eskimo-proudly-supports-the-stars-of-the-season-fundraiser-held-for-banner-childrens-at-cardon-childrens-medical-center-300164100.html", "http://papereskimo.com/", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20151021/279213LOGO"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T19:29:30.850+03:00", "highlightTitle": ""}