{"organizations": [], "uuid": "c076d6e5c68c87eb8b7bde84de67bfaf6cb85d1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/70/80/1048865845429e5e5c7787e7908f/20150902-joe-biden-ap-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/joe-biden-2016-democrats-214446", "country": "US", "title": "Joe Biden 2016 backers step up activity for 2016 bid", "performance_score": 1, "site": "politico.com", "participants_count": 3, "title_full": "Joe Biden 2016 backers step up activity for 2016 bid - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:29:00.000+03:00", "replies_count": 2, "uuid": "60c469d99395552b87681842f17b8c5d30dcbc31"}, "author": "Anna Palmer", "url": "http://www.politico.com/story/2015/10/joe-biden-2016-democrats-214446#post-0", "ord_in_thread": 0, "title": "Joe Biden 2016 backers step up activity for 2016 bid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Joe Biden allies are moving into high gear to prepare for a potential 2016 bid — collecting resumes for potential campaign staffers, assembling fundraising lists and referring public endorsements to his political team. The effort comes as Biden confidants expect a decision from the vice president about whether he'll jump into the race to come as soon as next weekend, or shortly thereafter.\nThe desire to have a Biden campaign operation ready to swing into action after an announcement was underscored in an email Democratic fundraiser Scott Dworkin sent in late September looking for names of potential staffers for a Biden campaign.\nDworkin and Sam Jones, of Bull Dog Finance Group, were hired in June to lead the Draft Biden super PAC's finance operation. The two worked on President Barack Obama's 2008 and 2012 presidential campaigns and were also involved in the \"Run Warren Run\" presidential draft movement.\n\"If you or any friends have interest in submitting your resume for the potential Biden campaign please submit to Sam who is ccd!\" Dworkin wrote, noting that the email didn't mean he is jumping into the race.\nClinton on whether she would consider VP position: Hypothetically, no By Nick Gass\nThe email was sent to K Streeters and Democratic operatives.\nA senior adviser to the Draft Biden said the email was not part of the super PAC's efforts.\n\"A consultant to Draft Biden got a little excited and genuinely wants to help but that was not part of an official Draft Biden ask,\" the adviser said.\nFor now, the adviser said Draft Biden is focused on Super Tuesday states and looking at hiring people in those states.\nStill, the email is just one concrete sign of Biden backers working behind-the-scenes to prepare for a run. Fundraisers and bundlers have been putting together lists of potential donors who have pledged to cut checks once he makes an official announcement. Biden supporters have also lined up endorsements and supporters in early primary states.\nEager would-be staffers have been reaching out to people throughout the Biden orbit, some of whom have gotten dozens of resumes. Others have been interviewing with people affiliated with Draft Biden. Some of those people have left the discussions with the impression that they’re in touch directly with the prospective campaign, and that they’re being lined up for staff jobs.\nDraft Biden spokesman Brad Bauman said the group \"is not in the position to interview, or hire, or screen for official campaign roles, if or when an official campaign develops.\"\nEdward-Isaac Dovere contributed to this report.\n<div", "external_links": [], "published": "2015-10-05T13:29:00.000+03:00", "crawled": "2015-10-06T02:02:59.331+03:00", "highlightTitle": ""}