{"organizations": [], "uuid": "bbd68a40cedb2af90544649288188772d7885a79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/1hotdish101115.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/politics/index.rss2", "section_title": "Politics", "url": "http://www.startribune.com/permit-to-carry-class-offers-real-life-firearm-education/331889551/", "country": "US", "title": "Permit-to-carry class offers real-life firearms education", "performance_score": 0, "site": "startribune.com", "participants_count": 12, "title_full": "Permit-to-carry class offers real-life firearms education - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T00:57:00.000+03:00", "replies_count": 11, "uuid": "d2753f7f204009ef94c63efda668848559e79e11"}, "author": "Abby Simons", "url": "http://www.startribune.com/permit-to-carry-class-offers-real-life-firearm-education/331889551/#post-0", "ord_in_thread": 0, "title": "Permit-to-carry class offers real-life firearms education", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gunshots thundered around me as my instructor, Rob Doar, loaded a clip into 9-millimeter Glock 19 and handed it to me. It was lighter than I thought it would be, but my arms felt weak. The extent of my exposure to handguns growing up was the holstered pistol my cop dad told me never to touch. Then a decade as a reporter showed me — sometimes up close — the damage they could do.\nYet here I stood, gauging my aim while pondering how bizarre it was that my safety and that of everyone around me at Bill’s Gun Range in Circle Pines depended only on mutual trust and responsibility.\nI was snapped back to reality by a gentle, repeated reminder from Doar to get my thumb out from behind the slide, unless I wanted to wear a deep railroad track-shaped cut from the shell ejection. Focusing on the mechanics I’d been taught instead of my existential angst, I took a deep breath and squeezed the trigger.\nDoar, political director of the Minnesota Gun Owners Political Action Committee, had invited me to one of the Minnesota Permit to Carry a Firearm classes he teaches through his company, Aegis Outdoors. Because I write about gun legislation at the Capitol, I thought it would be a good idea to learn more about firearms firsthand and what it takes to join the 200,000 Minnesotans who have permits to carry them. I joined Jenna and Michael Ruhland at their White Bear Lake home, along with two of their friends. The Ruhlands, business owners who decided to carry because of their sometimes late hours, have been permit holders since 2010 and were undergoing their mandatory training to renew. Although I have handled rifles under close supervision while deer hunting, I was the newbie when it came to handguns.\nDuring the extensive five-hour course, Doar taught us the history of the state’s 12-year-old law, and warned us that bringing a gun to a situation never makes it easier. He told us that while he carries to protect his family, property is just stuff, and a gun should never be used to protect it. He termed it his “shark tank analogy” — would you jump into a tank of live sharks for it?\nThe gun boomed and the muzzle flashed while the hot shell casing tinkled to the floor. I peered at the man-shaped paper target, and there was my bullet hole — not far from where the lungs would be. I took a few deep breaths before I composed myself to fire again. Another, near the heart. Doar told me to aim for the head.\nAfter a few dozen rounds, the target was riddled with bullet holes — most in areas that could mortally wound a human. Although I felt good, I considered my initial nerves and wondered if I’d do as well in a high-stress, real-life situation.\n“Not bad for a beginner,” Doar said, motioning to the cluster as he signed my class completion certificate. All I had to do was bring it and a $100 application fee to my sheriff, and I’d be another Minnesotan certified to carry a gun.\nWill I put in my application? Maybe, just because I can. But I’m certain it’ll take several more trips to the range before I even consider packing.", "external_links": [], "published": "2015-10-11T00:57:00.000+03:00", "crawled": "2015-10-11T05:04:27.939+03:00", "highlightTitle": ""}