{"organizations": [], "uuid": "b939595bcec0c8f1212367ad109be752f06845be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-3ed957958e28f2e757708bd6ca808cc4.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/obama-lets-china-off-the-hook-for-currency-manipulation/article/2574452?custom_click=rss", "country": "US", "title": "Obama lets China off the hook for currency manipulation", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Obama lets China off the hook for currency manipulation | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T20:42:00.000+03:00", "replies_count": 0, "uuid": "b939595bcec0c8f1212367ad109be752f06845be"}, "author": "Joseph Lawler", "url": "http://www.washingtonexaminer.com/obama-lets-china-off-the-hook-for-currency-manipulation/article/2574452?custom_click=rss", "ord_in_thread": 0, "title": "Obama lets China off the hook for currency manipulation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Obama administration declared Monday in its semi-annual report to Congress that China is not a currency manipulator, even though most see China's recent moves to devalue its currency as an attempt to boost its exports and shore up its struggling economy.\nStill, the Treasury Department said in its report that neither China nor any other of the United States' major trading partners manipulate their currency.\nThe report covers the period in which the Chinese government oversaw a steep depreciation in its currency, a move that drew unusually vocal criticism from U.S. manufacturers. Concerns about China manipulating the yuan have taken renewed prominence as the U.S. moves toward voting on a Pacific-nation trade deal that critics complain doesn't do enough to penalize trading partners for currency manipulation.\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ The Treasury concluded in its report that \"the near-term trajectory of [China's currency] is difficult to assess\" and that \"our judgment is that the [renminbi] remains below its appropriate medium-term valuation.\" That language may be less aggressive than has been the case for Treasury's recent reports, which warned that the renminbi was \"significantly undervalued.\"\n  Senate considers bill to lighten mandatory minimum sentences Legislation aims to curb overcrowding in prisons.\nBy Kelly Cohen • 10/19/15 5:22 PM The report was released nearly a month after Chinese President Xi Jinping visited Washington, D.C., and met with Obama on a range of issues.\nAmid news of slowing economic growth, China announced a change to the calculation of the reference rate it uses to guide trading of its currency on Aug. 11, a move that stunned investors. Through September, the renminbi was down 2.3 percent against the dollar, according to the Treasury.\nThe move led to volatility in markets that didn't expect a change in the exchange rate policy, which Treasury said underscores \"the importance of conducting macroeconomic policy transparently.\"\nTop Story Bill Clinton to campaign in Iowa His   event where   Perry.\nBy Ariel Cohen • 10/19/15 2:28 PM", "external_links": [], "published": "2015-10-19T20:42:00.000+03:00", "crawled": "2015-10-20T00:58:54.969+03:00", "highlightTitle": ""}