{"organizations": [], "uuid": "b1056cf116d0e335ed6a58e768ebc6ec83675339", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/baton_rouge_crime/photo/angola-execution-lethal-injection-chamber-e93b37dca540d615.jpg", "site_section": "http://www.nola.com/politics/index.ssf/2015/10/", "section_title": "October, 2015 Monthly News Archives | Louisiana Politics &amp; Government - NOLA.com", "url": "http://www.nola.com/politics/index.ssf/2015/10/states_consider_electrocution.html", "country": "US", "title": "States consider electrocution, hanging, firing squads as execution drugs get hard to find", "performance_score": 0, "site": "nola.com", "participants_count": 9, "title_full": "States consider electrocution, hanging, firing squads as execution drugs get hard to find | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:44:00.000+03:00", "replies_count": 8, "uuid": "b1056cf116d0e335ed6a58e768ebc6ec83675339"}, "author": "Associated Press", "url": "http://www.nola.com/politics/index.ssf/2015/10/states_consider_electrocution.html", "ord_in_thread": 0, "title": "States consider electrocution, hanging, firing squads as execution drugs get hard to find", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ohio's decision to delay executions another full year while it hunts for lethal injection drugs highlights an ongoing dilemma faced by the remaining death penalty states.\nAlthough support for capital punishment continues, states are struggling to find a legal means to carry it out, and that has created an opening for opponents hoping to end the death penalty permanently.\n\"It really underscores the public's growing distrust and dissatisfaction with state corrections departments being able to administer the death penalty,\" Kevin Werner, who leads Ohioans to Stop Executions, said Tuesday.\nShortages and legal fights over drugs and their source are occurring in several states, among them Arkansas, Nebraska and Oklahoma. Yet capital punishment supporters say older methods such as hanging, electrocution and the firing squad are still viable options.\n\"We've got plenty of electric and plenty of rope,\" said state Sen. Bill Seitz, a Cincinnati Republican.\nOn Monday, Ohio Gov. John Kasich used reprieves to move 11 executions scheduled next year and one in early 2017 further into the future. Ohio now has 25 inmates scheduled to die, including some in 2019.\nOhio's prison agency said it needs more time to find drugs. It hasn't executed anyone since January 2014.\nDeath penalty supporters acknowledge the shortage could be the wedge in the door that leads to abolition of capital punishment. In central Ohio, Franklin County Prosecutor Ron O'Brien complains the state has \"a functional moratorium\" in place.\nNebraska currently has no way to execute inmates because it lacks two of the three required lethal injection drugs for its protocol. Voters will decide next year whether to keep a legislative repeal of capital punishment in place.\nLike Ohio, Nebraska has looked overseas for execution drugs, which the Food and Drug Administration opposes. Two years ago, a federal appeals court ruled in a case brought by death row inmates in Tennessee, Arizona and California that the FDA was wrong to allow sodium thiopental to be imported for use in executions.\nCongress could easily correct that ruling to allow such importation, said Kent Scheidegger, executive director of the California-based Criminal Justice Legal Foundation, which supports capital punishment.\n\"It is preposterous that well-deserved and already excessively delayed sentences are further delayed due to a completely artificial shortage of lethal injection drugs,\" Scheidegger said.\nLast week, the attorney general's office in Oklahoma announced no executions will be scheduled until at least next year as the office investigates why the state used the wrong drug during a lethal injection in January and nearly did so again last month.\nEarlier this month, an Arkansas judge halted executions of eight inmates who are challenging a law that allows the state to withhold any information that could publicly identify the manufacturers or sellers of its execution drugs.\nOn Oct. 1, Virginia executed serial killer Alfredo Prieto, but only after obtaining pentobarbital from the Texas prison system. Texas has continued to purchase supplies of compounded pentobarbital without saying how much it has or where it came from.\nOther death penalty states also are looking at alternatives to lethal injection. Tennessee passed a law last year to reinstate the electric chair if it can't get lethal drugs, and Utah has reinstated the firing squad as a backup method.\nOklahoma approved nitrogen as an alternative method. But that's just as flawed as lethal injection because it confuses medicine with punishment, said Robert Blecker, a New York Law School professor who favors capital punishment for the worst offenders.\nBlecker, author of \"The Death of Punishment: Searching for Justice Among the Worst of the Worst,\" notes there has never been a botched execution by firing squad.\n\"How we kill those whom we rightfully detest should in no way resemble how we put to sleep beloved pets and how we anesthetize ourselves,\" he said.", "external_links": ["http://www.cleveland.com/open/index.ssf/2015/10/ohio_delays_executions_another.html"], "published": "2015-10-21T00:44:00.000+03:00", "crawled": "2015-10-21T11:05:06.350+03:00", "highlightTitle": ""}