{"organizations": [], "uuid": "f41e75b9032240b4367ecae68b3e3edd657d071c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.houstonpress.com", "main_image": "http://images1.houstonpress.com/imager/u/original/7872372/hou_news_20151023_gaslamplawsuit_marcotorres_0024.jpg", "site_section": "http://www.houstonpress.com/news", "section_title": "Houston, Texas News: Politics, Crime, Sports, Marijuana and Education Journalism | Houston Press", "url": "http://www.houstonpress.com/news/would-be-patrons-file-lawsuit-against-gaslamp-alleging-racist-door-policy-7872367", "country": "US", "title": "Lawyers Say They'll Be Suing Gaslamp, Claiming Racism", "performance_score": 0, "site": "houstonpress.com", "participants_count": 1, "title_full": "Lawyers Say They'll Be Suing Gaslamp, Claiming Racism | Houston Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:20:00.000+03:00", "replies_count": 0, "uuid": "f41e75b9032240b4367ecae68b3e3edd657d071c"}, "author": "Phaedra Cook", "url": "http://www.houstonpress.com/news/would-be-patrons-file-lawsuit-against-gaslamp-alleging-racist-door-policy-7872367", "ord_in_thread": 0, "title": "Lawyers Say They'll Be Suing Gaslamp, Claiming Racism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(L-R) Ken Piggee, Dan Scarborough, Brandon Ball at their press conference Photo by Marco Torres Attorneys Brandon Ball, Dan Scarborough and Ken Piggee, along with their own attorney, Brian Tagtmeier, have outlined their plans to file a federal lawsuit against Gaslamp next week. The announcement came about 10:30 a.m. today at a press conference set up across the street from the nightclub. The Midtown establishment is accused of using a cover fee policy that discriminates against minorities.\nThe new development comes more than a month after Ball, Scarborough and Piggee claimed that they were asked by Gaslamp doormen for a cover fee on September 11. As reported by the Houston Press , they declined and went next door to Dogwood instead, but when they came out, they say they observed that minority men were consistently asked for a $20 cover fee while white guys were let in for free.\nThe owner of Gaslamp, Ayman Jarrah (who also goes by the name “Dave Yurman”) and his attorney, video star Tim Sutherland, have repeatedly denied the allegations, saying the cover fee is based only on dress code.\nGaslamp Press Conference from Voice Media Group on Vimeo .\n“Ken, Brandon and Dan are here because we are filing a lawsuit against the establishment across the street for discrimination under Title II and for defamation,” Tagtmeier said, motioning across the street at Gaslamp as he spoke. “Houston is a city of diversity. It’s a place that recognizes everyone. It’s a place where we bring people together, yet somehow, in 2015, we still have places that deny basic rights.”\nHe went on to say that Title II has existed for 50 years and referred to the HERO ordinate that is pending voter ratification on November 3. “One of the things that Title II allows is that you cannot discriminate against people based on their race, their gender, their religion, their national origin, whether they have any kind of disability, and very soon in Houston, we’ll have Proposition 1 that protects gender identity as well and that is something really important to me and my colleagues. I want Houston to be the kind of place where my kids and their friends are welcome anywhere.”\nHouston civil rights lawyer Ike Okorafor also spoke about the pending HERO Ordinance and how, if it had already been in effect, it would change situations like these. “If Proposition 1 passes, there will be no need for lengthy litigation. It took three lawyers to finally tell the bar [Gaslamp], no more, that Houston is a progressive city that will not live in the past. We need Proposition 1 to pass so that no more discrimination occurs in Houston and we can be the progressive city that we long to be.”\nBall also took to the podium to advocate for HERO, saying, “When Proposition 1 is in place, it will be to protect people like me, Ken and Dan.” During his comments, he also said that 56 percent of discrimination claims are based on race.\nWhen asked how their claim against Gaslamp with Proposition 1, Tagtmeier said, “We’d have been able to file a complaint and there would have been an investigation done by the local authorities and they would be able to fine them as well. We also might have had a companion suit through federal court through Title II and defamation because of what they have done specifically to damage my clients. But Prop 1 allows a different way where the city can come in, file injunctions and comply with what the law is and should be.”\nTagtmeier says that should Gaslamp close before the lawsuit is over with, he plans to still go after assets. “They have other assets. I know how to go after people. I know how to find these folks,” he said. He also said that as of yet, the group filing the suit has not spoken with Jarrah or Sutherland. “We have reached out, but we have not spoken with them personally.”\nThe group plans to file the federal lawsuit next week.\nContact: Phaedra Cook Follow: Houston Press Houston Press", "external_links": ["https://vimeo.com/voicemediagroup", "https://player.vimeo.com/video/143401639", "https://www.facebook.com/HairBallsNews", "http://www.twitter.com/houstonnews_", "https://vimeo.com/143401639"], "published": "2015-10-23T20:20:00.000+03:00", "crawled": "2015-10-23T20:35:29.308+03:00", "highlightTitle": ""}