{"organizations": [], "uuid": "7b00160d985937587cca3baaadc29628daec2522", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.poconorecord.com", "main_image": "http://www.poconorecord.com/storyimage/PR/20151008/NEWS/151009519/AR/0/AR-151009519.jpg", "site_section": "http://www.poconorecord.com/news/politics?template=rss&mime=xml", "section_title": "Politics and Elections - poconorecord.com", "url": "http://www.poconorecord.com/article/20151008/NEWS/151009519/101019/NEWS?rssfeed=true", "country": "US", "title": "Monroe County Sheriff candidate once arrested for DUI", "performance_score": 0, "site": "poconorecord.com", "participants_count": 1, "title_full": "Monroe County Sheriff candidate once arrested for DUI", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:33:00.000+03:00", "replies_count": 0, "uuid": "7b00160d985937587cca3baaadc29628daec2522"}, "author": "Kevin Kunzmann Pocono Record Writer", "url": "http://www.poconorecord.com/article/20151008/NEWS/151009519/101019/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Monroe County Sheriff candidate once arrested for DUI", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monroe County Sheriff candidate once arrested for DUI Police report states Tasetano charged four years ago Comment Posted Oct. 8, 2015 at 5:33 PM By Kevin Kunzmann Posted Oct. 8, 2015 at 5:33 PM » Social News In five weeks Trevor Tasetano will be the first candidate in 12 years to challenge incumbent Todd Martin for the position of Monroe County Sheriff. After submitting his candidacy in March, Tasetano said he had a strong enough background for the position, having previously served in the Marine Corps, plus he currently works as a security shift manager for Mount Airy Casino and Resort. His background includes a run-in with the law. The Democrat candidate for November’s sheriff election was arrested for driving under the influence four years ago, according to a police report. The 31-year-old Pocono Lake resident was arrested by Stroud Area Regional Police during a traffic stop in downtown Stroudsburg in the early hours of March 13, 2011. After failing a field sobriety test, he submitted to a breathalyzer test, registering a .06 Blood Alcohol Content level, according to police. A blood sample taken later that day showed a BAC level of .13 percent. Tasetano was charged with a first offense of driving under the influence at a high rate of alcohol (between .10 and .16 percent), general impairment of driving safely and failing to use proper turning signals. According to court papers, he was sentenced to six months probation, a 30-day license suspension and a required completion of the Alcohol Highway Safety Program. He was also involved in a lawsuit connected to his job at Mount Airy. According to court papers, Tasetano and a co-worker were accused by two casino patrons of false arrest and imprisonment, malicious prosecution and conspiracy after an incident where Tasetano helped detain two men who were eventually arrested for trespassing on the premise in May 2011. The two men were discussing unions and unionizing with casino security about two weeks before the incident, according to court documents. Tasetano asked the pair to leave the premise on the basis that they were making the guards nervous. The men complied, but two weeks later returned to the casino, were detained and arrested. They said they had not been given notice that they were banned from the premises, according to their complaint. The two men were acquitted of their charges and, shortly after, filed a suit against Tasetano and three others over the incident. Ultimately that suit was settled out of court. Attorney Kathleen L. Walters of the Higgins Law Office in Stroudsburg said the terms of the settlement are confidential. Tasetano did not return calls for comment on this story. By Kevin Kunzmann", "external_links": [], "published": "2015-10-09T01:33:00.000+03:00", "crawled": "2015-10-09T07:12:39.268+03:00", "highlightTitle": ""}