{"organizations": ["Amtrak"], "uuid": "97a8cd367995890abb5fd38e9e71543a44449c35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wptz.com", "main_image": "http://www.wptz.com/image/view/-/36040140/highRes/1/-/maxh/630/maxw/1200/-/k7a3am/-/Gov-Chris-Christie-jpg.jpg", "site_section": "http://www.wptz.com/8870878?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.wptz.com/politics/witness-noisy-christie-exits-amtrak-quiet-car-after-complaints/36040106", "country": "US", "title": "Witness: Noisy Christie exits Amtrak 'quiet car' after complaints", "performance_score": 0, "site": "wptz.com", "participants_count": 0, "title_full": "Witness: Noisy Christie exits Amtrak 'quiet car' after complaints", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T19:23:00.000+02:00", "replies_count": 0, "uuid": "97a8cd367995890abb5fd38e9e71543a44449c35"}, "author": "", "url": "http://www.wptz.com/politics/witness-noisy-christie-exits-amtrak-quiet-car-after-complaints/36040106", "ord_in_thread": 0, "title": "Witness: Noisy Christie exits Amtrak 'quiet car' after complaints", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Walker"], "text": "Walker suspends campaign for president \nChristie, a Republican presidential candidate, was on the 9:55 a.m. train back to New Jersey from Washington, D.C., after an appearance on CBS' \"Face the Nation.\" \nHe walked onto the train with a McDonald's strawberry smoothie, already chewing out someone who was with him, possibly a security officer, about a mix-up in seating arrangements, according to Alexander Mann, a passenger on the same train who detailed the Christie incident to CNN in an email and in photos. \nMann wrote that just before the train departed, Christie boarded behind \"two men who appeared to be Secret Service agents\" -- though that's unlikely, since Christie doesn't yet have Secret Service detail; his staff said he traveled Sunday with one New Jersey state trooper -- and was \"yelling at them about some sort of mixup with the seating arrangements and how they had let it happen.\" \nChristie took a seat and began making cell phone calls, despite the \"quiet car\" markings instructing passengers to refrain from loud conversations or phone use in that portion of the train. \nMann wrote: \"The details of the conversation were unclear but it was definitely some sort of work phone call. This went on for 5-10 minutes until the conductor, prompted by passenger complaints, asked him to stop using his cell phone or leave the car. He again started yelling at his security detail and huffed off to another train car. He kept repeating 'frickin' ridiculous' and 'Seriously?! Seriously?!'\" \nChristie spokeswoman Sam Smith said it was a mistake: The governor hadn't meant to board the quiet car. \n\"On a very full train this morning, the Governor accidentally took a seat in Amtrak's notorious quiet car,\" she said in an emailed statement. \"After breaking the cardinal rule of the quiet car, the Governor promptly left once he realized the serious nature of his mistake and enjoyed the rest of his time on the train from the cafe car. Sincere apologies to all the patrons of the quiet car that were offended.\" \nGawker first reported Christie's exit from the car.", "external_links": [], "published": "2015-10-25T19:23:00.000+02:00", "crawled": "2015-10-25T19:24:27.149+02:00", "highlightTitle": ""}