{"organizations": [], "uuid": "d7b6c9148f4b0ab26c2d0aa9e0bda8ac6d13ab87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/09/23/e9/c9/100615-HL-Carol-Adami-MD.jpg", "site_section": "http://www.palmbeachpost.com/s/floridanews/", "section_title": "Florida Politics and Legislative News | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/lifestyles/health/advanced-care-is-better-care/nnmW2/", "country": "US", "title": "Advanced Care is Better Care", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Advanced Care is Better Care | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:00:00.000+03:00", "replies_count": 0, "uuid": "d7b6c9148f4b0ab26c2d0aa9e0bda8ac6d13ab87"}, "author": "Bethesda Women&apos;s Health Center", "url": "http://www.palmbeachpost.com/news/lifestyles/health/advanced-care-is-better-care/nnmW2/", "ord_in_thread": 0, "title": "Advanced Care is Better Care", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bethesda Women’s Health Center is dedicated to providing compassionate, comprehensive care for our patients. Our Medical Director, Carol A. Adami, M.D. shared some of her knowledge about the latest tools in breast imaging and genetic testing that are helping women become more empowered about their breast health.\nQuestion: What is 3-D mammography?\nCarol A. Adami, M.D., Board-certified radiologist and medical director of Bethesda Women s Health Center Answer: Breast tomosynthesis, or 3-D mammography, uses multiple images of the breast tissue to create a three-dimensional view. This makes it easier to better identify and characterize individual breast structures because I can separate the images of the overlapping tissue.\nQuestion: If my aunt had breast cancer, am I at risk?\nAnswer: Using the criteria published by the National Comprehensive Cancer Network ® (NCCN ® ), our staff helps patients determine if genetic testing would be beneficial at the time of their annual mammogram.\nQuestion: What if breast cancer doesn’t run in my family?\nAnswer: Only 5 to 10 percent of breast and ovarian cancers are attributed to an inherited mutation of the BRCA1 or BRCA2 genes. However, if a woman is found to have an inherited gene mutation, her risk increases up to an 87 percent risk for developing breast cancer and up to a 44 percent risk for developing ovarian cancer in her lifetime.\nQuestion: What is involved with genetic testing?\nAnswer: Bethesda offers a clinical genetic testing program for inherited cancer risk called myRisk™ Hereditary Cancer. Using a saliva or blood sample, this new panel test broadly targets specific cancer sites to identify clinically significant mutations impacting inherited risks for eight important cancers: breast, colorectal, ovarian, endometrial, gastric, pancreatic, melanoma and prostate.\nQuestion: What if I have a positive result?\nAnswer: Our nurse practitioner, Jessica McAfee, ARNP, reviews all test results with our patients to complete the risk assessment and arrange for follow-up care if needed. Surgical and medical interventions can reduce the risk of breast and ovarian cancer by more than 90 percent. Supplemental screening tests, such as an annual MRI and regular clinical breast exams, can detect cancer at an earlier stage than routine screening alone.\nQuestion: Do I need more than a mammogram?\nAnswer: Your doctor can determine if you would benefit from additional or alternative screening methods. Bethesda Women’s Health Center offers advanced screening options such as breast MRI and ultrasound screening, with dedicated ultrasound technologists who specialize in whole breast screening and diagnostic breast ultrasound.\nQuestion: What if I have breast cancer?\nAnswer: Our breast health navigator, Delmarie Butler, RN, helps guide patients through their course of care. She answers questions about treatments, collaborates with a multidisciplinary care team and provides support as needed.\nBethesda Women’s Health Center\n10301 Hagen Ranch Rd., Suite 920, Entrance A\nBoynton Beach, FL 33437\nFor information: 561-374-5300\nFor appointments: 561-374-5700\n</p", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/23/e9/c9/100615-HL-Carol-Adami-MD.jpg"], "published": "2015-10-05T08:00:00.000+03:00", "crawled": "2015-10-05T07:53:53.766+03:00", "highlightTitle": ""}