{"organizations": [], "uuid": "32f3035cdfc76c983968849562f020d6dc7bb9fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_143829755081541.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/politics/index.rss2", "section_title": "Politics", "url": "http://www.startribune.com/dayton-wants-lawmakers-to-authorize-law-firm-study-of-proposed-polymet-mine-financing/336095681/", "country": "US", "title": "Dayton seeks study of PolyMet proposal's financing", "performance_score": 0, "site": "startribune.com", "participants_count": 6, "title_full": "Dayton seeks study of PolyMet proposal's financing - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T05:11:00.000+03:00", "replies_count": 5, "uuid": "32f3035cdfc76c983968849562f020d6dc7bb9fd"}, "author": "Patrick Condon", "url": "http://www.startribune.com/dayton-wants-lawmakers-to-authorize-law-firm-study-of-proposed-polymet-mine-financing/336095681/", "ord_in_thread": 0, "title": "Dayton seeks study of PolyMet proposal's financing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gov. Mark Dayton said Thursday he plans to ask the Legislature for permission to hire an independent law firm that would help analyze the financing behind a copper-nickel project proposed by PolyMet Mining Corp. in northeastern Minnesota.\nDayton said in an interview that state Management and Budget Commissioner Myron Frans is reaching out to leading state lawmakers now with a hope of lining up outside counsel by early next year. State environmental regulators are currently weighing PolyMet’s proposal to build and operate a copper-nickel mining site near Hoyt Lakes that could exceed $500 million in costs.\nA final decision on a state permit for the project, which Dayton will make in consultation with Department of Natural Resources Commissioner Tom Landwehr, is likely by late 2016. Dayton met with PolyMet officials two weeks ago, but did not engage in details.\n“This is as monumental a decision as will be made in my term,” Dayton said. He insisted has not yet made it: “We don’t have all the facts yet,” he said.\nThe project offers the possibility of a huge economic boon to the east end of the Iron Range, a region racked by perpetual economic struggle. Dayton said he met two weeks ago with city and business leaders in the nearby town of Aurora, “and they are desperate for economic development.”\nAt the same time, the PolyMet proposal has met with grave concern from environmentalists who see consequences for the region’s natural resources. A draft environmental impact statement on the project is due as soon as next month, Dayton said.\nEnvironmental groups raising red flags about the proposal have demanded the state obtain financial assurances from PolyMet that it would cover any future cleanup costs related to the mine.\nDayton said a financial review by outside counsel could be costly, but he said that’s outweighed by the potential ramifications of the project and likely lawsuits from whichever side loses. Separately from Dayton’s request, the DNR is seeking a firm to help the state ensure PolyMet has the proper financial resources in place for the project.\nDayton said he can’t imagine PolyMet would spend millions of dollars on the state permitting process without being sure it could pay for the project itself, as well as future environmental concerns. But he said he does have some concerns about PolyMet’s parent company, Switzerland-based Glencore.\nDayton also said he perceives Glencore’s reputation on environmental protection to be mixed.\n“That’s why I think the financial assurance part would be essential,” he said.\nNext week, Dayton is touring mines in Michigan and South Dakota, operations specifically chosen by supporters and opponents of the PolyMet project.", "external_links": [], "published": "2015-10-23T05:11:00.000+03:00", "crawled": "2015-10-23T06:45:45.150+03:00", "highlightTitle": ""}