{"organizations": ["Associated Press", "AP"], "uuid": "d60b38280b5f13e72f9c177da903c274853d4939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/05/10/2d/d40e64ff05de4322ba4d7be8d130311e-1d0b7d2ae52f42dcab0122e98cf83cf4-0.jpg", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/top-news/the-twitter-follow-lists-of-the-2016-candidates/nntqy/", "country": "US", "title": "The Twitter follow lists of the 2016 candidates", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "The Twitter follow lists of the 2016 candidates", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T10:39:00.000+03:00", "replies_count": 0, "uuid": "d60b38280b5f13e72f9c177da903c274853d4939"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/the-twitter-follow-lists-of-the-2016-candidates/nntqy/", "ord_in_thread": 0, "title": "The Twitter follow lists of the 2016 candidates", "locations": ["Fla.", "Washington", "TALLAHASSEE", "N.H.", "Bedford", "Florida", "R-Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeb Bush", "Luis Magana", "Donald Trump", "Ted Cruz", "BRENDAN FARRINGTON"], "text": "Updated: 3:40 a.m. Monday, Oct. 5, 2015 | Posted: 3:39 a.m. Monday, Oct. 5, 2015 The Twitter follow lists of the 2016 candidates Related View Larger FILE - In this Sept. 25, 2015, file photo, Republican presidential candidate Sen. Ted Cruz, R-Texas speaks during the Values Voter Summit in Washington. Using Twitter to get a message out is now a must-do for presidential candidates, but looking at the accounts they follow can be instructive, too. Their follow list can reflect not only their personality and interests, but sometimes their strategy. (AP Photo/Jose Luis Magana, File) View Larger FILE - In this Sept. 25, 2015, file photo, Republican presidential candidate, businessman Donald Trump, speaks during the Values Voter Summit in Washington. Using Twitter to get a message out is now a must-do for presidential candidates, but looking at the accounts they follow can be instructive, too. Their follow list can reflect not only their personality and interests, but sometimes their strategy. (AP Photo/Jose Luis Magana, File) View Larger FILE- In this Sept. 30, 2015, file photo, Republican presidential candidate former Florida Gov. Jeb Bush speaks during a campaign stop in Bedford, N.H. Using Twitter to get a message out is now a must-do for presidential candidates, but looking at the accounts they follow can be instructive, too. Their follow list can reflect not only their personality and interests, but sometimes their strategy. (AP Photo/Jim Cole, File) By BRENDAN FARRINGTON The Associated Press TALLAHASSEE, Fla. — \nJeb Bush follows Donald Trump on Twitter but that's a one-way street: Trump mainly follows people with a connection to himself. Ted Cruz 's follow list is a big tea party, though he keeps an eye on President Barack Obama , too. \nMarco Rubio seems open to following everyone under the sun — Democrats, fellow Republicans, insiders of every type and an odd assortment of outliers who offer advice on body-piercing, playing craps and getting out of debt. \nUsing Twitter to get a message out is now a must-do for presidential candidates, but looking at the accounts they follow can be instructive, too. Their follow list can reflect not only their personality and interests, but sometimes their strategy. In Rubio's case, it seems to reflect a bit of a problem with spam, too. \nOverall, their choices reflect an interest in people who think like they do. Few Republicans or Democrats want to follow what people on the other side say. And most — Democrats Hillary Rodham Clinton and Bernie Sanders among them — don't follow most or any of their party rivals. \nSome candidates rely on hired help to tend their social media affairs, especially those with lots of money and staff, so it's not always clear who's doing the tweeting or the following. \nTrump, though, is known to spend the wee hours lobbing rhetorical bombs on Twitter. Cruz, said spokesman Rick Tyler, \"does follow Twitter virtually all day long between events.\" John Kasich has orderly lists of Ohio political and media groups, like a clothes closet organized by style and color. A flood of first-person tweets from others, too, suggests a personal interest in the platform; Jeb Bush , for example, has been tweeting about policy and family since long before his campaign. \nA recent snapshot of whom the leading presidential candidates are following on Twitter, listed in order of who has the most Twitter followers: \n___", "external_links": [], "published": "2015-10-05T10:39:00.000+03:00", "crawled": "2015-10-05T17:57:33.868+03:00", "highlightTitle": ""}