{"organizations": [], "uuid": "3ac1b26632b2b9bd70a1edc4a7236e0bfe94927f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/02/18889110-large.jpg", "site_section": "http://impact.oregonlive.com/mapes/atom.xml", "section_title": "Jeff Mapes on Politics", "url": "http://www.oregonlive.com/mapes/index.ssf/2015/10/oregon_college_shootings_roil.html", "country": "US", "title": "Oregon college shootings roil presidential race, intensify gun issue for 2016", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Oregon college shootings roil presidential race, intensify gun issue for 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T17:02:00.000+03:00", "replies_count": 0, "uuid": "3ac1b26632b2b9bd70a1edc4a7236e0bfe94927f"}, "author": "Jeff Mapes | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/mapes/index.ssf/2015/10/oregon_college_shootings_roil.html", "ord_in_thread": 0, "title": "Oregon college shootings roil presidential race, intensify gun issue for 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nLast week's shooting massacre at a southern Oregon community college quickly reverberated through the presidential campaign as gun-control advocates made it clear they would press for tougher firearms laws during the 2016 campaign. \nPresident Barack Obama angrily addressed the Oregon school shootings for two days running as the Republican and Democratic presidential candidates took divergent views on the issue. \nFrom billionaire populist Donald Trump to GOP establishment favorite Jeb Bush, the Republican candidates said the shootings at Umpqua Community College didn't change their opposition to additional restrictions, such as expanded background-check laws. \nDemocratic candidates Hillary Clinton and Bernie Sanders both followed Obama's lead and said they would support what both described as \"sensible gun-control\" measures aimed at keeping guns out of the hands of criminals and the mentally ill. \nMass shootings in America occur often enough that they can fade from the political discourse relatively quickly. But the Roseburg shootings came during an intense part of the presidential race -- and as Obama is nearing the end of his term and is increasingly willing to use the White House as a bully pulpit. \n\"I'm going to talk about this – on a regular basis – and I will politicize it,\" Obama vowed at a Friday press conference. He decried \"absolutists\" who think \"gun safety measures are somehow an assault on freedom or communistic.\" \nThe National Rifle Association, the most powerful of the gun-rights groups, stayed silent in the immediate aftermath of the shootings, which left 10 dead, including the gunman. But the Gun Owners of America released a lengthy statement rebutting Obama and arguing that the best way to reduce gun violence is to make it easier for law-abiding people to carry concealed firearms. \n\"Apparently, you have forgotten that it has been law-abiding gun owners who have brought public mass shootings to a screeching halt,\" wrote the association's spokesman Erich Pratt. \nThe major Republican contenders went to strong lengths Friday to demonstrate their opposition to new restrictions. \nBush, the former Florida governor, was roundly criticized in the blogosphere – and by Obama – for remarking that \"stuff happens\" as he sought to explain why it wasn't good to legislate on the heels of a tragedy. \nToo often, Bush said, \"we create rules on the 99.99 percent of human activity that have nothing to do with the tragedy that forced the conversation about doing something.\" \nTrump expressed skepticism that anything could be done to keep troubled loners from engaging in mass shootings. \"You're always going to have problems,\" he said on MSNBC , adding that \"even if you did great mental health programs, people are going to slip through the cracks.\" \nRetired neurosurgeon Ben Carson, Florida Sen. Marco Rubio and former business executive Carly Fiorina – the other leading GOP candidates – all said on the campaign trail that tighter background checks and other restrictions won't reduce gun violence, according to media reports. \n\"Gun control only works for normal law-abiding citizens,\" Carson said at an Iowa press conference . \"It doesn't work for crazies.\" \nClinton reiterated her support for extending background checks to cover all gun transactions, which failed to clear Congress in the wake of the killings at Sandy Hook Elementary School in 2012. \n\"Another devastating shooting,\" the former secretary of state said Thursday on Twitter. \"We need sensible gun control measures to save lives, and I will do everything I can to achieve that.\" \nVermont Sen. Bernie Sanders, Clinton's closest competitor for the Democratic nomination, told MSNBC that he also supports universal background checks. And he said the country should ban \"weapons designed just to kill people,\" a reference to proposals to outlaw weapons with such military-style features as large magazines. \nWhile the presidential candidates were pressed to talk about guns, key activists supporting tougher firearms laws used the Oregon shooting to talk about their state-by-state efforts. \n\"People may be numb in Washington, D.C. but they are angry across the country and doing something about it,\" said John Feinblatt, president of Everytown for Gun Safety. \nHis group, which has received funding from billionaire Michael Bloomberg, coincidentally had its last big victory in Oregon, where it helped engineer passage of a measure requiring background checks on private gun transfers . \nThat bill faced heavy opposition in rural Oregon. State Sen. Jeff Kruse, a Republican from Roseburg, said after the shooting that he still doesn't think the bill would keep guns out of the hands of dangerous people. \nFeinblatt said no law could stop all shootings – \"I don't think there is a silver bullet here\" – but he said the group's research showed that states that earlier adopted universal background checks have lower rates for several types of gun violence. \nFeinblatt and Dan Gross, president of the Brady Campaign Against Gun Violence, said they intend to bring the background check issue to a several more states in 2016. Already, they noted, a measure has qualified for the Nevada ballot and they expect a measure to soon make the Maine ballot. \n\"It is so clear that we are in the middle of the tipping point on the gun violence issue,\" said Gross, adding that \"we've had more momentum on the issue than we've had in decades.\" \n--Jeff Mapes", "external_links": [], "published": "2015-10-04T17:02:00.000+03:00", "crawled": "2015-10-04T20:18:32.852+03:00", "highlightTitle": ""}