{"organizations": [], "uuid": "7aa739b116fc6456f07d3ef50c2a6e162561cafb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/158/067_200x300_342654310_200x300.jpg", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/A-Local-Watchdog-s-Checklist-for-Tackl-1", "country": "IE", "title": "A Local Watchdog's Checklist for Tackling Environmental Issues In Your Own Backyard", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "A Local Watchdog's Checklist for Tackling Environmental Issues In Your Own Backyard - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:58:00.000+03:00", "replies_count": 0, "uuid": "7aa739b116fc6456f07d3ef50c2a6e162561cafb"}, "author": "Content Admin", "url": "https://www.oximity.com/article/A-Local-Watchdog-s-Checklist-for-Tackl-1", "ord_in_thread": 0, "title": "A Local Watchdog's Checklist for Tackling Environmental Issues In Your Own Backyard", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This is a guest post by Aaron Viles from Care2.\nThe environment is large, complex and cross-jurisdictional. As activists, it’s easy to jump on board with the large national and international issues—like protecting the Clean Air Act or fighting climate change—that are pursued by myriad organizations. Those causes are worthy of support, but it's easy to overlook or count out the smaller issues in your own backyard.\nWhat happens in our own communities is equally important, not just to improve our quality of life and that of our neighbors, but because many of the solutions to the national and international problems start locally. Plus, local is where lots of the real action is happening anyway.\nIn 2005, then London Mayor Ken Livingstone convened 18 mayors from “megacities,” which spawned the formation of C40 Cities , an international coalition of city officials committed to reducing carbon pollution and building resilience. Even President Obama, in his Climate Action Plan, acknowledged that, given the state of Congress today, cities and states are leading the way .\nWe're not all Erin Brockovich, so tackling local environmental issues can be challenging, beginning with even identifying what's worth fighting for.\nHere are a few steps you can take to bring your passion for the environment home.\nUnderstand Your Ecology\nEach community is unique. Where I live on the Gulf Coast, the oil industry has driven the devastation of the nation’s largest expanse of coastal wetlands, disappearing at the rate of a football field an hour and jeopardizing the sustainability of coastal communities. But in Los Angeles, the most pressing issues are related to the effects of the ongoing historic drought and the water use policies and practices that make it worse. In West Virginia , there's plenty of water and high ground, but the dominant coal and chemical industries wreak havoc on the landscape by blowing up mountains for coal and underinvesting in safety equipment such that their products and waste poisons the ecosystem .\nEvery town has its own creeks and streams, energy production makeup, potential pollution sources, and combination of plants and animals. The first step for any environmentalist interested in taking their fight local is to learn the ins and outs about where you live, what assets you have, and which ones are under threat.\nUnderstand Your Laws\nChances are that you know about the Clean Air Act , Clean Water Act , National Environmental Policy Act (NEPA) and other landmark federal environmental laws. These laws, which create systems for keeping our air and water clean (as well as mandating that companies research and take into account the environmental consequences of their actions), are the baseline for environmental protection. But in your community, there are likely a host of other laws and rules that have even more direct impact, not only on what people and companies can do, but on how you can challenge them.\nStart by looking at your state laws, through the Department of Environment, Department of Natural Resources or other relevant agencies. For instance, did you know that 18 states (plus the District of Columbia, New York City and a planning district around Lake Tahoe in California and Nevada ) have their own “mini-NEPAs” that add more review requirements?\nYou’ll also want to look into your local laws and policies. Oslo, Norway has divested from coal . Boulder, Colorado has its own carbon tax . Many cities have energy efficiency requirements in their building codes and Climate Action Plans that outline a strategy for both carbon pollution reduction and resilience.\nFind Out Who Is in Charge\nGovernment is complicated, and many well-intentioned movements fail for lack of understanding about who can make a difference. Once you have a lay of the legal land, figure out which level of government and which agency actually has the ability to get a rule, law or regulation changed. At the local level, divisions of labor and responsibility can be complicated. In Oakland, California, for instance, the Department of Parks and Recreation manages the municipal park system…that is, unless you want tree branches cut back. For that, you need to go to the Department of Public Works.\nNavigating these channels can be challenging, so when in doubt, ask. The folks at City Hall or in your County Supervisor’s Office are ultimately there to help you navigate the system and provide critical services. If you hit a wall, other civic and community leaders—especially those keyed in with your issue—can give you directions.\nFind Others Taking Action\nThis may be your first foray into local environmental issues, but you’re likely joining a club (even a small one). Many national organizations have local chapters, so start by looking to see if the large groups you support have a presence in your community. Even better, search around to see if there are any local-only organizations. Places like the Sierra Club can mount amazing local campaigns (just look at their Beyond Coal campaign that’s helped shut down more than 200 coal-fired power plants), but local groups have a focus and depth of community knowledge that make them especially effective.\nLook to your elected officials too: What was the environmental platform of your mayor or city councillor? Which groups endorsed their candidacy? Finding allies on the inside and outside improves your chance of effecting real change.\nAnd, of course, look to the actual people in your community. A safe, clean environment is something everyone can get behind— especially when you’re looking at issues close to home. Share your passion with your neighbors, speak to other parents at your children’s school, and if you find something amiss, start a petition and rally the people affected to sign and present it to the powers that be.\nAaron Viles is a Senior Grassroots Organizer for Care2. He works with citizen authors on The Petition Site to create petitions that will win concrete victories for animals, the environment, and other progressive causes. Prior to Care2 he spent decades working within the non-profit environmental advocacy field. Aaron honed his craft while working for Gulf Restoration Network, U.S. Public Interest Research Group, and Faithful America. He began his career with Green Corps, the field school for environmental organizing. When not in front of a screen or on a conference call, Aaron can be found doting on his daughters, pedaling furiously to keep up with the peloton, and serving as a volunteer leader for the Sierra Club, Dogwood Alliance and his church.", "external_links": ["http://www.thepetitionsite.com/create-a-petition.html", "http://www.usgs.gov/newsroom/article.asp?ID=3224#.VfgkWhFVhBc", "http://ilovemountains.org/resources", "http://ourworld.unu.edu/en/could-oslos-decision-to-divest-from-coal-inspire-bigger-cities-to-do-the-same", "http://www2.epa.gov/nepa", "https://en.wikipedia.org/wiki/2014_Elk_River_chemical_spill", "http://www2.epa.gov/laws-regulations/summary-clean-air-act", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/158/067_200x300_342654310_200x300.jpg", "http://www2.epa.gov/laws-regulations/summary-clean-water-act", "http://www.nytimes.com/2006/11/18/us/18carbon.html?_r=0", "https://www.whitehouse.gov/sites/default/files/docs/task_force_report_0.pdf", "http://www.c40.org/history", "http://content.sierraclub.org/coal/victories", "http://energy.gov/sites/prod/files/2013/09/f2/States_NEPA_Like_22June2013.pdf", "http://ca.gov/drought/"], "published": "2015-10-18T20:58:00.000+03:00", "crawled": "2015-10-19T04:43:12.025+03:00", "highlightTitle": ""}