{"organizations": [], "uuid": "49a534d9da21b211f3589f1b848adae24cfaba92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30240443/buckeye-health-plans-adopt-a-school-program-helps-two-ohio-schools-receive-national-recognition", "country": "US", "title": "Buckeye Health Plan's Adopt-A-School Program Helps Two Ohio Schools Receive National Recognition", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Buckeye Health Plan's Adopt-A-School Program Helps Two Ohio Schools Receive National Recognition - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "49a534d9da21b211f3589f1b848adae24cfaba92"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30240443/buckeye-health-plans-adopt-a-school-program-helps-two-ohio-schools-receive-national-recognition", "ord_in_thread": 0, "title": "Buckeye Health Plan's Adopt-A-School Program Helps Two Ohio Schools Receive National Recognition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Buckeye Health Plan\nAdopt-A-School Program Promotes Healthy Lifestyles to School-Aged Kids\nCOLUMBUS, Ohio , Oct. 12, 2015 /PRNewswire/ -- Buckeye Health Plan (Buckeye) announced today that two of the schools participating in its Adopt-A-School program have been nationally recognized for excellence. Miles Park Elementary and Artemus Ward Elementary, both schools in the Cleveland Metropolitan School District, received a Bronze award from the Alliance for a Healthier Generation. Both schools also qualified for the Michelle Obama Let's Move! Active Schools National Award. Only 11 schools in Ohio received this award.\nSherdina Williams , school nurse for Artemus Ward , and Melanie Hall , school nurse for Miles Park , will travel to Washington, D.C. in October to receive the awards.\n\" Miles Park was honored to receive the Bronze award,\" said Hall. \"The Adopt-A-School program was instrumental in making this happen. Teachers and staff value the program and look forward to this year. We appreciate Buckeye Health Plan for putting together an informative, beneficial program for our students.\"\n\"Buckeye Health Plan is proud to work with schools such as Miles Park and Artemus Ward through our Adopt-A-School program to mentor young people,\" said Bruce Hill , Buckeye President and CEO. \"This program lays a foundation for students to make positive choices that can lead to good health throughout their lives, which may be one our most important missions.\"\nBuckeye's Adopt-A-School program promotes healthy lifestyles and nurtures good decision making about personal health. During the 2014-15 school year, Buckeye staff led health discussions, interactive demonstrations and activities in eight schools that participated in the program. The topics ranged from planting a community garden to personal hygiene, making fun snacks and discussing bullying. As part of the program, children's author Michelle Bain conducts a reading for kids in grades K-3. Bain is the author of the Darby and Friends books, which follow Darby Boingg, a wallaby, as she learns how to eat well and stay active with help from friends along the way.\nAdopt-A-School program goals include:\nPromote health education & wellness for elementary age children Promote healthy eating & food choices Promote exercise & physical activity Promote health & reading literacy Promote healthy lifestyle Combat childhood obesity \"The importance of getting kids on a healthy track early can't be overstated,\" said Dr. Ron Charles , Vice President of Medical Affairs, Buckeye Health Plan. \"Buckeye's Adopt-A-School program plays a big role in this for the students at these participating schools. By providing information in a way that kids can relate and remember it, the program is a breath of fresh air.\"\nThe program, which began in 2009, is continuing this year in eight schools with plans to expand to additional schools in the future. In addition to Miles Park and Artemus Ward , participating schools include Stewart Elementary in Columbus , Harris Elementary in Akron , Pleasant Hill School in Cincinnati , Oakdale School in Toledo , Birmingham School in Toledo , and Garrett Morgan in Cleveland .\nAbout Buckeye Health Plan\nBuckeye Health Plan is a managed care plan that has been providing services in Ohio since 2004. Buckeye is a wholly-owned subsidiary of Centene Corporation, a leading multi-line healthcare enterprise offering both core Medicaid and specialty services. Information regarding Buckeye Health Plan is available via the Internet at www.buckeyehealthplan.com. Buckeye can be followed on Twitter as Buckeye_Health.\n releases/buckeye-health-plans-adopt-a-school-program-helps-two-ohio-schools-receive-national-recognition-300157929.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CL25691&Transmission_Id=201510121204PR_NEWS_USPR_____CL25691&DateId=20151012", "http://www.prnewswire.com/news-releases/buckeye-health-plans-adopt-a-school-program-helps-two-ohio-schools-receive-national-recognition-300157929.html", "http://www.buckeyehealthplan.com/", "http://www.xmlnews.org/ns/"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T20:26:48.150+03:00", "highlightTitle": ""}