{"organizations": [], "uuid": "73eb8daf33346d0626e0cb789a0ce938bc60fe3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151009181821-t1-kasich-1009-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/10/13/politics/john-kasich-new-hampshire/index.html", "country": "US", "title": "John Kasich PAC makes $11.5M TV ad buy in New Hampshire", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "John Kasich PAC makes $11.5M TV ad buy in New Hampshire - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "73eb8daf33346d0626e0cb789a0ce938bc60fe3f"}, "author": "Tom LoBianco", "url": "http://www.cnn.com/2015/10/13/politics/john-kasich-new-hampshire/index.html", "ord_in_thread": 0, "title": "John Kasich PAC makes $11.5M TV ad buy in New Hampshire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights The super PAC supporting Ohio Gov. John Kasich is planning to spend $11.5 million on-air in New Hampshire through the primary election The figure is well short of the $22 million Jeb Bush's super PAC is planning to spend there Washington (CNN) The super PAC supporting Ohio Gov. John Kasich is planning to spend $11.5 million on television ads in New Hampshire through the February 9 primary, laying down a clear marker in a state Kasich has said is a must-win for his campaign.\nThe group \"New Day for America\" reserved $5 million in airtime in New Hampshire and Boston media markets from November through the primary. That's on top of the $6.5 million the group has already bought on-air from July through October.\nWMUR first reported the ad buy. Connie Wehrkamp, a New Day spokeswoman, confirmed the details to CNN Tuesday.\nThat newest tally makes Kasich a strong presence in the New Hampshire ad war for now. But a blast from former Florida Gov. Jeb Bush's \"Right to Rise\" super PAC proved just how quickly the field can change. \"Right to Rise\" announced last month it would spend $22 million on-air in New Hampshire as part of a larger $37 million buy in early primary states.\nKasich's PAC spent heavily on-air early in New Hampshire, coupling with his late entry into the race to give him some much-needed attention this summer. But others, like Bush, have much bigger war chests to work with in the ad war; the pro-Kasich group raised $11.5 million through the end of June, while Bush's super PAC pulled in an eye-popping $103 million in the same period.\nRead More Kasich and Bush are relying heavily on a win in New Hampshire, but both candidates have been eclipsed in polling so far by Donald Trump and other outsider candidates such as Carly Fiorina and Ben Carson.\nKasich is on a four-day bus tour of the Granite State this week and is set to outline his economic plan at Nashua Community College on Thursday.\nFollow @CNNpolitics", "external_links": ["http://www.wmur.com/politics/prokasich-super-pac-spending-65-million-on-tv-ads-through-new-hampshire-primary/35806138", "https://twitter.com/CNNpolitics"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T00:37:55.883+03:00", "highlightTitle": ""}