{"organizations": [], "uuid": "385fa4f6c10f89bf94dafc0639afaf2883a47d87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/38/83f183a27f1cb37ecef2048ea927eb/media:155eedded91144ff9aa1e3ec369716d0MideastSaudiHajj.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/09/ap-exclusive-hajj-crush-was-deadliest-ever-at-pilgrimage", "country": "US", "title": "AP Exclusive: Saudi hajj crush was deadliest tragedy ever", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "AP Exclusive: Saudi hajj crush was deadliest tragedy ever - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "385fa4f6c10f89bf94dafc0639afaf2883a47d87"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/09/ap-exclusive-hajj-crush-was-deadliest-ever-at-pilgrimage", "ord_in_thread": 0, "title": "AP Exclusive: Saudi hajj crush was deadliest tragedy ever", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JON GAMBRELL, Associated Press\nDUBAI, United Arab Emirates (AP) — One survivor of last month's crush and stampede at the hajj in Saudi Arabia recalled seeing so many bodies that he couldn't tell how many there were.\nThe Associated Press sought to answer that question, arriving at a death toll of at least 1,470. That made the Sept. 24 disaster the deadliest accident ever at the annual pilgrimage. And hundreds remain missing.\nThe AP count is 701 higher than Saudi Arabia's official tally of 769 killed and 934 injured in the Sept. 24 disaster in Mina, a few miles from the holy city of Mecca.\nSaudi officials, who could not be immediately reached for comment Friday, previously have said their tally remains accurate, although an investigation into the causes of the tragedy is ongoing. Authorities have not updated their casualty toll since Sept. 26.\nThe hesitancy to acknowledge a higher toll may reflect the leadership's reflex to clamp down on information as it struggles with multiple pressures. The kingdom is dealing with a war in Yemen, Russia's entry into the Syrian conflict and low oil prices that are straining the budget — and the hajj tragedy is already opening it up to sharp criticism from opponents, particularly Iran.\nThe previous deadliest-ever incident at the annual hajj happened in 1990, when a stampede killed 1,426 people.\nThe AP figure comes from statements and officials' comments from 19 of the over 180 countries that sent citizens to the five-day annual pilgrimage.\nAuthorities have said the crush and stampede occurred when two waves of pilgrims converged on a narrow road, causing hundreds of people to suffocate or be trampled to death.\nMohammed Awad of Sudan told the AP at the time that he and his 56-year-old father were separated in the pushing and shoving. The 36-year-old pilgrim later found him alive under at least 10 bodies.\n\"You can't count how many bodies there were. They were stacked high,\" Awad said.\nIran says it had 465 pilgrims killed, while Egypt lost 165 and Indonesia 120.\nOthers include India with 101, Nigeria with 99, Pakistan with 93, Mali with 70, Bangladesh with 63, Senegal with 54, Benin with 51, Cameroon with 42, Ethiopia with 31, Sudan with 30, Morocco with 27, Algeria with 25, Ghana with 12, Chad with 11, Kenya with eight and Turkey with three. Hundreds remain missing, according to these countries.\nAny disaster at the five-day hajj, a pillar of Islamic faith, could be seen as a blow to the kingdom's cherished stewardship of Islam's holiest sites. This season saw two tragedies — the stamped and the Sept. 11 collapse of a crane at Mecca's Grand Mosque that killed 111 people.\nShiite-led Iran, the kingdom's top rival in the region, has blamed the disaster on the kingdom's \"mismanagement\" of the pilgrimage. The Islamic Republic also has called for an independent body to take over the hajj.\nExperts say there's no way that will happen. Patronage of Mecca and Medina is one cornerstone of the Al Saud family's legitimacy. Among King Salman's titles — as it was for his predecessors — is the Custodian of the Two Holy Mosques, referring to sites in the two cities.\n\"The Saudis are not for a nanosecond going to entertain any proposals to share management of the hajj with other states,\" said Hani Sabra, the head of the Middle East practice at the Eurasia Group. Still, he said, the hajj deaths \"reinforces a view that at this moment, Saudi Arabia looks weak.\"\nThe delay in announcing new figures may come from wanting not wanting to fuel more criticism from Iran, or because of the kingdom's traditional top-down governance.\nDespite Iran's sharp rhetoric over the deaths, other countries have been far more muted. That is likely due to Saudi Arabia's powerful influence, including years of patronage using its oil wealth, and because the kingdom can set the quota of pilgrims each country can send to the hajj.", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T20:18:09.001+03:00", "highlightTitle": ""}