{"organizations": [], "uuid": "a8f5031cc8c48c922e88aba6e331b5568c3cea62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://www.sfgate.com/img/pages/article/opengraph_default.png", "site_section": "http://sfgate.com//rss/feed/Politics-RSS-Feed-436.php", "section_title": "Politics RSS Feed", "url": "http://www.sfgate.com/news/crime/article/Walke-signs-bill-ending-Doe-political-6586845.php", "country": "US", "title": "Walker signs bill ending Doe political investigations", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Walker signs bill ending Doe political investigations - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:31:00.000+03:00", "replies_count": 0, "uuid": "a8f5031cc8c48c922e88aba6e331b5568c3cea62"}, "author": "sfgate.com", "url": "http://www.sfgate.com/news/crime/article/Walke-signs-bill-ending-Doe-political-6586845.php", "ord_in_thread": 0, "title": "Walker signs bill ending Doe political investigations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MADISON, Wis. (AP) — Gov. Scott Walker , who has been involved in two secret John Doe investigations, signed a bill Friday doing away with the probes into political misconduct.\nThe Republican-controlled Legislature this week passed the bill eliminating John Does for any kind of political misconduct, including bribes, theft and campaign finance violations. They could still be used for violent felonies and some drug crimes.\nWalker wasn't charged in either investigation involving him. The first focused on former aides and associates of Walker when he was Milwaukee County executive. Six people were convicted of a variety of crimes, including misconduct in office.\nThe Wisconsin Supreme Court ended the second John Doe investigation in July, saying there was nothing unconstitutional about the campaign coordination between Walker's 2012 recall committee and conservative groups.\nJohn Does are like a grand jury, but are done before a judge who ultimately decides whether a crime has been committed. Witnesses are under gag orders, and prosecutors can compel people to testify, obtain search warrants and collect evidence in secret.\nRepublicans have denounced the second John Doe investigation into Walker and his allies as a political witch hunt and maintain that police were too heavy-handed when they executed pre-dawn search warrants.\nRepublican Rep. Joe Sanfelippo of New Berlin, during debate of the measure, compared tactics used by Wisconsin law enforcement officials in executing the search warrants to Nazis. Democrats demanded an apology.\nThe bill passed the Senate and Assembly with all Republicans in support and all Democrats against.\nWalker offered no comment in announcing Friday that he had signed the bill in private.\nUnder the new law, even in the more limited cases where John Doe investigations are permitted, prosecutors would have to obtain permission from a majority of the state's chief judges to extend the probes beyond six months. Secrecy orders would apply only to judges, prosecutors, court officials and investigators; witnesses and suspects would be allowed to discuss such investigations openly.\nRepublican backers in both the Senate and Assembly insisted the change would protect free speech rights and bring a stop to meandering investigations designed to smear prosecutors' political enemies.\n\"Wisconsin citizens should all breathe a collective sigh of relief that unconstitutional investigations that violate free speech rights are a thing of the past,\" Assembly Speaker Robin Vos said in a statement. \"These changes were desperately needed in Wisconsin and our state is better off now that it's law.\"\nDemocratic Senate Minority Leader Jennifer Shilling called the new law a \"gross abuse of political power.\"\n\"Republicans should be less concerned about covering up Gov. Walker's political scandals and more focused on helping hardworking Wisconsin families,\" Shilling said.\n___\nFollow Scott Bauer on Twitter at https://twitter.com/sbauerAP", "external_links": [], "published": "2015-10-23T17:31:00.000+03:00", "crawled": "2015-10-24T02:46:48.329+03:00", "highlightTitle": ""}