{"organizations": [], "uuid": "a9b3df047d02256c6423db18247f9996b727a899", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/marijuana-debate/2015/10/here-comes-the-big-one-reformca-files-its-california-pot-legalization-initiative-feature-2449278.html", "country": "US", "title": "Here Comes the Big One: ReformCA Files Its California Pot Legalization Initiative [FEATURE] | Marijuana Debate", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Here Comes the Big One: ReformCA Files Its California Pot Legalization Initiative [FEATURE] | Marijuana Debate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:26:00.000+03:00", "replies_count": 0, "uuid": "a9b3df047d02256c6423db18247f9996b727a899"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/marijuana-debate/2015/10/here-comes-the-big-one-reformca-files-its-california-pot-legalization-initiative-feature-2449278.html", "ord_in_thread": 0, "title": "Here Comes the Big One: ReformCA Files Its California Pot Legalization Initiative [FEATURE] | Marijuana Debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nOriginally published at Stop The Drug War\nThe California Coalition for Cannabis Policy Reform , also known as ReformCA, has filed a draft marijuana legalization initiative with state officials, the group announced Sunday . The long-anticipated move means the campaign best-placed to bring legalization to the Golden State can finally get underway.\n[image:1 align:left]The Control, Regulate and Tax Cannabis Act of 2016 would allow people 21 and over to possess and cultivate limited amounts of marijuana and it would set up legal marijuana commerce overseen by a pair of new state agencies, the California Cannabis Commission and the Office of Cannabis Regulatory Affairs.\n“We believe this effort has the most statewide input and consensus, and thus the greatest likelihood of succeeding on the 2016 ballot,” ReformCA said. “We engaged in extensive discussions with thousands of stakeholders across California, including community leaders, activists, elected officials, city and county employees and locals.”\nReformCA also consulted with the California NAACP, the Latino Voters' Leagues, Law Enforcement Against Prohibition, and medical, health care and environmental groups. It took part in lengthy discussions with the Drafting Advisory Group, which includes state and national activist and industry groups, including the Drug Policy Alliance, the Marijuana Policy Project, Americans for Safe Access, the California Cannabis Industry Association, the Greater Los Angeles Collective Alliance, the Emerald Growers Association, New Approach, the Harborside Group, and the Council on Responsible Cannabis Regulation.\n“We've filed our proposed initiative language based on the policy priorities and common sense reforms Californians have been asking for for six years now” and the Manatt, Phelp and Phillips Law Firm has created “an elegant policy document,” ReformCA said, adding that it was crafted to comport with the guidelines laid down by pro-legalization Lt. Gov. Gavin Newsom's Blue Ribbon Commission on Marijuana Policy and to complement the statewide medical marijuana regulation scheme approved last month by the legislature.\nA handful of other legalization initiatives have already been filed , and some are approved for signature gathering, but there isn't much sign that any of them have the bucks or the organization to get the job done. It takes some 365,000 valid voter signatures to qualify for the November 2016 elections, a number that means paid signature gathering at a cost that could run a million dollars or more.\nAnd that's just to get on the ballot. With 38 million residents and some of the country's largest media markets, California is an expensive place to run an initiative advertising campaign—as in $10 million or $20 million or more.\n[image:2 align:right caption:true]There is money out there, and unlike 2010, when Richard Lee's Proposition 19 came up short, both financially and at the polls, the state's already existing legal (medical) marijuana industry looks to be gearing up to help. Earlier this year, Weedmaps.com contributed $2 million toward the cause , with half going to an initiative campaign committee that will spend it on the initiative it likes best. The other half is going to a PAC that will work to elect pro-legalization candidates. Facebook co-founder Sean Parker, who did support Prop 19, says he will probably invest in a legalization initiative, too.\nBut if, as expected, both the Drug Policy Alliance and the Marijuana Policy Project get behind the ReformCA initiative—they were a teensy bit nervous last week—that should help open the floodgates and pave the way to getting those signatures and making the ballot.\nThis is a first draft of the initiative, and the campaign is seeking feedback before filing a final version, but only until midnight Pacific Time this Wednesday. Here's what it will do:\nPersonal Use and Cultivation. Legalizes possession of up to an ounce by people 21 and over and allows for personal cultivation of up to 100 square feet and the possession of “the results of lawfully harvested homegrown cannabis.” Unlawful Acts. A $100 fine minors possessing or sharing not more than an ounce with other minors; a $500 for adults providing less than an ounce to minors, for minors who possess more than an ounce but less than a pound, for adults who possess more than an ounce, for public consumption, and for smoking up in a moving vehicle; either a misdemeanor or infraction (prosecutor's choice) for possessing more than a pound , selling more than an ounce but less than a pound, growing pot beyond 100 square feet without a license or as a minor; a felony for providing pot to minors under 18, distribution to other states, growing on federal or state protected lands, or engaging in violence. Driving. No measuring metabolites. Instead: “A person shall be deemed to be under the influence of cannabis if, as a result of consuming cannabis, his or her mental or physical abilities are so impaired that he or she is no longer able to drive a vehicle or operate a vessel with the caution of a sober person, using ordinary care, under similar circumstances. This standard shall be the sole standard used in determining driving under the influence allegations.” Employment. Does not affect employers' ability to fire employees for marijuana use. Medical Marijuana. With limited exceptions, “does not infringe upon the protections granted under the Compassionate Use Act of 1996,” grants business licenses to existing, compliant medical marijuana businesses. Regulated Marijuana Commerce. Establishes the California Cannabis Commission and the Office of Cannabis Regulatory Affairs to regulate and rule-make; envisions licenses for cultivation, nursery, manufacturing, distribution, transportation, retail, and testing enterprises. Local Control. Cities and counties can ban marijuana commerce, including retail outlets, but not delivery services, but only by popular vote—not by executive or legislative action. This means the default position is “no ban.”Localities cannot ban personal cultivation. Taxation. Tax on cultivators of $2 per square foot licensed; production tax paid by first purchaser of $15 an ounce ($5 an ounce for first 500 pounds from small producers); 10% retail sales tax—half to the state and half to the locality. Remember this is just the draft, but ReformCA is finally out of the gate. California should join the ranks of the legalization states next year, and the Control, Regulate and Tax Cannabis Act of 2016 is the most likely vehicle.\nOriginally published at Stop The Drug War", "external_links": ["http://www.reformca.com/2016", "http://www.sfgate.com/business/article/Sean-Parker-plans-to-spend-his-fortune-disrupting-6345186.php", "http://www.laweekly.com/news/top-marijuana-legalization-supporters-split-up-threaten-separate-initiatives-6116919", "http://www.alternet.org/drugs/california-regulate-medical-marijuana", "http://www.sfgate.com/business/article/Pot-startup-donates-2-million-to-bid-to-legalize-6207749.php", "http://stopthedrugwar.org//chronicle/https://www.safeandsmartpolicy.org/", "http://www.sos.ca.gov/elections/ballot-measures", "http://stopthedrugwar.org//chronicle/https://d3n8a8pro7vhmx.cloudfront.net/ccpr/pages/299/attachments/original/1443981648/Ballot_Measure_(Final)_(10-02-15).pdf?1443981648", "http://www.weedmaps.com/"], "published": "2015-10-05T08:26:00.000+03:00", "crawled": "2015-10-05T13:52:25.227+03:00", "highlightTitle": ""}