{"organizations": [], "uuid": "651dd3c2c21a21a9a21877f32cff0506ec8cced9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00092/tpp-agreement-poses-serious-threat-to-global-internet-users.htm", "country": "US", "title": "TPP agreement poses serious threat to global Internet users", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "TPP agreement poses serious threat to global Internet users", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:43:00.000+03:00", "replies_count": 0, "uuid": "651dd3c2c21a21a9a21877f32cff0506ec8cced9"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00092/tpp-agreement-poses-serious-threat-to-global-internet-users.htm", "ord_in_thread": 0, "title": "TPP agreement poses serious threat to global Internet users", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TPP agreement poses serious threat to global Internet users Tuesday, 6 October 2015, 9:43 am Press Release: OpenMedia \nTrans-Pacific Partnership countries announce agreement reached, posing serious threat to global Internet users \nLargest and most secretive agreement in the world’s history covers 40% of global trade and contains provisions to censor the Internet and rob the public domain \nOctober 4, 2015 – The Trans-Pacific Partnership agreement reached today comes as the result of over five years of negotiations and poses an extreme threat to free expression online. \nAlthough the full text of the deal won’t be available for a month, recent leaks of the TPP’s Intellectual Property chapter show Canada faces an overhaul of copyright legislation , including: 20 year copyright term extensions, new provisions that would allow ISPs to block websites due to alleged infringement, and new criminal penalties for the circumvention of digital locks and rights management information. \n“Canadians who care about the open Web should be very concerned about this ultra-secret pact, which could be disastrous for Canada’s digital economy,” said OpenMedia’s Digital Rights Specialist Meghan Sali . “What we’re talking about here is global Internet censorship. It will criminalize our online activities, censor the Web, and cost Canadians money. This deal would never pass with the whole world watching – that’s why they’ve negotiated it in total secrecy.” \nUnder Canada’s caretaker convention, the government can sign the TPP now, but it has to be put to a vote in Parliament before the agreement can be ratified and brought into force. There has been much controversy over the limits of the Conservative government’s power to continue to negotiate a deal mere weeks before a federal election – with NDP leader Tom Mulcair stating his party will not be bound to any agreement the Conservatives sign before the October 19 federal election. \nA poll conducted just days ago by Innovation Research shows that 70% of Canadians are either not very familiar, not at all familiar, or have not heard about it the TPP until now. \nDetails remain unclear as to when the public will be able to perform a full analysis of the text and what it means for Internet users. Also unclear is the timeline for the completion of the agreement, including ratification. However, under Trade Promotion Authority, U.S. President Barack Obama has committed to releasing the text for public scrutiny 60 days before a final vote in Congress. Despite pressure to complete the deal by the end of the year, analysts suggest that at this late stage the TPP will be impossible to ratify until 2016. \nends", "external_links": [], "published": "2015-10-05T23:43:00.000+03:00", "crawled": "2015-10-05T23:49:19.997+03:00", "highlightTitle": ""}