{"organizations": [], "uuid": "b8385db2e3bd87ad37fc0118c986fc09c9a7d802", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4302726/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13894013.Willie_Rennie_calls_on_Nicola_Sturgeon_to_end_independence_debate/", "country": "GB", "title": "Willie Rennie calls on Nicola Sturgeon to end independence debate", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 9, "title_full": "Willie Rennie calls on Nicola Sturgeon to end independence debate (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T20:26:00.000+03:00", "replies_count": 15, "uuid": "b8385db2e3bd87ad37fc0118c986fc09c9a7d802"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/politics/13894013.Willie_Rennie_calls_on_Nicola_Sturgeon_to_end_independence_debate/", "ord_in_thread": 0, "title": "Willie Rennie calls on Nicola Sturgeon to end independence debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nicola Sturgeon must end the independence debate which has \"permanently damaged\" relationships between one in twenty Scots and abandon her \"secret criteria\" for another referendum, according to Scottish Liberal Democrat leader Willie Rennie.\nMr Rennie said even nationalists have become \"unhappy about the performance of the SNP in government\".\nIn his keynote speech to the Scottish Liberal Democrat Conference in Dunfermline, which was slightly delayed by a fire alarm, Mr Rennie offered an alternative to the \"targets, controls and top-down diktats\" which he said has damaged local health provision and policing.\n\"Last week I met a woman in Anstruther who told me that the relationship with her daughter had broken down,\" he said.\n\"It had been like that for over a year. It started with an argument about independence.\n\"Her family is not alone. An opinion poll found that a quarter of a million people believe their relationship with a friend or family member has been permanently damaged as a result of the independence referendum.\n\"For the sake of the country, we need to move on from those divisions.\"\nHe added: \"But now Nicola Sturgeon has been performing a new dance.\nPromoted stories \"A dance where she has sought to pivot from her promise not to hold another referendum for a generation to the possibility of holding one in the next five years.\n\"She has an apparently secret criteria for triggering another referendum.\n\"What will that mean for every SNP member?\n\"Well, they will wake up every morning and run down to meet the postman to see if the criteria has been met. It is the only thing they care about.\n\"Imagine a five-year journey with every MSP in the back asking every single day: are we there yet?'\n\"Nicola, our constitution has had our time. Surely our police, our NHS and our schools deserve our time now.\"\nHe added: \"I recognise that many liberal-minded people have supported independence.\n\"As a consequence, many then felt compelled to back the nationalists even if they were unhappy about the performance of the SNP in government.\n\"I want them to know they now have another option.\n\"I want to make a direct plea to supporters of independence today - if you want to fix the problems facing your local GP surgery, if you want to end industrial-scale stop and search on our streets, if you want to put the treatment of mental ill-health on an equal footing with physical health, if you want all these things, then try out the Liberal Democrats.\"\nMr Rennie said the Liberal Democrats would re-introduce \"freedom in the public sector\".\n\"Targets, controls and top-down diktats have become the favoured tool to control every part of our public services,\" he said.\n\"It is suffocating the talents of our public-sector workers - doctors, nurses, teachers and police.\n\"Take national testing in schools.\n\"Despite what the First Minister says, it is clear we are returning to the kind of testing and tables the previous Liberal Democrat-Labour government abolished.\"\nHe cited criticism of national testing by the Educational Institute of Scotland, who said it would have a \"profoundly negative impact\", and the Parent Teacher Council, who said \"testing does not raise attainment\".\n\"These national tests will undermine progress and strip power from teachers, introducing the destructive teaching to the test,\" he said.\n\"It will be the most damaging blow to education in Scotland since devolution.\"\nShare article He added: \"Schools are only the start.\n\"The Police Federation has spoken out against their target culture. The Royal College of Nursing and the Royal Medical Colleges say targets are 'skewing clinical priorities and wasting resources'. And Audit Scotland warn of the risks of too narrow a focus on targets.\"", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-24T20:26:00.000+03:00", "crawled": "2015-10-24T16:44:16.718+03:00", "highlightTitle": ""}