{"organizations": [], "uuid": "daa0c6344fff1ef180ab21f585e185874130b7c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30279758/jury-returns-104-m-verdict-to-power-rogers-smith-pc-client", "country": "US", "title": "Jury Returns $10.4 M Verdict to Power Rogers & Smith, P.C. Client", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Jury Returns $10.4 M Verdict to Power Rogers & Smith, P.C. Client - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "daa0c6344fff1ef180ab21f585e185874130b7c6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30279758/jury-returns-104-m-verdict-to-power-rogers-smith-pc-client", "ord_in_thread": 0, "title": "Jury Returns $10.4 M Verdict to Power Rogers & Smith, P.C. Client", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Power Rogers & Smith, P.C.\nJury returns $10.4 M verdict against Advocate South Suburban Hospital for 68-year-old for amputation of left hand and the toes on both feet from medication overdose in ICU.\nCHICAGO , Oct. 16, 2015 /PRNewswire/ -- On Thursday, October 15, 2015 , a Cook County jury awarded $10.425 Million against Advocate Health and Hospitals South Suburban Hospital and several of its nurses for their negligence in administering excessive vasopressor medications to Charles Calbert in the ICU following his emergent surgery to remove his infected toxic megacolon (Court No. 09 L 1448). The jury deliberated for only 2.5 hours.\nOn September 4, 2007 , Charles Calbert presented to Advocate South Suburban Hospital after experiencing several days of diarrhea. He was admitted and taken to surgery on September 15 and during the surgery, he was administered the vasopressor medication Levophed for a drop in his blood pressure. Post-operatively, a consulting cardiologist ordered that the Levophed be weaned off and he be given Neosynephrine if his systolic blood pressure dropped below 100.\nPlaintiffs maintained that from September 15 - 17 , the ICU nursing staff failed to perform dynamic response testing on the arterial line that was being used to evaluate Mr. Calbert's blood pressure and, as a result, it was falsely reading systolic blood pressures below 100 when his true blood pressures were higher. As a result, the nursing staff was administering maximum doses of vasopressors when he needed little if any. The excessive vasopressors caused vasoconstriction in his blood vessels and poor perfusion to his extremities causing them to become ischemic from lack of blood flow.\nBecause of the poor perfusion caused by the vasopressors, Mr. Calbert's left hand, and the toes on both of his feet became ischemic, necrotic, gangrenous, and needed to be amputated. The defense maintained that Mr. Calbert was a very sick man who was in septic shock with five system multi-organ failure and the poor perfusion was the result of a coagulopathy cascade caused by the sepsis and the body's native shunting of blood to vital organs for survival. The defense maintained that Mr. Calbert desperately needed the vasopressors to survive his life threatening condition and but for the high doses of vasopressors, he would have died.\nThe Plaintiffs were represented by Larry Rogers, Sr. , Larry Rogers, Jr. and Carolyn Daley Scott of Power Rogers & Smith, P.C.\n\" Charles Calbert went into the hospital with an abdominal problem and came out missing his left hand and the toes on both feet without explanation from any of his doctors. We identified the problem with the arterial line and established that it was most likely malfunctioning for the full two days following surgery,\" said Larry Rogers, Sr.\n\"The nurses also failed to notify the doctors of the change in Mr. Calbert's condition despite noting in the records that his hands and feet became dusky and turned cold,\" said Carolyn Daley Scott .\n\"Mr. Calbert was in septic shock as the defense claimed, but we proved that the excessive amounts of vasopressors that were administered for hours and hours was the true cause of his poor perfusion and the loss of his extremities,\" said Larry Rogers, Jr.\nPrior to this, Mr. Calbert was a hard-working, family-oriented, good man whose life was devastated by his injuries.\n\"I am happy for Mr. Calbert that our jury system was there to provide him his day in court and the justice that he deserved,\" said Larry Rogers, Jr.\nDuring pre-trial mediation, Advocate offered $500,000 . The case was assigned out to trial on September 28th . At the start of trial, Advocate increased its offer to $1.2 million . The Plaintiffs demanded between $3-$4 million to settle the case before jury selection, which Advocate rejected. Moments before the verdict was read, Advocate offered and the Plaintiffs accepted a high-low agreement of $3.5 million - $12 million guaranteeing that the full $10.425 million verdict amount would be paid for their 68-year-old client, avoiding any appeal.\nThe jury awarded damages as follows: Disfigurement, $2,000,000.00 ; Loss of a normal life experienced, $1,000,000.00 ; Loss of a normal life future $1,000,000.00 ; Pain and Suffering experienced, $2,000,000.00 ; Pain and Suffering future $4,000,0000.00 ; Loss of earnings $300,000.00 ; Loss of earnings future, $75,000.00 . The jury awarded his ex-wife, Frances Gordon Calbert , the value of services, $25,000.00 ; and the value of society, companionship and relations, $25,000.00 .\nThe defense was represented by James Kopriva and Thomas Fitzgerald, Jr. of Cassiday Schade . The Honorable Judge Deborah Dooling presided over the trial. Charles Calbert v. Advocate Healthcare, et al.\nAttorneys for Plaintiff\nLarry R. Rogers, Sr. Larry R. Rogers, Jr. (312-827-4379) Carolyn Daley Scott (312-827-6103) Power Rogers & Smith, P.C. (31444)\n70 West Madison Street, 55th Floor\nChicago, Illinois 60602-4212\nTelephone: (312) 313-0202\nFor more information about Power Rogers & Smith, P.C. or its attorneys, visit http://www.prslaw.com/ .\n releases/jury-returns-104-m-verdict-to-power-rogers--smith-pc-client-300161343.html\n ", "external_links": ["http://www.prslaw.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA30719&Transmission_Id=201510161500PR_NEWS_USPR_____LA30719&DateId=20151016", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/jury-returns-104-m-verdict-to-power-rogers--smith-pc-client-300161343.html"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T00:20:16.423+03:00", "highlightTitle": ""}