{"organizations": [], "uuid": "6a478d68e6f299ecfd3fbb10bb0d9122a6ff0c2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/03/381649-carpet15.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/entertainment/report-red-carpet-report-card-from-femme-fatale-deepika-padukone-to-richa-chadha-s-lace-mess-2131030", "country": "SG", "title": "Red Carpet Report Card: From femme fatale Deepika Padukone to Richa Chadha's lace mess", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "Red Carpet Report Card: From femme fatale Deepika Padukone to Richa Chadha's lace mess | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T14:20:00.000+03:00", "replies_count": 0, "uuid": "6a478d68e6f299ecfd3fbb10bb0d9122a6ff0c2c"}, "author": "dna     | From the print edition", "url": "http://www.dnaindia.com/entertainment/report-red-carpet-report-card-from-femme-fatale-deepika-padukone-to-richa-chadha-s-lace-mess-2131030", "ord_in_thread": 0, "title": "Red Carpet Report Card: From femme fatale Deepika Padukone to Richa Chadha's lace mess", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yogen Shah Smokin' hot\nNow that's called being a demonic femme fatale in a white, angelic gown. Deepika Padukone slays it with centre-parted slick hair and smokey eyes, offsetting the purity of the white sequinned rivulets running across the Gaurav Gupta creation. The black nails and no accessories add to the great finish. Glam and gloom never looked so cool together!\nTrick or treat\nAmy Jackson gives us good inspo on how to dress for the Halloween night. And it's the perfect timing because the dreadful night isn't that far away. All she needed to complete her look was a mini pumpkin wreath, some upcycled poison bottles and hanging bats. Happy Halloween in advance Amy!\nParda nasheen\nLooks like curtains at Lara Dutta's boudoir came off and she couldn't get anyone to fix them. Then she put her thinking cap on and decided to don them for this red carpet outing. The athletic Lara needs much cooler sartorial picks than this draping disaster better left for the starlets and their mini-me versions. Words of caution: Try not to experiment with your sofa upholstery next time!\nSurf Excel siren\nEarlier we thought Richa Chadha's outfit was made out of foamy soap bubbles and on closer inspection, it looks like something appropriate for a White Swan Broadway audition. From donning body-con last week to transitioning to this lace mess - there hasn't been any upgrade. However, we have our fingers crossed and breath baited.\nUnflattering\nKaftan queen Pria Kataaria Puri disappoints us this week with this print number which doesn't complement her at all. The print seems more suited for a yacht brunch and a pool party than an evening out in town. The petite designer seems to be drowning in it.\nIll-fitting\nLooks like Mugdha Godse is apologising for something. This cropped halter jumpsuit doesn't fit her properly. The crooked side cutout details just add to the problem. Also, the colour doesn't suit her skin tone at all. Guess it's time to pull up your stylist.", "external_links": ["https://apis.google.com/js/platform.js", "https://plus.google.com/u/0/104225430271191968200/posts"], "published": "2015-10-03T14:20:00.000+03:00", "crawled": "2015-10-03T04:27:51.537+03:00", "highlightTitle": ""}