{"organizations": [], "uuid": "847b05dfc4439da21fcfc795d3acbe85e8d09fe6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/0f/c0/7ccf6dca4912a278d77a87858813/151009-barack-obama-1160-ap3.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/sanders-obama-supporters-214636", "country": "US", "title": "Sanders’ challenge: Winning over Obama supporters", "performance_score": 3, "site": "politico.com", "participants_count": 13, "title_full": "Sanders’ challenge: Winning over Obama supporters - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T15:58:00.000+03:00", "replies_count": 17, "uuid": "3db669cc78929a31b726b9fe8d8efaddd7e6de61"}, "author": "Seung Min Kim", "url": "http://www.politico.com/story/2015/10/sanders-obama-supporters-214636#post-0", "ord_in_thread": 0, "title": "Sanders’ challenge: Winning over Obama supporters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bernie Sanders has a well-defined support network – highly educated, white liberals. But to win the nomination, he’ll need to build a much broader coalition. And in this, one man may stand in his way: Barack Obama. It’s not that Sanders has a bad relationship with the president — it’s that they barely have a working relationship at all. The senator has been sharply critical of Obama, whose popularity is rising especially among the Hispanic and African-American voters missing from Sanders’ support network.\nIn fact, the Vermont independent, who identifies as a Democratic Socialist, is on record encouraging a primary opponent for Obama in 2012 — and then appearing to demure on a run of his own precisely because he is not a Democrat.\nAsked in March 2011 by WNYC host Brian Lehrer, “Are you considering — or do you think any progressive Democrat should consider — a primary challenge to [Obama] for 2012?” Sanders immediately responded: “Well, I’m not a Democrat. I am the longest serving independent.\"\n“I think, you know, if a progressive Democrat wants to run, it would enliven the debate, raise some issues. And people have the right to do that,” he added.\nJust months later, while speaking on radio host Thom Hartmann’s show in July, Sanders expanded on his idea of challenging Obama.\nSanders bill would end for-profit prisons, immigrant detention By Seung Min Kim\n“There are millions of Americans who are deeply disappointed in the president, who believe that with regard to Social Security and a number of other issues, he said one thing as a candidate, and is doing something very much else as a president, who cannot believe how weak he has been — for whatever reason — in negotiating with the Republicans. And there’s deep disappointment,” he said.\n“One of the reasons the president has been able to move so far to the right is that there is no primary opposition to him. And I do think it would do this country a good deal of service if people started thinking about candidates out there, to begin contrasting what is a progressive agenda as opposed to what Obama is doing.\"\nMany Democrats have criticized Obama and his presidency, not least Hillary Clinton, who has spent weeks distancing herself from this White House. But for Sanders, a frequently critical tone toward a president popular with Democratic-leaning minority communities will make it difficult to build the support network he needs to win the nomination. And an active attempt to distance himself from the party won't help.\nSanders’ communications director Michael Briggs said his boss was a friend of the president’s.\n“You have heard him talk many times about how he is a friend of President Obama and admires him,” Briggs told POLITICO when asked about Sanders’ 2011 call for a primary challenge.\n“He’s also spoken often about why he’s running as a Democrat, how he has caucused with the Democrats since he was elected to Congress, how he campaigned for President Obama who, as a senator, campaigned for Bernie, how the DNC and state party officials have welcomed him to the presidential campaign.\"\nObama did indeed campaign for Sanders in his 2006 Senate bid, and Sanders has been working to prove his party bona fides to the Democratic establishment this year, promising to work for Democrats up and down the ballot next November. Still, his earlier comments could make his party-wide pitch more complicated.\n“Statements like that could cause him trouble,” said Iowa Democratic strategist Jeff Link. “Even though the Republicans are very anti-Obama, Democrats are very pro-Obama and this is the Democratic primary. It’s a real challenge to explain. He hasn’t been in a position to have to answer any questions about past statements, and that will change.\"\nSanders entered the Senate in 2007, just as Obama was kicking off his presidential campaign, so they had little overlap in the upper chamber. And though Sanders frequently invokes Obama’s name while campaigning across the country, he has not been one of Obama’s go-to senators on Capitol Hill. (The 2011 comments came in the context of Sanders’ opposition to Obama signing an extension of tax cuts signed during George W. Bush’s presidency.)\nAnd the Democrats headed to the debate stage on Tuesday are likely to be asked about policy positions that differ from those advanced by Obama.\nPoll: Sanders surges past Clinton in New Hampshire By Eliza Collins\nClinton's stated opposition this week to the Trans-Pacific Partnership trade deal — which she helped negotiate as Obama’s secretary of state — was her latest break, soon after she announced her disapproval of the construction of the Keystone XL pipeline and the so-called Cadillac tax portion of the Affordable Care Act.\nSanders has long held each of these positions — which could each become even more politically charged in the coming days as Vice President Joe Biden makes a decision about running.\nBut even without Biden in the race, Sanders could soon run into hot water with Obama’s core supporters, who for the first time will get a close look at the insurgent contender, said Monmouth University pollster Patrick Murray. They are unlikely to respond well to such criticism of their popular president, even if Sanders has since changed his tune and more fully embraced the party, Murray said.\n“That has been his key issue: his support has been limited to the ideologically liberal base, which leaves out the working-class base, [and] Sanders was trying to make some inroads with them,” he said.\nShould Clinton take a more aggressive tack than currently planned in the debate, and directly challenge Sanders on his differences with Obama, that could spell even more trouble for Sanders.\n“Her reputation is pretty solid with that community,” explained Murray. “It’s a little bit harder for Sanders because that group has the sense that he’s not really bringing anything to the table on their behalf. And this may help cement that view of him.”\n<div", "external_links": ["http://www.youtube.com/watch?v=t8N8E1v7E58#t=28", "http://www.wnyc.org/story/118406-bernie-sanders-speaking-independently/"], "published": "2015-10-10T15:58:00.000+03:00", "crawled": "2015-10-10T17:49:10.640+03:00", "highlightTitle": ""}