{"organizations": [], "uuid": "39ba3cac35fcc3ea3e58f0f8ca4e58c8edd25362", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/static/images/bellinghamherald/facebook.jpg", "site_section": "http://www.bellinghamherald.com/news/politics-government/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Politics & Government News | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/news/politics-government/article37115118.html", "country": "US", "title": "AP Source: Senators reach deal on criminal justice overhaul", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "AP Source: Senators reach deal on criminal justice overhaul", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:18:00.000+03:00", "replies_count": 0, "uuid": "39ba3cac35fcc3ea3e58f0f8ca4e58c8edd25362"}, "author": "STEPHEN OHLEMACHER Associated Press", "url": "http://www.bellinghamherald.com/news/politics-government/article37115118.html", "ord_in_thread": 0, "title": "AP Source: Senators reach deal on criminal justice overhaul", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  WASHINGTON \nA bipartisan group of senators has reached a long-sought agreement on changes to the criminal justice system that would reduce prison sentences for certain non-violent drug offenders. \nIn the deal struck between some of the Senate's most conservative and liberal members, judges would have the discretion to give sentences below the mandatory minimum for non-violent drug offenders. Some current inmates could get their sentences reduced by as much as 25 percent by taking part in rehabilitation programs, if they are deemed a low risk to offend again. \nThe bill is scheduled to be unveiled Thursday. Details were confirmed by a Senate aide familiar with the package. The aide, who spoke on condition of anonymity, was not authorized to speak publicly about the bill ahead of Thursday's announcement. \nViolent offenders, sex offenders and inmates convicted of terrorism charges would be excluded. Members of organized crime syndicates and major fraud offenders would also be excluded. \nThe package was years in the making, the result of negotiations among some of the most powerful members of the Senate. Among their goals: make the sentencing system more fair, reduce recidivism and contain rising prison costs. \nSince 1980, the federal prison population has exploded, in part because of mandatory minimum sentences for non-violent drug offenders. In 1980, the federal prison population was less than 25,000. Today, it is more than 200,000. \nAmong the Republican backers of the bill: John Cornyn of Texas, the No. 2 Republican in the Senate; Sen. Chuck Grassley of Iowa, chairman of the Senate Judiciary Committee; Sen. Mike Lee of Utah; and Sen. Lindsey Graham of South Carolina, who is running a longshot campaign for president. \nAmong the Democrats: Sen. Dick Durbin of Illinois, the No. 2 Democrat in the Senate; Sen. Chuck Schumer of New York, the No. 3 Democrat; Sen. Sheldon Whitehouse of Rhode Island; and Sen. Cory Booker of New Jersey. Related content", "external_links": [], "published": "2015-10-01T00:18:00.000+03:00", "crawled": "2015-10-01T00:23:31.584+03:00", "highlightTitle": ""}