{"organizations": [], "uuid": "bdc75cc8fe7ff8d2e08c478d834ca42a5b4c5a65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.brownpoliticalreview.org", "main_image": "", "site_section": "http://www.brownpoliticalreview.org/feed/", "section_title": "Brown Political Review", "url": "http://www.brownpoliticalreview.org/2015/10/first-ladies-and-lads-of-the-2016-presidential-election/", "country": "US", "title": "First Ladies and Lads of the 2016 Presidential Election", "performance_score": 0, "site": "brownpoliticalreview.org", "participants_count": 1, "title_full": "First Ladies and Lads of the 2016 Presidential Election", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T18:46:00.000+02:00", "replies_count": 0, "uuid": "bdc75cc8fe7ff8d2e08c478d834ca42a5b4c5a65"}, "author": "Emma Axelrod", "url": "http://www.brownpoliticalreview.org/2015/10/first-ladies-and-lads-of-the-2016-presidential-election/", "ord_in_thread": 0, "title": "First Ladies and Lads of the 2016 Presidential Election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pin \nO n October 3, Saturday Night Live ’s forty-first season premiered with a cold opener mocking Donald and Melania Trump. The skit portrayed Donald as arrogant and irreverent and Melania as clueless, and it routinely made references to Trump’s sexist remarks about Megyn Kelly while implying that Melania was a mail-order bride. Although it was a parody, the act accurately highlighted one salient feature of American politics: Spouses can have an important role in shaping candidates’ personas and cultivating their likeability. The emergence of television injected an element of celebrity into American politics. The first lady was far from spared from this new phenomenon. First ladies (and women who have gone on to become first ladies) have had major influence in politics since before the founding of the country, from Abigail Adams’ letter urging members of the Continental Congress to “remember the ladies” to Eleanor Roosevelt’s significant role in the women’s rights movement. It was not until Jacqueline Kennedy , however, that the position of first lady elicited the type of celebrity that it has today. She was hailed as a fashion icon in magazines, and many American women attempted to emulate her “ Jackie look ”. Now, Michelle Obama can’t even get bangs without the Huffington Post writing several articles about it.The first lady’s role in promoting her husband’s image begins on the campaign trail, long before she’s in the East Wing. As the 2016 invisible primary continues, candidates’ likeability will continue to play an important role. After all, presidential elections have been decided based on which candidate seems more appealing to get a beer with . Upon entering the White House, first ladies pick up pet projects, but beforehand, their chief duty is to humanize their husbands. This election cycle, candidates’ spouses’ demeanor and the way that they shape public perception of their candidates could at least partially determine who will be making speeches at the national conventions this summer. Of course, the ways in which the 2016 presidential spouses affect candidates’ campaigns will be as diverse as the candidates themselves.Discussing the role of the first lady in the context of this election brings Hillary Clinton to mind almost immediately, for several obvious reasons. If Clinton wins, she will bring with her to the White House America’s very first first gentleman (or first mate , as Hillary has suggested naming the role.) Perhaps even more significantly, Clinton is also the only candidate in the race to have ever actually held the role herself, and she is familiar with the importance that it holds both before and after an election is won. In 2014, documents from 1990 surfaced that show her husband’s campaign worked hard to help Hillary build a more likable image and fight the public perception that she was calculating or aloof. Before that, when Bill was governor of Arkansas and lost his bid for re-election, she even changed her name to help him win it back.Bill will not have that problem as he accompanies his wife on her campaign; the former president is known as one of the best public speakers in American politics right now, excelling at presenting himself as both warm and likable. His endorsement has significantly helped other members of his party in the past, and his speech endorsing Barack Obama at the 2012 Democratic National Convention was widely praised for its persuasiveness. Despite these skills, however, Bill possibly did more harm than good in Hillary’s 2008 run due to several poorly received comments. While Bill is a skilled orator and a fairly well-liked former president, due to his impulsive nature and the fact that Hillary already faces much criticism for coming from a political dynasty , it would probably be best for Bill to assume a relatively limited role in Hillary’s campaigning.In stark contrast with Clinton, Bernie Sanders’ spouse is almost unknown to voters. Sanders has been married to Jane O’Meara for twenty-seven years and describes her as “ a soulmate, a sounding board .” While the Clintons’ relationship will always suffer from the residue of a notorious scandal, Sanders’ marriage to O’Meara has seemed rather steady. Aside from an attack ad in 2011 based on O’Meara’s stepping down from her position as Burlington College president, she has remained largely out of the news. However, just because O’Meara is relatively unknown does not mean that she has little effect on how the public perceives her husband. On the contrary, enjoying a steady, seemingly solid relationship with a low-profile wife helps Sanders appear genuine and down to earth, a critical component of the image he’s cultivating.While Sanders’ wife is modest, Donald Trump’s wife is flashy. The Saturday Night Live skit about Melania reminded viewers that Trump is not known as a candidate who respects women publically or personally. This past summer, old rape allegations from his ex-wife Ivana came back into the national spotlight after he accused Mexican immigrants of being rapists. The country was also reminded of other questionable moments in the Trump family, eloquently summarized in an August Business Insider video headline : “When Trump said he ‘might be dating’ Ivanka if she weren’t his daughter, it creeped out even his most ardent supporters.’” \nThe ways in which the 2016 presidential spouses affect candidates’ campaigns will be as diverse as the candidates themselves. \nWhile recent poll numbers show that his personal life has not particularly harmed Trump, who is still in the lead, one might think that the most helpful thing a first lady could do for Trump would be to help him look more wholesome and family-oriented. If Donald Trump wins the presidency, however, Melania would be the only first lady who has posed nude professionally. In old interviews, Melania has boasted about how the couple has “incredible sex at least once a day,” and Trump has boasted about how good his wife looks in a “very small thong.” While having this type of wife and this type of public relationship with her makes Trump appear far from wholesome, these are factors that could oddly enough work in Trump’s favor. For many of Trump’s supporters, his appeal lies in his blunt honestly and unapologetic attitude. Many Republicans seem to rejoice in the fact that Donald Trump does not mind being crass —and Melania perfectly extends that attitude to his personal life. The rest of the Republican frontrunners’ spouses behave more predictably. Ben Carson’s wife Candy occasionally gives interviews and recently appeared with her husband on The View . On the show, she spoke about her worry as a grandmother for the next generation and joked about celebrating the couple’s anniversary on the campaign trail with six hundred of their “closest friends”. Her appearance helped Carson groom himself as a “family man,” which is important, since he runs on a platform of strict “ family values ”. This will likely be a struggle for Marco Rubio, who also touts traditionalist family values but has recently been accused of several sex scandals . While they are unsubstantiated claims, they create doubt nonetheless.Carly Fiorina’s husband Frank Fiorina is used to supporting his wife; he retired at the age of 48 to support his wife’s career and look after their children. Before that, he had a senior-level position at AT&T after working his way up from being a technician. Fiorina has already used her husband’s story in speeches, and she will certainly continue to play up her husband’s working-class roots to counter criticisms that she is out of touch or apathetic to the worries of low-income Americans as a former CEO. Similarly, Jeb Bush has referred to his Mexican wife Columba Bush as a “secret weapon” to win Latino votes.The possible first spouses in the 2016 election look just about as diverse as the candidates themselves and contribute to their spouses’ campaigns in very different ways. Their relationships seem reflective of the strengths and weaknesses of each candidate’s personas. It will be interesting to see who ends up making the supportive-spouse speeches at each party’s national convention, but one thing is certain: what they say and how they say it will carry weight.", "external_links": [], "published": "2015-10-25T18:46:00.000+02:00", "crawled": "2015-10-26T15:06:49.215+02:00", "highlightTitle": ""}