{"organizations": [], "uuid": "78a48984da7d86f3cc782ee100160d745c61152f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30214379/hastings-hastings-admonishes-texting-while-driving", "country": "US", "title": "Hastings & Hastings Admonishes Texting While Driving", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hastings & Hastings Admonishes Texting While Driving - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "78a48984da7d86f3cc782ee100160d745c61152f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30214379/hastings-hastings-admonishes-texting-while-driving", "ord_in_thread": 0, "title": "Hastings & Hastings Admonishes Texting While Driving", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hastings & Hastings\nHastings & Hastings would like nothing more than to keep the streets of Arizona perfectly safe. Accidents will always happen, but Hastings & Hastings would like them to happen as infrequently as possible. Eliminating texting and driving would go a long way towards reducing the number of accidents on the streets of Arizona.\nPHOENIX , Oct. 8, 2015 /PRNewswire/ -- The National Safety Council has reported that over 1.6 million crashes a year are the direct result of individuals using their cellphones while driving. Simple cellphone regulation alone could save us from all of these accidents.\nLogo - http://photos.prnewswire.com/prnh/20151006/274716LOGO\nThe National Safety Council's research has further shown that answering a text takes an average of 5 seconds. If a car is traveling at just 55 mph, it will travel the length of an entire football field in the space of those five seconds. Even the briefest glimpse at your cellphone could prove fatal. In fact, texting while driving is even more dangerous than driving drunk. A driver who is texting is 6 times more likely to find themselves in an accident than someone who is driving drunk.\nHastings & Hastings encourages everyone to put away their cellphones when they are out on the road. The last thing anyone wants is to lose their life over a text message or a tweet. Hastings & Hastings asks drivers to remember, the Internet will still be there when they reach their destination.\nTexting and driving is particularly dangerous for young drivers. The National Safety Council further reports that teen driver are 4 times even more likely than adult drivers to be involved in an accident while texting or talking on the phone.\nHastings & Hastings knows that while driving, seconds matter.\n\"I guess it really is a simple thing. All people need to do is put down their cellphone while they are driving. I know it can be tough. I go through the same thing. People feel out of touch when they put their cellphone away. I can tell you though, being out of touch for a few minutes is much better than getting into a potentially fatal accident,\" said David Hastings , the founder of Hastings and Hastings.\nHastings & Hastings knows, sometimes that phone can appear in an individual's hand before they even know. Put it out of reach. Eliminate temptation. Do everything you can to keep Arizona's roads safe.\nAbout Hastings & Hastings\nHastings & Hastings is an Arizona consumer law firm. We are an experienced trial law firm that represents personal injury and wrongful death victims at a Discount Fee.\nContact Information\nKristy Guell\n(480) 706-1100\nkristy.guell@hastingsandhastings.com\nhttp://hastingsandhastings.com\n releases/hastings--hastings-admonishes-texting-while-driving-300156206.html\n ", "external_links": ["http://hastingsandhastings.com/", "http://photos.prnewswire.com/prnh/20151006/274716LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY21777&Transmission_Id=201510080700PR_NEWS_USPR_____NY21777&DateId=20151008", "http://www.prnewswire.com/news-releases/hastings--hastings-admonishes-texting-while-driving-300156206.html", "http://www.xmlnews.org/ns/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:54:02.548+03:00", "highlightTitle": ""}