{"organizations": [], "uuid": "5123cd939d4397175ff2500acf08c07875240a42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmbfnews.com", "main_image": "", "site_section": "http://www.wmbfnews.com/Global/category.asp?C=146173&clienttype=rss", "section_title": "WMBF - News - Politics", "url": "http://www.wmbfnews.com/story/30222792/the-latest-activists-say-20-blasts-shook-city-of-raqqa", "country": "US", "title": "The latest: Activists say 20 blasts shook city of Raqqa", "performance_score": 0, "site": "wmbfnews.com", "participants_count": 0, "title_full": "The latest: Activists say 20 blasts shook city of Raqqa", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T14:15:00.000+03:00", "replies_count": 0, "uuid": "5123cd939d4397175ff2500acf08c07875240a42"}, "author": "", "url": "http://www.wmbfnews.com/story/30222792/the-latest-activists-say-20-blasts-shook-city-of-raqqa", "ord_in_thread": 0, "title": "The latest: Activists say 20 blasts shook city of Raqqa", "locations": ["Raqqa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The latest: Activists say 20 blasts shook city of Raqqa - WMBFNews.com, Myrtle Beach/Florence SC, Weather Member Center: Shop 84300 The latest: Activists say 20 blasts shook city of Raqqa \nDAMASCUS, Syria (AP) - The latest developments as Syrian troops and other nations battle militants in Syria. All times local in Syria. \n___ \n01:40 p.m. \nActivists have reported more than 20 explosions in the northern Syrian city of Raqqa held by the Islamic State group. \nA Raqqa-based collective called Raqqa is Being Silently Slaughtered said 22 blasts shook the city late Thursday. \nThe Britain-based Syrian Observatory for Human Rights said the 20 explosions killed 14 IS fighters and wounded more than 20. \nThe group said it was not clear if the explosions were the result of air raids by the U.S.-led coalition or Russian warplanes. \nThe Observatory's chief Rami Abdurrahman and Raqqa is Being Silently Slaughtered say a training facility, known as Vanguards Camp, was hit on the southern edge of the city. \nFrance's Defense Minister Jean-Yves Le Drian said French warplanes bombed a training camp in Raqqa. \n___ \n11:50 a.m. \nSyrian activists say the Islamic State group has launched a surprise attack in the northern province of Aleppo, seizing a string of villages from rebels. \nThe Syrian Observatory for Human Rights says the advance by the extremists is the most significant in months. \nIt comes amid a wave of Russian airstrikes and a ground offensive by the Syrian army in the country's central region. \nThe Observatory said IS seized the villages of Tal Qrah, Kfar Qares and at least four other small villages in the northern Aleppo countryside. IS-affiliated accounts on Twitter also announced the militants had seized those villages. \n___ \n10:55 a.m. \nIranian state television is reporting that a senior commander in Iran's powerful Revolutionary Guard has been killed in Syria. \nThe report Friday said that Gen. Hossein Hamedani was killed in the suburbs of Aleppo in Syria while \"carrying out an advisory mission,\" but didn't provide any further details. \nHamedani is one of the most senior Guard commanders to be killed in Syria. He was a veteran commander who had an important role in Iran's 1980-88 war with Iraq. \nIran is one of Syrian President Bashar Assad's main allies. Tehran has provided his government with military and political backing for years and has kept up its support since Syria's civil war began in 2011. \nGuard commanders repeatedly have said Iran only has high-level advisers in Syria, denying it has fighters there. \nAssad is from the Alawites, an offshoot of Shiite Islam. Iran is majority Shiite. Syria's rebels are mostly Sunni \n___ \n10:40 a.m. \nTurkey's state-run news agency says Syrian journalist Salih Mahmud Leyla, who reported for the agency from northern Syria, has been killed in car bomb attack. \nThe Anadolu Agency said Friday that Leyla, 27, died in the attack in the town of Hreitan, in northern Aleppo province, late Thursday. It said the attack is believed to have been carried out by Islamic State militants. \nLeyla sent photographs and videos from clashes in northern Syria and also reported on hardships suffered by the people there, Anadolu said. \nIn July, Leyla received injuries to his face while reporting on clashes in Aleppo and was brought to Turkey for treatment. \nLeyla, who was from Aleppo, had trained as a computer technician. His wife of one year is expecting their first child, Anadolu said. \n___ \n0935 a.m. \nFrance's defense minister says French fighter jets fired airstrikes on the Islamic State stronghold of Raqqa in Syria, targeting foreign fighters plotting attacks in Europe. \nJean-Yves Le Drian said on Europe-1 radio Friday that two Rafale jets bombed a training camp \"and the objective was achieved.\" It was the second French strike on Syria, and Le Drian said \"it will not be the last.\" \nHe did not elaborate on the purported attack plots. \nHe criticized Russia's stepped-up and wide-ranging military action in Syria, saying \"80 to 90 percent\" of its actions do not target the Islamic State group. Russia says its air campaign is aimed against Islamic militants. \nFrance joined the U.S.-led coalition against the Islamic State group in Iraq last year and expanded its campaign to Syria last month.  ", "external_links": [], "published": "2015-10-09T14:15:00.000+03:00", "crawled": "2015-10-09T14:24:18.016+03:00", "highlightTitle": ""}