{"organizations": [], "uuid": "b47d610ec0a8e1622dfe9f4e61a85530e87edc5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/incoming/20151016-metro-central.ece/BINARY/original/Metro+Central", "site_section": "http://www.dallasnews.com/news/politics/", "section_title": "Dallas-Fort Worth, Texas and National Politics and Elections News - News for Dallas, Texas ", "url": "http://www.dallasnews.com/news/metro/20151016-kaufman-county-revisiting-contract-on-school-zone-bus-cameras.ece", "country": "US", "title": "Kaufman County revisiting contract on school zone, bus cameras", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Kaufman County revisiting contract on school zone, bus cameras | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:45:00.000+03:00", "replies_count": 0, "uuid": "b47d610ec0a8e1622dfe9f4e61a85530e87edc5d"}, "author": "RAY LESZCYNSKI", "url": "http://www.dallasnews.com/news/metro/20151016-kaufman-county-revisiting-contract-on-school-zone-bus-cameras.ece", "ord_in_thread": 0, "title": "Kaufman County revisiting contract on school zone, bus cameras", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amid waning support and pressure from a state senator, Kaufman County is re-examining its contract for school zone and bus cameras.\nKaufman County asked an attorney to investigate its contract with American Traffic Solutions. The contract provides for cameras and civil fines and would cost the county money to end it early.\nOne part of the contract targets speeders in school zones. The other is made up of five “stop arm” cameras on buses to ticket drivers who pass illegally.\nSince 2013, when the contract passed 3-2, two supporters have lost their seats on the Commissioners Court. County Judge Bruce Wood, however, still believes in the 10-year program.\n“If it saves one child’s life or keeps one child from being maimed or injured either in a school zone or getting off a bus, it’s worth the entire program,” Wood said. “I don’t know how anybody can oppose that.”\nSenator’s criticism\nOne of Kaufman’s representatives in Austin, Sen. Bob Hall, R-Edgewood, disagrees. Though his legislation to ban red light, school bus and all automated camera enforcement died in committee last session, Hall promises another legislative push in 2017.\nHe says the cameras are nothing but a moneymaker for the vendors who contract the service. And, he adds, they deny people’s right to face their accusers.\nWood cites three minor accidents in the last few yeas involving school zones and buses in different Kaufman County school districts. Hall counters by saying there’s no measurable increase in safety.\n“It’s a solution that we couldn’t find a problem for,” Hall said. “I agree we don’t want cars passing school buses when they’re stopped. No question about that. But we couldn’t find where it was causing a problem.”\nAccording to budget reports, Kaufman County realized $100,000 from the cameras during the first year and anticipates $90,000 in revenue from them this year. The number of violations is projected to decline.\nAs residents by now are looking out for the cameras, the flow of complaints has also slowed. A woman hit with a fine for driving 41 mph in Terrell testified at Monday’s meeting in Kaufman. She said the violation was time-stamped when the school zone wasn’t in effect and the speed limit was instead 45 mph. Appeals, though, have to go out of state, through the vendor.\nExit price\nLast month, one commissioner voted against the entire county budget, citing a contractual agreement with ATS that is not budgeted.\nThe decision to investigate the contract comes out of commissioners’ fear of an end price. Those who hold sway against Wood’s support of the deal want to know the exact cost should they vote to get out.\nIt’s at least $475,000 to buy ATS out — $95,000 per each of the school zone cameras. A third-party holding company in Ohio that is involved in the collection may be owed a standby fee. The contract also refers to a daily fee for when one of the stop-arm cameras fails to give at least a certain number of tickets.\n“In many of the contracts, if they don’t have ‘x’ number of violations per month, the county has to make up the void to the camera owners,” Hall said.\nWood said the investigation, independent of the commissioners, will create confidence for the program.\n“I want this to work and I think it is working,” the county judge said, “if people would stand back and let the contract do what it is supposed to do.”\nHall said he is “absolutely” going to continue to pursue legislation to stop automated ticketing. He said Kaufman County is being duped into thinking it would make money off the deal when, instead, all the money is going to ATS.\nWood, a retired educator and superintendent in two of the county’s school districts, reiterates it’s not about money.\n“When I heard about this program and the effect it can have, that drivers do slow down because they don’t want to get a ticket, it works,” he said. “It was a no-brainer for me and continues to be a no-brainer.”\nOn Twitter:\n @RayLeszcynski", "external_links": ["https://twitter.com/RayLeszcynski"], "published": "2015-10-17T06:45:00.000+03:00", "crawled": "2015-10-17T17:02:36.111+03:00", "highlightTitle": ""}