{"organizations": [], "uuid": "5f67f725cb4415c3d5a89a96ca6a8e43c5c5ffd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "article.wn.com", "main_image": "http://i.ytimg.com/vi/MhrC2_Hak08/0.jpg", "site_section": "http://rss.wn.com/English/keyword/politics", "section_title": "WN.com - Politics News", "url": "http://article.wn.com/view/2015/10/08/Global_Unions_statement_IMF_and_World_Bank_should_take_reces/", "country": "GB", "title": "Global Unions’ statement: IMF and World Bank should take recession threats seriously (ITUC - International ...", "performance_score": 0, "site": "wn.com", "participants_count": 1, "title_full": "Global Unions’ statement: IMF and World Bank should take recession threats seriously (ITUC - International ... - Worldnews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5f67f725cb4415c3d5a89a96ca6a8e43c5c5ffd8"}, "author": "wn.com", "url": "http://article.wn.com/view/2015/10/08/Global_Unions_statement_IMF_and_World_Bank_should_take_reces/", "ord_in_thread": 0, "title": "Global Unions’ statement: IMF and World Bank should take recession threats seriously (ITUC - International ...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Source: ITUC - International Trade Union Confederation) On the eve of the Annual Meetings of the International Monetary Fund and World Bank in Lima, Peru (9-11 October 2015), the ITUC and its Global Unions partners call on the international financial institutions to adopt policies that counter the global economic slowdown. On Tuesday, the IMF corrected downwards its biannual economic growth forecasts for the seventh consecutive time and confirmed that 2015 will mark the lowest rate of global growth since the Great Recession of 2008-2009. The IMF also declared that risks of further deterioration, including threats of recession, are 'more pronounced' than they were only a few months ago. ITUC General Secretary Sharan Burrow stated: 'Already two large countries, Brazil and Russia, are in recession. Because of this and reduced growth in China, recession could spread to other countries. The G20's 'Brisbane Action Plan', where on the basis of IMF- and OECD-designed models countries were supposed to see their growth rates increase by two per cent, seems to be running in reverse gear since growth is slowing. The IFIs have to take the recession threats seriously and promote investments in social and physical infrastructure, including in green technologies, to reduce the global jobs gap.' Sharan Burrow blamed the IMF in particular for having made the shift to austerity five years ago, contributing to the steady deterioration of global growth since then. Even the Fund's own Independent Evaluation Office considered the promotion of fiscal consolidation policies to be 'premature' in a report it issued last year. She further faulted the IMF for encouraging many countries in economic difficulty to deregulate their labour markets and even dismantle centralised collective bargaining mechanisms. 'These kinds of measures will only make work more precarious and accentuate inequality,' said Burrow. 'It is highly ironic that the IMF issues studies deploring the increase of income inequality because of weakened labour market institutions and at the same time encourages countries to make them even weaker.' Global Unions' statement to the IFIs' Annual Meetings in Lima includes the following recommendation: 'Both the IMF and World Bank should develop consistent and coherent approaches within their institutions towards reducing income and wealth inequality in member countries.' The statement is available here: distributed by This content was issued by ITUC - International Trade Union Confederation on the 2015-10-08 and was initially posted on www.ituc-csi.org. It was distributed, unedited and unaltered, by noodls on 2015-10-08 10:49:14 UTC. The original issuer is solely responsible for the accuracy of the information contained therein. (noodl: 30236324)", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:51:31.041+03:00", "highlightTitle": ""}