{"organizations": [], "uuid": "648590bcb5015f3512c7acbcc663a0c3359e1fe8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theatlantic.com", "main_image": "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/6507027947_107b812f7a_b/facebook.jpg?1444760400", "site_section": "http://www.theatlantic.com/writers/", "section_title": "The Atlantic — News and analysis on politics, business, culture, technology, national, international, and life – TheAtlantic.com", "url": "http://www.theatlantic.com/health/archive/2015/10/hallucinations-born-from-what-people-know-not-what-they-see/410344/", "country": "US", "title": "Hallucinations Could Be Just a Skewed Version of Normal Visual Processing", "performance_score": 1, "site": "theatlantic.com", "participants_count": 5, "title_full": "Hallucinations Could Be Just a Skewed Version of Normal Visual Processing - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:56:00.000+03:00", "replies_count": 7, "uuid": "648590bcb5015f3512c7acbcc663a0c3359e1fe8"}, "author": "Julie Beck", "url": "http://www.theatlantic.com/health/archive/2015/10/hallucinations-born-from-what-people-know-not-what-they-see/410344/", "ord_in_thread": 0, "title": "Hallucinations Could Be Just a Skewed Version of Normal Visual Processing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What you see at any given moment is only partially based on what’s actually in front of you. Sensory information is part of visual perception, but the other part is the knowledge you already hold about your environment—what you expect to see.\n“When we open our eyes, typically most of us have this feeling of a very clear picture of the world that’s out there,” says Christoph Teufel, a lecturer in neuroscience at Cardiff University. “That's actually not really the case … We use what we already know about the world in order to generate an unambiguous perception of the world.”\nRelated Story Things You Cannot Unsee (and What They Say About Your Brain)\nTeufel is the lead author on a new study published in Proceedings of the National Academy of Sciences that suggests visual hallucinations experienced by people with schizophrenia and other mental disorders might just be a result of the way humans process what they see. A hallucination could come from relying more heavily on prior knowledge than on the actual sensory information coming into the brain.\nThe researchers, from Cardiff and the University of Cambridge, tested this idea using two-tone images, which are created by taking normal images and flattening them out into just black and white, with no in-between shades of grey. The researchers asked participants if they could see a person or object in the picture. After, they exposed them to the original images the two-tones had been made from (without telling them which went with which). Then, the participants looked at the two-tones again, and once again looked for the objects or people within. (There were also some control two-tones in there that didn’t have any particular pattern.)", "external_links": ["http://www.pnas.org/content/early/2015/10/06/1503916112.full.pdf?sid=7c4e39d8-7fb8-4b69-80e3-d26da4912b35"], "published": "2015-10-13T22:56:00.000+03:00", "crawled": "2015-10-13T22:08:59.700+03:00", "highlightTitle": ""}