{"organizations": [], "uuid": "4fb9aa662eb7998f057160f90fd01a5e08c1458d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wesh.com", "main_image": "http://www.wesh.com/image/view/-/33961970/highRes/3/-/maxh/630/maxw/1200/-/12bx67cz/-/Jim-Webb--June-2015-jpg.jpg", "site_section": "http://www.wesh.com/11789134?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.wesh.com/politics/how-much-time-does-biden-have-to-decide/35943514", "country": "CH", "title": "Webb drops out of Dem presidential primary", "performance_score": 0, "site": "wesh.com", "participants_count": 0, "title_full": "Webb drops out of Dem presidential primary", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:37:00.000+03:00", "replies_count": 0, "uuid": "4fb9aa662eb7998f057160f90fd01a5e08c1458d"}, "author": "", "url": "http://www.wesh.com/politics/how-much-time-does-biden-have-to-decide/35943514", "ord_in_thread": 0, "title": "Webb drops out of Dem presidential primary", "locations": ["Virginia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Webb"], "text": "Webb drops out of Dem presidential primary Former Virginia senator considering an independent run UPDATED 1:37 PM EDT Oct 20, 2015 \nJim Webb ended his bid for the Democratic presidential nomination at a press conference Tuesday, citing differences he has with the party. Videos Clinton sent GOP 2016ers copies of... \nWebb, a former U.S. senator from Virginia, said the party's leadership is too invested in appeasing special interest groups and has drifted left over the years. He said the party's \"hierarchy is not comfortable with many of the policies that I have laid forth, and frankly I am not that comfortable with many of theirs.\" \n\"For this reason, I am withdrawing from any consideration of being the Democratic Party's nominee for the presidency,\" Webb said. \nBut he left the door open to an independent White House run, saying he would meet with people from across the political spectrum before announcing whether he'll continue his bid. Webb added that he doesn't see himself endorsing anyone in either party right now. \nWebb's campaign never really got off the ground and was seen by even some close Webb aides as more of a vanity play than an actual presidential bid. In total, Webb spent four days campaigning in New Hampshire and 20 days in Iowa, far fewer than the senator's challengers. \nWebb also expressed outright frustration with the Democratic Party during his run, questioning its strategy and the support they were providing him. During the first Democratic debate earlier this month, Webb spent considerable time complaining about the amount of time he was given to speak. \nMudcat Saunders, Webb's close friend and informal adviser, told CNN he last spoke with Webb this weekend but the senator never said he planned to drop out of the Democratic contest. \n\"We were just b----ing about the way our party has moved. They have given up on the South, they have given up on the heartland, on rural America,\" Saunders said, expressing both his and Webb's view. \"It is a math game and the math is not going to work. It might work once and it might work twice. We just don't like the Democratic Party's strategy.\" \nHe added, \"I feel confident that Jim would say that same thing. Just to take a whole group of people and throw them out of the equation is wrong. That is what the party has done throughout small towns and rural America.\" \nWebb's exit leaves four contenders for the party's nomination still in the race: former Secretary of State Hillary Clinton, independent Vermont Sen. Bernie Sanders, former Maryland Gov. Martin O'Malley and former Rhode Island Gov. Lincoln Chafee. \nVice President Joe Biden has been considering a possible bid, according to aides, but has yet to declare his intentions.", "external_links": [], "published": "2015-10-20T20:37:00.000+03:00", "crawled": "2015-10-20T21:41:04.660+03:00", "highlightTitle": ""}