{"organizations": ["FBI", "Genesee Center for the Arts & Education", "Bristol Instruments Inc"], "uuid": "2d51ee091025518df490779244cc339fd3c507d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rbj.net", "main_image": "", "site_section": "http://www.rbj.net/rss/industry.asp?id=1070", "section_title": "RBJdaily.com - Government & Politics", "url": "http://www.rbj.net/article.asp?aID=219427", "country": "US", "title": "Why gas costs more here than elsewhere", "performance_score": 0, "site": "rbj.net", "participants_count": 0, "title_full": "Why gas costs more here than elsewhere", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T10:00:00.000+03:00", "replies_count": 0, "uuid": "2d51ee091025518df490779244cc339fd3c507d0"}, "author": "", "url": "http://www.rbj.net/article.asp?aID=219427", "ord_in_thread": 0, "title": "Why gas costs more here than elsewhere", "locations": ["Rochester"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malin Kanis", "Janice Gouldthorpe", "Dryden Theatre"], "text": "Doctors and researchers are tapping powerful computers to improve outcomes. FBI agents have launched a criminal probe involving Bristol Instruments Inc. Dryden Theatre's Malin Kanis hopes to get more young adults in the theater's seats. Best Lawyers in Rochester guide can help you obtain legal representation. The Business Person of the Year finalists for 2015 are profiled. Ex-Kodak manager Janice Gouldthorpe leads the Genesee Center for the Arts & Education. Why gas costs more here than elsewhere Rochester Business Journal October 9, 2015 \nAsk Rochester area drivers where to find the cheapest gas, and they will probably tell you anywhere but Rochester. Drive to Syracuse and you may save a few cents per gallon. Better yet, take a road trip to New Jersey and you might save a quarter or more. But why is that? One answer is taxes. The average tax collected nationwide on a gallon of gas is 48.9 cents, according to the American Petroleum Institute. New Yorkers pay 64.39 cents per gallon, the second highest in the nation. Only Pennsylvania drivers pay more, at 70 cents per gallon. Tractor trailer drivers have it worse. In New York the diesel gas tax is 69.5 cents, the third highest nationwide, behind Connecticut and Pennsylvania. The federal government levies an 18.4-cent tax on a gallon of gas and 24.4 cents on a gallon of diesel. The last time the gas tax was raised was in 1993, for deficit reduction purposes. Gas taxes help pay for the Highway Trust Fund, which primarily pays for road construction nationwide. A portion of New York’s gas taxes goes into the Dedicated Highway and Bridge Trust Fund, which is used to fix roads and bridges. But a 2014 report from state Comptroller Thomas DiNapoli noted “the dollars from New York’s motor fuel tax and other dedicated revenue sources, ostensibly intended for new transportation related capital investment, are instead going primarily to repayment of debt from prior years and current day-to-day operational expenses.” Although the fund disbursed more than $3.8 billion in 2012-13, just 22 percent was spent for capital construction, DiNapoli’s report showed. Last week, the average price of a gallon of gas in New York was $2.41, according to GasBuddy.com. New Jersey drivers paid $1.96 per gallon, while drivers in Florida paid $2.15 per gallon. But taxes are not the only explanation for higher prices here, experts say. New York State Energy Research and Development Authority reported last week that Rochesterians were shelling out $2.36 per gallon, while our neighbors in Syracuse were paying $2.27 per gallon. In Buffalo you might expect to pay $2.48 per gallon of gas, while those in the state capital are paying $2.34. Two factors play a role in price differences across the state: competition and the ability to charge consumers more in certain areas.“You want to be in an area that has big box retailers that sell gas,” GasBuddy senior petroleum analyst for the Northeast Jeff Pelton explained. “You want to be in an area where you have a Costco, a BJs, Sam’s Club that sell gas, because those guys will sell gas at a loss because they want to drive their store sales.” They are willing to take it on the chin on gasoline, Pelton said.“If you’re in an area that has majors like Exxon, Mobil, Shell, you’re not going to get a good gas price because they’re always going to sell their gas at a premium because of the name brand they have attached to it,” he added. “A lot of it is really competitor driven and location driven.” In addition, the gasoline wholesaler may determine it can make more in certain areas of the state, said Ralph Bombardiere, executive director, New York State Association of Service Stations & Repair Shops. In Rochester that wholesaler is Superior Plus Corp., which acquired Griffith Holdings Inc., the parent company of Griffith Energy, in 2010.“Griffith Oil is a terminal. Gasoline suppliers go in there with gasoline. The price of gasoline at that terminal changes every day,” Bombardiere explained. “It may be part of a penny or a penny or two, but it goes up or down every single day.” The price in Rochester is higher than in Syracuse, for example, or Albany, Bombardiere said, because the wholesaler feels it can make more money here.“It doesn’t cost any more money to bring the product in; he just can make more money because it’s a good market,” he added. “Then the retailer puts on this margin and that’s what the consumer pays. The fluctuation of prices you see at the pump is due to the pricing of the wholesale at those terminals.” 10/9/15 (c) 2015 Rochester Business Journal. To obtain permission to reprint this article, call 585-546-8303 or email service@rbj.net. What You're Saying There are no comments yet. Be the first to add yours! Post Your Own Comment", "external_links": [], "published": "2015-10-09T10:00:00.000+03:00", "crawled": "2015-10-14T03:10:32.300+03:00", "highlightTitle": ""}