{"organizations": [], "uuid": "33c3d352ff372aaa54f4111387ff280c580ee528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/cbc94ded4cd4bf3d281aa6ac7a3bc6555ff8c958/c=0-156-3000-1844&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/04/DetroitNews/B99311243Z.1_20151004173503_000_GV1JPQK3.2-0.jpg", "site_section": "http://rssfeeds.detroitnews.com/detroit/politics", "section_title": "Detroit News - Politics", "url": "http://www.detroitnews.com/story/news/politics/2015/10/04/chaffetz-house-speaker/73346174/", "country": "US", "title": "Utah congressman challenges McCarthy for House speaker", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Utah congressman challenges McCarthy for House speaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T01:35:00.000+03:00", "replies_count": 0, "uuid": "33c3d352ff372aaa54f4111387ff280c580ee528"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/news/politics/2015/10/04/chaffetz-house-speaker/73346174/", "ord_in_thread": 0, "title": "Utah congressman challenges McCarthy for House speaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FILE - OCTOBER 4, 2015: It was reported that Rep. Jason Chaffetz has officially launched his campaign for House speaker October 4, 2015. WASHINGTON - OCTOBER 10: Rep. Jason Chaffetz (R-UT) listens during a hearing on Capitol Hill on October 10, 2012 in Washington, DC. The hearing before the House Oversight and Government Reform Committee focused on the security situation in Benghazi leading up to the September 11 attack that resulted in the assassination of U.S. Ambassador to Libya J. Christopher Stevens. (Photo: Brendan Hoffman)\n1 CONNECT 1 TWEET LINKEDIN COMMENT EMAIL MORE Washington — One-time college placekicker Jason Chaffetz wants to boot Republican House leaders off their path to promotions.\nChaffetz declared Sunday that he’s running to replace retiring House Speaker John Boehner, even though Boehner has chosen Majority Leader Kevin McCarthy as his successor.\nIt’s not a new role for Chaffetz. The 48-year-old chairman of the House Oversight and Government Reform Committee has never been shy about seeking leading roles in politics. He’s climbed the power ladder through a mix of media savvy and confrontations with some establishment favorites.\nAnd despite having strong family roots in Democratic politics — his father was the Utah co-chairman for Michael Dukakis’ presidential campaign in 1988 and was once married to Dukakis’ wife, Kitty — Chaffetz entered Congress in 2009 ideologically aligned with the tea party-tinged class that propelled the GOP into the House majority two years later.\nIt’s far from clear that Chaffetz will win enough support in the House’s complex selection process. Within moments of his announcement, Republicans friendly to McCarthy raised questions about his fitness for the post. But Chaffetz insists that the biggest House majority in decades needs an overhaul at the top, and that he’s being called to lead it.\n“I’ve had enough members who’ve come and said, ‘Please Jason, do this,’ ” Chaffetz said on Fox News Sunday. “We don’t want to fight internally. But realistically, we can’t vote to promote the existing leadership.”\nHis congressional investigations have raised Chaffetz’s prominence but also drawn criticism. The Republican field of White House candidates routinely cite the debate over whether to strip Planned Parenthood of federal funding, an issue that Chaffetz’s committee is probing but which some conservatives complain has produced no clear GOP win.\nOn another issue, Chaffetz angered some conservatives by briefly revoking a colleague’s subcommittee chairmanship when he and other Republicans defied party leaders in a vote on a trade bill.\n“I think I learned from that lesson,” the Los Gatos, California, native and father of three said on “Fox News Sunday.” “We’ve got to win the argument and make the case, not just knock people over the head if they don’t do what we want them to do.”\nIn short order Sunday, McCarthy’s allies circulated a list of Chaffetz’s comments, such as his refusal to rule out an effort to impeach President Barack Obama. For his part, Chaffetz has loudly objected to McCarthy’s gaffe this week in which he suggested that the GOP-led probe into the 2012 attacks on a diplomatic outpost in Benghazi, Libya, had scored political points against Democratic presidential candidate Hillary Rodham Clinton. Clinton, the Democrats’ front-runner, was secretary of state at the time of the attacks, which killed four Americans.\nChaffetz also is tangling with the Secret Service as he leads a probe into security lapses at the White House and on presidential trips.\nThe White House said Thursday that “significant concerns” have been raised by reports that in the days after a key hearing on the issue, more than 40 Secret Service employees looked at a job application Chaffetz submitted to the agency in 2003 that was later rejected. Homeland Security Secretary Jeh Johnson and Secret Service Director Joe Clancy have apologized to Chaffetz, but the congressman is urging criminal action.\nChaffetz won election in 2008 by toppling incumbent Republican Chris Cannon in a runoff, despite endorsements from President George W. Bush and most of the state’s political establishment. In 2011, he briefly considered challenging Sen. Orrin Hatch, and only stepped back after Boehner and others urged him to stay in the House. Ousting Hatch was unlikely at best, Chaffetz said. But he also made clear in multiple interviews at the time that the House offered more chances for advancement, and he hoped to stay on the leadership track.\nRecruited to be a placekicker on Brigham Young University’s football team, Chaffetz sometimes talks in sports jargon. Explaining why he’s running for speaker, Chaffetz earlier in the week praised Boehner for getting rid of special spending items called, “earmarks.” But he didn’t have much other praise for how the leadership has handled key items on the conservatives’ agenda.\n“I’m tired of not actually getting to the end zone,” Chaffetz said. “I want to score touchdowns.”", "external_links": ["http://www.gannett-cdn.com/-mm-/966c46f35bb30a0239abd9b855e4e1602574bd21/c=166-0-2833-2000&r=x404&c=534x401/local/-/media/2015/10/04/DetroitNews/B99311243Z.1_20151004173503_000_GV1JPQK3.2-0.jpg", "http://www.gannett-cdn.com/media/2015/10/04/DetroitNews/B99311243Z.1_20151004173503_000_GV1JPQK3.2-0.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//detne.ws/1Lctu6m&mini=true", "http://launch.newsinc.com/js/embed.js", "https://twitter.com/intent/tweet?url=http%3A//detne.ws/1Lctu6m&text=Utah%20congressman%20challenges%20McCarthy%20for%20House%20speaker&via=detroitnews"], "published": "2015-10-05T01:35:00.000+03:00", "crawled": "2015-10-05T06:03:07.629+03:00", "highlightTitle": ""}