{"organizations": [], "uuid": "b618083aa2fb35b2c162a031b36e8f6700ed3820", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00006/cancer-patient-disrupts-tpp-negotiations.htm", "country": "US", "title": "Cancer Patient Disrupts TPP Negotiations", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Cancer Patient Disrupts TPP Negotiations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:15:00.000+03:00", "replies_count": 0, "uuid": "b618083aa2fb35b2c162a031b36e8f6700ed3820"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00006/cancer-patient-disrupts-tpp-negotiations.htm", "ord_in_thread": 0, "title": "Cancer Patient Disrupts TPP Negotiations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cancer Patient Disrupts TPP Negotiations Thursday, 1 October 2015, 10:15 am \nCancer Patient Disrupts TPP Negotiations \nArrested from Hotel Demanding to See the Secret \"Death Sentence Clause\" \nToday in Atlanta, cancer patient Zahara Heckscher was arrested after disrupting the negotiations for the Trans-Pacific Partnership (TPP) in a protest aimed at maintaining access to affordable cancer medicines in the 12 countries affected by the trade treaty. \nHeckscher, in a t-shirt reading \"I HAVE CANCER. I CAN'T WAIT 8 YEARS\", and holding an IV pole that read \"TPP: Don' t Cut My IV,” refused to leave the Westin Hotel, the site of the negotiations between U.S. Trade Representative Michael Froman and the other TPP trade ministers. She demanded that they show her the secret TPP text to verify for herself and other people living with cancer around the globe that TPP would not include a \"death sentence clause,\" the text of the U.S. proposal to extend de facto monopolies on biological medicines by up to 8 years. \nHeckscher, a seven-year breast cancer survivor, calls herself a cancer thriver. She has been treated by biologicals including trastuzumab (Hercepin) and pertuzumab (Perjeta). She is currently undergoing chemotherapy as part of a clinical trial, and continues on denosumab (Xgeva) treatment as well. \nAccording to Heckscher, \"For thousands of women to die unnecessary of breast cancer because of the TPP is a horrible, cruel, premeditated, and avoidable catastrophe. The provisions being decided by TPP ministers today could allow drug monopolies on biologics for 8 years. Some of these medicines cost up to tens of thousands, even hundreds of thousands of dollars a year.\" \n\"When you have breast cancer today, you can’t wait 8 years or 7 years or 6 years for a treatment to become available or affordable. When you have cancer, even a one-year delay in affordable medicine can be a death sentence. That is why we call this proposed provision of the TPP a 'death sentence clause.' If it passes, thousands of women like me will die waiting.\" \nENDS", "external_links": [], "published": "2015-10-01T00:15:00.000+03:00", "crawled": "2015-10-01T02:44:53.145+03:00", "highlightTitle": ""}