{"organizations": [], "uuid": "57f1489b4c55303a7cbe0e2fbfa4d73033d63d69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thecabin.net", "main_image": "http://thecabin.net/sites/default/files/14790831.jpg", "site_section": "http://www.thecabin.net/taxonomy/term/160/1/feed", "section_title": "TheCabin.net - Conway, Arkansas - Politics", "url": "http://thecabin.net/news/2015-10-07/mccarthys-pledge-conservatives-im-not-john-boehner", "country": "US", "title": "McCarthy's pledge to conservatives: 'I'm not John Boehner'", "performance_score": 0, "site": "thecabin.net", "participants_count": 1, "title_full": "McCarthy's pledge to conservatives: 'I'm not John Boehner'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:51:00.000+03:00", "replies_count": 0, "uuid": "57f1489b4c55303a7cbe0e2fbfa4d73033d63d69"}, "author": "Staff", "url": "http://thecabin.net/news/2015-10-07/mccarthys-pledge-conservatives-im-not-john-boehner", "ord_in_thread": 0, "title": "McCarthy's pledge to conservatives: 'I'm not John Boehner'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McCarthy's pledge to conservatives: 'I'm not John Boehner' Posted: October 7, 2015 - 5:51pm Photos AP EVAN VUCCI AP PHOTO House Majority Leader Kevin McCarthy of Calif.,left, leaves a news conference on Capitol Hill in Washington, Wednesday, following the weekly House Republican conference. \nBy ERICA WERNER \nAP CONGRESSIONAL CORRESPONDENT \nWASHINGTON — House Majority Leader Kevin McCarthy is making a promise to conservative Republican lawmakers — “I’m not John Boehner” — as he seeks their support to replace Boehner as speaker. \nMcCarthy and his two Republican rivals for the job took turns meeting behind closed doors Tuesday night with a coalition of four groups comprising the most conservative House members. These are the lawmakers who forced Boehner, R-Ohio, to resign. Now, they are maneuvering to deny his No. 2, McCarthy, the chance to ascend unless he agrees to various demands. \nYet after the meeting, the conservatives appeared unlikely to unite around any one candidate, giving McCarthy a chance to pick off individual lawmakers and pick up enough support to prevail. \n“I think that right now the only clear thing is that we’re going to keep our powder dry, we’re going to be not committed to any of the candidates as of right now,” Rep. Matt Salmon, R-Ariz., a leader of the House Freedom Caucus, said Wednesday. \n“Without a doubt I think he already has some conservative support,” added Rep. Mark Meadows, R-N.C., another Freedom Caucus member. \nLawmakers present for the forum said McCarthy, R-Calif. pledged a new direction for the House. \n“I think McCarthy’s pitch was ‘I’m not John Boehner, I’m going to run things differently, I’m my own man,’” said Rep. Blake Farenthold, R-Texas. “And I think that’s a case that he does have to make. One of the things I hear all the time from my constituents back in Texas is we don’t want John Boehner 2.0.” \nThe other two lawmakers running for the job — Reps. Jason Chaffetz of Utah and Daniel Webster of Florida — also addressed the group. Chaffetz said afterward, “I would just fundamentally change the way we do business around here, so it was fun.” \nMcCarthy appears to have the support of most House Republicans and seems likely to emerge as their nominee for speaker in secret-ballot elections set for Thursday. \nBut that does not guarantee he will prevail when the full House votes for a new speaker in open session on Oct. 29. That’s when conservatives will have their leverage, because McCarthy can lose only 29 Republican votes and still come out the winner. \nMcCarthy has Boehner’s support. But conservatives say they will not back him unless they are convinced that he will take the House in a new direction. They want more involvement in decision-making and a tough line on issues such as increasing the federal government’s borrowing authority and eliminating funding for Planned Parenthood in must-pass spending legislation — even though that risks a government shutdown. \nRep. Tim Huelskamp, R-Kan., chairman of the Tea Party Caucus, said McCarthy’s appearance had not won him over. \n“I don’t think Kevin convinced anybody he’d be much different than John Boehner,” said Huelskamp. “What’s the proof, what are the specifics? Right now it’s just, ‘Trust me.’” \nThe uncertain outcome has caused great turmoil in the House, even as lawmakers face daunting tasks including raising the debt ceiling by early November to avoid a market-rupturing default. \nMcCarthy’s candidacy was hurt by a gaffe last week where he boasted that the House’s Benghazi investigations committee could take credit for Hillary Rodham Clinton’s falling poll numbers. He retracted it, but the Democratic front-runner for president is now using the moment in a campaign ad, and the fracas gave Chaffetz an opening to jump into the race. \nMcCarthy told reporters Wednesday that he “could have been more clear” in the initial comments. Boehner rose to his defense, saying, “There’s not one American who in the course of their lifetime wouldn’t rather have the opportunity to say words over again.” \nMcCarthy and Boehner both emphasized the purpose of the committee is to find the truth about the Benghazi attacks that killed four Americans. \nChaffetz leads the high-profile House Oversight and Government Reform Committee. Webster, who unsuccessfully challenged Boehner in the past, already has a handful of endorsements from conservatives.", "external_links": [], "published": "2015-10-08T01:51:00.000+03:00", "crawled": "2015-10-08T05:15:27.512+03:00", "highlightTitle": ""}