{"organizations": [], "uuid": "d59fb5256d201d45dd0a77c6f32a460b37bb1df0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://voxy.co.nz//politics/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/christchurch-housing-response-changes-gear/5/234488", "country": "US", "title": "Christchurch housing response 'changes gear'", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Christchurch housing response 'changes gear'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:14:00.000+03:00", "replies_count": 0, "uuid": "d59fb5256d201d45dd0a77c6f32a460b37bb1df0"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/christchurch-housing-response-changes-gear/5/234488", "ord_in_thread": 0, "title": "Christchurch housing response 'changes gear'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Thursday, 15 October, 2015 - 12:14 \nThe focus of the Government’s housing support in Christchurch is changing with an increased focus on long-term quality housing and a phasing down of temporary housing support to meet the needs of a recovering city, Building and Housing Minister Dr Nick Smith said today in turning the first sod at the 109-home Atlas Quarter development at Welles Street in the central city. \n\"The Government’s housing response to the Canterbury earthquakes is shifting from temporary accommodation villages needed during the repair and rebuild phase, to increasing the supply of good quality, affordable housing for the reshaped, vibrant city of the future,\" Dr Smith says. \n\"A renewed Christchurch needs more people living in the central city. That is why we have partnered with the Christchurch City Council to facilitate new urban housing solutions within the four avenues. The 109-home Atlas Quarter development underway today will be made up of 101 apartments and eight townhouses. The innovative design includes a shared courtyard, function space, café and other new shops, and will be an exciting rejuvenation of the area. Thirty-two of the new homes are required to be priced at or below the Government’s KiwiSaver HomeStart grant threshold of $450,000 and the development is due for completion by mid-2017.\" \nThis site at Welles Street was previously owned by the Christchurch City Council and was purchased by the Government as part of the Government’s Housing Accord with the Christchurch City Council signed last September. Fletcher Living secured the development opportunity following a contestable process. The deferred settlement as part of the development agreement enables the Government to facilitate new housing for Christchurch, while minimising the cost to the taxpayer. \nThe Minister today also announced the Government’s decisions on the future of the four temporary accommodation villages at Kaiapoi Domain (22 homes), Rawhiti Domain (20), Linwood Park (42) and Rangers Park (40) that were established following the earthquakes to provide temporary accommodation for families while their homes underwent repairs. The original provision for the temporary accommodation was until mid-2013 but this was extended to April 2016. \n\"There is strong evidence the Christchurch housing market is recovering well. Average rents have fallen eight per cent in the past year. Average house prices have stabilised with an increase of only two per cent in the past year. The Canterbury Earthquake Temporary Accommodation Service (CETAS) has had registrations for assistance halve from 850 in May 2014 to 445 in August 2015, and registrations for the temporary accommodation villages have fallen from 400 to 230. The number of new CETAS registrations has dropped from 50 per week in March 2014 to nine per week most recently,\" Dr Smith says. \n\"The Canterbury Earthquake Temporary Accommodation Service and the temporary accommodation villages have made a huge contribution, helping 6000 families to access accommodation and 1000 families being directly assisted with the villages. Current funding and consents have these services cease on 1 April 2016. We have decided on a progressive phasing down over the next two years. \n\"Kaiapoi is the most advanced in the recovery and the occupancy rate at the village has fallen to 66 per cent compared to 89 per cent at the Christchurch city villages. The Kaiapoi Domain village will close on 18 April 2016. The latest current tenancy there ends in March 2016 so no one will be required to leave early. The Ministry of Business, Innovation and Employment will today be issuing a Request for Information and proposals to the private sector for the disestablishment of the village and recovery of the useable components. The Government is committed to returning the Domain to its former state in consultation with the Waimakariri District Council. \n\"We have decided to extend the life of the Canterbury Earthquake Temporary Accommodation Service and the villages at Rawhiti Domain and Linwood Park for a further 14 months until at least June 2017. We have the support of the Christchurch City Council for the continued use of these reserve areas. We will continue to monitor demand for these two villages and will review the timing late in 2016 relative to demand. \n\"The Rangers Park village was specifically built with the intention for it to be used initially as temporary accommodation and then on-sold to provide permanent quality, affordable housing in Christchurch’s eastern suburbs. Accordingly as demand subsides, these homes will be on-sold to either social housing providers or first home buyers. \n\"This gearing down of the temporary housing support is matched by a gearing up of Government-supported permanent housing construction. The combination of initiatives at Welles Street, Colombo Street, Riccarton Racecourse and Awatea will provide more than 1000 new quality homes for the city. These efforts are also complemented by Housing New Zealand’s massive rebuild and new build programmes, the growth of community social housing, new emergency housing and huge private sector investment. \n\"Housing has been one of the most complex and challenging problems from the Canterbury earthquakes but we are well on the way to recovery. Officials project that by June 2017, supply and demand will be back in balance and the Christchurch housing market fully recovered.\" \n ", "external_links": [], "published": "2015-10-15T03:14:00.000+03:00", "crawled": "2015-10-15T04:15:48.928+03:00", "highlightTitle": ""}