{"organizations": [], "uuid": "d60ae464aaf74d6646191b7082fdf3f66e07c5db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/the-real-purpose-of-most-mosques-3064530.html", "country": "US", "title": "The Real Purpose Of Most Mosques | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "The Real Purpose Of Most Mosques | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:17:00.000+03:00", "replies_count": 0, "uuid": "d60ae464aaf74d6646191b7082fdf3f66e07c5db"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/the-real-purpose-of-most-mosques-3064530.html", "ord_in_thread": 0, "title": "The Real Purpose Of Most Mosques | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nhttp://google.com/safebrowsing/diagnostic?tpl=safari&site=theblacksphere.net&hl=en-us When you are flipping hamburgers, you can play ignorant about the management of the restaurant. However that kind of excuse doesn’t fly when you are the President or the Attorney General of the United States. Barack Obama and Loretta Lynch have to know the facts on Islamic mosques being havens for terrorism, in as much as Hillary knows undoubtedly that she used her personal email accounts to transmit classified material. Lynch has come out in defense of the American Islamic Center (AIC) by suing Des Plaines, Illinois over a 2013 city council decision to deny zoning rights for a new mosque in their city. The local people fought against the mosque, not only for the financial loss to the city since the proposed site sat in a commercial district, but also for the obvious traffic and parking issues that it would undoubtedly cause.\nIn an attempt to defend the AIC, according to the Conservative Angle , Principal Deputy Assistant Attorney General Vanita Gupta, head of the Civil Rights Division, said,\n“The ability to establish a place for collective worship is a fundamental protection of the First Amendment and our civil rights laws.”\nRecall when Obama or anyone in his administration ever stood up for Christians’ and Jews’ First Amendment rights? Of course not, because it hasn’t happened.\nIt’s certainly a lot easier to recall the times Obama has stood for Muslims’ rights. Take Ahmed the clock-maker, who received supportive tweets after taking a clock resembling a bomb to school. And what of Bo Bergdahl, the Muslim convert who abandoned his military post, who was given a hero’s welcome? Frankly, the examples of Obama’s support of Muslims is too many to mention.\nThen what of the irony of Muslims who like the First Amendment rights provided by our Constitution, yet Sharia Law is in direct opposition to the very same document.\nThe fact is, mosques are not places of worship. They are generally seats of Islamic government, military battalions, and arms depot. In America, there are thousands of them, and that number is growing.\nHassan al-Banna, the founder of The Muslim Brotherhood, describes the mosques as key for the Islamic movement to advance within cities and towns. According to a Jews News article,\n“They are often centers for jihadist incitement, recruitment, training, and fundraising,”\nSo the building and positioning of mosques can be seen as strategic military movements by a political ideology, not a religion. They place these strongholds within our communities, and right under our very noses. Furthermore, with the assistance of our very own Commander In Chief and his Attorney General we now have precedents being set by our DOJ against citizens who seek to make the best decisions for their own communities by attempting to stop the advancement of them.\nThe mosques and radical Imams who lead them have been key to practically every jihadi attack on our soil. They remain the strong and essential link to the Muslims who decide to act out kinetically against the American people. Consider the relationships between The Islamic Society of Boston to the Tsarnaevs and the Boston Marathon Bombing, The Islamic Society of Greater Chattanooga to Abdulazeez and the Chattanooga Shooting, The Islamic Community Center of Phoenix to Soofi and Simpson and the Garland Texas Shooting, just to name a few.\nIf there is a liberal intolerance for the Confederate Flag because a deranged racist shooter happened to be wearing a t-shirt imprinted with the image, how much more sense would it make for there to be intolerance of more mosques, especially the ones affiliated with the Muslim Brotherhood. These battalions promote Islamic jihad in our country and encourage young men to travel to foreign lands to fight alongside ISIS and other Islamic affiliates.\nYet, instead of stopping the spread of these Mosques, the federal government reaches down into a city matter on behalf of the AIC. The federal government who is supposed protect the American people from threats both foreign and domestic, failed miserably to do so, and in effect aids and abets the enemy.\nWe should be fighting the building of any mosques, or at the very least require the Muslim countries build a Christian church for every mosque built in America, and protect Christians to the level that we protect Muslims.", "external_links": ["http://google.com/safebrowsing/diagnostic?tpl=safari&#038;site=theblacksphere.net&#038;hl=en-us", "http://theblacksphere.net//feed/https://www.centerforsecuritypolicy.org/2015/07/17/another-jihad-attack-another-mb-mosque-will-there-be-an-investigation/", "http://conservativeangle.com/ag-lynch-suing-illinois-town-for-refusing-islamic-temple-permit/", "http://m.clarionproject.org/news/garland-shooters-attended-same-arizona-mosque", "http://www.jewsnews.co.il/2015/06/08/iraqi-cleric-thousands-of-mosques-in-america-preparing-people-to-join-isis-2/", "http://m.clarionproject.org/category/tags/islamic-society-boston"], "published": "2015-10-14T04:17:00.000+03:00", "crawled": "2015-10-14T06:29:49.920+03:00", "highlightTitle": ""}