{"organizations": [], "uuid": "fe4641f0e92cfcb669e91bf0a88608933591f46b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oregonlive.com", "main_image": "http://imgick.oregonlive.com/home/olive-media/width620/img/oregonian/photo/2015/10/09/18936244-large.jpg", "site_section": "http://impact.oregonlive.com/politics/atom.xml", "section_title": "Politics & Elections", "url": "http://www.oregonlive.com/politics/index.ssf/2015/10/obamas_public_comments_in_rose.html", "country": "US", "title": "Obama's public comments in Roseburg: full text", "performance_score": 0, "site": "oregonlive.com", "participants_count": 1, "title_full": "Obama's public comments in Roseburg: full text", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:56:00.000+03:00", "replies_count": 0, "uuid": "fe4641f0e92cfcb669e91bf0a88608933591f46b"}, "author": "Michelle Brence | The Oregonian/OregonLive", "url": "http://www.oregonlive.com/politics/index.ssf/2015/10/obamas_public_comments_in_rose.html", "ord_in_thread": 0, "title": "Obama's public comments in Roseburg: full text", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \"Obviously, in moments like these, words aren't going to bring their loved ones back.\" \nHere's the full text of President Barack Obama's public comments in Roseburg on Friday after he met with families of the victims in last week's shooting. Eight students and a professor were killed in the Oct. 1 shooting at Umpqua Community College, and nine others were injured. \nAs he spoke, the president was flanked by Roseburg Mayor Larry Rich and Oregon Gov. Kate Brown. I'm going to be very brief here. I just want to first of all say thank you to Mayor Rich. I want to thank Governor Brown. Most importantly, I want to thank the entire community and the entire state of Oregon for coming together at this terrible time to support the families. I just had a chance to talk to them. Obviously, in moments like these, words aren't going to bring their loved ones back. But the one thing that they shared is how much they appreciate the entire UCC community coming together, how much they appreciate all their neighbors, all their friends, and people all across the country who offered to help (and) sent their thoughts and their prayers. And what I just told the mayor is that if there's anything we can do at the federal level to help the community heal from this loss, obviously we're going to be there. And I know that flying out here with some of the members of the Oregon delegation, they feel the same way. And the governor obviously has been paying a lot of attention to how we can be most helpful to the families. There are going to be, I think, moments as we go forward where we're going to have to come together and figure out how do we stop things like this from happening. I've got some very strong feelings about this because when you talk to these families, you're reminded that this could be happening to your child, or your mom, or your dad, or your relative or your friend. So we're going to have to come together as a country to see how we can prevent these issues from taking place. But today it's about the families, their grief and the love we feel for them. They surely do appreciate all the support they have received. \n-- Michelle Brence", "external_links": [], "published": "2015-10-10T02:56:00.000+03:00", "crawled": "2015-10-10T21:44:14.176+03:00", "highlightTitle": ""}