{"organizations": [], "uuid": "76ce3b31dbbca3e3ee575ee15b12ad025ecb0bc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30261129/ron-simon-associates-files-third-salmonella-cucumber-lawsuit-in-san-diego-california", "country": "US", "title": "Ron Simon & Associates Files Third Salmonella Cucumber Lawsuit in San Diego California", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Ron Simon & Associates Files Third Salmonella Cucumber Lawsuit in San Diego California - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "76ce3b31dbbca3e3ee575ee15b12ad025ecb0bc0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30261129/ron-simon-associates-files-third-salmonella-cucumber-lawsuit-in-san-diego-california", "ord_in_thread": 0, "title": "Ron Simon & Associates Files Third Salmonella Cucumber Lawsuit in San Diego California", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Ron Simon & Associates\nSAN DIEGO , Oct. 14, 2015 /PRNewswire/ -- The national food safety law firm of Ron Simon & Associates, along with Gomez Trial Attorneys of San Diego , has filed its third California lawsuit stemming from Salmonella -contaminated cucumbers. The cucumbers were imported from Mexico and distributed to numerous retail outlets and restaurants in the United States by Andrew & Williamson Fresh Produce (A&W) under the Limited Edition label. CDC health officials have linked the tainted cucumbers to a nationwide Salmonella Poona outbreak.\nThe lawsuit was filed against A&W in San Diego County on behalf of Michael Wahlster , a resident of San Diego County. A&W is headquartered in San Diego. A copy of the lawsuit is attached.\nIn early August of this year, Michael purchased A&W Limited Edition cucumbers as part of a healthy diet, and thereafter consumed them on a regular basis in salads and on their own.\nWithin a short period of time, Michael began to experience abdominal cramps, diarrhea, headaches, fever, body aches, and chills. He went to an urgent care center, and was told he likely had a virus. When his symptoms did not abate, he presented to Sharp Memorial Hospital, and thereafter to his physician on multiple occasions. A stool culture confirmed that he had tested positive for Salmonella Poona, matching the outbreak strain linked to tainted A&W Limited Edition cucumbers.\nMichael spent several weeks recovering from his Salmonella illness.\nAndrew & Williamson Recalls Tainted Limited Edition Cucumbers\nIn August of 2015, the Centers for Disease Control and Prevention (CDC), U.S. Food and Drug Administration (FDA), and state and local health agencies became aware of a growing number of Salmonella Poona cases nationwide. The CDC has now identified 732 victims in 35 states. The outbreak has hospitalized at least 150 and caused the deaths of 4 individuals.\nFederal investigators identified A&W Limited Edition cucumbers imported from Mexico as the likely source of the outbreak. Testing of leftover A&W cucumbers from restaurants and grocery stores where victims had eaten subsequently tested positive for Salmonella . San Diego health officials also collected cucumbers from the A&W facility which tested positive for Salmonella .\nOn September 4 th , A&W recalled its Limited Edition cucumbers, referred to as \"slicer\" or \"American\" cucumbers. They are dark green in color, typically measure 7 to 10 inches in length, and are traditionally sold in bulk displays without any individual packaging or plastic wrapping.\nFood Safety Attorney Ron Simon Issues Statement for Victims and Establishes Salmonella Claim Center\nNational food safety attorney Ron Simon represents Michael Wahlster and several other victims of the outbreak, including family members of one of the deceased victims. In a statement released today, Mr. Simon stated: \"This salmonella outbreak is one of the largest in recent years, and yet it was completely preventable. If we can force produce importers like Andrew & Williamson to implement simple cleaning and testing procedures to protect the American consumer, these outbreaks will stop occurring. Through these lawsuits, we will make sure that they do.\"\nMr. Simon and his law firm have established a Salmonella Claim Center to assist victims in the outbreak. The Salmonella Claim Center can be reached toll-free at 1-888-335-4901.\nAbout Food Safety Attorney Ron Simon\nOver the last 20 years, Ron Simon and his colleagues have prosecuted thousands of food poisoning cases for victims across the United States. His work has resulted in numerous upgrades to food safety procedures in Fortune 500 companies and in legislation designed to protect consumers from dangerous food-borne pathogens.\nMr. Simon and his clients have been featured on NBC, ABC, CBS, CNN, FOX and virtually all other major television networks and print media. Mr. Simon has collected over $600,000,000 for his clients. He regularly publishes articles about food safety and litigation at www.foodpoisoningnews.com which are read by viewers in over 180 countries.\nThrough litigation, media commentary, and his food poisoning publications, Mr. Simon relentlessly challenges food manufacturers, distributors, and restaurants to do a better job in making our food safe.\nFor media inquiries or more information on the salmonella outbreak and ongoing litigation, please contact Ron Simon directly at (713) 819-8116 or ron@rsaalaw.com .\nPDF - http://origin-qps.onstreammedia.com/origin/multivu_archive/ENR/276937-Complaint-_4_.pdf\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ron-simon--associates-files-third-salmonella-cucumber-lawsuit-in-san-diego-california-300159774.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=LA28336&Transmission_Id=201510141436PR_NEWS_USPR_____LA28336&DateId=20151014", "http://www.prnewswire.com/news-releases/ron-simon--associates-files-third-salmonella-cucumber-lawsuit-in-san-diego-california-300159774.html", "http://origin-qps.onstreammedia.com/origin/multivu_archive/ENR/276937-Complaint-_4_.pdf", "http://www.xmlnews.org/ns/", "http://www.foodpoisoningnews.com/"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:53:57.119+03:00", "highlightTitle": ""}