{"organizations": [], "uuid": "e7a651c20c2ea336941df112bd4061ad62e9714e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/ab3caa5e-38f3-4cbc-bdc6-1c79576599cd.img", "site_section": "http://www.ft.com/rss/world/americas/politics", "section_title": "Latin America & Caribbean Politics News - FT.com", "url": "http://www.ft.com/cms/s/0/5f261b04-6721-11e5-a155-02b6f8af6a62.html?ftcamp=published_links%2Frss%2Fworld_americas_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Brazil central bank pledge against inflation", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Brazil central bank pledge against inflation", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T12:33:00.000+03:00", "replies_count": 0, "uuid": "e7a651c20c2ea336941df112bd4061ad62e9714e"}, "author": "", "url": "http://www.ft.com/cms/s/0/5f261b04-6721-11e5-a155-02b6f8af6a62.html?ftcamp=published_links%2Frss%2Fworld_americas_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Brazil central bank pledge against inflation", "locations": ["Brasília", "Brazil"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Leahy"], "text": "Brazil central bank vows to do what it takes to control inflation Joe Leahy in Brasília Comments \nBrazil’s central bank is willing to do whatever is necessary to control inflation while the country grapples with the thorny issue of how to rebalance the nation’s public finances, a senior official has said. \nTony Volpon (pictured), head of international affairs at the central bank, said that while tax increases to balance the budget could raise prices, monetary policy would be adapted to ensure that inflation eventually converged to the official target of 4.5 per cent. More Gloomy reality dawns on Brazil \nAnnual inflation is running at 9.6 per cent. \n“I would much rather that we have a sustainable fiscal situation even if that means higher inflationary pressures that we need to control at our end,” Mr Volpon said in an interview at the central bank’s headquarters in Brasília. “We know how to deal with that and we are ready and willing to deal with it again and bring inflation down to target.” \nThe comments come after Brazil’s currency, the real , last week broke through its all-time low against the dollar of over R$4 — a fall in value that was only arrested after central bank president Alexandre Tombini threatened intervention using Brazil’s foreign exchange reserves. \nThe currency’s moves reflected bearishness on emerging markets after the US Federal Reserve decided not to raise interest rates, citing weakness in China’s economy. \nIt showed a lack of confidence in Brazil’s fiscal sustainability, after flip-flopping by the government on its budget deficit targets cost the country its investment grade rating from Standard & Poor’s. \nPresident Dilma Rousseff has been trying to put a fiscal adjustment through congress to rein in Brazil’s growing public debt burden, but rebellious lawmakers have rejected elements of the plan, especially tax increases. \n“The Fed was maybe thinking it was doing something helpful in not raising interest rates,” said Mr Volpon, former head of emerging market research at Nomura, who joined the central bank earlier this year. Brazil in the line of fire \nPresident Rousseff faces impeachment in move that could bring recession-hit country to a standstill \nBut by calling attention to its concerns over China through its decision, it “all of a sudden accelerated the selling of emerging markets”. \nMr Volpon said that despite the bearishness, markets were overpricing the risk that Brazil would not be able to implement a sustainable fiscal adjustment. \nUpward moves in credit markets last week, such as credit default swap rates for Brazil that showed that the cost of insuring the country’s debt was above that of war-torn Lebanon, were due to technical factors such as cross-hedging of positions. \n“This is a country . . . where the public sector is still a net creditor in dollars,” said Mr Volpon. “We have about $50bn of overall external sovereign debt against $370bn of reserves.” \nMr Volpon said the country was already adjusting across three important areas. \nThe sharp depreciation in the currency was lowering the current account deficit to more sustainable levels. \nIt was reviving net exports after years of their being crushed by a strong exchange rate during the commodities supercycle of the last decade, when Brazil sold iron ore and soybeans to a booming China at record prices. \nMonetary policy was holding tight with the central bank maintaining its benchmark Selic rate at a high of 14.25 per cent. \nWhere there had been a lag was in the fiscal adjustment. This was due to a structural shift in the economy that had created a shortfall in government revenues — a gap that would have to be met through deeper spending cuts or higher revenues. \n“You saw the tax burden go up continually while we had the China-led boom,” said Mr Volpon. “We were sort of in a win-win situation. There was enough money for profits, there was enough money for salaries, there was enough money for taxes.” \nBut with the end of the boom, corporate Brazil’s ability to produce the same tax revenue had disappeared. This new reality was dawning on society, fuelling the debate between the Ms Rousseff and congress about where the axe should fall. \nMr Volpon said while this debate was not proceeding as fast as markets would like, it was progressing. \nIn particular, the turbulence last week had tempered resistance in congress to fiscally responsible measures. \nLast week lawmakers did not oppose presidential vetoes of a series of populist bills known as the “fiscal bomb” that if passed would have sharply increased the budget deficit. \n“I absolutely do not believe we are in some kind of unsustainable spiral,” said Mr Volpon. “In fact I think it is all converging to a fixed point of stability and these are adjustments are working . . . We just need to persist.” \nHe said that for its part, the central bank was waiting to see what new measures would be agreed between the government and congress to ensure that the country plugged the budget gap. \nRecent discussion was of reintroducing a tax on financial transactions, the CPMF. \nMr Volpon said that whatever was decided, the central bank hoped to have more clarity before its next monetary policy committee meeting on October 21, at which it would debate what was needed to deal with the implications for inflation. Related Topics", "external_links": [], "published": "2015-09-30T12:33:00.000+03:00", "crawled": "2015-10-01T06:25:08.734+03:00", "highlightTitle": ""}