{"organizations": [], "uuid": "5366a734b23eb24a984ac7f44bf6943233fdbad0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://i2.wp.com/www.occidentaldissent.com/wp-content/uploads/2015/10/Unknown-2.jpeg?resize=264%2C191", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/politics/2015/10/15th-century-spain-muslims-jews-and-our-guys-2748852.html", "country": "US", "title": "15th Century Spain – Muslims, Jews and Our Guys | Politics", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "15th Century Spain – Muslims, Jews and Our Guys | Politics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T16:57:00.000+03:00", "replies_count": 0, "uuid": "5366a734b23eb24a984ac7f44bf6943233fdbad0"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/politics/2015/10/15th-century-spain-muslims-jews-and-our-guys-2748852.html", "ord_in_thread": 0, "title": "15th Century Spain – Muslims, Jews and Our Guys | Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nColumbus Day, 2015\nOccidental Dissent Classic\nI was bicycling in a former Chicago neighborhood I grew up in, two blocks from the Chicago Kenwood Hyde Park mansion of President Barack Obama. The Obamas are rarely there these days. But, there is still 24/7 Secret Service protection. I noticed that there is a large Jewish synagogue one block from the Obama mansion. It doesn’t really look like a Jewish synagogue to me. It looks more like an Islamic mosque. So what is an Arabic/Ottoman mosque looking Jewish synagogue doing just one block from the home of the American President, who is the bastard son of a Black Muslim Kenyan?\nAnother related question is:\nHow did an obscure, half White Illinois state representative Barack Obama become a huge player in Chicago Black power politics, then become a US Senator and four years later President of the United States of America?\nThe answer to these questions have to do with the seemingly Byzantine nature of Chicago, American and Western politics.\n“All politics are local.” — US Speaker of the House Tip O’Neil\n“All politics are racial/ethno-religious.” — Jack Ryan, Occidental Dissent\nBarack Obama rose almost overnight from a nobody to a US Senator to President of the United States in large part from a coalition of Black power groups and Liberal-Left, heavily Jewish groups and advisers like David Axelrod. More extremist cultural Marxists like SDS Weather Underground terrorist Bill Ayers and Bernardine Dohrn were also involved, but like Obama’s crazed Black Liberation Theology, hate White people preacher Jeremiah Wright, these Leftist Marxists kept a lower profile. The American New Left of the late 1960s and all through the 1970s was heavily Jewish as of course were the Bolshevik-Communist movements in Russia and other Eastern and European countries a century ago. It wasn’t some huge super secret conspiracy, it’s just the way things were.\nWell, speaking of the way things were and are – how about the terrible violence between Israeli Jews and Palestinian Muslims now occurring in Jerusalem? It must be that Jews and Muslims are great enemies, have always been enemies…\nThat’s a decided “NO” on that one.\nUntil the foundation of the modern Jewish state of Israel in 1948, Jews and Muslims tended to have much better relations than Jews and European Christians, especially Jews and European Catholics. Jews then and now tried to fit in with their Islamic rulers, that’s why lots of Jewish synagogues like this one in Chicago look just like Islamic mosques. Jews and Muslims tend to have long memories – both groups know and remember that Spain was invaded and occupied by Muslim Arab Moors for….\n700 years!\nOn, balance the Moorish Spanish years are considered a golden age for the Jewish people. When Spanish Catholics reconquered Spain from the Muslim Moors there was…\nThe expulsion of the Jews from Spain in 1492 and the Spanish Inquisition!\nWhat was with all of that?!\nHere is a OD/Instauration classic history lesson on 15th Century Spain – these same multicultural conflicts, temporary alliances and betrayals are now back with us this year 2015.\nSpain Might Have Had Some Good Reasons to Expel the Jews\nInstauration Magazine November 1992\n(Presented for the educational, non commercial use, “fair comment” protected by the 1st Amendment)\n“Every schoolboy is or should be familiar with the year 1492, the year of the (re)discovery of the New world by Christopher Columbus, a Genoese in the service of the Spanish monarchs, Ferdinand and Isabella. For Spain, 1492 was to be the most important year in its history, as well as one of the most important in world history. It was the year the Spanish nation was consolidated, the year it said adios to the Middle Ages, the year when the splendorous Spanish State took center stage in the political evolution of the West. In the beginning of the year, on January 2, after a long siege, the army of the Spanish monarchs marched into the city of Granada, thus re-conquering the last of the real estate seized by the Arabs and moors seven centuries earlier. Then, on March 31, the Catholic monarchs signed a royal edict that ordered all Jews in Spain to convert to Christianity or ship out. Five months later Columbus sailed out of the Spanish port of Palos hoping to discover a new route to the Indies. His tiny fleet passed boats loaded with Jews sorrowfully complying with Ferdinand and Isabella’s expulsion order.\n*\nIn this 500th anniversary of Columbus’s epochal voyage, much of the celebration has been marred by media inspired attacks on Spain for her “cruelty” and “foolishness” in expelling Jews. No one seemed to care what was done to the Muslims, who were also given the choice of conversion or expulsion a few years later, just as no one these days seems to care much about what was done to non-Jews in WWII German and Soviet concentration camps, where the death toll of Gentiles was probably ten times greater than the number of Jewish fatalities. Actually, any Jew who converted to Christianity was perfectly free to stay in Spain. Those who left could take all their earthly possessions with them, except gold and silver coins and trinkets.\nThe current media story line is that the Spanish, in a fit of blind religious fanaticism, cut off their noses to spite their faces by kicking out the clever and enterprising Jewish community. Having heard these tearful tales over and over again, history buffs could be forgiven for thinking that only mass insanity could have led Spaniards to commit such an enormous gaffe. Jews, today’s spin doctors insist, were the cultural and economic backbone of Spain, the most educated and verbal segment of the population. Only greed, envy, ignorance and Christian bigotry could possibly explain this act of pure folly. Once again, a peaceful, unoffending people were driven out into the cold because of the heartlessness of their wicked neighbors. But that is not the end of the story! As is almost always the case, there was a price to be paid for persecuting the Jews. The price for Spain, according to the Jewish version of history, was its decline and fall, following the loss of so much Jewish brainpower and the economic and cultural benefits which Spain’s rivals, Portugal and Holland, received from swarms of Jewish refugees.\nPer usual, when it comes to Jews, the story they tell is, shall we say, at variance with the facts. Fourteen hundred and ninety-two was the year Spanish civilization took off like a rocket. Within a century or two, Cervantes was writing Don Quixote; Velasquez was painting his incomparable portraits; Calderon was writing his brilliant plays. It almost seemed as if the presence of the Jews had kept Spanish culture under wraps and their forced removal unloosed tremendous bursts of artistic, literary and economic energy. (Might it be possible that the same unshackling of cultural forces would produce similar results if the Jews left the U. S.?) In A History of Medieval Spain, Professor Joseph F. O’Callaghan provides us with perhaps the most scholarly and precise treatment of Spanish history in the time between the Arab conquest and the Moors’ surrender of Granada. Spain had its origins in the Roman Empire. The Roman provinces in what is now Spain and Portugal furnished the Empire with some of its greatest Emperors. With the fall of Rome, Spain was transformed into a kingdom of Visigoths, one of the German tribes which had inherited remnants of the Empire. The Visigothic kings were Christianized and ruled over a population comprised partly of Nordics and largely of Mediterraneans, with a heavy sprinkling of Jews. Later, when the Arabs imposed Islam on Spain, the composition of the population was not greatly changed. The overwhelming majority of Arabs and Spaniards belonged to the Mediterranean race, though Nordic racial traits, such as fair complexions and blue eyes (Isabella had them), were discernible in the ruling circles of both peoples. Some Nordic genes had been implanted by the Vandals who swept through Spain before the Visigoths and fought their way as far as Tunis in North Africa. Here, it might also be noted, that the Muslim rulers and Caliphs of Spain were not exactly cultural throwbacks. The Alhambra Palace in Granada is the most beautiful and most graceful pleasure dome to be found on any continent. In 675 the Muslims launched their first raid on Spain, which was repulsed by the Visigothic fleet. By 711, the Arabs had conquered North Africa and were ready to invade Western Europe. in only 21 years they penetrated as far north as Tours in France before being defeated and thrown back by the Franks under Charles Martel.\nThe reasons for the woefully poor showing of the Visigoths vis-a-vis the Arab invaders had to do with treason in high places. As O’Callaghan remarks, “Certainly the Jews and others who had suffered under Visigothic rule welcomed the invaders as liberators and collaborated with them.” As O’Callaghan also points out, perhaps to avoid endangering his academic standing, the Jewish renegadism was justified by the “disorder” of the Visigothic Kingdom. The re-conquest of Spain started in the rugged mountains’ of Asturias in northern Spain. There a Visigothic knight, Pelayo, refused to bow down to the Muslims and won the first battle in a 700-year-war between Islam and Christianity. The Reconquista, as it is known, was a glorious era in the history of the West. A proud and fierce people would be tried and tested in a thousand battles. The Jews, as is their custom, quickly burrowed into the Arab fabric of Spain. Generally preferring Muslim to Christian overlords, the People of the Book were allowed to practice their religion without interference and became key elements in Muslim society. it need hardly be added that the Christians who had suffered from Jewish money men in Visigothic times, came to loathe them more than ever in Muslim Spain.\nBy the 11th century the situation in Spain had become fluid, with the Christians slowly nibbling back parts of their lost lands, while constantly under the threat of fierce Muslim counterattacks. It is not surprising that the eternal “middlemen” should rise to the surface in these troubled times. In both the Muslim and Christian parts of Spain, Jews engaged in all their age-old occupational specialties: usury, the slave trade, prostitution, tax “farming” (contracts to collect taxes for the kings and nobles), the law, medicine, administration and any other type of employment that required little or no physical labor. Worst of all from the point of view of the pious Christian population, they were able to infiltrate the church in large numbers. It was this last activity that led to their downfall. As Muslim power waned, Jews relied more and more on the expanding Christian kingdoms of Spain to provide them with their customary perks. Employed by Spanish monarchs in the most sensitive matters of state, especially in finance, Jews never had it so good since the good old days of Solomon. The Chosen, however, could not enter the church without converting. It was not too long before true Christians realized that the Christianity of most “New Christians” was only skin deep. That converted Jews mocked the Christian religion, celebrated Jewish feast days, and were slowly and subtly introducing Talmudic themes into Christian theology were open secrets. It was no wonder they came to be viewed as a hostile element, busy weakening the Christian nation in the very face of the Muslim enemy.\nHigh-Octane Religiosity\nIn the Middle Ages religion was the fault line of the world. In the same way that the West fought communism in this century, so the Christian West fought the power of Islam in those crucial years. Religion was central to all aspects of life, there being no such thing as a secular state. It is a waste of words to argue that Christian Spain should have made room for Jews and Muslims. Such an accommodation was quite out of the question in the Age of Faith. When Spain expelled the Jews, England, France and other European nations had long since sent them on their way, for approximately the same reasons. The main difference was that the number of Jews and their influence and affluence in Spain were vastly greater than elsewhere in Europe. Ironically the European nations that would later condemn Spain for expelling Jews were the first to voice suspicion of Spain’s “purity” because it had been “defiled” by the presence of so many Jews and Muslims. Queen Isabella agreed up to a point. She knew very well that as long as Jews remained in her kingdom they would constitute a political, cultural, philosophical and theological fifth column, not to mention a military liability in the event of a Muslim attempt to retake what they had lost, a scary scenario that was always a possibility.\nIsabella and her husband, Ferdinand, knew in their hearts that only by building one undivided and indivisible Spain could they carry out the tremendous task they had set for themselves. They understood what we seem to have forgotten: You cannot build a nation out of disparate population groups widely separated by culture and religion. Either Jews and Muslims would leave or renounce their faith, or Spain, as a united Christian country, would never endure. Although Jews are not a race, they act like a race and should be treated as one. Anthropologically speaking, they are various mixtures of the Nordic, Alpine and Mediterranean races, with a few distinctive facial traits showing up in many of them. Isabella’s relying on religion to define a Jew may have been adequate in her day, but it would be wide off the mark in 1992. Today, in the U.S. about 70% of Jews are non-religious. To use Judaism as a basis for expelling Jews would allow the more intelligent and more devious Jews to remain in our midst.\nThe Jews in the Christian Spain aborning were not fools. They were quite aware that popular sentiment was rising against them. Fighting back in any way they could, they bribed powerful and corrupt nobles and worked their way into high positions in the government and church. All in vain. In 1391 massive anti-Jewish pogroms broke out across Spain. In that year, thousands of Jews were killed in Aragon and Castile, in the words of O’Callaghan,\nHostility towards the Jews had often been manifested in the past, chiefly because of their involvement in money-lending and tax-farming. Complaints about Jewish usury and Jewish tax collectors occur again and again in the records of the Cones [the Spanish parliament or assembly] . . . . Though the Crown usually promised to attend to these complaints, Jews continued to figure prominently in the management of royal finances. The riots of 1391 spelled the beginning of the end for Spanish Jewry, although it would still hold on for another hundred years. The simple truth was that Spain had outgrown Jews, just as it had outgrown Muslims. The Jews, as stated previously, had no part to play in Spain’s great years, which, some cynics say, is why Spain had its “great years.” The Encyclopedia Britannica (1963 edition, vol. 2 1, p. 122) adds: “The tide of national enthusiasm, religious fanaticism and indignation at Jewish financial operations reached its high-water mark about three months after the fall of Granada. . . .” Apparently there were early-bird Milikens and Boeskys in the ranks of Spanish Jewry. Professor Philip W. Powell, in his book, The Tree of Hate (published in 1985) attributes the expulsion of the Jews to a religious conflict between Judaism and Christianity. He is not afraid to meet the issue of anti-Semitism head on: ‘The very misleading term of ‘anti-Semitism’ is so carelessly, or malevolently, tossed about these days that it virtually has no meaning except as a convenient rock to hurl in anger–but, like a rock, it can hurt.” He goes on to say: “The Jews’ impassioned opinions hamper the writing of fair and unbiased accounts of Spain. Jewish emotion, when aroused by historical memory of [the] Spanish Inquisition and expulsion, exaggerates and distorts, and certainly gives little shrift to the Spanish side of the story …. Jewish writers are aided by a popular opinion, much of it created by themselves, which for centuries has influenced writing upon these themes.”\nPowell points out that while it is true that all the 165,000 or so Jews who refused to give up Judaism were expelled in 1492, many more chose to stay and converted. Those who only converted superficially underwent various forms of capital punishment. Jews and other writers of anti-Spanish tendencies, have preferred to focus attention upon these Spanish crimes as a means of demonstrating Spanish cruelty and bigotry. The usual groundwork for this is a morality of later centuries applied to 15th and 16th century historical situations, without that sense of justice so essential to historical interpretations. Or, sometimes more simply, it may come from the well-known Jewish propensity for cultural replenishment out of martyrdom. Professor Powell gets to the nitty-gritty in these words: “But the majority of the Spanish people, witnessing [all the] evidence of Jewish-Converso influence . . . . and simply the numbers of Jews daily discernible in the population would, and did, view the situation with antagonism.”\nExplaining that this antagonism sometimes led to mob attacks on Jews, Powell dryly adds, “If there was anything uniquely Spanish in all this, it was not intolerance or bigotry, but rather a notable forbearance in comparison to the ways the Jewish problem was handled elsewhere in Europe.”\nInquisition Hype\nThe chief purpose of the Spanish Inquisition, established in 1480, was to ensure that Jews did not create a “state within a state.” The Inquisition was a defense of the monarchy and a defense against treason. Many European states applauded its creation as a needed step to rein in Jewish power. Whatever the Inquisition was to become once the Jews had gone, it served its primary purpose in ridding Spain of a hostile force of infiltrators and subversives at a time when the church and nation were in grave danger. The ferocity of the Spanish Inquisition may well stem from the fact that it was in large part staffed by Jewish converts, who amply demonstrated that they had lost none of their innate venom by switching religions. Jewish converts who fell all over themselves to prove their loyalty to their new faith were the driving force behind the grim and fanatical persecution of other Jews. Tomas de Torquemada, the ferocious Inquisitor General, who sent so many of his brethren to the stake, is said to have been of Jewish descent. No less an authority than Salvador de Madariaga, one of modern Spain’s leading intellectuals, holds to the view that the peculiar intolerance of the Spanish Inquisition can be traced, in part, to the presence of Jewish converts in its highest ranks. Madariaga, by the way, made up for this “anti-Semitic” opinion by stating that Columbus was a converso, but not necessarily a marrano (pig in Spanish), a derogatory term for a convert who practiced Judaism secretly. Several Jewish scholars, including the non-scholars of Time magazine, have accused King Ferdinand of being “part Jewish,” though they never satisfactorily explain where the Jewish genes came from. To sum up, Spain’s expulsion of the Jews was logical, rational and, for the times, not overly cruel – far less cruel than what modern Jews have done and continue to do to the Palestinians. The Spanish have no need to apologize for their actions in freeing their nation from a harmful internal enemy. The Jews resented their expulsion, as they have resented other forced exoduses in their history. The truth is, contemporary Jews should not blame Spain for their ancestors’ misfortunes five centuries ago. They need only to look in the mirror.\n*\nN.B.F. and W.R.", "external_links": ["http://i0.wp.com/www.occidentaldissent.com/wp-content/uploads/2012/09/sp_map_regions2-296x3001-296x300.jpg?resize=296%2C300", "http://i2.wp.com/www.occidentaldissent.com/wp-content/uploads/2015/10/Unknown-2.jpeg", "http://i2.wp.com/www.occidentaldissent.com/wp-content/uploads/2015/10/Unknown-2.jpeg?resize=264%2C191", "http://i2.wp.com/www.occidentaldissent.com/wp-content/uploads/2012/09/sp_map_regions2-296x3001.jpg"], "published": "2015-10-12T16:57:00.000+03:00", "crawled": "2015-10-12T19:47:30.397+03:00", "highlightTitle": ""}