{"organizations": ["FBI", "ISIS", "United Nations High Commission for Refugees", "National Counterterrorism Center", "Department of Homeland Security", "CNN", "Senate Homeland Security Committee", "UNHCR"], "uuid": "66e25d62603c0b7b3a92ac6d20b7f1a8e3a204f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150919163103-migrants-0917-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/08/politics/syrian-refugee-crisis-intelligence-gap/index.html?eref=rss_politics", "country": "US", "title": "Intelligence gaps pose challenge for Syrian refugee screening", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Intelligence gaps pose challenge for Syrian refugee screening", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:19:00.000+03:00", "replies_count": 0, "uuid": "66e25d62603c0b7b3a92ac6d20b7f1a8e3a204f9"}, "author": "", "url": "http://edition.cnn.com/2015/10/08/politics/syrian-refugee-crisis-intelligence-gap/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Intelligence gaps pose challenge for Syrian refugee screening", "locations": ["Washington", "U.S.", "Syria", "U.S", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Johnson", "Laura Koran", "James Comey", "Rasmussen", "Jeh Johnson", "Ron Johnson", "Comey", "Nicholas Rasmussen"], "text": "Children rescued from the rubble in Syria 02:32 Story highlights Top U.S. national security officials said Thursday there are gaps in data available to screen Syrian refugees \"The intelligence picture we've had of this conflict zone isn't what we'd like it to be...you can only review against what you have,\" NCTC Director Nicholas Rasmussen said Washington (CNN) Top U.S. national security officials said Thursday there are gaps in data available to screen Syrian refugees seeking to come to the U.S. The chiefs of the FBI, Department of Homeland Security and the National Counterterrorism Center were testifying before the Senate Homeland Security Committee about the challenges of thwarting the number of young people trying to travel overseas to join ISIS. They said the U.S. has vastly improved its screening procedures after failures in the vetting of Iraqi refugees in recent years. But NCTC Director Nicholas Rasmussen noted the war in Syria poses intelligence challenges that make vetting potential refugees harder. \"The intelligence picture we've had of this conflict zone isn't what we'd like it to be ... you can only review against what you have,\" Rasmussen said. Unlike with Syria, U.S. authorities had access to significantly more information on Iraqi refugees because the U.S. was occupying that country at the time and could use Iraqi government data, as well as information from the U.S. military. Read More Failures occurred because not enough was done to check that data, U.S. officials said. In 2013, two Iraqi refugees were sentenced to decades-long sentences for terrorism charges. The FBI found their fingerprints on improvised explosives that had been used against U.S. soldiers in Iraq -- information that wasn't found before the men were admitted into the U.S. The case was among several that forced the FBI to conduct new screening of refugees already in the U.S. In light of the Iraqi experience, the prospect of admitting Syrian refugees has raised concerns among U.S. counterterrorism officials. \"There is risk associated with bringing anybody in from the outside, but especially from a conflict zone like that,\" FBI Director James Comey said. \"My concern there is that there are certain gaps I don't want to talk about publicly in the data available to us.\" RELATED: U.S. to take at least 10,000 more Syrian refugees Homeland Security Secretary Jeh Johnson said he was confident in the improved vetting procedures. \"It's better than it used to be and the good news is UNHCR (United Nations High Commission for Refugees) has already identified a number of suitable refugees for resettlement,\" Johnson said. Comey reiterated concerns about encrypted communications, which allow ISIS recruits to disappear once they've been connected to recruiters via Twitter and other social media sites. He also noted that the FBI has noted recruits getting younger, and more girls and women being lured by ISIS. Sen. Ron Johnson, the committee's chairman, asked Comey how many people following ISIS social media accounts were being tracked by the FBI. \"Dozens,\" Comey said. CNN's Laura Koran contributed to the reporting of this story <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-10-09T01:19:00.000+03:00", "crawled": "2015-10-09T01:47:02.011+03:00", "highlightTitle": ""}