{"organizations": [], "uuid": "c3a511c5750a5628dead06943e5dd016570d8856", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30257710/wellcare-fighting-childhood-obesity-with-a-50000-grant-to-the-kentucky-alliance-of-ymcas", "country": "US", "title": "WellCare Fighting Childhood Obesity with a $50,000 Grant to the Kentucky Alliance of YMCAs", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "WellCare Fighting Childhood Obesity with a $50,000 Grant to the Kentucky Alliance of YMCAs - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "c3a511c5750a5628dead06943e5dd016570d8856"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30257710/wellcare-fighting-childhood-obesity-with-a-50000-grant-to-the-kentucky-alliance-of-ymcas", "ord_in_thread": 0, "title": "WellCare Fighting Childhood Obesity with a $50,000 Grant to the Kentucky Alliance of YMCAs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " WellCare Health Plans, Inc.\nHealth and Fitness Programs to Serve Christian, Clark, Jefferson, Mason and Pike Counties\nTAMPA, Fla. and FRANKFORT, Ky. , Oct. 14, 2015 /PRNewswire/ -- WellCare Health Plans, Inc. (NYSE:WCG) is helping to address childhood obesity in the commonwealth through a $50,000 grant to the Kentucky Alliance of YMCAs. WellCare supports the organization's evidence-based programs, which are aimed at encouraging healthy eating and physical activity for youths and families from underserved and low-income communities throughout the state.\nWellCare is helping to fund six programs:\nThe Hopkinsville ( Christian County ) Special Needs and Mental Health / Behavioral Health Specialized Fitness Program: Offers specialized fitness classes for individuals with special needs and mental health / behavioral health diagnoses. The program aims to increase mobility and improve basic locomotion skills of daily living. Jefferson County YMCA Diabetes Prevention Program: Offers Centers for Disease Control and Prevention course that helps people at high risk begin and maintain healthy lifestyles to reduce the chance of developing type-2 diabetes. The program, taught by a trained lifestyle coach, will equip individuals with a body mass index of 25 or higher with healthy eating habits, proper physical fitness activities and ways to positively change behavior. Clark County Teen Leadership Club: Promotes healthy eating and physical activity by encouraging participants to plant and maintain a community garden, participate in physical activity at each meeting and enroll in healthy cooking classes. Mason County \"Fit for Kids\" and \"SuperChef\" Programs: Provides nutrition and education programs to promote physical activity and healthy eating habits by inspiring its members to plant and maintain a community garden, enroll in healthy cooking classes and develop a youth-led healthy recipe cookbook. Pike County Youth Fitness Program: Serves youths with a BMI of 30 or higher by focusing on healthy habits through the adopted standards of healthy eating and physical activity in early learning and after-school programs. Statewide – Kentucky Teen Institute – Inspire KY: Assists participants in developing the skills, knowledge and attitudes they need to make healthy choices. Through leadership training and supporting adult partnerships, Inspire KY empowers young people to implement community-based programs and youth-led initiatives. Kentucky has the third-highest childhood obesity rate in the country and the seventh-highest rate in adult obesity, according to the Trust for America's Health and the Robert Wood Johnson Foundation. Data also reveals persistent and highly variable disparities in childhood overweight and obesity, associated with socioeconomic status, neighborhoods, type of health insurance and quality of care.\n\"Studies show that children and adolescents who are obese are likely to become obese adults who are more at risk for adult health problems such as heart disease, type-2 diabetes, stroke, several types of cancer and osteoarthritis,\" said Dr. Howard Shaps , medical director for WellCare in Kentucky . \"Through this partnership with the Kentucky Alliance of YMCAs, WellCare is taking action to address this epidemic by teaching children at an early age the importance of developing healthy habits.\"\n\"The YMCA, with a statewide presence, is well positioned to help children and youth develop the habits of healthy living that will serve them well for a lifetime,\" said Ben Reno-Weber , the executive director of the Kentucky Alliance of YMCAs. \"With WellCare's grant, we have been able to build on the Y's experience in helping people achieve their health goals through nutrition education, self-monitoring of caloric intake, stimulus control and praise within the context of a supportive family environment. The Y's focus is on the health of a whole person, which includes the lifestyles and behaviors that contribute to chronic conditions. Partnering with WellCare is the perfect alignment of business and community goals.\"\n\"A healthy community is one where social safety net providers and community-based organizations are thriving and supporting the needs of local citizens,\" said Pamme Lyons-Taylor , vice president of advocacy and community-based programming for WellCare. \"WellCare wants to do its part to sustain the social safety net to support the health and well-being of its members, their families and communities at large. YMCAs have a strong foothold in their local communities and are a vital part of sustaining the social safety net for low-income children and families.\"\nHealth impacts every aspect of a child's life and is one of the most important components of overall child well-being. For more information on joining a local YMCA program or to find out more information on these programs, find the Y closest to you at http://www.kyymca.org/alliance .\nAs of June 30, 2015 , WellCare serves approximately 429,000 Medicaid members, 7,000 Medicare Advantage plan members and 21,000 Medicare Prescription Drug Plan members in Kentucky . To learn more about how we care for Kentuckians, watch Brandi's story at http://youtu.be/YwOw5EgeSYo .\nAbout WellCare Health Plans, Inc.\nHeadquartered in Tampa, Fla. , WellCare Health Plans, Inc. (NYSE: WCG) focuses exclusively on providing government-sponsored managed care services, primarily through Medicaid, Medicare Advantage and Medicare Prescription Drug Plans, to families, children, seniors and individuals with complex medical needs. The Company serves approximately 3.8 million members nationwide as of June 30, 2015 . For more information about WellCare, please visit the Company's website at www.wellcare.com or view the company's videos at https://www.youtube.com/user/WellCareHealthPlan .\nAbout the Kentucky Alliance of YMCAs\nAs one of Kentucky's leading nonprofit organizations, the Y is committed to strengthening communities through youth development, healthy living and social responsibility. That's because strong communities are possible only when we invest in our kids, our health and our neighbors.\nThe Y in Kentucky serves more than 350,000 people each year, including 160,000 children and 30,000 seniors. Across Kentucky, the Y mobilizes more than $6 million in donations and 8,000 volunteers each year.\nTo support your local YMCA program, find the Y closest to you at http://www.kyymca.org/alliance/\nLogo - http://photos.prnewswire.com/prnh/20151013/276525LOGO\nLogo - http://photos.prnewswire.com/prnh/20150701/227667LOGO\n releases/wellcare-fighting-childhood-obesity-with-a-50000-grant-to-the-kentucky-alliance-of-ymcas-300159277.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/wellcare-fighting-childhood-obesity-with-a-50000-grant-to-the-kentucky-alliance-of-ymcas-300159277.html", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnvar/20150701/227667LOGO", "http://youtu.be/YwOw5EgeSYo", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL27203&Transmission_Id=201510140830PR_NEWS_USPR_____FL27203&DateId=20151014", "http://www.kyymca.org/alliance", "https://photos.prnewswire.com/prnvar/20151013/276525LOGO", "http://www.kyymca.org/alliance/", "https://www.youtube.com/user/WellCareHealthPlan", "http://photos.prnewswire.com/prnh/20151013/276525LOGO", "http://photos.prnewswire.com/prnh/20150701/227667LOGO"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T19:59:27.380+03:00", "highlightTitle": ""}