{"organizations": [], "uuid": "f65105f6e38a1b28effd5c31e6730e00f8b53d2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/7/1444234074215/84ce017e-e4e8-4256-85a7-1aecf0c9bbee-bestSizeAvailable.jpeg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=67b30d7d92e8c6e89aace65d539364ad", "site_section": "http://feeds.guardian.co.uk/theguardian/politics/rss", "section_title": "Politics | The Guardian", "url": "http://www.theguardian.com/politics/2015/oct/08/frankie-boyles-conference-roundup-haunted-tennis-ball-slytherin-chancellor-politics", "country": "US", "title": "Frankie Boyle’s conference roundup: Labour’s haunted tennis ball and the Slytherin chancellor | Politics", "performance_score": 10, "site": "theguardian.com", "participants_count": 40, "title_full": "Frankie Boyle’s conference roundup: Labour’s haunted tennis ball and the Slytherin chancellor | Politics | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 50, "uuid": "0d23ecc8c2a20dac95b0aba9d139a89406f43702"}, "author": "Frankie Boyle", "url": "http://www.theguardian.com/politics/2015/oct/08/frankie-boyles-conference-roundup-haunted-tennis-ball-slytherin-chancellor-politics#post-0", "ord_in_thread": 0, "title": "Frankie Boyle’s conference roundup: Labour’s haunted tennis ball and the Slytherin chancellor | Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A fter the second world war, Melanesian islanders formed cargo cults near abandoned airfields. They thought that if they carried out the rituals they had observed the troops performing at the American air force bases, planes would land. So they would march up and down in improvised uniforms performing parade ground drills with wooden rifles, believing that if the rites were performed correctly the planes would return and bring them cargo. I only mention this as a useful point of comparison for the Liberal Democrat conference . An isolated tribe going through the formal motions of something they think will bring votes, failing to understand that their actions are meaningless and vestigial. In fact, it’s more like the tribe had recently been allowed to fly a plane and had smashed it right into a mountain and nobody was ever going to let them anywhere near a plane again until the world was over.\nLabour’s conference featured quite an impressive run-up by Jeremy Corbyn, tackling TV interviewers like a soothing GP talking to a hypochondriac. There was remarkably little infighting at the conference, as happens when a party realises it needs to put divisions aside and show solidarity to become electable, or, indeed, when two separate halves of a party loathe each other so much that they have to go to different sets of meetings.\nCorbyn took to the stage with his head like a haunted tennis ball, and the general air of a pigeon that had inherited a suit. His speech lasted 59 minutes, one minute for every Labour MP who would like to see him fed into a sausage machine. The new Labour leader insisted, “Leadership is about listening.” If leadership is about listening, the great political speeches would have been a little different. Churchill saying, “Can you tell me what you’d like to do on the beaches?” Or Martin Luther King, surrounded by civil right activists at the Lincoln Memorial: “Did everyone hear that? He said a dog came into his bedroom but it had the head of his dead mother … it sang the Camptown Races and then all his teeth fell out. That’s a great one. OK, hands up who’s got another dream?”\nMany in the party think Corbyn won’t last the full term, especially if we have a couple of cold winters. Actually, I have high hopes for him and his deputy Tom Watson, who could be mistaken, in a low light, for a chest of drawers with a telly on top. Perhaps their contrasting styles will complement each other. Corbyn looks like he will be killed by a mole from the secret services, Watson by a roll from the motorway services. Corbyn even came to the rescue of a speaker at the conference when her wheelchair became stuck while on stage. If it had been the Tories, she would have been removed by Iain Duncan Smith side-kicking her into the orchestra pit.\nFacebook Twitter Pinterest Tom Watson: a chest of drawers with a telly on top. Photograph: Leon Neal/AFP/Getty Images \nCorbyn has had trouble persuading his MPs that nuclear weapons are bad. Then again, he hasn’t had much success persuading his MPs that Tories are bad. There seems to be a real split on Trident in the party between extreme elements who don’t think we should recommission it, and more moderate voices who want to retain the ability to heat hundreds of thousands of people’s skeletons to the surface temperature of the planet Mercury, in case 1970s Russia tries to attack us through some kind of Stargate .\nLen McCluskey announced that the union Unite would block plans to scrap Trident in an attempt to protect jobs. It’s a tough call, jobs over a potential nuclear holocaust. But perhaps McCluskey is right; if there is an accident, there will be jobs aplenty. Full employment for the six people left in the UK. And they’ll be happy to pay their Unite dues when they find out they have got a job for life (which may only be for less than a week) as they become their own farmer, cook, builder, doctor. All, of course, taking second fiddle to their main career of collecting their own teeth and keeping them safe inside the skull of a labrador.\nSome accused shadow chancellor John McDonnell of attacking British business by suggesting that he would “chase down” companies suspected of tax evasion. Which is a bit like screaming “police brutality” when a traffic light turns red. He told Scots who voted for the SNP that, “Now is the time to come home.” He clearly hasn’t got the measure of the Scots, as a similar text message from his own wife, “7cm dilated”, wouldn’t get your average Scotsman out of the pub.\nFacebook Twitter Pinterest Jeremy Corbyn: can he survive a couple of cold winters? Photograph: Mark Thomas/Rex Shutterstock \nThe press headlines fear that Labour plans to hammer the middle classes. I think they’re too late. The middle classes are completely hammered already, and are the perfect group to go after as they are the least likely to notice. Most of them don’t plan on sobering up until the youngest has gone to university and they have plucked up enough courage to ask for a divorce. Until then, the sun will always be over the yardarm, the days a hungover blur, the evenings like a free bar at a tramp’s funeral, and the bank statements all shredded unopened.\nThere are obviously huge differences between Ed Miliband and Jeremy Corbyn , and it’s refreshing to see a leader mess up some of his speech not because he’s a freakshow, but because he simply doesn’t care. As I watched the standard conference procedure of people applauding things they would fast forward on YouTube, it occurred to me that this conference may have accidentally stumbled upon the one message that might reassure British voters: that you can have enormous change without puncturing the boredom.\nThe Conservatives held theirs in Manchester. For the prostitution industry, this is the equivalent of being selected to host the Commonwealth Games. There was a ring of steel around the conference. Ironically, it’s the last steel the north will be seeing for a very long time. Tory conference seemed to be all about saying how much you believe in British values, then immediately contradicting yourself: “This country has always welcomed migrants … but we’re full up.”\n\n\n\nSorry, your browser is unable to play this video. Facebook Twitter Pinterest Jeremy Corbyn to the rescue \nThe first big hitter to take the stage was George Osborne , a man who is not afraid to bark at his hairdresser, “Demented syphilitic emperor!” and his tailor, “Prom night at Slytherin!” The best part of Osborne’s speech was the eerie six seconds of complete silence after the applause had ended but before he started to talk; presumably the demons who speak through him were arguing about who got to go first. For his ambitions as leader, it was a mistake to start with the election: it seemed to stir a dim memory in the gathering that this was someone who during elections is usually nailed into a coffin and thrown on to an Arctic exploration vessel.\n\n\n\nSorry, your browser is unable to play this video. Facebook Twitter Pinterest George Osborne: heir to the Tory throne? \nOsborne insisted that the Conservatives are the “party of labour”, to a television audience largely consisting of the unemployed. Osborne wants to “fix the roof while the sun is shining”. It’s like he has never even visited Britain. When the sun shines in Britain, that’s when we stop working. When the sun is shining in Britain, no one is fixing a roof, they are in a beer garden drinking 10 pints of cider, the roof the least of their worries as they are no longer able to find their own house. Why hasn’t Osborne joined the accusations that Jeremy Corbyn is a neo-communist threat to national security? Possibly he has been too busy trying to get the Chinese to build our nuclear reactors. I’m not judging his plan to cut tax credits; the cleanup required after next summer’s riots might actually be a Keynsian master stroke. Overall, he drew a lukewarm response that highlighted the fine line between a standing ovation and wanting to be first to the bar.\nOf course, it’s absurd that we trust the Tories with our day-to-day reality, as so many of them don’t really inhabit it. Why elect people to run our schools and hospitals who choose not to go to those schools and hospitals? I certainly don’t trust them on public transport. Many have a subliminal loathing of buses based on suppressed memories of boarding school. One cry of “room for a few more on top” and they’re right back in the dorm, the randiest future captain-of-industry thwarting their desperate escape with a well-thrown handful of marbles. Admittedly, the Tories will never let the rail system completely disintegrate. As, in a few years, they’ll need it to get benefit claimants into their camps.\nFacebook Twitter Pinterest Theresa May: a help to the vulnerable? Photograph: Phil Noble/Reuters \nAdmittedly, the Conservatives are generally more persuasive orators than their Labour counterparts, perhaps a skill developed by spending school holidays trying to lure father out from behind his Daily Telegraph. Jeremy Hunt said that he wants Britain’s workers to work harder, like the Chinese. Hunt’s wife is Chinese, and is often heard muttering, “Christ, this is hard work.” Then came Theresa May, a woman who exudes all the compassion of stage 4 bone cancer, talking of her party’s “proud history” of helping vulnerable people. They have never helped vulnerable people and they are very proud of that.\nThe whole sorry season finished with David Cameron , of all people, giving a speech about equality. A speech blatantly at right angles to everything he has ever said or done. A speech where he yelled that London is the greatest city in the world, in the middle of Manchester. Cameron said: “There are parts of Britain today where you can get by without ever speaking English.” Yes, Newcastle. He said the Tories were the party that, “doesn’t care where you come from, but only where you’re going”. Which basically sums up Theresa May’s immigration policy.\nIt was a speech he could give because he knows it simply doesn’t matter. TTIP will come in soon and all of this will be rendered symbolic. Our new rulers will be corporations. Looking down at Britain from business class, all the party conferences – and the protests marching up and down outside them – will look like little cargo cults. We will be allowed to keep our political rituals because they have an entertainment value, and because somebody needs to give speeches and answer questions. That’s not something our new rulers will be doing. They will be glimpsed only occasionally, stepping briskly into waiting cars. Our elected officials will soon fill a function much like the one the media fills now, as mere agents of a greater power. With no other role to play, our politicians will continue doing what they know: waving to the cameras, forcing a smile, hoping to keep us paying attention to their strange, dull ceremonies.", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:22:29.744+03:00", "highlightTitle": ""}