{"organizations": [], "uuid": "5f5555f8b413fe6d54306bc7488cef1b9d40ddd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "europe.newsweek.com", "main_image": "http://d.europe.newsweek.com/en/full/12681/netanyahu-eu-boycott.jpg", "site_section": "http://europe.newsweek.com/politics", "section_title": "Politics", "url": "http://europe.newsweek.com/benjamin-netanyahu-suggests-former-palestinian-leader-blame-holocaust-335160", "country": "US", "title": "Benjamin Netanyahu Suggests Former Palestinian Leader to Blame for Holocaust", "performance_score": 1, "site": "newsweek.com", "participants_count": 1, "title_full": "Benjamin Netanyahu Suggests Former Palestinian Leader to Blame for Holocaust", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:48:00.000+03:00", "replies_count": 0, "uuid": "5f5555f8b413fe6d54306bc7488cef1b9d40ddd2"}, "author": "Jack Moore", "url": "http://europe.newsweek.com/benjamin-netanyahu-suggests-former-palestinian-leader-blame-holocaust-335160", "ord_in_thread": 0, "title": "Benjamin Netanyahu Suggests Former Palestinian Leader to Blame for Holocaust", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Israel's Prime Minister Benjamin Netanyahu blamed a former Palestinian leader for the Nazis' extermination of millions of Jews in a speech to the World Zionist Congress in Jerusalem on Tuesday.\nNetanyahu said that the Grand Mufti of Jerusalem Haj Amin al-Husseini convinced Adolf Hitler to kill the Jews rather than expel them. Netanyahu said that Hitler had originally planned simply to transport Jews out of the country before al-Husseini suggested slaughtering them.\nNetanyahu said that al-Husseini, a Muslim leader who died in 1974, and Hitler met in November 1941, when Palestine was under British Mandatory rule.\n\"Hitler didn't want to exterminate the Jews at the time, he wanted to expel the Jews,\" Netanyahu said in his speech. \"And Haj Amin al-Husseini went to Hitler and said, 'If you expel them, they'll all come here [to Palestine.]' Netanyahu said that Hitler then asked: \"What should I do with them?\" to which the Mufti allegedly replied: \"Burn them.\"\nHe also blamed al-Husseini for attacks on the Jewish community in Jaffa in 1920, and in other locations in what is now modern-day Israel in 1921 and 1929.\nThe Israeli leader has made similarly provocative statements in the past. In a speech to the Israeli parliament in 2012 , Netanyahu said that al-Husseini was \"one of the leading architects\" of the final solution, the Nazis' plan to exterminate the Jewish population of Europe.\nSaeb Erekat, Secretary General of the Palestine Liberation Organization, in a statement released to Newsweek , says: \"Netanyahu hates Palestinians so much that he is willing to absolve Hitler of the murder of six million Jews.\"\nErekat adds in the statement: \"Mr. Netanyahu blamed the Palestinians for the Holocaust and completely absolved Adolf Hitler's heinous and reprehensible genocide of the Jewish people. On behalf of the thousands of Palestinians that fought alongside the Allied Troops in defense of international justice, the State of Palestine denounces these morally indefensible and inflammatory statements.\n\"Palestinian efforts against the Nazi regime are a deep-rooted part of our history,\" the statement continues. \"Palestine will never forget—though it seems Netanyahu's extremist government has. Netanyahu should stop using this human tragedy to score points for his political end.\"\nA number of historians not focused primarily on Holocaust research have suggested that Husseini may have been the figure to have started the extermination of Europe's Jews but this notion has been rejected by the majority of mainstream scholars, according to Israeli daily newspaper Haaretz .\nRelated Hummus Restaurant Offers 50 Percent Discount for Jews and Arabs Eating Together At a time when tensions are high, one restaurant owner's gesture is intended to show that Arabs and... Ban Ki-Moon Travels to Middle East to Calm Israeli-Palestinian Tensions The U.N. leader is to meet with Mahmoud Abbas and Benjamin Netanyahu amid wave of violence. Israeli Energy Minister Compares Abbas 'Incitement' to Nazi Era Israeli Energy Minister Yuval Steinitz calls Abbas the \"number one inciter\" against Jews.", "external_links": ["http://www.haaretz.com/israel-news/.premium-1.681525", "http://mfa.gov.il/MFA/PressRoom/2012/Pages/PM_Netanyahu_Knesset_session_Holocaust_24-Jan-2012.aspx"], "published": "2015-10-21T17:48:00.000+03:00", "crawled": "2015-10-21T16:48:53.612+03:00", "highlightTitle": ""}