{"organizations": [], "uuid": "a9d5bdd540ddd5ad6354a998aa0e971a4b02a6c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "usconservatives.about.com", "main_image": "http://f.tqn.com/y/usconservatives/1/S/X/G/-/-/prison---getty-images.jpg", "site_section": "http://z.about.com/6/o/m/usconservatives_t2.xml", "section_title": "About.com Conservative Politics: What's Hot Now", "url": "http://usconservatives.about.com/od/foreignpolicy/fl/Torture-is-Wrong-Except-When-it-Isnt.htm", "country": "US", "title": "Torture is Wrong, Except When it Isn't", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Torture is Wrong, Except When it Isn't", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T14:16:00.000+03:00", "replies_count": 0, "uuid": "a9d5bdd540ddd5ad6354a998aa0e971a4b02a6c7"}, "author": "", "url": "http://usconservatives.about.com/od/foreignpolicy/fl/Torture-is-Wrong-Except-When-it-Isnt.htm", "ord_in_thread": 0, "title": "Torture is Wrong, Except When it Isn't", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dustin Hawkins"], "text": "Torture is Wrong, Except When it Isn't Getty Images By Dustin Hawkins \nWith Democratic control of the US Senate coming to an end, the partisan body released a new torture report - a rehash of policies long abandoned by the Obama administration and a final shot at the Bush administration, 6 years removed. With both chambers of congress lost, it was one last jab from the soon-to-be-forgotten Democratic majority. The details were gruesome, as would be expected of a torture report, and perhaps mostly as an attempt to make Americans feel more guilty about their ambivalence towards torture. \nSo, torture is wrong, they tell us. And it's hard to disagree. Except when it isn't so hard to disagree. Usually, it's quite easy to see why it might be necessary when really bad people caught in really bad places have done really bad things to innocent people, and want to do more bad thing to innocent people. For believeing this, of course, we will be called \"stupid.\" Dumb American, we are, convinced that torture is okay because it pops up on shows I don't watch . There are many versions of this argument. I regret misplacing one that argued that Democrats shouldn't so quickly dismiss torture because most Americans remain ambivalent, blinded by our stupidity, thanks to shows like '24' that make us believe torture works when they know it never, ever does. \nWhich is, of course, their main argument: Torture Doesn't Work . Rather than debate whether or not torture should be allowed, the anti-torturers simply declare that torture doesn't work. The science is settled. This argument makes it unnecessary to debate if something heinous should be allowed to happen to bad people if it stops something heinous happening to good people. It's much harder to argue against torture if you agree it can work, and it may be impossible. Partisan politicians claim, categorically, it doesn't work. Many with direct and firsthand knowledge have claimed otherwise, that sometimes it worked and sometimes it didn't. I'd also argue that if it didn't work, the practice would have ended rather quickly. \nHomicide is wrong, too. Except when it isn't. This is why there exist various distinctions of murder, including \"justifiable homicide.\" And now we've replaced \"unjustifiable torture\" with a homicidal drone-program. Apparently death-by-drone is an American value, unlike torture. Because we've only replaced the latter with the former, and we are wiping out any possible intelligence along with it. I'm also guessing that not all victims of dronings die as intended. Is taking the limbs of a suspected terrorist from afar perfectly okay, an act less torture-some than water-boarding? Is that an American value, while torture is not? When we unavoidably and regrettably see \" errant drone strikes \" that kill non-terrorists and hit wedding parties, is that an American value when torture is not? Is it possible to be unequivocally opposed to the former and completely silent or outright supportive of the latter? (I'm mostly supportive of both, but also view the action that is no longer okay as being slightly more desirable and less deathly than the one that is. But what do I know, I only watch Jack Bauer on television.) \nLife isn't easy and decisions of life and death aren't always easy either. Torture is inhumane and disturbing and stomach-churning. It's wrong, except when it isn't. And if torture prevents planes from flying into buildings or discovering the location of terrorist masterminds, it's difficult to be against it. S they just exclaim: Torture Doesn't Work! And we have the partisan, cherry-picked evidence to prove it! But we can guess it often works. To argue otherwise is to suggest that the many hostages who have been forced to do the propagandist work of the terrorists did so willingly. We'd have to believe that hostages would denounce America and call her a terrorist nation not under duress, but with sincerity and without, um, \"persuasion.\" And I guess it's possible that numerous hostages willingly \"converted to Islam\" while in captivity. But probably not. \nThe Curious \"Time-bomb\" Exception for Something That Allegedly Doesn't Work \nMany strong opponents of torture also like to have a really rare and specific exception. Hillary Clinton once argued that \"In the event we were ever confronted with having to interrogate a detainee with knowledge of an imminent threat to millions of Americans, then the decision to depart from standard international practices must be made by the president.\" And John McCain \" has conceded that in some hypothetical nuclear ticking-time-bomb scenario, torture might be a necessary evil.\" Tom Head lays out the argument : \nThe September 11 attacks brought the torture debate into sharp relief, both because of the Bush administration's counterterrorism policies and because it revealed the United States' vulnerability to terrorist attacks. One argument often used to defend torture describes a fictional scenario in which a massive weapon is set to go off, a prisoner in custody is known to have information on the attack that he refuses to give, and U.S. forces are faced with the question of whether to torture the prisoner or allowing untold millions to die... \nCertainly if millions of lives are at stake, the prisoner in question could be and would be tortured. It would not matter whether or not the practice of torture is illegal, because those doing the torturing would almost certainly be either pardoned or acquitted by jury nullification. \nAsk any sane anti-torture absolutist what he would do if he caught the person who had just buried his family alive, was the only person who knew where they were, and his family had less than an hour of oxygen before facing death. Plenty of people ignore the question altogether, but most drop the \"ticking time-bob\" scenario. But in such case there are two major problems with the anti-torturers tortured answers: They just admitted torture is sometimes okay, now they are just negotiating over when it is and when it isn't. They are admitting they actually believe torture can work. If torture never works, as they insist, how could it work in a ticking time-bomb scenario? If anything, it's far less likely to work in such a case as the terrorist/criminal/etc. only has to wait out the torture for a short period of time, rather than the long periods of time used to break people down. So not only would torture have to be effective, it would now be effective in record fast time. \nSo yes, torture is wrong. Except when it isn't. Related Articles", "external_links": [], "published": "2015-10-04T14:16:00.000+03:00", "crawled": "2015-10-04T17:16:17.372+03:00", "highlightTitle": ""}