{"organizations": [], "uuid": "ce3cfa56d7a383256f73873985b9c1af48368781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30307334/mining-association-of-canada-congratulates-prime-minister-elect-justin-trudeau", "country": "US", "title": "Mining Association of Canada congratulates Prime Minister-elect Justin Trudeau", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Mining Association of Canada congratulates Prime Minister-elect Justin Trudeau - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "ce3cfa56d7a383256f73873985b9c1af48368781"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30307334/mining-association-of-canada-congratulates-prime-minister-elect-justin-trudeau", "ord_in_thread": 0, "title": "Mining Association of Canada congratulates Prime Minister-elect Justin Trudeau", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Mining Association of Canada (MAC)\nOTTAWA , Oct. 20, 2015 /CNW/ - The Mining Association of Canada (MAC) congratulates Prime Minister-elect Justin Trudeau and the Liberal Party of Canada on their election victory, and looks forward to working with the new government to maintain and grow responsible mining development in Canada .\n\"We congratulate Prime Minister-elect Trudeau and all newly-elected Members of Parliament following yesterday's federal election,\" said Pierre Gratton , MAC's President and CEO. \"We welcome the opportunities the new government will bring to ensure that the mining industry continues to benefit communities across the country, meet expectations of Canadians with respect to the environment and social performance, and maintain its role as a key contributor to Canada's economy, both domestically and internationally.\"\nThe Liberal platform includes policies and commitments of significant interest to the Canadian mining industry. These include investments in innovation, infrastructure, and education and skills training, notably for Aboriginal Canadians, a key partner of Canada's mining sector. The new government also committed to reviewing the regulatory regime for resource projects. Federal government oversight of the mining sector is robust, unchanged by recent federal reforms, and opportunities exist to improve efficiencies and federal-provincial coordination.\n\"We were pleased to see that the Liberal Party has recognized the importance of responsible development of our natural resources to Canada's current and future prosperity. We are committed to working collaboratively with government, Aboriginal communities and other stakeholders on any new policies relevant to our sector.\"\nMAC and its members would like to thank all outgoing MPs for their support for the Canadian mining industry over the years.\nAbout MAC\nThe Mining Association of Canada is the national organization for the Canadian mining industry. Its members account for most of Canada's production of base and precious metals, uranium, diamonds, metallurgical coal, mined oil sands and industrial minerals and are actively engaged in mineral exploration, mining, smelting, refining and semi-fabrication. Please visit www.mining.ca .\n ", "external_links": ["http://www.mining.ca/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=C4039&Transmission_Id=201510201217CANADANWWEB______C4039&DateId=20151020"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T00:11:45.226+03:00", "highlightTitle": ""}