{"organizations": [], "uuid": "beb378d757ade597d97f4b415fb8653609c769e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30305527/nielsen-and-katz-radio-group-sign-agreement-for-nielsens-voter-ratings", "country": "US", "title": "Nielsen And Katz Radio Group Sign Agreement For Nielsen's Voter Ratings", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Nielsen And Katz Radio Group Sign Agreement For Nielsen's Voter Ratings - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "beb378d757ade597d97f4b415fb8653609c769e7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30305527/nielsen-and-katz-radio-group-sign-agreement-for-nielsens-voter-ratings", "ord_in_thread": 0, "title": "Nielsen And Katz Radio Group Sign Agreement For Nielsen's Voter Ratings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Nielsen\nNew Nielsen Service Helps Local Radio Deliver for Political Campaigns by Matching Voting Behavior With Radio Listening\nNEW YORK , Oct. 20, 2015 /PRNewswire/ -- Nielsen (NYSE: NLSN) announced today that Katz Radio Group, the largest radio representation company in America, has signed an agreement to license Nielsen's Voter Ratings service for all 48 radio Portable People Meter (PPM) markets. Nielsen's Voter Ratings service will provide Katz with deeper understanding of how radio reaches voters with specific political views while strengthening its commercial inventory to political campaigns.\nThe service combines Nielsen Audio's PPM data with key voter categories. These new insights, broken out by political views among Democrats, Republicans, independents and unregistered adults, will help Katz sell stations' ability to deliver voters to political campaigns more effectively, gaining more political ad dollars. Nielsen provides political ratings in the top 48 audio metros and the top 56 television designated market areas (DMAs) with reporting at the station and daypart levels.\n\"Radio's ability to meaningfully connect with the American electorate has been under-leveraged in the political advertising sector,\" said Stacey Lynn Schulman , executive vice president of strategy and analytics at Katz Media Group. \"Layering our listeners' passions with Nielsen's advanced political targeting provides candidates with an exciting new opportunity to engage voters in 2016.\"\nPierre Bouvard , chief marketing officer at Cumulus | Westwood One commented, \"Recently during Advertising Week, Jim Stengel , the former CEO of Procter & Gamble, said: 'Marketing in the modern world simply will not work without data.' Today, Katz and the American radio industry boldly launch a powerful data-driven voter-targeting platform. Adults 25-54 is not a demographic, it's a family reunion. These 10 political segments, based on actual voter behavior, are far more precise than broad age and sex demographics. Campaigns can now find their voter targets on the right radio format, station and dayparts.\"\n\"Political data and insights are critical in demonstrating radio's capabilities to help the industry gain its share of campaign ad dollars,\" said Radha Subramanyam , iHeartMedia's president of insights, research and data analytics. \"Nielsen data is also one of the key elements powering the iHeartMedia 'AuDiO' optimization tool, which launched last year and enables us to precisely target key voter segments nationwide.\"\n\"All politics are local and this election season everyone is looking to maximize their political ad dollars by reaching the right voters at the right time,\" said Matt O'Grady , executive vice president and managing director for local media at Nielsen. \"Using Nielsen's Voter Ratings solution, our clients can more effectively sell their stations by providing a comprehensive and precise view of which key voters segments are listening.\"\nABOUT NIELSEN\nNielsen Holdings plc (NYSE: NLSN) is a global performance management company that provides a comprehensive understanding of what consumers watch and buy. Nielsen's Watch segment provides media and advertising clients with Total Audience measurement services for all devices on which content-video, audio and text-is consumed. The Buy segment offers consumer packaged goods manufacturers and retailers the industry's only global view of retail performance measurement. By integrating information from its Watch and Buy segments and other data sources, Nielsen also provides its clients with analytics that help improve performance. Nielsen, an S&P 500 company, has operations in over 100 countries, covering more than 90% of the world's population. For more information, visit www.nielsen.com .\nABOUT KATZ RADIO GROUP\nKatz Radio Group, representing over 3,000 radio stations and their digital platforms, is the largest audio aggregator in the country and the leader in the industry. Katz Radio Group connects advertisers to consumers in every market to fulfill their business objectives, creating complete custom integrated audio solutions. Advertisers' messages are easily delivered anytime, anywhere, any way to any target through the largest, and most intimate and effective, reach medium-Radio, with over 240 million weekly listeners. Katz Radio Group, a subsidiary of iHeartMedia, is headquartered in New York City with 14 offices across the country.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/nielsen-and-katz-radio-group-sign-agreement-for-nielsens-voter-ratings-300162859.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/nielsen-and-katz-radio-group-sign-agreement-for-nielsens-voter-ratings-300162859.html", "http://www.nielsen.com/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY33160&Transmission_Id=201510201005PR_NEWS_USPR_____NY33160&DateId=20151020"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T18:17:26.058+03:00", "highlightTitle": ""}