{"organizations": [], "uuid": "8eb00c55bcfb641958b6d339ec72c47d24c26d47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "", "site_section": "http://bostonherald.com/news_opinion/us_politics", "section_title": "News &amp; Opinion: U.S. Politics | Boston Herald", "url": "http://bostonherald.com/news_opinion/us_politics/2015/10/pentagon_admits_mistaken_forced_entry_at_afghanistan_clinic", "country": "US", "title": "Pentagon admits mistaken forced entry at Afghanistan clinic", "performance_score": 0, "site": "bostonherald.com", "participants_count": 1, "title_full": "Pentagon admits mistaken forced entry at Afghanistan clinic | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "8eb00c55bcfb641958b6d339ec72c47d24c26d47"}, "author": "Associated Press", "url": "http://bostonherald.com/news_opinion/us_politics/2015/10/pentagon_admits_mistaken_forced_entry_at_afghanistan_clinic", "ord_in_thread": 0, "title": "Pentagon admits mistaken forced entry at Afghanistan clinic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON — The U.S. military acknowledged Monday that an armored vehicle carrying U.S. personnel deliberately crashed through the closed gate of the compound in northern Afghanistan where 22 people had been killed two weeks ago in a U.S. air attack on a hospital run by Doctors Without Border.\nNavy Capt. Jeff Davis, a Pentagon spokesman, said the Afghan armored vehicle with U.S. personnel inside drove through the gate last Thursday to gain access to the compound, believing incorrectly that no Doctors Without Borders personnel were present.\nDavis said the visit was to assess the \"structural integrity\" of the building damaged in the Oct. 3 attack by a U.S. Air Force AC-130 gunship. The visit last week was part of a process to determine whether to pay a damage claim, he said.\n\"They forced the gate open,\" Davis said. \"They drove into it with their vehicle.\"\n\"They did it. They shouldn't have,\" Davis added. \"They should have coordinated ahead of time, and they're going to make it right and make sure that that gate is repaired.\"\nThe spokesman said Doctors Without Borders personnel were present at the time and \"were understandably not happy that we had broken in.\"\nIn explaining the rationale for driving through the closed gate, Davis said that on a previous visit to the compound, after the Oct. 3 attack, there had been \"active combat in the area — shelling and shooting,\" and so this time, \"in the interest of safety\" they did not stop to open the gate, believing no Doctors Without Borders personnel were there.\nThe incident violated an agreement with investigators that Doctors Without Borders would be given advance notice of such visits.\n\"Their unannounced and forced entry damaged property, destroyed potential evidence and caused stress and fear,\" the charity group said in a statement last week.\nDavis also said that by midweek a \"casualty assessment team\" report on the Oct. 3 attack is likely to be released in Kabul. He said it is intended to answer only the narrow question of whether there were civilian casualties and, if so, whether they were caused by the U.S. air attack. He said this report would not examine details such as who is to blame for what the U.S. military has called a mistaken attack on the hospital. Details like that are to be determined by a separate, in-depth U.S. investigation, a preliminary form of which could be released in a couple of weeks, Davis said.\nThe strike on the trauma hospital in the northern city of Kunduz killed 10 patients and 12 staff. Another two staffers are now presumed dead, the charity group said.\nPresident Barack Obama apologized for the deadly attack, which happened as Afghan forces battled Taliban insurgents who had stormed Kunduz on Sept. 28 and briefly held the city of 300,000, the first provincial capital they have overrun since being forced from power in late 2001.\nDavis said Monday that the city is now largely back in the Afghan government's control.", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T00:15:11.136+03:00", "highlightTitle": ""}