{"organizations": [], "uuid": "3930823bb6319072fc488828ae074da01ca5d151", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30278976/maple-leaf-advancing-comprehensive-sustainability-strategy", "country": "US", "title": "Maple Leaf Advancing Comprehensive Sustainability Strategy", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Maple Leaf Advancing Comprehensive Sustainability Strategy - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "3930823bb6319072fc488828ae074da01ca5d151"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30278976/maple-leaf-advancing-comprehensive-sustainability-strategy", "ord_in_thread": 0, "title": "Maple Leaf Advancing Comprehensive Sustainability Strategy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Maple Leaf Foods Inc.\nANNOUNCES PRIORITIES, WEBSITE AND REPORT ON WORLD FOOD DAY\nTORONTO , Oct. 16, 2015 /PRNewswire/ - Maple Leaf Foods today launched its comprehensive sustainability strategy and progress report, following over a year of stakeholder engagement and strategic planning. Supporting this core area of organizational focus is a new sustainability reporting website, Feeding the Country, Responsibly, and the Company's 2014/15 Sustainability Report, which highlight the Company's sustainability priorities, goals and recent progress and achievements, and provide related detailed descriptions of the Company's operations.\n\"The enormous challenge our world faces is the urgent need to sustainably feed an estimated two billion more people by 2050,\" said Michael, President and CEO, Maple Leaf Foods. \"We are setting high standards for ourselves in areas where Maple Leaf can have the greatest impact, including animal care, nutrition, environmental impact and food security. Sustainability is a profound opportunity to create shared value by addressing critical issues that also deliver commercial opportunities. The issues are daunting, but as Canada's largest protein company, we want to be at the leading edge of change.\"\nMaple Leaf's sustainability framework has four priorities, which are advanced through a number of initiatives:\nAdvance Nutrition and Health: providing consumers with nutritious, sustainable and affordable food, made with simpler, natural ingredients Value our People and Communities: advancing holistic approaches to food insecurity, which affects 1 in 6 Canadian children and 1 in 8 households Treat Animals Well: dedicating the organizational focus and resources required to become a leader in animal care Eliminate Waste: reducing Maple Leaf's environmental footprint by 50% in ten years, focusing on emissions, water and waste reduction\nHighlights of the Feeding the Country, Responsibly website:\nSodium Reduction: Increasing our product offerings that meet Health Canada's 2016 voluntary guidelines Antibiotic Use: Facts about antibiotic use in Maple Leaf's operations Open Sow Housing: Information and info graphics on our progress in transitioning sows from gestation crates to open housing Farm to Plate: An interactive value chain animation that describes Maple Leaf's supply chains\nFeeding the Country, Responsibly, can be viewed at www.mapleleafsustainability.com . A print report can be downloaded at www.mapleleafsustainability.com . The website is GRI 3.1 compliant and will be regularly updated with information on Maple Leaf's progress and new initiatives to reach its aggressive targets.\nMaple Leaf Foods Inc. is a leading Canadian consumer protein company, making high quality, innovative products under national brands including Maple Leaf®, Maple Leaf Prime®, Maple Leaf Natural Selections®, Schneiders®, Schneiders Country Naturals® and Mina™. The Company employs approximately 12,000 people across Canada and exports to global markets, including the U.S. and Asia . The Company is headquartered in Mississauga, Ontario and its shares trade on the Toronto Stock Exchange (MFI).\n ", "external_links": ["http://www.mapleleafsustainability.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=TO30596&Transmission_Id=201510161331PR_NEWS_USPR_____TO30596&DateId=20151016", "http://www.xmlnews.org/ns/"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-17T00:19:55.340+03:00", "highlightTitle": ""}