{"organizations": [], "uuid": "647f480d6720f96350d586d47671509e37a47fa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/India_Hindu_Festival__systems%40deccanmail_1.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151018/commentary-columnists/article/waiting-game-oh-calcutta", "country": "US", "title": "Waiting Game: Oh! Calcutta!", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Waiting Game: Oh! Calcutta!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T15:04:00.000+03:00", "replies_count": 0, "uuid": "647f480d6720f96350d586d47671509e37a47fa8"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151018/commentary-columnists/article/waiting-game-oh-calcutta", "ord_in_thread": 0, "title": "Waiting Game: Oh! Calcutta!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | Ashok Malik | October 18, 2015, 01.22 Devotees gather at a makeshift worship venue for Hindu goddess Durga in Kolkata. From the Pujas (the omnibus term for the four days of Durga Puja) to the Christmas-New Year week is the “season” in Calcutta (or Kolkata as it is now called). Reasonably, the period can be extended to late February. Shortly afterwards the weather tends to turn hot and humid. Packed into these four months are a flurry of human activity, much emotion and for the Calcutta diaspora, the tug of memory.\nThe Calcutta diaspora is not just a reference to those who lived and worked there. There are others who, in the city’s better days, had almost idiosyncratic associations with it. This writer knows of a foodie academic couple at Allahabad University who came to Calcutta in the mid-1970s for their honeymoon. For a week, they spent every lunch and every dinner at a different restaurant, sampling a different cuisine. In a sense, they too are part of the Calcutta story and members of its extended diaspora.\nCalcutta’s luck began to change in the 1970s. One could blame the Naxalite movement, the influx of East Pakistani refugees, or the coming to office of the Left Front, led by the Communist Party of India (Marxist). All of these played a role, no doubt, but frankly the problem was much larger. Calcutta had run its course. The renewal from an ageing industrial city to a post-industrial metropolis, with a focus on the services sector, for which Calcutta was a natural, just didn’t happen.\nFrom then on, Calcuttans began to move — one generation, then the next, then the one after that. It was ceaseless, and still is. A number of big names who left the city for education or employment can be thought up. Yet big names migrate all the time and anyway; that is why they are big names. The real loss came in the form of the unknown middle Calcuttan, the educated boy and girl, the box-wallah and the businessman, the engineer and the banker, and, as the economy declined, the artist and the nightclub crooner. They just felt compelled to go.\nThe “flight of capital” — the movement of corporate HQs from Calcutta to Delhi, Mumbai or even Bengaluru — was recorded and, in the early years, dismissed with a sort of perverse pride. The flight of intellectual capital — of proven or only potential human resource — went unsung, unheralded. It was a silent wave, sedulously moving out. As a phenomenon it took the life out of Calcutta, almost literally. By the 1980s and 1990s, the city was already being called the “world’s largest old people’s home”, filled with parents of children who were writing ad copy in Bengaluru, designing software in Silicon Valley, making music in Mumbai, moving funds for investment bankers in Hong Kong, manning the British National Health Service. They were anywhere but Calcutta, coming “home” only for the magical pujas or the buzz of the Christmas-New Year week, for that adda through the night, the iconic aarti at the pandal, or if they so wished, a day at the races.\nSo strong is the allure of remembrance and the intoxicant of a near mythical gilded age, that the Calcutta nostalgia industry has been booming. The Oh! Calcutta chain of restaurants is one example of course. There are other instances too: the Nizam-style kathi roll shop in New York, the Calcutta Chinese restaurant in Dubai, the list goes on … It is worth noting that these eateries promote Calcutta cuisine as opposed to merely Bengali food. It is a meaningful distinction: Calcutta was a global city incidentally located in Bengal; Kolkata is another story, another sensibility. Between those two names lies a whole universe.\nWhat was it about Calcutta that, at once, attracted and repelled, that made it such a fascinating and fantastic incubator of global ambitions and, yet, caused it to expel the very vehicles of this ambition, its best sons and daughters, who hated the idea of departure but knew they’d been left with no option? As a city, it valued education with a rare rigour — good middle-class Bengali values. Along with Bombay, it was the rare Indian city with a well-developed sense of leisure, encompassing both clubs and libraries. Its cultural horizons, again a remnant of Empire, were more expansive than most other Indian (or even Asian) cities, provoking a sense of inquiry, a thirst for knowledge, a voracious appetite for trivia.\nThe city began to be neglected when provincial politics undermined the importance of an industrial metropolis. For the CPI(M), the votes were in the heartland of Bengal, further north from the city. The city became an afterthought, the cash cow and revenue source, but otherwise a nuisance the people of which were to be shrugged off. This coincided with a romanticisation of rural life, which still persists in an India that otherwise talks of building a 100 new cities.\nCalcutta then was once a model; today it is a warning. It is a warning for the chief minister of Karnataka, who couldn’t care less for Bengaluru. It is a warning for the chief minister of Maharashtra, who seems to have little interest in reimagining Mumbai with any urgency. It is a warning for the chief minister of Haryana, who seems to have zero time for Gurgaon. The reference here is not merely to infrastructure — it is also to understanding an urban sensibility. These range from imposing cultural constructs to food restrictions, and each of the four cities in the previous paragraph has seen political nativists attempting these. We know what this did to Calcutta. Hopefully, in this spirited and spiritual Puja week, those who run the other cities will realise too.\nThe author is senior fellow, Observer Research Foundation. He can be reached at malikashok@gmail.com\n commentary Columnist Calcutta Also Read The madness of spy vs spy Clean up cricket now at least After rail fare hike, service hike needed Cabbages & Kings: London clubs and their colour bar", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151018/commentary-columnists/article/waiting-game-oh-calcutta", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/India_Hindu_Festival__systems%40deccanmail_1.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/India_Hindu_Festival__systems%40deccanmail_1.jpg", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-18T15:04:00.000+03:00", "crawled": "2015-10-18T04:36:32.393+03:00", "highlightTitle": ""}