{"organizations": [], "uuid": "a4c9c32673831871e4f65d3fcded20da0a0a5b9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcmiami.com", "main_image": "http://media.nbcmiami.com/images/1200*675/hospital+bed+generic_722_406.jpg", "site_section": "http://www.nbcmiami.com/news/politics/?rss=y&embedThumb=y&summary=y", "section_title": "NBC 6 South Florida - Miami Political News and South Florida Politics", "url": "http://www.nbcmiami.com/news/politics/Religious-Freedom-Florida-336897331.html", "country": "US", "title": "Bill Could Allow Doctors Not to Treat Women, LGBTQ Patients", "performance_score": 0, "site": "nbcmiami.com", "participants_count": 1, "title_full": "Bill Could Allow Doctors Not to Treat Women, LGBTQ Patients", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T21:50:00.000+02:00", "replies_count": 0, "uuid": "a4c9c32673831871e4f65d3fcded20da0a0a5b9c"}, "author": "ARI MONT", "url": "http://www.nbcmiami.com/news/politics/Religious-Freedom-Florida-336897331.html", "ord_in_thread": 0, "title": "Bill Could Allow Doctors Not to Treat Women, LGBTQ Patients", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Getty Images A newly introduced bill could create drastic changes to medical options for many Floridians. HB 401, a religious freedom protection bill, similar to the one that made headlines in Indiana earlier this year , would take the concept of refusing service on the basis of religion to a new level. First Church of Cannabis Approved After Passing of Ind.'s Religious Freedom Law The bill , filed Wednesday by Florida Rep. Julio Gonzalez (R - Venice) would allow \"a health care facility,\"\"an ambulatory surgery center, \"a nursing home,\"\"an assisted living facility,\" 'a hospice... that is owned or operated by a religious institution,\" or simply \"a health care provider\" to refuse to treat a patient or administer a medication if that procedure is contrary to the \"religious or moral convictions\" of the facility or health care provider. This means that any Florida health care provider could refuse to, say, provide birth control or perform an abortion on a woman. Apple's Tim Cook Blasts New Indiana Religious Freedom Law For LGBTQ patients, things look even bleaker. HB 401 could reasonably allow doctors to refuse any treatment to patients who live in violation of their beliefs, as long as that patient isn't in \"imminent danger of loss of life or serious bodily injury.\" The bill goes even further in its protections. Doctors will not only be able to refuse treatment to patients, they will also be shielded from liability from both lawsuits from patients and disciplinary action from their employer. Rep. Gonzalez, the bill's sponsor and a licensed Orthopedic surgeon, told HT Politics \"This is not about discriminating. This is about making sure the state stops, at a narrowly crafted level, from intruding into somebody's liberties.\" The bill has yet to find a sponsor in the Florida Senate. Published at 2:41 PM EDT on Oct 25, 2015 \nNews breaks at inconvenient times. Download one of the NBC6 mobile apps and have the news come to you. Watch live streaming newscasts, receive critical push notifications on the go and stay in touch with your city around the clock.", "external_links": [], "published": "2015-10-25T21:50:00.000+02:00", "crawled": "2015-10-26T09:45:38.303+02:00", "highlightTitle": ""}