{"organizations": [], "uuid": "ce3e86b885789e7e4ea9c10d315262ea3b8ed93e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-4b08fc0fda6737c9d802c50e862204b7.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/carter-russian-airstrikes-in-syria-counterproductive/article/2573134?custom_click=rss", "country": "US", "title": "Carter: Russian airstrikes in Syria 'counterproductive'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Carter: Russian airstrikes in Syria 'counterproductive' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:11:00.000+03:00", "replies_count": 0, "uuid": "ce3e86b885789e7e4ea9c10d315262ea3b8ed93e"}, "author": "Jacqueline Klimas", "url": "http://www.washingtonexaminer.com/carter-russian-airstrikes-in-syria-counterproductive/article/2573134?custom_click=rss", "ord_in_thread": 0, "title": "Carter: Russian airstrikes in Syria 'counterproductive'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russia's airstrikes in Syria are \"going to backfire\" and are \"counterproductive,\" Defense Secretary Ash Carter said on Wednesday, hours after news broke that the strikes had begun.\nCarter said a team of Defense Department officials will meet with Russian officials in the coming days to deconflict airspace as Russia strikes in support of Syrian President Bashar al-Assad.\nThe Russians launched the first airstrikes in Syria Wednesday morning, hitting areas around Homs in eastern Syria that are under Assad's control and don't contain any Islamic State fighters.\nAfter news broke on the Russian airstrikes, Carter spoke to press at the Pentagon in a previously unscheduled press conference Wednesday afternoon.\n  Poll: Scott Walker's slide in Wisconsin continues Wisconsin Gov. Scott Walker's slide in his home state continues, even after leaving the presidential race.\nBy Ryan Lovelace • 09/30/15 7:01 PM Carter first spoke with his Russian counterpart Sergey Shoygu in September. He said there are no future conversations planned between the two defense leaders, but that he doesn't \"rule out\" another conversation.\nRather than a conversation between the two leaders, Carter said the next step is to send a team from the Defense Department to meet with Russian officials \"over the next couple days\" to discuss deconfliction over Syrian airspace to keep U.S. personnel safe and ensure Russian strikes don't interfere with the U.S. counter-Islamic State mission.\nThis will allow the two countries to decide what kind of information should be shared, including if the U.S. should update Russia on where its planes are operating.\nThe Russian airstrikes reportedly killed more than 30 Syrian civilians, according to Institute for the Study of War research, though Carter said he could not confirm those reports. The area struck by the Russians is home to terrorist group al-Nusra, Islamic extremists Ahrar al-Sham and some groups backed by the West, the institute said.\nThe nearest Islamic State fighters are 55 kilometers, or about 34 miles away, from the airstrikes, the institute said.\nAlso from the Washington Examiner Clinton: Israelis 'always sound cocky' Clinto replied to an email thread by saying Israelis \"always sound cocky — in the air and on the ground.\"\nBy Ariel Cohen • 09/30/15 6:49 PM Despite Russia saying that it would strike the Islamic State and then hitting areas with only Syrian rebels, Carter said he is taking Russia at its word.\n\"They are exceptionally clear about what they're saying and their actions now seem to reflect what they said they were going to do,\" Carter said. \"My problem isn't that I don't understand what they're doing, I think my problem is that I think what they're doing is going to backfire and is counterproductive.\"\n ", "external_links": [], "published": "2015-09-30T19:11:00.000+03:00", "crawled": "2015-10-01T02:18:01.983+03:00", "highlightTitle": ""}