{"organizations": [], "uuid": "8d43d2cb3e94b7feb3022e7fc7d791b8fd346305", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://beforeitsnews.com/mediadrop/uploads/2015/41/92d0c8db8255878d08a5149634c5efc5b85f41e5.png", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-liberal/2015/10/why-do-catastrophically-failed-economists-keep-getting-recycled-by-establishment-politicians-2514596.html", "country": "US", "title": "Why Do Catastrophically Failed Economists Keep Getting Recycled By Establishment Politicians? | Opinion - Liberal", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Why Do Catastrophically Failed Economists Keep Getting Recycled By Establishment Politicians? | Opinion - Liberal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:12:00.000+03:00", "replies_count": 0, "uuid": "8d43d2cb3e94b7feb3022e7fc7d791b8fd346305"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-liberal/2015/10/why-do-catastrophically-failed-economists-keep-getting-recycled-by-establishment-politicians-2514596.html", "ord_in_thread": 0, "title": "Why Do Catastrophically Failed Economists Keep Getting Recycled By Establishment Politicians? | Opinion - Liberal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nI was happy for the U.K. last week when I read that the newly elected leader of the Labour Party, Jeremy Corbyn, had selected two of the world's most brilliant economists as advisers , Thomas Piketty and Joseph Stiglitz. Corbyn's comment to the media on his selections: “I was elected on a clear mandate to oppose austerity and to set out an economic strategy based on investment in skills, jobs and infrastructure. Our economy must deliver security for all, not just riches for a few.”\nHow different from that are the grotesquely failed economic advisers most of the U.S. presidential candidates are recycling, self-serving garbage like Glenn Hubbard , Robert Rubin, Lawrence Summers, Kevin Warsh, Tim Geithner, Alan Greenspan, Ben Bernanke (oh, this is convenient ), Arthur Laffer, Stephen Moore…?\nI have no doubt Jeb, Rubio, Trump and Fiorina would try to bring back Andrew Mellon, clueless Treasury secretary from 1921 to 1932 under Warren G. Harding and Calvin Coolidge, if they could. Cruz, on the other hand, might opt to resuscitate Roger Taney, who was Treasury Secretary– also the first nominee to any Cabinet position to be rejected by the Senate when his recess appointment failed– before becoming the worst Chief Justice of the Supreme Court in 1836.\nLet's start with an excerpt from NY Times economics columnist Jeff Madrick's book Seven Bad Ideas: How Mainstream Economists Have Damaged America and the World :\nEconomists were indeed set back on their heels by the financial crisis of 2008 and by the depth of the recession and the levels of unemployment that followed. Though not well implemented, the aggressive financial rescue efforts of the government in 2008 nevertheless kept matters from getting far worse that year. Were it not for the social programs started in the New Deal of the 1930s and expanded in the 1960s, including Social Security, unemployment insurance, and Medicare, and those adopted later, including the earned income tax credit and food stamps—the great embrace of government, not its denigration—the nation would likely have entered a full-fledged depression by 2009. For all the criticism, President Obama’s roughly $800 billion stimulus package of government spending and tax cuts was also a vital contributor to a softer landing for the economy in 2009. Non-laissez-faire economics saved the day.\n… In 2001, after the Clinton administration had left office, Lawrence Summers, a Harvard professor and Bill Clinton’s third Treasury secretary, endorsed this new faith in free markets and opposition to government intervention as a victory of new ideas. By contrast, in the 1930s John Maynard Keynes had advocated aggressive government spending—outright budget deficits—to stop recessions and support vigorous recoveries. “The political debates take place within a universe that is shaped by the development of new ideas,” Summers told an interviewer, attributing the change to good, fresh thinking, not merely the return of an old laissez-faire ideology in a more politically conservative time. “Of those new ideas, none is more important than the rediscovery of Adam Smith and the idea that a decentralized system relying on price signals collects information and provides much more insurance than any kind of centrally planned or directed type of system.” Summers, a onetime Keynesian, had for the moment changed his tune, and in this he represented economists generally.\nEconomists basically discarded Keynesian policy and relied on a narrow version of monetary policy: the manipulation of interest rates by the Federal Reserve, the nation’s central banking system. “We thought of monetary policy as having one target, inflation, and one instrument, the policy rate,” conceded Blanchard. “So long as inflation was stable, the output gap [the difference between potential and actual GDP] was likely to be small and stable and monetary policy did its job.” He noted that “old-style Keynesian stimulus,” by which he meant more government spending, was now “secondary.”\nDuring this period, Clinton, the first Democratic president since 1981, chose to act on the advice of Summers and Robert Rubin, his second Treasury secretary and a former head of Goldman Sachs, and pay down the nation’s debt before seriously raising public investment. The federal deficit was widely thought to deter growth, limiting the money available to private businesses to distribute the nation’s savings. In Clinton’s last year in office, the level of federal public investment as a proportion of GDP was lower than in Ronald Reagan’s last year in office, especially for physical infrastructure and education spending. It was also substantially lower for research and development. The policy was part and parcel of the laissez-faire revolution.\nHad economists been fully dedicated to their free-market views, they would also have been up in arms over the glaring lack of regulation of the new and deliberately opaque derivatives market on Wall Street. Based on securities that could be bought and traded with little down payment, these derivatives were at the heart of the financial crisis. If someone is selling a good or a security, competitors cannot offer it for less if they do not know the price asked. Yet the Clinton administration, following the new economic thinking, prevented regulators from setting federal standards of openness in this market.\nThe most damaging of the new financial derivatives were credit default swaps, a technical name for insurance sold by financial firms to protect investors against price declines of securities. The insurance to protect against losses on mortgage securities became especially popular as the housing boom progressed– particularly insurance for securities based on subprime mortgages. Because the prices of these insurance-like derivatives were traded secretly, however, there was not adequate competition to keep prices sensible. Economists should have rallied in opposition to the lack of rules, but I could find no research papers done on the phenomenon until it was too late. Some investors and professional traders bought the insurance at high prices, some sold at low prices. Moreover, there were no legal requirements to hold a reserve to ensure that someone selling insurance could pay off—as is done with traditional life and property insurance. When the value of mortgages collapsed as the housing bubble burst, those who sold such insurance– notably the insurance giant AIG– could not pay off, making the crisis far worse. Investors who thought they were protected against falling mortgage securities were now losing fortunes, forcing them to sell other securities to meet their liabilities. This drove the prices of other securities still lower, and market prices fell further in a vicious spiral.\nEconomists also said little when they should have proverbially shouted about the obvious conflicts between those who issued securities and the agencies they hired to rate the securities they sold. These agencies, Standard & Poor’s and Moody’s, were inclined to make their clients happy and gave their securities high ratings, even those based on subprime mortgages. Giving unjustifiably high ratings to the securities of clients who were paying for them seems, well, almost inevitable. After the collapse, the agencies sharply, and with at least temporary embarrassment, reduced their ratings for the large majority of securities they had previously given their highest ratings, the value of which had often fallen to zero.\n“Get the incentives right” had become a cliché for economic reform, especially in poorer developing nations. But financial incentives were awry on Wall Street. Traders were paid lavishly when they were correct but were not penalized commensurately when they were wrong, thereby incentivizing them to take risks. Much of the profits earned on trading the new derivatives were kept secret from buyers and sellers so that customers could not seek a better deal elsewhere. It was said that the very high compensation of bankers and traders reflected their unusual talents and that high profits for financial institutions meant they were contributing ever more to the nation’s prosperity. Economists were barely disturbed by such implausible nonsense. Meanwhile, by contrast, laws to set higher minimum wages, it was argued by many economists, would only distort labor markets and result in lost jobs.\nWall Street itself exhibited the characteristics of a monopoly. Commissions were fixed at abnormally high levels for most financial transactions, suggesting the lack of true competition. Fees earned by bankers on transactions were always high but did not fall as a percentage of the soaring value of financial assets, which under normal competitive conditions should likely have been the case. Blanchard, looking Quote: : “We thought of financial regulation as mostly outside the macroeconomic policy framework.” The silence of so many economists when even their most bedrock conservative principles were violated was disturbing. They had spoken up as a group before, sometimes vociferously, about the benefits of free trade, for example. Their current views on laissez-faire economics, including financial deregulation, were now markedly sympathetic to big business and Wall Street.\nIn the 1980s, 1990s, and 2000s, the prices of stocks, bonds, and housing rose to untenable levels on the watch of free-market economists who preached deregulation. During this period, over-speculation led to serious financial crises at home and abroad as free-market advocates successfully reduced controls on lending and investing around the world. A series of major financial crises affecting America began with a 1982 Mexican financing debacle involving U.S. banks and climaxed with the 2008 crisis. Mexico had borrowed significantly from U.S. banks in the 1970s and early 1980s, the careless banks essentially speculating on the future strength of the Mexican economy with loans to the government and for spurious industrial projects. With no guidelines from government or international institutions, the banks had recycled petrodollars through loans especially to Latin America; a favorite recipient was Mexico. When interest rates were pushed up sharply by Paul Volcker’s Federal Reserve in order to stanch U.S. inflation, interest rates on Mexican debt also rose sharply. At the same time, a resulting worldwide recession undercut Mexico’s oil exports. The nation declared that it could not pay its debts to American banks. The Fed and the International Monetary Fund, a world lending organization, helped bail out the banks.\nEnsuing financial crises were variations on this theme. The investors in equity incurred huge losses because of overly optimistic speculative investments that initially earned a lot of money and then went bad, but banks were often bailed out. Economies typically slid into recessions when inflation rose and the prices of these financial assets fell. The 1982 recession in the United States, for example, was the worst since the Great Depression– until the recession of 2008. Despite wide-eyed assertions by well-schooled economists that Americans were now enjoying the Great Moderation, the financial collapses and ensuing recessions had, as noted, cost Americans trillions of dollars in lost wealth and jobs, diminished investment, and failed companies. The U.S. housing crash that began in 2006, along with the accompanying collapse in stock prices, reduced the wealth of Americans by roughly $8 trillion by the time it hit bottom. This crash was also of course the result of overspeculation fueled by borrowing– homebuyers and investors in complex and hard-to-understand mortgage securities kept buying at ever-higher and less sensible prices. While average wealth rose again in the years after the crash, the money essentially went to the wealthy. Banks had been rescued, stock prices came back, and the well-off held the large majority of stocks; housing prices rebounded only partially. The high-technology stock plunge that occurred in the early 2000s resulted in comparable losses for most Americans. Most high-technology stocks did not recover. Many economists insisted such speculation was necessary to encourage risk taking.\n…The free-market economics that had been in vogue were now failing badly. The old remedy advocated by John Maynard Keynes to cure recession—federal spending that would lead to a temporary budget deficit– had been accepted momentarily but was again soon disdained by many. Since the inflationary 1970s, a federal budget deficit was increasingly seen as the culprit, even among Democratic economists, and this view has been hard to shake completely even after the major recession. The thinking was that a deficit often, even usually, created too much demand for goods and services, thus pushing up prices. It created more demand than the wages and profits the economy itself was generating, requiring borrowing to do so. Once slack was taken up, it was believed, a deficit resulted in an overheated economy. Keynesians typically argued with the new free-market orthodoxy over whether full employment had been reached and whether the capacity of the economy was fully utilized. It was said that the debt financing that pushed up interest rates also left less room for businesses to borrow.\nTo call economists overconfident during the modern laissez-faire experiment understates their hubris. The susceptibility of economists to new fashions in thinking, their opportunistic catering to powerful interests, and their walking in lockstep with the rightward political drift of America are disturbing for a discipline that claims to be a science.\nLarry Kudlow- renowned economist (and deranged drug addict) The kind of advice Corbyn– and presumably President Bernie– will get from Stiglitz is entirely different and from an entirely different, people-oriented perspective. Friday Stieglitz and Adam Hersh, senior economist at the Roosevelt Institute, published a decidedly non-establishment piece on the TPP– which is nearly negotiated now – and “free trade” in general. Details are being ironed out in Atlanta. “The biggest regional trade and investment agreement in history,” they wrote, “is not what it seems.”\nYou will hear much about the importance of the TPP for “free trade.” The reality is that this is an agreement to manage its members’ trade and investment relations– and to do so on behalf of each country’s most powerful business lobbies. Make no mistake: It is evident from the main outstanding issues, over which negotiators are still haggling, that the TPP is not about “free” trade.\nNew Zealand has threatened to walk away from the agreement over the way Canada and the US manage trade in dairy products. Australia is not happy with how the US and Mexico manage trade in sugar. And the US is not happy with how Japan manages trade in rice. These industries are backed by significant voting blocs in their respective countries. And they represent just the tip of the iceberg in terms of how the TPP would advance an agenda that actually runs counter to free trade.\nFor starters, consider what the agreement would do to expand intellectual property rights for big pharmaceutical companies, as we learned from leaked versions of the negotiating text. Economic research clearly shows the argument that such intellectual property rights promote research to be weak at best. In fact, there is evidence to the contrary: When the Supreme Court invalidated Myriad’s patent on the BRCA gene, it led to a burst of innovation that resulted in better tests at lower costs. Indeed, provisions in the TPP would restrain open competition and raise prices for consumers in the US and around the world – anathema to free trade.\nThe TPP would manage trade in pharmaceuticals through a variety of seemingly arcane rule changes on issues such as “patent linkage,” “data exclusivity,” and “biologics.” The upshot is that pharmaceutical companies would effectively be allowed to extend– sometimes almost indefinitely– their monopolies on patented medicines, keep cheaper generics off the market, and block “biosimilar” competitors from introducing new medicines for years. That is how the TPP will manage trade for the pharmaceutical industry if the US gets its way.\nSimilarly, consider how the US hopes to use the TPP to manage trade for the tobacco industry. For decades, US-based tobacco companies have used foreign investor adjudication mechanisms created by agreements like the TPP to fight regulations intended to curb the public-health scourge of smoking. Under these investor-state dispute settlement (ISDS) systems, foreign investors gain new rights to sue national governments in binding private arbitration for regulations they see as diminishing the expected profitability of their investments.\nInternational corporate interests tout ISDS as necessary to protect property rights where the rule of law and credible courts are lacking. But that argument is nonsense. The US is seeking the same mechanism in a similar mega-deal with the European Union, the Transatlantic Trade and Investment Partnership, even though there is little question about the quality of Europe’s legal and judicial systems.\nTo be sure, investors– wherever they call home– deserve protection from expropriation or discriminatory regulations. But ISDS goes much further: The obligation to compensate investors for losses of expected profits can and has been applied even where rules are nondiscriminatory and profits are made from causing public harm.\nPhilip Morris International is currently prosecuting such cases against Australia and Uruguay (not a TPP partner) for requiring cigarettes to carry warning labels. Canada, under threat of a similar suit, backed down from introducing a similarly effective warning label a few years back.\nGiven the veil of secrecy surrounding the TPP negotiations, it is not clear whether tobacco will be excluded from some aspects of ISDS. Either way, the broader issue remains: Such provisions make it hard for governments to conduct their basic functions– protecting their citizens’ health and safety, ensuring economic stability, and safeguarding the environment.\nImagine what would have happened if these provisions had been in place when the lethal effects of asbestos were discovered. Rather than shutting down manufacturers and forcing them to compensate those who had been harmed, under ISDS, governments would have had to pay the manufacturers not to kill their citizens. Taxpayers would have been hit twice– first to pay for the health damage caused by asbestos, and then to compensate manufacturers for their lost profits when the government stepped in to regulate a dangerous product.\nIt should surprise no one that America’s international agreements produce managed rather than free trade. That is what happens when the policymaking process is closed to non-business stakeholders– not to mention the people’s elected representatives in Congress.\nBut how could we do a post about economists and leave Paul Krugman out– or Republican voodoo economics? On Friday, Krugman looked at the Trump-Jeb-Rubio tax plans in terms of Republican voodoo orthodoxy. They all passed with flying colors : “lavish huge cuts on the wealthy while blowing up the deficit.”\n[T]here’s the recent state-level evidence. Kansas slashed taxes, in what its right-wing governor described as a 'real live experiment' in economic policy; the state’s growth has lagged ever since. California moved in the opposite direction, raising taxes; it has recently led the nation in job growth.\nTrue, you can find self-proclaimed economic experts claiming to find overall evidence that low tax rates spur economic growth, but such experts invariably turn out to be on the payroll of right-wing pressure groups (and have an interesting habit of getting their numbers wrong). Independent studies of the correlation between tax rates and economic growth, for example by the Congressional Research Service, consistently find no relationship at all. There is no serious economic case for the tax-cut obsession.\nExcept one:\nRepublicans support big tax cuts for the wealthy because that’s what wealthy donors want. No doubt most of those donors have managed to convince themselves that what’s good for them is good for America. But at root it’s about rich people supporting politicians who will make them richer. Everything else is just rationalization.\n… [N]ever forget that what it’s really about is top-down class warfare. That may sound simplistic, but it’s the way the world works.\n“When fascism comes to America, it will be wrapped in the flag and carrying the cross.” — Sinclair Lewis", "external_links": ["http://www.thestar.com/news/canada/2015/10/02/trans-pacific-partnership-deal-could-be-near-after-auto-compromise.html", "http://www.nytimes.com/2015/10/02/opinion/voodoo-never-dies.html?ref=opinion&#038;_r=1", "http://www.salon.com/2015/10/03/stop_listening_to_these_clowns_economists_bad_ideas_have_been_damaging_our_economy_for_years/", "http://www.usatoday.com/story/news/politics/2015/10/04/ben-bernanke-execs-jail-great-recession-federal-reserve/72959402/", "http://www.bbc.com/news/uk-politics-34374349", "http://thinkprogress.org/politics/2015/04/01/3641596/architect-george-w-bushs-tax-cuts-rich-advising-jeb-bush-inequality/", "https://www.youtube.com/embed/uNNFM7y8184"], "published": "2015-10-05T14:12:00.000+03:00", "crawled": "2015-10-05T17:01:24.388+03:00", "highlightTitle": ""}