{"organizations": [], "uuid": "788fc8da4c96267c4b40149d63d8c7402979fc27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.radioiowa.com", "main_image": "https://s0.wp.com/i/blank.jpg", "site_section": "http://www.radioiowa.com/category/politics-government/feed/", "section_title": "Radio Iowa » » Politics & Government", "url": "http://www.radioiowa.com/2015/10/21/trump-says-gop-rivals-with-poor-polls-numbers-will-start-falling-like-flies/", "country": "US", "title": "Trump says GOP rivals with poor polls numbers will ‘start falling…like flies’", "performance_score": 0, "site": "radioiowa.com", "participants_count": 1, "title_full": "Trump says GOP rivals with poor polls numbers will ‘start falling…like flies’", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:56:00.000+03:00", "replies_count": 0, "uuid": "788fc8da4c96267c4b40149d63d8c7402979fc27"}, "author": "O. Kay Henderson", "url": "http://www.radioiowa.com/2015/10/21/trump-says-gop-rivals-with-poor-polls-numbers-will-start-falling-like-flies/", "ord_in_thread": 0, "title": "Trump says GOP rivals with poor polls numbers will ‘start falling…like flies’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  News / Trump says GOP rivals with poor polls numbers will ‘start falling…like flies’ Trump says GOP rivals with poor polls numbers will ‘start falling…like flies’ October 21, 2015 by O. Kay Henderson \nRepublican presidential candidate Donald Trump is predicting competitors who are at the bottom of the polls will soon end their campaigns. \n“They’re going to start falling, I think, like flies now,” Trump said. “…Some of these guys have a zero for weeks…Somebody said they do it for their brand. How is that good for your brand?” \nTrump spoke tonight to a big crowd in Burlington. He walked on stage with the print-out of a new national ABC/Washington Post poll which found Trump has the support of 32 percent of Republicans and Republican-leaning independents. \n“Today is the 100th day that we have been #1 in every single poll. Think of it,” Trump said, to cheers. “And we’re increasing our lead.” \nTrump suggested the televised debates will be better with fewer candidates. \n“A lot of people are going to start dropping out, which is good,” Trump said. “You get a much better discussion going instead of having all these folks around and the whole thing is ridiculous.” \nThe new poll also found 42 percent of Republican and Republican-leaning voters in the country believe Trump will get the GOP’s nomination. \n“When they always say: ‘You love to mention the polls. Nobody else does.’ I say: ‘That’s because they’re losing. They’re not stupid people.’ Right? They’re losing,” Trump said and the crowd cheered. “Oh, I could talk about these suckers all night long. I love ’em.” \nTrump opened the night-time rally by talking about Vice President Joe Biden’s decision not to run for president. \n“I think he did the smart thing because, frankly, I don’t know that he would have won….I really want to run against Hillary,” Trump said, and the crowd cheered. “I really do.” \nTrump spoke for about an hour in Burlington’s Memorial Auditorium, the largest venue in the city. New Jersey Governor Chris Christie also campaigned in Iowa today, making an afternoon stop in Newton and attending an evening fundraiser at the home of Eric Branstad, Governor Terry’s Branstad’s oldest son. Share this:", "external_links": [], "published": "2015-10-22T03:56:00.000+03:00", "crawled": "2015-10-22T04:07:01.332+03:00", "highlightTitle": ""}