{"organizations": [], "uuid": "2f6f0fb139fc7002b1ec6814b99a6f0a062e5f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00093/the-mia-welcomes-the-conclusion-of-the-tpp.htm", "country": "US", "title": "The MIA welcomes the conclusion of the TPP", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "The MIA welcomes the conclusion of the TPP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T23:50:00.000+03:00", "replies_count": 0, "uuid": "2f6f0fb139fc7002b1ec6814b99a6f0a062e5f86"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00093/the-mia-welcomes-the-conclusion-of-the-tpp.htm", "ord_in_thread": 0, "title": "The MIA welcomes the conclusion of the TPP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The MIA welcomes the conclusion of the TPP Tuesday, 6 October 2015, 9:50 am Press Release: Meat Industry Association \nMore market opportunities for red meat: the MIA welcomes the conclusion of the TPP 6 October 2015 \nThe Meat Industry Association welcomes the announcement by Trade Minister Groser on 6 October 2015 that the negotiations of the Trans Pacific Partnership Agreement have been concluded. \n“These have been long and complex negotiations and we want to congratulate the Trade Minister and his officials for getting the deal across the line and securing New Zealand’s trade interests,” said MIA CEO, Tim Ritchie. \nThe meat industry exports close to 90% of production to some 120 countries, so remaining competitive in the global market place and improving the ability to capitalise on opportunities into more markets is absolutely critical to the industry’s profitability. Trade deals are key to this. \nIn 2014, New Zealand exports of beef, sheepmeat and co-products to TPP countries totalled $2.4 billion. This is over one third of New Zealand’s exports to the world. The sector’s exports were charged a total of $94.3 million in tariff costs, with $77.4 million incurred on exports to Japan. \n“We don’t have trade deals with Japan, Canada, the US, Mexico or Peru. Japan, Canada and the US are not only some of the most protected agricultural economies but also some of the most valuable markets for New Zealand beef and sheepmeat,” said Ritchie. \n“Furthermore, while Mexico and Peru are not currently major markets for the industry, they have potential as important export destinations and the TPP will help the industry to further diversify its mix of export markets”. \nThe TPP will open up these markets and will see the removal of tariff costs for all beef and sheepmeat products, with the exception of Japan. \nThe US is New Zealand’s number one market for beef, both by volume and value, earning $1.57 billion in year ending June 2015. Current trade is under a quota system attracting a US4.4c/kg tariff. \nThis will be eliminated at entry into force. \nJapanese beef tariffs, however, will not be eliminated but will be significantly reduced from as high as 50% to 9% over time. A TPP-wide safeguard set at above current trade levels will also apply. Japan is a lucrative market for New Zealand beef despite the high tariff cost. In 2014/15, it was our 3rd largest beef market in terms of value earning $164 million. \n“While the outcome for Japan is not ideal, if the TPP is implemented quickly, it will achieve a level playing field with Australia by removing the tariff advantage Australian beef currently enjoys under the Australia-Japan FTA. This will be a significant and important prize for the sector”, said Tim Ritchie. \nBased on current trade flows it is estimated that the TPP will deliver some $72 million in tariff saving per year for the beef and sheepmeat sector once fully implemented. \n“Removing these tariff barriers will clear the way to focus on the equally important but often difficult to address non-tariff barriers which plague the meat industry,” said Tim Ritchie. \n“These barriers can be just as costly as tariffs, if not more so, and can block our meat products from entering a market irrespective of what tariff is applied. Companies run literally thousands of processes to meet the standards and requirements of the markets they export to. Often they are unrelated to food safety but add significant cost to meat processing. And unlike tariffs, these are ‘invisible’ costs because they are worn by companies as part of plant operations.” \nThe TPP, together with the recently signed Korea FTA and the existing trade deals with China and Taiwan, will secure market access and the red meat sector’s competitiveness not only into North Asia but will further integrate New Zealand into the Asia Pacific regional supply chains. \n“We encourage all parties to now move quickly through their respective ratification processes to enable the swift and timely implementation of this significant trade deal,” said Ritchie. \nENDS", "external_links": [], "published": "2015-10-05T23:50:00.000+03:00", "crawled": "2015-10-06T00:55:22.006+03:00", "highlightTitle": ""}