{"organizations": [], "uuid": "2ceb218f82753df09edd3f8ecc3ddbcd189f8cd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/1a/3d25c01cee74576ad62720d48f9a9b/media:5d31a1f8170e4997bf4de32b70d906b5SyriaRussiaBase.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/23/russian-lawmakers-on-a-visit-to-syria", "country": "US", "title": "Russian lawmakers on a visit to Syria", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Russian lawmakers on a visit to Syria - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "2ceb218f82753df09edd3f8ecc3ddbcd189f8cd5"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/23/russian-lawmakers-on-a-visit-to-syria", "ord_in_thread": 0, "title": "Russian lawmakers on a visit to Syria", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russian lawmakers arrive in Syria for meeting with President Assad Russian Su-25 jets takes off for a mission from Hemeimeem airbase, Syria, on Thursday, Oct. 22, 2015. Since early morning, Russian combat jets have been taking off from this base in western Syria, heading for missions. (AP Photo/Vladimir Kondrashov) 2\nAssociated Press Oct. 23, 2015 | 6:31 a.m. EDT + More By VLADIMIR ISACHENKOV, Associated Press\nLATAKIA, Syria (AP) — Several Russian lawmakers arrived in Syria on Friday for a meeting with President Bashar Assad on the day when foreign policy chiefs of Russia, the United States, Turkey and Saudi Arabia are discussing a political settlement to Syria's civil war.\nThe lawmakers' visit, announced by Russian news agencies, comes three days after Assad made a surprise trip to Moscow to meet with President Vladimir Putin.\nThe lawmakers from both chambers of the Russian parliament said they are on a humanitarian mission but will also be meeting Assad.\nThe visit continued a flurry of highly visible events which included Assad's visit, a media tour of the Russian air base in Syria to show off its air power, and Friday's meeting of foreign ministers from Russia, the United States, Turkey and Saudi Arabia in Vienna.\nAt a refugee camp pitched next to a sports arena in the coastal city of Latakia, civilians who fled the war to the relative safety of the government-controlled area lauded Russia's air support for the Syrian army.\nWhen international media visiting the camp children began to chant slogans in support of Assad and shout: \"Putin, thank you!\"\nFadila Mahmud Naasan said her son served in the army and their family had to flee the city because of militants targeting families of Assad's loyalists. She lost her leg because of illness while in a refugee camp.\n\"I hope with Russian pilots' help, our military will advance and defeat terrorists so that we could return to our homes,\" said ??ahmad Attan who served in the Syrian military and was wounded in fighting.\nPutin on Thursday said that the Syrian government should join efforts against the Islamic State group with \"those opposition forces that are ready for dialogue.\"\nPutin's spokesman Dmitry Peskov said on Thursday Russia would be happy to cooperate with opposition forces in Syria but will base its decisions on who it should talk to upon consultations with the Syrian government, as well as with the West and countries from the Middle East which advocate Assad's removal from power.\n___\nNataliya Vasilyeva in Moscow contributed to this report from Moscow.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZegtyp%3Fsrc=usn_gp", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZegtyp%3Fsrc=usn_rd&title=Russian%20lawmakers%20on%20a%20visit%20to%20Syria", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZegtyp%3Fsrc=usn_tw&via=usnews&text=Russian%20lawmakers%20on%20a%20visit%20to%20Syria", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZegtyp%3Fsrc=usn_su", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZegtyp%3Fsrc=usn_li&title=Russian%20lawmakers%20on%20a%20visit%20to%20Syria&summary=&source=U.%20S.%20News", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZegtyp%3Fsrc=usn_fb"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T13:50:18.608+03:00", "highlightTitle": ""}