{"organizations": [], "uuid": "9b11a957e6e67a1904ccc1bd68f1e46c0488ef2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30171927/wgu-missouri-announces-women-in-technology-scholarship-in-honor-of-national-techies-day", "country": "US", "title": "WGU Missouri Announces Women in Technology Scholarship in Honor of National Techies Day", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "WGU Missouri Announces Women in Technology Scholarship in Honor of National Techies Day - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "9b11a957e6e67a1904ccc1bd68f1e46c0488ef2b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30171927/wgu-missouri-announces-women-in-technology-scholarship-in-honor-of-national-techies-day", "ord_in_thread": 0, "title": "WGU Missouri Announces Women in Technology Scholarship in Honor of National Techies Day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " WGU Missouri\nNonprofit, online university to award scholarships for women pursuing IT degrees\nST. LOUIS , Oct. 2, 2015 /PRNewswire-USNewswire/ -- In celebration of National Techies Day, which is being observed Saturday, Oct. 3 , WGU Missouri is offering a new scholarship to help more women pursue careers in the technology field. With females representing only 24 percent of the industry, the fully online nonprofit university is offering the scholarship to encourage female residents in Missouri , who are interested in pursuing a bachelor's or master's degree in Information Technology, to go back to school.\nThe scholarships, each valued at up to $2,000 ( $500 per six-month term renewable for up to four terms), will be applied toward WGU Missouri's already-low tuition of $3,250 per term for an undergraduate or graduate degree in the College of Information Technology . Applications are currently being accepted at missouri.wgu.edu/WomenInTech through Dec. 31 .\n\"We hope that this scholarship will enable women to think of an IT career as attainable rather than just aspirational,\" said Dr. Angie Besendorfer , WGU Missouri Chancellor. \"Considering that Missouri is home to two of the country's fastest growing tech cities – Kansas City and St. Louis – providing educational opportunities for women in this field is an important step toward meeting the needs and demands of this industry. WGU Missouri is committed to promoting an accessible and affordable education in the IT field to Missourians in our state.\"\nTo be eligible for this scholarship, female applicants must be new students pursuing an undergraduate or graduate degree in the College of Information Technology. They will also need to complete an application for admission and scholarship application, and be officially admitted to WGU Missouri. This is a competitive program, and scholarships will be awarded based on the student's academic record, readiness for online study, and current competency, as well as other considerations.\nClick HERE to learn more about WGU Missouri and the Women in Technology scholarship.\nAbout WGU Missouri\nWGU Missouri is a competency-based, online university created to expand access to higher education for Missouri residents. The university offers more than 50 undergraduate and graduate degree programs in the fields of business, K-12 teacher education, information technology, and health professions, including nursing. WGU Missouri faculty members provide one-on-one guidance, support, and instruction.\nEstablished through a partnership with nationally recognized Western Governors University , WGU Missouri is open to all qualified Missouri residents. The university is nonprofit and self-sustaining on flat-rate tuition of about $6,000 per year for most programs.\nDegrees are granted under the accreditation of Western Governors University , which is accredited through the Northwest Commission on Colleges and Universities (NWCCU). Teachers College programs are accredited by the National Council for Accreditation of Teacher Education (NCATE), and nursing programs are accredited by the Commission on Collegiate Nursing Education (CCNE*).\n* Western Governors University offers nursing programs that are accredited by the Commission on Collegiate Nursing Education ( One Dupont Circle , NW, Suite 5380, Washington DC 20036, 202-877-6791) .\nContact for media inquiries:\nMiun Gleeson\nO: 314-677-2305\nmiun.gleeson@wgu.edu\nContact for enrollment information:\n855-948-8493\nmissouri.wgu.edu\nFollow WGU:\nhttp://www.facebook.com/wgu.edu\nhttp://www.linkedin.com/companies/western-governors-university\nhttp://twitter.com/wgu\nhttp://www.youtube.com/WesternGovernorsUniv\nhttp://google.com/+wgu\nhttp://news.wgu.edu/news/news.xml\nTo releases/wgu-missouri-announces-women-in-technology-scholarship-in-honor-of-national-techies-day-300153387.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/wgu-missouri-announces-women-in-technology-scholarship-in-honor-of-national-techies-day-300153387.html", "http://missouri.wgu.edu/tuition_financial_aid/scholarships/women_in_tech_overview?utm_source=12801&utm_medium=Landing+Page&utm_campaign=WGU+MO+Women+In+Technology+Scholarship+", "http://www.xmlnews.org/ns/", "http://missouri.wgu.edu/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC18534&Transmission_Id=201510021102PR_NEWS_USPR_____DC18534&DateId=20151002", "http://www.linkedin.com/companies/western-governors-university", "http://twitter.com/wgu", "http://news.wgu.edu/news/news.xml", "http://google.com/+wgu", "http://www.youtube.com/WesternGovernorsUniv", "http://missouri.wgu.edu/online_it_degrees/information_technology", "http://www.facebook.com/wgu.edu"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T22:41:39.048+03:00", "highlightTitle": ""}