{"organizations": [], "uuid": "f77e03999e030b1d435cb019746e735ca641dbf9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/161/060_460x230_020490432_460x230.jpg", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/Should-Britain-jump-into-the-toxic-mix-1", "country": "IE", "title": "Should Britain jump into the toxic mix of military intervention in Syria?", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "Should Britain jump into the toxic mix of military intervention in Syria? - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T20:08:00.000+03:00", "replies_count": 0, "uuid": "f77e03999e030b1d435cb019746e735ca641dbf9"}, "author": "Content Admin", "url": "https://www.oximity.com/article/Should-Britain-jump-into-the-toxic-mix-1", "ord_in_thread": 0, "title": "Should Britain jump into the toxic mix of military intervention in Syria?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GIVE them credit for persistence and ingenuity. The bomb-Syria bloc in the British establishment isn’t taking “no” for an answer.\nIn 2013 they were urging war against the Syrian government over its alleged use of chemical weapons. The House of Commons defeated David Cameron’s proposal in what was a landmark vote for anti-war sentiment in this country.\nIndeed, it stopped Obama’s own plans for attacking Syria in their tracks and represented a decisive democratic rupture in the Anglo-American war front in the Middle East .\nImperial interventionists in both major parties have been smarting ever since. The rise of Islamic State to control much of Syria’s territory – a consequence of the civil war fostered by the western powers, amongst others – seemed to offer another excuse for intervention.\nAfter all, British bombers are already participating in the US-led attack on IS in neighbouring Iraq – the latest military intervention in that country, and one having no better outcomes than all the previous.\nIt is now pretty obvious that bombing by western powers is not going to roll back Islamic State. That could only be done by the forces of strong and sovereign states in Iraq and Syria, able to mobilise support from all sections of the people.\nWestern policy has actually been directed towards obstructing that development, through the sponsorship of sectarian strife across the Middle East, and the destruction of one state after another in the region.\nNow reason number three has been dredged up - that old stand-by humanitarian” intervention. Labour MP Jo Cox has joined forces with Tory Andrew Mitchell to advocate military action…to save civilian lives.\nThey wrote in The Observer: “We need a military component that protects civilians as a necessary prerequisite to any future UN or internationally provided safe havens. The creation of safe havens inside Syria would eventually offer sanctuary from both the actions of Assad and Isis, as we cannot focus on Isis without an equal focus on Assad. They would save lives, reduce radicalisation and help to slow down the refugee exodus.\n“The approach of focusing on civilian protection will also make a political solution more likely. Preventing the regime from killing civilians, and signalling intent to Russia, is far more likely to compel the regime to the negotiating table than anything currently being done or mooted.”\nOf course, if humanitarianism was really a consideration, Britain would have stopped funding and arming the Syrian civil war some time ago. It would be welcoming far more refugees from the conflict zone it has fuelled.\nBut let us take the appeal at face value for a moment. How could it be implemented? Our bipartisan armchair strategists are obviously riled by Russia’s escalating military involvement in Syria. But it is a fact. What form of military intervention could now be undertaken which would not lead to a clash with Russia they do not say. Even the head of MI6 has acknowledged that “no-fly zones” are no longer a possibility, unless the NATO powers are prepared to countenance conflict with Moscow.\nThe reality of “no fly zones” and “safe havens”, benign as they sound, is regime change. That is the clear aim of the proposal. Assad government forces – or those supporting it – would be the target.\nA “no fly zone” would represent no challenge to Islamic State whatsoever. The caliphate lacks an air force.\nIf anyone still doubts that regime change is the real agenda, let them cast their minds back to the Libyan war. That began with Cameron and then French President Sarkozy pushing the United Nations to endorse just such a “no-fly zone”, ostensibly to protect the people of Benghazi from a massacre that Libyan ruler Gadhafi was then allegedly contemplating.\nEnforcing the no-fly zone quickly morphed into bombing Libyan government troops, in coordination with the anti-Gadhafi rebels on the ground. The result was the swift transition of “humanitarian intervention” into regime-change, with results that are all-too clear today. A ruined and divided country, a shattered society and hundreds of thousands of refugees risking life and limb to cross the Mediterranean to Europe.\nIn Syria today, the winners from a war to set up safe-havens – an operation which would also require the deployment of grounds troops into Syria – would most likely be IS. It would be best placed to expand into many of the areas cleared of regime forces.\nSuch plans fuel the fantasises of neo-conservatives on both sides of the Atlantic who dream of creating a “third force” capable to taking over Syria in opposition both to Assad and to Islamic State.\nObama’s efforts to create a militia to carry out such a plan has ended in fiasco. No more than five fighters have been trained. So they are left with the non-IS rebel groups in Syria. These include the “Free Syrian Army” and the local al-Qaeda affiliate, trading as the Nusra Front.\nThese groups are drawing support from a range of foreign powers, including the US, Turkey, Saudi Arabia and other reactionary Gulf states. The Assad government is actively supported by Russia and Iran.\nThe clear need is not for Britain to jump further into this toxic mix. It is for a negotiated diplomatic end to the dreadful civil war which has laid waste to Syria. Ultimately, only the Syrian people can determine their own future political arrangements.\nBut the foreign powers could assist by all ending their military interventions, open and clandestine, in Syria – ending the bombing and the arming of one side or another.\nThey should further promote peace by abandoning all the preconditions laid down for negotiations. Such preconditions only serve to prolong the conflict and to give either government or opposition hope that foreign military and diplomatic support could somehow lead to all-out victory.\nDavid Cameron, however, wants Britain to pile into the war – adding bombing of somebody or other to the existing levels of covert interference.\nNo doubt he is in part animated by a wish to be seen to be “doing something” that keeps Britain a key player in Middle East politics .\nBut mostly he just seems to want to reverse the humiliation of autumn 2013, when he became the first British prime Minister to lose a vote in parliament on going to war.\nHe has so far hesitated to bring a definite proposal forward for fear of a repetition. Many influential Conservative backbenchers can see no rational case for war.\nHe draws strength, however, from signs of support for bombing in the Labour ranks. The parliamentary arithmetic is still more unfavourable for peace than it was two years ago. But a united and resolute Labour position against bombing would most likely still stay his hand.\nThat is why the arguments within Labour’s ranks on this issue today are of first-rate importance.\n***\nThere should be no need for a dispute within the Labour Party over the looming possibility of a Commons vote on bombing Syria.\nJust a few weeks ago, the Party conference agreed a resolution on the issue which, despite shortcomings, is clear enough. For the benefit of those members of the Shadow Cabinet who appear not to have read it, here it is:\n“Conference believes the Parliamentary Labour Party should oppose any such extension [of bombing] unless the following conditions are met: Clear and unambiguous authorisation for such a bombing campaign from the United Nations. A comprehensive European Union-wide plan is in place to provide humanitarian assistance to the increased number of refugees that even more widespread bombing can be expected to lead to. Such bombing is exclusively directed at military targets directly associated with 'Islamic State' noting that if the bombing campaign advocated by the British government in 2013 had not been blocked by the PLP under Ed Miliband’s leadership, 'Islamic State' forces might now be in control of far more Syrian territory, including Damascus. Any military action is subordinated to international diplomatic efforts, including the main regional powers, to bring the Syrian civil war to an end, since only a broadly-based and sovereign Syrian government can ultimately retake territory currently controlled by 'Islamic State'.\nConference believes that only military action which meets all these objectives, and thus avoids the risk of repeating the disastrous consequences of the 2003 war in Iraq and the 2011 air campaign intervention in Libya, can secure the assent of the British people.”\nIn the view of Stop the War Coalition, even a military campaign which conformed to all those criteria, which are frankly very unlikely to be met, would still be an unwarranted and pointless intervention which would add to the sum of human suffering in Syria. The present bombing in Iraq proves that.\nNevertheless, the resolution represents a block in Cameron’s road to war. And it is , to repeat, Labour policy, not the whim of anyone, even a leader with such a recent and expansive mandate as Jeremy Corbyn.\nBut it has come under sustained, if indirect attack from Labour MPs.\nThe most overt opposition has come from shadow foreign secretary Hillary Benn. In a article last week he went well beyond the terms of the resolution in three specific respects.\nFirst, he urged Cameron to actively work to secure the United Nations resolution referred to. Second, he hinted, in lawyerly language, that Labour might support bombing of Syria even if no such UN resolution was forthcoming.\nAnd third he deliberately mixed up the issue of bombing Islamic State, a possibility conceded in a highly-contingent fashion in the resolution, with “humanitarian intervention” to establish so-called “safe havens”, which wasn’t.\nBenn’s article came with the endorsement that it represents Labour’s official view on the matter, and spin to the effect that it left open the possibility of Labour backing war without UN authorisation.\nIt is a reminder that diluting Labour’s position on Syria is a win-win for the party’s right-wing. It gets the Party back in the military intervention game, removing the stain, as they see it, of the 2013 vote. And it damages, as a sort of collateral damage, the leadership of Jeremy Corbyn, who was until his election as Labour leader, the chair of the Stop the War Coalition.\nAn attempt to hedge the issue was the floating of suggestions that Labour MPs be given a “free vote” on the bombing issue. Under this scenario, bombing would most likely be approved, but the sting of anti-Corbyn rebellion would have been drawn.\nThere should be no question of allowing this. War is not a matter of conscience, save for absolute pacifists, but of policy. And Labour’s policy was made abundantly clear at the Party conference just a few weeks ago. Jeremy Corbyn has rightly called for policy sovereignty in the Party to be restored to conference.\nIn effect, a “free vote” would be tantamount to allowing the bombing of Syria. Some Labour MPs would doubtless rebel against a whipped vote in support of Labour policy in any case. Some would be committed Blairite neo-cons, while others would be animated by a desire to do anything, however debased, to damage Jeremy Corbyn.\nHowever, their number would be limited. A “free vote” would increase the pro-war element considerably, since it would give the confused all the alibi they need to line up with the government.\nThe worst aspect of such vacillation, and of the Benn article in particular, is that it amounts to a come-hither to David Cameron, inviting him to bring a proposal for bombing Syria in the sure anticipation if victory, either because he will secure official Labour backing or because enough Labour MPs will support his resolution in any case.\nIt is therefore urgent to put all possible pressure on Labour MPs to stick to their own party policy as a minimum. That means explaining the humanitarian and strategic realities of the Syrian situation to those MPs who are uncertain.\nIt means explaining the alternative route of a real diplomatic settlement to the Syrian conflict and extended assistance to refugees and outlining the dangerous consequences for Syrian civilians and great-power relations alike of any extension of the war.\nAnd for those Labour MPs who are still committed to the neo-conservative interventionist approach it means confronting them with the hideous record of their policies so far this century – millions dead or displaced, state collapse throughout the region, sectarian conflict incited, economies wrecked and global tension heightened. The Scottish National Party has clearly recognised it is time to break with the crimes of the recent past, as its conference last weekend voted to oppose bombing Syria. Can Labour afford not to do likewise?\nAbove all, it is time for a major upsurge in anti-war campaigning across the country. Our demands should be clear:\nAll foreign military intervention in Syria should end immediately. The Syrian conflict must be dealt with through political and diplomatic negotiations, with an end to the preconditions which block progress.\nWhile these negotiations should include all regional and global parties that are affected by the conflict, the future of the Syrian government must be decided by the Syrian people alone, free of all external interference.\nAnd Britain must abandon plans for bombing Syria, cease bombing Iraq and end its support for US global domination in favour of respect for every nation’s right to self-determination and sovereignty.", "external_links": ["https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/161/060_460x230_020490432_555x277.jpg"], "published": "2015-10-19T20:08:00.000+03:00", "crawled": "2015-10-20T10:25:37.101+03:00", "highlightTitle": ""}