{"organizations": [], "uuid": "7dc510a17b1a003e5e0bb5dc961947383a1972bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://beforeitsnews.com/contributor/upload/291278/images/Al-Baghdadi-ISIS.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/alternative/2015/10/convoy-hit-top-eight-senior-members-of-isis-killed-was-infamous-baghdadi-among-them-or-not-video-3227220.html", "country": "US", "title": "Convoy Hit! Top Eight Senior Members of ISIS Killed Was Infamous Baghdadi Among Them Or Not? (Video) | Alternative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 2, "title_full": "Convoy Hit! Top Eight Senior Members of ISIS Killed Was Infamous Baghdadi Among Them Or Not? (Video) | Alternative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T18:39:00.000+03:00", "replies_count": 1, "uuid": "7dc510a17b1a003e5e0bb5dc961947383a1972bc"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/alternative/2015/10/convoy-hit-top-eight-senior-members-of-isis-killed-was-infamous-baghdadi-among-them-or-not-video-3227220.html", "ord_in_thread": 0, "title": "Convoy Hit! Top Eight Senior Members of ISIS Killed Was Infamous Baghdadi Among Them Or Not? (Video) | Alternative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nTop Eight Senior Members of ISIS Killed al-Baghadi?\n11 Oct 15\nRumors have surfaced that al-Baghdadi may have been injured and 8 Top Senior Members are dead in an airstrike in Iraq. Check these out:\nIslamic State figures killed in air strike; Baghdadi not believed among them BAGHDAD (Reuters) – Eight senior figures from Islamic State were killed in an air strike while meeting in a town in western Iraq, but the group’s reclusive leader Abu Bakr al-Baghdadi did not appear to be among them, residents of the town and hospital sources said.\nIraq said on Sunday its air force had hit the meeting and had also struck a convoy that was carrying Baghdadi to attend it. It said Baghdadi had been driven away from the convoy in an unknown condition.The Iraqi military’s announcement was the latest unconfirmed report of the possible death or injury of Baghdadi, who has survived a year of U.S.-led air strikes and multi-sided wars in two countries since proclaiming himself caliph of all Muslims after his forces swept through most of northern Iraq last year.\nA Twitter site which publishes statements from Islamic State said “rumors” that an air strike had targeted Baghdadi were false.\nThe United States military declined to comment on the Iraqi military’s report.\n“Iraqi air forces have bombed the convoy of the terrorist Abu Bakr al-Baghdadi while he was heading to Karabla to attend a meeting with Daesh commanders,” the Iraqi military said in a statement.\nDaesh is the Arabic acronym for Islamic State, also known as ISIS or ISIL. Karabla is a town in Iraq’s Anbar province near the Syrian border, an Islamic State stronghold, not to be confused with Kerbala, a Shi’ite holy city in the south.\n“The location of the meeting was also bombed and many of the group’s leaders were killed and wounded. The fate of murderer al-Baghdadi is unknown and he was carried away by a vehicle. His health condition is still unclear,” the military said.\nHospital sources and residents said airstrikes hit two houses and killed eight senior local leaders of an Islamic State police force in the town.\nIslamic State supporters said on Twitter that even if Baghdadi had been killed, his self-proclaimed caliphate straddling large areas of Iraq and Syria would survive.\n“Do you think we would leave the State of the caliphate and abandon it, oh vile world?,” asked one of his followers. “This is the religion of God, it rose on the skulls of heroes and martyrs and every time one of them is martyred we rise.”\nBaghdadi has galvanized militants from around the world, encouraged by his military successes and plans to redraw the map of the Middle East to create a self-sustaining caliphate.\nHis successes prompted the United States to re-engage in Iraq with air strikes against his fighters three years after pulling out following a long, costly occupation.\nRussia, which has launched a bombing campaign to aid its Syrian ally Bashar al-Assad, says its main enemy is Islamic State as well.\nAn Islamic State fighter reached by telephone could not confirm whether Baghdadi had been in a convoy that was struck, but said the group would fight on whatever his fate: “Even if he was martyred then it will not affect Islamic State. We will lose a leader but there are a thousand Baghdadis.”\n SOURCE\nConvoy including ISIS leader hit by airstrike, Iraq’s military says (CNN) Iraq’s military claims its air force struck a convoy in western Anbar province that included ISIS leader Abu Bakr al-Baghdadi.\nThe fate of al-Baghdadi is unknown, the military statement said.\n“The Iraqi airforce carried out a heroic operation by striking al-Baghdadi’s convoy while he on his way to attend a meeting with senior ISIS leaders in Karabelah,” the statement said.\nThe site of the meeting was also struck and several ISIS leaders were killed and wounded, the statement said.\nClaims that al-Baghdadi has been hit in airstrikes have been made twice over the past year. In November, Iraqi officials said he had been wounded in an airstrike. In March, Iraq’s Interior Ministry said the Iraqi air force wounded al-Baghdadi in an airstrike on the Iraqi town of Al-Qaem.\nEach time, audio recordings of al-Baghdadi showed up on social media within days after the airstrikes.\nHe is enemy No. 1 in the fight against ISIS, and this summer, U.S. intelligence officials said they believed al-Baghdadi was in the area of Raqqa, Syria, the de facto capital of the self-declared Islamic State. He was also still in charge of ISIS’ operations, they said. SOURCE", "external_links": ["http://www.cnn.com/2014/11/10/world/meast/isis-threat/index.html?iref=allsearch", "http://news.yahoo.com/iraqi-air-force-hits-convoy-islamic-state-leader-121105784.html", "https://www.youtube.com/embed/zNmMKRoJdQc", "http://www.cnn.com/2015/07/15/politics/baghdadi-raqqa-isis-terrorism/", "http://www.cnn.com/2015/10/11/world/iraq-al-baghdadi-raid/"], "published": "2015-10-11T18:39:00.000+03:00", "crawled": "2015-10-11T21:10:01.943+03:00", "highlightTitle": ""}