{"organizations": [], "uuid": "43ad830b0128ab6e21018fb02e8b312453ee81c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30172869/wounded-service-members-board-the-uss-kidd", "country": "US", "title": "Wounded Service Members Board the USS Kidd", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Wounded Service Members Board the USS Kidd - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "43ad830b0128ab6e21018fb02e8b312453ee81c4"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30172869/wounded-service-members-board-the-uss-kidd", "ord_in_thread": 0, "title": "Wounded Service Members Board the USS Kidd", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Wounded Warrior Project\nGroup Tours and Learns About WWII Era Ship\nBATON ROUGE, La. , Oct. 2, 2015 /PRNewswire-USNewswire/ -- One by one, wounded veterans boarded the USS Kidd along the banks of the Mississippi River. The Fletcher-class destroyer's 38 caliber gun mounts still face the bow and the stern of the 72-year-old ship. One of the steam silos still shows the image of Captain William Kidd , a pirate chosen as a mascot for the ship during its maiden voyage. The USS Kidd is actually named for Rear Admiral Isaac Campbell Kidd .\nThe USS Kidd is a memorial to the USS Navy spirit, a reminder of the response following Pearl Harbor . The Navy launched the Kidd just more than 15 months after Japan bombed the Navy's westernmost fleet. That attack was the catalyst that marked the U.S. entrance into World War II.\nWounded Warrior Project ® (WWP) brought injured veterans to tour the USS Kidd as part of its Alumni program. The program creates support through shared experiences and helps the WWP mission to honor and empower Wounded Warriors. Outings like this tour can help convince veterans to get out of their homes and put them in touch with other veterans who may be facing similar experiences transitioning to civilian life. The Alumni program is one of 20 programs and services offered to wounded veterans, free of charge.\nTanya Whitney is a WWP Alumnus, who served 27 years in the U.S. Army. She says she learned a lot about the ship and its role in WWII.\n\"We learned some of the events involving the USS Kidd and its sister ships and how even the most mundane daily chores on a ship could be dangerous,\" Whitney said.\nWWP Alumnus, and Army veteran Aaron Vice enjoyed learning the history of the ship.\n\"The tour focused on the sacrifices of the men who served aboard the USS Kidd throughout her years of service in the US Navy,\" Vice said.\nThe veterans had the chance to see the different decks of the ship and learn about some of the Kidd history, not talked about during typical tours.\n\"The highlight of the tour was going behind the scenes and seeing other areas of the ship that is usually off limits to the general public,\" WWP Alumnus LaShawn Raby said.\n\"We discovered the ship was damaged during the kamikaze attack and how the crew reacted…\" Whitney said.\n\"We were told stories about the crew and ship that are not covered in historical books and were able to see areas of the ship not available during normal hours.\"\nDuring the tour, veterans also had the opportunity to learn about the programs and services offered by WWP.\n\"Wounded Warrior Project has been great to me and allowed me to actually enjoy life again instead of just being alive,\" Vice said. \"They have helped me overcome the rough transition from military to civilian life.\"\nAbout Wounded Warrior Project\nThe mission of Wounded Warrior Project ® (WWP) is to honor and empower Wounded Warriors. WWP's purpose is to raise awareness and to enlist the public's aid for the needs of injured service members, to help injured servicemen and women aid and assist each other, and to provide unique, direct programs and services to meet their needs. WWP is a national, nonpartisan organization headquartered in Jacksonville, Florida . To get involved and learn more, visit woundedwarriorproject.org.\nPhoto - http://photos.prnewswire.com/prnh/20151002/273471\nPhoto - http://photos.prnewswire.com/prnh/20151002/273472\n releases/wounded-service-members-board-the-uss-kidd-300153459.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151002/273471", "http://photos.prnewswire.com/prnh/20151002/273472", "http://www.xmlnews.org/ns/", "https://photos.prnewswire.com/prnvar/20151002/273472", "https://photos.prnewswire.com/prnvar/20151002/273471", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC18644&Transmission_Id=201510021303PR_NEWS_USPR_____DC18644&DateId=20151002", "http://www.prnewswire.com/news-releases/wounded-service-members-board-the-uss-kidd-300153459.html"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T20:35:33.753+03:00", "highlightTitle": ""}