{"organizations": [], "uuid": "12625af9d826edb55eb11285df67a1551e19b7ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30247166/intrexon-subsidiary-viagen-pets-announces-successful-delivery-of-healthy-kittens", "country": "US", "title": "Intrexon Subsidiary, ViaGen Pets, Announces Successful Delivery of Healthy Kittens", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Intrexon Subsidiary, ViaGen Pets, Announces Successful Delivery of Healthy Kittens - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "12625af9d826edb55eb11285df67a1551e19b7ee"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30247166/intrexon-subsidiary-viagen-pets-announces-successful-delivery-of-healthy-kittens", "ord_in_thread": 0, "title": "Intrexon Subsidiary, ViaGen Pets, Announces Successful Delivery of Healthy Kittens", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Intrexon Corporation\nCEDAR PARK, Texas , Oct. 13, 2015 /PRNewswire/ -- Intrexon Corporation (NYSE: XON), a leader in synthetic biology, today announced that ViaGen Pets, a subsidiary of the Company which actively serves pet owners seeking genetic preservation services for their beloved companion animals, has successfully delivered two litters of healthy, cloned kittens for its clients. With its recently completed state-of-the-art lab offering unprecedented capabilities, ViaGen Pets is preparing for a global launch of its services in early 2016 providing an opportunity to pet owners worldwide that has never before existed.\n\"I couldn't be more pleased with the birth of these adorable kittens,\" noted Blake Russell , President of ViaGen Pets. \"As the largest global provider of genetic preservation services for companion animals, we look forward to expanding the life-enriching connections that people form with their pets. Our goal is to bring this opportunity to all pet owners and their families.\"\nThrough the combination of Intrexon's expertise in reproductive technologies and ViaGen's experience as the trusted world leader in cloned mammals for over 15 years, more affordable options for those who wish to preserve the genetics of their beloved companion animals is near. ViaGen Pets currently has clients across multiple countries that have trusted the Company to deliver a genetic twin of their puppies and kittens and is actively engaging the global veterinary community today as it develops partnerships to best serve the pet owner.\nViaGen Pets is also committed to affording companion animals the best possible healthcare, both today and in the future. Safe, long-term preservation of pets' cells offers owners peace of mind their special breed will have access to current cell-based therapies as well as therapeutic options that do not yet exist. The Company will provide further information about these and other options to families and veterinarians worldwide as its global launch approaches in early 2016.\nAbout Intrexon Corporation\nIntrexon Corporation (NYSE:XON) is Powering the Bioindustrial Revolution with Better DNA™ to create biologically-based products that improve the quality of life and the health of the planet. The Company's integrated technology suite provides its partners across diverse markets with industrial-scale design and development of complex biological systems delivering unprecedented control, quality, function, and performance of living cells. We call our synthetic biology approach Better DNA ® , and we invite you to discover more at www.dna.com .\nAbout ViaGen Pets\nViaGen Pets is a U.S. based division of ViaGen, LC which has been providing cloning services to the equine and livestock sector for over 15 years and has successfully delivered thousands of healthy cloned animals to clients. ViaGen Pets is focused on utilizing ViaGen's world leading science, patent portfolio, and animal care experience to deliver healthy puppies and kittens to their clients. ViaGen Pets has been working with veterinarians and reproductive experts from around the world over the last several years to develop a companion animal program that can meet the health, care, and delivery expectations of those animal lovers who demand the very best for their beloved pets.\nTrademarks\nIntrexon, Powering the Bioindustrial Revolution with Better DNA, and Better DNA are trademarks of Intrexon and/or its affiliates. Other names may be trademarks of their respective owners.\nSafe Harbor Statement\nSome of the statements made in this press release are forward-looking statements. These forward-looking statements are based upon our current expectations and projections about future events and generally relate to our plans, objectives and expectations for the development of our business. Although management believes that the plans and objectives reflected in or suggested by these forward-looking statements are reasonable, all forward-looking statements involve risks and uncertainties and actual future results may be materially different from the plans, objectives and expectations expressed in this press release.\nFor more information regarding Intrexon Corporation, contact:\nInvestor Contact:\nChristopher Basta\nVice President, Investor Relations\nTel: +1 (561) 410-7052\ninvestors@intrexon.com\nCorporate Contact:\nMarie Rossi , Ph.D.\nSenior Manager, Technical Communications\nTel: +1 (301) 556-9850\npublicrelations@intrexon.com\nLogo - http://photos.prnewswire.com/prnh/20130919/NY83283LOGO\n releases/intrexon-subsidiary-viagen-pets-announces-successful-delivery-of-healthy-kittens-300158367.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY26312&Transmission_Id=201510130800PR_NEWS_USPR_____NY26312&DateId=20151013", "http://www.xmlnews.org/ns/", "http://www.dna.com/", "http://photos.prnewswire.com/prnvar/20130919/NY83283LOGO", "http://photos.prnewswire.com/prnh/20130919/NY83283LOGO", "http://www.prnewswire.com/news-releases/intrexon-subsidiary-viagen-pets-announces-successful-delivery-of-healthy-kittens-300158367.html"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T17:30:42.828+03:00", "highlightTitle": ""}