{"organizations": [], "uuid": "f091734a204bc250b71d95d10a461dbb6e9a7321", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/politics/index.xml", "section_title": "Politics - The Huffington Post", "url": "http://www.huffingtonpost.com/marvin-meadors/paul-ryan-flimflam-man_b_8283212.html", "country": "US", "title": "Paul Ryan -- 'FlimFlam Man!'", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Paul Ryan -- 'FlimFlam Man!'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:37:00.000+03:00", "replies_count": 0, "uuid": "f091734a204bc250b71d95d10a461dbb6e9a7321"}, "author": "Marvin Meadors", "url": "http://www.huffingtonpost.com/marvin-meadors/paul-ryan-flimflam-man_b_8283212.html", "ord_in_thread": 0, "title": "Paul Ryan -- 'FlimFlam Man!'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nPaul Krugman had a very insightful column in The New York Times analyzing representative Paul Ryan, the possible next Speaker of the House of Representatives, as just another in a long line of Republican con men! Ryan's sleight-of-hand magic is that he has convinced the media of a certain seriousness by means of his reputation as a policy wonk and his effortless ability to put a pretty face on extremism. \nKrugman begins by saying the \"modern Republican party is a post-policy enterprise\", which he insists the media does not want to recognize. In fact, the media still holds true to the fiction of covering both sides of the \"debate\" with the same seriousness when one side is actually in a post-factual meltdown. If one doubts this assertion, consider the Republican denial of man-made climate change, their faith in the voodoo of supply side economics, or their contention that racism is a thing of the past and white males, especially wealthy ones, are the real victims of oppression. \nAs Hrafnkell Haraldsson (try pronouncing that name three times) stated in Politicususa: \n\"Far from creating a straw man, Republicans have created a straw country, one where nothing is as it seems, one that has no relationship -- not even a passing resemblance -- to the actual fact-based world in which we live. In short, Republicans lie. They lie about everything. They even lie about lying.\" \nBut I digress! Ryan was the main architect of the Republican's budget proposal in 2012, which included the usual conservative litany of tax cuts for the wealthy supposedly paid for by an elimination of tax deductions and massive cuts in spending on benefits for the poor and middle class. Mr. Ryan argued that the steep cuts in taxes and benefits would result in much lower deficits, which he speaks about, according to Mr. Krugman, \"in apocalyptic terms.\" \nMr. Ryan defended his plan by arguing the non-partisan Congressional Budget Office estimated that it would \"cut the budget deficit in half by 2020.\" However, this outcome was fixed beforehand by Mr. Ryan. As Paul Krugman stated: \"At Mr. Ryan's request, it (the CBO) produced an estimate of the budget effects of his proposed spending cuts -- period. It didn't address the revenue losses from his tax cuts. Therefore, the flimflam went unabated! \nMr. Krugman wrote at the time: \"The Tax Policy Center finds that the Ryan plan would cut taxes on the richest 1 percent of the population in half, giving them 117 percent of the plan's total tax cuts. That's not a misprint. Even as it slashed taxes at the top, the plan would raise taxes for 95 percent of the population.\" Also, when factoring in the loss of tax revenues the non-partisan Tax Policy Center found that Ryan's tax plan would have produced as steep deficits by 2020 as the Obama plan would, which was, of course, much less of a reverse-Robin Hood plan than Ryan's which stole from the poor only to give to the rich. \nOf course, Republicans introduced \"dynamic scoring\" in 2015 after taking control of Congress the year before to conceal their trickery and \"Enron-style accounting gimmicks!\" Dynamic scoring uses a similar assumption as does supply side economics that tax cuts will generate economic growth resulting in increased government revenues that offset those lost by the cuts themselves. This assumption is ahistorical, of course, given the Reagan and Bush tax cuts produced enormous deficits. Still, \" reality has never been a particularly strong deterrent to congressional Republicans.\" \nOf course, facts do not slow \"the Ayn Rand loving, progressive tax cut hating\" Ryan! According to Mr. Krugman, he is \"to fiscal policy what Carly Fiorina was to corporate management: brilliant at self-promotion, hopeless at actually doing the job.\" So even though Mr. Ryan puts a sane, sensible face on Republican extremism, it is still the same extremism dressed in sheep's clothing that has guided conservative thought since Reagan -- the same tax cuts for the wealthy resulting in deficits as high as the eye can see financed by draconian cuts to the benefits that house and feed the poor and keep the middle class afloat. Don't let it fool you! More:", "external_links": [], "published": "2015-10-14T16:37:00.000+03:00", "crawled": "2015-10-14T17:15:10.682+03:00", "highlightTitle": ""}