{"organizations": [], "uuid": "ebcd91766192b55bfbc363baa7ea1d67262f724e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.worldbulletin.net", "main_image": "http://media.worldbulletin.net/news/2015/09/13/refugees.jpg", "site_section": "http://www.worldbulletin.net/36/politics", "section_title": "Politics | Worldbulletin News", "url": "http://www.worldbulletin.net/todays-news/164888/turkish-pm-hails-merkel-over-refugee-crisis", "country": "", "title": "Turkish PM hails Merkel over refugee crisis | Diplomacy", "performance_score": 0, "site": "worldbulletin.net", "participants_count": 1, "title_full": "Turkish PM hails Merkel over refugee crisis | Diplomacy | Worldbulletin News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "ebcd91766192b55bfbc363baa7ea1d67262f724e"}, "author": "World Bulletin / News Desk", "url": "http://www.worldbulletin.net/todays-news/164888/turkish-pm-hails-merkel-over-refugee-crisis", "ord_in_thread": 0, "title": "Turkish PM hails Merkel over refugee crisis | Diplomacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister says refugee crisis tests Europe’s core ideas, urges more solidarity with asylum seekers\nTurkish Prime Minister Ahmet Davutoglu has praised German Chancellor Angela Merkel for opening her country's doors to asylum seekers, but criticized several other European leaders for denying solidarity with refugees.\n“Both Europe and Turkey are facing a test in these days,” Davutoglu said referring to the Syrian refugee crisis, during a rally in the western German city of Dusseldorf, where he addressed around 8,000 Turkish immigrants.\nHe criticized several European leaders, including Hungarian Prime Minister Orban, who opposed accepting refugees, describing the influx of refugees as a threat to Europe’s \"Christian roots\".\n“When several thousand refugees started to come to Europe… some started to say that this is a Christian continent, why Muslims are coming here? We have never done this, never asked those seeking shelter in our country whether they are Muslim or Christian. We have never asked them whether they are Arab, Kurdish or Turkmen,” Davutoglu said.\nHe praised German Chancellor Angela Merkel for her leadership in addressing the growing refugee crisis in Europe, trying to convince other European states to show more solidarity.\n“Germany has taken a courageous decision and opened its doors to refugees. I have talked this with Ms. Merkel in New York. We would like to congratulate this decision,” he said.\nTurkey is currently hosting the world’s largest refugee population, including 1.9 million Syrians, and has spent around $8 billion over the last five years.\nGermany, which has become the most popular destination for refugees coming to Europe, expects a record 800,000 asylum applications this year, four times the last year's total.\nDavutoglu called on Turkish immigrants living in Germany to do everything to help asylum seekers who seek shelter in the country, amid signs of growing support for anti-immigrant and far-right movements in Germany.\n“Let us give those racists groups in Europe a lesson in humanity,” he said.\n“I am proud of my people. We have seen no single racist reaction in Turkey against our 2 million brothers and sisters who came from Syria,” he added.\nDavutoglu was invited to Dusseldorf by the Union of European Turkish Democrats (UETD), a conservative and influential organization of ethnic Turks in the country, ahead of November 1 parliamentary election in Turkey.\nDuring his address to expatriates, Davutoglu pledged to solve problems of Turkish immigrants living abroad, and called on them to have their say in the upcoming election by increasing their voter turnout.\nGermany has the largest Turkish diaspora abroad. Among the 3 million ethnic Turks living in Germany, around 1.4 million of them are Turkish citizens who are eligible to vote in the November 1 election.\nAK Party secured 53.6 percent of votes from Germany during the June 7 election, but the voter turnout was less than 40 percent.", "external_links": [], "published": "2015-10-04T03:00:00.000+03:00", "crawled": "2015-10-04T12:43:38.895+03:00", "highlightTitle": ""}