{"organizations": [], "uuid": "90a07aca03ccca523d838867610e0a9fe1afb20d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.aljazeera.com", "main_image": "http://www.aljazeera.com/mritems/Images/2015/10/19/2e11b254ea4d4fc5bb3fdaf6eac041a0_18.jpg", "site_section": "http://www.aljazeera.com/topics/categories/politics.html", "section_title": "Politics - Al Jazeera English", "url": "http://www.aljazeera.com/news/2015/10/palestinians-israel-arrests-151019095911072.html", "country": "US", "title": "Arrests of Palestinians in Israel soar amid crackdown", "performance_score": 3, "site": "aljazeera.com", "participants_count": 1, "title_full": "Arrests of Palestinians in Israel soar amid crackdown - Al Jazeera English", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:04:00.000+03:00", "replies_count": 0, "uuid": "90a07aca03ccca523d838867610e0a9fe1afb20d"}, "author": "aljazeera.com", "url": "http://www.aljazeera.com/news/2015/10/palestinians-israel-arrests-151019095911072.html", "ord_in_thread": 0, "title": "Arrests of Palestinians in Israel soar amid crackdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rights groups have decried Israeli measures as the government continues to crack down on Palestinian citizens of Israel amid unrest across the occupied Palestinian territory and Israel.\nOn Monday, police arrested eight activists for their participation in protests last week in Umm al-Fahm, a Palestinian town in northern Israel, local media reported.\nIn one week, Israeli police arrested more than 100 demonstrators and activists during protests in Palestinian areas, according to Adalah, a Haifa-based legal centre for Palestinians in Israel.\nNadim Nashif, director of Baladna, a Haifa-based Palestinian youth advocacy group, said Israel has launched \"a harsh crackdown\".\n\"Like during the Second Intifada, Israel wants us to be scared, shut up and not participate. But our participation has been big,\" he told Al Jazeera.\nSince the beginning of the month, protests have been held in Nazareth, Haifa, Acre, Sakhnin, Tamra and Arrabeh, among other Palestinian communities in Israel.\n\"The uprising is everywhere,\" Nashif said. An estimated 1.7 million Palestinians carry Israeli citizenship and live in cities, towns and villages across the country. A diverse community of Muslims, Christians and Druze, they are targeted by more than 50 laws that muzzle their political expression and limit their access to state resources, according to Adalah.\nThe demonstrations come as tensions soar, with clashes between Israeli forces and Palestinians in the occupied West Bank, including East Jerusalem, and the Gaza Strip increasing in frequency.\nRELATED: Israel's democracy: 'Theatre of the absurd'\nLast Tuesday, more than 20,000 people gathered in Sakhnin, a town in the Galilee region in northern Israel, and protested in support of their compatriots in the West Bank and against Israeli incursions into the Al-Aqsa Mosque compound.\nMinors arrested\nAmong those arrested this month were minors - many of whom were denied access to legal counsel - and dozens of influential activists who were detained as a \"preventative\" measure, Adalah said.\nSpeaking to Al Jazeera, Israeli police spokesman Micky Rosenfeld said only that \"rioters were arrested in Arab villages in northern Israel\".\nRELATED: Palestinians in Israel camp for Right of Return\nThe government has also placed a Palestinian citizen of Israel - a 19-year-old woman from Nazareth - in administrative detention, a practice in which suspects are held on \"secret evidence\" without charges or trial.\nIsraeli authorities regularly use administrative detention to imprison Palestinians in the West Bank, but this instance is the first time it was used against a Palestinian citizen of Israel since 2001.\nIsraeli Interior Minister Silvan Shalom has also announced plans to revoke the citizenship of two Palestinian citizens of Israel accused of attacking Israelis earlier this month. Neither of the suspects have been convicted of a crime.\nLeadership targeted\nOn Sunday, at least four major Israeli cities - including Tel Aviv - banned Arab workers from schools.\nIsraeli Prime Minister Benjamin Netanyahu's cabinet also approved a bill that effectively permits security forces to search anyone on the street - a practice activists say is targeting Palestinians.\n\"The practice has been in place for a long time, but now there is a bill that hopes to give it the power of law,\" Amjad Iraqi, international advocacy coordinator at Adalah, told Al Jazeera.\n\" It basically protects police and allows them to not have to justify their search if a complaint is filed against them. They don't have to justify themselves.\"\nRELATED: 'Palestinian lives don't count here'\nThroughout the last week, Israeli police and military forces have been deployed in large numbers across the country.\n\"We see a huge presence of police in Arab towns inside Israel,\" Iraqi said, adding that they are \"not only in places where there are a lot of demonstrations\".\nMeanwhile, politicians have moved to ban or punish Palestinian parties and movements that protest Israeli policies towards the Palestinians.\nNetanyahu has moved to outlaw the northern branch of the Islamic Movement , a political group that does not recognise Israel and calls for the Palestinian minority to boycott its elections.\nOn Sunday, Netanyahu claimed that the group is the \"chief inciter\" of violence at the Al-Aqsa Mosque compound, adding that he will target \"its financial resources\".", "external_links": ["http://www.haaretz.com/israel-news/.premium-1.680703", "http://www.jpost.com/Arab-Israeli-Conflict/Shalom-revokes-citizenship-from-two-more-terrorists-426088", "http://www.adalah.org/en/content/view/8652", "http://www.adalah.org/en/content/view/7771"], "published": "2015-10-20T00:04:00.000+03:00", "crawled": "2015-10-19T19:10:55.293+03:00", "highlightTitle": ""}