{"organizations": [], "uuid": "7dd8bdd67ffbed3c8acab4bc23625bdb341d0ee9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-8c850d99c20da22ce9878c0e87f65159.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/clinton-wins-endorsement-from-major-public-sector-union-afscme/article/2574803?custom_click=rss", "country": "US", "title": "Clinton wins endorsement from major public-sector union AFSCME", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Clinton wins endorsement from major public-sector union AFSCME | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:41:00.000+03:00", "replies_count": 0, "uuid": "7dd8bdd67ffbed3c8acab4bc23625bdb341d0ee9"}, "author": "Sean Higgins", "url": "http://www.washingtonexaminer.com/clinton-wins-endorsement-from-major-public-sector-union-afscme/article/2574803?custom_click=rss", "ord_in_thread": 0, "title": "Clinton wins endorsement from major public-sector union AFSCME", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The American Federation of State, County and Municipal Employees gave its 2016 presidential endorsement to Democratic front-runner Hillary Clinton Friday, arguing that she has the best chance to win the election of any candidate on labor's side.\nThe 1.6 million-member union's backing will help Clinton fend off the challenge from Sen. Bernie Sanders, I-Vt., who has drawn much of his support from labor's rank-and-file.\n\"Members want a candidate who will make it easier instead of harder to join together in strong unions and stand together for wages and benefits that can sustain our families,\" AFSCME President Lee Saunders said in an emailed statement Friday. \"What we also heard was AFSCME members want the candidate who will be the most effective champion for working families, and who will be able to deliver a victory in this critically important election. AFSCME members believe that candidate is Hillary Clinton.\"\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ Clinton has had tense relations with some union leaders, but has been working to mend ties . Earlier this month, she came out in opposition of the Trans-Pacific Partnership, a major trade deal backed by President Obama but opposed by labor organizations. She also has moved leftward in her rhetoric, adopting the economic populism used by union favorites such as Sen. Elizabeth Warren, D-Mass.\n  Obama says GOP field like Grumpy Cat He compared GOP climate change denials to a sick patient who refuses to listen to his doctors.\nBy Nicole Duran • 10/23/15 5:43 PM \"Thanks for your support, brothers & sisters of AFSCME. You never stop fighting for working families, & I'll never stop fighting for you. –H,\" Clinton tweeted in response to the announcement. She previously won the endorsements of the American Federation of Teachers, the National Education Association and International Association of Machinists.\nShe nevertheless faces tough opposition from Sanders in terms of winning union support. In his announcement, Saunders made a point of saying the union engaged in an exhaustive internal process before making the decision.\n\"The next president will make decisions that could make or break the ability of working people across America to sustain their families. That's why we spent the last six months engaged in the most member-focused, in-depth and transparent endorsement process AFSCME has ever undertaken,\" he said.\nMany nevertheless apparently preferred Sanders. When the union leader spoke at an AFSCME local branch in Washington state earlier this month, Sanders' name was the only one to draw loud, sustained applause from the audience. \"Is that some kind of message? Is that some kind of message that I'm hearing?\" Saunders joked .\nThe group Labor for Bernie expressed disappointment and questioned whether a true majority had expressed support for Clinton. It emailed reporters a message from the union's Council 28, which represents members in Washington state.\nAlso from the Washington Examiner Press yawns, declares Hillary Clinton 'won' the Benghazi hearing Both left and right-leaning media appear to share the sentiment that Clinton \"won\" the Benghazi hearing.\nBy Becket Adams • 10/23/15 5:31 PM \"The decision on which candidate AFSCME supports will be one of the most important political decisions our organization makes. It's important that the decision be made democratically and that our members are actively engaged in the process. A top-down decision will send the wrong message to our members. We in Council 28… are against AFSCME doing an early endorsement for president of the United States. Our membership has NOT coalesced around single candidate. Now is not the time for us to be divided. Now is the time to focus on the issues that unite us.\"\nRepublicans had a different take, arguing the endorsement shows that Clinton now owes organized labor.\n\"Hillary Clinton is now officially beholden to the big government union bosses who routinely put their special interests ahead of the hard-working taxpayers. With their endorsement, it's clear AFSCME is counting on Hillary Clinton to block common-sense efforts to rein in Washington's runaway wasteful spending that is mortgaging our children's future,\" Republican National Committee Chairman Reince Priebus said.\nTop Story Justice won't charge IRS' Lois Lerner The   matter.\nBy Curt Mills • 10/23/15 3:04 PM", "external_links": [], "published": "2015-10-23T16:41:00.000+03:00", "crawled": "2015-10-24T01:01:48.074+03:00", "highlightTitle": ""}