{"organizations": [], "uuid": "814184e5ec1f8a123701504a05253e18d09ffb9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1006/20151006__mascots_legislature~p1.jpg", "site_section": "http://www.denverpost.com/nationalpolitics", "section_title": "National Politics - The Denver Post", "url": "http://www.denverpost.com/news/ci_28929723/colorado-governor-creates-task-force-native-american-mascots", "country": "US", "title": "Colorado governor creates task force on American Indian mascots", "performance_score": 0, "site": "denverpost.com", "participants_count": 6, "title_full": "Colorado governor creates task force on American Indian mascots - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T10:28:00.000+03:00", "replies_count": 7, "uuid": "929378311b4bd20508961f18160d2a01e28acaed"}, "author": "Joey Bunch", "url": "http://www.denverpost.com/news/ci_28929723/colorado-governor-creates-task-force-native-american-mascots#post-0", "ord_in_thread": 0, "title": "Colorado governor creates task force on American Indian mascots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gov. John Hickenlooper signed an executive order Tuesday creating a commission to discuss American Indian high school mascots.\nThe group would include tribes, local community members and state agencies to find common ground, said Ernest House Jr., executive director of the Colorado Office of Indian Affairs.\nIn the last legislative session, a bill carried by state Reps. Joe Salazar, D-Thornton, and Jovan Melton, D-Aurora, that would have required tribal approval for public schools to continue using American Indian mascots passed in the Democrat-led state House but was killed by a Republican-led Senate committee.\nErlidawn Roy representing the Meskwaki, Ojibwe, Laguna Pueblo, and the Isleta Pueblo tribes, writes a message \"I am not your mascot\" on the face of LacyJay Lefthandbull, 7, from the Apache, Pueblo, and Lakota tribes, showing their support for HB15-1165. The House Education Committee hears testimony on HB15-1165 at the Colorado State Capitol, a bill that would require Colorado's public schools to get approval from American Indian tribes for use of American Indian mascots and names. ( Kathryn Scott Osler, The Denver Post ) \"When Rep. Melton and I addressed this issue last legislative session, we met with members of the American Indian community who were concerned that their heritage was being disrespected,\" Salazar said Tuesday. \"With the governor's apology for the Sand Creek Massacre last year, and this important step today, we have made small but significant steps as a state in directly addressing these symbols of prejudice.\"", "external_links": ["http://extras.mnginteractive.com/live/media/site36/2015/1006/20151006__mascots_legislature~p1.jpg"], "published": "2015-10-06T10:28:00.000+03:00", "crawled": "2015-10-07T00:40:13.285+03:00", "highlightTitle": ""}