{"organizations": [], "uuid": "2572b4d2c5f0ca9056af2da5838bd9c36f79114f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00144/review-sees-further-improvements-to-recruit-training.htm", "country": "US", "title": "Review sees further improvements to recruit training", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Review sees further improvements to recruit training", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T01:09:00.000+03:00", "replies_count": 0, "uuid": "2572b4d2c5f0ca9056af2da5838bd9c36f79114f"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00144/review-sees-further-improvements-to-recruit-training.htm", "ord_in_thread": 0, "title": "Review sees further improvements to recruit training", "locations": ["New Zealand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Review sees further improvements to recruit training Thursday, 8 October 2015, 11:09 am Press Release: New Zealand Defence Force \nReview sees further improvements to recruit training \nA Ministry of Defence review of the New Zealand Defence Force (NZDF) has highlighted positive initial training for recruits. \nThe Assessing the Quality of Recruit Training in the New Zealand Defence Force review, released today by Secretary of Defence Helene Quilter and Chief of Defence Force Lieutenant-General (LT GEN) Tim Keating, found that most new recruits rate their early training as a positive experience, and has identified ways to make further improvements. \nUndertaken by the Ministry of Defence’s Evaluation Division, the review follows the 2014 Ministry of Defence report Maximising Opportunities for Women in the New Zealand Defence Force. The review looked into what aspects of the initial training for new recruits were working well and how the system could be improved. \nThe review found that while training programmes are demanding, both physically and mentally, most recruits find the experience positive rating instructors as being fair, skilled, trusted, encouraging, and recognising and rewarding achievement. \nThe Secretary of Defence, Ms. Quilter, said: “We were pleased that as a result of this review, the services are actively focused on aspects of recruit training which will further improve how the Defence Force looks after its people.” \nLT GEN Keating welcomed the independent assessment done by the Ministry. \n“Overall I am pleased with the quality of recruit training for the Navy, Army, and Air Force. Areas for improvement are being addressed by the three services, and I’ve directed service Chiefs do this as a priority,” LT GEN Keating said. \n”Having well-trained and cared for people is vital for the NZDF to be able to deliver on its missions.” \nThe review makes 64 recommendations, with action already being undertaken on 80 percent of these. \nOther findings include: \n• initial training is providing new recruits with the skills and knowledge they need \n• low recruit to instructor ratios means individuals can get one-on-one help if needed \n• New Zealand graduation rates compare favourably to militaries in the United Kingdom, Australia, and the United States. \nAreas identified for improvement were around the selection, training, and supervision of instructors. \nAs part of the review more than 600 recruits were surveyed across the Navy, Army, and Air Force, with instructors and other NZDF personnel participating in focus groups and interviews. \nThe Ministry of Defence Evaluation Division plans to conduct another review of recruit training in 24 months. \nThe full report is available here . \nENDS", "external_links": [], "published": "2015-10-08T01:09:00.000+03:00", "crawled": "2015-10-08T04:47:11.877+03:00", "highlightTitle": ""}