{"organizations": ["Federation of Thai Industries"], "uuid": "d5c8e6ef86b694f1ec59582e585aba3994fead01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/images/default.gif", "site_section": "http://www.nationmultimedia.com/home/rss/politics.rss", "section_title": "NationMultimedia.com - Politics", "url": "http://www.nationmultimedia.com/politics/More-clarity-needed-on-alternative-energy-developm-30270504.html", "country": "TH", "title": "More clarity needed on alternative energy development", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "More clarity needed on alternative energy development", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:00:00.000+03:00", "replies_count": 0, "uuid": "d5c8e6ef86b694f1ec59582e585aba3994fead01"}, "author": "", "url": "http://www.nationmultimedia.com/politics/More-clarity-needed-on-alternative-energy-developm-30270504.html", "ord_in_thread": 0, "title": "More clarity needed on alternative energy development", "locations": ["Thailand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » politics » More clarity needed on alternative energy development BURNING ISSUE More clarity needed on alternative energy development SASITHORN ONGDEE sasithorn@nationgroup.com October 9, 2015 1:00 am ALTERNATIVE energy development in Thailand is going to be in jeopardy if the government does not have clarity on what to promote, and how to do so. About 50 biomass power plants are the hardest hit because they are in areas where there are no transmission lines could betray the government's lack of consistency and clarity in its policy. The investors said the state authority had stopped buying electricity from biomass power plants for two years. Until the beginning of this week, a group of investors in the alternative-energy industry, on behalf of the Federation of Thai Industries, urged the government to focus more on supporting and promoting power plants fuelled by alternative sources. According to the Renewable Energy Development Plan (REDP), Thailand has set itself many targets, such as reducing the energy-import bill to Bt460 billion a year, promoting private investments worth more than Bt380 billion, and generating employment for more than 40,000 people. However, the state's investments in the construction of fossil-fuelled power plants are expected to decline by no less than Bt100 billion, equivalent to generating 3,800 megawatts. This is a contradiction when one considers the aim of the government in conceiving the REDP for a 15-year period, from 2008 to 2022. Under the plan, Thailand was set a target of renewable energy accounting for 25 per cent of total energy consumption, up from 15 per cent as targeted previously. All types of alternative energy development - solar cells, biomass, biogas, wind turbines, waste-to-energy, ethanol to biodiesel - currently fall short of what the government has targeted. The government has not yet prepared transmission lines. This is something it must do so that the investors can have a clear idea of how to proceed. Apart from the lack of transmission lines, renewable-energy operators also complained about factors limiting the private sector, such as too-strict regulations in city planning, application of power purchase agreements (PPAs), the public-private partnership law, and the competitive tendering process. Of course, wind and solar power plants are not conducive for distribution of wealth among the Thai people as most of the technology and equipment needs to be imported - which means most of the invested capital will go to technology owners outside the country. Rather than that, what we have seen so far are skyrocketing share prices of those listed companies that announced they were awarded PPAs by the authorities for installing solar- or wind-power plants. The government typically has to bear a higher cost to purchase electricity generated by wind and solar compared with power generated by fossil-fuel-driven plants, in order to ensure that people's electricity bills are not excessively inflated. In short, wealth is mostly distributed among a few groups of those who are involved with the PPAs, operators, and stock investors. However, the biomass power plant could be a choice to boost the grass roots if the government seriously aims to support it, and it can also help the country reduce its spending on imported fossil fuels in the long term. Biomass technology developed in Thailand could be fine-tuned for greater efficiency and could be exported to other Asean countries as one of the country's champion products in the near future. 335 Viewed", "external_links": [], "published": "2015-10-08T21:00:00.000+03:00", "crawled": "2015-10-09T11:10:15.637+03:00", "highlightTitle": ""}