{"organizations": [], "uuid": "b245e8755b0bdd3ae6e0be4d2084dbf678510d31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30293600/chevron-and-the-initiative-for-a-competitive-inner-city-icic-awards-enlightened-inc-the-2015-dorothy-a-terrell-community-impact-award", "country": "US", "title": "Chevron and The Initiative for a Competitive Inner City (ICIC) Awards Enlightened, Inc. The 2015 Dorothy A. Terrell Community Impact Award", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Chevron and The Initiative for a Competitive Inner City (ICIC) Awards Enlightened, Inc. The 2015 Dorothy A. Terrell Community Impact Award - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "b245e8755b0bdd3ae6e0be4d2084dbf678510d31"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30293600/chevron-and-the-initiative-for-a-competitive-inner-city-icic-awards-enlightened-inc-the-2015-dorothy-a-terrell-community-impact-award", "ord_in_thread": 0, "title": "Chevron and The Initiative for a Competitive Inner City (ICIC) Awards Enlightened, Inc. The 2015 Dorothy A. Terrell Community Impact Award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Enlightened, Inc.\nWASHINGTON , Oct. 19, 2015 /PRNewswire/ -- Chevron and The Initiative for a Competitive Inner City (ICIC) presented Enlightened, Inc. with the 2015 Dorothy A. Terrell Community Impact Award during the annual ICIC Inner City 100 Awards.\nICIC and key sponsor, Chevron Corporation, recognized only one company, Enlightened, Inc., for outstanding community impact with the Dorothy A. Terrell Community Impact Award, named in honor of ICIC's former President and CEO. Enlightened was selected for its impact on the community, its record of providing quality jobs and dynamic civic engagement over the years.\nICIC's Inner City 100 program recognizes successful inner city businesses and their CEOs as role models for entrepreneurship, innovative business practices and job creation in America's urban communities. Each year, ICIC works with a national network of nominating partners to identify, rank and spotlight rapidly-growing urban businesses, and the top 100 – determined by revenue growth – are honored on the Inner City 100 list published in FORTUNE Magazine .\nEnlightened was featured in a video which shared comments from CEO and President, Antwanye E. Ford, CFO and Vice President Andre Rogers on their path to becoming national business leaders and sincere passion for changing the lives of those in the community they employ as they provide jobs, sponsorships and scholarships. The video also highlighted various employees who share personal reflections on working with the company over the years.\n\"Corporate citizenship is the foundation of the best and brightest companies produced by America. When you're able to meet the demands of clients, while adding value to the lives of our citizens, you become a genuine member of the fabric of the community. The ability we, at Enlightened, have to change lives motivates us all to reach higher heights which allow us to create more opportunities in the form of jobs and solutions for our region,\" shared by CEO and President, Antwanye E. Ford.\nInitiative for a Competitive Inner City (ICIC)\nICIC is a national nonprofit founded in 1994 by Harvard Business School professor Michael E. Porter . ICIC's mission is to promote economic prosperity in America's inner cities through private sector investment that leads to jobs, income and wealth creation for local residents. Through its research on inner city economies, ICIC provides businesses, governments and investors with the most comprehensive and actionable information in the field about urban market opportunities. The organization supports urban businesses through the Inner City 100 , Inner City Capital Connections and the Goldman Sachs 10,000 Small Businesses programs. Learn more at www.icic.org or @icicorg .\nAbout Enlightened\nEnlightened is an award winning company that provides Cyber Security, IT and management solutions to resolve complex business problems for federal, state, and local government agencies. Enlightened holds GSA IT-70 and MOBIS schedule contracts, and is certified as a HUBZone and Small Business by the Small Business Administration. For more information please visit www.enlightened.com .\n releases/chevron-and-the-initiative-for-a-competitive-inner-city-icic-awards-enlightened-inc-the-2015-dorothy-a-terrell-community-impact-award-300161587.html\n ", "external_links": ["http://www.icic.org/", "http://www.prnewswire.com/news-releases/chevron-and-the-initiative-for-a-competitive-inner-city-icic-awards-enlightened-inc-the-2015-dorothy-a-terrell-community-impact-award-300161587.html", "http://www.xmlnews.org/ns/", "https://twitter.com/icicorg", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH30554&Transmission_Id=201510190915PR_NEWS_USPR_____PH30554&DateId=20151019", "http://www.icic.org/resources-for-inner-city-ceos/inner-city-100-programs", "http://www.icic.org/resources-for-inner-city-ceos/inner-city-capital-connections", "http://10ksbapply.com/", "http://www.enlightened.com/"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T17:08:42.820+03:00", "highlightTitle": ""}