{"organizations": [], "uuid": "c98a4d346cdd2fa9c2eb80618e2011bfea0d0c04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/CHOOSE_CHICAGO.jpg?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=oENUtMqCWbmXnSdw9Ujb0bb98yQ%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/editorials-opinion/7/71/1023539/editorial-springfield-stalemate-shoots-rauners-agenda-foot", "country": "US", "title": "Editorial: State budget fight making it harder to choose Chicago |", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Editorial: State budget fight making it harder to choose Chicago | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T02:11:00.000+03:00", "replies_count": 0, "uuid": "c98a4d346cdd2fa9c2eb80618e2011bfea0d0c04"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/editorials-opinion/7/71/1023539/editorial-springfield-stalemate-shoots-rauners-agenda-foot", "ord_in_thread": 0, "title": "Editorial: State budget fight making it harder to choose Chicago |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @csteditorials\nBruce Rauner first visited with the Chicago Sun-Times editorial board a few years ago as chairman of Choose Chicago, the city’s convention and tourism bureau.\nRauner, who was not yet running for governor, touted Choose Chicago as a big part of the solution to Chicago’s financial crisis. The more the city pumped up tourism and conventions, he said, the less it would have to hike taxes to pay its crazy high bills. Even then, Rauner hated taxes.\nBut now, as governor, Rauner has shot his own pro-business agenda right in the foot. We can only hope that he and the state Legislature feel the pain and hear the outcry and finally do what they should have done months ago — pass a budget.\nEDITORIAL\nFollow @csteditorials\nLate last week, Choose Chicago announced that it is scaling way back because a big chunk of its funding — $7.2 million — is being held hostage by the governor and Legislature’s failure to agree on a budget. The bureau is cutting staff by 26 percent, closing foreign offices and even shutting down its visitor center in the Chicago Cultural Center.\nLocal hotel and restaurant operators, as you might expect, are more than a little worried, as we all should be. A big chunk of Chicago’s economic base is the spending from some 50 million visitors a year.\nHere’s hoping that every big business owner goes to Springfield and kicks up a fuss, because nobody down there has listened to the heart-felt pleas from advocates for people with much less clout — the physically disabled, the mentally ill, the drug addicted, the elderly and poor children.\nSince mid-summer, hundreds of social service agencies that rely on state funding have felt the squeeze as Rauner and the Legislature — most specifically House Speaker Mike Madigan — fail to hash out their differences and approve a new state spending plan. Social service agencies have slashed their budgets and laid off workers. They have turned away new clients. They have continued to serve old clients only by looking away from the unpaid bills.\nThis editorial page receives a regular flow of letters and unsolicited op-eds from one group after the next deploring the funding cuts and describing the suffering. We publish many of them, but they keep coming in.\nTypical is a recent emailed press release from Lisa Christensen Gee, a policy analyst with Voices for Illinois Children, decrying the state’s failure to provide basic funding for after-school programs and efforts to curtail domestic violence and sudden infant death syndrome.\nThis, she writes “is causing widespread damage to the state, with children, seniors and those with disabilities the hardest hit.”\nBut who listens to the poor? Who listens to children?\nNow, as the impact of this absurd Springfield stalemate spreads to the business community and the middle class, might something finally give? Transit agencies, including the CTA, are sending out signals that their ability to avoid big fare increases will depend greatly on state funding, which is entirely up in the air.\nIt is not enough that Rauner and the Legislature one day pass a state budget. Time is of the essence. It has to happen now. Each day that goes by without resolution does harm to the people of our state, and to our state’s ability to compete.\nChoose Chicago eventually might get that $7.2 million in earmarked hotel tax revenue, but they cannot wait. First, they cut short a summer tourism ad campaign. Then they suspended all foreign sales trips. And now they plan to lay off 28 people and close offices in Canada and Mexico.\n“If the statutorily mandated funding is not fully restored to Choose Chicago, everything we have worked for and successfully achieved over the last four years will literally become undone overnight,” Choose Chicago Chair Desiree Rogers said in a statement to Crain’s Chicago Business.\nThat’s no way to run a business.\nBut, then, this is no way to run a state.\nFollow the Editorial Board on Twitter: Follow @csteditorials\nTweets by @CSTeditorials", "external_links": ["https://twitter.com/csteditorials", "https://twitter.com/CSTeditorials"], "published": "2015-10-14T02:11:00.000+03:00", "crawled": "2015-10-14T10:11:02.065+03:00", "highlightTitle": ""}