{"organizations": [], "uuid": "fe672cd7c988a35c50182653017aa58433b509e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/jwest_wicked_600.jpg", "site_section": "http://www.philly.com/philly/news/politics", "section_title": "Politics - Local, U.S., and world political news and analysis", "url": "http://www.philly.com/philly/news/politics/20151009_Political_texts_land_in_wrong_hands_in_W__Deptford.html", "country": "US", "title": "Political texts land in wrong hands in W. Deptford", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Political texts land in wrong hands in W. Deptford", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe672cd7c988a35c50182653017aa58433b509e9"}, "author": "Angelo Fichera,", "url": "http://www.philly.com/philly/news/politics/20151009_Political_texts_land_in_wrong_hands_in_W__Deptford.html", "ord_in_thread": 0, "title": "Political texts land in wrong hands in W. Deptford", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A campaign-fueled text-message thread among close Republican allies in a Gloucester County township, inadvertently sent to an unintended recipient, has set a bitter tone for an election that once again will decide which party runs the town.\nAnd it wasn't without a bit of inspiration from The Wizard of Oz .\nThe messages, exchanged by a handful of West Deptford Republicans, centered on planning a former mayor's campaign and attacking the opposition. Photos swapped included depictions of Democratic Mayor Denice DiCarlo - dubbed by one participant \"one ugly chic\" - as the Wicked Witch of the West (West Deptford, an image noted). The faces of her two fellow Democratic committee members were imposed on the flying monkeys.\n\"What is the wicked one planning w her entourage?\" one in the group asked.\nAnother photo of DiCarlo as the witch appeared to show her with a black eye and a missing tooth. Those in the message thread playfully assigned one another to characters in the movie, casting the town's police chief as \"one of the munchkins.\"\nIt was not a conversation expected for public eyes - or a public meeting.\nBut on Wednesday night, the messages purportedly sent throughout September were revealed at a committee meeting when the town's solicitor, Tim Scaffidi, reminded the governing body that township-owned devices were to be used for official business - not \"inappropriate messages\" or political activity.\nThe messages, according to Scaffidi, were sent to the cellphone number belonging to the town administrator - a post formerly held by Brandon Umba, at one time a Republican campaign manager, who left the job in April. The messages were instead quietly received by Deborah Turner-Fox, the town's current administrator.\n\"Township Committee may want to consider establishing a new policy and procedure about usage of township-issued cellphones,\" Scaffidi wrote in a memo to the committee Wednesday.\nIn addition to personal jabs at opponents and others, the group joked with one another and critiqued copies of election lawn signs, sometimes debating minor language. Among the contacts identified by name in the messages were Township Committee members Jerry Maher and Jeff Hansen, the two Republicans on the five-member board. Another phone number in the group, according to DiCarlo, belongs to former Mayor Ray Chintall - who lost his committee seat last year and is running again in November against DiCarlo.\n\"It's disappointing. The comments are disparaging; they're inappropriate,\" DiCarlo said Thursday. \"One of the comments made last night publicly is that we expect better from our children; we expect our children not to act like this.\"\nWest Deptford's politics have been particularly contentious in recent years as the parties have wrestled for control. The Republican majority, gained after nearly two decades of Democratic supremacy, subsisted for three years before the 2014 election again reversed course.\nChintall declined to comment, saying he was not at Wednesday's meeting and was unaware of the specifics of the alleged messages - though he remarked that if messages were sent to Umba's previous number, there was \"a responsibility on the person on the other end of that to advise that this is no longer\" Umba's phone. Maher did not return a request for comment. Hansen could not be reached.\nDiCarlo said she was especially concerned about closed-session information surrounding a retention pond being freely discussed in the thread, as well as a proposal to stir controversy over it.\nThe exchange regarding the closed session would not be the first time that South Jersey officials have come under scrutiny for discussing business via phone.\nIn 2011, Burlington County Prosecutor Robert D. Bernardi found that Evesham officials had violated the state open meetings law by discussing official business on their smartphones. The town later adopted a ban on talking about municipal business through emails, text messages, and other electronic communications if the messages were among a majority of the council members.\nThe publicizing of the messages and photos in West Deptford dampened what was otherwise a successful night for the Republican committee members. At the same meeting, an antinepotism measure they had for months advocated passed unanimously. They raised hopes for the ordinance earlier this year, after Democratic Deputy Mayor James Mehaffey's sister-in-law was hired as a deputy clerk. (She quickly resigned.)\nScaffidi reported that the new administrator began receiving the messages Sept. 12. He said in an interview that it was the only township phone known to be involved and that he advised Turner-Fox not to respond, but to save the messages because the phone was a municipal device.\n\"I find the texts to be inappropriate. They're not related to township business,\" he said. While he was still reviewing whether there could be legal ramifications stemming from the messages, he said, he was \"not of the opinion that they violate any current state laws.\"\nOfficials said the apparent phone confusion won't continue, as the administrator is no longer using the device.\nafichera@philly.com\n856-779-3917\n@AJFichera\nwww.philly.com/glouco", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-11T07:59:03.434+03:00", "highlightTitle": ""}