{"organizations": [], "uuid": "f763c6b2f280415e719fab6ebe308f42b6486211", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151021123351-02-biden-1021-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/10/21/politics/joe-biden-bernie-sanders-2016-election/index.html", "country": "US", "title": "Biden delivers subtle jab at Sanders, too", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Biden delivers subtle jab at Sanders, too - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "f763c6b2f280415e719fab6ebe308f42b6486211"}, "author": "Dan Merica", "url": "http://www.cnn.com/2015/10/21/politics/joe-biden-bernie-sanders-2016-election/index.html", "ord_in_thread": 0, "title": "Biden delivers subtle jab at Sanders, too", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights \"I don't believe, like some do, that it is naive to talk to Republicans,\" Joe Biden said That line appears very clearly directed at Bernie Sanders Washington (CNN) When Vice President Joe Biden announced Wednesday that he would not run for president, he did so with a very clear message for Hillary Clinton.\nHe faulted some Democrats who \"look at Republicans as our enemies.\"\nThe line, which Biden also used on Tuesday , is a direct knock against Clinton, who described Republicans as among her enemies at the first Democratic primary debate earlier this month.\nBut that was not the only subtle message the vice president had for a 2016 Democrat on Wednesday.\nShortly before his line admonishing labeling Republicans \"enemies,\" Biden said, \"I don't believe, like some do, that it is naive to talk to Republicans.\"\nRead More That appears very clearly directed at Bernie Sanders, the independent Vermont senator who has repeatedly called President Barack Obama naive for believing Republicans wanted to work with him when he came into office in 2009.\nAt an August 24 town hall in New Hampshire, Sanders told the audience that \"the biggest mistake Barack Obama made\" was not keeping his supporters together after his 2008 election and thinking that Republicans wanted to work with him.\n\"What he said in so many words was, 'Thank you so much for electing me to be president, but I will take it from here. I will go forward and I will negotiate with (House Speaker John) Boehner and (Senate Majority Leader) Mitch McConnell and the Republicans,'\" Sanders said. \"He did this because he is a decent guy and he thought naively that Republicans really wanted to work or negotiate compromises. Truth is, they never, ever did.\"\nSanders does not just use the answer in rallies, either.\nThe sentiment of Obama being naive to assume Republicans wanted to work with him has became Sanders' fallback answer when asked about how he would be different than Obama and how he would accomplish some of the legislative priorities the president failed to do.\nIn a September interview with CNN, Sanders said, Obama \"had the illusion -- the mistake -- of believing that he could sit down with Republicans and just work out some good compromises.\"\n\"That was never going to happen,\" Sanders said.\nIn an interview with David Axelrod, CNN senior political correspondent and a longtime top Obama aide, Sanders made a similar case. He said while Obama ran a \"brilliant campaign,\" he wasn't clear-eyed when he came into office.\n\"He thought he could walk into Capitol Hill and the Oval Office and sit down with John Boehner and Mitch McConnell and the Republicans and say, 'I can't get it all. You can't get it all. Let's work out something that's reasonable,' because he's a reasonable guy,\" Sanders said. \"These guys never had any intention of doing (serious) negotiating and compromising ... I think it took the President too long to fully appreciate that.\"\nSanders' campaign spokesman did not respond to request for comment.\nBiden made the case on Wednesday that working with Republicans is not \"naive,\" but necessary.\n\"I believe that we have to end the divisive partisan politics that is ripping this country apart, and I think we can,\" said Biden. \"For the sake of the country, we have to work together.\"\nBiden, however, has made his share of statements disparaging Republicans. During the 2012 presidential election, he told a largely black audience that then-Republican nominee Mitt Romney's policies were \"going to put y'all back in chains.\"\nAt a speech to Latino Victory Project PAC earlier this month, Biden said that Republicans were administering a \"beating\" to Hispanics . Biden also compared the Republican Party to the Know-Nothing Party, a 19th-century political party that was anti-Catholic and anti-immigration.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T01:44:03.166+03:00", "highlightTitle": ""}