{"organizations": [], "uuid": "894f1d778d52ae07f1dd9295177a8c245685f8bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcci.com", "main_image": "http://www.kcci.com/image/view/-/35644918/highRes/2/-/maxh/630/maxw/1200/-/cda1jm/-/Donald-Trump-at-mic-gif.gif", "site_section": "http://www.kcci.com/9358052?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.kcci.com/politics/trump-refugees-could-launch-coup-in-us/35638694", "country": "US", "title": "Trump: Syrian refugees could stage coup in U.S.", "performance_score": 0, "site": "kcci.com", "participants_count": 0, "title_full": "Trump: Syrian refugees could stage coup in U.S.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T09:30:00.000+03:00", "replies_count": 0, "uuid": "894f1d778d52ae07f1dd9295177a8c245685f8bf"}, "author": "", "url": "http://www.kcci.com/politics/trump-refugees-could-launch-coup-in-us/35638694", "ord_in_thread": 0, "title": "Trump: Syrian refugees could stage coup in U.S.", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton"], "text": "Clinton pledges action for LGBT... \n\"This could be one of the great military coups of all time if they send them to our country -- young, strong people and they turn out to be ISIS,\" he told Fox News' Eric Bolling. \"Now, probably that won't happen, but some of them definitely in my opinion will be ISIS.\" \nTrump said later Saturday that bringing in more refugees could have long-term effects. \n\"This could be the ultimate Trojan horse. This one could be written about for a long time,\" he said at a campaign event in Franklin, Tennessee. \"They probably think, 'This is going to be easy. We will send all these ISIS people.' So a big percentage could be them.\" \nThe Republican front-runner said President Barack Obama wants to take up to 200,000 Syrian refugees. \n\"Obama wants to -- listen to this -- he wants to take in 200,000,\" he added. \"You know, 200,000. That's like an army. Now I'm looking the other day. It's all men. Like, where are the women? They're very strong men. Why aren't they back there fighting for their country?\" \nIt was unclear where Trump got the 200,000 figure, and a message left with the Trump campaign Saturday afternoon was not immediately returned. \nTrump also said the U.S. is \"totally unprepared\" to handle the possible challenges. He also reiterated his pledge to send the refugees back to Syria if elected president. \n\"If they come in, and if I win, they're going back. They're going back,\" Trump said to applause. He called for the creation of a \"safe zone\" in Syria where the refugees could settle. \n\"We have to help them in that sense, but we don't have to help them by taking them into our country,\" Trump said. \nLast month, Obama ordered his administration to \"scale up\" the number of Syrian refugees admitted to the United States, directing his team to prepare for at least 10,000 for this fiscal year, which began on Thursday. The 10,000 Syrian refugees would be allocated out of a U.S. quota of 75,000 refugee admissions from around the world. \nA Senate aide last month said Secretary of State John Kerry told senators that the administration would \"seek an additional increase beyond\" the worldwide total, potentially as high as 100,000. \nIn all, about 1,500 Syrian refugees have been admitted to the United States since the start of the Syrian conflict in 2011, the vast majority of them in the fiscal year that just ended. \nAlso in Saturday's Fox News interview, Trump cited areas where he could cut spending, citing the Department of Education and the Environmental Protection Agency in particular. He said Hillary Clinton, who he's criticized recently on the campaign trail over the controversy surrounding her use of a private email server while leading the State Department, has \"become very mean, very nasty.\" \n\"She's become a very different type of person,\" Trump said. \nBut despite the attacks from Clinton and other candidates, Trump told Bolling that he's having fun on the campaign trail. \n\"I'm having a good time, but I think a lot of other people aren't,\" he said.", "external_links": [], "published": "2015-10-04T09:30:00.000+03:00", "crawled": "2015-10-04T09:40:32.546+03:00", "highlightTitle": ""}