{"organizations": [], "uuid": "7c971b3bef6c898213da365160c63118b1211e3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dcinno.streetwise.co", "main_image": "http://wp.streetwise.co/wp-content/blogs.dir/2/files/2015/10/Screen-Shot-2015-10-21-at-1.09.39-PM1-630x386.png", "site_section": "http://inthecapital.streetwise.co//feed/", "section_title": "DC Inno | Washington DC Tech, City and Political News", "url": "http://dcinno.streetwise.co/2015/10/21/mayor-muriel-bowser-dc-tech-cto-search-civic-innovation-biz/", "country": "US", "title": "DC Mayor Talks Tech In London as Search for City CTO Continues", "performance_score": 0, "site": "streetwise.co", "participants_count": 1, "title_full": "DC Mayor Talks Tech In London as Search for City CTO Continues", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T20:43:00.000+03:00", "replies_count": 0, "uuid": "7c971b3bef6c898213da365160c63118b1211e3a"}, "author": "Ryan Ferguson", "url": "http://dcinno.streetwise.co/2015/10/21/mayor-muriel-bowser-dc-tech-cto-search-civic-innovation-biz/", "ord_in_thread": 0, "title": "DC Mayor Talks Tech In London as Search for City CTO Continues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "share Mayor Bowser at CityLab / Credit: Screenshot from YouTube \nMayor Muriel Bowser took to the global stage this week to trumpet the digital initiatives taking place in the District of Columbia. \nAt the CityLab conference in London, held by the Atlantic, Bloomberg Philanthropies and The Aspen Institute, Mayor Bowser voiced her support of open and transparent government, as well as using data to optimize how government works for the city’s residents. Related Why Mayor Bowser Offered 2 Companies $110M This Week \nBowser pointed to the District’s monthly statistics model that shows effectiveness in evaluating and approaching problems, as well as the commitment of past mayors to bring high speed internet to District residents as particular tech accomplishments. \nShe also emphasized the importance of using data analytics to manage both day-to-day operations like trash collection, and the long term vision for the city. “We get data points every single day on different issues, but it’s month to month and year to year what you’re measuring that makes the biggest difference,” Bowser said. 'We don’t produce data in a way that is digestible to the average person' \nAnd while the Mayor is committed to improving tech functions within government, she realizes that innovative solutions are often found in the private sector or from the public at large. And to solicit those solutions, government can’t just make date available, it must make it accessible. \n“We don’t produce data in a way that is digestible to the average person. So we ask everyone that works with us not just to produce dashboards that I can read or my city administrator can read, but how can the average person use that information to hold their government officials accountable, be it in budget or policy initiatives,” said the Mayor. \nThe other importance of open and accessible data, according to Bowser, is that government can’t hide behind favorable statistics while eschewing less flattering data. 'Data makes us have complicated discussions but it also helps us better direct our resources' \n“I think [accessible data] makes you have more complicated discussions. If everyone can see the same data, you can’t tell them that everything is all well if you see that while your city is growing you see your levels of poverty also increasing…so it makes us have complicated discussions but it also helps us better direct our resources.” \nBowser’s emphasis on government tech come at a challenging time for her administration’s Office of the Chief Technology Officer (OCTO). The District’s CTO, Tegene Baharu, resigned from the post earlier this month citing political and bureaucratic challenges. Without a leader to steer OCTO, the office will remain limited in what it can achieve. \nIf Bowser hopes to back up her commitment to technology, finding a top-rate CTO must be at the top of her list of priorities. And that means finding someone who isn’t scared away by politics and bureaucracy, as those are realities of government that aren’t going away any time soon. \nThe Mayor closed her remarks in London by making a pitch for the important position, and added that in looking for talent in her administration, she values people who are “not only smart about what they’re doing but willing to translate their knowledge to government workers.” \nFinding someone who fits the bill for the District’s top tech job may be the best place to start. \nVIDEO:", "external_links": [], "published": "2015-10-21T20:43:00.000+03:00", "crawled": "2015-10-21T22:13:28.541+03:00", "highlightTitle": ""}