{"organizations": [], "uuid": "ecb88b5421abe0bd580e1d4124938b241aa9f4c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "straitstimes.com.feedsportal.com", "main_image": "http://www.straitstimes.com/sites/default/files/styles/x_large/public/st_20150930_speaker30_1722087.jpg?itok=LEguUDQP", "site_section": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/index.rss", "section_title": "RSS Breaking News - Politics", "url": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/s/4a4691be/sc/28/l/0L0Sstraitstimes0N0Cpolitics0Chalimah0Eyacob0Eto0Ebe0Enominated0Eas0Espeaker0Eagain/story01.htm", "country": "SG", "title": "Halimah Yacob to be nominated as Speaker again,", "performance_score": 0, "site": "feedsportal.com", "participants_count": 1, "title_full": "Halimah Yacob to be nominated as Speaker again, Politics News & Top Stories - The Straits Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T13:00:00.000+03:00", "replies_count": 0, "uuid": "ecb88b5421abe0bd580e1d4124938b241aa9f4c7"}, "author": "straitstimes.com", "url": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/s/4a4691be/sc/28/l/0L0Sstraitstimes0N0Cpolitics0Chalimah0Eyacob0Eto0Ebe0Enominated0Eas0Espeaker0Eagain/story01.htm", "ord_in_thread": 0, "title": "Halimah Yacob to be nominated as Speaker again,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Singapore's first woman Speaker Halimah Yacob looks set to take on the role again when the new Parliament convenes in January.\nPrime Minister Lee Hsien Loong plans to nominate her for the 13th Parliament and, yesterday, Madam Halimah told The Straits Times she was grateful for the opportunity to preside again over \"robust debates\" in the House.\n\"Our Parliament plays an important role in our democracy, and I look forward to presiding over robust debates in the Chamber on weighty issues of importance to our people,\" she said.\nHer planned nomination was announced by the Prime Minister's Office (PMO) on Monday .\nFirst appointed in January 2013, she is assisted by two deputies in enforcing parliamentary rules and ensuring the orderly conduct of parliamentary business.\nThe trio have to be formally nominated and elected by Parliament when it opens in the new year.\nNo names have been given for the two Deputy Speakers but in the 12th Parliament, they were People's Action Party (PAP) MPs Charles Chong and Seah Kian Peng.\nThe PMO's statement also announced changes to other key parliamentary roles.\nMs Grace Fu, the incoming Minister for Culture, Community and Youth, has been appointed by PM Lee as the new Leader of the House in a historic move. She will be Singapore's first woman Leader of the House, taking over from Defence Minister Ng Eng Hen.\nAs Leader of the House, she will be responsible for arranging government business and the legislative programme of Parliament.\nHer deputy will be Mr Desmond Lee, the incoming Senior Minister of State for Home Affairs and National Development.\nMr Chan Chun Sing, the labour chief who is also Minister in the PMO, has been appointed the Government Whip. He takes over from Health Minister Gan Kim Yong.\nThe Government Whip keeps the ruling PAP MPs in line, and ensures there are enough PAP MPs in Parliament to support the party's position, especially in the passing of new laws.\nHis two deputies are Ms Sim Ann, Senior Minister of State for Finance and for Culture, Community and Youth, and Mr Sam Tan, Minister of State for Manpower and in the PMO.\nWalter Sim\nA version of this article appeared in the print edition of The Straits Times on September 30, 2015, with the headline 'Halimah Yacob to be nominated as Speaker again'. Print Edition | Subscribe Topics: SINGAPORE CABINET PARLIAMENT HALIMAH YACOB //str.sg/Z2Dk Copy", "external_links": ["http://www.sphsubscription.com.sg/eshop", "http://str.sg/Z2Dk"], "published": "2015-09-30T13:00:00.000+03:00", "crawled": "2015-10-01T07:38:58.773+03:00", "highlightTitle": ""}