{"organizations": [], "uuid": "86926648536a8b06774698d57a729193b77df3de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedenverchannel.com", "main_image": "http://sharing.thedenverchannel.com/sharescnn/photo/2015/10/02/1443494018_24666865_ver1.0_640_480.png", "site_section": "http://www.thedenverchannel.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100003&categoryId=20004", "section_title": "Politics | 7NEWS", "url": "http://www.thedenverchannel.com/newsy/primary-vs-caucus-how-states-pick-the-president", "country": "US", "title": "Primary vs. caucus: how states pick presidents", "performance_score": 0, "site": "thedenverchannel.com", "participants_count": 0, "title_full": "Primary vs. caucus: how states pick presidents", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:48:00.000+03:00", "replies_count": 0, "uuid": "86926648536a8b06774698d57a729193b77df3de"}, "author": "", "url": "http://www.thedenverchannel.com/newsy/primary-vs-caucus-how-states-pick-the-president", "ord_in_thread": 0, "title": "Primary vs. caucus: how states pick presidents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's election season, and there are two ways states choose the nominees of the two main parties — caucuses and primaries. \nSometimes the words may get used interchangeably, but there are a lot of differences. \nLet's start with caucuses. \nCaucuses are the original method for selecting nominees. Run by a state's political parties, they usually take place in many small groups meeting at the same time throughout the state. \nThe odd thing about caucuses is they allow voters to show support openly for their candidates; there are debates about the candidates. Generally, caucuses are closed, meaning you have to be a registered party member to attend and vote in one. \nThere aren't many states that still use the caucus system, probably because it takes more time from voters and more prep time by the states' parties. \nIn order to create a more direct voting process, the vast majority use the primary system. \nPrimaries are what most voters are used to: You go to a polling location and cast a secret ballot for your favorite candidate. \nAnd they generally come in one of two basic forms. \nThe first is a closed primary. People can only vote for the party they're registered in. If you're an independent, you get to choose whatever party's primary you want to vote in. \nThe second is an open primary. It's basically a free-for-all. Voters can choose any candidate they want, despite party affiliation. \nAfter all the primaries and caucuses are finished, nominees are chosen at the national conventions through the awarding of delegates — that's a whole other story. \nThis video includes images from Getty Images.", "external_links": [], "published": "2015-10-02T08:48:00.000+03:00", "crawled": "2015-10-02T08:57:15.725+03:00", "highlightTitle": ""}