{"organizations": [], "uuid": "bd36799e6abde99e44eb88a3870fb54831965d77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww1.hdnux.com/photos/41/60/11/8847964/7/rawImage.jpg", "site_section": "http://www.seattlepi.com/national/us/", "section_title": "U.S.: Politics, Crime, Weather and More - seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Israel-welcomes-video-surveillance-at-holy-site-6589147.php", "country": "US", "title": "Kerry plan for Jerusalem site leaves many issues unanswered", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Kerry plan for Jerusalem site leaves many issues unanswered - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "bd36799e6abde99e44eb88a3870fb54831965d77"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Israel-welcomes-video-surveillance-at-holy-site-6589147.php", "ord_in_thread": 0, "title": "Kerry plan for Jerusalem site leaves many issues unanswered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "JERUSALEM (AP) — John Kerry 's latest Mideast mission has aimed for the modest goal of easing tensions around Jerusalem's most sensitive holy site — the focal point of more than a month of deadly unrest.\nBut the steps announced by the U.S. secretary of state over the weekend did little to address the deeper issues behind the fighting, disappointing the Palestinians and raising fears that even if calm is restored, it is just a matter of time before another round of violence erupts.\nDuring a swing through the region, Kerry announced the steps on Saturday after several days of meetings with Israeli, Palestinian and Jordanian leaders. The highlight was a Jordanian proposal to install surveillance cameras at the Jerusalem holy site that is known to Jews as the Temple Mount and to Muslims as the Noble Sanctuary.\nMore than a month of violence has been fueled by Palestinian allegations that Israel is trying to change the delicate status quo at the site, which allows non-Muslims to visit but not pray.\nThe hilltop compound, home to the biblical Jewish Temples, is the holiest site in Judaism. Today, it is home to the Al-Aqsa Mosque compound, the third-holiest site in Islam and a potent Palestinian national symbol.\nWhile Israel has repeatedly said there are no plans to change this status quo, the Palestinian fears have been stoked by growing numbers of Jewish visitors, backed by some senior Israeli officials, who seek prayer rights and an expanded presence on the mount.\nAddressing his Cabinet on Sunday, Prime Minister Benjamin Netanyahu said he \"made clear\" to Kerry that Israel is committed to preserving the status quo, and he welcomed the plan to install cameras.\n\"Israel has an interest in stationing cameras in all parts of the Temple Mount. First, in order to disprove the claim that Israel is changing the status quo. Second, to show where the provocations really come from and to foil them before they ever happen,\" he said.\nIsraeli officials said the plan was for Israeli police and officials from the Waqf, the Jordanian-backed religious authority that administers the Muslim sites, to have access to footage.\nPalestinian officials gave the camera plan a cool reception.\n\"Netanyahu wants the video cameras just to track our people and arrest them,\" Palestinian official Saeb Erekat told the Voice of Palestine radio station.\nBoth Israeli and Jordanian officials said arrangements have not yet been discussed in detail, and it was not clear when the cameras would start operating. The officials spoke on condition of anonymity because they were not authorized to discuss the matter with the media.\nThe conflicting claims to the hilltop mount lie at the heart of the Israeli-Palestinian conflict and have spilled over into violence in the past. The current round of fighting began last month with clashes between young Muslim men and Israeli security forces, and quickly spread to other parts of Jerusalem, across Israel and into the West Bank and Gaza Strip.\nIn five weeks, 10 Israelis have been killed in Palestinian attacks, mostly stabbings, while 50 Palestinians have been killed by Israeli fire, including 29 said by Israel to be attackers.\nThe violence continued Sunday. In one incident, two Palestinians stabbed an Israeli in the West Bank, wounding him moderately before fleeing, the Israeli military said. The military initially said the attackers were disguised as ultra-Orthodox Jews but later retracted the detail after an investigation, saying it was incorrect.\nElsewhere in the West Bank, Israeli police said an officer shot and killed a 17-year-old Palestinian girl who tried to stab him. In a separate incident, a Palestinian man stabbed and seriously wounded an Israeli man near a Jewish West Bank settlement before fleeing.\nOn Sunday, Mohammed Hussein , the mufti of Jerusalem, the top Muslim cleric, gave a rare interview to Israeli media, telling Channel 2 TV that there had never been a Jewish presence at the holy site.\n\"The Al-Aqsa Mosque was there 3,000 years ago, and 30,000 years ago and when the world was created,\" he said. \"It was never anything other than a mosque.\"\nNetanyahu has said the stabbings are the result of Palestinian incitement and pointed to comments like the mufti's. But Palestinians say the violence is the result of deep frustrations after nearly 50 years of Israeli occupation, years of failed peace efforts and a lack of hope for gaining independence.\nIn his public comments Saturday, Kerry gave no indication that the Obama administration has any plans to re-launch peace efforts during its final year in office, though the so-called Quartet, a U.S.-led group of international Mideast mediators, is to send a delegation to the region in the near future.\nDuring Saturday's meeting with Kerry, Palestinian President Mahmoud Abbas raised a number of concerns, including continued Israeli settlement construction on occupied lands claimed by the Palestinians and their demand for an independent state in the West Bank, east Jerusalem and Gaza — lands captured by Israel in the 1967 Mideast war. The Palestinians are seeking a U.N. Security Council resolution endorsing their positions, along with a timeline for establishment of an independent state.\nPalestinians said they were waiting to see whether the arrangements announced by Kerry would change the situation on the ground.\nOn Friday, Israel lifted age restrictions barring young men from joining prayers at the mosque, a key source of tension, and prayers passed without incident. Palestinians also want to see whether Israeli will remove checkpoints and roadblocks placed in Arab neighborhoods in Jerusalem in recent weeks.\n\"I think people are still confused about what Netanyahu is up to, and we don't know what the coming days will bring,\" said Ahmad Rweidi, Abbas' adviser on Jerusalem affairs.\nPalestinian political scientist George Giacaman said that while Kerry may succeed in easing the latest tensions, a broader political solution is needed. \"We are heading toward collision and confrontations,\" he said.\nNathan Thrall , an analyst with the International Crisis Group , said there were no guarantees that Kerry's efforts would even get the latest violence to subside. But he said the U.S. has signaled that it may take one last push at advancing peace.\n\"We haven't seen the end of the Obama administration's involvement or efforts in this conflict,\" he said. \"I think there is a good chance that the U.S. will wind up doing something ... before the end of Obama's term.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T00:16:27.712+02:00", "highlightTitle": ""}