{"organizations": [], "uuid": "dfced89683121c71f04481f02b7188460b118980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00298/corrections-gives-grant-to-help-returning-deportees.htm", "country": "US", "title": "Corrections gives grant to help returning deportees", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Corrections gives grant to help returning deportees", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T04:25:00.000+03:00", "replies_count": 0, "uuid": "dfced89683121c71f04481f02b7188460b118980"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00298/corrections-gives-grant-to-help-returning-deportees.htm", "ord_in_thread": 0, "title": "Corrections gives grant to help returning deportees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Corrections gives grant to help returning deportees Monday, 19 October 2015, 2:25 pm \n19 October 2015 \nCorrections gives grant to help returning deportees \nCorrections is giving a one-off grant of $100,000 to Auckland PARS to assist New Zealand offenders being deported from Australia. \n“Corrections recognises that some New Zealanders being deported to New Zealand need help,” says Corrections Chief Executive Ray Smith. \n“Many of these offenders have not lived here for many years or decades. Many have no family or other support.” \nPARS (formerly the Prisoners' Aid and Rehabilitation Society) is a charitable organisation that helps former prisoners and their families integrate into the community. \nCorrections funds PARS to provide support to offenders released from New Zealand prisons but recognises the extra resources it is using to support those arriving from Australia. \n“This funding will be used to provide a responsive service to help deportees access the assistance they need. It is a short-term solution, until 30 June 2016, to support Auckland PARS,” Mr Smith says. \nCorrections is aware there may be smaller impacts on some other providers and will work with them to understand the impact for them. \nThe number of offenders being deported to New Zealand from Australia is increasing. So far this year, about 170 offenders have been deported, mainly from Australia. This compares to 60 -100 annually in previous years. \nDeportees are met at the airport by police and offered the PARS service. This is a voluntary service and deportees can decline the service if they choose. \nCorrections is notified of these deportees by Interpol. \nIn July this year, Corrections Minister Peseta Sam Lotu-Iiga and his Australian state and territory counterparts agreed to develop better processes for sharing Corrections information about deported offenders across borders. Progress is being made on this, with Corrections staff visiting Canberra last week. \nends", "external_links": [], "published": "2015-10-19T04:25:00.000+03:00", "crawled": "2015-10-19T11:26:48.922+03:00", "highlightTitle": ""}