{"organizations": [], "uuid": "f8da900a306bcc97af6df9f256189c0c0d5e7f0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "straitstimes.com.feedsportal.com", "main_image": "http://www.straitstimes.com/sites/all/themes/custom/bootdemo/images/facebook_logo.jpg", "site_section": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/index.rss", "section_title": "RSS Breaking News - Politics", "url": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/s/4a861d1d/sc/28/l/0L0Sstraitstimes0N0Cpolitics0Csla0Eprovides0Egreen0Emap0Efor0Enparks/story01.htm", "country": "SG", "title": "SLA provides 'green map' for NParks,", "performance_score": 0, "site": "feedsportal.com", "participants_count": 1, "title_full": "SLA provides 'green map' for NParks, Politics News & Top Stories - The Straits Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:00:00.000+03:00", "replies_count": 0, "uuid": "f8da900a306bcc97af6df9f256189c0c0d5e7f0b"}, "author": "Nur Asyiqin Mohamad Salleh", "url": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/s/4a861d1d/sc/28/l/0L0Sstraitstimes0N0Cpolitics0Csla0Eprovides0Egreen0Emap0Efor0Enparks/story01.htm", "ord_in_thread": 0, "title": "SLA provides 'green map' for NParks,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No green patch in developed areas of the island will be left untended, thanks to technology.\nThe Singapore Land Authority (SLA) is lending its high-tech mapping know-how to help agencies here better maintain public greenery, the National Development Ministry said yesterday.\nThis comes just months after the National Parks Board (NParks), which the ministry oversees, became the central agency for the maintenance of public greenery - a task previously handled by different agencies, depending on which one owns the land.\nThe move to centralise the maintenance of greenery here in June was part of a push to better coordinate government responses to problems on the ground. It is led by the Municipal Services Office (MSO), which was formed last year.\nSince then, MSO has worked with NParks, SLA, national water agency PUB and the Housing Board to create a tool to clearly mark out green areas on a map of Singapore. It will help identify gaps or overlaps in maintenance routines and allow NParks to better plan maintenance schedules. NParks will also be able to tap on a 3D map developed by SLA to estimate the number and locations of trees.\nMinister for Culture, Community and Youth Grace Fu, who oversees the MSO, told reporters during a visit to SLA yesterday that greater use of technology in managing municipal issues will help the Government boost productivity and the delivery of services.\nAnd with one agency providing the \"backbone of mapping\", Ms Fu hopes to see other agencies come on board so this technology can be shared. \"In the future we're going to face more demand on social services, but with fewer people. So, having that productivity improvement, (and making) a quantum leap, is what the public service is striving for,\" she said.\nMs Fu is also keen on having more people make use of MSO's OneService mobile app, which has received more than 15,000 submissions from its launch in January up to the end of August. Residents can use it to report municipal issues, from pests to dirty footpaths, and geo-tag or pinpoint the issue's location.\nSaid SLA chief executive Tan Boon Khai: \"With all this data out there, residents will be able to give us precise locations so we can allocate the resources efficiently and quickly to deal with their needs.\"\nA version of this article appeared in the print edition of The Straits Times on October 09, 2015, with the headline 'SLA provides 'green map' for NParks'. Print Edition | Subscribe Topics: GRACE FU SINGAPORE LAND AUTHORITY MUNICIPAL SERVICES //str.sg/Z6yr Copy", "external_links": ["http://www.sphsubscription.com.sg/eshop", "http://str.sg/Z6yr"], "published": "2015-10-09T13:00:00.000+03:00", "crawled": "2015-10-09T13:42:29.449+03:00", "highlightTitle": ""}