{"organizations": [], "uuid": "5022b8179a19887d7bc48779bdb48a846a70cb63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/dd/e6a93eb95658a80a9373df7e3d232a/media:715ba7946650480e8cc780545fb42e3fNLDSCardinalsCubsBaseball.JPEG", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/sports/articles/2015/10/14/cubs-make-it-to-nlcs-for-1st-time-in-12-years", "country": "US", "title": "Cubs make it to NLCS for 1st time in 12 years - US News", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Cubs make it to NLCS for 1st time in 12 years - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "5022b8179a19887d7bc48779bdb48a846a70cb63"}, "author": "USNews", "url": "http://www.usnews.com/news/sports/articles/2015/10/14/cubs-make-it-to-nlcs-for-1st-time-in-12-years", "ord_in_thread": 0, "title": "Cubs make it to NLCS for 1st time in 12 years - US News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sweet Home Chicago! Cubs advance to NL Championship Series for 1st time since 2003 Fans gather on the streets outside of Wrigley Field after the Cubs won 6-4 in Game 4 in baseball's National League Division Series against the St. Louis Cardinals, Tuesday, Oct. 13, 2015, in Chicago. (AP Photo/Paul Beaty)\nAssociated Press Oct. 14, 2015 | 2:25 a.m. EDT + More By JAY COHEN, AP Sports Writer\nCHICAGO (AP) — When it was over, Anthony Rizzo jumped around Wrigley Field and hugged everyone in sight. The moment was in his grasp, and he was determined to hold onto it for as long as possible.\nThe All-Star slugger endured several seasons of losing with the Chicago Cubs before they finally got into the playoffs again, and he was more than ready to enjoy the franchise's first appearance in the NL Championship Series in more than a decade.\n\"Obviously times weren't easy the last few years, but with all the talent we had and all the talent we were building, everyone knew that the Cubs were coming,\" a drenched Rizzo said as he celebrated Chicago's clinching 6-4 victory over St. Louis in the NL Division Series on Tuesday, \"and we're here, and hopefully we can keep this thing going.\"\nRizzo, Javier Baez and Kyle Schwarber homered as the Cubs finished off the rival Cardinals with their third consecutive win, leading to a wild scene on the inside and outside of their century-plus-old neighborhood ballpark. It was the first time they had clinched a postseason series at Wrigley, and the North Siders savored the accomplishment — at least for one night.\nMuch of a raucous, towel-waving crowd of 42,411 lingered as manager Joe Maddon posed for a selfie with his wife, and Jon Lester sprayed champagne with his young son. Rocker Eddie Vedder partied on the mound.\nPresident Barack Obama — who roots for Chicago's other team — got in on the celebration, too, tweeting his congratulations and noting \"even @whitesox fans are rooting for you!\"\n\"We're going to celebrate this. We deserve to celebrate this,\" Rizzo said. \"It's been a long time coming for this city, and hopefully it's just a sign of things to come.\"\nThe victory in Game 4 allows Chicago to line up ace pitchers Jake Arrieta and Jon Lester for the beginning of the NLCS this weekend. The Dodgers beat the Mets 3-1 on Tuesday night and will play Game 5 of their division series on Thursday in Los Angeles.\nThe winner hosts the Cubs on Saturday in the opener of Chicago's first NLCS since 2003.\n\"This obviously right now is very rewarding, but we have a couple more series and hopefully we can celebrate like this two more times,\" Chicago third baseman Kris Bryant said.\nThe Cubs had a string of five consecutive losing seasons before they went 97-65 this year. But it was only good enough for third in the competitive NL Central, with St. Louis winning a major league-best 100 games and Pittsburgh finishing second.\nThe NL playoffs opened with Arrieta tossing a five-hit shutout in the wild-card game against the Pirates, and the Cubs just kept on rolling against the Cardinals. After a 4-0 loss to John Lackey in the series opener, Rizzo and company clubbed 10 homers in the last three games.\n\"It's a shame that three of the best teams in baseball, one is only moving on to the championship series,\" Rizzo said. \"I've said that all along, two unbelievable clubs we just beat, the Pirates, who have an unbelievable organization and the same with the Cardinals. We just beat a really good team.\"\nSt. Louis, which had made it to the NLCS for four straight years, also was impressed.\n\"I will be shocked if they're not in the World Series or winning it,\" Cardinals rookie Stephen Piscotty said. \"They're playing well. You got to tip your hat.\"\n___\nJay Cohen can be reached at http://www.twitter.com/jcohenap\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe6h9b%3Fsrc=usn_gp", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe6h9b%3Fsrc=usn_fb", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe6h9b%3Fsrc=usn_su", "http://www.twitter.com/jcohenap", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe6h9b%3Fsrc=usn_tw&via=usnews&text=Cubs%20make%20it%20to%20NLCS%20for%201st%20time%20in%2012%20years", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe6h9b%3Fsrc=usn_rd&title=Cubs%20make%20it%20to%20NLCS%20for%201st%20time%20in%2012%20years", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe6h9b%3Fsrc=usn_li&title=Cubs%20make%20it%20to%20NLCS%20for%201st%20time%20in%2012%20years&summary=&source=U.%20S.%20News"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T09:38:03.959+03:00", "highlightTitle": ""}