{"organizations": [], "uuid": "06829dbfdb882c36ec5e80d7b151601906114349", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theconversation.com", "main_image": "http://cdn.theconversation.com/files/98100/width1356x668/image-20151012-17843-1jqh28q.jpg", "site_section": "http://theconversation.com/au/politics", "section_title": "Politics + Society – Views &amp; Research – The Conversation", "url": "http://theconversation.com/rugby-world-cup-how-referee-profiling-became-vital-part-of-match-preparation-49013", "country": "US", "title": "Rugby World Cup: how referee profiling became vital part of match preparation", "performance_score": 0, "site": "theconversation.com", "participants_count": 1, "title_full": "Rugby World Cup: how referee profiling became vital part of match preparation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T20:12:00.000+03:00", "replies_count": 0, "uuid": "06829dbfdb882c36ec5e80d7b151601906114349"}, "author": "theconversation.com", "url": "http://theconversation.com/rugby-world-cup-how-referee-profiling-became-vital-part-of-match-preparation-49013", "ord_in_thread": 0, "title": "Rugby World Cup: how referee profiling became vital part of match preparation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the whistle blew on Japan’s 28-18 victory over the USA in the Rugby World Cup on October 11, the curtain came down on the group stages. So began a six-day gap before the quarter finals get underway – starting with South Africa v Wales at Twickenham on Saturday October 17.\nDon’t be surprised if referees take the limelight. England’s early exit opens the way for an interesting appointment, for instance, since English officials will now count as neutrals in all remaining games. Wayne Barnes is regarded as the best match official in England, but New Zealanders would prefer he didn’t officiate in the latter stages. They recall his error in their 2007 quarter final , missing a key illegal forward pass by France. But with another quarter-final clash between the two nations lined up for Cardiff on October 17, Barnes is being touted as the possible referee.\nThen there was 2011. Twenty minutes into the highly charged semi-final between Wales and France , with Wales leading by a single penalty, their captain Sam Warburton was penalised for a dangerous tackle on the French winger. As commentators debated whether it was accidental and whether a yellow card and ten minutes in the “sin bin” would follow, the officials deemed it a red-card offence. Sending Warburton off effectively ended the game.\nThe referee also took stick in the final between France and New Zealand. The game was won by New Zealand – but instead of focusing on the poor play, many headlines were about the performance of Craig Joubert, the South African referee, who appeared to favour the All Blacks at key moments.\nHow top referees think Sport psychology has focused less on referees than players, coaches and teams, but certainly top officials are not ten a penny. The limited research suggests the best ones excel at organising their knowledge and experience – in ways similar to top chess players or musicians. Rather than reacting to apparently random sequences of information, they perceive organised “whole” patterns which they can then interpret more efficiently.\nThey speed up decision making with mental rules of thumb. An example is scrums, one of the most difficult areas to officiate. Top referees will avoid the thankless task of focusing on the many reasons for a scrum to fail, some legal and some illegal. Instead they will decide the main cause and award a sanction or not on that basis. The best referees must also cope with the fatigue of sprinting around for 80 minutes, while managing complex and volatile on-field relationships.\nIn an era of marginal gains, teams who can predict their official’s behaviour will have a potential advantage. Long before the World Cup began, you can be sure they were analysing the past performances of the officials with whom they would be sharing the field – just like with opposing players and coaches. They will want to know officials' patterns of behaviour around things like refereeing set pieces; whether they are more prone to award penalties in the final few minutes of each half; and their willingness to play advantage. This allows teams to adjust their tactics and game management accordingly.\nI see differences between refereeing nationalities, for example. French referees are very tuned into things like scrums and line outs , due to the emphasis on forward power in the Top 14 league in France. On the other hand, southern hemisphere referees are generally better at open play.\nOne of the hardest referees to profile is Nigel Owens, possibly the best-known official in the tournament. The Welshman is highly regarded by players and spectators because he allows the game to flow, but unpredictable because he tends to be more collaborative than authoritarian, responding to how players respond to him. He certainly operates with the rules of thumb that you see in top referees, but very flexibly. He is also a great communicator who “sells” decisions to players, often with humour – undoubtedly helped by his sideline in stand-up comedy.\nNigel Owens collars Mathieu Bastareaud of France during October 11 game against Ireland Reuters Staff\nThe new whistle Savvy teams will also have done their homework on the TMO (television match official), an acronym the tournament will have introduced to many sports fans. First used in the World Cup in 2011, the TMO is a shadowy figure, often sitting in a mobile video suite in the car park of the playing venue. He is rarely seen, but heard by the millions of viewers to provide ultimate judgement on the key decisions.\nConsulting with the TMO has become integral to the refereeing process, but it can get out hand. The first game of the current tournament, England v Fiji , took over 100 minutes rather than the allotted 80, due to six lengthy TMO referrals by referee Jaco Peyper. This pattern has been repeated. Very few referees now appear willing to back their own real-time decision making, backed up by their touch judges on the sidelines.\nDylan Hartley: whozaprettyboy? EPA\nRugby has always had a tradition of ultimate respect for its match officials. Players still call the referee “sir”, and any criticism of a decision is severely sanctioned (witness England hooker Dylan Hartley’s 11-week ban in 2013 for accusing an official of being a “fucking cheat”). The TMO may undermine this unquestioning respect. Captains appear to be requesting that the TMO is involved in cases which may favour their team. By embracing this technology, rugby union risks loses something very precious – we have seen cricket develop a similar authority issue due to the decision review system, for instance.\nWhile many fret about how TMOs will affect rugby union in the long term, we shall see if the closing stages of this tournament add anything to the debate. In the meantime, we can all cross our fingers for the best possible refereeing. An outstanding example might be Nigel Owens at the Rugby Championship finale of 2014 , where South Africa needed to beat the All Blacks to win the competition (and succeeded): he played a blinder but no one noticed. You can’t ask for anything more.\nRugby World Cup You might also like REUTERS/Henry Browne Siblings in the scrum: long history of brothers makes rugby a family affair", "external_links": ["http://www.theguardian.com/sport/2007/oct/09/rugbyunion.rugbyworldcup20074", "http://www.bbc.co.uk/sport/0/rugby-union/15307018", "http://www.theguardian.com/sport/2013/may/26/leicester-northampton-dylan-hartley-lions", "https://62e528761d0685343e1c-f3d1b99a743ffa4142d9d7f1978d9686.ssl.cf2.rackcdn.com/files/98102/area14mp/image-20151012-17811-4lxmbp.jpg", "https://62e528761d0685343e1c-f3d1b99a743ffa4142d9d7f1978d9686.ssl.cf2.rackcdn.com/files/98102/width237/image-20151012-17811-4lxmbp.jpg", "http://www.yorkshirepost.co.uk/sport/cricket/drs-spells-undermining-of-respect-for-the-game-s-umpires-1-2317212", "http://www.nzherald.co.nz/sport/news/article.cfm?c_id=4&objectid=11509686", "http://pictures.reuters.com/C.aspx?VP3=SearchResult&VBID=2C0FCIG96DF4&SMLS=1&RW=1440&RH=741#/SearchResult&VBID=2C0FCIG96DF4&SMLS=1&RW=1440&RH=741&POPUPPN=1&POPUPIID=2C0FQEXBR3EQ", "https://62e528761d0685343e1c-f3d1b99a743ffa4142d9d7f1978d9686.ssl.cf2.rackcdn.com/files/96430/width1012x668/image-20150928-445-1i8vmm0.jpg", "http://news.bbc.co.uk/sport1/hi/rugby_union/rules_and_equipment/4205664.stm", "http://www.telegraph.co.uk/sport/rugbyunion/rugby-world-cup/11870090/England-vs-Fiji-Rugby-World-Cup-live.html", "http://www.theguardian.com/sport/2007/oct/08/rugbyunion.rugbyworldcup200714", "http://collections.crest.ac.uk/177/1/fulltext.pdf", "https://62e528761d0685343e1c-f3d1b99a743ffa4142d9d7f1978d9686.ssl.cf2.rackcdn.com/files/98101/area14mp/image-20151012-17831-1wbp5j7.jpg", "https://62e528761d0685343e1c-f3d1b99a743ffa4142d9d7f1978d9686.ssl.cf2.rackcdn.com/files/98101/width668/image-20151012-17831-1wbp5j7.jpg", "http://www.scorespro.com/rugby-union/france/top-14/", "http://www.stuff.co.nz/sport/rugby/international/72914560/wayne-barnes-a-possibility-to-ref-the-all-blacks-cardiff-rugby-world-cup-rematch", "https://www.youtube.com/embed/PuIuXrwPCcc?wmode=transparent&start=0", "http://www.theguardian.com/sport/blog/2015/sep/19/tmo-england-fiji-referee-jaco-peyper-wales-uruguay-rugby-world-cup", "http://www.theguardian.com/sport/live/2015/oct/11/usa-japan-rugby-world-cup-2015-live", "http://www.walesonline.co.uk/sport/rugby/rugby-news/scourge-scrum-wales-top-referee-8451864#ICID=sharebar_twitter", "http://www.espn.co.uk/rugby/story/_/id/13794800/stuart-lancaster-england-knocked-2015-rugby-world-cup-defeat-australia", "http://www.epa.eu/sports-photos/rugby-union-photos/england-rugby-practice-in-port-elizabeth-south-africa-photos-50399099", "http://www.theguardian.com/sport/2014/oct/04/south-africa-new-zealand-rugby-championship"], "published": "2015-10-13T20:12:00.000+03:00", "crawled": "2015-10-14T09:42:29.316+03:00", "highlightTitle": ""}