{"organizations": [], "uuid": "2be55fe29a5386b5ec81c0c82124e0681d92eb11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/partybus.jpg?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=f2ZHhuocOHvQlXD%2B%2B9%2FeO%2BQwV5A%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/chicago-politics/7/71/1024100/party-party-buses-recent-shooting", "country": "US", "title": "Party could be over for party buses after recent shooting", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Party could be over for party buses after recent shooting | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:42:00.000+03:00", "replies_count": 0, "uuid": "2be55fe29a5386b5ec81c0c82124e0681d92eb11"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/chicago-politics/7/71/1024100/party-party-buses-recent-shooting", "ord_in_thread": 0, "title": "Party could be over for party buses after recent shooting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The party would be over — or, at the very least, reined in — for “party buses” cruising Chicago, under a crackdown proposed Wednesday in response to recent shootings.\nFinance Committee Chairman Edward Burke (14th) and Police Committee Chairman Ariel Reboyras (30th) are joining forces on an ordinance that would require party buses to be licensed to sell alcohol and designate an individual who is at least 25 years old to check the identification of all passengers on the bus.\nThe over-25 designee would be required to make a “reasonable effort” to ensure that passengers under the legal drinking age of 21 “do not violate the law by consuming alcohol” aboard the bus.\nThe ordinance introduced at Wednesday’s City Council meeting was co-sponsored by three former Chicago Police officers: Aldermen Willie Cochran (20th); Chris Taliaferro (29th) and Anthony Napolitano (41st).\nThe shooting that left three people injured and triggered the crackdown occurred early Sunday in the 1500 block of South Jefferson.\nAfter a tour that included the South Loop and University Village neighborhoods, the driver of a party bus pulled into a gas station to buy cigarettes.\nWhile the driver was inside paying for his smokes, a fight apparently broke out on the bus and spilled out onto the street. At some point, shots were fired at the vehicle. The aldermen Quote: d the police report as saying the driver “did not keep a passenger roster or make sure that passengers on the party bus were legally old enough” to drink.\nBurke noted that the Sunday morning party bus shooting was “not an isolated incident.”\nIn mid-June, a woman who was a passenger on a party bus fell to her death from a bridge railing at 400 E. Wacker Drive shortly after leaving a party bus, police records show. Three months earlier, a 19-year-old man was shot while participating in a party bus event at 2233 South Martin Luther King Drive.\n“With the increasing popularity and proliferation of party buses in Chicago, we need to take reasonable steps to ensure that underage drinking does not occur on these vehicles,” Burke was Quote: d as saying.\n“By doing so, we hope to ensure that our young people do not avail themselves of any easy opportunity to evade the law.”\nChris Vecchio, owner of Chitown Party Bus, said he’s “not a big fan” of Burke, adding, “He’s one of those aldermen who like to get in the limelight take advantage of situations.”\nBut, Vecchio said if there are party bus companies that do supply alcohol, “They should get a license. They should get insurance.” His company is not one of them.\n“I know there have been some crazy things. In any business, you have renegades who, if you hire a bus, they’ll give you two kegs of beer. But, we don’t supply alcohol or any other beverages. It’s strictly B.Y.O.B. with us. The only thing we supply is cups, napkins and ice,” Vecchio said.\n“We check I.D.’s if they look under age. We’ve had a couple of proms where they’ve tried to sneak alcohol. And we just tell them if there’s any alcohol found on board, we’ll take them to the nearest police station and have their parents pick `em up.”\nGino Cekanavicius, co-owner of Viking Limosuine, said there “should be some kind of regulation” to make certain recent shootings involving his competitors are not repeated.\nBut, Cekanavicius questioned how the ordinance would be enforced, particularly when young people attempt to sneak alcohol aboard a party bus.\n“Let’s say we do proms. We don’t let them bring anything on the bus. Even water. But, how are they gonna put us responsible for it [if kids hide alcohol]. You want us to check what they have in their pants or in their sleeve? We can’t do that. It’s illegal. But in visible things, yes,” he said.\nEven without city regulation, Viking tries to police itself, Cekanavicius said.\n“Nobody drinks under age on our buses. We don’t allow alcohol under age on our buses. Either no under age or no alcohol,” he said.\n“If anybody looks young, we do check and either don’t allow alcohol or don’t allow that person on the bus. But, if you see the guy is 50 years old, what’s the point of checking his I.D.? We don’t sell or supply alcohol. We just supply water and soda.”\nThe ordinance introduced Wednesday would establish several conditions for operating a motor vehicle “for the transportation of passengers for hire within the city and on which alcoholic beverages will be served by a charter party or consumed by passengers on a charter-sightseeing vehicle.”\nThey include obtaining a license to sell alcohol; designating someone 25 or older to be present whenever a person under 21 is aboard without a parent or legal guardian and making certain that the over-25 designee makes “reasonable efforts” to guard against under-age drinking by checking “the identifications of all passengers to determine who is under 21.”\n“The operator of the vehicle shall not commence transport until the designee has verified with the driver that the designee has checked the identifications of all passengers. If passengers are picked up at more than one location, the driver shall not commence transport from the subsequent location until the designee has verified with the driver the identifications of all passengers boarding the vehicle at that location,” the ordinance states.\n“The designee shall notify the driver of the vehicle if, at any time during the trip, a passenger in their party who is under 21 years of age is consuming or has consumed alcoholic beverages.”", "external_links": [], "published": "2015-10-14T21:42:00.000+03:00", "crawled": "2015-10-15T00:12:13.244+03:00", "highlightTitle": ""}