{"organizations": [], "uuid": "e48a55acf9b60774a73fdf33262755954bed130b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4315802/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13842501.SNP_MP_Anne_McLaughlin__My_partner_is__probably_the_only_Rastafarian__who_has_never_used_cannabis/", "country": "GB", "title": "SNP MP Anne McLaughlin: My partner is \"probably the only Rastafarian\" who has never used cannabis", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 3, "title_full": "SNP MP Anne McLaughlin: My partner is \"probably the only Rastafarian\" who has never used cannabis (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T05:07:00.000+03:00", "replies_count": 2, "uuid": "e48a55acf9b60774a73fdf33262755954bed130b"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/politics/13842501.SNP_MP_Anne_McLaughlin__My_partner_is__probably_the_only_Rastafarian__who_has_never_used_cannabis/", "ord_in_thread": 0, "title": "SNP MP Anne McLaughlin: My partner is \"probably the only Rastafarian\" who has never used cannabis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An SNP MP believes her partner is \"probably the only Rastafarian\" who has never used cannabis.\nAnne McLaughlin (Glasgow North East) told MPs the drug is part of the religious and spiritual beliefs of Rastafarians.\nSpeaking during a Westminster Hall debate on an e-petition seeking to legalise cannabis, Ms McLaughlin added: \"I'm probably the only speaker here today, you can prove me wrong if you like, whose partner is a Rastafarian, and he's probably the only Rastafarian - oh, I might get shot down in flames for this - who has never used cannabis.\n\"It's not compulsory for Rastafarians to use cannabis.\n\"However, it is part of their spiritual outlook and he has asked the question 'Well, where are my civil liberties if I choose to do that because that's part of my religious beliefs, where are my civil liberties if it criminalises me?'\"\nThe SNP's spokeswoman for civil liberties earlier noted there are clear arguments against legalising cannabis although said the existing policy resulted in people from the country's poorest communities and black and minority ethnic communities being affected \"most severely\".\nMs McLaughlin also said there is \"quite a snobbish attitude\" towards cannabis as opposed to other drugs.\nShare article She said: \"As other members have said, it would appear from various media reports that those are maybe of a kind of a middle to upper-class background can partake in illicit substances in their university days without ever jeopardising their future career.\n\"But many people from a working-class background, a drugs-related conviction, no matter how minor, can have a devastating impact on their life chances in terms of employment.\"", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-13T05:07:00.000+03:00", "crawled": "2015-10-13T04:41:42.066+03:00", "highlightTitle": ""}