{"organizations": [], "uuid": "8b4e52cc06532cb17149351b08edbfab89c360de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30350194/cluster-of-nontuberculous-mycobacterium-infections-identified-in-wellspan-york-hospital-patients", "country": "US", "title": "Cluster of Nontuberculous Mycobacterium Infections Identified in WellSpan York Hospital Patients", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Cluster of Nontuberculous Mycobacterium Infections Identified in WellSpan York Hospital Patients - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "8b4e52cc06532cb17149351b08edbfab89c360de"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30350194/cluster-of-nontuberculous-mycobacterium-infections-identified-in-wellspan-york-hospital-patients", "ord_in_thread": 0, "title": "Cluster of Nontuberculous Mycobacterium Infections Identified in WellSpan York Hospital Patients", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Pennsylvania Department of Health\nHARRISBURG, Pa. , Oct. 26, 2015 /PRNewswire-USNewswire/ -- The Pennsylvania Department of Health today released details of a recent investigation into a cluster of Nontuberculous Mycobacterium (NTM) infections involving patients who had open heart surgeries requiring cardiopulmonary bypass at WellSpan York Hospital.\nOn July 20, 2015 , WellSpan York Hospital notified the department about a cluster of patients with NTM infections. The department immediately launched an investigation and requested assistance from the Centers for Disease Control and Prevention (CDC) to determine the source of the NTM infections, suspected to be the hospital's heater-cooler devices used during open heart surgeries to warm and cool a patient's blood during cardiopulmonary bypass.\n\"The Department of Health acted quickly to identify the source of the infection to protect the public's health,\" said Secretary of Health Dr. Karen Murphy . \"The department immediately required WellSpan York Hospital to replace their units as soon as it was suspected there may be a link between the NTM infections and the heater-cooler devices.\"\n\"Any time a hospital identifies a cluster of infections, they are required by law to notify the Department of Health. Upon notification, we immediately engage our team of epidemiologists and other experts as needed, like the CDC, to assist us in our investigation. Our top priority is always to protect the health of patients and the general public.\"\nAs part of the joint Department of Health/CDC on-site investigation, patient and heater-cooler device samples were sent to the CDC laboratory in Atlanta , where they are being identified and studied further. The bacteria that were collected grow very slowly, with the process routinely taking up to two months. Preliminary findings indicate a firm link between the NTM infections in patients and patient exposure to the heater-cooler devices during open heart surgery.\nNTM bacteria grow slowly in the lab and in patients. NTM is unusual in that it can take several years before people who are infected with it are diagnosed. Because of this, the patients under review as being at risk of infection include those that had heart surgeries requiring cardiopulmonary bypass at WellSpan York Hospital dating back approximately four years, from October 1, 2011 , through July 24, 2015 .\nSymptoms of infections caused by NTM can include:\nFever; Pain, redness, heat, or pus around a surgical incision; Weight loss; Night sweats; Joint pain; Muscle pain; and Loss of energy. Affected patients should talk to their health care provider if they have any of the above symptoms so they can be further evaluated. The hospital has started notifying patients who had open heart surgery on bypass during the relevant timeframe and should have that process completed soon. More information is available from WellSpan York Hospital by calling their 24-hour nurse call center toll-free at 1-866-217-2970 or by visiting www.wellspan.org/yorkopenheart .\nNTM grow slowly and are commonly found in soil and water, including tap water. NTM are usually not harmful, but can cause infections in patients who have had invasive health care procedures and those with weakened immune systems. It does not normally make healthy people sick. NTM is not contagious and cannot be spread from person to person.\nVisit the Department of Health's website at www.health.pa.gov to learn more.\nMEDIA CONTACT : Amy Worden , Health, 717-787-1783\n releases/cluster-of-nontuberculous-mycobacterium-infections-identified-in-wellspan-york-hospital-patients-300166037.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.wellspan.org/yorkopenheart", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC38193&Transmission_Id=201510261209PR_NEWS_USPR_____DC38193&DateId=20151026", "http://www.prnewswire.com/news-releases/cluster-of-nontuberculous-mycobacterium-infections-identified-in-wellspan-york-hospital-patients-300166037.html", "http://www.health.pa.gov/"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T18:54:46.788+02:00", "highlightTitle": ""}