{"organizations": [], "uuid": "258923c9341a3a2b20fd9612d8c0c0cf1e940837", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/fb/2a1fb68484ff18e58c03ef0f3fc8f9/media:6157789e460049c18233e0e01f5bf73eRedskinsFalconsFootball.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/sports/articles/2015/10/11/alfords-int-return-lifts-falcons-past-redskins-25-19-in-ot", "country": "US", "title": "Alford's INT return lifts Falcons past Redskins 25-19 in OT", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Alford's INT return lifts Falcons past Redskins 25-19 in OT - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "258923c9341a3a2b20fd9612d8c0c0cf1e940837"}, "author": "USNews", "url": "http://www.usnews.com/news/sports/articles/2015/10/11/alfords-int-return-lifts-falcons-past-redskins-25-19-in-ot", "ord_in_thread": 0, "title": "Alford's INT return lifts Falcons past Redskins 25-19 in OT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alford's 59-yard interception return for TD lifts undefeated Falcons past Redskins 25-19 in OT Atlanta Falcons cornerback Robert Alford (23) runs back an intercepted ball during the overtime of an NFL football game against the Washington Redskins, Sunday, Oct. 11, 2015, in Atlanta. The Atlanta Falcons won 25-19. (AP Photo/John Bazemore)\nAssociated Press Oct. 11, 2015 | 4:52 p.m. EDT + More By CHARLES ODUM, AP Sports Writer\nATLANTA (AP) — On a mostly ugly day for Atlanta's offense, Robert Alford and the defense had the final say.\nAlford returned an interception 59 yards for a touchdown, lifting the undefeated Atlanta Falcons to a 25-19 win over the Washington Redskins in overtime Sunday.\nThe Redskins had the first possession of OT and Kirk Cousins moved the team to midfield. Ryan Grant slipped on a pass route, Alford caught Cousins' pass and was left with open field down the sideline for the touchdown.\nDevonta Freeman's apparent 13-yard scoring catch in the final minute of regulation was ruled incomplete on a review. Freeman scored on 6-yard run two plays later to give Atlanta a 19-16 lead. Dustin Hopkins' 52-yard field goal on the final play of regulation forced overtime.\nThe Falcons (5-0) overcame two interceptions and a lost fumble by Ryan. Freeman had 27 carries for 153 yards and the touchdown and became the first NFL player with seven rushing touchdowns in his first three starts.\nThe Redskins (2-3) were denied their first back-to-back wins in almost a year — since Weeks 7 and 8 in 2014.\nThe interception was the second of the game for Cousins, who completed 21 of 32 passes for 219 yards with one touchdown.\nMatt Jones' 1-yard run midway through the final quarter gave Washington a 13-12 lead.\nRyan who completed 24 of 42 passes for 254 yards with no touchdowns. Julio Jones, who began the day leading the NFL in catches, and Roddy White were held without a catch in the first half. Jones finished with five catches for 67 yards. White, who complained about his diminished role early in the week before meeting with coach Dan Quinn, had two catches for 23 yards.\nWhite's first catch of the day, a 16-yarder, moved the Falcons to the Washington 14 in the fourth quarter. Freeman ran for 11 yards and Atlanta again gave the ball to Freeman. He was stripped by defensive end Chris Baker near the 2 and the ball bounced into the end zone. Jones fell on the fumble for a touchdown.\nRyan's pass for Leonard Hankerson on the 2-point attempt was incomplete.\nWashington had a quick answer. Following a pass interference call against Alford, Jones' 1-yard run gave Washington a 13-12 lead; Cousins' pass for Pierre Garcon was incomplete on the 2-point attempt.\nCousins' first-quarter 7-yard pass to tight end Derek Carrier was the only touchdown for either team through three quarters. The Falcons tried to stay close with field goals, but the uprights kept getting in the way of the usually reliable Matt Bryant's attempts.\nThe Redskins were without four injured starters, including cornerbacks DeAngelo Hall and Chris Culliver. Starting safety Duke Ihenacho is on injured reserve. Tight end Jordan Reed and wide receiver DeSean Jackson also were inactive.\n___\nOnline:\nAP NFL website: www.pro32.ap.org and AP NFL Twitter feed: www.twitter.com/AP_NFL\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe3u77%3Fsrc=usn_tw&via=usnews&text=Alford%27s%20INT%20return%20lifts%20Falcons%20past%20Redskins%2025-19%20in%20OT", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe3u77%3Fsrc=usn_su", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe3u77%3Fsrc=usn_li&title=Alford%27s%20INT%20return%20lifts%20Falcons%20past%20Redskins%2025-19%20in%20OT&summary=&source=U.%20S.%20News", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe3u77%3Fsrc=usn_gp", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe3u77%3Fsrc=usn_rd&title=Alford%27s%20INT%20return%20lifts%20Falcons%20past%20Redskins%2025-19%20in%20OT", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe3u77%3Fsrc=usn_fb"], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-12T00:16:25.627+03:00", "highlightTitle": ""}