{"organizations": ["Democratic Party"], "uuid": "2ab7586482c2bd0a7234795d7723d3495010fcef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.koat.com", "main_image": "http://www.koat.com/image/view/-/35859738/highRes/2/-/maxh/630/maxw/1200/-/mcf0f1/-/Hillary-Clinton-jpg.jpg", "site_section": "http://www.koat.com/9154722?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.koat.com/politics/hillary-clinton-courts-latino-voters-in-texas/35859472", "country": "US", "title": "Clinton courts Latino voters in Texas", "performance_score": 0, "site": "koat.com", "participants_count": 0, "title_full": "Clinton courts Latino voters in Texas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:20:00.000+03:00", "replies_count": 0, "uuid": "2ab7586482c2bd0a7234795d7723d3495010fcef"}, "author": "", "url": "http://www.koat.com/politics/hillary-clinton-courts-latino-voters-in-texas/35859472", "ord_in_thread": 0, "title": "Clinton courts Latino voters in Texas", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Clinton"], "text": "Hillary Clinton courts Latino voters in Texas Latinos are critically important voting bloc for Democratic Party UPDATED 7:20 PM MDT Oct 15, 2015 Photos Alex Wong/Getty Images \nThis was not your normal Hillary Clinton rally: Supporters stood outside the venue to hear the 2016 candidate, Clinton worked the ropeline before and after the event and chants of \"Hill-ar-y, Hill-ar-y\" were heard multiple times throughout the fiery gathering here. Media Galleries Walker suspends campaign for president \nGoing into Tuesday night's Democratic debate, Clinton occasionally suffered from a lack of audience excitement. Venues that were less than full, applause lines were sometimes few and far between for speeches that were more lists than stem-winders. \nBut standing outside Sunset Station on Thursday afternoon, Clinton tapped into her confident debate performance, delivering a direct speech on immigration and guns while pledging to fight for Latinos. She also picked up an endorsement from Secretary of Housing and Urban Development Julian Castro, a rising star in the Democratic party and a widely speculated vice presidential option for Clinton. \n\"I know you have heard a lot of politicians asking for your support at election time. And then they disappear the rest of the time,\" Clinton said to a heavily Latino audience. \"But that is not me. That has never been me. Your fights are my fight, they always have been and they always will be. I am standing with you today just as firmly and proudly as I ever have.\" \nThe audience was inspired by the debate, too. \nStanding outside the event and noticing the fired-up crowd, Angela Culley, 46, said she feels different about the Clinton campaign than she did just days ago. \n\"She showed herself to be presidential, she was the most presidential candidate up there in my opinion,\" said Culley, a tourist visiting from Maryland who works for NASA. \"It brought a lot of excitement to everything.\" \nClinton walked into the event with Castro, and the two worked the ropeline before climbing on stage. Afterward, they clasped hands and raised them in the air, striking a pose often associated with presidential running mates. \nIntroducing her as the country's next \"Democratic nominee and the next president of the United States,\" Castro cast Clinton as the candidate best prepared to address the immigration system and someone who has \"has a strong vision for America's future.\" \nClinton returned the favor. \"Of course, I am thrilled to have the support and endorsement of your former mayor,\" she told the audience. \"Julian, thank you, not only for those kind and stirring words, but for your leadership.\" \nThe drumbeat around Castro becoming Clinton's vice presidential candidate is louder than any other rising Democrat. And nowhere can that drumbeat be felt louder than in San Antonio, where men and women at Thursday's event spoke of growing up with the Castros or knowing their parents well. \n\"He is the perfect one,\" said Angie Perez, who, speaking of Clinton and Castro, said they \"represent the color of the nation.\" \nPerez is a resident of San Antonio for over 30 years who worked in Democratic politics with the Rosie Castro, the Castro brother's mom. \nAfter rallying with Clinton, Castro told CNN that he endorsed Thursday, in part, because of the first Democratic debate. \nAfter the debate, he said, \"I wanted to make sure I lend all of my support to Secretary Clinton. I believe she is going to be the next president.\" \nCastro has long played down the speculation around him and the vice presidency. \n\"It's flattering,\" he said of the speculation at an event in Kansas City in July, \"but there really is not anything to make of it. ... This is not like something you run for. Nobody signs up for that. So I'm just gonna keep doing what I'm doing.\" \nFrom Castro to the crowd, though, the debate loomed large Thursday. \n\"As I said the other night in the debate, I am a progressive that likes to get things done,\" Clinton said. \"I know how to stand my ground and find common ground.\" \nShe also subtly went after her top Democratic opponent, Vermont independent Sen. Bernie Sanders, who told Clinton on Tuesday \"that all the shouting in the world is not going to do what I would hope all of us want\" on gun control. \n\"Now,\" Clinton said, offering a slight smile, \"I have been told by some quit talking about this, quit shouting about this. I will tell you right now, I will not be silenced and we will not be silenced.\" \nFour states in four days \nThursday's rally comes in the middle of a frenetic criss-crossing of the country with seven events in four states in four days. After picking up Castro's endorsement, Clinton heads to New Hampshire for two events and Alabama for another. She spent Wednesday on Wednesday where she rallied with roughly 2,500 supporters in Las Vegas. \nIn addition to rallies, Clinton has looked to capitalize on her well-received debate performance by sitting down for local interviews across the country. On Wednesday she spoke with stations in Hampton Roads, Virginia; Raleigh, North Carolina; Denver; Minneapolis; and Atlanta. \nBut while Clinton's recent success played out inside the event, an upcoming challenge was on display just outside Sunset Station's tan gates, where protesters held signs reading \"Hillary 4 Prison\" and \"Wake Up America.\" The protesters were there to heckle Clinton about the 2012 terrorist attack in Benghazi, an issue she will speak about when she testifies to Congress on the matter next week. \nClinton never mentioned the terrorist attack during the speech, instead choosing to focus on immigration. \n\"I will defend President Obama's executive actions,\" she said. \"I will stand up against any effort to deport DREAMERs and if Congress still refuses to act, I will go even further. There are more people with deep ties to our communities like many parents of Dreamers who deserve the chance to stay in America and I will fight for them too.\" \nLatinos are a critically important voting bloc for the Democratic Party, one that could possibly sway both the race for the party's nomination and the general election. Clinton finds herself in a tighter than expected race with independent Vermont Sen. Bernie Sanders and her move to consolidate Latino support is a sign the candidate is trying to solidify her base. \nLatinos voters have never been a problem for Clinton, however. During the 2008 Democratic primary, Hispanics picked Clinton over then-Sen. Barack Obama by a nearly two-to-one margin. And recent polling shows Clinton far ahead of Sanders with non-white voters. \nClinton was well aware she had a good day, too. She worked the ropeline for longer than normal after the event, shaking hands and taking selfies with excited supporters. \nWhen asked by CNN if, after the debate, she was having a good day on the trail, Clinton gave a nonverbal response: A confident thumbs-up.", "external_links": [], "published": "2015-10-16T04:20:00.000+03:00", "crawled": "2015-10-16T04:30:44.055+03:00", "highlightTitle": ""}