{"organizations": [], "uuid": "f471732f0a97db9759f5ddaa4f698418592717da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/jerryrawlingsandolusegunobasanjo620x400.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/648686/1/what-jj-told-obasanjo-over-voters-register.html", "country": "US", "title": "What JJ Told Obasanjo Over Voters' Register", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "What JJ Told Obasanjo Over Voters' Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T15:02:00.000+03:00", "replies_count": 0, "uuid": "f471732f0a97db9759f5ddaa4f698418592717da"}, "author": "", "url": "http://www.modernghana.com/news/648686/1/what-jj-told-obasanjo-over-voters-register.html", "ord_in_thread": 0, "title": "What JJ Told Obasanjo Over Voters' Register", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Politics | 12 October 2015 13:02 CET What JJ Told Obasanjo Over Voters' Register By Daily Guide \nIt has emerged that former President Jerry John Rawlings once wrote to ex-Nigerian President Olusegun Obasanjo virtually running down former President John Agyekum Kufuor over the voters' register used in the 2004 general elections. \nHe claimed the register had been padded in the strongholds of the New Patriotic Party (NPP). \nex-President Rawlings wrote to President Obasanjo, who was the Africa Union (AU) Chairman at the time and complained bitterly about how the Kufuor-led NPP government was going to use the register to shortchange his party, the National Democratic Congress (NDC), which was led by former President Professor John Evans Atta Mills. \nEx-President Rawlings copied the said letter, which was written on October 24, 2004, to many world leaders at the time including Presidents George Bush Jnr and Jimmy Carter both from the United States. \nInterestingly, the opposition NPP has also been complaining about the current voters' register and soliciting international support but the NDC has accused the main opposition party of impugning the image of Ghana. \nVolta and other regions He specifically said people from the Volta and the three Northern regions, which were the strongholds of then opposition NDC, were deliberately being disenfranchised by the Kufuor government through the compilation of the voters' register. \nHe said that 700,000 names of eligible voters principally in the Volta and Northern Regions had been removed from the register by President Kufuor deliberately or otherwise. \nHe also informed the world leaders that the Kufuor administration was interfering in the work of the Electoral Commission (EC) and intimidating its officials. \n'In the run-up to these elections, the Government has engaged in various acts that can only derail the possibility of a free, fair and transparent process of determining the will of the Ghanaian people,' he claimed. \nEC in danger 'There has been interference by the government with the functions of the National Electoral Commission (NEC) as well as manipulation and intimidation of a good number of officials of the Commission which has since its establishment established a reputation for independent and effective conduct of elections in Ghana. It is now in danger of becoming a tool of the government in its determination to hang onto power against the wishes of the people, despite efforts by the Commissioner to maintain the integrity of the Commission. A clear manifestation of this is in the conduct of the exercise of voter registration carried out over the last few months,' he claimed. 'Strenuous efforts have gone into seeking essentially to disenfranchise large numbers of people in areas known to be strongholds of the opposition. From the recent exhibition in public of the Electoral Register – during the period of 12th-17th October 2004 – it has come to light that approximately 700,000 names of eligible voters principally in the Volta and Northern Regions of Ghana have been removed either deliberately or in error.\n'On the other hand persons, whose identity and eligibility to vote have not been certified, are being allowed to register even though the statutory period for voter registration ended some two months ago.' \nPious platitudes He said, 'Attempts to draw attention to these matters have been met with defensive evasions on the part of the commission and pious platitudes from the government about commitment to free and fair elections when all the evidence points to the contrary.' \nEx-President Rawlings attached a press statement issued on July 1, 2004 by then NDC presidential candidate Prof. Mills and another booklet prepared on September 1, 2004 to diplomatic missions and election observers to the letter and detailed how the NPP was going to retain power through the exercise. \nParty Police Ex-President Rawlings also accused the NPP government of training and arming foreign mercenaries as well as forming special party police purposely to do the bidding of the government in the election, saying 'in the face of these reports the government and its security apparatus resort to issuing false alarms about coup plots involving members of the NDC, particularly myself.' \nMedia monopoly He said the NPP government was 'manipulating the minds of the people in relation to positive political exchange, Ghanaian people- literate, semi-literate and illiterate.' \nHe also said the NPP government had created 'monopoly and intimidating grip on media exposure in their favour to the detriment of democracy, justice and free and fair election, and the rights of all other political parties in the system.' \nVote buying 'Take the pathetic situation of blatantly and literally misusing and distributing state funds and resources to all levels of citizens from chiefs down to the ordinary man, to influence votes. This is a violation and an insult to the intelligence, sensibilities and sensitivities of people. In short, their survival rests on fast-tracking the rot of our body-politic and society. \n'Members of the incumbent government have at various times in their careers been involved in governance. It is most unfortunate that in their present situation, their fear and reluctance to allow or encourage good governance is at the top of the agenda. Press, media and Judiciary manipulation is used to cover up amazing levels of blatant corruption. \n'Their very desperate measures to hold onto power are simply to cover up the serious nature of their crimes and misdeeds. President Kufuor must be made aware that anything short of free and fair electoral process can only lead to a derailment of our democracy.' \nBy William Yaw Owusu", "external_links": [], "published": "2015-10-12T15:02:00.000+03:00", "crawled": "2015-10-13T12:04:52.290+03:00", "highlightTitle": ""}