{"organizations": [], "uuid": "f33a42f499c41e8a28002ad9d463d5d438d9e784", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/K%20T%20Rama%20Rao_0_1_1_0_0.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151002/nation-current-affairs/article/kt-rama-rao-opposition-unity-snake-mongoose-bond", "country": "US", "title": "KT Rama Rao: Opposition unity is like snake-mongoose bond", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "KT Rama Rao: Opposition unity is like snake-mongoose bond", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:12:00.000+03:00", "replies_count": 0, "uuid": "f33a42f499c41e8a28002ad9d463d5d438d9e784"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151002/nation-current-affairs/article/kt-rama-rao-opposition-unity-snake-mongoose-bond", "ord_in_thread": 0, "title": "KT Rama Rao: Opposition unity is like snake-mongoose bond", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | October 02, 2015, 01.34 am K.T. Rama Rao Hyderabad: IT minister K.T. Rama Rao on Thursday said the Opposition was shedding crocodile tears for farmers and creating a ruckus to defame the TRS government as they had no other issue to highlight. “The only agenda of the Opposition seems to be to create a ruckus and defame the government. They want us to wipe out all their mistakes in 15 months. How is it possible? We are worried about farmers getting demoralised further with such behaviour. The people will teach the Opposition a fitting lesson,” Mr Rao said after the Assembly was adjourned on Thursday. He said the Congress, BJP, TD and others with extreme ideologies had come on one platform, which was like a snake making friends with mongoose, and added that the TRS was “Tiruguleni Rajakiya Shakti (unchallenged political power).” Mr Rao said Chief Minister K. Chandrasekhar Rao could have exposed the hollowness of the Opposition in the Assembly but avoided it keeping in view the seriousness of the issue. “We clearly stated in the Assembly what we have done. What did they do?” he asked. The government, he said, was seriously considering one-time settlement of loan waiver, declaring drought hit mandals soon, ensuring nine-hour power supply in the day from next year besides bringing in a new money lenders Act and a Bill permitting swapping of lands. “We are trying to instil confidence in farmers, but the Opposition is trying to demoralise them. We did a lot in 15 months. No farmer has come on the streets for seeds, fertiliser and power,” he said. He asked the BJP to support it to secure money for the one-time settlement of Rs 8,000-crore crop loan waiver instead of in instalments. “BJP leaders G. Kishan Reddy and K. Laxman, instead of creating a ruckus here, should influence Prime Minister Narendra Modi and get Rs 8,000 crore as advance beside a financial package, tax incentives and schemes for Telangana state on par with Andhra Pradesh and other states. On what basis did Mr Modi give a Rs 1.5 lakh crore package to Bihar? Packages should not be only for states going to polls but also for new states like Telangana,” he said. States: Telangana South Telangana KT Rama Rao Also Read Health director Dr Sambasiv Rao removed Andhra Pradesh govt allots land for missile testing range in Kurnool district Automobile industry on a high as sentiments improve Pollachi broad gauge awaits green signal", "external_links": ["http://platform.twitter.com/widgets.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151002/nation-current-affairs/article/kt-rama-rao-opposition-unity-snake-mongoose-bond", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/K%20T%20Rama%20Rao_0_1_1_0_0.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/K%20T%20Rama%20Rao_0_1_1_0_0.jpg", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share"], "published": "2015-10-02T16:12:00.000+03:00", "crawled": "2015-10-02T05:43:34.319+03:00", "highlightTitle": ""}