{"organizations": [], "uuid": "03762773bcda2c87dcfa621db726e207bbe660fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8918913_G.jpg", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30158902/house-passes-defense-bill-that-obama-threatens-to-veto", "country": "US", "title": "House passes defense bill that Obama threatens to veto", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "House passes defense bill that Obama threatens to veto - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "03762773bcda2c87dcfa621db726e207bbe660fc"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30158902/house-passes-defense-bill-that-obama-threatens-to-veto", "ord_in_thread": 0, "title": "House passes defense bill that Obama threatens to veto", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By DEB RIECHMANN\nAssociated Press WASHINGTON (AP) - The Republican-led House on Thursday approved a multibillion-dollar defense policy bill despite a White House veto threat.\nThe vote was 270-156, more than enough to sustain a veto.\nThe $612 billion bill - covering new ships, aircraft and pay raises for military personnel - authorizes an increase in spending that President Barack Obama had requested, but he strenuously opposes the way Congress did it.\nLawmakers increased defense spending by padding a separate war-fighting account with an extra $38.3 billion. That account - for overseas contingency operations - is not subject to spending limits.\nA vote is scheduled in the Senate next week.\nThe defense policy bill is one of the few bipartisan measures in Congress that has readily become law for more than a half-century, but Obama's veto threat jeopardizes the legislation.\nThe dispute is over whether Congress should break through spending caps when it comes to defense, but adhere to them for domestic agencies. Obama and his Democratic supporters say no. Republicans argued that the bill authorizes money for national security amid global threats.\nRep. Mac Thornberry, R-Texas, the chairman of the House Armed Services Committee, said the bill is critical for the troops and for national security.\n\"This is no time for political games,\" Thornberry said during House debate. \"This is the time to come together and pass a bill that helps provide for the country's security. ... This is a dangerous world, and it is getting more dangerous by the minute.\"\nRep. Steny Hoyer of Maryland, the No. 2 Democrat in the House, said using the warfighting account employs a strategy to \"sneak around\" the ceilings Congress imposed to check spending. Hoyer said the special account is handled on a year-to-year basis.\n\"That's why the Pentagon is opposed to it,\" Hoyer said. \"That's why the joint chiefs believe this is bad fiscal policy for the military. ... Such an approach to funding undermines the Pentagon's long-term planning process, which is based on multi-year budgets.\"\nThe bill maintains restrictions on transferring terror suspects out of the military prison at Guantanamo Bay, Cuba; provides a 1.3 percent pay increase to service members; authorizes lethal assistance to Ukraine forces fighting Russian-backed rebels; extends the ban on torture to the CIA; and authorizes the president's request of $715 million to help Iraqi forces fight Islamic State militants.\nEarlier this week, the White House reiterated Obama's veto threat. The president's press secretary, Josh Earnest, called it an \"irresponsible way to fund our national defense priorities.\" Defense Secretary Ash Carter also spoke out against it.\n\"Attempts to evade the question of overall fiscal responsibility with the so-called OCO gimmick ... is objectionable to me and to others in other agencies, and I think ought to be to the taxpayer, and certainly to the warfighter,\" Carter told reporters.\nMajority Leader Mitch McConnell urged Senate Democrats on Thursday to vote for it.\n\"This is the legislation that sets out military policy and authorizes funds for our military annually,\" McConnell said. \"It's always one of the most important bills we consider each year, but it's especially important now. The number of threats currently facing us is staggering.\"\nSeparately, the House backed a bill to block implementation of the Iran nuclear deal until Tehran pays some $43 billion in damages that U.S. courts have awarded to victims of Iranian-sponsored terror.\nThe bill passed on a 251-173 vote, but is unlikely to clear the Senate or become law.\nObama has threatened to veto it, saying it undermines the international accord that provides Iran billions in sanctions relief in exchange for constraints on its nuclear program.\nThe bill, by Pennsylvania Republican Rep. Patrick Meehan, would have prohibited the president from lifting sanctions until the victims' claims are paid.\nMeehan says opponents put \"Iran's terror machine\" before American victims of Iranian terror.\nDemocrats said the GOP was trying to stop implementation of the deal.\nAs Israeli Prime Minister Benjamin Netanyahu spoke at the United Nations criticizing the nuclear deal with Iran, Democrats introduced legislation in the Senate that calls for shoring up Israeli security, clarifies some parts of the deal and strengthens oversight and enforcement of the agreement. The measure was introduced by nine senators, including some who opposed the deal.\n ", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T01:15:22.149+03:00", "highlightTitle": ""}