{"organizations": [], "uuid": "4296d4a504f0d5f11fbe0282900350fde4e2e088", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/LAND%20COPY.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151002/nation-current-affairs/article/150-agriculture-officers-%E2%80%98work%E2%80%99-hyderabad", "country": "US", "title": "150 agriculture officers ‘work’ in Hyderabad", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "150 agriculture officers ‘work’ in Hyderabad", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:12:00.000+03:00", "replies_count": 0, "uuid": "4296d4a504f0d5f11fbe0282900350fde4e2e088"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151002/nation-current-affairs/article/150-agriculture-officers-%E2%80%98work%E2%80%99-hyderabad", "ord_in_thread": 0, "title": "150 agriculture officers ‘work’ in Hyderabad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | L. Venkat Ram Reddy | October 02, 2015, 01.20 am While Telangana state faces a severe agrarian crisis, agriculture staff are “misutilised” Hyderabad: While there is no agriculture in Hyderabad, over 150 officials and staff of agriculture department are working in the Telangana state capital on deputation in various departments. The agriculture department staff, which has to be at the forefront in assisting farmers in villages at a time when the state is facing a severe agrarian crisis, has settled in Hyderabad leaving the districts. Chief Minister K. Chandrasekhar Rao has taken a serious view of the issue and asked the various departments to relieve the agriculture staff on deputation immediately and send them back to their parent department. Plans have been prepared to train all agriculture officers in districts as agronomists with the help of Israel and China so that their services could be utilised to optimum potential in agriculture sector. Raising the issue of agriculture officials working in Hyderabad on deputation leaving villages, MIM Floor leader Akbaruddin Owaisi said, “The agriculture department officials and staff are supposed to work in mandals and villages in districts and assist farmers. However, they are allowed to work in agriculture departments and other departments in Hyderabad on deputation. This way, several agriculture employees have shifted to Hyderabad. The government should immediately cancel such deputations and send them back to districts.” Senior officials of agriculture department acted swiftly following the CM’s directions and started the exercise to identify agriculture officials working on deputation in Hyderabad. “We are cancelling the deputation of such officials. Already about 30 agriculture officials and staff working on deputation in Hyderabad have been identified and sent back to districts. The process will continue till all such officials and staff are sent back to parent department and serve in mandals and villages,” said C. Partha Sarathi, secretary to government, agriculture department. Telangana state has been witnessing an unprecedented agrarian crisis this year with farmer suicides being reported every day due to drought conditions for the second consecutive year forcing the government to re-draw its priorities to revive the agriculture sector. “Research and extension facilities play a major role in agriculture sector. Unfortunately, both were neglected for over a decade. There is no major research undertaken in agriculture university or extension services being provided to farmers due to shortage of staff. The TS government has decided to enhance grants for agriculture university besides appointing an agriculture extension officer for every 5,000 hectares of crop sown area, The recruitment process will be taken up very soon,” said agriculture minister Pocharam Srinivas Reddy. States: Telangana South Telangana agriculture department Also Read BBMP power struggle: Siddaramaiah gets green signal for alliance with JD(S) Tamil Nadu ranks second after Maharashtra in cop suicides Hyderabad police raid city shops for kids Congress attacks TDP on Andhra Pradesh's poor show in Swachh Bharat rankings", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/LAND%20COPY.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/LAND%20COPY.jpg", "https://apis.google.com/js/plusone.js", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151002/nation-current-affairs/article/150-agriculture-officers-‘work’-hyderabad"], "published": "2015-10-02T16:12:00.000+03:00", "crawled": "2015-10-02T05:50:49.055+03:00", "highlightTitle": ""}