{"organizations": [], "uuid": "ddfad0f3dfd71850d1a482a9e7a083d24adbf4a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "https://horseradish.s3.amazonaws.com/CACHE/images/photos/09/32/736f348d4f83/steve-180sq.png", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/politics/2015/10/opengov-voices-for-lobbying-in-the-u-k-its-time-for-a-change-2747196.html", "country": "US", "title": "OpenGov Voices: For lobbying in the U.K., it's time for a change | Politics", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "OpenGov Voices: For lobbying in the U.K., it's time for a change | Politics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T11:06:00.000+03:00", "replies_count": 0, "uuid": "ddfad0f3dfd71850d1a482a9e7a083d24adbf4a3"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/politics/2015/10/opengov-voices-for-lobbying-in-the-u-k-its-time-for-a-change-2747196.html", "ord_in_thread": 0, "title": "OpenGov Voices: For lobbying in the U.K., it's time for a change | Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nBy The Sunlight Foundation\nSteve Goodrich, open governance researcher for TI-UK To our dear cousins in North America, the U.K. must seem like a terribly eccentric place. We have an unelected head of state who has reigned for over half a century ; our head of government chooses half of the legislature , who debate in a crumbling palace which doesn’t have enough seats to fit them all ; and our elected representatives are not allowed to resign due to a parliamentary quirk that goes back to 1624. Twenty-first century it is certainly not.\nThe same goes for the way in which our politics operates. Unlike the U.S . and Canada , which have some transparency around who is lobbying public officials, few — apart from those who reside within the “Westminster bubble” — know who is trying to influence our political system. Although our political establishment has made tentative moves to improve this somewhat antiquated situation (opacity is awfully last century), these have been laughable . Obviously, lawmakers have not understood why transparency matters .\nIn 2014, four years after it promised to the public that it was going to make lobbying transparent, the U.K. government brought forward legislation that would introduce a very limited statutory register of lobbyists. This would only require consultant lobbyists – those representing clients – to register if they directly contacted a small range of people, such as ministers and some senior government officials. So, hypothetically speaking, you could be a gigantic corporate monolith spending considerable sums of money trying to influence the U.K. government’s deliberations on a significant issue that could affect tens of millions of people and billions of pounds of public funds — yet Joe Public would be none the wiser.\n(Photo credit: LucaZola/iStockPhoto) In response to this pointed criticism, the government timidly claimed that it was already publishing the details of meetings between lobbyists and ministers online . However, our recent analysis of this data has found that it is hopelessly out of date and provides almost no useful insights into what’s being discussed; one department stated 48 of these meetings were to “discuss trade and investment” — how helpful.\nDespite these difficulties, and after some hard data cleansing, we managed to identify over 2,735 companies and individuals meeting with ministers during one quarter alone. Some estimates have put the total number of lobbyists in the U.K. at around 4,000. The statutory register of lobbyists only contains around 90 organizations representing 300 or so clients. It is, therefore, understandable why the U.K.’s system of lobbying regulation has been labeled “seriously flawed” by parliamentarians .\nAs well as being pointlessly narrow in scope, those lobbyists having to register only have to provide the smallest amount of details: their name, address, unique company identifier and the names of any directors or partners. That means no information about what they are trying to influence; no information about how much they are spending; no information about whether they are employing any former public servants, who might use their knowledge and contacts to provide them with unfair access to decision-makers; and no information about who they are actually employing to do the influencing work. In short, all the information that could make U.K. politics more open is not available.\nDespite this “ dog’s breakfast ” of a law, which surprised many by actually making it to the statute book, there is some prospect of reform on these fair and ancient isles. The Scottish government has introduced a draft law that could bring forward improved lobbying transparency north of the English border. Yet even its proposals fall slightly short of the mark : Under the Scottish government’s current plans, lobbyists would only be covered if they have face-to-face meetings with ministers, and the reporting requirements would not provide much more information about what they’re trying to influence or how much they are spending on these activities.\nTo try and nudge our governments in the right direction, Transparency International UK has published a new policy paper outlining good practice standards for regulating lobbying across the U.K.’s various political institutions. This covers lobbying transparency, integrity standards for public officials and ways to manage to revolving door between public and private sectors. If politicians from all parts of the Kingdom took note of these proposals, we might finally start dragging our political system into the latter part of the 20th century.\nAlongside this paper we launched our “ Transparency Matters ” campaign. This aims to highlight the importance of transparency in the fight against corruption and the effect it has on our everyday lives. To find out more, visit our website and contribute by telling us your stories and tweeting why #TransparencyMatters to you.\nSteve Goodrich is Transparency International U.K.’s (TI-UK) open governance researcher. He is responsible for leading on TI-UK’s research into lobbying, open data and state accountability. Before joining TI-UK in May 2015, Steve worked as a senior policy adviser at the U.K. Electoral Commission. He has over five years’ experience working on political finance regulation, legislation and data. Disclaimer: The opinions expressed by the guest blogger and those providing comments are theirs alone and do not reflect the opinions of the Sunlight Foundation.\nInterested in writing a guest blog for Sunlight? Email us at guestblog@sunlightfoundation.com\nThe Sunlight Foundation is a non-profit, nonpartisan organization that uses the power of the Internet to catalyze greater government openness and transparency, and provides new tools and resources for media and citizens, alike.", "external_links": ["http://www.theguardian.com/politics/2015/mar/03/parliament-falling-down-palace-westminster-restoration-cost", "http://www.parliament.uk/about/how/guides/factsheets/procedure/p11/", "http://sunlightfoundation.com//feeds/blog/https://twitter.com/search?q=%23TransparencyMatters&#038;src=typd", "http://www.transparency.org.uk/news-room/12-blog/1334-time-to-make-lobbying-influence-accountable", "http://www.ocl-cal.gc.ca/eic/site/012.nsf/eng/00035.html", "https://horseradish.s3.amazonaws.com/CACHE/images/photos/40/12/254448a749e1/lobbying-800.png", "http://www.publications.parliament.uk/pa/cm201314/cmselect/cmpolcon/601/601.pdf", "http://www.transparency.org.uk/news-room/12-blog/1302-can-scotland-lead-on-lobbying", "http://www.bbc.co.uk/news/uk-politics-34084194", "http://www.transparency.org.uk/publications/15-publications/1336-accountable-influence-bringing-lobbying-out-of-the-shadows", "http://sunlightfoundation.com//feeds/blog/https://www.gov.uk/government/uploads/system/uploads/attachment_data/file/78977/coalition_programme_for_government.pdf", "http://www.bbc.co.uk/news/uk-34177107", "http://www.telegraph.co.uk/news/politics/10251478/Lobbying-Bill-is-a-dogs-breakfast-MP-warns.html", "http://www.transparencymatters.transparency.org.uk/", "http://sunlightfoundation.com/", "http://reporting.sunlightfoundation.com/lobbying/", "https://horseradish.s3.amazonaws.com/CACHE/images/photos/09/32/736f348d4f83/steve-180sq.png"], "published": "2015-10-05T11:06:00.000+03:00", "crawled": "2015-10-05T13:44:29.377+03:00", "highlightTitle": ""}