{"organizations": ["MDPS", "Ministry of Development Planning", "GNI"], "uuid": "6f71bef5b838b2eede353647cc04bec14cf32fa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/economy_politics.xml", "section_title": "Zawya.com - Economy & Politics News", "url": "http://www.zawya.com/story/Qatars_gross_national_income_falls_172-ZAWYA20151016053725/", "country": "AE", "title": "Qatar's gross national income falls 17.2%", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Qatar's gross national income falls 17.2%", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:06:00.000+03:00", "replies_count": 0, "uuid": "6f71bef5b838b2eede353647cc04bec14cf32fa8"}, "author": "", "url": "http://www.zawya.com/story/Qatars_gross_national_income_falls_172-ZAWYA20151016053725/", "ord_in_thread": 0, "title": "Qatar's gross national income falls 17.2%", "locations": ["Qatar"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Add to Reading List Qatar's gross national income (GNI) plunged 17.2% year-on-year to QR150.81bn in the second quarter (Q2) of this year, according to official figures. The GNI was down 3.4% compared to the first quarter (Q1) of 2015, the Ministry of Development Planning and Statistics said. The country's gross national savings declined 29.9% y-o-y to QR77.15bn and it was down 4.2% against Q1, 2015. The gross saving ratio to nominal GDP (gross domestic product) in Q2, 2015 has been estimated at 50.4% compared to 58.2% in the previous year period. The comparative figure for Q1, 2015 was 50.5%. MDPS said rising population and the price rise of consumer items in the country have led to the household final consumption expenditure (HFCE) increase 11.2% y-o-y to QR31.61bn in Q2, 2015. It had, however, fallen 0.6% compared to Q1, 2015. The share of HFCE in the nominal GDP, in Q2, 2015 is estimated at 20.7%. The corresponding figures for Q2, 2014 and Q1, 2015 are 15% and 19.9% respectively. Increase in sovereign spending is in line with the rise in production of public goods and services to cater the growing population led the government final consumption expenditure (GFCE) to expand 10% y-o-y to QR29.7bn in Q2, 2015. It showed 1.5% rise against Q1, 2015. The proportion of GFCE in nominal GDP during Q2, 2015 has been estimated at 19.4%. The corresponding shares for Q2, 2014 and Q1, 2015 have been 14.3% and 18.3% respectively. The gross capital formation (GCF) has marginally fallen by 0.8% y-o-y to QR60.62bn in Q1, 2015. It registered a marginal 0.2% rise compared to Q1, 2015. The GCF accounted for 39.3% of nominal GDP during Q2, 2015 against 32% the year-ago period. The corresponding share for Q1, 2015 has been estimated at 37.6%. Qatar's total exports (valued at free on board) had plummeted 34.3% y-o-y to QR86.41bn in Q2, 2015 mainly due to lower shipments of mineral fuels, lubricants and related materials. Exports had fallen 4.6% against Q1, 2015. Exports constituted 56.5% of nominal GDP in Q2, 2015 compared to 69.5% in the comparable period of 2014. The corresponding share for Q1, 2015 was 56.7%. Total imports (valued at cost insurance freight) also showed 5.8% decline y-o-y to QR54.88bn in Q2, 2015 on higher intake of crude materials, inedible, except fuels, transport and communication service. It had however expanded 5.6% compared to Q4, 2014. Imports were 35.9% of nominal GDP in Q2, 2015 against 30.8% in the previous year period. Its share was 32.6% in Q1, 2015. © Gulf Times 2015", "external_links": [], "published": "2015-10-16T09:06:00.000+03:00", "crawled": "2015-10-16T14:21:13.412+03:00", "highlightTitle": ""}