{"organizations": ["World Bank", "FBI", "Malaysia Airlines", "Twins", "TWA", "Congress", "Gerrard Williams", "U.S. Navy", "United Nations", "USSR"], "uuid": "ef518188e13ef5eab8618c152cb2f9c7c8998f7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.watchmojo.com", "main_image": "/uploads/mojothumbs/PH-H-Another-Top10-Conspiracy-Theories-of-All-Time-720p30_100.jpg", "site_section": "http://www.watchmojo.com/rss/feeds.php?id=12", "section_title": "WatchMojo.com Politics and History", "url": "http://www.watchmojo.com/index.php?id=14478", "country": "US", "title": "Another Top 10 Conspiracy Theories of All Time", "performance_score": 0, "site": "watchmojo.com", "participants_count": 0, "title_full": "Another Top 10 Conspiracy Theories of All Time", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:19:00.000+03:00", "replies_count": 0, "uuid": "ef518188e13ef5eab8618c152cb2f9c7c8998f7e"}, "author": "", "url": "http://www.watchmojo.com/index.php?id=14478", "ord_in_thread": 0, "title": "Another Top 10 Conspiracy Theories of All Time", "locations": ["Pearl Harbor Attack The U.S.", "America", "US", "South America", "Pearl Harbor", "Indian Ocean", "Oxford", "Argentina", "Brazil", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Edward de Vere", "Bard", "Charles Elliot Perkins", "Gargarin", "Al Gore", "Mengele", "Simon Dunstan", "Adolf Hitler", "Mary Magdalene", "David Icke", "Diego Garcia", "Hitler", "Grey Wolf", "Yuri Gagarin", "Josef Mengele", "Franklin Delano Roosevelt", "Candido Godoi", "Shakespeare", "Eva Braun", "William Shakespeare"], "text": "  Another Top 10 Conspiracy Theories of All Time The world is full of wild conspiracy theories, so much so that we couldn’t just limit our entries to one list! Welcome to http://www.WatchMojo.com, and today we’re counting down our picks for Another Top 10 Conspiracy Theories of ALL TIME. For this list, we are looking at hypotheses and theories that suggest people have hidden or brought about a certain event or situation that is usually against the law or destructive to others. If you don’t see a theory that you think should be on the list, be sure to check out our videos of the Top 10 Conspiracy Theories of All Time and the Top 10 Crazy Conspiracy Theories. #10: Hitler Lived Out the Rest of His Life in Argentina A number of conspiracy theories are attached to famous figures in history, and Adolf Hitler is no different. With the Allies closing in and the war all but over, Hitler committed suicide in his bunker with his wife, Eva Braun. British authors Simon Dunstan and Gerrard Williams have a different theory about Hitler’s end, however – they believe that the Fuhrer didn’t actually kill himself, but rather escaped to Argentina and body doubles were shot instead. According to their book, “Grey Wolf: The Escape of Adolf Hitler,” the married couple settled down and had two daughters in South America before dying in 1962. This idea has been widely dismissed by historians, though, who claim that the theory has no substance. #9: Josef Mengele and the Land of the Twins From one Nazi to another, Josef Mengele, aka the “Angel of Death,” was assigned the task of discovering how twins were produced, in the hopes that this information could increase the Aryan birthrate. According to one theory, Mengele was successful – just not in Germany. He was said to have fled to Candido Godoi, a small town in Brazil, near the end of the war, and continued to visit it in the ‘60s. This is the same town that has seen as many as one in five pregnancies result in twins. In fact, the town’s official crest has a road sign that welcomes visitors to the “Land of the Twins.” Historians dispute the idea that Mengele ever actually experimented with twins there, while geneticists believe biological factors explain the twin phenomenon. #8: Lost Cosmonauts Yuri Gagarin was the first human to journey to outer space…or was he? According to the Lost or Phantom Cosmonauts conspiracy theory, Gargarin was the first human to survive the journey, but he was not the first sent to space. Allegedly, the Soviet Union launched at least two unsuccessful manned space flights before Gargarin’s. However, any information about these flights was concealed from the public because of the ongoing Cold War. Though most of the state’s formerly restricted information has become available since the collapse of the USSR, there has been little uncovered to support this particular theory. #7: MH370 Landed on Diego Garcia Since the disappearance of Malaysia Airlines Flight 370 on March 8th 2014, there have been a number of theories that have emerged surrounding the incident. One theory claims that the plane was heading towards a US military base on Diego Garcia in the Indian Ocean, but was shot down by US forces who feared that the plane may have been attempting an attack on the base. While the FBI has disputed these allegations, the lack of an actual explanation for the disappearance means that this theory likely won’t go away anytime soon. #6: Shakespeare Didn’t Write All His Plays Did the most famous playwright of all time even exist? Probably yes. But he may not have written all of his plays, at least according to this theory. Some people claim that William Shakespeare was just a pen name used by a number of different writers. Then there are others who believe in the Oxfordian theory of Shakespeare authorship, which claims that the 17th Earl of Oxford, Edward de Vere, actually wrote what’s considered to be the Bard’s work. These alternative authorship theories have gained some traction due to the lack of biographical information about Shakespeare’s life, but they are generally disregarded among English historians. #5: Water Fluoridation for Mass Mind Control Fluoride helps make human teeth stronger, but some people believe that the government is putting fluoride in drinking water for another reason – to control the population. In 1954, chemist Charles Elliot Perkins declared that anyone who drinks fluoridated water for over a year will never be the same again, either mentally or physically. During World War II, the Nazis allegedly used fluoridated water to force people in concentration camps into calm submission or even to sterilize humans. While it’s been argued that the Nazi claim is an urban myth, it’s also been alleged that water fluoridation was part of a plot to enforce Communism in America in the ‘50s and ‘60s. #4: World Leaders Are Lizard People [aka Reptilians] Are a bunch of lizards responsible for the 9/11 attacks and the Holocaust? According to one theory… yes. In David Icke’s book “The Biggest Secret”, he claimed that most world leaders are actually shape-shifting reptilian beings (or have been possessed by them) and use horrific events to promote fear and hatred. They are also apparently between seven to 12 feet tall and come from a different planet. What more do you need to know? #3: Global Warming Is a Hoax One of the most popular and socially relevant theories on our list, this is one where people believe that global warming isn’t actually happening. While Al Gore and almost all scientists have provided evidence to the contrary, this theory claims that climate change is a hoax created by the government to keep the public in a state of worry and panic, making them easier to control. Some supporters of this theory also claim that technology is responsible for raising the Earth’s temperature, a technology that the government is keeping secret. #2: Advance-Knowledge of Pearl Harbor Attack The U.S. government has been the target of several conspiracy theories throughout its history, with one of the biggest revolving around Pearl Harbor. This theory suggests that President Franklin Delano Roosevelt knew about the planned Japanese attack in December 1941, but decided not to act, because he needed an excuse to get the Americans into the Second World War. This theory gained some traction because the American public and Congress were overwhelmingly against joining the conflict at the time, but it has largely been dismissed by historians. Before we unveil our number one pick, here are a few honourable mentions: Jesus & Mary Magdalene Were Married, or at Least a Couple TWA Flight 800 Crash Was the Result of U.S. Navy Missile Test or Terrorist Strike Denver Airport is the HQ of Illuminati, New World Order, Neo-Nazi or Reptoids ‘The Protocols of the Elders of Zion’ & the Jewish Plot for World Domination #1: New World Order The most powerful people in the world might not be lizards, but they may be part of a secret organization, at least according to this conspiracy theory. The goal of all these groups, including the Illuminati, is to create the New World Order, an authoritarian government that will rule the world. They allegedly use mind control, social engineering, and fear-based propaganda to manipulate the population, and oversee all the important institutions and organizations in the world, such as the United Nations and World Bank. Do you agree with our list? What is your favorite conspiracy theory? For more great Top 10s published daily, be sure to subscribe to WatchMojo.com. RELATED WM VIDEOS", "external_links": [], "published": "2015-10-09T23:19:00.000+03:00", "crawled": "2015-10-09T23:23:12.107+03:00", "highlightTitle": ""}