{"organizations": [], "uuid": "f9ea771eb33667b95002293175ab1737a8b4aa8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thepoliticalbouillon.com", "main_image": "http://thepoliticalbouillon.com/en/wp-content/uploads/2015/10/Medical-care-1362384826_43-660x330.jpg", "site_section": "http://thepoliticalbouillon.com/en/feed/", "section_title": "The Political Bouillon", "url": "http://thepoliticalbouillon.com/en/canadas-impending-implementation-of-the-end-of-life-legislation-and-its-impact-on-palliative-care-programs/", "country": "CA", "title": "Canada’s Impending Implementation of the End-Of-Life Legislation and its Impact on Palliative Care Programs", "performance_score": 0, "site": "thepoliticalbouillon.com", "participants_count": 1, "title_full": "Canada’s Impending Implementation of the End-Of-Life Legislation and its Impact on Palliative Care Programs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:17:00.000+03:00", "replies_count": 0, "uuid": "f9ea771eb33667b95002293175ab1737a8b4aa8d"}, "author": "Gabriela Navarrete", "url": "http://thepoliticalbouillon.com/en/canadas-impending-implementation-of-the-end-of-life-legislation-and-its-impact-on-palliative-care-programs/", "ord_in_thread": 0, "title": "Canada’s Impending Implementation of the End-Of-Life Legislation and its Impact on Palliative Care Programs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » AMERICAS » Canada’s Impending Implementation of the End-Of-Life Legislation and its Impact on Palliative Care Programs Medical care Posted by: Gabriela Navarrete October 7, 2015 in AMERICAS , CANADA , MONTREAL Share ! tweet \nIn Canada, between 2005 and 2036, the demographic group of Canadian citizens aged 65 years and older is projected to increase by up to 25%, and the number of deaths by 65%. Until recently, there has been an apathetic political response in regards to the topic of end-of-life. By February 5, 2016, assisted dying and suicide (also referred to as euthanasia) will no longer be considered a culpable homicide under Canada’s criminal code . Canada will become one of the few countries with such legislation, alongside Belgium and the Netherlands . Once assisted dying is no longer illegal, how will this affect the patients and institutions of palliative care? The West Island Palliative Care Residence in Montreal claims they will not be providing this service due to their disbelief in assisted dying. This judgment stems from the conception that once Canadians have complete accessibility to palliative care and more resources are provided, those in need will prefer assisted suicide to the traditional institutionalized hospital care structure we have now. Regardless of which point of view you affirm, Canadian society, especially the increasingly aging segment of the population, will largely be affected by the approaching euthanasia policy. Existing palliative care programs will also sense its ramifications. \nSeventy percent of elderly patients in Canada have shown interest towards a less institutionalized death and that they would prefer to end their life in a more comfortable place. There is a huge misconception as to what exactly palliative care is. Patients of the program would not only be care for, but would also reside in the hospice. According to BJ Miller, a palliative care physician at Zen Hospice Project, “suffering has no good purpose but with palliative care, necessary suffering unites the caregiver and the receiver”. With psychological and physical components, palliative care endorses the importance of family and friends in the last stages of life, as well as providing patients with medical attention. This ultimately influences their end of life experience in a positive manner. Despite the fact that there has yet to be any palpable evidence that the legalization of euthanasia has a negative impact on the availability and quality of palliative care, many in the medical community are critical of the future program. A consequence of the new end-of-life legislation consists of health care institutions developing a policy and code of ethics on medical aid in dying. Although the Canadian Medical Association has expressed apprehension regarding the insurance to equal access to assisted dying, there is also a concern for the availability of resources needed for palliative care. \nAt the annual Canadian Medical Association meeting in 2014, doctors agreed that there is a lack of equality and availability of palliative care. This is relevant because if access to palliative care were more easily accessible then perhaps assisted dying would not have been Canada’s alternative to the change in healthcare. The House of Commons passed a non-binding notion that called on the government to work with provinces and territories to ensure access to palliative care. However, this notion is called into question since there is a larger focus on assisted dying than there is on palliative care. From October 29-November 1, 2015 in Ottawa, the Canadian Hospice Palliative Care Conference will be held. This conference will discuss the outcome of new research and expansions of the palliative care community with the presence of palliative care workers, physicians, and other trained experts in medical science. \nBy the decision of the Supreme Court of Canada, the provisions prohibiting assisted suicide will no longer be in effect as of next year. This law includes that with medical aid, an individual can terminate their life if they meet certain criteria , such as they are; insured by the Health Insurance Association, experiencing intolerable pain, in an advanced stage of a serious illness, at their end of life stage and are of consenting status. An argument against palliative care is that there is an unequal access, however the Canadian government seems more concerned about assisted dying than ensuring that equalization. It is of great importance that the nation is taking a step in the realms of healthcare, but is it a step-forward or step-backwards? There have been and will continue to be endless arguments both for and against euthanasia. Yet, with those arguments aside, the importance of palliative care must be regarded. \n– Gabriela Navarrete", "external_links": [], "published": "2015-10-08T05:17:00.000+03:00", "crawled": "2015-10-08T17:54:33.821+03:00", "highlightTitle": ""}