{"organizations": [], "uuid": "3727963d526dd3ce7c33aa3205d5ddd69be6ac2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2398159!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/492348582.jpg", "site_section": "http://www.nydailynews.com/news/politics/index.html", "section_title": "New York, U.S. Politics, Columnists &amp; Political Cartoons - NY Daily News", "url": "http://www.nydailynews.com/news/politics/author-susan-cheever-donald-trump-controllin-article-1.2398160", "country": "US", "title": "Author Susan Cheever knows why Trump is so controlling", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Author Susan Cheever knows why Trump is so controlling - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "3727963d526dd3ce7c33aa3205d5ddd69be6ac2c"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/news/politics/author-susan-cheever-donald-trump-controllin-article-1.2398160", "ord_in_thread": 0, "title": "Author Susan Cheever knows why Trump is so controlling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Darren McCollester/Getty Images According to one author, Donald Trump’s personality is typical for a non-drinker from a drinking family. What do John Quincy Adams, Gen. George Custer and The Donald have in common?\nAccording to Susan Cheever, author of “Drinking in America,” they all have typical teetotaller personalities.\nNon-drinkers who come from drinking families, Cheever says, can be controlling and difficult.\nIn her book, released Tuesday, Cheever writes that Custer — the Civil War officer best known for his last stand at Little Bighorn — had “a preening arrogance, an inability to follow orders, and a sense of his own messianic rightness that is characteristic of dry drunks.”\nSIGRID ESTRADA/VIA BLOOMBERG NEWS Susan Cheever is the author of “Drinking in America: Our Secret History.”\nThe same could probably be said of the real estate mogul.\nTHE FAKING OF A PRESIDENT: OUR FUTURE UNDER DONALD AND HIS FIRST 100 DAYS IN OFFICE\n“Trump’s older brother died of alcoholism at 42, his brother who he adored,” Cheever told the Daily News.\n“So Trump hates drinking. He’s a teetotaler like John Quincy Adams or Alexander Hamilton, and people who are like that are often like him — they think they control everything,” she said.\nIn interviews, Trump has spoken highly of Fred, Jr., who died in 1981.\n“In a certain way, he was one of my great teachers, if not my best. He got me not to smoke, not to drink. I say to people don’t drink. It’s not hard,” Trump told Piers Morgan in 2011 .\n“Trump thinks it’s a moral choice and he made the right choice,” Cheever said. “He’s the classic guy in the alcoholic family who thinks he controls everything.”\nCLICK HERE TO FOLLOW US ON FACEBOOK\nCheever, daughter of novelist John Cheever, knows a thing or two about alcoholic families — she comes from one herself and is now more than 20 years sober.\nShe said that she doesn’t really exemplify the type she sees in Trump and Custer, but not every non-drinker in an alcoholic family does.\nTake, for example, Abe Lincoln.\nAP Eccentric circus mogul P.T. Barnum was deeply opposed to drinking. Enlarge AP General George Custer was a teetotaler with a controlling personality. Enlarge\nLike Trump, Custer and many others, Lincoln didn’t drink because of the effects he’d seen in his own family.\n“What is so amazing about Lincoln is that he didn’t drink but he didn’t get that idea that he was in control of life in the same way,” she said.\nNot drinking, Cheever says, can have just as much influence on someone’s personality as being a drunk.\nAnother famous non-drinker was 19th-century circus tycoon P.T. Barnum.\n“That’s an interesting comparison with Donald Trump,” Cheever said.\n“He came to New York and offered to educate every child in New York City and buy every house and give every women a silk dress if they would shut down the bars and of course they didn’t. He was a little crazy,” she said.\nCheever noted another important point of comparison: “I think he had better hair than Trump.”\nkblakinger@nydailynews.com\nRelated Stories Jimmy Fallon, David Alan Grier parody Trump and Carson A toast to John Cheever on his 100th birthday Tags: donald trump", "external_links": ["https://www.facebook.com/NYDailyNews", "http://blog.chron.com/celebritybuzz/2011/02/donald-trumps-alcoholic-brother-scared-him-off-booze/"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T21:26:01.624+03:00", "highlightTitle": ""}