{"organizations": ["GOP"], "uuid": "7cadde743d36e53fbf53d0f7e74f72f331831180", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/53/5b/JN_Facebook_Icon.png", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/top-news/gowdy-on-mccarthys-comments-kevin-screwed-up/nnxHg/", "country": "US", "title": "GOP chairman on McCarthy's comments: 'Kevin screwed up'", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "GOP chairman on McCarthy's comments: 'Kevin screwed up'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T22:17:00.000+03:00", "replies_count": 0, "uuid": "7cadde743d36e53fbf53d0f7e74f72f331831180"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/gowdy-on-mccarthys-comments-kevin-screwed-up/nnxHg/", "ord_in_thread": 0, "title": "GOP chairman on McCarthy's comments: 'Kevin screwed up'", "locations": ["WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["McCarthy", "Kevin"], "text": "Updated: 3:17 p.m. Wednesday, Oct. 7, 2015 | Posted: 3:17 p.m. Wednesday, Oct. 7, 2015 GOP chairman on McCarthy's comments: 'Kevin screwed up' The Associated Press WASHINGTON — \nThe chairman of the committee investigating the 2012 Benghazi attacks said Wednesday that House Majority Leader Kevin McCarthy \"screwed up\" when he suggested the probe was useful in driving down Democratic presidential candidate Hillary Rodham Clinton 's poll numbers. \nRepublican Rep. Trey Gowdy of South Carolina told MSNBC that McCarthy, the leading candidate to be the next House Speaker, has apologized. \nMcCarthy created a firestorm last week when he boasted in a Fox News interview that the panel could take credit for Clinton's diminished public standing and questions about her trustworthiness. \nMcCarthy has retracted the comments and said he regretted them. Addressing the issue anew Wednesday he told reporters: \"I could have been more clear\" in the initial comments. \n\"Let's be very clear: Benghazi's not political,\" McCarthy said. \"It was created for one purpose and one purpose only, to find the truth on behalf of the families of the four dead Americans. Period.\" \nOutgoing Speaker John Boehner , appearing with McCarthy at a news conference, rose to his deputy's defense. \n\"There's not one American who in the course of their lifetime wouldn't rather have the opportunity to say words over again. There's not one American that hasn't had this experience,\" Boehner said. \nThe committee \"is about what happened before, during and after a terrorist attack in Libya where four Americans died,\" Boehner said. \"The American people deserve the truth about what happened, period.\" \nBut McCarthy's initial remarks gave Democrats huge ammunition to go after the committee ahead of a much-anticipated appearance by Clinton before the panel Oct. 22. Clinton herself is now using the remarks in a campaign ad. The fracas also hurt McCarthy's campaign for speaker, though he remains the heavy front-runner ahead of secret-ballot elections happening Thursday, which will be followed by a floor vote Oct. 29. \n\"Kevin has apologized as profusely as a human being can apologize,\" Gowdy said. \"What I tell folks back home is I don't care how many time you put an earpiece in your ear and looked into a camera, you still screw up and Kevin screwed up.\" \nLater in the day, the House rejected a Democratic attempt led by New York Rep. Louise Slaughter to abolish the Benghazi committee. On a party-line vote of 240-183, Republicans prevailed in keeping the panel. \n\"Using official resources for campaign purposes is a clear violation\" of House rules and federal law, Slaughter said, \"and is a clear and undeniable abuse of official staff time, resources and attention.\" McCarthy's comments \"make it clear that the majority uses select committees for politics, not for governance,\" she added. Copyright The Associated Press", "external_links": [], "published": "2015-10-07T22:17:00.000+03:00", "crawled": "2015-10-08T08:35:57.717+03:00", "highlightTitle": ""}