{"organizations": [], "uuid": "0aaadd6d59f8e7323bc713d9e974ed6bd3a322e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westernmorningnews.co.uk", "main_image": "http://www.westernmorningnews.co.uk/images/localworld/ugc-images/276272/Article/images/28056821/11242520.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "Western Morning News Politics RSS feed", "url": "http://www.westernmorningnews.co.uk/Term-time-holiday-rules-pit-family-life-classroom/story-28056821-detail/story.html", "country": "US", "title": "Term time holiday rules 'pit family life against the classroom'...", "performance_score": 0, "site": "westernmorningnews.co.uk", "participants_count": 1, "title_full": "Term time holiday rules 'pit family life against the classroom'...", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:15:00.000+02:00", "replies_count": 0, "uuid": "0aaadd6d59f8e7323bc713d9e974ed6bd3a322e7"}, "author": "WMNKLangston", "url": "http://www.westernmorningnews.co.uk/Term-time-holiday-rules-pit-family-life-classroom/story-28056821-detail/story.html", "ord_in_thread": 0, "title": "Term time holiday rules 'pit family life against the classroom'...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Term time holiday rules 'pit family life against the classroom' warn Westcountry MPs By WMNKLangston | Posted: October 26, 2015 By Kate Langston Term time holiday rules 'pit family life against the classroom' warn Westcountry... X \nCopy link to paste in your message / Comments (0) \nTerm time leave restrictions are “pitting family life against the classroom”, claim MPs, as they tear into the “controversial and unpopular” Government policy. \nThey are also preventing “scores” of children from attending significant family events, they argue, and putting teachers in an “impossible position”. \nThe criticisms came during a special Parliamentary debate held in response to a 120,000 signature petition calling for reform. The session saw MPs increase pressure on ministers to review the so-called “Gove effect”, with St Austell and Newquay MP Steve Double leading the charge. \nThe Conservative MP, who has campaigned against the policy since his election in May, described the rules as “controversial”, “unpopular” and “unfair”. \n“Whilst I support the aim of getting children to attend school regularly I fundamentally disagree that telling parents when they can and cannot take their children on holiday is the job of the state,” he said. \n“This policy is blatantly unfair to a number of groups of people...not only those who work directly in tourism... [but also] those who cannot afford the high prices of holidays during the peak season. \n“But there is a deeper more concerning aspect of the impact this policy has on families. The message [it] sends out is that being in the classroom is more important than being with your family. \n“Pitting family life against the classroom in the manner this policy has done is one of the most regrettable aspects of this policy. \n“So I simply call on the minister to review [it].” \nNew restrictions on removing children from school during term time were introduced by former education secretary Michael Gove in 2013. \nSince then, the case against the Coalition-era policy has been well aired by politicians and tourism leaders, with many citing the harmful economic and social side-effects. \nJust last week, a new Plymouth University report found almost two-thirds of tourism businesses in the South West have seen their income affected by the changes. Critics say the rules also put teachers in the difficult position of deciding what qualifies as an “exceptional” circumstance to justify a term time absence. \nSt Ives MP Derek Thomas, North Cornwall MP Scott Mann and North Devon MP Peter Heaton-Jones also took part in yesterday’s debate \nMr Heaton-Jones said many of his constituents faced a “double whammy” of negative consequences from the legislation. “Not only are their businesses suffering, but their family is as well,” he said. \nSchools minister Nick Gibb remained unconvinced by the arguments stating that most of the objections raised could be mitigated using “local discretion”. \nMr Double he was disappointed but looked forward to “ongoing debate”.", "external_links": [], "published": "2015-10-26T20:15:00.000+02:00", "crawled": "2015-10-26T21:46:38.531+02:00", "highlightTitle": ""}