{"organizations": [], "uuid": "f2a83cf4b21e15bf5dc3ae3228c79c6cfcd81640", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/10/b060b0a72ee48113d19ca0a0aa02ca/media:5b99fa865b16477085255aec62337ac3DEM2016ClintonEnthusiasm.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/politics/articles/2015/10/05/clinton-draws-early-support-but-also-ambivalence-from-voters", "country": "US", "title": "Clinton draws early support but also ambivalence from voters", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Clinton draws early support but also ambivalence from voters - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "f2a83cf4b21e15bf5dc3ae3228c79c6cfcd81640"}, "author": "USNews", "url": "http://www.usnews.com/news/politics/articles/2015/10/05/clinton-draws-early-support-but-also-ambivalence-from-voters", "ord_in_thread": 0, "title": "Clinton draws early support but also ambivalence from voters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By LISA LERER and KATHLEEN RONAYNE, Associated Press\nDERRY, N.H. (AP) — Inside the arena, the roar was deafening when Hillary Rodham Clinton took the stage at the annual convention of the New Hampshire Democratic Party, with thousands jumping to their feet to welcome the party's White House front-runner.\nOutside the hall, a far less joyous conversation was taking place.\n\"She kind of turns me off,\" said Marsha Campaniello, a 63-year-old real estate appraiser from Concord. \"But I'd rather have a Democrat in there as opposed to a Republican.\"\nAt ice cream shops and book stores, at summer fairs and fall festivals, Clinton is running into voters such as Campaniello. They're Democrats, and some independents, too, weighing a desire to keep control of the White House against the deep ambivalence they feel toward Clinton.\nThe Associated Press interviewed nearly 70 Democratic and independent voters in the past two weeks, all at places where Clinton has campaigned in the first-to-vote states of Iowa and New Hampshire.\nThose voters expressed a litany of concerns. Many said they simply feel they lack a connection with Clinton, often for reasons they cannot seem to articulate.\n\"She certainly could manage the country,\" said Jim Gallagher, a 61-year-old, real estate investor from Manchester. \"But she just rubs me the wrong way. But, hey, you don't have to like her, right?\"\nSuch tepid reactions have led Clinton, once a commanding favorite for the nomination, into a fall campaign in which she will have competition, be it from Vermont independent Sen. Bernie Sanders or the possible late entry of Vice President Joe Biden.\nClinton is the odds-on choice still. No candidate in either field has as sophisticated a campaign operation or depth of support from the party establishment.\nBut the unenthusiastic reaction her candidacy receives from some Democratic voters underscores a central issue facing her campaign: Despite her decades on the public stage, Clinton struggles to inspire the kind of personal passion that catapulted Barack Obama into the White House.\n\"I like Hillary. I fell in love with Obama,\" said Sabrina Chen, 47, from Pelham.\nClinton appeared to acknowledge the challenge in a recent interview with the comedian Lena Dunham, saying of voting in presidential elections, \"if you can't get excited, be pragmatic.\"\nThe public's opinion of Clinton has steadily grown more negative since she returned to partisan politics, after a period of high ratings while she was secretary of state.\nMost Democratic voters say they would back Clinton in the general election. But some said Clinton is trying to co-opt Sanders' message, hoping to woo liberal voters by focusing on issues such as campaign finance and wage inequality.\n\"It just seems like the longer the campaign goes on the more she tries to emulate the popular things that Bernie is going for,\" said Spencer Jackson, 25, from Sunapee.\nAides stress the fundamentals of Clinton's campaign — steady fundraising, detailed policy positions and a national organizing strategy — are strong.\n\"Things don't happen overnight in the New Hampshire primary, but we will have done all the important groundwork,\" said Mike Vlacich, Clinton's New Hampshire state director.\nFor some, the rebranding has been convincing. Few doubt her competence, with many citing her extensive experience in Washington as an asset.\n\"I think in 2008 she was more standoffish, and this time around I think she's very warm, very engaged,\" said Marilyn Lieto, 75, from Groton.\nVoters do say that Clinton's handling of her use of a private email account and server have undermined her message, as have months of Republican attacks casting her as untrustworthy.\n\"People get stuck on the past and they don't want to give her a chance to move on,\" said supporter Marta Morse in Des Moines, Iowa.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T11:22:25.729+03:00", "highlightTitle": ""}