{"organizations": [], "uuid": "7c81f1e3082e70707e41c9349dba778fb0bd01c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/0f/c4dda1e3ea97408f0a12f8fd82dae1/media:3941f302b83940abacb68fe62aac2e48FatalFlashFloodsZion.JPEG", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/us/articles/2015/10/05/zion-national-park-investigates-run-up-to-deaths-of-7-hikers", "country": "US", "title": "Zion National Park investigates run-up to deaths of 7 hikers", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Zion National Park investigates run-up to deaths of 7 hikers - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "7c81f1e3082e70707e41c9349dba778fb0bd01c0"}, "author": "USNews", "url": "http://www.usnews.com/news/us/articles/2015/10/05/zion-national-park-investigates-run-up-to-deaths-of-7-hikers", "ord_in_thread": 0, "title": "Zion National Park investigates run-up to deaths of 7 hikers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Zion National Park looks at run-up to deaths of 7 hikers in flooding; permit changes possible This 2013 photo provided by the National Park Service shows canyoneering in Keyhole Canyon, in Zion National Park, near Springdale, Utah. Zion National Park officials are retracing what led up to the deaths of seven people in a flooded canyon on Sept. 14, 2015, before a panel assesses what can be done to keep a growing number of visitors safe when spectacular natural settings turn perilous. (National Park Service via AP)\nAssociated Press Oct. 5, 2015 | 5:53 p.m. EDT + More By LINDSAY WHITEHURST, Associated Press\nSALT LAKE CITY (AP) — Zion National Park officials are retracing what led up to the deaths of seven people in a flooded canyon last month before a panel convenes to assess what can be done to keep a growing number of visitors safe when spectacular natural settings turn perilous.\nInvestigators are talking to family members and examining the communications the group made in the hours before they canyon filled with fast-moving water from a powerful storm on Sept. 14, said Zion National Park Superintendent Jeff Bradybaugh.\nThe investigation could lead to changes in the permit system that controls who enters the park's 21 narrow slot canyons, whose unique geological quirks also make them deadly. The system was designed to protect the wilderness, not necessarily people, by limiting the number of explorers, Bradybaugh said. Rangers don't evaluate people's skills or close canyons due to weather until flooding has already begun. By then, it can already be too late for people inside.\nThe panel, which could include outside experts as well as parks officials, will likely convene by late November. It comes at a park where the number of visitors has grown 65 percent over the last 5 years but stagnant budgets have kept staffing levels largely unchanged, Bradybaugh said.\nHere's a look at what authorities will be considering after the flooding deaths:\nWEATHER WARNINGS\nParks officials could consider restricting access to canyons more often during the rainy season, or figuring out whether they could warn hikers in the backcountry.\nFlash flooding was considered \"probable\" when the group collected their permit on Sept. 14, one step below \"expected,\" the most serious warning on a four-step rating system.\nThat warning was given four times during the month of September, with three of those warnings clustered on the days before, during and after the deaths, according to parks officials. Still, a total of three groups got permits for that canyon on Sept. 14, and at least one completed the route safely.\nThe canyons were closed after flooding started, but too late to warn the group from California and Nevada because they were already in the backcountry.\nSKILL ASSSESSMENT\nThough Zion rangers ask detailed questions before giving a permit, they don't bar people from canyons based on skill level, something that could be re-examined, Bradybaugh said.\nProspective climbers of Alaska's Denali, for example, undergo a detailed examination of skills and a required 60-day waiting period, though climbing the mountain typically takes weeks and is a much bigger undertaking than the two-hour excursion the group had planned at Zion.\nThough more-skilled climbers can reach exit points and move through canyons more quickly, people already inside a slot canyon when a flash flood hits are often overwhelmed by water within moments — regardless of skill.\nINCREASED EDUCATION\nAt Utah's Arches National Park, getting a permit to hike through a labyrinth of red-rock formations called Fiery Furnace requires everyone in the group to pick up the permit in person, hear warnings from park rangers and watch an educational video.\nAt Zion, only one member of the group has to pick up the permit. Requiring everyone who's going into the canyon to be there means more people hear weather warnings directly and a video could drive home potential dangers of rain that typically hits in the afternoon, hours after most people pick up their permits.\nThere is a volume question: Zion issued more than 9,200 canyoneering permits over the last year, according to park records.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdx89y%3Fsrc=usn_tw&via=usnews&text=Zion%20National%20Park%20investigates%20run-up%20to%20deaths%20of%207%20hikers", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdx89y%3Fsrc=usn_li&title=Zion%20National%20Park%20investigates%20run-up%20to%20deaths%20of%207%20hikers&summary=&source=U.%20S.%20News", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdx89y%3Fsrc=usn_rd&title=Zion%20National%20Park%20investigates%20run-up%20to%20deaths%20of%207%20hikers", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdx89y%3Fsrc=usn_gp", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdx89y%3Fsrc=usn_su", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdx89y%3Fsrc=usn_fb"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T01:04:28.137+03:00", "highlightTitle": ""}