{"organizations": [], "uuid": "6229244afc0217c18891bf9bc4588333adc24622", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/AR-AL070_CHAGAL_G_20151012113940.jpg", "site_section": "http://www.wsj.com/news/world/asia", "section_title": "Asia Business, Finance &amp; Political News - The Wall Street Journal", "url": "http://www.wsj.com/articles/an-aria-for-chagall-at-the-paris-philharmonie-1444673829", "country": "", "title": "An Aria for Chagall at the Paris Philharmonie", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "An Aria for Chagall at the Paris Philharmonie - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T22:17:00.000+03:00", "replies_count": 0, "uuid": "6229244afc0217c18891bf9bc4588333adc24622"}, "author": "Inti Landauro", "url": "http://www.wsj.com/articles/an-aria-for-chagall-at-the-paris-philharmonie-1444673829", "ord_in_thread": 0, "title": "An Aria for Chagall at the Paris Philharmonie", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Music was at the heart of Marc Chagall’s art. Throughout his 80-year career, the painter constantly depicted music, musicians and musical instruments. So it was only natural for the Paris Philharmonie to dedicate a series of events in its inaugural season to the Russian-born master, says Ambre Gauthier, curator of “Marc Chagall, the Triumph of Music.” On until Jan. 31, the exhibition will be accompanied by concerts, conferences and films. “We wanted to show how music inspired him over the years,” says Ms. Gauthier.\nWorking backward through Chagall’s career, the show begins with a room dedicated to his 220-square-meter fresco that adorns the ceiling of the Opéra Garnier. Controversial when it was commissioned in 1962 for combining avant-garde art with classical 19th-century French architecture, Chagall’s colorful tribute to 14 composers is now seen as the theater’s main asset.\nMore on Art ‘Goya: The Portraits’ Review A Rare Show for British Master Frank Auerbach ‘Picasso.mania’ Highlights the Artist’s Enduring Impact ‘Fragonard amoureux: galant et libertin’ Review But at 21 meters above ground, many of the fresco’s details are indiscernible to those in the opera house’s 1,979 seats. To offer visitors an up-close experience, the Philharmonie, with the help of Google, filmed the painting using a drone. Projected onto a large screen, the images are accompanied by music from the illustrated operas.\nWhile the exhibition includes some of Chagall’s signature paintings, its main focus is the artist’s contributions across multiple disciplines. On display are costumes, curtains and other décor that Chagall designed for ballets, operas and theaters around the world, including the panels he created for the Yiddish theater in Moscow in 1919-20. On loan from the State Tretyakov Gallery, the seven panels portray the characters and elements Chagall deemed essential to Jewish theater. The altered perspective and fractured angles show how cubism influenced him at the time.\nYet Chagall’s decision to stick to figurative art during a period when abstraction ruled makes him difficult to categorize, Ms. Gauthier says.\nFor Joann Sfar, a French comic-book author who considers himself a Chagall disciple, that is precisely what makes him so compelling. “He was never fashionable. Intellectuals always despised him,” he says. “With Chagall, you don’t need to be initiated. He is accessible to children without being childish.”", "external_links": [], "published": "2015-10-12T22:17:00.000+03:00", "crawled": "2015-10-12T21:21:31.352+03:00", "highlightTitle": ""}