{"organizations": [], "uuid": "142a4cb8956e086488528482c4918567680a873c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/02/Local-Politics/Images/487578446-692.jpg", "site_section": "http://www.washingtonpost.com/rss/local/va-politics", "section_title": "Virginia Politics", "url": "https://www.washingtonpost.com/local/virginia-politics/mcauliffe-beats-drum-on-gun-control-and-medicaid-after-oregon-shooting/2015/10/02/4a010144-6929-11e5-8325-a42b5a459b1e_story.html", "country": "US", "title": "McAuliffe beats drum on gun control and Medicaid after Oregon shooting", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "McAuliffe beats drum on gun control and Medicaid after Oregon shooting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:19:00.000+03:00", "replies_count": 0, "uuid": "142a4cb8956e086488528482c4918567680a873c"}, "author": "Jenna Portnoy", "url": "https://www.washingtonpost.com/local/virginia-politics/mcauliffe-beats-drum-on-gun-control-and-medicaid-after-oregon-shooting/2015/10/02/4a010144-6929-11e5-8325-a42b5a459b1e_story.html", "ord_in_thread": 0, "title": "McAuliffe beats drum on gun control and Medicaid after Oregon shooting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "McAuliffe beats drum on gun control and Medicaid after Oregon shooting Resize Text By Jenna Portnoy October 2 at 2:57 PM Follow @jennaportnoy \nRICHMOND — In a replay of the aftermath of the August slaying of two broadcast journalists in southwest Virginia , Gov. Terry McAuliffe on Friday said stricter gun laws and expanding Medicaid to treat the mentally ill could curtail gun violence like the deadly Oregon college shooting. \nThe shooting that left nine dead, plus gunman Chris Harper Mercer, is the latest in a series of violent attacks involving guns that have pushed politicians further to their partisan corners on gun control. [ Probe in college slayings peers into Web rants and possible religious rage ] \n“Your heart goes out to them, all of those families today that are waking up realizing that their loved ones are gone,” McAuliffe (D) said during a WTOP call-in show. “At what point will these politicians stop being beholden to the NRA and do some common sense things like background checks?” \nMcAuliffe has been outspoken on the issue, despite criticism that he used the tragedies to advance his policy agenda. [ Suspect in slaying of two TV station employees in SW Virginia shoots himself and dies ] \nTwo days after the shooting of the journalists, McAuliffe’s political action committee received $50,000 from former congresswoman Gabby Giffords’s Americans for Responsible Solutions, which advocates for stronger gun laws. \nMcAuliffe, who said he spoke with Oregon Gov. Kate Brown (D) Thursday night, acknowledged that requiring background checks at gun shows wouldn’t have stopped the Smith Mountain Lake shooter or others who have obtained their guns legally. \n“But it will stop some,” he said. [ McAuliffe’s call for tighter gun controls upsets Republicans ] \nDel. C. Todd Gilbert (R-Shenandoah), a criminal defense attorney and former prosecutor, pushed back on McAuliffe’s call for gun regulations and called it insulting to suggest the National Rifle Association’s campaign contributions and pressure would sway lawmakers. \nDealers who set up at a show must conduct background checks, but private citizens who want to sell guns “should be able to do that without the government being involved in that transaction,” Gilbert said in a phone interview. \nHe also rejected McAuliffe’s call this week to keep people who are under protective abuse orders or convicted of domestic violence and stalking misdemeanors from possessing firearms. \nSuch laws would not deter those bent on murder from killing their partners, he said. \n“I just wonder why the focus is always on guns rather than efforts to identify people who are truly in crisis and try to empower them,” Gilbert said. [ Supreme Court health-care ruling prompts new McAuliffe Medicaid push ] \nIn response to callers to the radio show who noted that shooters have suffered from mental illness, McAuliffe said expanding Medicaid would free up millions for treatment. \n“I’m trying,” he said. “But the same people who are against trying to bring common sense gun restrictions are the same people who won’t give funding to deal with those individuals with severe mental illness.” \nThe overwhelmingly Republican House of Delegates has blocked McAuliffe’s repeated attempts to expand Medicaid to 400,000 uninsured Virginians under the federal Affordable Care Act. They oppose enlarging the government program and say the financial burden would eventually shift to the states. Jenna Portnoy covers Virginia politics for The Washington Post.  ", "external_links": [], "published": "2015-10-02T22:19:00.000+03:00", "crawled": "2015-10-03T10:17:58.603+03:00", "highlightTitle": ""}