{"organizations": [], "uuid": "6756593123a8e846b7a9233c95b62ab4c920820b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/000/386/672_140x140_963552002_140x140.jpg", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/Rep.-Elijah-Cummings-Debunks-Right-Win-1", "country": "IE", "title": "Rep. Elijah Cummings Debunks Right-Wing Media's Claim That Clinton Sent \"Classified Information\" About CIA Source Over Private Email", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "Rep. Elijah Cummings Debunks Right-Wing Media's Claim That Clinton Sent \"Classified Information\" About CIA Source Over Private Email - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T17:21:00.000+03:00", "replies_count": 0, "uuid": "6756593123a8e846b7a9233c95b62ab4c920820b"}, "author": "Content Admin", "url": "https://www.oximity.com/article/Rep.-Elijah-Cummings-Debunks-Right-Win-1", "ord_in_thread": 0, "title": "Rep. Elijah Cummings Debunks Right-Wing Media's Claim That Clinton Sent \"Classified Information\" About CIA Source Over Private Email", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rep. Elijah Cummings (D-MD), the ranking member of the House Select Committee on Benghazi, cited information from the CIA to debunk the claim that Hillary Clinton compromised national security by revealing the name of a CIA source in an email sent from her private account. The claim originated from the Republicans serving on the U.S. House Select Committee on Benghazi and was amplified by right-wing media, but now the CIA has informed the Select Committee that the e-mail did not contain any classified information, according to a letter released by Cummings.\nRep. Trey Gowdy Claims Clinton Exposed \"Classified Information\" On Intelligence Source In Libya\nTrey Gowdy Letter: Clinton Sent Email Containing \"Some Of The Most Protected Information In Our Intelligence Community\" Concerning A \"Human Source\" In Libya. Rep. Trey Gowdy (R-SC), the head of the Select Committee, sent in an October 7 letter to Cummings that claimed Clinton \"apparently received classified information\" in an email from confidant Sidney Blumenthal. Gowdy wrote that Clinton then forwarded the email to a State Department employee, \"debunking her claim that she never sent any classified information from her private email address.\" Gowdy claimed that Clinton's action \"could jeopardize not only national security but also human lives.\" [House of Representatives Select Committee on Benghazi, 10/7/15 ]\nMedia Credulously Repeated Gowdy's Claim\nFox's Ed Henry: Blumenthal \"Appear[ed] To Provide Classified Information To Clinton Over Her Private Server.\" On the October 8 edition of Fox News' Hannity, Fox News correspondent Ed Henry claimed one of the emails Gowdy released was \"an email where the advisor [Sidney Blumenthal] appears to provide classified information to Clinton over her private server.\" Henry added that Gowdy was worried that the email \"could jeopardize not just national security but also human lives.\" [Fox News, Hannity, 10/8/15 ]\nMichael Isikoff: Blumenthal Email Appears To Show \"Somebody\" Committed A Federal Crime. On the October 12 edition of MSNBC's Morning Joe, Yahoo News chief investigative correspondent Michael Isikoff claimed that the email released by Gowdy is \"maybe the single most problematic email exchange we've seen with Hillary Clinton yet of all the emails that have been released because on its face it would appear to be evidence of a commission of a federal crime by somebody, not Hillary Clinton.\" [MSNBC, Morning Joe, 10/12/15 ]\nWashington Examiner : \"Incompetent Or Indifferent\" Clinton \"Burn[ed] CIA Libya Contact.\" In an article headlined, \"Incompetent or indifferent: Clinton burns CIA Libya contact,\" The Washington Examiner claimed Clinton \"forwarded this email to a State Department colleague\" even though \"people working for the CIA in dangerous countries such as Libya have a way of dying or disappearing when their identities are exposed\":\nIt should go without saying that people working for the CIA in dangerous countries such as Libya have a way of dying or disappearing when their identities are exposed. Yet Clinton forwarded this email to a State Department colleague anyway.\n[...]\nClinton was fortunate to have this story buried behind the current chaos in Congress. But once that chaos is ended, she will have to answer for this egregious breach, if not to the FBI, then at least to voters. [The Washington Examiner, 10/10/15 ]\nBreitbart News: Clinton \"Carelessly Exposed A Top CIA Human Intelligence Asset In Libya.\" Breitbart News' John Hayward claimed, \"Hillary Clinton carelessly exposed a top CIA human intelligence asset in Libya, in an email sent through her unsecure private mail server.\" Clinton's \"blithe handling of the information\" wrote Hayward, \"is shocking\":\nThe title given to Michael Isikoff's piece is \"Benghazi Committee, Under Fire, Releases More Clinton Emails,\" but the big news is right up front, in the first few paragraphs: Hillary Clinton carelessly exposed a top CIA human intelligence asset in Libya, in an email sent through her unsecure private mail server.\n[...]\nIt's true that this particular security breach bounced between a couple of other people before it got to Clinton -- one of whom, the above-mentioned Tyler Drumheller, has since passed away -- but her blithe handling of the information is shocking.\n[...]\nEverything that happened in Libya is highly relevant to voters as they assess Clinton's judgment, and nothing that happened in Libya reflects well on it. It's clear that she was massively dishonest, both with the American people and her boss, President Barack Obama, about her relationship with Sid Blumenthal. He never should have been interacting with her at all, never mind looping her into emails that exposed the name of a CIA asset on an unsecure system. Anyone other than Hillary Clinton would be in severe legal jeopardy over something like this. [Breitbart News, 10/9/15 ]\nRedState: Clinton Revealed A CIA Source And Committed A Crime. RedState's Jay Caruso claimed that \"revealing the identity of a CIA source certainly seems to fit\" the description of a crime and the Clinton campaign's response suggests Clinton was \"too stupid to understand\" she possessed \"sensitive information\":\nThere comes a time when a \"scandal\" becomes a crime and in the case of Hillary Clinton, revealing the identity of a CIA source certainly seems to fit that description, even to a non-lawyer like me.\nTrey Gowdy, tired of leaks from Democrats on the Select Committee on Benghazi, designed to make Hillary Clinton look sympathetic, sent a blistering letter to Elijah Cummings who has been calling for the committee to be shut down since its inception.\n[...]\nEssentially what they are suggesting is that she get a pass because the email was \"unmarked\" and therefore she was too stupid to understand there might be sensitive information she was passing along. Yes, let's hand the keys to the most powerful position in the world to this woman. [RedState, 10/9/15 ]\nWashington Free Beacon: Blumenthal's Email Could \"Prompt New Intelligence Investigation.\" The Washington Free Beacon's Alana Goodman, in an article headlined, \"Clinton Email Could Prompt New Intelligence Investigation\", wrote Blumenthal's email \"could trigger an intelligence investigation and add to concerns that she mishandled classified information\" and claimed that Clinton may have violated the Intelligence Identities Protection Act:\nAn email forwarded by Hillary Clinton to a colleague that identified a top CIA informant in Libya could trigger an intelligence investigation and add to concerns that she mishandled classified information, according to intelligence sources.\n[...]\nAn intelligence source said that the email could trigger an investigation into whether any of the parties violated the Intelligence Identities Protection Act, calling the apparent disclosure \"a couple steps above Valerie Plame.\"\n\"Once you compromise the cover, there's a whole section of law called the Intelligence Identities Protection Act,\" said the source. \"It's against federal law to disclose the identities or the real names of anybody who works for the CIA or any other part of the intelligence community.\"\nThe Intelligence Identities Protection Act prohibits individuals who have access to the identities of covert agents--including CIA intelligence sources--from intentionally disclosing this information to individuals who are not cleared to receive it. [Washington Free Beacon, 10/10/15 ]\nCummings Debunks Claim: CIA Told The Select Committee That The Information Was Not Classified\nCummings Letter On Gowdy's Accusation: \"You Failed To Check Your Facts Before You Made It, And The CIA Has Now Informed The Select Committee That You Were Wrong.\" In an October 18 letter to Gowdy, Cummings wrote that Gowdy's claim was wrong and the CIA had informed the committee that the information in Blumenthal's email was not classified:\nOn October 7, 2015, you sent me a 13-page letter making a grave new accusation against former Secretary of State Hillary Clinton. Specifically, you accused her of compromising national security and endangering lives.\nThe problem with your accusation--as with so many others during this investigation--is that you failed to check your facts before you made it, and the CIA has now informed the Select Committee that you were wrong. I believe your accusations were irresponsible, and I believe you owe the Secretary an immediate apology.\n[...]\nTo further inflate your claim, you placed your own redactions over the name of the individual with the words, \"redacted due to sources and methods.\" To be clear, these redactions were not made, and these words were not added, by any agency of the federal government responsible for enforcing classification guidelines.\nPredictably, commentators began repeating your accusations in even more extreme terms, suggesting in headlines for example that \"Clinton Burns CIA Libya Contact.\"\nContrary to your claims, the CIA yesterday informed both the Republican and Democratic staffs of the Select Committee that they do not consider the information you highlighted in your letter to be classified. Specifically, the CIA confirmed that \"the State Department consulted with the CIA on this production, the CIA reviewed these documents, and the CIA made no redactions to protect classified information.\"\nUnfortunately, you sent your letter on October 7 without checking first with the CIA. Now that we have done so, we have learned that your accusations were incorrect. [Select Committee on Benghazi, 10/18/15 ]\nMedia Have History Of Being Burned By Partisan Select Committee Leaks\nGowdy Was Connected To Incorrect New York Times Story On Clinton \"Criminal Inquiry\". Vox's Jonathan Allen suggested that House Benghazi Committee Chairman Rep. Trey Gowdy (R-SC) knew about the request to the Justice Department regarding Hillary Clinton's email practices \"at least a day\" before The New York Times published its article that falsely claimed Clinton was the subject of a \"criminal inquiry\":\nI don't know who the Times's sources are, but I do know this: My reporting suggests that House Benghazi Committee Chair Trey Gowdy was fully aware of the request to the Justice Department at least a day before the Times broke the story. If he or his staff were sources, it should have been incumbent upon the Times to check every detail with multiple unconnected sources. Gowdy's team has been accused of leaking something untrue to a reporter before. [Vox.com, 7/28/15 ; Media Matters, 7/29/15 ]\nPolitico Mischaracterized Email Based On An Anonymous Source Likely Connected To Committee Who Had \"Reviewed\" The Emails. On June 19, Politico was forced to issue a correction after it was discovered that it had published inaccurate information about emails between Clinton and Blumenthal, in one case distorting the context of an email reply. For the piece, Politico relied on \"a source who has reviewed the email exchange.\" Cummings wrote a letter charging that Politico had been misled by someone who had access to the committee's documents and who \"inaccurately described to the press email exchanges ... in a way that appeared to further a political attack against\" Clinton. [Media Matters, 7/6/15 ]", "external_links": ["http://www.redstate.com/2015/10/09/hillary-clinton-disclosed-identify-of-cia-source/", "http://democrats.benghazi.house.gov/news/press-releases/cia-debunks-gowdy-s-allegation-that-clinton-email-contained-classified-cia", "http://feedproxy.google.com/embed/clips/2015/10/18/42636/fnc-hannity-20151008-edhenryclinton", "http://feedproxy.google.com/embed/clips/2015/10/18/42637/msnbc-mj-20151012-clintonlibya", "http://freebeacon.com/politics/clinton-email-could-prompt-new-intelligence-investigation/", "http://feedproxy.google.com/blog/2015/07/06/benghazi-dems-politico-got-spun-by-anonymous-so/204258", "http://www.breitbart.com/big-government/2015/10/09/clinton-exposed-name-top-cia-source-via-unprotected-email/", "http://www.washingtonexaminer.com/incompetent-or-indifferent-clinton-burns-cia-libya-contact/article/2573834", "https://benghazi.house.gov/sites/republicans.benghazi.house.gov/files/TG%20letter%20to%20EEC%2010.7.15.pdf", "http://www.vox.com/2015/7/28/9059953/clinton-rules-new-york-times", "http://feedproxy.google.com/blog/2015/07/29/voxs-jonathan-allen-implicates-trey-gowdy-in-th/204654"], "published": "2015-10-18T17:21:00.000+03:00", "crawled": "2015-10-19T04:46:46.767+03:00", "highlightTitle": ""}