{"organizations": ["Congress", "Umpqua Community College"], "uuid": "84c1376bac7b57a905f003bc32b8908cbf994243", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151001184446-umpqua-community-college-oregon-shooting-president-obama-live-intv-tsr-00000620-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/01/politics/oregon-shooting-obama-response/index.html?eref=rss_politics", "country": "US", "title": "Obama on Oregon shooting: 'Somehow this has become routine'", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Obama on Oregon shooting: 'Somehow this has become routine'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:57:00.000+03:00", "replies_count": 0, "uuid": "84c1376bac7b57a905f003bc32b8908cbf994243"}, "author": "", "url": "http://edition.cnn.com/2015/10/01/politics/oregon-shooting-obama-response/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Obama on Oregon shooting: 'Somehow this has become routine'", "locations": ["Roseburg", "Oregon", "America", "Newtown", "Washington", "Connecticut"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Obama"], "text": "Preliminary reports: Shooter at Oregon community college Washington (CNN) President Barack Obama on Thursday expressed deep anger and impatience with the mass shootings that have left yet another community \"stunned with grief' and warned that America is becoming \"numb\" to such violence. Obama appeared in the White House Briefing Room, appearing deeply moved, but also unusually caustic, after a gunman went on a rampage earlier Thursday killing at least 10 people at Oregon's Umpqua Community College in Roseburg, Oregon. Obama said that he knew foes would accuse him of politicizing the tragedy -- but said gun violence should be politicized. \"This is a political choice that we make to allow this to happen every few months in America,\" said Obama, who has delivered statements after 15 mass shootings during his presidency, and appears worn down by that duty. \"We collectively are answerable to those families who lose their loved ones because of our inaction.\" Obama said a \"change of politics\" was needed in America to overhaul gun laws because \"thoughts and prayers\" were not enough. \"We are the only advanced country on Earth that sees these kinds of mass shootings every few months,\" Obama said, complaining that Congress had not moved on gun laws. \"Somehow this has become routine. The reporting is routine. My response here at this podium ends up routine ... We have become numb to this,\" said Obama, in a powerful address that reflected great frustration at his own failed attempts to reform gun laws following the Newtown, Connecticut, school massacre in 2012. Obama said it was up to each and every person in the nation to pressure lawmakers to embrace gun safety legislation. \"Each time this happens, I am going to say we are going to have to do something about it -- and we are going to have to change our laws.\" He added: \"This is not something I can do myself.\" But Obama gave no details of a new push to get gun laws and legislation requiring more comprehensive background checks through Congress. <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-10-02T01:57:00.000+03:00", "crawled": "2015-10-02T02:24:21.897+03:00", "highlightTitle": ""}