{"organizations": [], "uuid": "fc8feae6acc8e804629da37dd2f7fe1c4e650d07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30165129/pennsylvania-liquor-control-board-to-debut-limited-release-lottery", "country": "US", "title": "Pennsylvania Liquor Control Board to Debut Limited-Release Lottery", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Pennsylvania Liquor Control Board to Debut Limited-Release Lottery - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "fc8feae6acc8e804629da37dd2f7fe1c4e650d07"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30165129/pennsylvania-liquor-control-board-to-debut-limited-release-lottery", "ord_in_thread": 0, "title": "Pennsylvania Liquor Control Board to Debut Limited-Release Lottery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Pennsylvania Liquor Control Board\nBuffalo Trace Experimental Collection available to individual consumers, licensees in Pennsylvania\nHARRISBURG, Pa. , Oct. 1, 2015 /PRNewswire-USNewswire/ -- In an effort to more equitably distribute highly sought-after, limited-quantity wines and spirits to interested individual consumers and licensees in Pennsylvania , the Pennsylvania Liquor Control Board (PLCB) will hold its first Limited-Release Lottery on Oct. 13 , offering 24 bottles of Buffalo Trace Experimental Collection for purchase.\n\"In recent years, certain products have become very popular among aficionados, enthusiasts and collectors. When sold through our traditional online store in the past, the extraordinary demand for these products, which are often sold at prices far below what consumers find in other states, often led to products selling out within only a few minutes,\" said PLCB Chairman of the Board Tim Holden. \"In order to ensure that all consumers interested in a particular high-demand product have a fair chance to purchase the product, we have developed a lottery system for our most limited products.\"\nThe first lottery will feature 24 bottles of Buffalo Trace Experimental Collection, including 12 bottles of French Oak Barrel Aged Bourbon 100 Proof and 12 bottles of French Oak Barrel Head Aged Bourbon. Each 375mL bottle will cost $48.49 .\nBecause licensees constitute about one quarter of the PLCB's annual sales, 25 percent of the each offering will be available to licensees, while 75 percent will be available to individual consumers. \"Our licensees are important not only to our business, but also to the local and state economy as a whole, so we felt strongly they should have opportunity to buy a quarter of our supply without competing against retail customers,\" said Holden.\nIn order to participate in the lottery, interested parties must be registered customers at www.FineWineAndGoodSpirits.com with billing information on file through Quick Checkout Profiles. Following registration, participants may opt in to this debut lottery between 8:00 AM Monday, Oct. 5 , and 11:00 PM Saturday , Oct. 10.\nSeparate lotteries will be conducted for each of these rare bourbons, and lottery participants may opt into one or both drawings. Purchase is limited to one bottle per participant, and if a participant wins a bottle in the first drawing, the participant will be removed from the following drawing.\nLottery drawings will be witnessed by an independent third party, and winners will be selected at random by a computer program.\nThe lottery is open to Pennsylvania residents and licensees age 21 or older who provide both a verifiable Pennsylvania billing address and a Pennsylvania shipping/store address at registration. Any registrant with an invalid or out-of-state address will be removed from the lottery.\n\"One of the concerns we've heard most from Pennsylvania residents and licensees is how folks from other states are able to buy up what vendors allocate to the commonwealth,\" said PLCB Director of Marketing and Merchandising Dale Horst . \"We are taking every step we can to ensure that these bottles will be sold to Pennsylvania residents and licensees.\"\nBecause the PLCB enforces a one-bottle-per-customer policy for its rarest products, only one customer at each billing address can register. Entries will be vetted for duplicative names, addresses and other information, and duplicates will be deleted from the lottery pool.\nParticipants will be notified by email when the lottery is complete.\nAny inventory that may remain after all drawings are complete and all orders are processed will be moved to www.FineWineAndGoodSpirits.com for general sale, first-come, first-served. Anyone – including non- Pennsylvania residents and lottery winners – can participate in the general sale of those products.\n\"We believe a lottery system is the fairest way to sell highly limited and very popular products to our consumers,\" Horst said. \"We have a responsibility to make sure the process of selling those products is equitable, and the lottery process levels the playing field for our customers.\"\nFuture Limited-Release Lottery offerings will be announced through emails to customers registered at www.FineWineAndGoodSpirits.com and will be posted on the website.\nFor more details regarding the Limited-Release Lottery, please review the Frequently Asked Questions document available at: http://www.finewineandgoodspirits.com/static/pdf/terms/LCB_LRLottery_FAQ.pdf\nThe PLCB regulates the distribution of beverage alcohol and operates more than 600 wine and spirits stores statewide. Taxes and store profits are returned to Pennsylvania's General Fund. Since its inception, the PLCB has contributed nearly $14 billion to the Pennsylvania Treasury. For more information about the Liquor Control Board, visit www.lcb.state.pa.us .\nMEDIA CONTACT : Elizabeth Brassell , 717.783.8864\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/pennsylvania-liquor-control-board-to-debut-limited-release-lottery-300152863.html\n ", "external_links": ["http://www.finewineandgoodspirits.com/static/pdf/terms/LCB_LRLottery_FAQ.pdf", "http://www.lcb.state.pa.us/", "http://www.xmlnews.org/ns/", "http://www.finewineandgoodspirits.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC17852&Transmission_Id=201510011435PR_NEWS_USPR_____DC17852&DateId=20151001", "http://www.prnewswire.com/news-releases/pennsylvania-liquor-control-board-to-debut-limited-release-lottery-300152863.html"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-01T23:06:05.192+03:00", "highlightTitle": ""}