{"organizations": [], "uuid": "737e3f674149df046acbdedf47915d5a127e02c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "martini.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4290411/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://martini.heraldscotland.com/politics/political_news/13802158.Top_judge_to_give_Holyrood_evidence_after_double_snub/?ref=rss", "country": "", "title": "Top judge to give Holyrood evidence after double snub", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Top judge to give Holyrood evidence after double snub", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T02:11:00.000+03:00", "replies_count": 0, "uuid": "737e3f674149df046acbdedf47915d5a127e02c2"}, "author": "", "url": "http://martini.heraldscotland.com/politics/political_news/13802158.Top_judge_to_give_Holyrood_evidence_after_double_snub/?ref=rss", "ord_in_thread": 0, "title": "Top judge to give Holyrood evidence after double snub", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gill"], "text": "Top judge to give Holyrood evidence after double snub Lord Gill 1 comment \nONE of the country’s top judges has finally bowed to pressure by agreeing to give evidence to a Holyrood inquiry on the creation of a judicial register of interest. \nLord Gill, who recently retired as Lord President, had twice snubbed calls to face MSPs but will be grilled on the contentious subject next month. \nCurrently, a range of senior public sector figures, including MSPs, MPs, councillors and public board members, must provide details of directorships or shareholdings, but judges and sheriffs are under no such obligation. \nLoading article content \nMembers of the judiciary are instead require to 'recuse' - or excuse - themselves from cases where there might be a potential conflict of interest. \nCampaigner Peter Cherbi tried to plug the loophole by tabling a petition to Holyrood that would require judges to declare their pecuniary interests. \nHowever, Gill, who as Lord President was the most senior judge north of the border, submitted written evidence to Holyrood’s Public Petitions Committee opposing the plan. \nHe argued that a judge’s privacy could be affected by \"aggressive media or hostile individuals\" and warned: \n\"The establishment of such a register therefore may have the unintended consequence of eroding public confidence in the judiciary.\" \nHowever, Lord Gill then refused invitations by the Committee to explain his written evidence in person in front of MSPs. \nHe told Holyrood that the legislation that created the Parliament contained a provision that meant judicial officer holders could not be required to give evidence. \nHe instead agreed to a private meeting with senior members of the committee. Promoted stories \nAfter Gill retired earlier this year, MSPs invited him to give evidence for a third time. \nGill has agreed and will face MSPs on November 10. Share article \nCherbi said: “Now that Lord Gill cannot hide behind the rank of Lord President and refuse to attend the Scottish Parliament, it will be interesting to hear how Scotland’s longest serving judge attempts to justify a judicial exemption against transparency when openness is supposedly a pre requisite for all others in our courts and justice system. \nTory MSP Jackson Carlaw, who is also a committee member, said: “I warmly welcome this change of heart by Lord Gill to appear before the Committee, even if it is as the former Lord President. I am sure the committee will host a fascinating and frank exchange of views.” Promoted Stories", "external_links": [], "published": "2015-10-04T02:11:00.000+03:00", "crawled": "2015-10-09T08:40:37.989+03:00", "highlightTitle": ""}