{"organizations": [], "uuid": "c4aac70d643c189fe2bd09f9a4c1c6af990fdef5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/8/b/i/c/image.related.articleLeadwide.620x349.gk87qs.png/1444740302832.jpg", "site_section": "http://www.canberratimes.com.au/federal-politics/political-news", "section_title": "Politics | Australian Politics | Federal Politics", "url": "http://www.canberratimes.com.au/federal-politics/political-news/new-senator-robert-simms-talks-of-struggle-to-come-out-20151013-gk87qs.html", "country": "AU", "title": "New senator Robert Simms talks of struggle to come out", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "New senator Robert Simms talks of struggle to come out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T20:45:00.000+03:00", "replies_count": 0, "uuid": "c4aac70d643c189fe2bd09f9a4c1c6af990fdef5"}, "author": "", "url": "http://www.canberratimes.com.au/federal-politics/political-news/new-senator-robert-simms-talks-of-struggle-to-come-out-20151013-gk87qs.html", "ord_in_thread": 0, "title": "New senator Robert Simms talks of struggle to come out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greens senator Robert Simms delivers his first speech to the Senate on Tuesday. Photo: Alex Ellinghausen\nWhen Robert Simms was growing up in Adelaide, there was one thing the self-confessed \"nerd\" who loved debating and student politics would never have considered talking about in a speech, let alone his first speech in the Senate.\nWhile Senator Simms had a happy childhood, there were times when he did not feel as though he quite fitted in.\nIn his first speech to the Senate on Tuesday evening, the new Greens senator for South Australia, who recently took over from Penny Wright, said he was about 12 when he realised he was gay.\nMember for Canning Andrew Hastie delivers his maiden speech in the House of Representatives. Photo: Alex Ellinghausen\n\"I stand here today as an out and proud gay man. But I certainly wasn't always so,\" the 31-year-old said.\nAdvertisement \"It was a secret I carried for a long time — indeed I didn't tell anyone until I was in my early 20s.\n\"I had no conception of what a gay life might look like and was scared for the future.\"\nMr Hastie is congratulated by former prime minister Tony Abbott. Photo: Alex Ellinghausen\nSenator Simms, who has previously worked for Greens senators Sarah Hanson-Young and Scott Ludlam and was an Adelaide City councillor, said things had since changed.\n\"These days, I'm very comfortable in my own skin.\"\nBut he told the Senate that it was important to talk about his experience because \"it is still not an easy thing for many young people today.\n\"I want to say today to any young person who might be struggling with their own journey with sexuality or gender identity, things really do get better.\"\nThere are only two other openly gay MPs in Federal Parliament — Labor senator Penny Wong and Liberal Party senator Dean Smith. Greens senator Janet Rice, whose wife, Penny, is a transgender woman, is bisexual.\nLiberal MP Andrew Hastie, who won the Canning by-election last month, also gave his first speech on Tuesday evening.\nTaking the seat held by the late Don Randall, Mr Hastie, 32, spoke of how he had been moved to join the Australian Defence Force in the wake of 9/11.\nWatched on by Prime Minister Malcolm Turnbull and former prime minister Tony Abbott, the former SAS soldier told the House how terror had touched his life when the daughter of his primary school teacher was killed in the 2001 attack.\n\"I had to respond.\"\nMr Hastie, who deployed to Afghanistan and the Middle East, said his experience in war had shown him the best and worst of human nature.\n\"I am now far more circumspect about the ability of military power to change people and societies,\" he said.\n\"Politicians who contemplate sending young men and woman into foreign lands would do well to reflect on this truth about war.\"\n ", "external_links": ["https://twitter.com/PoliticsFairfax"], "published": "2015-10-13T20:45:00.000+03:00", "crawled": "2015-10-14T05:25:27.002+03:00", "highlightTitle": ""}