{"organizations": [], "uuid": "570d2bfec6283c21b4d4f34d77a827e65b3814fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dailycaller.com", "main_image": "http://cdn01.dailycaller.com/wp-content/uploads/2014/01/2014-01-23T155453Z_1_CBREA0M187I00_RTROPTP_4_USA-e1438967189334.jpg", "site_section": "http://dailycaller.com/section/politics/page/46/", "section_title": "Politics | The Daily Caller - Part 46", "url": "http://dailycaller.com/2015/08/07/does-obama-think-chuck-schumer-is-chanting-death-to-america/", "country": "US", "title": "Does Obama Think Chuck Schumer Is Chanting 'Death To America'?", "performance_score": 0, "site": "dailycaller.com", "participants_count": 19, "title_full": "Does Obama Think Chuck Schumer Is Chanting 'Death To America'? | The Daily Caller", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:59:00.000+03:00", "replies_count": 20, "uuid": "9d3b28a833142592a058644ac02dabd959935128"}, "author": "dailycaller", "url": "http://dailycaller.com/2015/08/07/does-obama-think-chuck-schumer-is-chanting-death-to-america/#post-0", "ord_in_thread": 0, "title": "Does Obama Think Chuck Schumer Is Chanting 'Death To America'?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4669337 These days, it’s very rare for a high-ranking Democrat to make a logical, reasonable decision. It simply isn’t done. So I don’t really know what to make of this.\nRachel Stoltzfoos reports:\nDemocratic Sen. Chuck Schumer will oppose the Iran deal, a decision that deals quite a blow to President Barack Obama and the Democrats working to rally support for the deal.\n“Advocates on both sides have strong cases for their point of view that cannot simply be dismissed,” Schumer wrote in a lengthy post Thursday on the website Medium. “This has made evaluating the agreement a difficult and deliberate endeavor, and after deep study, careful thought and considerable soul-searching, I have decided I must oppose the agreement and will vote yes on a motion of disapproval…”\nThe senior senator has been on the fence for weeks, and his decision will make it that much harder for Democrats in Congress, led by Rep. Nancy Pelosi in the House, to rally support for the deal.\nWho knows if this will scuttle the deal, but it’s about time I agreed with Chuck Schumer about something .\nIt sure puts him in an awkward position, doesn’t it? Just the other day, Obama said this about opponents of the deal:\nJust because Iranian hardliners chant “Death to America” does not mean that that’s what all Iranians believe. In fact, it’s those hardliners who are most comfortable with the status quo. It’s those hardliners chanting “Death to America” who have been most opposed to the deal. They’re making common cause with the Republican Caucus.\nAnd now, so is Chuck Schumer.\nWhat could possibly explain this? Has Schumer suddenly become a racist or something? Is the Mossad blackmailing him? Did somebody tell him that this is the best way to get more camera time? Is he a Cylon? Or maybe he just made a “speak-o” ?\nOne thing’s for sure: It can’t be that Schumer genuinely disagrees with Obama on this issue. Nobody genuinely disagrees with Obama about anything . That’s because Obama is always right and everybody knows it. Everything he says is true at the moment he says it, even especially when he contradicts any of his previous statements. Therefore, it’s impossible to question Obama’s infallibility in good faith. There’s always some other motive, and it’s never an honest one.\nFor Chuck Schumer’s sake, let’s hope this is just some sort of fig leaf. Let’s hope he doesn’t really want to keep Israel from getting wiped off the map. Let’s hope he’s not listening to his conscience. Because if he really means what he’s saying, he’s about to find out what happens when you stand in the way of Obama’s will. It can get mighty cold out there for a Democrat in 2015 who dares to stand on principle.\nAnd so it begins.\nChuck Schumer, who said it was a mistake to pass Obamacare, now comes out again the Iran Deal. This is our next Senate leader?\n— Jon Favreau (@jonfavs) August 7, 2015\nP.S. “Difference of opinion”? Since when is that a valid reason to oppose Obama?\nTags: Chuck Schumer , Iran , Obama , Treacher Share TOP Hide Comments Show comments Loading, please wait... Fourth ‘Teen’ Finally Charged In Zemir Begic Murder 2:59 PM 10/02/2015 Hillary Clinton Couldn’t Be Prouder To Have Wendy Davis On Her Team 1:23 PM 10/02/2015 Obama On Confiscating Guns: Then And Now 8:39 AM 10/02/2015 Pregnant Student Kicks Pregnant EMT During Huge Brawl At Milwaukee’s Barack Obama School Of Career And Technical Education 4:17 PM 10/01/2015 Benjamin Netanyahu And The Pin-Drop Heard ‘Round The World 3:09 PM 10/01/2015 Why Is #BlackLivesMatter Planning To Disrupt A Marathon? 11:59 AM 10/01/2015 Is It Really A Good Idea To Chemically Suppress Your Son’s Puberty Because He Thinks He’s A Girl? 10:26 AM 10/01/2015 Planned Parenthood’s Defenders Haven’t Seen Those Videos, But So What? 3:41 PM 09/30/2015 Vox Explains Why Hillary Clinton Is A Flip-Flopper On Gay Marriage 1:51 PM 09/30/2015 Why Is Throwing A Newborn Baby Out A Window Considered Murder, But Abortion Isn’t? 10:33 AM 09/30/2015 The Daily Caller Register for Emails Learn more...", "external_links": ["https://medium.com/@SenSchumer/my-position-on-the-iran-deal-e976b2f13478", "https://www.youtube.com/embed/zX2FJ1LeCrY", "https://www.facebook.com/DailyCaller", "http://hotair.com/archives/2014/07/25/gruber-my-2012-remarks-were-a-speak-o/", "https://twitter.com/jonfavs/status/629476672245334017", "http://thehill.com/blogs/blog-briefing-room/250539-obama-allies-slam-schumer-on-iran-opposition"], "published": "2015-10-02T22:59:00.000+03:00", "crawled": "2015-10-03T23:52:18.976+03:00", "highlightTitle": ""}