{"organizations": [], "uuid": "01531bf2ce1891af260f5f260bccf871cf884a9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://yallpolitics.com/index.php/yp/atom/", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/wicker_calls_on_obama_to_sign_defense_bill/", "country": "US", "title": "Wicker calls on Obama to sign Defense bill", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Wicker calls on Obama to sign Defense bill", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:09:00.000+03:00", "replies_count": 0, "uuid": "01531bf2ce1891af260f5f260bccf871cf884a9f"}, "author": "Frank Corder", "url": "http://yallpolitics.com/index.php/yp/post/wicker_calls_on_obama_to_sign_defense_bill/", "ord_in_thread": 0, "title": "Wicker calls on Obama to sign Defense bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wicker Calls on Obama to Sign Defense Bill Military Blueprint Receives Overwhelming Bipartisan Support Despite Veto Threat WASHINGTON – U.S. Senator Roger Wicker, R-Miss., a senior member of the Senate Armed Services Committee, today voted in favor of final Senate passage of the “National Defense Authorization Act” (NDAA), H.R. 1735. The legislation provides a number of important reforms for the Defense Department and authorizes vital resources for the nation’s soldiers, veterans, military installations, and defense manufacturing. The Senate passed the bill by a vote of 70-27, which suggests that support for the bill may be enough to override a potential presidential veto. “Today’s overwhelming vote in favor of this defense bill highlights the importance of ensuring that our all-volunteer forces have the tools they need to carry out their missions,” Wicker said. “This bill also gives the military much-needed spending flexibility to lessen the impact of impending sequestration cuts. Disagreements over how we accomplish that goal should not stand in the way of protecting our defense and national security interests. Time and again, we hear that the world is becoming less safe. We see it in news reports every day. President Obama should take note and abandon his misguided veto threat.” President Obama has threatened to veto the proposal despite the fact that the NDAA authorizes $612 billion in defense spending – the very amount he requested in his budget proposal. Senate Democrats also continue to block the Senate from considering appropriations bills that would fund the programs authorized by the now-passed NDAA. “I also call on those Senate Democrats who voted today to pass NDAA to join us in putting an end to the partisan filibuster of the defense appropriations bill,” Wicker concluded. “Earlier this year, the Appropriations Committee voted to approve that measure by a vote of 27-3. Americans are right to wonder why Senate Democrats are blocking funding for our troops and veterans from moving forward.” NDAA and defense appropriations would impact Mississippi in the following ways: Tupelo: Recognizes the importance of the Army’s Apache helicopters and the Tupelo Army Aviation Support Facility. Columbus/Meridian: Allows student pilots to have adequate training and flying hours at Columbus Air Force Base and Meridian Naval Air Station. Starkville: Completes the Army Reserve Center for equipping and training military personnel. Gulfport-Biloxi: Supports a new Army National Guard Aviation Depot at the Gulfport-Biloxi Airport, as well as the continued mission of over 11,000 Americans who work at Keesler Air Force Base. The bill also includes: Equipping U.S. Naval Forces with New Amphibious Ships: Senator Wicker included a provision to authorize $476 million in advance procurement for an additional America-class amphibious assault ship, as well as $250 million in research and development funding for the next generation of amphibious ships. The nation’s current amphibious fleet of 30 ships falls short of Global Combatant Commander requirements, which call for more than 50 amphibious ships. The measure also authorizes more than $3.5 billion for the construction of two new DDG-51 destroyers, $550 million for a new LPD-17 amphibious ship, and approximately $476 million for a replacement LHA amphibious ship. Ensuring the Vitality of the National Guard: Included are provisions supported by Senator Wicker to maintain National Guard personnel levels and prevent additional Apache helicopters from being transferred away from the Army National Guard. Last year’s defense bill included a provision authorized by Senator Wicker and Senator Lindsey Graham, R-S.C., that created a commission to study the future of the Army. This independent commission is required to make a recommendation on size and force structure to Congress by February 2016. Modernizing the Army’s Air Fleet: Senator Wicker succeeded in securing a provision to authorize $187.2 million in procurement for 28 UH-72A Light Utility Helicopters (LUH). These helicopters would be used to replace the Army’s legacy aviation training aircraft. Preventing Military Suicide: The committee included provisions based on the “Military and Veterans Mental Health Provider Assessment Act of 2015” coauthored by Senator Wicker and Senator Joe Donnelly, D-Ind., requiring the Secretary of Defense to ensure that all primary care and mental health care providers of the Department of Defense receive evidence-based training on the recognition, assessment, and management of individuals at risk for suicide. Ensuring Religious Freedom in the Military: Senator Wicker included a provision that encouraged DOD to continue supporting service members’ rights to express sincerely held religious beliefs. 10/7/15 Posted October 8, 2015 - 5:09 am YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-08T14:09:00.000+03:00", "crawled": "2015-10-09T11:48:19.013+03:00", "highlightTitle": ""}