{"organizations": [], "uuid": "f9c59b319318eceff830ac5b18a40b9f7a261f15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westword.com", "main_image": "http://images1.westword.com/imager/u/original/7249287/morris.fate.7news.jpg", "site_section": "http://www.westword.com/news", "section_title": "Denver, Colorado News: Politics, Crime, Sports, Marijuana and Education Journalism | Westword", "url": "http://www.westword.com/news/morris-fates-idea-of-how-a-cop-talks-i-am-the-police-bitch-7249286", "country": "US", "title": "Morris Fate's Idea of How a Cop Talks: \"I Am the Police, Bitch\"", "performance_score": 0, "site": "westword.com", "participants_count": 1, "title_full": "Morris Fate's Idea of How a Cop Talks: \"I Am the Police, Bitch\" | Westword", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:28:00.000+03:00", "replies_count": 0, "uuid": "f9c59b319318eceff830ac5b18a40b9f7a261f15"}, "author": "Westword", "url": "http://www.westword.com/news/morris-fates-idea-of-how-a-cop-talks-i-am-the-police-bitch-7249286", "ord_in_thread": 0, "title": "Morris Fate's Idea of How a Cop Talks: \"I Am the Police, Bitch\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Morris Fate during a recent court appearance, where he didn't need to impersonate an inmate. A booking photo, an affidavit and more below. 7News via YouTube Simply pretending to be someone else doesn't necessarily make you a schmuck.\nIf you were to act like Mother Teresa, for example, we'd probably salute your kindness and compassion — not to mention the fine figure you cut when you're wearing a full habit.\nLately, however, there's been a rash of police impersonation cases in the metro area — including one involving recent Schmuck of the Week Robert Montoya , who was busted for pretending to be a cop after pulling one over .\nConsiderably more vile are the allegations against one Morris Fate, who allegedly thought a badge, not to mention dialogue that suggests a mash-up of a bad TV police procedural and a Dave Chappelle skit, would justify a particularly heinous attempt at sexual assault.\nAccording to a probable cause statement on view below, the incident took place October 6 on the 1700 block of Xenia Street, an area captured in the following interactive graphic. If you have problems seeing the image, click \"View on Google Maps.\"\nRelated Stories Robert Montoya Busted for Pretending to Be a Cop After Trying to Pull One Over There, Fate is said to have offered a woman a ride — but once she climbed inside his vehicle, he told her that \"she would perform oral sex on him,\" the document states.\nThe woman refused and quickly hopped out of the car, at which point police say Fate grabbed her by the hair, showed her a badge and said, \"I am the police, bitch.\"\nAt that point, it wouldn't have mattered if Fate had claimed to be...well, Mother Teresa.\nThe woman broke free in an attempt to get away, the PC statement maintains, and when Fate grabbed onto her again, she screamed so loudly that he returned to his car and split.\nFortunately, the woman was able to remember his license plate number and he was pulled over near the intersection of East 14th Avenue and Yosemite Street a short time later.\nThe Denver District Attorney's Office has now formally charged Fate with third-degree assault and impersonating a police officer.\nRight now, Fate's fate doesn't look too promising. Here's his booking photo, followed by the aforementioned affidavit.\nMorris Fate. Denver District Attorney's Office Morris Fate Arrest Affidavit\nContact: Westword Follow: Westword Westword", "external_links": ["https://www.scribd.com/doc/285233733/Morris-Fate-Arrest-Affidavit", "http://www.twitter.com/denverwestword", "https://www.google.com/maps/embed?pb=!1m0!3m2!1sen!2sus!4v1444934281365!6m8!1m7!1sCu-8DF2BAabcPXNTthCSFA!2m2!1d39.7438002030468!2d-104.8858154663843!3f0.2827020085895988!4f-18.20791765927899!5f0.7820865974627469", "https://www.facebook.com/DenverWestword", "http://www.youtube.com/watch?v=6aVwpH6R9wA", "https://www.scribd.com/embeds/285233733/content?start_page=1&view_mode=scroll&access_key=key-g4Vbx7UohZ4v0HQ9Ov7A&show_recommendations=true"], "published": "2015-10-16T17:28:00.000+03:00", "crawled": "2015-10-16T18:57:13.516+03:00", "highlightTitle": ""}