{"organizations": [], "uuid": "8d68b94145afb8ea267bd2ce6660f2a3b2a766a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcci.com", "main_image": "http://www.kcci.com/image/view/-/35993076/highRes/2/-/maxh/630/maxw/1200/-/127456z/-/Hillary-Clinton-leaves-Benghazi-hearing-jpg.jpg", "site_section": "http://www.kcci.com/9358052?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.kcci.com/politics/top-obama-backer-says-hell-support-clinton/36029246", "country": "US", "title": "Top Obama backer says he'll support Clinton", "performance_score": 0, "site": "kcci.com", "participants_count": 0, "title_full": "Top Obama backer says he'll support Clinton", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T00:01:00.000+03:00", "replies_count": 0, "uuid": "8d68b94145afb8ea267bd2ce6660f2a3b2a766a4"}, "author": "", "url": "http://www.kcci.com/politics/top-obama-backer-says-hell-support-clinton/36029246", "ord_in_thread": 0, "title": "Top Obama backer says he'll support Clinton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kevin Liptak", "Clinton", "Top Obama", "Clinton David Plouffe", "Obama"], "text": "By Kevin Liptak CNN White House Producer Top Obama backer says he'll support Clinton David Plouffe sees Clinton as best option UPDATED 4:01 PM CDT Oct 24, 2015 Photos Alex Wong/Getty Images \nSeeming to let bygones be bygones, President Barack Obama's top 2008 campaign strategist threw his enthusiastic backing behind Hillary Clinton Saturday, saying she was best positioned to carry Obama's legacy. Media Galleries Walker suspends campaign for president \nDavid Plouffe -- who during a drawn-out Democratic primary battle in 2008 deemed Clinton \"one of the most secretive politicians in America\" -- wrote in an online posting that over the years he's come to respect Clinton's tenacity. \n\"Here's what I, and so many of my fellow Obama campaign veterans, have learned about Hillary: She doesn't quit. And there were times I wish she had!\" Plouffe wrote on Medium. \"But you have to deeply admire that strength and persistence.\" \nHe said in the post that seven years ago, he \"would never have imagined writing this piece.\" But as the icy relations thawed between Obama and Clinton, he said it became clear that Clinton was the Democratic Party's best bet at keeping control of the White House. \n\"Americans still need a president who will wake up every day, prepared to overcome any obstacle on their behalf,\" he wrote. \"Hillary Clinton should -- and I believe will -- be that president.\" \nWith the exception of a few cabinet officials, top names in Obama's orbit have resisted backing a candidate in the Democratic primary, waiting instead until Vice President Joe Biden made his political aspirations known. He said this week he would not enter the race. \nThe decision prompted signs of relief from some of Obama's top aides, who see Clinton as the candidate most likely to capture the Democratic nomination and defeat a Republican rival. \nEven in public, the White House was more ebullient about Clinton this week than in weeks past, when the focus was on Biden. \nOn the day Clinton was testifying before the House Select Committee on Benghazi, spokesman Eric Schultz said watching her he was \"reminded of why President Obama chose Hillary Clinton to be his secretary of state in the first place.\" \n\"This is someone who clearly cares deeply about the issues, someone who has worked tirelessly to strengthen our relationships with our partners around the world,\" he said. \nIn his online posting Saturday, Plouffe, who served in the Obama administration's first term as a senior adviser before becoming a top official at Uber, laid out the stakes of the upcoming vote. He produced a list of potential Republican rivals that notably excluded Jeb Bush, whose campaign has slumped in the polls recently. \n\"The difference between Hillary Clinton and a President Trump, Carson, or Rubio could not be more profound,\" Plouffe wrote. \"Once again, we need a leader who understands the challenges we face -- and someone who can and will do something about it. Hillary is that leader, for this time.\" \n\"Go win this thing, Madam Secretary,\" he concluded.", "external_links": [], "published": "2015-10-25T00:01:00.000+03:00", "crawled": "2015-10-25T00:49:39.319+03:00", "highlightTitle": ""}