{"organizations": [], "uuid": "b4da1242eaf6f4ab66bbf6e9eee6e26b7db13f1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/opinion_impact/photo/18884042-standard.jpg", "site_section": "http://www.cleveland.com/open/", "section_title": "Ohio Politics &amp; Election News | cleveland.com ", "url": "http://www.cleveland.com/opinion/index.ssf/2015/10/to_help_solve_cleveland_airpor.html", "country": "US", "title": "To help solve Cleveland Hopkins International Airport's problems, create a regional airport authority: Brent Larkin", "performance_score": 0, "site": "cleveland.com", "participants_count": 4, "title_full": "To help solve Cleveland Hopkins International Airport's problems, create a regional airport authority: Brent Larkin | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:00:00.000+03:00", "replies_count": 3, "uuid": "a455b358edfe94324c06064da41990978dc8cac3"}, "author": "Brent Larkin, Northeast Ohio Media Group", "url": "http://www.cleveland.com/opinion/index.ssf/2015/10/to_help_solve_cleveland_airpor.html#post-0", "ord_in_thread": 0, "title": "To help solve Cleveland Hopkins International Airport's problems, create a regional airport authority: Brent Larkin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When a lousy airport begins to earn a reputation as a dangerous one, the population that airport serves has good reason to be outraged — and afraid.\nThat's why the $735,000 fine levied against Cleveland by the Federal Aviation Administration is a big deal, for it sends a chilling message to the entire planet about the management of Cleveland Hopkins International Airport.\nThe FAA has apparently documented dozens of dates over the last two winters when the city failed to adequately remove snow and ice from Hopkins' runways.\nSome pilots refused to land at the city-owned airport. Other landings were diverted. Outgoing flights were delayed due to unsafe conditions.\nFortunately — perhaps even miraculously — the city's gross negligence resulted in no major incidents.\nIn what is becoming an all-too-familiar refrain, Mayor Frank Jackson's administration promises to correct any and all mismanagement issues at the airport.\nIt's the same type of promise we've heard involving the police, fire, water and service departments.\nThere's a pattern here. And it's troubling.\nIf the mayor is serious about fixing Hopkins and improving air service for the entire region, he will recognize that only one solution makes sense: a regional authority of some sort that includes the Cuyahoga County Airport in Richmond Heights, and perhaps the Akron-Canton Airport .\nWhen Hopkins was a United Airlines hub, the Akron airport served as a brake on fares. But low-quality budget airlines now have a significant presence at both airports. Getting Hopkins out of Cleveland's control might benefit all of Northeast Ohio.\nAn alliance that requires Hopkins and Akron-Canton to work together on improving service also might transform two decidedly mediocre airports into a genuine regional asset.\nThis isn't rocket science. When a community isn't growing, a collaborative approach to the use of public assets becomes imperative. Greater Cleveland is a no-growth market whose largest airport has been mismanaged for 20 years.\nOf course, it's unlikely that the mayor's stubborn nature will allow him to consider such an obvious solution for improving the region's dismal air service.\nNo one cares more about quality air service than the corporate community. And if business leaders choose to use it, they have enormous leverage over Jackson on this issue.\nThe mayor wants and needs corporate Cleveland's support in helping to pay for the enormous costs of two projects.\nPolice reforms demanded by the U.S. Justice Department will cost at least $13 million next year. The mayor also needs generous corporate contributions to pay for next year's campaign asking voters to continue funding his school-reform plan. (There's no money to pay for police reforms, but no problem finding $30 million to pay for Browns owner Jimmy Haslam's new scoreboard.)\nIf business leaders are as alarmed at the mismanagement of Hopkins as they should be — and I hear many are — they will demand that the city relinquish control of the airport in return for funding the mayor's two worthy causes.\nThere are lots of potential consequences for failing to remove ice and snow from runways that transport thousands of people into and out of Cleveland every day.\nAll those consequences are bad. Some are deadly.\nBut the first-rate reporting on this issue by the Northeast Ohio Media Group's Leila Atassi and Mark Naymik leaves one with the disturbing sense the administration and the City Council don't comprehend the significance of the airport or the enormous damage that dysfunction there could do to the region's reputation.\nThat City Council sees no need even to ask questions is unconscionable. Given that mindset, the body might as well not even exist.\nThe Jackson administration's response has been to promise an appeal of the FAA fine and findings (good luck with that one), and to blame former airport boss Ricky Smith , who left two months ago to run the Maryland Aviation Administration.\nThe predictable finger-pointing between City Hall and Smith over who's to blame for all this includes seemingly reliable accusations by the airport's former airfield maintenance manager that he was punished by Smith for warning of the dangerous conditions at Hopkins .\nBut all this buck-passing ignores the fact Jackson hired Smith and kept him in an important position for nearly nine years. The best-case scenario for Jackson in this controversy is that Smith was yet another example of the mayor's blind loyalty to incompetent people harming the city he leads.\nAs I wrote at the time , Jackson should have fired Smith on the spot when, in early February of last year, Smith said United Airlines' decision to abandon its Cleveland hub might result in better service for airport customers.\nIn my more than 45 years of paying attention to City Hall, that comment ranked as one of the 10 dumbest — on a list that includes some real doozies.\nInstead of firing Smith, Jackson seemed to second his prediction with, \"Hopkins will continue to be an economic engine for Cleveland and this region.\"\nIt is — but just barely.\nOn the night of Sept. 24, I was waiting for my baggage at Hopkins when an employee there, whom I had never met, volunteered to me in hushed tones that the airport is dirtier and more poorly managed than at any time in his many years working there.\n\"Things are really bad,\" he told me.\nGreater Cleveland needs and deserves a regional approach to air service.\nAny city that creates life-threatening conditions on its airport runways is a city that doesn't deserve to own an airport.\nBrent Larkin was The Plain Dealer's editorial director from 1991 until his retirement in 2009.\nTo reach Brent Larkin: blarkin@cleveland.com", "external_links": [], "published": "2015-10-02T19:00:00.000+03:00", "crawled": "2015-10-02T18:57:02.581+03:00", "highlightTitle": ""}