{"organizations": [], "uuid": "56aeeff68ce2d88738b3c414042a4753bd2c2351", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30241616/pala-band-of-mission-indians-will-be-first-tribe-to-protect-native-american-children-in-californias-welfare-system", "country": "US", "title": "Pala Band of Mission Indians Will be First Tribe to Protect Native American Children in California's Welfare System", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Pala Band of Mission Indians Will be First Tribe to Protect Native American Children in California's Welfare System - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "56aeeff68ce2d88738b3c414042a4753bd2c2351"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30241616/pala-band-of-mission-indians-will-be-first-tribe-to-protect-native-american-children-in-californias-welfare-system", "ord_in_thread": 0, "title": "Pala Band of Mission Indians Will be First Tribe to Protect Native American Children in California's Welfare System", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Pala Band of Mission Indians\nPALA, Calif. , Oct. 12, 2015 /PRNewswire/ -- The Pala Band of Mission Indians is the first tribe in California to receive clearance to conduct LiveScan background checks for tribal foster homes under new State law (Senate Bill 1460). The tribe is also the first to apply to the Bureau of Indian Affairs' Office of Justice Services (BIA-OJS) program, Purpose Code X, to assist tribal services agencies within federally recognized tribes that are seeking to place children in safe homes during an emergency situation, when parents are unable to provide for their welfare.\n\"We are very excited to be a part of this momentous change to protect our Native youth in the welfare system,\" said Robert Smith , Chairman of the Pala Band of Mission Indians. \"For years, Native American children have been placed in homes that do not reflect their cultural heritage and placed with foster parents who have not had their criminal history thoroughly vetted because the tribe was not allowed to conduct these background checks. Now we can certify tribal homes that are prepared to care for these children in a timely manner and ensure that Native American children are maturing in an appropriate environment.\"\nThe Purpose Code X program provides BIA Office of Justice Services with the ability to provide tribal social service agency partners with much-needed information to help make sure children requiring emergency placement will be placed in safe homes. The program arose out of a 2014 working group formed by the Department of Justice (DOJ) and the Interior (DOI) to identify sustainable solutions addressing the civil needs of the tribes. Under this program, BIA dispatch centers will be available to provide 24-hour access to criminal history records, so name-based checks can be done immediately.\nWith the changes made in California law, tribes are now able to receive criminal history and child abuse information from the California DOJ and be involved in the approval of tribal foster homes. The law also provides for the transfer of Native American children case records from a county to tribal government. Under new standards for foster homes, the tribe will be provided with a federal criminal offender check of all adults residing in a family home, as a condition for approval.\n\"It has been an honor to be part of the work behind SB 1460 and to see the positive impact it has made for Pala and the other California Tribes,\" said Season Brown , Director of Social Services of Pala Band of Mission Indians. \"I'm very excited for Pala to begin the new venture of piloting Purpose Code X and being able to reduce the trauma experienced by our Native children, which is often associated with being placed outside of their Tribal community in Non-Native homes.\"\nPurpose Code X and California State law are now working cohesively to ensure that tribes are able to effectively serve and protect their communities by ensuring the exchange of critical data. California State Attorney General Kamala D. Harris has made it a priority to protect the rights of children and focus the attention and resources of law enforcement and policymakers in safeguarding every child so that they can meet their full potential. These measures will ensure that laws and regulations enacted to protect children, inclusive of Indian welfare children, are consistently and effectively enforced.\nThe Pala Band of Mission Indians is a federally recognized tribe whose reservation is located along the Palomar Mountain range approximately 30 miles northeast of San Diego . The majority of the over 900 tribal members live on the 12,000-acre reservation, established for Cupeno and Luiseno Indians, who consider themselves to be one proud people - Pala.\nCONTACT: Doug Elmets\n(916) 329-9180\n releases/pala-band-of-mission-indians-will-be-first-tribe-to-protect-native-american-children-in-californias-welfare-system-300158089.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/pala-band-of-mission-indians-will-be-first-tribe-to-protect-native-american-children-in-californias-welfare-system-300158089.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=SF25933&Transmission_Id=201510121446PR_NEWS_USPR_____SF25933&DateId=20151012", "http://www.xmlnews.org/ns/"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T23:10:44.747+03:00", "highlightTitle": ""}