{"organizations": [], "uuid": "1f3921612bca64c631f8501b9da84c15c799e8b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30334642/lenox-advisors-holds-second-annual-corporate-sleep-out", "country": "US", "title": "Lenox Advisors Holds Second Annual Corporate Sleep Out", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Lenox Advisors Holds Second Annual Corporate Sleep Out - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f3921612bca64c631f8501b9da84c15c799e8b6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30334642/lenox-advisors-holds-second-annual-corporate-sleep-out", "ord_in_thread": 0, "title": "Lenox Advisors Holds Second Annual Corporate Sleep Out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Lenox Advisors, Inc.\nNEW YORK , Oct. 23, 2015 /PRNewswire/ -- Lenox Advisors spent the night of October 22nd sleeping outside on the pavement surrounding the Covenant House shelters in New York City and Hollywood, CA.\nThis company-wide Sleep Out was a first-of-its-kind for the wealth management firm and the homeless youth shelter back in 2014. Now, their partnership and Sleep Outs have raised over $200K to drive awareness and support of homeless and runaway youth in America.\nLenox Advisors and Covenant House partner throughout the year to demonstrate the meaningful impact both small and large firms can – and should – have in their communities and across the country. The goal: defray the cost of operating Covenant House youth shelters that provide food, clothing, shelter and, ultimately, the possibility of a vibrant future for homeless youth.\nFollowing on the success of the Lenox Advisors Sleep Out , Covenant House has started rolling out Company Sleep Outs with many other successful organizations who wish to participate.\n\"This is a human rights movement on behalf of homeless youth. Companies – small and large – have the potential to help thousands of homeless children. I'm proud to represent a firm who is taking action to make change and, most importantly, show the kids that we care and we're here for them,\" said Greg Olsen , Partner and President of the Lenox Foundation. \"Spending the night trying to sleep on the pavement is a humbling experience. An experience no child should be familiar with.\"\n\"We are so grateful to our friends at Lenox Advisors for taking on the challenge of sleeping out for a second consecutive year,\" said Covenant House President Kevin Ryan . \"The impact of last year's effort, which was covered by Good Morning America and raised over $100,000 , is still being felt. The example Lenox is setting for other companies to follow is having a dramatic effect on our Covenant House Sleep Out movement across the country and increasing the number of homeless youth we can bring into the safety of our program.\"\nAbout Lenox Advisors, Inc.\nDriven by the notion of what is best for you, Lenox builds custom solutions that integrate the financial needs of high net worth individuals, their families and corporate clients. As your advocate, we take the time to deeply understand your goals and values and then develop strategies to help protect and preserve your wealth.\nInformation can be found by visiting www.lenoxadvisors.com .\nMedia inquiries:\nKelly A. Jones , Head of Marketing\n530 Fifth Avenue, 11th Floor, New York , NY 10036\n212.536.6065\nLogo - http://photos.prnewswire.com/prnh/20150909/265146LOGO\n releases/lenox-advisors-holds-second-annual-corporate-sleep-out-300163708.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/lenox-advisors-holds-second-annual-corporate-sleep-out-300163708.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY33855&Transmission_Id=201510231015PR_NEWS_USPR_____NY33855&DateId=20151023", "http://www.lenoxadvisors.com/", "http://photos.prnewswire.com/prnvar/20150909/265146LOGO", "http://photos.prnewswire.com/prnh/20150909/265146LOGO"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T18:52:23.540+03:00", "highlightTitle": ""}