{"organizations": [], "uuid": "24116196006088cf1120fdbf52e160356bd4acaa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://media.kentucky.com/smedia/2015/06/03/15/14/1hAVHc.AuSt.79.jpg", "site_section": "http://www.kentucky.com/329/index.rss", "section_title": "Kentucky.com -- Politics and Government", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/09/4079804_judge-dismisses-four-of-five-charges.html", "country": "US", "title": "Edelen holds huge financial advantage over Harmon in tight race for state auditor", "performance_score": 0, "site": "kentucky.com", "participants_count": 1, "title_full": "Edelen holds huge financial advantage over Harmon in tight race for state auditor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:13:00.000+03:00", "replies_count": 0, "uuid": "24116196006088cf1120fdbf52e160356bd4acaa"}, "author": "jbrammer@herald-leader.com (Jack Brammer)", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/10/09/4079804_judge-dismisses-four-of-five-charges.html", "ord_in_thread": 0, "title": "Edelen holds huge financial advantage over Harmon in tight race for state auditor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Edelen holds huge financial advantage over Harmon in tight race for state auditor By Jack Brammer jbrammer@herald-leader.com October 9, 2015 Updated 20 hours ago 2015-10-10T10:58:23Z \nEducation : Bachelor's degree in agriculture, University of Kentucky \nOccupation : Former chief of staff to Gov. Steve Beshear and former business management consultant \nElected office : Kentucky auditor, 2011-present \nFamily : Wife, Melissa; twin sons \nEducation: Bachelor's degree in math, statistics and theater, Eastern Kentucky University \nOccupation: Insurance agent \nElected office: State representative, 2003-present \nFamily: Wife, Lynn; two daughters. \nWebsite: Harmonforauditor.com \nFRANKFORT — Democratic state Auditor Adam Edelen is within striking distance of raising a record-breaking $1 million for his re-election campaign, greatly outpacing his Republican rival, state Rep. Mike Harmon. \nBut Edelen, who has held the office over state expenditures since 2012, is not running away with the race. \nA Bluegrass Poll released last week shows a statistical dead heat, with 35 percent of likely voters siding with Edelen, 33 percent with Harmon and 27 percent undecided. \n\"People tend not to focus on down-ticket races until the very end. I expect it will be breaking more for me as we get closer to the Nov. 3 election,\" Edelen said. \nHarmon, of Danville, said he feels \"good about the race though I will be greatly outspent.\" \nEdelen, of Lexington, launched his first television ad this week, but Harmon, of Danville, said he has no plans to advertise on TV. He said he can get his message out through personal appearances and social media. \nCampaign finance reports filed Oct. 7 show that Edelen has raised more than $915,000, breaking all previous fundraising records set by any campaign for state auditor. The previous record was $745,240, which Edelen raised in his 2011 campaign. \n\"It is clear that the unparalleled record of bipartisan accomplishment we have achieved over the last four years is resonating with Kentuckians, and I want to thank them for all of the support they have given us,\" said Edelen, who was chief of staff for Gov. Steve Beshear before becoming auditor. \nEdelen reported $557,599 cash on hand for the final weeks of the campaign. \nHarmon reported having only $9,532 cash on hand. He had raised $26,365 and transferred $2,603 left over from his primary election campaign last spring. \nLike other Republicans running for statewide office this fall, one of Harmon's key tactics is trying to tie Edelen to president Barack Obama, who remains unpopular in the state. \nIn particular, Harmon said Edelen contributed $1,000 in 2008 to Obama's presidential campaign. \nEdelen said he has a history of supporting Democratic candidates, and \"voters will see me as an auditor with bipartisan support who has tracked billions of taxpayer dollars and put a lot of bad guys in jail for misusing those dollars.\" \nThe primary duty of the office is to audit all accounts and financial transactions of state government spending agencies. The job of Kentucky auditor pays $117,329 a year. The office had an operating budget last year of nearly $11 million. \nOne of Edelen's most publicized cases was an audit of the state agriculture department under the administration of former commissioner Richie Farmer. It was requested by Republican Agriculture Commissioner James Comer. \nFarmer, a former University of Kentucky basketball star, is serving a prison sentence for misuse of state resources and personnel. The crimes were turned up in the audit. \nEdelen also led an effort to reform special taxing districts, which represent a $2.7 billion layer of government. He also found wasteful spending and other abuses in public school districts and began tracking untested sexual assault kits in Kentucky. \nHarmon, who ran unsuccessfully for lieutenant governor with Republican Phil Moffett in 2011, said the state needs a new auditor with conservative principles. \n\"Government is bigger than ever, and I don't think Edelen has done enough to keep track of major expenses like our state employees' and teachers' retirement systems,\" Harmon said. \"He also backs liberal causes, and all government should be rid of that.\" \nAsked what liberal causes Edelen backs, Harmon said, \"He supported Obama. That says enough.\" \nEdelen said he thinks Harmon got into the race not to become the state auditor but \"to take me out\" as a potential candidate for the U.S. Senate in 2016. \nEdelen dismisses speculation that he will run next year against Republican U.S. Sen. Rand Paul of Bowling Green. \n\"People who know me know I'm not angling for a job in Washington,\" Edelen said. \"My plan is to serve as another four years as Kentucky's auditor.\" \nWhen Harmon entered the race, he acknowledged that he hoped his campaign would sully Edelen as a possible opponent against Paul in 2016. \nHe said that would be \"icing on the cake,\" but his priority was to stop his re-election as auditor. \nHarmon acknowledged that Jesse Benton, who managed Paul's successful bid for the Senate in 2010, approached him about running for auditor. \nBenton worked for U.S. Sen. Mitch McConnell's re-election campaign last year, until he left when his name was linked to a political scandal in Iowa. Benton, who has denied any wrongdoing, is scheduled to go to trial Oct. 13. On Friday, a judge dismissed three of the four charges against him, but a charge of lying to the FBI remains. \nBenton left Harmon's campaign after being indicted earlier this year. Harmon said the only contact he has had with Benton since then is an email from Benton inquiring about an invoice for his work. Jack Brammer: (502) 227-1198. Twitter: @BGPolitics. Blog: Bluegrasspolitics.bloginky.com.", "external_links": [], "published": "2015-10-10T00:13:00.000+03:00", "crawled": "2015-10-11T09:49:43.899+03:00", "highlightTitle": ""}