{"organizations": [], "uuid": "bc41c40b491cf34b6f246b0625103e10380f445b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30304783/collaborative-industry-wide-veterinary-innovation-council-to-lead-global-animal-health-initiatives", "country": "US", "title": "Collaborative, industry-wide Veterinary Innovation Council to lead global animal health initiatives", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Collaborative, industry-wide Veterinary Innovation Council to lead global animal health initiatives - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "bc41c40b491cf34b6f246b0625103e10380f445b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30304783/collaborative-industry-wide-veterinary-innovation-council-to-lead-global-animal-health-initiatives", "ord_in_thread": 0, "title": "Collaborative, industry-wide Veterinary Innovation Council to lead global animal health initiatives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " North American Veterinary Community\nAdrian Hochstadt, JD, CAE and former AVMA Assistant Director will lead the NAVC VIC.\nGAINESVILLE, Fla. , Oct. 20, 2015 /PRNewswire/ -- Today the North American Veterinary Community (NAVC) announced that it has established the Veterinary Innovation Council (VIC), a non-profit 501(c)(6) association with the mission of convening the brightest minds in the profession and industry together to tackle innovation opportunities that lift up all animal health care segments including caregivers, academia, suppliers and consumers.\nThis project-driven, collaborative industry body is aimed at three primary goals:\nConvening talent from across the profession to tackle global challenges facing the animal health industry; challenges that require collaboration and innovation Developing realistic, innovative solutions capable of transforming areas of critical value to the veterinary profession and animal health industry Collaborating with professional organizations, companies and non-profits to implement the innovations and reforms. NAVC CEO Thomas M. Bohn , MBA, CAE stated, \"Existing veterinary trade organizations perform vital roles in protecting and advancing the interests of their members. But we saw an unmet need for a veterinary organization that works industry-wide to focus on positive change and push the envelope for innovative solutions across professional boundaries. Initially, VIC initiatives will include enhancing the value of veterinary technicians as well as telemedicine standards.\"\nNAVC President Christine Navarre, DVM, MS, DACVIM (LAIM) , added, \"We're proud to initiate this exciting development for our profession. The VIC will carefully leverage the breadth and depth of the NAVC and its relationships within the profession to build the foundation for a long-term engine that drives innovation and reform.\"\nAdrian Hochstadt , JD, CAE is the new Senior Director of Industry Services & Executive Director, Veterinary Innovation Council. Hochstadt comes to this new position with significant association management and veterinary advocacy experience. For the past 10 years, he served as the AVMA Assistant Director of State Relations. His background also includes roles at the Accreditation Association for Ambulatory Health Care, the American Society of Plastic and Reconstructive Surgeons and the American Bar Association. He said, \"I look forward to working with a variety of entities and individuals to promote solutions that will enhance animal health for the benefit of consumers, veterinary professionals and the animal health industry.\" For questions about the VIC, please contact Adrian Hochstadt directly at AHochstadt@NAVC.com .\nAbout the NAVC\nFounded in 1982 and headquartered in Gainesville, Florida , the North American Veterinary Community (NAVC) is a non-profit organization providing world-class professional development to the global veterinary healthcare community. Its largest initiative, the annual NAVC Conference, hosts more than 16,000 attendees each year. Other offerings include VetFolio, an online CE platform for all veterinary professionals; the NAVC Institute; and several publications including its official journals, Today's Veterinary Practice and Today's Veterinary Technician (coming January 2016 ).\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/collaborative-industry-wide-veterinary-innovation-council-to-lead-global-animal-health-initiatives-300162822.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL33099&Transmission_Id=201510200922PR_NEWS_USPR_____FL33099&DateId=20151020", "http://www.prnewswire.com/news-releases/collaborative-industry-wide-veterinary-innovation-council-to-lead-global-animal-health-initiatives-300162822.html", "http://www.todaysveterinarypractice.com/", "http://www.navc.com/", "http://www.todaysveterinarytechnician.com/"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T18:19:02.512+03:00", "highlightTitle": ""}