{"organizations": [], "uuid": "44faa379da6ea938b054c772605a323072640aa5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.channel3000.com", "main_image": "http://www.channel3000.com/image/view/-/35941596/highRes/1/-/maxh/640/maxw/640/-/eqio91/-/I-39-I-90-generic-650-jpg.jpg", "site_section": "http://www.channel3000.com/103182?format=rss_2.0&view=feed", "section_title": "Local Political News", "url": "http://www.channel3000.com/news/walker-administration-asks-for-money-to-keep-i90-project-on-schedule/35941560", "country": "CH", "title": "DOT asks for money to reduce delays; Some GOP not on board", "performance_score": 0, "site": "channel3000.com", "participants_count": 0, "title_full": "DOT asks for money to reduce delays; Some GOP not on board", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T04:11:00.000+03:00", "replies_count": 0, "uuid": "44faa379da6ea938b054c772605a323072640aa5"}, "author": "", "url": "http://www.channel3000.com/news/walker-administration-asks-for-money-to-keep-i90-project-on-schedule/35941560", "ord_in_thread": 0, "title": "DOT asks for money to reduce delays; Some GOP not on board", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tempers flare as lawmakers pass campaign finance bill \nBut some Republican lawmakers said they will not go along with the plan. \nTransportation Secretary Mark Gottlieb sent a letter to lawmakers Monday asking to borrow more funds to reduce delays to road projects, saying that spending the money now would prevent more costly repairs later. \nThe DOT planned for two-year delays to major projects in the most recent state budget, including Interstate 39/90 from Dane County to the Illinois state line, and the second phase of Verona Road reconstruction. \nGov. Scott Walker made the case for the additional borrowing while speaking at the Wisconsin Manufacturers and Commerce business day Tuesday. \n\"If we don't have this money approved those projects have to be delayed,\" Walker said. \"Some say, 'Why can't you rearrange your priorities?' Those are our priorities. There's not things we have hidden in our back pocket.\" \nSen. Alberta Darling, R-River Hills, said Tuesday that additional borrowing is not sustainable and will only take money away from other spending needs, like public schools and Medicaid. \n\"We think there has to be an alternative to transportation funding,\" Darling said. \"So we are in this box where I don't think you're going to see the Senate approving that spending because we feel it's not in the best long-term interest of transportation.\" \nAssembly Speaker Robin Vos said he thought GOP members of the state Assembly on the finance committee would support the request, as did Assembly Minority Leader Peter Barca. \nSen. Jon Erpenbach, D-Middleton, said he has to see the deal before he'd say how he would vote, but said GOP members are delaying a decision on long-term road funding. \n\"They knew this day was going to come and they didn't do anything about it on finance and now they're going to say the Democrats are going to bail us out,\" Erpenbach said. \"Well yeah, we will help if it's a good fair plan that not only deals with the bonding situation but also possibly looks at a gas tax or a long-term solution where we can get on a road where we'll know we have X amount of dollars to pay for roads.\" \nIf the loan request is approved, a two-year delay for the Interstate 90 expansion project in Dane and Rock counties would be reduced to one year, but the money would not remove a delay in completing the Verona Road project. The state would also put $75 million toward highway rehabilitation projects across the state. \nThe finance committee will have to meet to discuss whether to approve the request. \nCopyright 2015 by Channel 3000 . The Associated Press contributed to this report.  ", "external_links": [], "published": "2015-10-21T04:11:00.000+03:00", "crawled": "2015-10-21T08:13:51.950+03:00", "highlightTitle": ""}