{"organizations": [], "uuid": "4d6c8e8b520c6b67845b75a6bbf892d7f6a33d9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3268665.1444753474!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/fedelxn-conservatives-201501013.jpg", "site_section": "http://rss.cbc.ca/lineup/politics.xml", "section_title": "CBC | Politics News", "url": "http://www.cbc.ca/news/politics/canada-election-trudeau-harper-1.3268121?cmp=rss", "country": "IL", "title": "Harper's cash register sounds for 2nd day as Trudeau sums up Liberal math", "performance_score": 0, "site": "cbc.ca", "participants_count": 1, "title_full": "Harper's cash register sounds for 2nd day as Trudeau sums up Liberal math", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:57:00.000+03:00", "replies_count": 0, "uuid": "4d6c8e8b520c6b67845b75a6bbf892d7f6a33d9f"}, "author": "CBC News", "url": "http://www.cbc.ca/news/politics/canada-election-trudeau-harper-1.3268121?cmp=rss", "ord_in_thread": 0, "title": "Harper's cash register sounds for 2nd day as Trudeau sums up Liberal math", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stephen Harper, Justin Trudeau tally who offers families more Tory leader doubles down on cash register sound effect during Toronto-area appearance CBC News Posted: Oct 13, 2015 9:57 AM ET Last Updated: Oct 13, 2015 1:10 PM ET Conservative Leader Stephen Harper on Tuesday repeated a weekend stunt in which he added up the purported impact of the Liberal platform on the finances of everyday Canadians. (Jonathan Hayward/Canadian Press) Steven Harper says Trudeau will over spend and he is the good manager 2:06 Related Stories Leaders know they must win Ontario to secure power \nHarper, speaking to supporters at a film equipment rental company, repeated a weekend stunt in which he added up the purported impact of the Liberal platform on the finances of Canadians. The Conservative leader had a local pizza shop owner slap down dollar bills — with a cash register sound effect to emphasize each point. \nThe event was attended by Toronto city councillor and former mayor Rob Ford and his brother Doug, a former councillor and mayoral hopeful who is said to be eyeing a run for the Tory leadership. \nHarper staged a similar demonstration during an event on Monday, which prompted an apparent response from the Liberal camp when Trudeau made his first appearance of the day at a Toronto cafe. \nTrudeau's speech included a nod to a local family who, he said, are working to pay down debt while saving for their children's education. The Liberal leader said his economic plan, which includes a tax cut for the middle class, would put $5,100 back into the family's pocket. \nWith some polls pointing toward a Liberal minority government, Trudeau is under pressure to pry voters away from the NDP and the Conservatives. His speech in the NDP-held riding of Beaches-East York touted the progressive policies he has promised if elected on Monday while likening NDP Leader Tom Mulcair's platform to that of Harper. \n\"It's clear that Tom Mulcair's NDP isn't offering real change,\" Trudeau told the crowd. \"He would rather balance Stephen Harper's budget than invest in our communities and give families the help they need right now.\" \nAsked if he's worried about losing support to Trudeau, Harper insisted voters won't be fooled by the pitch. \n\"I don't think that conservatives, certainly people who lean to our party, are going to for a minute buy the idea that in an unstable global economy we should go on a spending binge of $150 billion paid for by cutting benefits, by raising taxes and running deficits,\" he said during a question and answer session with reporters. \"Canadians are not going to buy that.\" Liberal Leader Justin Trudeau spoke to supporters at a cafe in the NDP-held riding of Beaches-East York in Toronto, touting the progressive policies he has promised if elected on Monday. (Tom Parry/CBC) \nIn contrast, the Conservative economic platform offers a \"stable economic plan\" with modest investments, balanced budgets and tax cuts, Harper said. \nHis appearance in the riding of Etobicoke-Lakeshore was significant. It's where former Liberal leader Michael Ignatieff infamously lost his seat in the 2011 campaign to Conservative Bernard Trottier. \nBut with the Liberals reinvigorated under Trudeau, Harper finds himself on the defensive in the riding and will choose another point of differentiation between his party and what's at stake if the Liberals form government. Across Ontario \nAll three major party leaders are making stops in Toronto and elsewhere in vote-rich Ontario today. \nMulcair started the day in Oshawa before heading to town hall in Toronto. He is scheduled to be in Brampton this evening. \nThe Oshawa riding was once held by former NDP leader Ed Broadbent but has been represented by Conservative Colin Carrie since 2004.", "external_links": [], "published": "2015-10-13T16:57:00.000+03:00", "crawled": "2015-10-13T20:28:10.999+03:00", "highlightTitle": ""}