{"organizations": [], "uuid": "bf62369a10513e7fc5cdb2c6fd8dd1e62850d8aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "tracking.feedpress.it", "main_image": "https://kpbs.media.clients.ellingtoncms.com/img/news/tease/2015/10/09/AP_736031523299_t700.jpg", "site_section": "http://feeds.kpbs.org/kpbs/politics", "section_title": "kpbs.org stories: Politics", "url": "http://tracking.feedpress.it/link/13290/1855281", "country": "US", "title": "Issa Says He Is Candidate For House Speaker", "performance_score": 0, "site": "feedpress.it", "participants_count": 1, "title_full": "Issa Says He Is Candidate For House Speaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T21:11:00.000+03:00", "replies_count": 0, "uuid": "bf62369a10513e7fc5cdb2c6fd8dd1e62850d8aa"}, "author": "City News Service", "url": "http://tracking.feedpress.it/link/13290/1855281", "ord_in_thread": 0, "title": "Issa Says He Is Candidate For House Speaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Issa Says He Is Candidate For House Speaker Friday, October 9, 2015 By City News Service Associated Press House Oversight Committee Chairman, Rep. Darrell Issa, R-Calif. speaks on Capitol Hill in Washington, Tuesday, Dec. 9, 2014. \nRep. Darrell Issa, R-Vista, said Friday he is a potential candidate for speaker of the U.S. House of Representatives, a post that Rep. John Boehner, R-Ohio, is hoping to vacate at the end of this month. \n\"The fact is, yes, I think that I could potentially be a candidate,\" Issa said on MSNBC's \"Morning Joe\" program. \nHe said the Republican majority in the House needs to choose a leader who is experienced and previously served as a committee chairman. He later posted a video of the television appearance on his Twitter account and said he is considering a bid to become speaker. \nIssa is a former chairman of the Oversight and Government Reform Committee who led the investigation into President Barack Obama's administration's handling of the attack in Benghazi, Libya, that killed four Americans. The car alarm magnate has served in Congress since 2001, and is the legislative body's wealthiest current member. \nIf elected speaker, he would be the first San Diego representative to hold the post and the second from California, after Nancy Pelosi, D-San Francisco. \nBoehner's succession was thrown into turmoil this week when the perceived front-runner for the job, Rep. Kevin McCarthy, R-Bakersfield, withdrew from consideration. \nThe two candidates as of now are Jason Chaffetz, R-Utah, and Daniel Webster, R-Fla., according to Politico. Chaffetz succeeded Issa as head of the Oversight Committee. \nWisconsin congressman and former vice presidential candidate Paul Ryan had been discussed as a potential candidate, but on Thursday he declined to run for the speaker post.", "external_links": [], "published": "2015-10-09T21:11:00.000+03:00", "crawled": "2015-10-10T12:49:31.290+03:00", "highlightTitle": ""}