{"organizations": [], "uuid": "903b73889b0b9cc74dbbf0964f7365739f7286f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-n_bc5d0019da3dade4e87c1d3cb622bc8e.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/former-head-of-pro-paul-super-pac-cleared-of-4-of-5-charges/article/2573827?custom_click=rss", "country": "US", "title": "Former head of pro-Paul super PAC cleared of 4 of 5 charges", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Former head of pro-Paul super PAC cleared of 4 of 5 charges | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:38:00.000+03:00", "replies_count": 0, "uuid": "903b73889b0b9cc74dbbf0964f7365739f7286f7"}, "author": "Gabby Morrongiello", "url": "http://www.washingtonexaminer.com/former-head-of-pro-paul-super-pac-cleared-of-4-of-5-charges/article/2573827?custom_click=rss", "ord_in_thread": 0, "title": "Former head of pro-Paul super PAC cleared of 4 of 5 charges", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jesse Benton, former head of a super PAC backing Republican presidential candidate Rand Paul, was acquitted Friday for all but one charge, due to prosecutorial errors during the federal grand jury trial that led to his indictment.\nBenton was indicted on five counts in early August for allegedly bribing ex-Iowa State Sen. Kent Sorenson to switch his endorsement during the 2012 presidential election from then-Minnesota Congresswoman Michele Bachmann to then-Texas Rep. Ron Paul.\nHowever, a federal judge from the Southern District of Iowa tossed four of the five charges against Benton out Friday because of the prosecution's inclusion of written statements provided by Benton and co-defendant John Tate to the Federal Bureau of Investigation that it had previously agreed not to present to the grand jury.\nIn his decision to acquit Benton, Judge John Jarvey cited a 1972 Supreme Court case, United States vs. Kastigar , that dealt with compelled testimony and the Fifth Amendment privilege of self-incrimination.\n  Obama: Yes to pot, no to oil The administration makes it easier to grow marijuana on Indian lands than to produce oil and gas.\nBy John Siciliano • 10/10/15 12:01 AM \"The Eighth Circuit has drawn on Kastigar to analyze proffer agreement cases And it has indicated that dismissal is an appropriate remedy even when the testimony is not compelled,\" Jarvey wrote in his opinion, later obtained by the Washington Examiner .\nBenton, a former Ron Paul staffer who went on to lead the pro-Rand Paul America's Liberty PAC, is still being charged with one count of making a false statement to FBI officials during the criminal investigation.\nWhile both Tate and Benton's motions to dismiss four of the five charges were granted, Dimitrios Kesari, a political operative also charged in the case, has not been acquitted of any charges.\nBenton's attorney, Meena Sinfelt, declined to comment to the Washington Examiner .\nAlso from the Washington Examiner Critics: Obama's new Syria plan still a misfire Lawmakers have pressed the president for a change in policy in the wake of Russia's intervention in Syria.\nBy Charles Hoskinson • 10/10/15 12:01 AM Top Story Obama: Yes to pot, no to oil The administration makes it easier to grow marijuana on Indian lands than to produce oil and gas.\nBy John Siciliano • 10/10/15 12:01 AM", "external_links": [], "published": "2015-10-09T22:38:00.000+03:00", "crawled": "2015-10-10T11:18:09.624+03:00", "highlightTitle": ""}