{"organizations": [], "uuid": "9872c6a83b5e48d5569296da84531421b61ab2ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.koco.com", "main_image": "http://www.koco.com/image/view/-/35827612/highRes/2/-/maxh/630/maxw/1200/-/p1eq74z/-/Bernie-Sanders-at-debate-jpg.jpg", "site_section": "http://www.koco.com/9844974?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.koco.com/politics/babiesforbernie-catches-on-social-media/35900222", "country": "US", "title": "#BabiesForBernie catches on social media", "performance_score": 0, "site": "koco.com", "participants_count": 0, "title_full": "#BabiesForBernie catches on social media", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T23:55:00.000+03:00", "replies_count": 0, "uuid": "9872c6a83b5e48d5569296da84531421b61ab2ab"}, "author": "", "url": "http://www.koco.com/politics/babiesforbernie-catches-on-social-media/35900222", "ord_in_thread": 0, "title": "#BabiesForBernie catches on social media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bernie Sanders"], "text": "#BabiesForBernie catches on social media Parents are dressing up kids as Bernie Sanders UPDATED 3:55 PM CDT Oct 17, 2015 \nBernie Sanders' plan sure sounds good: Make tuition free at all public colleges and universities. Expand Medicare to all Americans so no one would go without health insurance. \nRebuild Americans' crumbling roads, bridges, airports, public transit syst... \nVermont Sen. Bernie Sanders said he would be stranded on a deserted island with Florida Sen. Marco Rubio because \"He's used to the sun.\" \nAnd what his Ben and Jerry's ice cream flavor would be? \"Bern, Bernie, Bern.\" \nThose were some of the answers Sander... More \nA new social media trend is picking up steam as parents are dressing up and photoshopping their tots as the 74-year-old Bernie Sanders, tagging the photos #BabiesForBernie. \nThe trend started when Los Angeles artist Ashira Siegel wasn't able to attend a Sanders rally because of her newborn son, Natan, so she posted a photo of the newborn with his fist up in the air on a Sanders supporter group called Geeks For Bernie, she told CNN Saturday. \nSomeone in the group offered to photoshop hair and glasses on her baby, and then the image went viral, she said. \n\"I didn't have an agenda. I made the meme and was pretty shocked,\" she said. \"I had been a bit frustrated with having a newborn and locked on the couch, so it was a kind of a nice way to be able to participate in the conversation and support while still being able to be with my son.\" \nTo help the Sanders cause, she created a website, www.babiesforbernie2016.com, that sells onesies, as well as kids and adults' shirts that feature a drawing of her son dressed as the candidate with \"Babies For Bernie\" printed in large letters. Siegel said she began selling the onesies because the Sanders campaign doesn't offer them in its online store. \nShe said all proceeds from the sales are given directly to the Sanders campaign and/or are used for grassroots efforts. \nIn addition to the website, Siegel created a Facebook group titled \"Babies For Bernie 2016\" in August. The group describes itself as a place where people can share Sanders-related articles, thoughts and photos. \nHer trend has caught on Instagram, where other parents have also been sharing photos of babies dressed or photoshopped with glasses, white hair and a hand up in the air, tagging #BabiesForBernie. \nSiegel said she identifies with Sanders' progressive message. \n\"I think he's a good person and he has the best interest of the nation at heart, not the interest of the uber wealthy,\" she said. \"I want the best for my son, and I think Bernie Sanders will get us there.\" \nCheck out more photos here.", "external_links": [], "published": "2015-10-17T23:55:00.000+03:00", "crawled": "2015-10-18T08:41:49.556+03:00", "highlightTitle": ""}