{"organizations": [], "uuid": "a192fe88614fcae3963d36c67e9fb586ade5c65f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://beforeitsnews.com/mediadrop/uploads/2015/43/820695bab5d1fd3747cd500cd9883b00650757b8.png", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/libertarian/2015/10/why-should-we-expect-a-close-association-between-autonomy-realism-and-happiness-in-a-worthwhile-life-2621982.html", "country": "US", "title": "Why should we expect a close association between autonomy, realism and happiness in a worthwhile life? | Libertarian", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Why should we expect a close association between autonomy, realism and happiness in a worthwhile life? | Libertarian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T21:44:00.000+03:00", "replies_count": 0, "uuid": "a192fe88614fcae3963d36c67e9fb586ade5c65f"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/libertarian/2015/10/why-should-we-expect-a-close-association-between-autonomy-realism-and-happiness-in-a-worthwhile-life-2621982.html", "ord_in_thread": 0, "title": "Why should we expect a close association between autonomy, realism and happiness in a worthwhile life? | Libertarian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News) Winton's amateurish artwork Neera Badhwar writes: “The main argument of my book can be stated in the following five propositions: (i) Well-being as the HPG (highest prudential good) consists of happiness in an objectively worthwhile life; (ii) Someone who leads such a life must be characteristically autonomous and reality-orientated, that is, a disposed to think for herself and seek truth or understanding about important aspects of her own life and human life in general, and disposed to act on her understanding when circumstances permit; (iii) To the extent that someone with these traits is succeeds in achieving understanding and acting on it when circumstances permit, she is realistic. (iv) To the extent that she is realistic, she is virtuous. (v) Hence, well-being as the HPG requires virtue”. Happiness in a Worthwhile Life , 2014.\nI don’t have many problems with the first three propositions. Those propositions have been briefly discussed in my last two posts: “Is human well-being subjective or objective?” and “Is there a close relationship between autonomy and realism?” It is important to be clear that a realistic orientation is consistent with optimistic (hopeful) appraisals of future opportunities. Indeed, healthy human functioning seems to be characterized by realistic optimism. I will write something about that in my next post.\nComing back to the line of argument in Neera Badhwar's book, it was not immediately obvious to me why a person who is autonomous and realistic should be expected to be virtuous (point iv). Examples readily come to mind of situations where ‘being realistic’ appears to involve compromises in which virtue is sacrificed for pragmatic reasons. I will try to explain, briefly, how the author reaches the conclusion that virtue is positively related to realism.\nThe author accepts Aristotle’s view of virtue as an integrated intellectual-emotional disposition to think, feel, and act “at the right times, about the right things, towards the right people, for the right end, and in the right way”, and to take pleasure in so doing. Her focus is on the cardinal virtues of justice, honesty, courage, integrity, kindness, and the virtues that are partly constitutive of these virtues: practical wisdom, and regard for self and others.\nIn Chapter 4 she suggests: “To the extent that an autonomous/ reality-oriented person achieves understanding of the true and the good, and acquires the disposition to deliberate, feel, and act accordingly, he is realistic and morally virtuous” (p. 108).\nAfter reading that chapter I was left feeling sceptical about the line of argument developed. That surprised me because I have previously responded positively to other attempts to link well-being with virtues. (For example, see my previous comments on the views of Martin Seligman about cultivation of signature virtues.) As I see it the problem is that it is necessary to have or acquire a disposition to cultivate the virtues – as well as a somewhat optimistic disposition – before it is possible for the chemistry of autonomy and reality-orientation to produce happiness in a worthwhile life.\nThe problem is resolved in a later chapter. In Chapter 6 Neera Badhwar observes that nature has endowed humans with positive self- and other-regarding natural virtues and that in their early moral development people tend to acquire emotional dispositions to tell the truth, risk danger, help and empathize. She notes that the idea that well-tempered emotions are necessary for characteristically making the right choices is now widely recognized in philosophical literature and supported by psychological and neurological research.\nThe author argues that virtue and well-being both involve emotional, deliberative and evaluative dispositions. She notes that the cultivations of those dispositions is “to a significant extent up to us”. She adds: “Furthermore, the integration of emotional dispositions with intellectual (especially deliberative) dispositions that is required by virtue, makes virtue highly conducive to happiness, since a common source of unhappiness is conflict between our emotions and evaluations. Indeed, since the virtuous agent necessarily takes pleasure or joy in acting virtuously, virtuous activity is inherently productive of some happiness. It also promotes happiness insofar as the achievement of worthwhile goals is a source of happiness, and virtuous activity enables the virtuous agent to achieve them” (p 152-3).\nThe way the author summarised her argument at the beginning of the book seems to me to have been unnecessarily provocative. After reading the book as a whole, however, I doubt whether many people would have fundamental objections to the idea that an objectively worthwhile life requires virtue and that cultivation of virtue requires autonomy and reality orientation. Indeed, if we accept that widespread regard for the traditional virtues must have evolved because practice of those moral intuitions served the individual and collective interests of humans, it would be strange if individuals who endorse and cultivate those virtues in their own lives did not obtain happiness from seeking to make their lives worthwhile.\nIn my view Neera Badhwar has presented strong reasons in support of the view that the chances for an individual to achieve happiness in an objectively worthwhile life depend heavily on the extent to which her/his life is characterized by autonomy and reality-orientation.", "external_links": ["http://wintonbates.blogspot.com.au/2012/08/does-actualization-of-potential-take-us.html", "http://philosophy.gmu.edu/people/nbadhwar"], "published": "2015-10-24T21:44:00.000+03:00", "crawled": "2015-10-25T01:40:14.676+02:00", "highlightTitle": ""}