{"organizations": ["BBC"], "uuid": "9cb705f5f341498d962e2929ec874f604f829f21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pistonheads.com", "main_image": "", "site_section": "http://pistonheads.com/gassing/rss_forum.asp?f=205&mid=0", "section_title": "News, Politics & Economics", "url": "http://www.pistonheads.com/gassing/topic.asp?t=1548698", "country": "IE", "title": "ÂŁ550 fine (with costs) for ...", "performance_score": 0, "site": "pistonheads.com", "participants_count": 0, "title_full": "ÂŁ550 fine (with costs) for ...", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:18:00.000+03:00", "replies_count": 0, "uuid": "9cb705f5f341498d962e2929ec874f604f829f21"}, "author": "", "url": "http://www.pistonheads.com/gassing/topic.asp?t=1548698", "ord_in_thread": 0, "title": "ÂŁ550 fine (with costs) for ...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eric"], "text": "21:18 I usually stick up for Councils, so here goes:- Eric's pronouncement covered \"accidental\" fines. From reading the BBC article this was clearly a persistent issue, and not a one off accident- The bin is technically the Council's property, but under no stretch of the imagination are they responsible for it in the sense they have to make sure it's put away neatly, which (politely) is a silly notion- The guy's argument about having to \"live\" with his bin indoors is daft. The article sets out his gate and back door have been stuck (presumably for the many months this issue has been going on for), which I would think would be a priority for his landlord to get fixed. - I can see dragging it through the house is not particularly nice (photo in the article just in case we didn't know that a wheelie bin do fit through doorways) but it was a choice he could still have made (though second to getting his gate / door fixed)- He had the chance to pay an £80 fine, but refused (and it would have only taken a year and a half to pay off, instead of a decade). - In summary, of the millions of people who sucessfully manage to get this right, and chosing to fight this in court was not sensible. It's not a normal occurance, and would expect only one or two of these prosecutions a year. - How many threads on here are there complaining about civic rules not working for bad parking / anti social behaviour / littering / dog mess etc. that are not enforced properly? Council's push these \"little hitler\" prosecutions through to try and act as a deterrent, though I don't really think they're that hard to stick to.Ian", "external_links": [], "published": "2015-10-17T00:18:00.000+03:00", "crawled": "2015-10-16T23:50:33.169+03:00", "highlightTitle": ""}