{"organizations": ["CBS News"], "uuid": "5a5186493362458ba3432a84593a67d02e392c81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/2015/09/28/0d63dc9d-f66d-47b0-a9fa-937e13a6ecfb/trump.jpg", "site_section": "http://feeds.cbsnews.com/CBSNewsPolitics", "section_title": "Politics - CBSNews.com", "url": "http://www.cbsnews.com/media/donald-trump-no-longer-self-funding-his-campaign/", "country": "US", "title": "Donald Trump: No longer self-funding his campaign", "performance_score": 0, "site": "cbsnews.com", "participants_count": 0, "title_full": "Donald Trump: No longer self-funding his campaign", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T22:29:00.000+03:00", "replies_count": 0, "uuid": "5a5186493362458ba3432a84593a67d02e392c81"}, "author": "", "url": "http://www.cbsnews.com/media/donald-trump-no-longer-self-funding-his-campaign/", "ord_in_thread": 0, "title": "Donald Trump: No longer self-funding his campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Sopan Deb"], "text": "By Sopan Deb, CBS News \n\"I'm self-funding my campaign.\" \nGOP frontrunner and real estate mogul Donald Trump has made this a hallmark of his stump speeches and interviews in his quest for the nomination. It gets the loudest cheers at his speeches from crowds all over the country. And yet, according to the latest Federal Election Commission filings, Trump is no longer a self-funder. He is getting too many donations for that - especially for someone who is going out of his way not to ask for money. \nThis quarter, Trump's campaign reported raking in nearly $4 million from more than 70,000 donations, more than fellow GOP rivals Rand Paul, Bobby Jindal and Lindsey Graham. He raised almost as much as Chris Christie and with much less effort than any Republican running. $2.8 million of that total came from donations of less than $250. What's he spending money on? Republican presidential candidate Donald Trump speaks at a news conference near the U.S.-Mexico border outside of Laredo, Texas July 23, 2015. His campaign has spent approximately $800,000 on t-shirts and hats displaying the \"Make America Great\" slogan. REUTERS/Rick Wilking \nTrump himself spent around $100,000 of his own money this quarter (from July to September 2015) and since announcing his campaign, a total of roughly $1.9 million. \nThe campaign also spent about $4.2 million this period, with almost a quarter of it doled out for various consultants (some of whom received payments as operatives working for the various state teams). The FEC report also includes almost $26,000 in disbursements to Sam Nunberg, a longtime Trump aide who was fired by the campaign for racially insensitive Facebook posts. \nApproximately $800,000 was spent on t-shirts and hats displaying the \"Make America Great\" campaign slogan that has become a fashion trend in certain parts of the country. Biggest expense: Private jet Republican presidential candidate Donald Trump arrives on his signature plane in Laredo, Texas July 23, 2015. REUTERS/Rick Wilking - RTX1LKRQ REUTERS \nThe largest expenditure was $723,000 for TAG Air, a company that Trump owns, and which controls his private jet. \nThe rest of the money was used to pay for various expenses, including transportation and at least $140,000 rent to the Trump Corporation. Under FEC rules, the Trump campaign must pay for use of office space, even if the candidate owns the office in which the campaign headquarters is housed - which in this case is Trump Tower in New York City. Eager donors The Trump campaign told CBS earlier this year that it set up pages where supporters can make online donations after being \"overwhelmed by unsolicited contributions.\" \nTrump has raised just under $2.8 million in donations of less than $250. More than 100 gave the federal maximum of $2,700. \nThat's significant for a candidate whose main fundraising consists of a \"donate\" button on his website. The Trump campaign told CBS earlier this year that it set up pages where supporters can make online donations after being \"overwhelmed by unsolicited contributions.\" Don't call this a fundraiser Signs mark the entrance to a fundraiser for Donald Trump at the home of car dealer Ernie Boch Jr. in Norwood, Massachusetts August 28, 2015. REUTERS/Brian Snyder \nErnie Boch, Jr., the car dealer who held an event on Trump's behalf last summer, received a refund of $84,236 as reimbursement for what was originally billed as a fundraiser in Norwood, Massachusetts. Trump later claimed it was a meet and greet and the money charged to guests was just for logistics. \"A business mindset\" U.S. Republican presidential candidate Donald Trump speaks at a campaign rally in Keene, New Hampshire September 30, 2015. REUTERS/Gretchen Ertl - RTS2IKV REUTERS \n\"Mr. Trump continues to dominate all local and national polls by a wide margin and is the definitive front runner in the 2016 Republican Presidential Primary,\" Trump campaign manager Corey Lewandowski said in a statement. \n\"We are running an efficient organization with a business mindset and will continue to capitalize on the attention surrounding Mr. Trump's message to make America great again.\" Future spending plans \nOverall, the campaign says it has $254,773 cash on hand to spend. However, this is a largely irrelevant number, given Trump's ability to self-fund. \nAs the campaign season heats up, Trump said he is planning on making commercials promoting his candidacy, which means more money that the campaign will have to spend. So far, Trump has gotten plenty of exposure without commercials, thanks to significant news coverage of his campaign. \nHowever, given strong fundraising numbers for someone who has not asked for money, this may not be much of a blow to Trump's bank account.", "external_links": [], "published": "2015-10-16T22:29:00.000+03:00", "crawled": "2015-10-16T20:56:06.116+03:00", "highlightTitle": ""}