{"organizations": [], "uuid": "4ffd3723bee8b5b9ade90270cf3257e608766117", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "michiganradio.org", "main_image": "http://mediad.publicbroadcasting.net/p/michigan/files/styles/medium/public/201510/flint_presser12.JPG", "site_section": "http://www.michiganradio.org/podcasts/term/5/rss.xml", "section_title": "MR: Politics &amp Government : NPR", "url": "http://michiganradio.org/post/mdeq-director-flint-water-crisis-has-shaken-faith-government", "country": "US", "title": "MDEQ director: Flint water crisis has shaken faith in government", "performance_score": 0, "site": "michiganradio.org", "participants_count": 1, "title_full": "MDEQ director: Flint water crisis has shaken faith in government", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:17:00.000+03:00", "replies_count": 0, "uuid": "4ffd3723bee8b5b9ade90270cf3257e608766117"}, "author": "Stateside Staff", "url": "http://michiganradio.org/post/mdeq-director-flint-water-crisis-has-shaken-faith-government", "ord_in_thread": 0, "title": "MDEQ director: Flint water crisis has shaken faith in government", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MDEQ Director Dan Wyant, at the microphone, says no one, including himself, should lose their job over the Flint water crisis. Credit State of Michigan / LiveStream Listen / 17:50 DEQ Director Dan Wyant talks about how the Flint water crisis has shaken people's trust in government and other issues related to the situation. \nState and local officials have done an about-face when it comes to Flint's water crisis. \nFor months, residents and even experts who raised concerns about the water's safety were dismissed. \nThat's until mounting evidence – especially about high lead levels in kids – made the critics impossible to ignore. \nBut Michigan's top environmental regulator says no one should lose their job. \n\"I guess what is at issue is experience rather than wrongdoing,\" Michigan Department of Environmental Quality Director Dan Wyant told Stateside’s Cynthia Canty. \nWyant says he worries the Flint water crisis has caused people to lose faith in the state's ability to protect them. \n“I do. I think trust is going to be a significant issue for us,” Wyant said. “The only way we build back trust is demonstrating that the water’s safe.” \nWyant also acknowledged that experts outside government who sounded the alarm – some of whom were discredited at the time by state officials – deserve credit for bringing the water problems to light. \"I think trust is going to be a significant issue for us. The only way we build back trust is demonstrating that the water's safe.\" \n\"And so if there was any disrespect or discredit for that I have to apologize and I have to take responsibility for that and so I am addressing it,” Wyant said. “Clearly this is a real issue.\" \nBut Wyant says his agency followed federal law when it comes to ensuring safe water. \n“Those protocols were followed,” Wyant said. “What’s at issue is whether those protocols are appropriate.” \nWyant says the agency is committed to learning from what went wrong in Flint. But he says no one, including himself, should lose their job over what happened. \n“What is at issue is experience, rather than wrongdoing,” Wyant said. \nProblems with Flint's water system emerged shortly after the city switched from Detroit's system to the Flint River to save money in 2014. \nThe city is expected to return to Detroit water soon. \nClick on the link above to hear the interview. Tags:", "external_links": [], "published": "2015-10-14T00:17:00.000+03:00", "crawled": "2015-10-14T06:55:19.791+03:00", "highlightTitle": ""}