{"organizations": [], "uuid": "a162555c2328cad0173b8fb72360d2b128626428", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/10/18/politics/images/30271111-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/politics.rss", "section_title": "NationMultimedia.com - Politics", "url": "http://www.nationmultimedia.com/politics/Myanmar-advance-voting-in-Bangkok-marred-by-lapses-30271111.html", "country": "TH", "title": "Myanmar advance voting in Bangkok marred by lapses", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "Myanmar advance voting in Bangkok marred by lapses", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T21:00:00.000+03:00", "replies_count": 0, "uuid": "a162555c2328cad0173b8fb72360d2b128626428"}, "author": "", "url": "http://www.nationmultimedia.com/politics/Myanmar-advance-voting-in-Bangkok-marred-by-lapses-30271111.html", "ord_in_thread": 0, "title": "Myanmar advance voting in Bangkok marred by lapses", "locations": ["Myanmar", "Bangkok"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » politics » Myanmar advance voting in Bangkok marred by lapses Myanmar advance voting in Bangkok marred by lapses SUPALAK GANJANAKHUNDEE THE SUNDAY NATION October 18, 2015 1:00 am \nMyanmar nationals queue outside the Myanmar Embassy as they wait for their turn to vote early in Bangkok Saturday. EPA/DIEGO AZUBEL Some 3,000 citizens were registered but there were no ballots for some voters YESTERDAY'S advance voting in Bangkok for Myanmar's November 8 general election was marred by voter dissatisfaction. An eligible voter, Reagan Chit, was furious with the advance voting arrangements at his country's embassy in Bangkok yesterday as he was not able to cast his ballot despite his name being listed on the register. Several voters arrived at the embassy to find their names were not on the voter lists posted outside after believing that they had successfully registered. At midday, just a few dozen Myanmar nationals lined up to vote outside the embassy, according to an AFP journalist at the scene, although Thailand is home to an estimated 2 million Myanmar workers who prop up the vast and lucrative industrial sectors spanning seafood to construction. Myanmar's Union Election Commission has assigned embassies in 37 countries around the world to open for Myanmar nationals to cast their advance votes for the November 8 general election. The Myanmar Embassy in each of these countries was authorised to set the date for the advance vote depending on convenience. Hundreds of Myanmar expats were seen queuing outside the embassy in Singapore on Thursday to cast their ballots. The Myanmar Embassy in Bangkok opened for the advance vote yesterday from 8am to 4pm for the 3,000 citizens who had registered for voting in Thailand. Reagan Chit, a 29-year-old ethnic Karen who has worked in Thailand for |10 years, arrived along with many friends at the embassy at 6am, waiting until 8.30am when an official opened the gate for them. \"My name was listed on the board, but officials told me that the ballot cards from my constituency in North Dagon of Yangon Division did not arrive so I could not vote,\" he told The Sunday Nation. \"I was angry as it would have been the first time for me to cast the ballot in a general election. I really want to exercise my right to bring change to my country,\" he said, and revealed that he had voted in the constitution referendum in 2008 but did not have a chance to return home to vote in the 2010 election. Romar Thapa, a 27-year-old domestic helper who has lived in Bangkok for seven years, was another of those who left \"disappointed\", AFP reported. \"I wanted to vote for the NLD,\" she said, referring to Aung San Suu Kyi 's opposition National League for Democracy. She added that she was unsure why her registration had failed. Some 500 Myanmar nationals in Thailand went to cast their ballots yesterday. Reagan Chit said tens of others faced the same problem as him and were unable to cast their ballots. Many people drove four hours from outside Bangkok but did not get the chance to cast their vote, he said. Each Myanmar voter has to cast three ballot cards to elect members of the House of Representatives, Senate and Region parliament. Ethnic groups have to cast an additional ballot for representatives of their race. The advance voting in Bangkok was plagued by troubles and confusion, he said, adding many people like him did not receive their ballot cards while some got only one or two cards. Officials at the embassy could not be reached for comments but Reagan Chit said they neither offered any solutions nor took any responsibility for the error. \"I wanted to leave my official complaint in writing to reserve my voting right but they said they could not accept it and told me to go back to vote in my constituency in Dagon township,\" he said. \"I want to go but I'm not quite sure if my name is still there as an eligible voter.\" Myanmar Ambassador Win Maung told Myanmar Now, a Myanmar media, that the embassy had invited its citizens in Thailand to register for the advance vote four months ago. Reagan Chit said the registration procedure was very complicated; he had to ask his relatives in Myanmar to check his name with local authorities in his constituency, which he later confirmed with the embassy in Bangkok before September 14, having to wait for a month to have his name listed on the board in front of the embassy. The November 8 election would be a landmark in Myanmar's return to democracy, as this time the opposition National League for Democracy has also joined the race against the ruling Union Solidarity and Development Party, which has nominated President Thein Sein to run for a second term, according to a Deutsche Presse-Agentur report. 464 Viewed", "external_links": [], "published": "2015-10-17T21:00:00.000+03:00", "crawled": "2015-10-18T12:17:34.823+03:00", "highlightTitle": ""}