{"organizations": [], "uuid": "c4184309e0d2653ba1ec255ca887e1ac6fd71cee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/570_640x960_665193487_640x960.jpg", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/3-Must-Have-Men-s-Casual-Shoes-in-your-1", "country": "IE", "title": "3 Must Have Men's Casual Shoes in your Closet", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "3 Must Have Men's Casual Shoes in your Closet - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T10:30:00.000+03:00", "replies_count": 0, "uuid": "c4184309e0d2653ba1ec255ca887e1ac6fd71cee"}, "author": "Rania Abdulla", "url": "https://www.oximity.com/article/3-Must-Have-Men-s-Casual-Shoes-in-your-1", "ord_in_thread": 0, "title": "3 Must Have Men's Casual Shoes in your Closet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When it comes to shoes, women always say, you can’t have enough. It’s true in a way as our outfits are so versatile in style and colour that you need something to match with every piece. What about guys though? How do they figure out the fashion math (or science) of their footwear options?\nSeeing that their outfits tend to be more muted in tones, less divergence in style, the broadband reach of their footwear doesn’t need to spread far and wide.\nWhat’s to Consider for Must Have Men's Casual Shoes? One thing’s for sure, must have men's casual shoes need to fulfil these criteria before making it into their shopping cart:\n- Comfort\n- Function\n- Colour\nThat’s easy, when worn, must be comfy. No no to squeezing toes and rubbing back of the ankles.\nWell it needs to work with (if not all) most outfits. That explicitly means work, outdoor, indoor, ball game, buddies night, informal events, and the list goes on…\nNot only does it have to be functional, but it has to match (again if not all) with most pieces owned….which luckily for them, tend to remain on the neutral side of things...phew!!\nDid I mention price? Yeah that too….While not all must have men's casual shoes need to swear oath to all items’ in a guy’s closet, they should be able to accommodate the most part.\nTop List of Must Have Men's Casual Shoes I’ve put a list of must have men's casual shoes that are sure to become a staple in your closet and make you wonder how you lived without them!\nRhea Footwear Non Slip Boots This one speaks more about functionality than the rest I'd say. The Rhea non-slip soles include some cool techy aspects while remaining totally fashionable. The dudes behind Rhea developed and patented an advanced form of anti-slip technology applied to street shoes in popular genres like sandals, slip on flats and boots.\nThe neat thing is the outsole of these tech-inspired shoes features an exclusive rubber compound with a patented micro-channel tread pattern (or “PMC” if you like) that pushes liquid away from the bottom of the sole to provide more sole-to-surface contact and prevent slipping and sliding. How cool is that! That's ultimate functionality I'd say.\nPrices range from $55 for sandals to $150 for booties. It comes in three colours (do guys need more colours that that?).\nAdidas Supershell Sculpted Collection Adidas launched the Pharrell Williams Supershell Sculpted Collection some time ago. After the success of Supercolor, a concept that captured the attention of the world, the “Happy” star returns with Supershell.\nPharrell collaborated with NYC contemporary artist Todd James, acclaimed Iraqi-British architect Zaha Hadid, and Japanese contemporary artist Mr. The artists channel their artworks into specially-molded 3D Shelltoe designs, a first for the Superstar silhouette.\nThe series is then completed by two of Pharrell’s own personal designs, which speak of his interest in the concept of relativity.\nFrom a shoe that spans art and culture to a platform for expression itself, the Supershell Sculpted Collection brings the Superstar to its ultimate artistic mode. With designs offered in monochrome black and white colourways (again perfect for a guy’s wardrobe), the must men's have shoes are interchangeable, presenting countless opportunities to mix and match individual shoes to create the perfect personal expression.\nYeezy Boost 350 by Kanye West While I may not be a fan of the guy’s attitude, I can’t say that I don't appreciate his latest shoe release. When the first generation of the Yeezy launched in an epic New York Fashion Week presentation (what else were you expecting from Kanye??), the YEEZY by Kanye West and Adidas Originals ignited a global sensation with an unprecedented public live-stream and the subsequent release of the Yeezy Boost . So what happened? It immediately sold out in a worldwide frenzy of anticipation.\nNow, West and his buddies at Adidas release the second sneaker collaboration: the Yeezy Boost 350. The trainer features an upper composed entirely of Adidas’ Primeknit: a breakthrough material developed using the latest digital engineering methods to fit like a second skin. Now that’s comfy! Leveraging Adidas BOOST™’s highly responsive properties, the shoe boasts the ultimate in comfort and performance, ensuring that the wearer’s every step is hyper-charged with an endless supply of light, fast energy.\nThe Yeezy Boost 350 is has a clean, modern, effortless look. While it may not rank on the low end of the price scale, for $285 you surely get a fearless step into the future of style from Adidas’ unparalleled engineering joined with Kanye’s timeless aesthetic design.\nLet me know your thoughts and what's important to you in must have men's casual shoes.", "external_links": ["https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/565_1172x816_894709164_900x627.jpg", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/580_640x960_639347307_640x960.jpg", "http://www.rheafootwear.com/", "http://www.adidas.com/us/yeezy", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/540_414x181_690624736_414x181.png", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/546_432x218_885237467_432x218.png", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/602_1024x683_900738605_900x600.png", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/595_640x960_901052231_640x960.jpg", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/570_640x960_665193487_640x960.jpg", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/574_640x960_833687931_640x960.jpg", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/177/542_519x212_349701130_519x212.png", "http://www.adidas.ca/en/supershell?grid=true"], "published": "2015-10-24T10:30:00.000+03:00", "crawled": "2015-10-24T15:18:35.848+03:00", "highlightTitle": ""}