{"organizations": [], "uuid": "4e2ffcec3c2f158ffd20502286d74a9b9fe105a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://images.onset.freedom.com/ocregister/gallery/nw5b9o-b88538930z.120151012232554000ggbchp1p.10.jpg", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18805", "section_title": "The Orange County Register - News Headlines : Politics and government", "url": "http://www.ocregister.com/articles/bill-687307-impact-mission.html", "country": "US", "title": "Right-to-die, climate change, pot and more: Here are 10 bills that will change life – and death – in California", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Right-to-die, climate change, pot and more: Here are 10 bills that will change life – and death – in California - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "4e2ffcec3c2f158ffd20502286d74a9b9fe105a3"}, "author": "", "url": "http://www.ocregister.com/articles/bill-687307-impact-mission.html", "ord_in_thread": 0, "title": "Right-to-die, climate change, pot and more: Here are 10 bills that will change life – and death – in California", "locations": ["California"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jerry Brown"], "text": "Gov. Jerry Brown signed a flurry of bills during the past week addressing matters as cosmic as assisted suicide and as trivial as electric skateboards.\nOn Saturday and Sunday alone, just before the deadline, Brown greenlighted 85 separate pieces of legislation.\nIn case you missed it, here are some of the more notable bills that now bear his signature and soon will reshape life in California in large and small ways:\nMOTOR VOTER \nThe bill: Assembly Bill 1461\nThe sponsors: Assembly members Lorena Gonzalez, D-San Diego; Luis Alejo, D-Watsonville; Kevin McCarty, D-Sacramento\nThe mission: Boost voter registration and turnout by automatically registering people to vote when they obtain or renew driver’s licenses.\nThe impact on you: It will make it easier to register to vote. If you drive a car, you’ll be registered. Don’t want to vote? You will still be able to opt out. But that’s one more trip to the DMV.\nRIGHT TO DIE \nThe bill: ABX2-15\nThe sponsor: Assemblywoman Susan Talamantes Eggman, D-Stockton\nThe mission: Extend to Californians the right to end their lives early. California joins Oregon, Washington, Montana and Vermont.\nThe impact on you: If you or a loved one are facing just six months to live, it will allow you to seek a prescription of life-ending drugs from your doctor.\nCLIMATE CHANGE \nThe bill: Senate Bill 350\nThe sponsor: Senate President pro Tempore Kevin de León, D-Los Angeles\nThe mission: Ramp up California’s efforts to slow climate change.\nThe impact on you: It mandates that half of California’s electricity come from green sources such as solar and wind power by 2030.\nYou’ll see more electric vehicles on the roads, and existing buildings, including homes, will need to become twice as energy efficient.\nDAY CARE WORKERS \nThe bill: SB792\nThe sponsor: Sen. Tony Mendoza, D-Artesia\nThe mission: Require day care workers and volunteers to be vaccinated against influenza, pertussis and measles.\nThe impact on you: It could reduce the chance your children will get sick – because it could reduce their caretakers’ chances of getting sick.\nPOLITICAL ADS \nThe bill: AB990\nThe sponsor: Assemblywoman Susan A. Bonilla, D-Concord\nThe mission: Increase transparency in political advertisements by requiring disclosure statements to be placed in bold boxes with large type.\nThe impact on you: It’ll likely make it easier for you to know who is backing a candidate or issue on the ballot. It will make the information easier to read, anyway.\nSPORTS NICKNAMES \nThe bill: AB30\nThe sponsor: Assemblyman Luis Alejo, D-Watsonville\nThe mission: Bar the use of the term “Redskins” as a mascot for California public schools and their sports teams.\nThe impact on you: For now, just four high schools in central and Northern California will have to change their mascots. But it could kickstart momentum to change the names of other schools closer to home that are regarded by some groups as offensive.\nVAPING SALES \nThe bill: AB216\nThe sponsor: Assemblywoman Cristina Garcia, D-Bell Gardens\nThe mission: Protect children from e-cigarettes, which some recent studies indicate can be a gateway to real cigarettes.\nThe impact on you: Persons under age 18 won’t be able to buy vaping products that do not have nicotine.\nMEDICAL MARIJUANA \nThe bills: AB243, AB266, SB643\nThe sponsors: Assemblyman Jim Wood, D-Healdsburg; Assemblyman Rob Bonta, D-Alameda; Sen. Mike McGuire, D-Healdsburg\nThe mission: Provide a framework for regulating the production, distribution and sale of medical marijuana.\nThe impact on you: This patchwork of pot laws aims to stitch together a cohesive statewide system for providing marijuana to Californians for medicinal purposes and will replace scores of local ordinances.\nCHEWING TOBACCO \nThe bill: AB768\nThe sponsor: Assemblyman Tony Thurmond, D-Richmond\nThe mission: Bar professional baseball players from chewing tobacco while playing games in California stadiums.\nThe impact on you: The law aims to prevent chaw-chomping baseball players from having a negative “role-model effect” on California youths. So your kids might not grow up longing to plop a viscous wad in their cheeks, just because some all-star slugger does.\nELECTRIC SKATEBOARDS \nThe bill: SB604\nThe sponsor: Assemblywoman Kristin M. Olsen, R-Modesto\nThe mission: Legalize electric skateboards and regulate their use.\nThe impact on you: Allows electric skateboards on streets or trails, but requires operators to wear helmets and to be at least 16 years old – and it bars them from riding while under the influence of alcohol or drugs.\nCould hoverboards be next, Marty?\nContact the writer: 951-368-9699 or ddowney@pe.com", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T13:00:44.933+03:00", "highlightTitle": ""}