{"organizations": [], "uuid": "17f7b9d52bad78ca3720a6ed9c48b5d3022d9702", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/1/64/Egypt/Politics-.aspx", "section_title": "Politics - Egypt - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/1/64/153768/Egypt/Politics-/Egyptian-TV-host-presents-video-game-clip-as-Russi.aspx", "country": "EG", "title": "Egyptian TV host presents video game clip as Russian anti-ISIS operation", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 3, "title_full": "Egyptian TV host presents video game clip as Russian anti-ISIS operation - Politics - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 2, "uuid": "41db513e3522988f6aff30e27a6f8d994d1bcf0f"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/64/153768/Egypt/Politics-/Egyptian-TV-host-presents-video-game-clip-as-Russi.aspx#post-0", "ord_in_thread": 0, "title": "Egyptian TV host presents video game clip as Russian anti-ISIS operation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Cairo court fines TV host Ahmed Moussa for slander, again Egypt court acquits TV host Ahmed Moussa of insulting journalist El-Ghazali Harb Egyptian TV host Ahmed Moussa receives fresh jail sentence over slander Hamdeen Sabahi to file complaint against TV host Ahmed Moussa Controversial Egyptian TV host Ahmed Moussa presented a video clip from a popular video game on his daily show as a genuine Russian operation against ISIS in Syria, causing a wave of online ridicule.\nMoussa aired the five-minute clip on Sunday night on the Sada El-Balad TV channel. He told viewers it was footage of a Russian strike, and heaped praise on Russia while slamming the US.\n\"Russia doesn't fool around like the United States. The Americans do not attack ISIS, just like everybody else except Russia,\" Moussa said in his introduction.\n\"This is Russia, this is Putin,\" said the controversial TV host before promising viewers they would see something \"fearful\".\nHe then screened the supposed Russian attack on ISIS targets in Syria, praising their accuracy and saying they were able to hit a human toe.\nAhmed Moussa presents the video footage \"We have not seen something like that from the Americans,\" he said, before asserting that the US actually supported, funded and armed ISIS.\nThe footage was from popular multi-patform game Apache: Air Assault, released in 2010 by Russian developer Gajin Entertainmen.\nThe Russian defense ministry has in fact published footage on its official YouTube channel of what it says are strikes on targets in Latakia province in north Syria.\nEgyptian social media users have unsurprisingly mocked Moussa, known for his anti-revolutionary sentiments and support for former president Hosni Mubarak.\nThe hashtag \"#Ahmed_Moussa\", in Arabic, has been trending on Egyptian Twitter, with users posting clips from other games and presenting them mockingly as Russian strikes in Syria.\nRussia launched air strikes in Syria earlier this month in its biggest Middle East intervention in decades, marking a dramatic escalation in a more than four-year-old civil war.\nEgypt's foreign minister Sameh Shoukry has stated that Russia's intervention in Syria will combat terrorism.", "external_links": ["http://www.youtube.com/watch?v=iSCKP8luiFw?rel=1"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T23:40:39.464+03:00", "highlightTitle": ""}