{"organizations": [], "uuid": "b1858c5cf2f38eb348ca4f1dfd89fc4737a43794", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-69b98668b35ebe78741811934b80e62a.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/obama-fights-for-foreign-policy-legacy/article/2574175?custom_click=rss", "country": "US", "title": "Obama fights for foreign policy legacy", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Obama fights for foreign policy legacy | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:01:00.000+03:00", "replies_count": 0, "uuid": "b1858c5cf2f38eb348ca4f1dfd89fc4737a43794"}, "author": "Nicole Duran", "url": "http://www.washingtonexaminer.com/obama-fights-for-foreign-policy-legacy/article/2574175?custom_click=rss", "ord_in_thread": 0, "title": "Obama fights for foreign policy legacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama is dismissing criticism of his Syria policy as \"mumbo jumbo\" and \"half-baked,\" but many experts think his decisions there are deeply flawed, and will likely have disastrous implications for the entire Middle East that end up defining his foreign policy legacy.\nHe will get beat up for being indecisive and delaying, and for not doing enough early on, said Center for Strategic and International Studies' Anthony Cordesman . Obama \"relies too much on words and good intentions in a world where that is not enough,\" he said.\nFrom erasing his \"red line\" that he said would trigger intervention if Syrian President Bashar Assad used chemical weapons on civilians, to essentially giving up on creating a ground force to combat the Islamic State by training and equipping moderate rebels, Obama's approach toward Syria's civil war follows a \"long history of half-measures and delay\" spanning Libya to Ukraine, Cordesman said.\n\"All too often he's proven not able to work decisively enough to make his policies work,\" including his inability to turn the \"pivot to Asia\" into more than a mantra, Cordesman said.\n  Pittenger: 'We're a lion with no teeth' \"Tracking this money is just an enormous challenge and this will just compound everything.\"\nBy Charles Hoskinson • 10/19/15 1:00 AM Cordesman's criticism is shared by key members of Congress. House Foreign Affairs Committee Chairman Ed Royce, R-Calif., recently told the Syrian-American Medical Society that the Obama administration committed \"foreign policy malfeasance\" with the train-and-equip program, which ultimately produced only about 100 soldiers before the Pentagon pulled the plug on it Oct. 9.\n\"It is time for the administration to stop looking away from Syria as 'someone else's civil war' and instead move decisively, with our regional partners, to give the Syrian people some semblance of safety,\" Royce said.\nBut that was exactly the type of assessment and directive Obama discounted during an Oct. 2 press conference.\n\"[W]hen I hear people offering up half-baked ideas as if they are solutions, or trying to downplay the challenges involved in this situation ... what I'd like to see people ask is, 'specifically, precisely, what exactly would you do, and how would you fund it, and how would you sustain it?'\" Obama said. \"And typically, what you get [in response] is a bunch of mumbo jumbo.\"\nMany experts agree there are no easy solutions to Syria's or the region's problems, but say Obama takes too limited an approach that oversimplifies even his narrow objective and exacerbates existing problems, or sometimes even creates new ones.\nAlso from the Washington Examiner Pass the Helping Families in Mental Health Crisis Act now Bill to reduce suffering of people with untreated serious mental illness has not been brought up for a vote.\nBy Representative Tim Murphy • 10/19/15 12:01 AM \"First and foremost the Obama administration needs to abandon its self-defeating focus on Daesh [the Islamic State] as the only target of its strategy and adopt a comprehensive approach that deals with the Syrian civil war as a whole,\" the Brookings Institution's Kenneth Pollack and the Center for a New American Security's Ilan Goldenberg recently wrote in the Daily Beast .\n\"The administration's single-minded approach fails to recognize that Daesh is nothing but a symptom of the wider malady of the Syrian civil war,\" they said. \"Even if the U.S. could somehow vaporize Daesh, if the civil war continues to rage, new extremist organizations will simply emerge to replace it. This is exactly what happened with al Qaeda in Iraq. Daesh's predecessor was virtually extirpated in Iraq by 2011 until the civil war in neighboring Syria provided it with a new refuge and lifeline. Resolve the civil war, however, and the source of Daesh's strength and appeal disappears.\"\nRussian President Vladimir Putin entered the Syrian fray on Assad's behalf largely because Obama did not counter his military aggression in Ukraine, many experts and Republicans charge.\nCommenting about a month before Russia dropped its first bombs over Syria, Senate Homeland Security and Governmental Affairs Committee Chairman Ron Johnson, R-Wis., wrote in the Ripon Society's Ripon Forum that not checking Putin in Ukraine only emboldened him.\n\"As Putin advances, the Obama administration continues to talk about offering Putin 'off ramps,'\" Johnson charged. But \"Putin isn't looking for off ramps. He's only biding his time and looking for the next 'on ramp.'\"\nAlso from the Washington Examiner The Sanders-Clinton college cost-shifting plan Democrats like to frame their proposals as one for \"free college tuition,\" but there is no such thing.\nBy Washington Examiner • 10/19/15 12:01 AM The American Enterprise Institute's Danielle Pletka concurred, writing Oct. 1 that Ukraine is the source of Russia's entry into Syria after more than four years of civil war there.\n\"The Obama administration (and much of the European Union) accepted Putin's annexation of Crimea and has tolerated near-constant violations of the Minsk Accords intended to limit Russia's appetite,\" Pletka wrote in the New York Daily News . \"Finding little resistance to his predations in Ukraine, the Russian leader began to look further afield [and] decided to take control of the Syrian theater.\"\nEven Obama's victory in securing a deal limiting Iran's nuclear weapons program could backfire on his legacy, experts warn.\nAmerica's Arab allies \"fear that the United States will use the nuclear deal to further disengage from the region,\" Pollack and Goldenberg wrote. \"Understandably, they fret over a post-nuclear-deal future in which the United States is making even less of an effort to play its traditional role as regional stabilizer, and its very absence further incites Iran to greater aggressiveness.\"\n\"Across the board in private, Gulf officials damn the administration for its disdain for the Middle East and particularly its weak response to Iran,\" the pair stated.\nCordesman agreed that if engagement with Iran ends with the nuclear deal, it will hurt the Obama presidency's foreign policy grade.\nRight now, Iran, Iraq, Russia and Assad are cooperating to fight the Islamic State and anti-Assad forces in Syria. This represents a shift away from Iraq working with the U.S. in Syria to combat the Islamic State.\nIf Iraq spun away from the U.S. and the end result of the Iran nuclear agreement was just that, with nothing more, it will seriously hurt Obama's legacy, Cordesman said. \"It is one thing to leave Iraq; it is another to lose it.\"\nThis article appears in the Oct. 19 edition of the Washington Examiner magazine. \nTop Story Is the GOP really still a party? The Tea Party has sufficient support to make the GOP nearly ungovernable on Capitol Hill.\nBy W. James Antle III • 10/19/15 12:01 AM", "external_links": [], "published": "2015-10-19T03:01:00.000+03:00", "crawled": "2015-10-19T13:34:18.845+03:00", "highlightTitle": ""}