{"organizations": [], "uuid": "9d8b9151caa9df1b367120353c73aa742f1a375b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-9e1089e1a6544bec406906abb8f315e2.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/huckabee-let-me-defend-jeb-on-guns/article/2573401?custom_click=rss", "country": "US", "title": "Huckabee: 'Let me defend Jeb' on guns", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Huckabee: 'Let me defend Jeb' on guns | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:47:00.000+03:00", "replies_count": 0, "uuid": "9d8b9151caa9df1b367120353c73aa742f1a375b"}, "author": "Gabby Morrongiello", "url": "http://www.washingtonexaminer.com/huckabee-let-me-defend-jeb-on-guns/article/2573401?custom_click=rss", "ord_in_thread": 0, "title": "Huckabee: 'Let me defend Jeb' on guns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Arkansas Gov. Mike Huckabee came to Jeb Bush's defense Monday when asked about the fellow GOP presidential hopeful's \"stuff happens\" comment after Thursday's Oregon shootings.\n\"We're in a difficult time in our country, and I don't think more government is necessarily the answer to this,\" Bush said Friday. \"I think we need to reconnect ourselves with everybody else. It's just – it's very sad to see. But I resist – I had this challenge as governor. We had – look, stuff happens – there's always a crisis. The impulse is to do something and it's not always the right thing to do.\"\nThe comment spurred outrage almost immediately among Democrats and was the subject of Democratic National Committee fundraising emails.\n\"Jeb Bush said, basically, 'bad stuff happens.' Is that your feeling about things too?\" Huckabee, who ranks eleventh in the Washington Examiner's presidential power rankings , was asked Monday by CNN's Alisyn Camerota.\n  Clinton hits Sanders: 'I am not in favor of making college free for Donald Trump's kids' Hillary Clinton hit Bernie Sanders for the first time Monday on NBC's \"Today.\"\nBy Ariel Cohen • 10/05/15 10:46 AM \"I think that was taken context – let me defend Jeb,\" Huckabee responded. \"I'm an opponent of his in the primary, but he was asked a question … and I think what he was trying to say is, look, car wrecks happen every day [and] there are airplane crashes. There are things that happen, some of which we can prevent, some we can't.\"\n\"We can stop most of the car wrecks if we restricted speeds down to 25 mph; there would be very few car accidents if no car were allowed to go over 25 mph,\" he continued. \"But, as a society, we would never accept that. Sometimes we have to decide what risk we are willing to take. There would never be airline crashes if we didn't have airplanes.\"\n\"Sure. But governor are you saying … that there's nothing we can do about school shootings and mass shootings?\" Camerota asked, adding, \"this is a risk that we're going to have to take because we respect the Second Amendment and people have a right to have guns, so I guess school shootings come along with that.\"\n\"No, I don't say that at all … the fact is every time we here one of these shootings that the president mentioned [it] happened in a gun-free zone,\" the former governor retorted.\nShorty after the July shooting that left four marines dead in Chattanooga, Tenn., Huckabee described gun-free zones in an op-ed for Fox News as \"sitting duck zones for radical Islamists.\"\nAlso from the Washington Examiner U.S., Pacific Rim countries announce TPP trade deal Trade negotiators reached the historic deal in Atlanta between the U.S., Japan and 10 Pacific Rim nations.\nBy Kelly Cohen • 10/05/15 9:32 AM \"Tragically, gun free zones are once again the most dangerous places in America,\" he wrote at the time .\nTop Story Can Clinton delete her past? Clinton's campaign is in a   ones.\nBy Sarah Westwood • 10/05/15 12:01 AM", "external_links": [], "published": "2015-10-05T13:47:00.000+03:00", "crawled": "2015-10-05T18:40:41.729+03:00", "highlightTitle": ""}