{"organizations": ["Associated Press", "White House"], "uuid": "b62a300fe4a46c2fe6bea29767f3882ff27efc0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.naplesnews.com", "main_image": "http%3A%2F%2Fmediaassets.naplesnews.com%2Fphoto%2F2015%2F10%2F16%2FObama%20US%20South%20Korea_Reis%20_OP_1_CP__1445028680119_25328837_ver1.0_640_480.jpg", "site_section": "http://www.naplesnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100108&categoryId=60013", "section_title": "Politics | NPDN", "url": "http://www.naplesnews.com/news/politics/obama-if-nkorea-serious-on-denuclearization-well-talk", "country": "US", "title": "Obama: If NKorea serious about nukes, we'll talk", "performance_score": 0, "site": "naplesnews.com", "participants_count": 0, "title_full": "Obama: If NKorea serious about nukes, we'll talk", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:05:00.000+03:00", "replies_count": 0, "uuid": "b62a300fe4a46c2fe6bea29767f3882ff27efc0b"}, "author": "", "url": "http://www.naplesnews.com/news/politics/obama-if-nkorea-serious-on-denuclearization-well-talk", "ord_in_thread": 0, "title": "Obama: If NKorea serious about nukes, we'll talk", "locations": ["Washington", "East Room of"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Susan Walsh", "Pablo Martinez Monsivais", "Barack Obama", "Walsh", "Martinez Monsivais", "Obama", "Matthew Pennington"], "text": "Obama: If NKorea serious on denuclearization, we'll talk Matthew Pennington, Associated Press 4:54 PM, Oct 16, 2015 5:05 PM, Oct 16, 2015 Previous Next President Barack Obama and South Korean President Park Geun-hye listens to a reporter's question during a news conference in the East Room of the White House in Washington, Friday, Oct. 16, 2015. (AP Photo/Susan Walsh) Susan Walsh Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. President Barack Obama and South Korean President Park Geun-hye shake hands at the conclusion of their joint news conference in the East Room of the White House in Washington, Friday, Oct. 16, 2015. (AP Photo/Pablo Martinez Monsivais) Pablo Martinez Monsivais Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Show Caption Previous Next \nWASHINGTON - U.S. is ready to negotiate with longtime adversary North Korea as it has with Iran, but Pyongyang has to be serious about abandoning nuclear weapons, President Barack Obama said Friday. \nObama was speaking after meeting with South Korean President Park Geun-hye, a close ally, who echoed the U.S. leader's view. \nThe North has conducted three nuclear tests since 2006 and is developing a mobile ballistic missile that could potentially hit the U.S. \nObama said Iran had been prepared to have a \"serious conversation\" about the possibility of giving up the pursuit of nuclear weapons. He said there's no indication of that in North Korea's case. \n\"At the point where Pyongyang says, 'We're interested in seeing relief from sanctions and improved relations, and we are prepared to have a serious conversation about denuclearization,' it's fair to say we'll be right there at the table,\" Obama told a joint news conference. \nPark's visit follows heightened tensions this summer at the heavily militarized border between the two Koreas, and speculation that North Korea could be planning another rocket launch into space or a nuclear test explosion. \nIn a joint statement issued after Friday's meeting, the U.S. and South Korea said that if North Korea takes such a step, \"it will face consequences, including seeking further significant measures by the UN Security Council.\" The statement also said they would never accept North Korea as a nuclear weapons state. \nPark has cultivated closer relations with China as she looks to coax Beijing away from its traditional embrace of Pyongyang. Last month, she prompted handwringing in Washington when she attended a Chinese military parade marking the end of World War II that was snubbed by leaders of most major democracies. \nBut Obama said he had no problem with Park meeting Chinese President Xi Jinping, and joked that Xi \"was in this room, eating my food,\" during a state visit to the U.S. last month. \n\"We want South Korea to have a strong relationship with China, just as we want to have a strong relationship with China. We want to see China's peaceful rise. We want them to be cooperating with us in putting pressure on the DPRK,\" Obama said, referring to the North's official title, the Democratic People's Republic of Korea. \nObama and Park discussed the often-touchy relations among China, Japan and South Korea, whose leaders are to hold a long-awaited summit in Seoul in early November. Park said that the summit will be an opportunity to improve South Korea's relations with another key U.S. ally, Japan, which would be welcomed by Washington. \nU.S. retains 28,500 troops in South Korea, a legacy of the 1950-53 Korean War, and nearly 50,000 troops in Japan. Obama called the U.S.-South Korean alliance \"unbreakable.\" Park called it a \"lynchpin\" of regional security. \nIn August, the two Koreas threatened each other with war after two South Korean soldiers were wounded by land mines Seoul says were planted by the North. The tensions have since eased, and the two sides have agreed to resume next week reunions of Korean families divided by the Korean War. \nThe Obama administration has faced criticism from hawks and doves alike for a lack of high-level attention on North Korea, which estimated to have enough fissile material for between 10 and 16 nuclear weapons. Copyright 2015  ", "external_links": [], "published": "2015-10-17T00:05:00.000+03:00", "crawled": "2015-10-17T06:33:52.264+03:00", "highlightTitle": ""}