{"organizations": [], "uuid": "134b629aeea8b4185992032aac9db701e6dc22a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/21/us/21crist-web/21crist-web-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Washington.xml", "section_title": "NYT > Politics", "url": "http://www.nytimes.com/2015/10/21/us/charlie-crist-ex-governor-of-florida-announces-run-for-congress.html?partner=rss&emc=rss", "country": "US", "title": "Charlie Crist, Ex-Governor of Florida, Announces Run for Congress", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Charlie Crist, Ex-Governor of Florida, Announces Run for Congress", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:03:00.000+03:00", "replies_count": 0, "uuid": "134b629aeea8b4185992032aac9db701e6dc22a4"}, "author": "RICHARD PÉREZ-PEÑA", "url": "http://www.nytimes.com/2015/10/21/us/charlie-crist-ex-governor-of-florida-announces-run-for-congress.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "Charlie Crist, Ex-Governor of Florida, Announces Run for Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Continue reading the main story After losing two statewide races in Florida and changing his party affiliation twice, former Gov. Charlie Crist announced Tuesday that he was running for Congress in a recently redrawn district, but he may face a stiff challenge from a former mayor of St. Petersburg. Mr. Crist, now a Democrat, is running in a district that is expected to lean Democratic and include all of St. Petersburg, though its final shape has not been determined. But former Mayor Rick Baker, a Republican who has a record of winning support from Democratic voters, told The Tampa Bay Times that he was considering getting into the race, too. Mr. Crist was a Republican when he was the state’s attorney general and then governor from 2007 to 2011. But when he began a 2010 run for the United States Senate, he was derided by fellow Republicans as too close to President Obama, and it appeared that he would lose the primary to Marco Rubio. Mr. Crist left the party and ran instead as an independent, losing badly in the general election. In 2014, running as a Democrat to reclaim the governor’s office, Mr. Crist lost by just 1 percent of the vote to Rick Scott, a Republican. With the election more than a year away, Mr. Crist is taking advantage of the turmoil that has affected Florida politics since July, when the state Supreme Court struck down a congressional redistricting map drawn in 2012 by the Republican-controlled Legislature. The court ruled that those boundaries violated the state Constitution’s prohibition on designing districts specifically to benefit parties or incumbents. The Legislature’s map put most of St. Petersburg into a swing district, the 13th, that narrowly elected a Republican, David Jolly, in a special election last year. But this month, a state judge tentatively approved a redrawn map, with a 13th favoring Democrats; the state Supreme Court will rule on whether to accept that plan. After the new map was released, Mr. Jolly announced that he would run for the Senate rather than seek re-election. Mr. Crist, 59, is far better known than the Democrat who has been in the 13th District race for months, Eric Lynn, a former Defense Department official. Flanked by Democratic elected officials in a St. Petersburg park on Tuesday, Mr. Crist said, “Public service is in my heart — I can’t help it.” The former governor cuts an unusual figure — a skilled politician whose unorthodox moves have left him in the political wilderness. He is popular, yet often described as an opportunist . Wadi Gaitan, a spokesman for the state Republican Party, said Mr. Crist was motivated by personal ambition and had “a reputation of flip-flopping when convenient.” Mr. Baker, 59, who was mayor of St. Petersburg from 2001 to 2010, said he would decide early next year whether to enter the race. Loading...", "external_links": [], "published": "2015-10-20T21:03:00.000+03:00", "crawled": "2015-10-20T21:14:08.406+03:00", "highlightTitle": ""}