{"organizations": [], "uuid": "cad75cdc1b85e1fa8fc26356e441f74d207f6734", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/51/aba3f7015f8e962f730634fe5d4e70/media:b8b589b6822043ea87f7b327501059d2MideastIsraelPalestinians.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/13/palestinian-stabs-jewish-man-in-central-israeli-city", "country": "US", "title": "Palestinian stabs Jewish man in central Israeli city - US News", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Palestinian stabs Jewish man in central Israeli city - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "cad75cdc1b85e1fa8fc26356e441f74d207f6734"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/13/palestinian-stabs-jewish-man-in-central-israeli-city", "ord_in_thread": 0, "title": "Palestinian stabs Jewish man in central Israeli city - US News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Palestinian stabs Jewish man in central Israeli city in latest violent attack Palestinians run from tear gas during clashes with Israeli troops near Ramallah, West Bank, Monday, Oct. 12, 2015. Recent days have seen a series of stabbing attacks in Israel and the West Bank that have wounded several Israelis. Past weeks have also seen violent demonstrations in the West Bank and Gaza, and at least 16 Palestinians have been killed by Israeli forces. (AP Photo/Majdi Mohammed)\nAssociated Press Oct. 13, 2015 | 3:10 a.m. EDT + More JERUSALEM (AP) — A Palestinian from east Jerusalem stabbed an Israeli man on a busy main street of a central Israeli city Tuesday, police said, in the latest violent outburst of a month-long wave of attacks.\nPolice spokesman Micky Rosenfeld said the attacker stabbed another man who was waiting at a bus stop on the main thoroughfare of Raanana, a quiet city north of Tel Aviv. The Israeli was moderately wounded and the attacker was apprehended and beaten by local residents before he too was taken to a hospital.\nSince the Jewish New Year last month, five Israelis have been killed and dozens wounded in a shooting, a stoning and a series of stabbings. At least 26 Palestinians been killed by Israeli fire, including 10 identified by Israel as attackers and the rest in clashes between stone-throwers and Israeli troops. Hundreds of Palestinians have been wounded in such confrontations.\nOn Monday, Palestinians carried out three stabbings in Jerusalem, leaving a teenage Israeli boy in critical condition.\nThe unrest began last month with clashes at Jerusalem's most sensitive holy site and quickly spread across Israel and into the West Bank and Gaza Strip.\nThe stabbings have rattled Israel. The attackers, many of them teenagers, have had no affiliation with militant groups, and the seemingly random nature of the stabbings has made it difficult to predict or prevent them.\nPrime Minister Benjamin Netanyahu has come under heavy criticism for failing to stop the violence, and an opinion poll this week showed that more than 70 percent of the public is dissatisfied with his handling of the crisis.\nSome of the attacks have been carried out by members of Israel's Arab minority. In a fiery speech to parliament, Netanyahu accused the country's Arab leaders of helping incite weeks of violence, accusing Arab parties of \"undermining\" the country and calling on Israel's Arab citizens to \"kick out the extremists among you.\"\nThe violence erupted over the Jewish New Year last month, fueled by rumors that Israel was plotting to take over a site holy to both Muslims and Jews. The rumors ignited clashes between Israeli police and Palestinian activists who hurled stones and firebombs at them from inside the mosque, and the violence has spread.\nIsrael has dismissed the rumors and repeatedly said there are no plans to alter a longstanding status quo at the spot, revered by Jews as the site of the biblical Temples and today home to Islam's Al-Aqsa Mosque compound.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe5a87%3Fsrc=usn_fb", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe5a87%3Fsrc=usn_li&title=Palestinian%20stabs%20Jewish%20man%20in%20central%20Israeli%20city&summary=&source=U.%20S.%20News", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe5a87%3Fsrc=usn_gp", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe5a87%3Fsrc=usn_tw&via=usnews&text=Palestinian%20stabs%20Jewish%20man%20in%20central%20Israeli%20city", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe5a87%3Fsrc=usn_rd&title=Palestinian%20stabs%20Jewish%20man%20in%20central%20Israeli%20city", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe5a87%3Fsrc=usn_su"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T10:21:42.518+03:00", "highlightTitle": ""}