{"organizations": [], "uuid": "b666472c74b23efe1c0a4aad22de2842401f84a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nymag.com", "main_image": "http://pixel.nymag.com/imgs/fashion/daily/2015/10/04/4-weaver.w1200.h630.jpg", "site_section": "http://nymag.com/thecut/love/", "section_title": "Love and War: What Matters to Women, From Body Issues to Politics - TheCut", "url": "http://nymag.com/thecut/2015/10/sigourney-weaver-talked-to-reagan-about-abortion.html", "country": "US", "title": "Sigourney Weaver Talked to Reagan About Abortion", "performance_score": 0, "site": "nymag.com", "participants_count": 1, "title_full": "Sigourney Weaver Talked to Reagan About Abortion -- The Cut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T11:23:00.000+03:00", "replies_count": 0, "uuid": "b666472c74b23efe1c0a4aad22de2842401f84a7"}, "author": "Audrey J. Bruno", "url": "http://nymag.com/thecut/2015/10/sigourney-weaver-talked-to-reagan-about-abortion.html", "ord_in_thread": 0, "title": "Sigourney Weaver Talked to Reagan About Abortion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Bryan Bedder/Getty Images for The New Yorker/2015 Getty Images\nThough typically known for portraying some seriously badass women onscreen, it turns out Sigourney Weaver is a total boss in real life too. On Friday night, Weaver sat down with film critic Anthony Lane at the New Yorker Festival, and recounted one particularly bold interaction she had with President Ronald Reagan at a White House Christmas party.\nOriginally, the left-leaning actress didn't plan to attend – she said she found it “unthinkable” – but her father convinced her otherwise. At the event, she quickly discovered that she’d only been invited because, “A little Saudi prince wanted to sit next to the woman from Ghostbusters ,” and, “every time I opened my mouth they were like ‘Is that actress talking again? Is she allowed to talk like that?’”\nAs if that weren’t enough, when Weaver attempted to talk to Reagan about something a little more serious, she was swiftly pulled away. “I went up to President Reagan and I said, I’m very concerned about your position on abortion rights. And he froze – or maybe he just stayed frozen – and I felt these two arms, and my feet just lifted up and the line carried through.”\nDespite her experience, Weaver went on to explain that she thinks, “in today’s politics you look at Reagan and realize he’s almost liberal.” Now that’s a scary thought.", "external_links": [], "published": "2015-10-05T11:23:00.000+03:00", "crawled": "2015-10-05T06:27:32.452+03:00", "highlightTitle": ""}