{"organizations": ["White House"], "uuid": "328d086d58675052db9ef51154747d7b28e51daa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/16/f9/2f/fa990f7b9cfc4657aadd5ffc28c1208a-572e8f8348ed4c3fb0b1731f1171c24c-0.jpg", "site_section": "http://www.whio.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.whio.com/ap/ap/top-news/obama-sees-unity-among-democratic-presidential-can/nn4hq/", "country": "US", "title": "Biden? Clinton? Obama ducks questions on 2016 race", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "Biden? Clinton? Obama ducks questions on 2016 race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:00:00.000+03:00", "replies_count": 0, "uuid": "328d086d58675052db9ef51154747d7b28e51daa"}, "author": "", "url": "http://www.whio.com/ap/ap/top-news/obama-sees-unity-among-democratic-presidential-can/nn4hq/", "ord_in_thread": 0, "title": "Biden? Clinton? Obama ducks questions on 2016 race", "locations": ["East Room", "Washington", "WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Barack Obama", "Martinez Monsivais", "Biden", "Obama"], "text": "Updated: 4:00 p.m. Friday, Oct. 16, 2015 | Posted: 4:00 p.m. Friday, Oct. 16, 2015 Biden? Clinton? Obama ducks questions on 2016 race Related President Barack Obama answers questions during a joint news conference with South Korean President Park Geun-hye in the East Room of the White House in Washington, Friday, Oct. 16, 2015. (AP Photo/Pablo Martinez Monsivais) Sponsored Links WASHINGTON — \nIt was only a matter of time before it happened. \nAs President Barack Obama took questions from reporters Friday, about half of the inquiries focused on the campaign to become the next president, not the issues facing the current one. \nDid Obama watch the first Democratic debate? Does he think Vice President Joe Biden will make a late entry into the race? What about Democratic front-runner Hillary Rodham Clinton 's opposition to a Pacific Rim trade deal she backed when she worked for Obama? \nThe president made clear he was in no mood to play political pundit. \n\"During the course of what will be a long campaign, I probably won't be commenting on every single utterance or decision that the candidates make,\" Obama said during a White House news conference with the South Korean president. \nAs far as Obama was willing to go was to offer praise for Democrats on their display of party unity in Tuesday's debate, a not-so-subtle dig at a Republican field roiled by divisions. Still, the president made clear he'd only caught a few glimpses of the debate while watching playoff baseball. \nFor Obama, keeping a Democrat in the White House is crucial to his legacy and to maintaining his policies on immigration and health care, as well as the Iran nuclear program. But the Democratic field is shaping up in a way that puts Obama in an awkward position. \nObama pulled Clinton into his administration after he defeated her in the 2008 primary and has effusively praised her tenure as secretary of state. But Clinton has begun to break with Obama on several issues, including the Trans Pacific Partnership trade deal. \nThe White House has said Obama could make an endorsement in the Democratic primary, but that seems unlikely if Biden decides to challenge Clinton. Asked Friday whether it was too late for Biden to launch a campaign, the president would only say that candidates need to make that decision for themselves. \n\"I'm not going to comment on what Joe is or isn't going to do,\" Obama said. \n_ \nFollow Julie Pace at http://twitter.com/jpaceDC Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-16T23:00:00.000+03:00", "crawled": "2015-10-17T00:59:50.633+03:00", "highlightTitle": ""}