{"organizations": [], "uuid": "ae5bb3c440c669b60e91f997f8e25ebf9667f989", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30252349/mcw-leads-capacity-building-dental-outreach-training-program-for-dental-therapists-in-tanzania", "country": "US", "title": "MCW Leads Capacity-Building Dental Outreach Training Program For Dental Therapists In Tanzania", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "MCW Leads Capacity-Building Dental Outreach Training Program For Dental Therapists In Tanzania - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "ae5bb3c440c669b60e91f997f8e25ebf9667f989"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30252349/mcw-leads-capacity-building-dental-outreach-training-program-for-dental-therapists-in-tanzania", "ord_in_thread": 0, "title": "MCW Leads Capacity-Building Dental Outreach Training Program For Dental Therapists In Tanzania", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " MCW\nMBEYA, Tanzania , Oct. 13, 2015 /PRNewswire/ -- MCW ( Miracle Corners of the World), a non-profit organization that empowers youth to be positive agents of change in their communities, led a dental outreach team in Tanzania of twelve dental therapy school students from the Mbeya Dental Therapy Training School in August 2015.\nThe dental outreach, which took place in Mbeya, Tanzania , was supported by contributions in kind from Henry Schein Cares and Colgate Palmolive. The goal was to provide the dental therapy students a key training opportunity in community oral health and included visiting three primary schools in Mbeya city to provide oral health education, fluoride varnish, and screening to more than 1,000 children with follow-up emergency treatment to more than 300 of those screened. The outreach was supervised by four local Tanzanian dentists.\nDr. Ibrahim Kasambala , Principal of the Mbeya Dental School, stated, \"It was a successful outreach as pupils in the reached schools benefited from the services, and second year students of Mbeya Dental School got an important opportunity to practice School Dental Services (SDS) as part of the requirements to be fulfilled in the curriculum. In addition, third year students extended their expertise and gained more experience through a treatment program conducted at the Dental School clinic.\"\nThe outreach marks MCW's continuing efforts to build the capacity of the dental therapy schools through practical training of dental therapists in setting up community-based dental outreach programs. The schools produce the primary oral health workforce population in Tanzania .\n\"The role of dental therapist schools in outreach programs cannot be underestimated, and all efforts should be made to ensure that this is achieved,\" said Professor Emil Kikwilu , former MUHAS Dean, and now an MCW Oral Health Care Committee Member. \"This is because for many years to come, dental therapists shall remain the backbone of oral health care in Tanzania .\"\nSince 2001, MCW has addressed Tanzania's need for improving oral health care through its dental outreach program, directly affecting the lives of more than 10,000 children and youth. MCW's Oral Healthcare program seeks to achieve lasting oral health improvement in Tanzania through three core activities: infrastructure upgrade, capacity building and dental outreaches.\nAbout MCW ( Miracle Corners of the World)\nMCW ( Miracle Corners of the World) is a non-profit organization founded in 1999 with the vision \"Local Change through Global Exchange\" and the mission: to empower youth to become positive agents of change in their communities. Based in New York , with partner organizations in Africa ( Rwanda , Sierra Leone , Tanzania and Zambia ), MCW offers the following three core programs: Global Youth Development, Community Development Initiatives and Oral Healthcare, as well as Partner Programs, including Human Rights and Pediatric AIDS Treatment for Africa (PATA) projects. For more information on MCW, please visit: www.mcwglobal.org .\nPhoto - http://photos.prnewswire.com/prnh/20151013/276511\n releases/mcw-leads-capacity-building-dental-outreach-training-program-for-dental-therapists-in-tanzania-300159038.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY27155&Transmission_Id=201510131613PR_NEWS_USPR_____NY27155&DateId=20151013", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/mcw-leads-capacity-building-dental-outreach-training-program-for-dental-therapists-in-tanzania-300159038.html", "http://photos.prnewswire.com/prnh/20151013/276511", "https://photos.prnewswire.com/prnvar/20151013/276511", "http://www.mcwglobal.org/"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T09:18:42.698+03:00", "highlightTitle": ""}