{"organizations": [], "uuid": "c59536f8c46d35ada16a9f57a47e71738cd57a99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30310530/commissioner-doak-requires-insurers-to-clarify-earthquake-coverage", "country": "US", "title": "Commissioner Doak Requires Insurers to Clarify Earthquake Coverage", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Commissioner Doak Requires Insurers to Clarify Earthquake Coverage - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "c59536f8c46d35ada16a9f57a47e71738cd57a99"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30310530/commissioner-doak-requires-insurers-to-clarify-earthquake-coverage", "ord_in_thread": 0, "title": "Commissioner Doak Requires Insurers to Clarify Earthquake Coverage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Oklahoma Insurance Department\nOKLAHOMA CITY , Oct. 20, 2015 /PRNewswire/ -- Oklahoma Insurance Commissioner John D. Doak today asked property and casualty insurers to send each policyholder a clarifying notice of earthquake coverage. The requirement is in response to a growing number of questions about earthquake insurance.\n\"Insurance is complicated,\" said Doak. \"We know that most people don't read their policies. Even if they do, the language can be tough to understand. I issued this bulletin so that, hopefully, Oklahoma consumers get a better idea of exactly what kind of coverage they have for earthquakes. The goal here is consumer education and protection.\"\nHistorically, earthquake insurance has excluded earth movement resulting from human activities such as mining, explosives and oil and gas exploration. The Oklahoma Geological Survey has determined that the majority of the quakes experienced in Oklahoma are more than likely the result of wastewater injection into disposal wells.\nCompanies writing earthquake insurance in Oklahoma have reacted to the flurry of earthquakes in various ways. Some have amended their policy forms to cover damage resulting from wastewater injection. Others have simply been waiving the man-made exclusion. A third group still excludes quakes induced by wastewater injection.\nInsurers providing earthquake coverage have 45 days to issue a clarifying notice to policyholders and licensed insurance agents. The notice must contain the following:\nEARTHQUAKES RESULTING FROM OIL AND GAS ACTIVITIES\nSubject to all policy provisions, the coverage provided by this policy (IS) or (IS NOT) intended to cover earthquake damage resulting from:\na. extracting oil or gas from below the earth's surface by any process, including but not limited to hydraulic fracturing or drilling; or\nb. injecting or inserting any substance, including but not limited to, water and wastewater, below the earth's surface for any purpose; or\nc. storage of any substance, including but not limited to, water and wastewater below the earth's surface for any purpose; or\nd. any combination of a. - c. above.\nAbout the Oklahoma Insurance Department\nThe Oklahoma Insurance Department, an agency of the State of Oklahoma , is responsible for the education and protection of the insurance-buying public and for oversight of the insurance industry in the state.\nFor more information, contact:\nKelly Dexter\n405-522-0683\nKelly.Dexter@oid.ok.gov\nPhoto - http://photos.prnewswire.com/prnh/20130910/LA77386\n releases/commissioner-doak-requires-insurers-to-clarify-earthquake-coverage-300163439.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DA34006&Transmission_Id=201510201818PR_NEWS_USPR_____DA34006&DateId=20151020", "http://photos.prnewswire.com/prnh/20130910/LA77386", "http://photos.prnewswire.com/prnvar/20130910/LA77386", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/commissioner-doak-requires-insurers-to-clarify-earthquake-coverage-300163439.html"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T02:00:41.832+03:00", "highlightTitle": ""}