{"organizations": [], "uuid": "792850f29c4d54ca1b67c7ab85616ddbbc089dc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/d/a/q/j/image.related.afrArticleLead.620x365.gkd7cl.png/1445294742484.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/malcolm-turnbull-and-david-murray-disagree-on-housing-risks-20151019-gkd7cl", "country": "AU", "title": "Malcolm Turnbull and David Murray disagree on housing risks", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Malcolm Turnbull and David Murray disagree on housing risks | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T06:39:00.000+03:00", "replies_count": 0, "uuid": "792850f29c4d54ca1b67c7ab85616ddbbc089dc0"}, "author": "Laura Tingle", "url": "http://www.afr.com/news/politics/malcolm-turnbull-and-david-murray-disagree-on-housing-risks-20151019-gkd7cl", "ord_in_thread": 0, "title": "Malcolm Turnbull and David Murray disagree on housing risks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The one really conspicuous area of disagreement between the government and the inquiry – given the concerns about a housing bubble – relate to superannuation funds' direct borrowing. Supplied Share on twitter Share on Google Plus by Laura Tingle When David Murray released his final report late last year, its most politically potent observation was that \"housing is a potential source of systemic risk for the financial system and the economy\".\nIn assessing the federal government's response to the report , this is a useful starting point for determining how it has perceived and responded to Murray's recommendations.\nThe speed with which events have been changing have been captured quite dramatically in the evolution of the Murray inquiry. The focus of discussion at the time of its interim report in the middle of last year was on capital adequacy and systemic risk.\nBy December, there seemed to be a lot more concern about housing as a systemic risk and about super.\nBut the government has not taken up his concerns about the housing market in its response.\nThe approach of the inquiry has never been a heavy-handed proscriptive one, more directions to be taken than ratios to be declared.\nOverall, the government has agreed with most of the inquiry's recommendations on bank capital adequacy, on better consumer protections and treatment, on encouraging and establishing frameworks and legislation for innovative financing like crowd funding.\nSignificantly, it has agreed that the objectives of the superannuation system should be enshrined in legislation, to provide a \"valuable yardstick against which to measure competing superannuation proposals\" and provide certainty for the longer term.\n It is instituting what looks like a sensibly transparent process to increase competition in default superannuation – a process established and monitored by the Productivity Commission.\nIn doing so, the government's language is much less driven by the apparent influence of the banks versus other sectors, than it was in its early interventions into financial regulation and competition issues.\nThere is more movement on the financial advice sector, but framed not as penalties but \"aligning the interests of financial firms and consumers\" while increasing regulators' powers to intervene where dodgy products are being offered\nThe one really conspicuous area of disagreement between the government and the inquiry – given the concerns about a housing bubble – relate to superannuation funds' direct borrowing.\nMurray argued that super funds should be prohibited from limited recourse borrowing arrangements.\nThe government has argued that while there are \"anecdotal concerns about limited recourse borrowing arrangements, at this time, the government does not consider the data sufficient to justify significant policy intervention\".\nThat seems odd, given its agreement in full or in general with almost everything else the inquiry recommended, and given the increasing concerns about the housing market as a risk to the system.\nYes, the government has endorsed APRA's move to raise risk weightings on mortgages – a move which requires them to increase capital levels – but the entry of superannuation funds – particularly self-managed funds – into the housing investment market has been seen as an other factor over-heating the market.\nThis is despite Murray recommending – and the government agreeing in its response – that there should be a clearer, more targeted focus on what superannuation is supposed to do.\n\"The tax treatment of investor housing, in particular, tends to encourage leveraged and speculative investment\" the inquiry report says.\n\"Since the Wallis inquiry, higher housing debt has been accompanied by lenders having a greater exposure to mortgages\".\nFor the time being at least, it seems the government, is prepared for that to happen", "external_links": ["https://plus.google.com/108650647776677996559", "https://twitter.com/latingle"], "published": "2015-10-20T06:39:00.000+03:00", "crawled": "2015-10-20T17:12:01.648+03:00", "highlightTitle": ""}