{"organizations": [], "uuid": "d7ae9baa718f8a3f7b6da10cb459f7b921c34c71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wapt.com", "main_image": "http://www.wapt.com/image/view/-/35749710/highRes/2/-/maxh/630/maxw/1200/-/15l4l4nz/-/President-leaves-for-Oregon-jpg.jpg", "site_section": "http://www.wapt.com/9157906?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.wapt.com/politics/obama-to-visit-oregon-after-college-shooting/35750550", "country": "US", "title": "Obama to visit Oregon after college shooting", "performance_score": 0, "site": "wapt.com", "participants_count": 0, "title_full": "Obama to visit Oregon after college shooting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:48:00.000+03:00", "replies_count": 0, "uuid": "d7ae9baa718f8a3f7b6da10cb459f7b921c34c71"}, "author": "", "url": "http://www.wapt.com/politics/obama-to-visit-oregon-after-college-shooting/35750550", "ord_in_thread": 0, "title": "Obama to visit Oregon after college shooting", "locations": ["Oregon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kristen Holmes", "Obama"], "text": "By Kristen Holmes CNN White House Producer Obama to visit Oregon after college shooting Protesters to greet president Photos Olivier Douliery-Pool/Getty Images \nA week after a gunman killed nine people and himself at Umpqua Community College in Roseburg, Oregon, President Barack Obama will meet with survivors and grieving families behind closed doors on Friday. Online writings on guns linked to shooter's mom \nThe apparent online writings of the mother of the man who killed nine people at a community college in Oregon discuss guns and the autism spectrum, painting a partial picture of the environment the family lived in, their beliefs and the challenges th... Obama: We're the only country with... \nAs the President flew across the country earlier in the day, news broke of two other campus shootings --- leaving one dead and three wounded at Northern Arizona University, as well as one dead in an apartment complex near Texas Southern University. \nObama has been clear where he stands on gun control. Following last week's tragedy, he gave his 15th response to a mass shooting since taking office, blasting Congress for its unwillingness to act on gun control and saying gun violence is something that should be politicized. \nThese latest remarks advocating for stricter gun control laws are causing problems for many in the small conservative town of Roseburg, who disagree with the President on gun control and don't want him to visit. \nGun rights activists created a Facebook page with more than 8,000 supporters entitled, \"Defend Roseburg, Deny Barack Obama,\" arranging a protest of the President's visit that includes two peaceful pro-gun events. \nThe rhetoric leading up to the President's trip became so heated, local Roseburg officials issued a statement that the President was welcome and would be extended \"every courtesy.\" \nThe President is not scheduled to speak while in Roseburg and the White House stressed that the trip will not be about politics but about \"consoling the families of those who were so profoundly affected by that tragedy.\"", "external_links": [], "published": "2015-10-09T23:48:00.000+03:00", "crawled": "2015-10-09T23:53:59.149+03:00", "highlightTitle": ""}