{"organizations": [], "uuid": "541d7a08f9a0566ce8951052ee25dc20113c29e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/09/Editorial-Opinion/Images/bigstock-Young-Victim-Of-Domestic-Viole-102561053.jpg", "site_section": "http://www.washingtonpost.com/opinions", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/using-game-theory-technology-to-fight-sexual-assault/2015/10/09/f8ebd44e-6e02-11e5-aa5b-f78a98956699_story.html", "country": "US", "title": "Meet Callisto, the Tinder-like platform that aims to fight sexual assault", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Meet Callisto, the Tinder-like platform that aims to fight sexual assault - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "541d7a08f9a0566ce8951052ee25dc20113c29e1"}, "author": "Ian Ayres", "url": "http://www.washingtonpost.com/opinions/using-game-theory-technology-to-fight-sexual-assault/2015/10/09/f8ebd44e-6e02-11e5-aa5b-f78a98956699_story.html", "ord_in_thread": 0, "title": "Meet Callisto, the Tinder-like platform that aims to fight sexual assault", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Bigstock) (Kasia Bialasiewicz/Bigstock) By Ian Ayres October 9 at 7:39 PM Ian Ayres is a professor at Yale Law School.\nLast month, Pomona College and the University of San Francisco became the first schools to adopt the Callisto reporting system, which allows victims of sexual assault to create secure, time-stamped records of their attacks and which alerts authorities only if another person uses the system to report the same assailant.\nNamed after a figure from Greek mythology who survived a sexual assault by Zeus and was later transformed into a powerful bear, the Callisto platform empowers victims by using game theory to overcome a major barrier to reporting. The project is being developed by the nonprofit Sexual Health Innovations (for whom I serve as an unpaid adviser). While the system also gives survivors the ability to immediately report sexual misconduct to their school’s Title IX coordinator, Callisto’s breakthrough is the option to essentially hold an encrypted record in escrow . This innovation can help solve the rampant problem of underreporting.\nA recent Association of American Universities survey of 150,000 college students found that more than three-quarters of campus assaults go unreported. Survivors of sexual assault sometimes choose not to report because they fear retaliation. Lone claimants are more likely to be accused of fabricating incidents. Indeed, in the AAU survey, 27 percent of survivors who said they did not report their attack listed fear of negative social consequences as one of the reasons they kept silent.\nBut it is also common for an initial public allegation of sexual assault to prompt others to come forward to report additional attacks. The outpouring of allegations against comedian Bill Cosby is just one recent example of this phenomenon.\nBecause for at least some survivors there is a first-mover disadvantage to reporting, a recidivist’s wrongdoing might go unchallenged because no one is willing to lodge a first, potentially uncorroborated, complaint. To escape this “reporter’s dilemma,” Callisto provides what is in effect a “you are not alone” promise. The escrow option guarantees survivors that their report will be investigated only if another allegation of misconduct is made against the same individual. The escrow option thus converts disputes from “he said, she said” to “he said, they said.” Survivors worried about being disparaged for an uncorroborated allegation are assured safety in numbers.\nThe escrow option also can powerfully allay survivor uncertainty. Some survivors are unsure whether their assailant’s behavior was sufficiently heinous to warrant official sanction. Assailants may seek to convince victims that they made an aberrational mistake, not indicative of their true personality. Or survivors who were under the influence of drugs or alcohol at the time of the attack may lack clarity about what exactly happened. In the AAU survey, more than half of survivors who did not report their attacks indicated a belief that the incident was “not serious enough to report.” But those same survivors might feel differently if they knew their assailant had done the same thing to someone else.\nWhat’s more, the Callisto reporting system can produce powerful new types of evidence. By eliciting comprehensive information about an attack and time-stamping when a report is received, the platform preserves contemporaneous evidence of an assault. Escrowed reports have additional authenticity in part because they are not prompted by any previous public report. When two survivors with no knowledge of each other record similar details of an assailant’s modus operandi, both allegations are buttressed.\nThis new escrow option is not a panacea. For example, escrowed filings on one-time assailants will never be investigated. But Callisto also gives victims the option of logging on in the future to forward their reports to their school’s Title IX coordinator. This “go it alone” option allows survivors to decide later if they want to proceed with an incident report. It might well be that a year or two later, some survivors feel safer and more empowered to take action.\nSomewhat ironically, the escrow idea is analytically similar to the billion-dollar feature at the core of the Tinder app, which allows people — by swiping right on photos on their phones — to place in escrow their interest in meeting a specific person. These deposits remain undisclosed unless the app receives a matching reciprocal message from the other person. Like the Tinder escrow, Callisto allows people to discover an undisclosed shared interest — except Callisto accomplishes this without one person knowing the identity of the other, or even whether the other individual exists.\nThe system is still in the early stages of development, and we hope later versions will also allow police reporting and even remind survivors when the statute of limitations for pursuing their attacks is soon to expire. But there are reasons to hope the combination of technology and game theory that underlie Callisto’s platform can empower survivors to begin to turn the tide on sexual assault.\nRead more here:\nCleta Mitchell and Trent Lott: Rethinking how we deal with campus sexual assault\nEditorial: Virginia sets an example on dealing with campus sexual violence cases\nCaitlin Flanagan: An investigation of campus rape reveals no easy solutions", "external_links": ["https://www.sexualhealthinnovations.org/initiatives/callisto", "http://tsl.pomona.edu/opinions/4980/", "http://repository.law.umich.edu/mlr/vol111/iss2/1/", "http://college.usatoday.com/2015/06/05/usf-rape-reporting-system/"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T04:00:16.540+03:00", "highlightTitle": ""}