{"organizations": [], "uuid": "ba90c531e5214d14e49f128383680d74361128c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/2b/13/f222630840f2bd1f48e8545074a6/15005-maggie-hassan-2-ap-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/democrats-senate-2016-hassan-new-hampshire-213836", "country": "US", "title": "2016 Elections: Democrats' Senate hopes on hold", "performance_score": 1, "site": "politico.com", "participants_count": 7, "title_full": "2016 Elections: Democrats' Senate hopes on hold - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:05:00.000+03:00", "replies_count": 6, "uuid": "01e6b5b6677b1a3965b88a09d44fa6e26ff65f2a"}, "author": "Jack Shafer", "url": "http://www.politico.com/story/2015/10/democrats-senate-2016-hassan-new-hampshire-213836#post-0", "ord_in_thread": 0, "title": "2016 Elections: Democrats' Senate hopes on hold", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats landed their top recruit in their battle to retake the Senate on Monday, when New Hampshire Gov. Maggie Hassan announced she would challenge GOP Sen. Kelly Ayotte next year. But their path to victory is being blocked by potentially ruinous primary challenges in other key states. The Hassan-Ayotte battle in the Granite State is widely considered a toss-up in a year when Democrats need to win five GOP-held seats to forge a majority of their own. Hassan's announcement means that Democratic leaders now have a nearly full team of candidates they sought to recruit to given them the best possible chance of taking the Senate – but they also have a few candidates they don’t want.\nIn four key states, each among the Democrats’ best bets to take over Republican seats, upstart challengers are mounting primary contests against the candidates party leaders feel have the best chance next November.\nIn Ohio, 31-year-old Cincinnati City Council member P.G. Sittenfeld is challenging establishment-backed, 75-year-old former Gov. Ted Strickland. In Illinois, former Chicago Urban League president Andrea Zopp is challenging another establishment candidate, Iraq War veteran Rep. Tammy Duckworth. In Pennsylvania, former Rep. Joe Sestak, whose unconventional style has consistently irritated Washington Democrats, is taking on Katie McGinty, a protégé of former Gov. Ed Rendell. And in Florida, liberal firebrand Rep. Alan Grayson is loudly attacking his House colleague Patrick Murphy, the establishment favorite, in the race for Marco Rubio’s seat.\n\"While the announcement by Maggie Hassan shoots New Hampshire straight to the top of the target list, Democrats will be expending energy on primaries in some Senate races, even if none of those contests puts the seat in jeopardy in November,\" said Martha McKenna, a Democratic consultant and former political director at the Democratic Senatorial Campaign Committee.\nFor the most part, the Democrats’ headaches over primary challenges aren’t the full-blown migraines that haunted Republicans from 2010 to 2014, when candidates like Christine O’Donnell, Sharron Angle and Todd Akin blew Republican chances to win multiple Democratic-held seats. They aren’t the ideological crusades Matt Bevin and Chris McDaniel ran against incumbent GOP senators last year.\nNew Hampshire Gov. Hassan to challenge Sen. Ayotte By Steven Shepard\nThe overwhelming majority of these battles aren't likely to result in fatally wounded or unelectable candidates. But they are problems for a party with little margin for error in its quest to regain control of the Senate. Democrats would prefer not to have Sittenfeld’s campaign sniping at Strickland. They would feel better about their chances in Pennsylvania if Sestak and McGinty, a former state Environmental Protection Secretary, weren’t about to spend months and millions battling each other instead of focusing their energies on incumbent Sen. Pat Toomey. And in Florida, some Democrats fear that a Grayson victory in next August’s primary would produce a virtually unelectable nominee.\n“Best-case scenario is that Democrats are dealing with resource-draining, energy-sapping primaries where there is a strong possibility of alienating a crucial segment of the party,” said Ian Prior, spokesman for the GOP leadership-blessed Senate Leadership Fund super PAC. “The worst-case scenario, which appears likely in Florida, is a bitter and nasty primary threatens to have an impact on races up and down the ballot.”\nThe Democratic Senatorial Campaign Committee claims the glut of candidates is, in part, a reflection of the party’s strong chance at reclaiming control of the Senate in 2016.\n“There is a lot of enthusiasm in states across the country aimed at beating these vulnerable, out-of-touch Republican senators, and we are proud to have such an outstanding group of candidates who are the strongest possible nominees to win these seats and take back the Senate,” DSCC spokeswoman Sadie Weiner said.\nStill, some strategists wondered why the DSCC wasn’t able to better avoid having so many pesky challengers.\n“I don’t think leadership at the DSCC has done an effective job at avoiding some of these primaries,” a Democratic strategist who requested anonymity to speak frankly about his own party said. “When you have a candidate like Sittenfeld who’s willing to engage with national Democrats, you have a lot more leeway to convince him not to run.”\nThe problem isn't universal: Democrats in New Hampshire aren't lining up to challenge Hassan, and former Wisconsin Sen. Russ Feingold, Missouri Secretary of State Jason Kander and former Nevada Attorney General Catherine Cortez Masto all cleared the field in their respective states.\nThe New Hampshire race will be a clash between two popular politicians, set against the backdrop of the presidential campaign in a swing state. Already, both Ayotte and Hassan have taken active roles in their respective party's nominating contest: Hassan publicly backed Hillary Clinton last month, while Ayotte has criticized Texas Sen. Ted Cruz for backing a standoff over Planned Parenthood that could have led to a government shutdown.\nGOP's future may rest on untested McCarthy-McConnell relationship By Seung Min Kim\nBut in the states where Democrats face competitive primaries, the general-election dynamics are still unclear.\nIn Ohio, Sittenfeld's presence in the race is largely of a problem of Democrats' own making. National Democrats were initially excited when he entered the contest earlier this year. His youth, relatively brief career in politics, his liberal stances — all set up strong contrasts with well-funded GOP Sen. Rob Portman.\nHe had been in regular contact with the DSCC — until the party's preferred candidate, Strickland, got into the race. So even though Sittenfeld isn't committing gaffes or otherwise making himself unelectable, he's emerged as a nuisance for Strickland's campaign.\nStrickland first won election to Congress 22 years ago, the same year Portman did, providing less of an insider-versus-outsider contrast. But his ability to lock down prominent supporters and raise money, along with his years of service to the party, led to endorsements from the DSCC and the Ohio Democratic Party. Sittenfeld’s own fundraising dried up, and polls give him little chance of triumphing in the primary.\nBut Sittenfeld is still in the race, and says the DSCC hasn't made an overt effort to push him out.\n“I think I can be the strongest messenger of Democratic values in this race,” Sittenfeld said in a phone interview. “I think they might not always feel free to say it, but plenty of national Democrats agree.”\nDemocrats have faced competitive primaries before without serious damage to their general election prospects. In 2012, for example, the Democratic nominees in Connecticut, Massachusetts and New Mexico all survived their primary races to win contested Senate seats.\nNonetheless, the DSCC sometimes tries to clear the field by endorsing a prominent candidate and hoping it sends a message to keep others out of the primary. So far, in this cycle, the committee has officially backed three candidates: Murphy, Strickland and Duckworth.\nKirk camp goes on offense against upcoming Chicago Tribune story By Hadas Gold and Elena Schneider\nIn Pennsylvania, national Democrats have long clashed with Sestak, a former Navy admiral who is something of a political maverick. EMILY’s List and others worked to lure McGinty, a former gubernatorial and presidential aide, into the race. But the clash between the two Democrats seems to have prevented either one from gaining early traction against the GOP incumbent: polls have found both Sestak and McGinty trailing Toomey by similar margins, though analysts in both parties still believe the incumbent is vulnerable. A third Democrat, Braddock Mayor John Fetterman, entered the race a few weeks ago.\nRob Engstrom, national political director at the U.S. Chamber of Commerce, said he thinks both the Pennsylvania race and the Illinois clash between Zopp and Duckworth have the potential to become truly damaging primaries for Democrats: “The rhetoric is hot.”\nMoreover, the role of the DSCC and other national Democrats seems to have sparked a grass-roots backlash.\nIn Ohio, Illinois and Pennsylvania, groups of local Democrats have complained about D.C.-based operatives trying to dictate the outcome of state-based elections. In two safely blue states with primaries unlikely to alter the balance of power — California and Maryland — establishment endorsements could alienate key voting blocs. The embrace of state Attorney General Kamala Harris over Rep. Loretta Sanchez unsettled Latino voters in California, while Senate Minority Leader Harry Reid’s decision to endorse Rep. Chris Van Hollen over Rep. Donna Edwards could anger black voters in Maryland.\nBut no problem looms larger than Florida. Murphy, a prolific fundraiser and relative moderate, has already received donations from 18 Democratic senators. Grayson, a self-funding liberal, has shown he’s willing to burn and salt the earth behind him, recently calling Murphy “nothing as a human being.”\nMurphy’s team thinks the candidate’s experience battling the unusually outspoken GOP Rep. Allen West in 2012 provides a playbook for countering Grayson’s over-the-top approach.\nReid starts new gun-control push, calls Republicans 'puppets' of NRA By Seung Min Kim and Burgess Everett\n“Patrick went up against a guy who was willing to say anything, was all about the one-liners and the headlines, and making the most bombastic show possible,” a source close to Murphy’s campaign said. “That calm presence, where you draw contrast without stooping down to that level, is an art form, and Patrick’s got it mastered.”\nDemocratic fears of a Grayson nomination are significant enough that the party might break new ground in its use of super PACs. Senate Majority PAC, which is blessed by Democratic leadership, wouldn’t comment on whether it would play in the primaries, but multiple Democratic strategists said they wouldn’t be surprised if the group weighed in on Murphy's behalf. There is also a super PAC, Floridians for a Strong Middle Class, set up specifically to back Murphy. In the past, Democratic leaders have strongly discouraged the emergence of candidate-specific super PACs, but one of the group’s founders said it has received no pushback from national Democrats.\n“This is those of us that live in the state of Florida circling and consolidating support for Patrick Murphy,” said Alan Clendenin, first vice chair of the state party. “This is homegrown politics.”\nGrayson’s team disputes claims that his outspoken liberalism would hurt the party's chances in Florida, arguing that Murphy’s moderation would be more of an impediment. Kevin Franck, a senior adviser to Grayson’s campaign, notes that President Barack Obama won Florida twice, while the moderate former Republican Gov. Charlie Crist lost the 2014 gubernatorial race.\n“National Democrats have a fundamentally outdated view of how to win statewide elections in swing states,” Franck said, insisting Grayson’s boldness is necessary to excite low-turnout, Democratic-leaning demographics, adding: “Which candidate in the primary is more like President Obama, and which is more like Charlie Crist?”\nRepublicans also look eager to meddle in Democratic primaries. Two groups who don’t often find themselves on the same side of electoral battles — the establishment-oriented Chamber of Commerce and the archconservative Club for Growth — have indicated they’re willing to air ads in Democratic primaries to make sure the weaker general-election candidate wins, helping Republicans hold the seat.\n“All options are on the table. All options are going to remain on the table” when it comes to interfering in Democratic primaries, the Chamber's Engstrom said.\nRepublicans have their own Senate primary problems. The GOP nomination in Florida will be decided by an unpredictable five-way race. Indiana’s Republican primary could have four candidates. If Sen. David Vitter wins Louisiana’s governorship, a number of Republicans could jump into the contest there. And GOP groups on both sides of the establishment-insurgent divide are ready to get involved.\n“I don’t know if the shoe is on the other foot,” Engstrom said. “It might be on both feet.”\n<div", "external_links": [], "published": "2015-10-05T15:05:00.000+03:00", "crawled": "2015-10-06T03:18:31.834+03:00", "highlightTitle": ""}