{"organizations": [], "uuid": "ac08a08e7b84d04f42190ebc855bb41d0d261d00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theweek.com", "main_image": "http://api.theweek.com/sites/default/files/styles/tw_image_9_4/public/GettyImages-490546689_0.jpg?itok=CIp437uj", "site_section": "http://theweek.com/section/index/politics.rss", "section_title": "The Week - Politics", "url": "http://theweek.com/articles/581484/4-debate-questions-hillary-clinton-courtesy-black-lives-matter", "country": "US", "title": "4 debate questions for Hillary Clinton, courtesy of Black Lives Matter", "performance_score": 0, "site": "theweek.com", "participants_count": 0, "title_full": "4 debate questions for Hillary Clinton, courtesy of Black Lives Matter", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:05:00.000+03:00", "replies_count": 0, "uuid": "ac08a08e7b84d04f42190ebc855bb41d0d261d00"}, "author": "", "url": "http://theweek.com/articles/581484/4-debate-questions-hillary-clinton-courtesy-black-lives-matter", "ord_in_thread": 0, "title": "4 debate questions for Hillary Clinton, courtesy of Black Lives Matter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton"], "text": "October 13, 2015 ADVERTISEMENT \nWhen Hillary Clinton takes the stage Tuesday at the first Democratic debate of the 2016 presidential election, it's a forgone conclusion that she will have the overwhelming support of black voters. \nIt's not clear why. \nAs first lady, Hillary Clinton vehemently advocated for one of the most destructive policies of her husband's presidency: the 1994 crime bill , a \"tough on crime\" relic credited with increasing the U.S. prison population by 673,000 inmates . \n\"There will be more police on the street, a hundred thousand more police officers, with flexibility given to local communities to determine how best to use them,\" she said at a 1994 conference for female police officers advocating the bill. \"We will be able to say, loudly and clearly, that for repeat, violent, criminal offenders — three strikes and you're out. We are tired of putting you back in through the revolving door.\" \nIt's a stance for which she still has a lot of atoning to do. \nWhile former President Bill Clinton has expressed regret over the bill he once championed, Hillary has not. It's a point of contention with the Black Lives Matters movement, founded after the killing of unarmed black teen Michael Brown at the hands of white police officer Darren Wilson last year. When members of its Boston chapter asked Clinton during a campaign stop in New Hampshire nearly two months ago about the mistakes she made in support of the bill, she ducked the question and never apologized. \nEven during a recent interview with BuzzFeed , she refused to acknowledge her personal role in the mass incarceration complex of the 1990s. Her lack of self-reflection should be of great concern to black voters as she prepares to face questions about her criminal justice and police reform policies Tuesday night. Despite offering vague promises around body cameras and ending an \"era of mass incarceration,\" Hillary Clinton has failed to give specifics on meaningful police reform policies she would pursue as president. CNN shouldn't let her off the hook. \nHere are four questions the moderators should ask her at Tuesday night's debate: \n1. Beyond body cameras, are you willing to push for legislation that will punish police officers who do not belong on the force? It is nearly impossible to fire police officers over bad conduct. As CBS News found in 2013, even when police chiefs fire officers for abuse, they stand a good chance of being reinstated because of arbitration and union rules. In Washington state, Spokane County Sheriff Ozzie Knezovich had to retain several cops he fired for abusing their power. When he drafted a bill that would make it easier for police chiefs to fire bad cops, the legislation died in committee in 2013. As president, would Clinton take up Knezovich’s bill at the federal level? \n2. Will you challenge the doctrine of qualified immunity , which protects police officers from civil lawsuits while conducting police business? This doctrine protects officers from being sued in civil court, as long as their actions don’t violate the U.S. Constitution or a statutory right. The U.S. Supreme Court upheld the doctrine twice, most recently in 2014 . Of course, we all know that police officers’ jobs are dangerous. But should it really be legal for a cop to not even have to stand before a jury of his or her peers to face civil charges for their actions? Will Clinton throw the weight of the presidency behind another challenge to the Supreme Court? \n3. Should states require that police officers' personnel records be open to the public? In many states, a police officer's personnel records are not available to the public. So if a bad cop has been disciplined for behavior that violates a citizen's civil rights, that punishment is protected by state law. As public servants, such protections are ridiculous and need to be challenged. If a cop has engaged in conduct that has harmed the public or disgraced the uniform, the public should know. Does Clinton agree? \n4. Should law enforcement agencies at the federal, local, and state levels be required to release body camera footage, unedited, in 48 hours or less? While the use of video has captured devastating acts of police brutality, much of the most publicized abuse was filmed by bystanders' cellphones, not police officers' body cameras. In fact, in Denver, Colorado, an inspector general report found that police officers' cameras recorded just one out of four use-of-force incidents during its six-month pilot program. And some states still make it difficult for body camera footage to be released to the public, even though the equipment and the cops who use it are supported with taxpayer dollars. Would Clinton support a policy to make these videos automatically public? Her responses to these questions would be very revealing about her commitment to true police reform. That is, of course, if she is even interested in enacting it at all. \"Look, I don't believe you change hearts,\" Clinton told Black Lives Matters protesters in August. \"I believe you change laws, you change allocation of resources, you change the way systems operate.\" Time for Clinton to detail what those laws will be. Try 4 Risk-Free Issues of The Week magazine. ADVERTISEMENT", "external_links": [], "published": "2015-10-13T17:05:00.000+03:00", "crawled": "2015-10-13T19:14:04.588+03:00", "highlightTitle": ""}