{"organizations": [], "uuid": "250a1995d98c77fd22561ba21aba55f94b3d2251", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://voxy.co.nz//politics/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/stronger-rules-needed-protect-beaches-oil-spills/5/234056", "country": "US", "title": "'Stronger rules needed' to protect beaches from oil spills", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "'Stronger rules needed' to protect beaches from oil spills", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:35:00.000+03:00", "replies_count": 0, "uuid": "250a1995d98c77fd22561ba21aba55f94b3d2251"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/stronger-rules-needed-protect-beaches-oil-spills/5/234056", "ord_in_thread": 0, "title": "'Stronger rules needed' to protect beaches from oil spills", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Sunday, 11 October, 2015 - 12:35 \nStronger rules and enforcement to protect our beaches and marine environment are needed in the wake of new information that more than 360 oil spills have occurred in New Zealand waters since the 2011 Rena disaster, the Green Party said today. \n\"With summer just around the corner, we need better ways of protecting the beaches and seas that are so important to Kiwi ways of life,\" Green Party environment spokesperson Eugenie Sage said. \n\"Every New Zealander has a birthright to swim in clean water, lie on clean sand, and catch fish that are safe to eat. \n\"The fact that people and vessels have spilled nearly four tonnes of oil and fuel into New Zealand’s coastal waters, in 363 spills in the last four years, shows that the current system isn’t working. Stronger rules, enforcement, and response capability are needed. \n\"It looks as if some regional councils respond more effectively than others when oil spills are reported, so the Ministry for the Environment needs to do its job and make sure all councils are up to scratch. \n\"Everyone on the water has a responsibility to take care and avoid making pollution, including recreational boaties. It’s clear that the oil and commercial fishing industries in particular need to do much better. \n\"The Green Party has a plan to protect beaches and the marine environment. Our plan includes through introducing compulsory shipping lanes like Norway and the UK have to reduce the risk of collision, improving Maritime New Zealand’s oil spill preparedness and response capability, holding people who spill oil financially accountable, and stopping risky deep sea oil drilling,\" said Ms Sage. \nAll articles and comments on Voxy.co.nz have been submitted by our community of users. Please notify us through our contact form if you believe an item on this site breaches our community guidelines .", "external_links": [], "published": "2015-10-11T03:35:00.000+03:00", "crawled": "2015-10-11T04:43:45.201+03:00", "highlightTitle": ""}