{"organizations": [], "uuid": "70a8921ae47bb2d7357e57957cacbbee7c6ea55d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2013/6/4/241219/default/v1/lords-chamber-1-1600x900.jpg", "site_section": "http://news.sky.com/feeds/rss/politics.xml", "section_title": "Political News - International and UK Politics | Sky News", "url": "http://news.sky.com/story/1576082/tory-voters-want-osborne-to-protect-low-paid", "country": "IL", "title": "Tory Voters Want Osborne To Protect Low-Paid", "performance_score": 0, "site": "sky.com", "participants_count": 25, "title_full": "Tory Voters Want Osborne To Protect Low-Paid", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T13:55:00.000+02:00", "replies_count": 29, "uuid": "70a8921ae47bb2d7357e57957cacbbee7c6ea55d"}, "author": "news.sky", "url": "http://news.sky.com/story/1576082/tory-voters-want-osborne-to-protect-low-paid", "ord_in_thread": 0, "title": "Tory Voters Want Osborne To Protect Low-Paid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eight in ten Conservative voters don't agree with benefit cuts for low income families, according to Sky Data research. The findings come as George Osborne is bracing for a showdown with peers over controversial plans to tax credit cuts, which will see three million of the country's poorest paid families lose £1,300 a year, according to estimates.\nThe House of Lords is set to vote later on whether to ditch the tax credit cuts or delay them until a financial support package is in place for those hit by the £4.4bn squeeze.\nThe Sky Data shows that 80% of people who voted for the Tories in May want to see low income workers protected from Government cuts.\nNearly 90% of people who voted for the Conservatives at the election thought that Mr Osborne's planned £12bn welfare cuts would not hit low income workers the hardest, with the majority (51%) thinking they would affect the unemployed.\nPlay video \"Labour Would Back Tax Credit U-Turn\" Video: Labour Would Back Tax Credit U-Turn Half of the public opposes tax credit cuts (31% support them) and 47% now say they are opposed to welfare cuts in general (40% support them), the data suggests.\nWhen asked the same question in July, more people supported welfare cuts.\nThe findings suggest the Chancellor's cuts have sparked a rethink about welfare reductions in general among the public at large.\nMr Osborne is facing dissent from a number of his own backbench and Cabinet colleagues over the austerity move.\nScottish Tory leader Ruth Davidson is the latest senior party figure to express disquiet over the plans warning it would cause unacceptable \"suffering\" for poorer households .\nShe said: \"The aim is sound, but we can't have people suffering on the way.\n\"The idea that there's a cliff edge in April before the uptake in wages comes in is a real practical human problem.\"\n:: Tax Credits Explained \nCabinet Office Minister Matt Hancock told Sky News Mr Osborne was in \"listening mode\", suggesting the Chancellor might be examining ways of softening the blow.\nPlay video \"Chancellor Quizzed On Tax Credits\" Video: Chancellor Quizzed On Tax Credits However, he called on peers not to take the \"unprecedented\" measure of voting to kill off the measures - something that has not been done by the House of Lords for more than 100 years.\nHe encouraged them to instead support a vote of regret. Mr Hancock said: \"It would be unprecedented for the unelected House of Lords to reject a financial measure of this scale that has been passed by the House of Commons.\"\nA report from the social policy think tank Policy in Practice has found that two-thirds of families on tax credits would still be worse off by 2020 despite the increase in the new National Living Wage.\nThe Government claims that the cuts will be offset by the increase which will mean an extra £20 a week. However, in a study of 100,000 households, the think tank has found 67% would still be worse off.\nThe Liberal Democrats have tabled a so-called \"fatal motion\" aimed at scuppering the plans while a separate motion by Labour is seeking a delay with \"full transitional protection for a minimum of three years\".\nShadow chancellor John McDonnell has written a letter to Mr Osborne urging a U-turn on the existing plans .\nSky Data interviewed a nationally representative sample of 1,001 Sky Customers 16-19 October 2015. Data weighted to match the profile of the population.\n:: Will the cuts to tax credits affect you? Let us know by emailing news@sky.com", "external_links": [], "published": "2015-10-26T13:55:00.000+02:00", "crawled": "2015-10-26T14:35:48.858+02:00", "highlightTitle": ""}