{"organizations": [], "uuid": "cf8daa6d7b50ed31b445f5ed2b219fa23a145d3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "https://pbs.twimg.com/media/CQ5NSvWUAAEpVhl.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/alex-jones-calls-obama-the-ghoul-the-great-vulture-video-comes-to-offer-teen-deaths-to-gun-control-3063104.html", "country": "US", "title": "Alex Jones Calls Obama \"The Ghoul\" (\"The Great Vulture\")...(Video)...He Who Comes To Offer Teen Deaths to Gun-Control | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Alex Jones Calls Obama \"The Ghoul\" (\"The Great Vulture\")...(Video)...He Who Comes To Offer Teen Deaths to Gun-Control | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:49:00.000+03:00", "replies_count": 0, "uuid": "cf8daa6d7b50ed31b445f5ed2b219fa23a145d3b"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/alex-jones-calls-obama-the-ghoul-the-great-vulture-video-comes-to-offer-teen-deaths-to-gun-control-3063104.html", "ord_in_thread": 0, "title": "Alex Jones Calls Obama \"The Ghoul\" (\"The Great Vulture\")...(Video)...He Who Comes To Offer Teen Deaths to Gun-Control | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News) By King of Shambhala (I announce the Apocalypse and Revelation as a Buddhist reluctantly delving into the Christian Apocalypse as a Messenger of it. I’m the Messiah/Jesus.)\nObama not welcome on Oregon from now on.\nAt 10:20: “Obama The Ghoul Comes to Roseburg to offer the teen dead as sacrifices to gun-control.” Obama Preys on the Dead to Push Anti-Gun Agenda\nAlex Jones talks with Infowars reporters Jakari Jackson and Joe Biggs who are live on in the ground in Oregon as the great vulture himself, Barack Obama descends on Oregon.\nHurry to contact me at Twitter ( https://twitter.com/Tugikorlo ), YouTube ( https://www.youtube.com/user/ObamasTheBeast ), Google,( https://plus.google.com/113035477842551142514/about ) BeforeItsnews, ( /contributor/pages/15/190/bio.html ) Hotmail, ( http://tibetngorkalachakra@hotmail.com ) Yahoo ( http://geir.smith@yahoo.fr ). Many signs are showing the APOCALYPSE NOW of revealing the Antichrist Obama.\nIMPORTANT NEWS : Comments disabled because people (Geeper, Gus Fang, “The Clucker”, caoneil76) reveal my private info online which is a crime. (Judge Tafoya ruled on it in Colorado in 2013: it is forbidden to reveal your opponent’s private information on Internet. Case “Delgaudio VS SPLC” ) I got death threats too and got two criminal posters (“Crowpie” and “Doggoneit”) banned for that. The feds Trump will lead as president will track down these accomplices to Obama who support him on Internet and troll for him – Obama’s the world’s greatest criminal of all history.\n——-\nIn 2008 Newsweek Magazine‘s headline: Is Obama the Antichrist? Proof that he was so is in the article : “ On Nov. 5, 2008, the very night Obama was first elected president, the Illinois Pick 3 lottery number for the Evening Pick was 666, a number associated with “the beast” mentioned in the Book of Revelation. Obama’s home state at the time was Illinois .”\nA poll says that 1 in 4 say Obama’s may be , … and 1 in 8 says for sure, Obama’s…. the Antichrist.–\nI’m revealing the Apocalypse which is that Obama’s the Antichrist. I’m Buddhist of the highest form of culture in the world Tibetan Tantric Buddhism. It’s right that I be Buddhist and not Christian because Jesus himself said no Christians would be saved in the end times and so he would return for the Second Coming but not as a Christian. He said “Don’t follow anyone coming in my name (aka “as a Christian”) in the Apocalypse.” My message is right because I reveal that in my faith’s Apocalypse prophecy of Kalachakra it says the Antichrist will have all the precise features of Barack Hussein Obama!\nBorn in the USA to US-Norwegian parents and we moved to France when I was 7. Schooled in French, I studied Tibetan language and culture (Paris University). I did an eight-month meditation-retreat upon the deity Naljorma. Then 28 years of post-university research upon the Tibetan Apocalypse deity Kalachakra. My life turned around when I realized that 666 was drawn in the lottery of Obama’s hometown the next day after his election which makes him the most probable candidate for Antichrist that history has ever seen and ever will see.\n(I’m a 45-year religious Buddhist. The Christian Apocalypse is outside my field. But I am alone to reveal that Obama’s the Antichrist by relying upon the 666 omen found in Obama’s hometown’s Lottery.\nWhy am I nevertheless involved in the Christian Apocalypse? Because it’s linked to my own Buddhist Apocalypse prophecy Kalachakra and here is that reason: – so as also to explain away criticism from the forces who support Obama – that reason is this: I use the Christian word “Antichrist” because the Buddhist Apocalypse prophecy “Kalachakra” predicts the announced evil Demon-King Krinmati will be part Christian (and Islamic/Jewish and Manichean - [Buddhist/Hindu]). The Buddhist Kalachakra will thus combat that partly Christian demon: Obama the Antichrist. Obama indeed, has a varied creed of all and many faiths which are all mixed together. The Kalachakra prophecy doesn’t predict the coming of the Messiah nor Jesus but the coming of the King of Shambhala, me, the World Saviour [from the Buddhist perspective]. See personal website here... )\nAll Stories By King of Shambhala Click Here!", "external_links": ["https://www.youtube.com/embed/xDDeUr_pA_k", "https://www.youtube.com/user/ObamasTheBeast", "http://geirsmith.wix.com/obama-the-antichrist", "https://plus.google.com/113035477842551142514/about", "https://pbs.twimg.com/media/CQ5NSvWUAAEpVhl.jpg", "http://m.christianpost.com/news/the-southern-poverty-law-center-and-violent-bullying-exclusive-90749/", "http://www.newsweek.com/belief-watch-obama-antichrist-84741", "http://www.wnd.com/2013/04/1-in-4-believe-obama-may-be-antichrist/", "https://twitter.com/Tugikorlo"], "published": "2015-10-09T23:49:00.000+03:00", "crawled": "2015-10-10T02:19:33.229+03:00", "highlightTitle": ""}