{"organizations": [], "uuid": "a4c90e192f8ac9378cb1a9c24a3c6ae5b05ea6dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00240/no-pride-in-prisons-condemns-judges-decision.htm", "country": "US", "title": "No Pride in Prisons Condemns Judge’s Decision", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "No Pride in Prisons Condemns Judge’s Decision", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T06:47:00.000+03:00", "replies_count": 0, "uuid": "a4c90e192f8ac9378cb1a9c24a3c6ae5b05ea6dd"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00240/no-pride-in-prisons-condemns-judges-decision.htm", "ord_in_thread": 0, "title": "No Pride in Prisons Condemns Judge’s Decision", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No Pride in Prisons Condemns Judge’s Decision   4:47 pm Press Release: No Pride in Prisons \nNo Pride in Prisons Condemns Judge’s Decision to Send Transgender Woman to Men’s Prison \nTransgender rights group No Pride in Prisons is furious that another transgender woman, Daytona Haenga, has been sentenced to time in a men’s prison. Despite an incident while remanded in custody that saw her segregated for her own safety, Judge Warren Cathcart sentenced her to 8 months in a men’s prison. \nAccording to a report by the Gisborne Times,[1] during the sentencing Judge Cathcart stated that her transgender status was merely a ‘life choice’ that should not entitle her to ‘special treatment’. \n‘Ms. Haenga was assaulted while in Corrections’ custody awaiting trial,’ says No Pride In Prisons spokeswoman Emilie Rākete. ‘Corrections repeatedly claim that they are sensitive to the needs of transgender prisoners, but this violence keeps happening.’ \n‘Protecting trans women from violence isn’t ‘special treatment’ but a fundamental obligation of the state.’ \nA study conducted in minimum-security prisons in California found that transgender women in men's prisons are 13 times more likely to be sexually assaulted than the general population.[2] Rākete claims Corrections policy exposes transgender inmates in New Zealand to the same risk. \n‘We already know that at least one trans woman has been sexually assaulted in a men’s prison this year. Because Corrections refuse to disclose how many transgender people are presently incarcerated, we have no way of knowing how often this is happening.’ \nNew Zealand presently maintains the 7th highest prison population per capita in the OECD,[3] a figure buoyed by a prison population which is more than 50% Māori. Māori only make up 14% of the general New Zealand population. \n‘The prison system in New Zealand is structurally and functionally racist,’ says Rākete. ‘New Zealand locks up more Māori than all other ethnic groups combined.’ \n‘The fact that both Ms. Haenga and the woman who was sexually assaulted in Auckland South Corrections Facility are Māori is symptomatic of the structural racism of New Zealand’s justice system.’ \nRākete says, ‘As Corrections has shown time and again, New Zealand prisons are transphobic institutions. What we are seeing at the moment is the violence Corrections exposes Māori and transgender people to.’ \n‘Corrections needs to not only collect information on how these groups are treated in their care, but absolutely must take action to ensure that these conditions improve.’ \nNo Pride In Prisons have demanded that Corrections accept responsibility for their failed transgender placement policies. ‘These policies are directly responsible for the violence incarcerated trans people experience,’ says Rākete. \nThe group is also calling on Corrections to take immediate action to improve the safety of transgender inmates. \nNo Pride in Prisons say they will take further action if these demands are not met by the 17th of October. \nENDS", "external_links": [], "published": "2015-10-14T06:47:00.000+03:00", "crawled": "2015-10-14T13:57:46.682+03:00", "highlightTitle": ""}