{"organizations": [], "uuid": "7d764babc8c99914bd405148e922faac2f76496c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.itv.com", "main_image": "http://news.images.itv.com/image/file/798083/img.jpg", "site_section": "http://www.itv.com/news/anglia/politics/", "section_title": "Politics | Anglia - ITV News", "url": "http://www.itv.com/news/anglia/2015-10-18/suffolk-tory-mp-says-junior-doctors-deserve-a-fair-contract/", "country": "GB", "title": "Suffolk Tory MP says junior doctors deserve a fair contract | Anglia", "performance_score": 0, "site": "itv.com", "participants_count": 1, "title_full": "Suffolk Tory MP says junior doctors deserve a fair contract | Anglia - ITV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T22:02:00.000+03:00", "replies_count": 0, "uuid": "7d764babc8c99914bd405148e922faac2f76496c"}, "author": "itv.com", "url": "http://www.itv.com/news/anglia/2015-10-18/suffolk-tory-mp-says-junior-doctors-deserve-a-fair-contract/", "ord_in_thread": 0, "title": "Suffolk Tory MP says junior doctors deserve a fair contract | Anglia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thousands of NHS workers protested in London against government changes to junior doctors' contracts. Credit: ITV News. One of Suffolk's Conservative MPs has told junior doctors they are the \"backbone of the NHS\" and deserve a fair contract that rewards their hard work.\nFormer health minister Daniel Poulter made a video message to the medics in which he speaks out against his party's planned changes to NHS contracts.\nYesterday, doctors and health workers from across our region joined thousands of others in a protest in London.\nThey say contract changes will lead to a cut in wages for junior doctors and put them at risk of working unsafe hours.\nCentral Suffolk and North Ipswich MP Dr Poulter warned against a \"return to those unsafe hours of the past\".\nCentral Suffolk and North Ipswich MP Daniel Poulter. \"From my own experience, I understand how hard junior doctors work. Junior doctors are the backbone of our NHS, working many evenings and weekends, often going above and beyond the call of duty, working many hours that they are not always paid for in order to provide the highest quality of care to patients.\n\"If we want to have a contact that's fair for patients, we have got to have a contract that is also fair and properly rewards and looks after the interest of our medical workforce.\n\"That means making sure doctors aren't asked to work unsafe hours, that we don't return to those unsafe hours of the past.\"\n– Daniel Poulter MP, Central Suffolk and North Ipswich (Cons). The government plans to reduce times when doctors are eligible for extra pay for working unsociable hours.\nUnions say the proposals would also force trainees to work longer hours.\nBut Health Secretary Jeremy Hunt insists the contracts would not reduce pay going to junior doctors and said working hours needed to change to provide adequate weekend cover.\nHe also accused the British Medical Association of \"misrepresenting\" government plans to doctors.\nWatch Dr Poulter's full message below.\nPlay video Last updated Sun 18 Oct 2015 Health Suffolk Ipswich", "external_links": [], "published": "2015-10-18T22:02:00.000+03:00", "crawled": "2015-10-26T01:37:57.228+02:00", "highlightTitle": ""}