{"organizations": [], "uuid": "7838f7b59ccad0c18709ec1cb8a891fe9513e0b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30218633/suntrust-provides-relief-in-wake-of-historic-carolina-floods", "country": "US", "title": "SunTrust Provides Relief in Wake of Historic Carolina Floods", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "SunTrust Provides Relief in Wake of Historic Carolina Floods - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7838f7b59ccad0c18709ec1cb8a891fe9513e0b9"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30218633/suntrust-provides-relief-in-wake-of-historic-carolina-floods", "ord_in_thread": 0, "title": "SunTrust Provides Relief in Wake of Historic Carolina Floods", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " SunTrust Banks, Inc.\nContributes $100,000 to American Red Cross; Accepts Donations in Branches\nATLANTA , Oct. 8, 2015 /PRNewswire/ -- The SunTrust Foundation today announced it will donate $100,000 to the American Red Cross to support relief efforts for thousands of residents in North Carolina and South Carolina impacted by the historic flood. The Foundation's contribution to the American Red Cross Disaster Relief fund will help support individuals and families affected by the heavy rainfall.\nSunTrust is also collecting donations for the American Red Cross at 1,400 branch locations throughout its footprint. To find the nearest branch in your area, please visit www.SunTrust.com .\n\"The unprecedented floodwaters have caused severe hardship for thousands of people throughout the region,\" said David Fuller , president of the SunTrust Foundation. \"As part of our commitment to the communities we serve, the SunTrust Foundation is providing this support to help ensure the needs of our friends and neighbors are being addressed.\"\nAbout The SunTrust Foundation\nThe SunTrust Foundation's mission is to provide monetary support to nonprofit organizations and institutions engaged in activities promoting education, health and human services, culture and art, and civic and community involvement that contribute to the social and economic development primarily in the Southeast and Mid-Atlantic.\nAbout SunTrust Banks, Inc.\nSunTrust Banks, Inc. (NYSE: STI), one of the nation's largest financial services organizations, is dedicated to Lighting the Way to Financial Well-Being for its clients and communities. Headquartered in Atlanta , the company serves a broad range of consumer, commercial, corporate and institutional clients. As of June 30, 2015 , SunTrust had total assets of $188.9 billion and total deposits of $144.9 billion . Through its flagship subsidiary, SunTrust Bank, the company operates an extensive branch and ATM network throughout the high-growth Southeast and Mid-Atlantic States and a full array of technology-based, 24-hour delivery channels. The company also serves clients in selected markets nationally. Its primary businesses include deposit, credit, trust and investment services. Through its various subsidiaries, the company provides mortgage banking, asset management, securities brokerage, and capital market services. The SunTrust Internet address is suntrust.com.\n releases/suntrust-provides-relief-in-wake-of-historic-carolina-floods-300156881.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CL24012&Transmission_Id=201510081448PR_NEWS_USPR_____CL24012&DateId=20151008", "http://www.prnewswire.com/news-releases/suntrust-provides-relief-in-wake-of-historic-carolina-floods-300156881.html", "http://www.xmlnews.org/ns/", "http://www.suntrust.com/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T01:59:12.527+03:00", "highlightTitle": ""}