{"organizations": [], "uuid": "375d47517507a93b0b90cd3ca2878285bfd3cfd7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30217646/national-council-on-teacher-quality-names-wgus-teachers-college-a-best-value", "country": "US", "title": "National Council on Teacher Quality Names WGU's Teachers College a 'Best Value'", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "National Council on Teacher Quality Names WGU's Teachers College a 'Best Value' - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "375d47517507a93b0b90cd3ca2878285bfd3cfd7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30217646/national-council-on-teacher-quality-names-wgus-teachers-college-a-best-value", "ord_in_thread": 0, "title": "National Council on Teacher Quality Names WGU's Teachers College a 'Best Value'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " WGU Washington\nOnline, competency-based university's Teachers College tops list of 1,100 colleges and programs\nSEATTLE , Oct. 8, 2015 /PRNewswire-USNewswire/ -- Western Governors University's (WGU) Teachers College has again earned top honors in the nation, this time for being named the \"best value\" in teacher education by the National Council on Teacher Quality (NCTQ). WGU Washington is the locally-based affiliate of WGU and offers the same, acclaimed student experience.\nWGU's Teachers College rated higher than 1,100 other education programs and schools across the nation. The NCTQ scored the online, competency-based university better on a combination of factors, including quality, affordability, and how well the school prepares future teachers for the realities of the classroom.\nThe ratings are the first of its kind by a national education policy organization. They analyzed undergraduate and graduate programs specializing in elementary or secondary teacher preparation. WGU received an \"A\" grade for its secondary education programs.\nIn addition, the NCTQ has ranked WGU's secondary teacher preparation program as the top program in the nation in terms of quality from a list of 2,400 programs, and WGU was one of only 10 institutions named to the top lists for both elementary and secondary teacher education.\n\"I believe this latest honor from the NCTQ further validates our university's competency-based model,\" said WGU Washington Chancellor Jean Floten . \"Washingtonians with a passion to teach and shape young minds are able to earn a high-quality education – and do so with little or even no debt.\"\nIn addition to their proven quality, WGU's Teachers College programs are affordable. Tuition is only about $6,000 per year. WGU's competency-based learning model allows students to study and learn at their own pace, moving quickly through what they already know so they can focus on what they still need to learn. This allows many students to accelerate their studies, finishing faster, which saves not only time, but money.\nWGU's Teachers College – the largest single provider of STEM educators in the U.S. – boasts more than 2,000 current students and 2,500 graduates in Washington state . Because WGU develops its curriculum in collaboration with educational leaders across the country, WGU graduates are well prepared to teach in today's classrooms. Graduates of WGU's teacher preparation programs can be licensed in all 50 states, and last year, 100% of WGU graduates who applied for teaching licenses were successful.\nFor more information, go to https://washington.wgu.edu/education .\nAbout WGU Washington\nWGU Washington was established by the State Legislature in 2011 in partnership with nationally recognized and accredited Western Governors University to expand access to higher education for Washington residents.\nThe state-endorsed, online university offers more than 50 bachelor's and master's degree programs in Business, Information Technology, Teacher Education and Health Professions, including Nursing. WGU Washington's competency-based learning model is designed to meet the needs of working adults by providing an affordable, flexible option for earning an accredited, respected college degree. It's non-profit and receives no money from the state.\nDegrees are granted under the accreditation of Western Governors University , which is regionally accredited through the Northwest Commission on Colleges and Universities (NWCCU). Teachers College programs are accredited by the National Council for Accreditation of Teacher Education (NCATE) and Nursing programs are accredited by the Commission on Collegiate Nursing Education (CCNE*).\nThe university has earned the support of more than 20 leading corporations and foundations. They include institutions such as AT&T, Bill & Melinda Gates Foundation, Lilly Endowment, HCA, Hewlett-Packard, Lumina Foundation, Microsoft, Oracle, SunGard Higher Education and Zions Bank.\n* One Dupont Circle , NW, Suite 5380, Washington DC 20036, 202-877-6791\nFollow WGU:\nhttp://www.facebook.com/wguwashington\nhttp://www.linkedin.com/companies/western-governors-university\nhttp://twitter.com/wguwashington\nhttp://www.youtube.com/WGUwashington\nContact for media inquiries:\nJake Riddell – Public Relations Manager\n(206) 512-0025\njake.riddell@wgu.edu\nContact for enrollment information:\n877.214.7004\nwashington.wgu.edu\n releases/national-council-on-teacher-quality-names-wgus-teachers-college-a-best-value-300156739.html\n ", "external_links": ["https://washington.wgu.edu/education/online_teaching_degree", "http://washington.wgu.edu/", "http://www.linkedin.com/companies/western-governors-university", "http://www.prnewswire.com/news-releases/national-council-on-teacher-quality-names-wgus-teachers-college-a-best-value-300156739.html", "http://twitter.com/wguwashington", "http://www.xmlnews.org/ns/", "http://www.facebook.com/wguwashington", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC23844&Transmission_Id=201510081225PR_NEWS_USPR_____DC23844&DateId=20151008", "http://www.youtube.com/WGUwashington", "https://washington.wgu.edu/education"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:50:05.702+03:00", "highlightTitle": ""}