{"organizations": [], "uuid": "878710336ca2389ebb336b3ab52691abf6098a55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-afc8ba6f764f3f805d5fd2a191808db5.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/are-both-parties-demonstrating-theyre-incapable-of-governing/article/2573832?custom_click=rss", "country": "US", "title": "Are both parties demonstrating they're incapable of governing?", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Are both parties demonstrating they're incapable of governing? | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:01:00.000+03:00", "replies_count": 0, "uuid": "878710336ca2389ebb336b3ab52691abf6098a55"}, "author": "Michael Barone", "url": "http://www.washingtonexaminer.com/are-both-parties-demonstrating-theyre-incapable-of-governing/article/2573832?custom_click=rss", "ord_in_thread": 0, "title": "Are both parties demonstrating they're incapable of governing?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Important parts of our two great political parties seem bent on demonstrating that their parties are incapable of governing coherently.\nHouse Republican rebels have pushed Speaker John Boehner out the door without advancing a plausible successor and have risked leaving the speaker's chair vacant. Hillary Clinton has backpedaled and flip-flopped to fortify her flagging campaign that she risks making the still most likely Democratic nominee a figure of fun.\nThe House rebels are understandably frustrated after five years in the House majority without as many accomplishments as they'd like. They overlook the four-year flatlining of federal spending obtained by their acceptance of the clumsy sequester limits.\nThey overlook as well the public response to the impasse over the budget — invariably dubbed a \"government shutdown\" — in October 2013. Republicans, as the party of less government and one despised by mainstream media, are invariably blamed for shutdowns. Polling showed the Republicans losing their House majority until they ended the shutdown and the woes of healthcare.gov became apparent.\n  Union membership collapses when workers allowed to exit The decline   Quinn.\nBy Sean Higgins • 10/12/15 12:01 AM Nonetheless frustration grew. The rebels have not only voted against the leadership on key measures (a common occurrence in history) but sought to oust the speaker in mid-term (very uncommon).\nKevin McCarthy's surprise withdrawal from the speaker's race seems to have left no one capable of winning majority support who wants the job. It's possible that Boehner will stay until January 2017, after which the House will no longer face a Democratic president lacking the inclination and ability to compromise and an unusually obdurate Senate Democratic leader.\nIt's also possible that the House Republicans might settle on a new leader acceptable enough to the rebels that their majority — their largest since the 1920s — may hold together on key issues.\nIn that case the current disarray may be as forgotten as the October 2013 shutdown turned out to be in November 2014. But the combination of an unruly field of presidential candidates—with the three who have never held elective office outpolling the 12 who have — and internal turmoil in the House may discredit the party as a governing force.\nUnless Democrats discredit themselves even more in the interim. Which may be happening.\nAlso from the Washington Examiner Skipping the first debate won't put Biden behind CNN said that even if Biden announced on the afternoon of the debate, there would be a spot for him onstage.\nBy Ariel Cohen • 10/12/15 12:01 AM Hillary Clinton was expected to enjoy a stately progress back to the White House, where she worked as first lady or conferred as secretary of state for a dozen years. But the leftward lurch of Democratic voters — at least as pronounced and arguably more politically perilous than the rightward lurch among Republicans — has made the march much less stately.\nBehind in polls in New Hampshire, beleaguered in Iowa, effectively matched in fundraising in the last quarter, Clinton has obviously concluded that she must respond to what initially seemed the quixotic challenge of the 73-year-old socialist Bernie Sanders.\nAnd as her poll numbers fall, the chances increase of a threat from the 72-year-old Vice President Joe Biden. Her response has been to skitter as rapidly as possible to the left on multiple issues from her previous positions and from those of her husband.\nThe problem is that there is no entirely dignified way to change your clothes in public. Democratic primary voters may not fazed by her leftward lurches on gun control, illegal immigrants and the Keystone XL pipeline, though each might hurt her in November.\nMore startling is her switch on the Trans-Pacific Partnership trade agreement just negotiated by the Obama administration. Clinton praised TPP, then being seriously negotiated, 45 times when she was secretary of state, as CNN's Jake Tapper has documented.\nAlso from the Washington Examiner Need a pick me up? Hear the world's leaders praise America \"Americans inspired the world of my own youth,\" said then-Australian Prime Minister Julia Gillard in 2011.\nBy Pete Kasperowicz • 10/12/15 12:01 AM Just last year she praised TPP as the \"gold standard\" of trade agreements. In your probably not dog-eared copy of her 2014 memoir Hard Choices you can read her describing it as \"the signature economic pillar of our strategy in Asia.\"\nHer flip-flop on the issue now comes even as she admits to not knowing the details. \"As of today, I am not in favor of what I have learned about it,\" she told PBS. This is so intellectually threadbare that even the liberal analyst Ezra Klein says she \"is again looking like the kind of candidate who puts polls in front of policy.\"\nThe political calculation is obvious: Pre-empt attacks from Sanders and the Left and isolate Biden, who is supporting TPP, on the right. But it's not the sort of thing that will generate enthusiasm and gin up turnout for a candidacy currently in disarray or respect for a candidate who seems increasingly unserious about governing.\n ", "external_links": [], "published": "2015-10-12T03:01:00.000+03:00", "crawled": "2015-10-12T08:55:06.557+03:00", "highlightTitle": ""}