{"organizations": [], "uuid": "b1847454b67c293d5850e42223b234dd9245f8c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.koco.com", "main_image": "http://www.koco.com/image/view/-/25496058/highRes/2/-/maxh/630/maxw/1200/-/8hmflt/-/Biden--Boston-memorial-service-jpg.jpg", "site_section": "http://www.koco.com/9844974?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.koco.com/politics/firefighters-union-prepping-for-biden/35947194", "country": "US", "title": "Firefighters' union prepping for Biden candidacy", "performance_score": 0, "site": "koco.com", "participants_count": 0, "title_full": "Firefighters' union prepping for Biden candidacy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T07:41:00.000+03:00", "replies_count": 0, "uuid": "b1847454b67c293d5850e42223b234dd9245f8c9"}, "author": "", "url": "http://www.koco.com/politics/firefighters-union-prepping-for-biden/35947194", "ord_in_thread": 0, "title": "Firefighters' union prepping for Biden candidacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Biden"], "text": "Firefighters' union prepping for Biden candidacy Union earlier told Clinton it would support vice president UPDATED 11:41 PM CDT Oct 20, 2015 Photos Pool \nHarold Schaitberger, the president of the International Association of Fire Fighters, said Tuesday he has had additional conversations with Vice President Joe Biden since late last week and that his union is mobilizing for a Biden candidacy. Videos Clinton sent GOP 2016ers copies of... \n\"Our union is preparing as if the vice president is going to announce his candidacy,\" Schaitberger told CNN Tuesday. His union would not undergo such an effort, he added, \"unless (they thought) there was a candidacy.\" \nSchaitberger described Biden as \"thoughtfully and deliberately\" working his way through the decision-making process, but the firefighter union president declined to put a timeline on the vice president's final determination, based on their conversations. \nBiden is looking at the \"financing ... infrastructure\" needed to mount a campaign, Schaitberger added. \nThe union president sought to quell expectations for a speedy decision from Biden, calling timelines described in recent news reports \"not really accurate.\" \nThe International Association of Fire Fighters is one of the most influential labor groups in the U.S. Biden is especially close to labor, which could be a key constituency for him if he seeks the White House. \nEarlier this month, The New York Times reported the firefighters union informed Hillary Clinton's campaign that it had abandoned its plans to endorse the former secretary of state. And in a profile on Friday, the Times reported on Schaitberger's \"close, longstanding relationship\" to Biden, saying he personally lobbied the vice president in 2009 to expand a law that helped avert firefighter layoffs during the Great Recession. \nThis past week, Schaitberger suggested to New York Magazine that if Biden ran, he'd get the union's backing. \nGetting ready for a run \nBiden's associates are setting up interviews for potential staff positions on a Biden presidential campaign, a source familiar with the process told CNN. \nBiden met with his top political advisers Monday night -- the same group he met with at least twice last week. \nAlso last week, Biden made calls throughout the week to ask Democratic operatives and officials to work for him if he does enter the 2016 race, people familiar with the conversations told CNN. \nBiden spoke Monday at a White House summit on climate change -- but he offered no clues about his pending decision. \nHe opened the session, to which he was 10 minutes behind schedule, by calling himself \"the late Joe Biden\" and saying he'd spent the last two hours meeting with President Barack Obama \"on other matters\" -- which he didn't further explain. Treasury Secretary Jack Lew was also scheduled to be in that meeting. \nPennsylvania Democratic Rep. Brendan Boyle, who tweeted Monday morning that he has a source who says Biden will run for president, said he is confident his information is accurate and that an announcement is coming \"very soon.\" \n\"If he didn't run, it would be pulling back from a decision that's already been made,\" Boyle told CNN. The congressman declined to reveal his source but described it as \"very close to the Biden camp.\" \nPolling hasn't shown a groundswell of support for Biden. A CNN/ORC national poll out Monday shows that just 18 percent of Democratic primary voters would back Biden, behind Clinton at 45 percent, and Vermont Sen. Bernie Sanders at 29 percent.", "external_links": [], "published": "2015-10-21T07:41:00.000+03:00", "crawled": "2015-10-21T08:14:31.699+03:00", "highlightTitle": ""}