{"organizations": [], "uuid": "bd922e778f61b5f523976a2361b25bfa1868273e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/08/7957e8df8289768937a7889c4363e0/media:daeeb91b9c7748abba5a1e5793306fd9BaltimorePoliceCommissionerProtests.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/us/articles/2015/10/15/activists-occupy-baltimore-city-hall-oppose-commissioner", "country": "US", "title": "Baltimore City Hall Filled With Protesters Who Oppose New Commissioner", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Baltimore City Hall Filled With Protesters Who Oppose New Commissioner - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "bd922e778f61b5f523976a2361b25bfa1868273e"}, "author": "USNews", "url": "http://www.usnews.com/news/us/articles/2015/10/15/activists-occupy-baltimore-city-hall-oppose-commissioner", "ord_in_thread": 0, "title": "Baltimore City Hall Filled With Protesters Who Oppose New Commissioner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Baltimore Residents Are Not Happy With New Commissioner Police disband sit-in protest at Baltimore City Hall over policing demands, arrests made.\nProtesters are placed into a van by police early Thursday in Baltimore.\nAssociated Press Oct. 15, 2015 | 6:27 a.m. EDT + More By JULIET LINDERMAN, Associated Press\nBALTIMORE (AP) — Baltimore police disbanded an overnight occupation of City Hall by activists opposed to moves to make the city's interim police commissioner permanent, and at least 12 people could be seen being led away early Thursday to police vehicles.\nAt least 25 police officers converged outside the building hours before dawn as activists was still inside from a protest sit-in that erupted Wednesday over numerous demands for better policing. Several of the demonstrators could be seen by an Associated Press reporter as they were led off in plastic handcuffs and loaded into transport vehicles.\n\"It is our duty to fight for our freedom! We have nothing to lose but our chains!\" others watching the police operation shouted at the officers.\nPolice said in a statement posted on their social media site that a small number of protesters had decided to leave after hours of warnings to the demonstrators.\n\"The remaining protesters refused to leave the building. As a direct result of their failure to comply, the remaining protesters have been arrested and charged with trespassing. There are no reported injuries at this time to any protesters or officers,\" the police statement added.\nPolice did not elaborate on the number of people arrested or their identities. A message left for Baltimore Police Department spokesman T.J. Smith wasn't immediately returned.\nFollowing the police operation, police were seen leaving and the complex was largely quiet by 5 a.m.\nSome of those who had left before the arrests said mostly student activists. They said they opposed city deliberations to make permanent the interim appointment of Police Commissioner Kevin Davis, adding they had been given no chance for input and had several other demands.\n\"All we are doing is peacefully demonstrating. We were disrespected by Kevin Davis. He didn't take us seriously,\" said Kevin Wellons, a 19-year-old man who left the sit-in around 3:30 a.m. with several others after protesters received a police warning.\n[ READ: Baltimore Is More Than the Riots ]\nKwame Rose, an organizer who had been with the group for hours, also left with several others before police moved in. Rose said activists will continue opposing moves to permanently appoint Davis to the top police position.\n\"The politicians, they failed us today,\" Rose said of meetings Wednesday that kicked off deliberations on making Davis permanent in his post.\nA City Council subcommittee voted to make Davis the permanent police commissioner. Davis still has to be approved by the full council.\nDavis took the interim role in July after predecessor Anthony Batts was fired amid a spike in violent crime in Baltimore. The spike followed unrest and rioting in April after the death of Freddie Gray, a black man who died after suffering a severe injury in police custody.\nMembers of the Baltimore Uprising coalition, which includes both high school and community activists, had begun shouting from the upper gallery of City Council chambers as a Council subcommittee prepared for its vote Wednesday.\n\"All night, all day, we will fight for Freddie Gray!\" the activists chanted amid calls to postpone the vote. \"No justice, no peace!\" The activists then began their sit-in.\n[ RELATED: Baltimore Residents Speak Up Against the Rioters ]\nThe full council is to vote on the appointment Monday. If approved by the full council, Davis would earn $200,000 a year under a contract to run through June of 2020.\nThree of the subcommittee's five members voted in favor of Davis. Councilman Nick Mosby, who is married to State's Attorney Marilyn Mosby, voted against the confirmation, while Carl Stokes, who is running for mayor, abstained.\nMarilyn Mosby had decided to prosecute six officers in connection with Gray's death. All of the officers are currently awaiting trial. In the aftermath of Mosby's decision and the widespread unrest, homicides began to rise and residents in crime-addled neighborhoods accused police officers of abandoning their posts.\nOne of the demonstrators, Lawrence Brown, said the activists \"really wanted to challenge the coronation process for commissioner Davis and ask some critical questions about how police have handled protests since he's been in charge, and other questions about fairness and equity around policing.\"\nThe protesters said they wanted Davis and Mayor Stephanie Rawlings-Blake to listen to their demands. Among them: that police avoid using military-type equipment such as armored vehicles, and only use riot gear as a last resort to protect officers.\nIn the interest of constitutional rights, the protesters said, they also want officers to always wear badges and name tags.\nAddressing the council subcommittee Wednesday, Davis said that he remains committed to training officers to actively engage and interact with community members. Davis also emphasized his commitment to \"respect and fight for the right for Americans to assemble and peacefully protest.\"\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nThe Report Thank you, your email has been submitted.\nSubscribe to our\nNewsletter Stay informed with exclusive content sent\ndirectly to your inbox.\nTAGS: Associated Press", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe7wm7%3Fsrc=usn_tw&via=usnews&text=Baltimore%20City%20Hall%20Filled%20With%20Protesters%20Who%20Oppose%20New%20Commissioner", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe7wm7%3Fsrc=usn_su", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe7wm7%3Fsrc=usn_fb", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe7wm7%3Fsrc=usn_li&title=Baltimore%20City%20Hall%20Filled%20With%20Protesters%20Who%20Oppose%20New%20Commissioner&summary=Police%20disband%20sit-in%20protest%20at%20Baltimore%20City%20Hall%20over%20policing%20demands%2C%20arrests%20made.%3Cbr%20%2F%3E&source=U.%20S.%20News", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe7wm7%3Fsrc=usn_gp", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe7wm7%3Fsrc=usn_rd&title=Baltimore%20City%20Hall%20Filled%20With%20Protesters%20Who%20Oppose%20New%20Commissioner"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T13:45:12.537+03:00", "highlightTitle": ""}