{"organizations": [], "uuid": "05ea16dabb527d567644eeed2e2c4b4863a67cdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/4a/3a/48fb5bab4c47942b581a3dcb073a/151020-trump-ap-1160.jpg", "site_section": "http://www.politico.com/politics", "section_title": "Politics News, Latest Headlines, Analysis &amp; Opinion - POLITICO", "url": "http://www.politico.com/story/2015/10/donald-trump-no-playboy-214955", "country": "US", "title": "Trump: I think I'll pass on Playboy", "performance_score": 0, "site": "politico.com", "participants_count": 3, "title_full": "Trump: I think I'll pass on Playboy - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T18:52:00.000+03:00", "replies_count": 2, "uuid": "05ea16dabb527d567644eeed2e2c4b4863a67cdc"}, "author": "Ben Schreckinger", "url": "http://www.politico.com/story/2015/10/donald-trump-no-playboy-214955", "ord_in_thread": 0, "title": "Trump: I think I'll pass on Playboy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump may be milking all the free media coverage he can get, but there’s one organization he'll probably pass on — Playboy. Trump told Boston Herald Radio on Tuesday he was recently asked to do an article for the men’s magazine, which recently announced that it would stop publishing nude photos.\n\"Maybe I'll pass,\" he said. “It's not the same Playboy. In those days that was the hottest thing you can do,\" he continued, referring to the 1990 cover story he was featured in.\nWhile he thinks the magazine has changed, the Trump featured in the article was also different, at least with his political affiliation and ambitions.\n“Well, if I ever ran for office, I’d do better as a Democrat than as a Republican — and that’s not because I’d be more liberal, because I’m conservative,” Trump said in the 1990 article. “But the working guy would elect me. He likes me. When I walk down the street, those cabbies start yelling out their windows.”\nRNC breaks record with fundraising haul By Nick Gass\nTrump also said back then that he had no intentions of running for political office.\n“I would hate to think that people blame me for the problems of the world. Yet people come to me and say, ‘Why do you allow homelessness in the cities?’ as if I control the situation. I am not somebody seeking office,” he said in the story.\nBut he did leave room to make America great again, even 25 years ago.\n“I don’t want to be President. I’m 100 percent sure. I’d change my mind only if I saw this country continue to go down the tubes,” Trump said in 1990.\nAnd it seems he believes it has.\nOn Tuesday he told the hosts of Boston Herald Radio that today's America is “worse now than I’ve ever seen.” He also said that his business has “tremendous cash flow” and is able to be run by his children so he has time to campaign.\n<div", "external_links": [], "published": "2015-10-20T18:52:00.000+03:00", "crawled": "2015-10-20T18:06:59.545+03:00", "highlightTitle": ""}