{"organizations": [], "uuid": "a56be6a02196662bd0aeab054a9cf972c97a2aef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://voxy.co.nz//politics/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/focus-working-others-successful-year-council/5/233317", "country": "US", "title": "Focus on working with others in successful year for council", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Focus on working with others in successful year for council", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T06:51:00.000+03:00", "replies_count": 0, "uuid": "a56be6a02196662bd0aeab054a9cf972c97a2aef"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/focus-working-others-successful-year-council/5/233317", "ord_in_thread": 0, "title": "Focus on working with others in successful year for council", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Thursday, 1 October, 2015 - 15:51 \nWaikato Regional Council has signed off on a successful year in which it achieved more than 90 per cent of its performance targets and delivered a total surplus of $702,000. \nThe results were noted during yesterday’s adoption of the council’s 2014/15 Annual Report, which highlights the work the council has done with others to build a Waikato region that has a healthy environment, strong economy and vibrant communities. \n\"We know that it's through the strength of our partnerships with others that we can make real gains, particularly around land and water, coastal and marine, and regional development, and this is reflected in the work that’s been done,\" council chairperson, Paula Southgate. \n\"Over the year we’ve continued to build on existing relationships to maximise the opportunities for the Waikato region,\" said Cr Southgate said. \nPartnerships have been particularly important for projects such as: \n- Healthy Rivers: Plan for Change/Wai Ora: He Rautaki Whakapaipai to improve the health of the Waikato and WaipÄ rivers \n- WaipÄ Catchment Plan \n- Sea Change - Tai Timu Tai Pari to safeguard the Hauraki Gulf \n- Waikato Mayoral Forum’s economic development strategy \n- Graham’s Creek flood mitigation works. \n\"It’s also been an exciting year for the council’s talented staff, many of whom are specialists in their field and have hard their leadership, hard work and innovation rewarded,\" she said. \nFor example, Green Ribbon Awards were won in June for our role in leading the clean-up of the contaminated Tui Mine site on Mount Te Aroha, as well as the innovative CarpN Neutral project. This project mainly targets the pest fish koi carp, which contribute to declining water quality in the region. \nOther highlights of 2014/15 include: \n- 78.4km of fencing completed in priority catchments and significant natural areas \n- 1374 sites monitored for environmental data, including water and air quality, geothermal and rainfall \n- 42,542 native dune plants planted by volunteers at 18 of 24 beachcare sites on the Coromandel Peninsula and region’s west coast \n- 1732 resource consents processed and 9693 resource consents administered \n- 86 heating appliances replaced in Tokoroa \n- $214,440 granted to boost 10 community initiatives contributing positive environmental outcomes. \nThe council achieved 92 per cent of its performance targets, compared with 88.2 per cent in 2013/14, and delivered an operating surplus for the year. After transfers to reserves and allowing for carryover of funds to finish works started but not finished last year, the surplus provides unallocated funds of $702,000. \nThese positive budget results reflect a wide variety of factors, including an ongoing focus on controlling and reducing costs, salary savings due to staff vacancies, and additional interest income from the council’s investments. \nDuring the 2014/15 financial year, the council’s investment fund returned 9.1 per cent before inflation and fees, 0.3 per cent above benchmark. That means the council has exceeded its long term investment objective of 4 per cent after inflation and fees, with the investment return over 10 years being 4.6 per cent. \n ", "external_links": [], "published": "2015-10-01T06:51:00.000+03:00", "crawled": "2015-10-01T07:25:52.661+03:00", "highlightTitle": ""}