{"organizations": [], "uuid": "0a4a5c5256017a0d0234f65c66f4093ee81daa15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30328367/national-organization-for-rare-disorders-nord-releases-first-ever-state-progress-report-for-rare-diseases", "country": "US", "title": "National Organization for Rare Disorders (NORD) Releases First-Ever State Progress Report for Rare Diseases", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "National Organization for Rare Disorders (NORD) Releases First-Ever State Progress Report for Rare Diseases - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "0a4a5c5256017a0d0234f65c66f4093ee81daa15"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30328367/national-organization-for-rare-disorders-nord-releases-first-ever-state-progress-report-for-rare-diseases", "ord_in_thread": 0, "title": "National Organization for Rare Disorders (NORD) Releases First-Ever State Progress Report for Rare Diseases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " National Organization for Rare Disorders (NORD)\nLeading Advocacy Organization Drives Health Policy Improvements for 30 Million Americans with Rare Diseases through Rare Action™ Network\nWASHINGTON , Oct. 22, 2015 /PRNewswire-USNewswire/ -- With patient access to health care becoming increasingly dependent upon state policies, the National Organization for Rare Disorders (NORD)® has developed and released the first-ever State Progress Report to evaluate how states are serving the 30 million Americans with rare diseases.\n\"By creating the State Progress Report, NORD hopes to provide a road map of where states can improve to help people living with rare diseases,\" said NORD President and CEO Peter L. Saltonstall . \"Until now, there has been no comprehensive resource to help make sense of the inconsistencies between states.\"\nIn its initial release, the State Progress Report focuses on four key policy areas: medical foods coverage, prescription cost sharing requirements, newborn screening, and Medicaid eligibility levels. The 65-page document contains an executive and national summary, key policy sections, detailed appendices with state-by-state breakdowns, maps, contacts and resources.\nThe report is also a toolkit that provides resources for stakeholders to advocate on these issues. This includes NORD's Rare Action™ Network, its grassroots advocacy community that connects advocates and gives them the tools to support the rare disease community in their state. The progress report offers information on how to sign up for Rare Action and a list of local contacts.\n\"This is a first step,\" said NORD Associate Director of State Policy Tim Boyd . \"As expected, there is not a one-size-fits-all approach to addressing many of these issues; however, we aim to provide actionable steps for states that will make meaningful improvements in people's lives.\"\nThe report will launch with a dedicated page on the NORD website with patient stories, downloadable toolkit with action alerts, and maps.\nSaltonstall added, \"For more than 33 years, NORD has worked passionately to resolve the unmet medical needs of the 30 million Americans with rare diseases. The State Progress Report is part of our commitment to make sure the voice of rare disease patients is heard.\"\nNORD announced the State Progress Report at its annual Rare Diseases and Orphan Products Breakthrough Summit, the largest multi-stakeholder rare disease conference and the only one co-sponsored by the U.S. Food & Drug Administration (FDA).\nFor more information about NORD and how to get involved with the rare disease community please visit www.rarediseases.org .\nAbout the National Organization for Rare Disorders (NORD)®\nEstablished in 1983, the National Organization for Rare Disorders (NORD) ® is the largest rare disease organization in the U.S. and the leading independent nonprofit representing all patients and families affected by rare diseases. NORD is committed to the identification, treatment and cure of all 7,000 rare diseases that affect 30 million Americans, or 1 in every 10 people. NORD provides programs of advocacy, education, research, and patient and family services to improve the lives of all people living with rare diseases. NORD represents more than 230 disease-specific member organizations and collaborates with many other organizations in specific causes of importance to the rare disease patient community. Join NORD at www.rarediseases.org/ and on Twitter at @RareDiseases .\nLogo - http://photos.prnewswire.com/prnh/20110719/DC37656LOGO-b\n releases/national-organization-for-rare-disorders-nord-releases-first-ever-state-progress-report-for-rare-diseases-300164905.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "https://twitter.com/RareDiseases", "http://photos.prnewswire.com/prnh/20110719/DC37656LOGO-b", "http://photos.prnewswire.com/prnvar/20110719/DC37656LOGO-b", "http://www.rarediseases.org/", "http://www.prnewswire.com/news-releases/national-organization-for-rare-disorders-nord-releases-first-ever-state-progress-report-for-rare-diseases-300164905.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC36152&Transmission_Id=201510221500PR_NEWS_USPR_____DC36152&DateId=20151022"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T23:10:50.418+03:00", "highlightTitle": ""}