{"organizations": [], "uuid": "1ec24adac1cf28c4e4abd10b01e2ec58bf454110", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-e2ea4d3fbe8f57af70053e618d6f38a6.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/boehners-bucket-list-find-a-speaker-solve-fiscal-train-wreck/article/2574255?custom_click=rss", "country": "US", "title": "Boehner's bucket list: Find a speaker, solve fiscal train wreck", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Boehner's bucket list: Find a speaker, solve fiscal train wreck | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:01:00.000+03:00", "replies_count": 0, "uuid": "1ec24adac1cf28c4e4abd10b01e2ec58bf454110"}, "author": "Susan Ferrechio", "url": "http://www.washingtonexaminer.com/boehners-bucket-list-find-a-speaker-solve-fiscal-train-wreck/article/2574255?custom_click=rss", "ord_in_thread": 0, "title": "Boehner's bucket list: Find a speaker, solve fiscal train wreck", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's increasingly likely that House Speaker John Boehner will be stuck one last time playing the lead role in negotiating a major budget deal and debt ceiling increase in the coming weeks, despite his hopes of retiring on Oct. 30.\nCongress returns to work on Oct. 19, leaving lawmakers six weeks to find an agreement to fund the government, two weeks to strike a deal to raise the nation's debt limit, and 11 days to find a way to pay for federal highway projects.\nWith Majority Leader Kevin McCarthy's abrupt withdrawal from the race to replace Boehner, and indecision from Ways and Means Chairman Paul Ryan about whether he wants the job, Boehner is in no position to ease himself out of the role of speaker as Congress hurtles toward three critical deadlines.\n\"He's going to stay on until we elect a new speaker.\" House Appropriations Committee Chairman Hal Rogers, R-Ky., said, when asked about Boehner's plans to retire. \"It does make it more difficult to deal with these issues. A lot of important issues are coming through at the same time, so time is of the essence.\"\n  Bush and Rubio squabble while Trump runs away with it After Bush announced his fundraising total, his campaign started a spat with Rubio over who did better.\nBy Byron York • 10/16/15 6:19 AM Even as he implores Ryan to take over, there's still some major lifting to do, but Boehner has so far revealed little about his plans to deal with the debt ceiling or the budget. The government is currently funded through Dec. 11 and parties are hoping to reach a budget plan that would allow Congress to pass a spending bill for the rest of the current fiscal year.\nThere's been little progress so far on a budget deal. Still, Boehner is working on it, and members are hoping some agreement can be struck soon that informs Congress how much it can spend for the remainder of fiscal 2016.\nThe fight over the debt ceiling is also somewhat linked to the broader fiscal talks, and that deadline is much closer, almost ensuring that Boehner will have to help resolve that matter.\nTreasury Secretary Jacob Lew added urgency to the debt ceiling deadline on Thursday by moving the date that the nation's borrowing power expires from Nov. 5 to Nov. 3.\n\"At that point, we expect Treasury would be left with less than $30 billion to meet all of the nation's commitments,\" Lew said in a letter to Congress, \"an amount far short of net expenditures on certain days, which can be as high as $60 billion.\"\nAlso from the Washington Examiner RNC chair: GOP will be 'cooked' as national party with 2016 loss The Republican Party has become a \"a midterm party\" that struggles with the presidential elections.\nBy Al Weaver • 10/16/15 12:01 AM Boehner has long said he won't let the government close due to lack of funding, signaling that he'd green light a debt ceiling increase. With a budget deal no where in sight yet, he is thought to be prepared to move a standalone debt ceiling bill, which would pass with a mix of Democratic and Republican votes.\nThat vote is likely to be Boehner's last major floor battle with conservative Republicans, who have opposed past efforts to raise the debt ceiling without some new commitment to reduce spending. On the other side are Democrats, who have said any debt ceiling legislation \"must be clean,\" meaning it cannot include provisions Democrats oppose, such as spending cuts.\n\"The Speaker has made it clear that he wants to solve some outstanding issues before he leaves,\" a Boehner spokeswoman said. \"No decisions have been made, but a resolution on the debt ceiling is certainly possible.\"\nA highway funding deadline, meanwhile, is also headed Boehner's way.\nHouse lawmakers plan to unveil legislation on Friday authorizing the highway trust fund for several years. But the bill remains incomplete ahead of an Oct. 29 deadline — the day before Boehner's hopeful retirement date — because the bill does not yet include language authorizing how the federal government would pay for the cost.\nAlso from the Washington Examiner Who is winning the GOP money race? Following the release of third quarter figures, the campaigns try to spin the reports.\nBy David M. Drucker • 10/16/15 12:01 AM It's likely that the House and Senate will be forced to pass a short-term patch to keep highway projects funded while the House tries to pass its own legislation and work out a deal with the Senate.\nGiven the lack of a obvious replacement, Boehner is likely to be overseeing the highway bill as well, something his members keep reminding him about. \"He has an obligation to remain here until we elect a new speaker,\" Rogers said.\nTop Story RNC chair: Republicans are 'cooked' if defeated in 2016 The Republican Party has become a \"a midterm party\" that struggles with the presidential elections.\nBy Al Weaver • 10/16/15 12:01 AM", "external_links": [], "published": "2015-10-16T03:01:00.000+03:00", "crawled": "2015-10-16T14:32:47.051+03:00", "highlightTitle": ""}