{"organizations": [], "uuid": "e93f4ad7a957e50b0a95e6ea8a29bf05e0b9796f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-cf3dd3fb3592bee4dfe44f074762aae2.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/rubio-sharing-economy-is-a-miracle-only-the-u.s.-could-create/article/2573487?custom_click=rss", "country": "US", "title": "Rubio: 'Sharing economy is a miracle only the U.S. could create'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Rubio: 'Sharing economy is a miracle only the U.S. could create' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T14:49:00.000+03:00", "replies_count": 0, "uuid": "e93f4ad7a957e50b0a95e6ea8a29bf05e0b9796f"}, "author": "Gabby Morrongiello", "url": "http://www.washingtonexaminer.com/rubio-sharing-economy-is-a-miracle-only-the-u.s.-could-create/article/2573487?custom_click=rss", "ord_in_thread": 0, "title": "Rubio: 'Sharing economy is a miracle only the U.S. could create'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Florida Sen. Marco Rubio said Tuesday that pioneers of the sharing economy like Uber and AirBnB are remarkably unique to the United States.\n\"The on-demand economy is a miracle that only American free enterprise could produce,\" the Republican presidential hopeful told supporters at Civic Hall in New York City.\n\"That's why it's so shameful that the biggest obstacle to the growth of this platform is our very own government,\" he added.\nRubio, who is fourth in the Washington Examiner's presidential power rankings , extolled a recent start-up company called Handy that connects consumers with home service professionals through an easy-to-use online, or mobile, interface. Had the growing company been around when his mother worked as a maid, Rubio said she would have had \"complete control over her financial life.\"\n  N.Y. Times, USA Today take Obama's advice to 'politicize' shooting The New York Times and USA Today hit lawmakers in Congress for failing to pass new gun-restriction laws.\nBy Eddie Scarry • 10/06/15 11:23 AM \"Professionals who use Handy earn an average of $18 an hour, which is more than the typical worker in the field,\" the Florida senator said. \"Best of all, they set their own hours, checking into the app whenever they have time to take on a job and signing out when they have other obligations.\"\nHe continued, \"innovations like Handy are part of the reason I'm so optimistic about not only saving the American Dream in this century, but actually expanding it to reach more people than ever before.\"\nMinutes after Rubio finished his speech Tuesday, the Democratic National Committee accused the Florida Republican of promoting policies that \"simply don't align with the modern world.\"\n\"Marco Rubio likes to display many shiny objects, but his presentation today is full of empty rhetoric and policies that will fail our country,\" DNC spokeswoman Christina Freundlich wrote in an email to press.\nRubio has risen to fourth place in the GOP field with 9.5 percent support, according to the latest RealClearPolitics polling average. \nAlso from the Washington Examiner Democrats: Turn up heat on producer of Planned Parenthood videos Lawmakers on tne House Oversight panel want to force David Daleiden to turn over materials.\nBy Paige Winfield Cunningham • 10/06/15 11:16 AM During an appearance on CNN Monday, Patti Solis Doyle, a long-time aide and former campaign adviser to Hillary Clinton, described Rubio as \"inspirational.\" Doyle also said she views him as the biggest threat to Democratic front-runner Clinton in a general election matchup.\nTop Story Russia threatens energy security: Moniz The energy secretary said Russia's intervention in Syria could raise energy prices and interrupt supplies.\nBy John Siciliano • 10/06/15 12:13 PM", "external_links": [], "published": "2015-10-06T14:49:00.000+03:00", "crawled": "2015-10-06T19:35:32.350+03:00", "highlightTitle": ""}