{"organizations": [], "uuid": "98d6f35298686b7be5e704b96bb64e7e6324e050", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.channel3000.com", "main_image": "http://www.channel3000.com/image/view/-/17077032/highRes/2/-/maxh/640/maxw/640/-/g53cb3/-/Paul-Ryan-campaigns-in-Iowa-jpg.jpg", "site_section": "http://www.channel3000.com/103182?format=rss_2.0&view=feed", "section_title": "Local Political News", "url": "http://www.channel3000.com/news/politics/house-republicans-asks-can-anyone-lead-us/35766646", "country": "CH", "title": "House Republicans asks: Can anyone lead us?", "performance_score": 0, "site": "channel3000.com", "participants_count": 0, "title_full": "House Republicans asks: Can anyone lead us?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:00:00.000+03:00", "replies_count": 0, "uuid": "98d6f35298686b7be5e704b96bb64e7e6324e050"}, "author": "", "url": "http://www.channel3000.com/news/politics/house-republicans-asks-can-anyone-lead-us/35766646", "ord_in_thread": 0, "title": "House Republicans asks: Can anyone lead us?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Ryan"], "text": "Paul Ryan reiterates he's not interested in being speaker \nAfter two tumultuous weeks that saw the current speaker announce his resignation and his heir apparent abruptly pull out of the running, House Republicans are in disarray as they confront a leadership vacuum. And the only person widely deemed fit to fill it is a lawmaker who says he doesn't want to, Wisconsin Rep. Paul Ryan, chairman of the House Ways and Means Committee and the party's 2012 vice presidential nominee. \nEven as they plead with Ryan to reconsider, Republicans are left asking themselves whether anyone can lead them. And even if Ryan does yield to their entreaties, some question whether even he could tame a House GOP that seems fractured beyond repair, with a \"hell no\" caucus ready to risk crises and government shutdowns to achieve its goals and establishment-minded lawmakers seemingly powerless to do anything about it. \n\"It is bad,\" said Rep. Peter King, R-N.Y. \"We cannot allow 35 or 40 people to hijack the party and blackmail the Congress. We have to get things done.\" \nOn Friday, lawmakers left Washington in confusion and discord to head home to their districts for a weeklong recess. Ryan returned to Janesville, Wisconsin, to his wife and young family to turn over his options, with leading Republicans inside Congress and out urging him to step up for the good of the party. \nBefore the House adjourned, outgoing Speaker John Boehner of Ohio, who'd intended to leave Congress Oct. 30, assured lawmakers he would stay on until a replacement can be selected. When that will happen is uncertain, but Boehner urged Republicans to find a way out of their turmoil together. \n\"This institution cannot grind to a halt,\" he said at a closed-door meeting according to an account provided by someone in the room. \"It's up to the people in this room to listen to each other, come together and figure this out. Time for us to take the walls down, open up our ears and listen to each other.\" \nYet by announcing he would resign rather than face a tea party-backed floor vote to depose him, Boehner conceded that the fight to lead the House was one he could not win. And within days of his announcement, the same bloc of compromise-averse hardliners who'd pushed him out derailed his No. 2, Majority Leader Kevin McCarthy. McCarthy withdrew from the speaker's race at the last possible moment on Thursday, as it became clear he would struggle for the needed majority on the House floor. \nLawmakers were left to fret that whoever becomes speaker next — whether Ryan or someone else — could simply end up the latest victim of a corrosive dynamic that forced a government shutdown two years ago in a failed attempt to end President Barack Obama's health care law. That dynamic has caused crisis after crisis ever since. \nMajor challenges await whoever does move into the job, including a fight over raising the debt ceiling and must-pass spending legislation in early December that hardliners hope to use to cut funding for Planned Parenthood, which would risk another shutdown. \n\"No matter who we put in that chair is going to have to figure out a way to change the political dynamic,\" said Rep. Charlie Dent, R-Pa. \"That is a much harder question.\" \nIt's all happening at a moment when House Republicans enjoy their biggest majority in 80 years and control of the Senate, platforms they hoped to use to set out a responsible governing agenda to show voters the GOP deserves to be returned to the White House. \nYet amid the muddle, some members of the rank-and-file saw signs of hope that the leadership collapse and attendant soul-searching could somehow result in a more open House GOP with a bigger role for all. Hardliners routinely complain loudly about being shut out of the process, but those are complaints that some of the more establishment-minded lawmakers share. \nThird-term Rep. Scott Rigell of Virginia offered one example, complaining that he had proposed instituting an hourlong annual ethics training for lawmakers but could not get agreement, even though such a policy is routine at major corporations. \n\"There's just this reluctance to change anything, and so I think this is cathartic in a way,\" Rigell said. \"I really think we'll get through this.\" \nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-10T18:00:00.000+03:00", "crawled": "2015-10-11T00:46:05.232+03:00", "highlightTitle": ""}