{"organizations": [], "uuid": "b924767064d28cb5f78f86ab240751174ece4214", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "", "site_section": "http://www.fox8live.com/category/13571/political-news?clienttype=rss", "section_title": "FOX 8 News WVUE-TV - Political - Headline", "url": "http://www.fox8live.com/story/30300358/potential-delay-on-some-upgrades-to-govt-insurance-site", "country": "US", "title": "Potential delay on some upgrades to gov't insurance site", "performance_score": 0, "site": "fox8live.com", "participants_count": 0, "title_full": "Potential delay on some upgrades to gov't insurance site", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:13:00.000+03:00", "replies_count": 0, "uuid": "b924767064d28cb5f78f86ab240751174ece4214"}, "author": "", "url": "http://www.fox8live.com/story/30300358/potential-delay-on-some-upgrades-to-govt-insurance-site", "ord_in_thread": 0, "title": "Potential delay on some upgrades to gov't insurance site", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Potential delay on some upgrades to gov't insurance site By RICARDO ALONSO-ZALDIVARAssociated Press \nWASHINGTON (AP) - With sign-up season starting in less than two weeks, the Obama administration indicated on Monday that some long-awaited upgrades to the government's health insurance website could take more time before they're customer-ready. \nAt issue is a new doctor look-up tool for HealthCare.gov, as well as another feature that would allow consumers to find out whether a particular health plan covers their prescription drugs. Up to now, digging out that information has required additional steps. \nLori Lodes, communications director for the agency that runs the health care program, said those online improvements will be ready to launch soon, but she would not commit to a specific date. \nThe insurance industry says ongoing testing uncovered some problems with accuracy. \n\"Right now, we are working closely with the insurance companies to make sure their data is accurate and validated and to identify and fix any potential issues,\" Lodes said in a statement. \"When we are confident that the data provided by the insurers gives consumers the information they need to choose the right plan, we'll be ready to launch.\" \nOpen enrollment for 2016 starts Nov. 1 and runs through Jan. 31. Insurers were required to provide the data by Oct. 1. Industry officials say the government left too little time for testing. The administration says it has extended the testing period, and insurers need to submit their data in the correct format. \nAnother consumer-friendly upgrade - a cost estimator - apparently won't be delayed. \nThe administration has set a goal of 10 million paying customers by the end of next year in the health law's insurance markets, which offer taxpayer-subsidized private plans to people who don't have access to job-based coverage. \nBy allowing a delay, the administration may spare itself some embarrassment if the promised online improvements had turned out to have bugs. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. US appeals court upholds gun laws after Newtown massacre Gun control laws passed in New York and Connecticut to ban possession of semi-automatic weapons and large-capacity magazines were mostly upheld Monday by a federal appeals court. more>> Gun control laws passed in New York and Connecticut to ban possession of semi-automatic weapons and large-capacity magazines after the 2012 massacre at Sandy Hook Elementary School were mostly upheld Monday by a federal... more>> Baltimore police commissioner must lead city still reeling If confirmed as the permanent police commissioner for Baltimore, Kevin Davis will be tasked with ushering a city still reeling from protests, rioting and a record-breaking spike in violence through one of the most... more>> Now confirmed as the permanent police commissioner for Baltimore, Kevin Davis is tasked with ushering a city still reeling from protests, rioting and a record-breaking spike in violence through one of the most high-profile... more>> Activist hopes convention suicide leads to more awareness An Alaska suicide-prevention activist is hoping a man's very public suicide at an Alaska Native conference will propel people across the state to reach out to others who may be hurting, she said Monday. more>> An Alaska suicide-prevention activist is hoping a man's very public suicide at an Alaska Native conference will propel people across the state to reach out to others who may be hurting, she said Monday. more>> Demo contractor convicted in Philadelphia building collapse A demolition contractor charged in the deaths of six people buried in debris from a Philadelphia building collapse has been found guilty of involuntary manslaughter. more>> A cut-rate demolition contractor was found guilty of manslaughter Monday, more than two years after a towering wall fell on a busy thrift store, killing six people. more>> Family stays hopeful in search for man swept away in flood Richard Harvell saw the mud and water coming and knew he had to get out of the flash-flood zone where he'd been camping at the foot of the Tehachapi Mountains. more>> Richard Harvell saw the mud and water coming and knew he had to get out of the flash-flood zone where he had been camping at the foot of the Tehachapi Mountains. more>> 1025 S. Jefferson Davis Pkwy.New Orleans, LA 70125", "external_links": [], "published": "2015-10-20T08:13:00.000+03:00", "crawled": "2015-10-20T08:27:51.939+03:00", "highlightTitle": ""}