{"organizations": ["Triad Capital Partners", "Facebook Email Twitter Google", "Facebook Murray"], "uuid": "597b6f6c21920f5fcfe5c77b1601434edbf2fd7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.king5.com", "main_image": "http://cdn.tegna-tv.com/-mm-/eb26092b061a4274829c266e86619afcbb171e4f/c=0-245-638-606&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/14/NWGroup/KING/635804260349891155-CitySquareProperty.jpg", "site_section": "http://rssfeeds.nwcn.com/_/20/105288022/nwcn/politics", "section_title": "NWCN - Politics", "url": "http://www.king5.com/story/news/politics/city/2015/10/14/murray-city-wont-move-forward-triad-after-blackmail-allegations/73930500/", "country": "US", "title": "Murray: City won't move forward with Triad after 'blackmail' allegations", "performance_score": 0, "site": "king5.com", "participants_count": 0, "title_full": "Murray: City won't move forward with Triad after 'blackmail' allegations", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:28:00.000+03:00", "replies_count": 0, "uuid": "597b6f6c21920f5fcfe5c77b1601434edbf2fd7d"}, "author": "", "url": "http://www.king5.com/story/news/politics/city/2015/10/14/murray-city-wont-move-forward-triad-after-blackmail-allegations/73930500/", "ord_in_thread": 0, "title": "Murray: City won't move forward with Triad after 'blackmail' allegations", "locations": ["Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Murray", "Jon Grant"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Murray: City won't move forward with Triad after 'blackmail' allegations Mayor Murray said he doesn't want to move forward with Triad Capital Partners in light of Jon Grant's allegations. Post to Facebook Murray: City won't move forward with Triad after 'blackmail' allegations Mayor Murray said he doesn't want to move forward with Triad Capital Partners in light of Jon Grant's allegations.  //www.king5.com/story/news/politics/city/2015/10/14/murray-city-wont-move-forward-triad-after-blackmail-allegations/73930500/   Join the Conversation To   Murray: City won't move forward with Triad after 'blackmail' allegations KING 5 News, KING5.com 10:28 a.m. PDT October 14, 2015 Site of the Civic Square project in Seattle (Photo: Natalie Brand / KING) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nSeattle Mayor Ed Murray said Wednesday that he does not want to move forward with Triad Capital Partners in the development of the Civic Square project in light of Position 8 Seattle City Council candidate Jon Grant's allegations . \nGrant claimed that the local developer offered to \"make a $200,000 negative Independent Expenditure go away,\" if Grant helped them resolve a lawsuit involving the $400 million Civic Square project across from City Hall. \nGrant served as director of the Tenants Union when the suit was filed against Triad Capital Partners; the case remain in the appeals process. \nGrant left the Tenants Union to challenge Council President Tim Burgess for one of the at-large seats. \nThe city's contract with Triad expires at end of December. Seattle City Attorney Pete Holmes is evaluating the city's next steps. Murray said he will not renew contract and doesn't want to engage in business with developers who don't represent Seattle values. \nGrant said Murray's decision gave the city a chance to \"take a fresh look on how best to use its public land.\" \nStatement from Jon Grant: \nI would like to thank Mayor Murray for his decision today to end the city's relationship with Triad Capital. I would also like to thank the tenants who have been involved in this struggle and for having the courage to demand more affordability from developers. Now the city can take a fresh look on how best to use its public land, and if elected I would push for the maximum amount of affordable housing rather than the million dollar condos that were originally planned.", "external_links": [], "published": "2015-10-14T20:28:00.000+03:00", "crawled": "2015-10-14T20:37:23.190+03:00", "highlightTitle": ""}