{"organizations": [], "uuid": "8f58b8d5b40ab20ab4974e3befbd90642983f426", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww2.hdnux.com/photos/41/60/42/8849541/7/rawImage.jpg", "site_section": "http://www.seattlepi.com/national/us/", "section_title": "U.S.: Politics, Crime, Weather and More - seattlepi.com", "url": "http://www.seattlepi.com/news/world/articleGallery/The-Latest-Fire-breaks-out-at-a-polling-station-6589135.php", "country": "US", "title": "Latest: Poland's expected PM: Will stay close to the people", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Latest: Poland's expected PM: Will stay close to the people - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "8f58b8d5b40ab20ab4974e3befbd90642983f426"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/world/articleGallery/The-Latest-Fire-breaks-out-at-a-polling-station-6589135.php", "ord_in_thread": 0, "title": "Latest: Poland's expected PM: Will stay close to the people", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WARSAW, Poland (AP) — The latest news as Poles vote in a parliamentary election. All times local:\n11:20 p.m.\nPolish lawmaker Beata Szydlo says she will be the country's next prime minister if official results confirm an exit poll showing a decisive win for her conservative Law and Justice party.\nThe 58-year-old Szydlo ran as the party's candidate, but there had been speculation that party chairman Jaroslaw Kaczynski might end up taking that job for himself.\nAn exit poll shows that Law and Justice took 39 percent of the vote Sunday, which would translate into a comfortable majority of 242 votes in the 460-seat lower house of parliament. Official results are expected Monday.\nSzydlo vowed that Law and Justice would remain close to the people as it guides Poland over the next four years.\nShe says \"we are the same as our countrymen. ... We must always remember that we are serving.\"\n___\n10:55 p.m.\nTwo new political forces will be entering Poland's next parliament, according to an exit poll: a group led by a nationalist right-wing rock star, Pawel Kukiz, and a pro-business party led by an economist, Ryszard Petru .\nThe poll says Kukiz won 9 percent of the vote Sunday. If the results are confirmed, it would translate to 44 seats in the 460-seat lower house of parliament. Kukiz is an anti-establishment figure who attracted many frustrated with the status quo.\nPetru's party, Modern Poland, won 7 percent and would get 22 seats. He took some votes away from Civic Platform, a pro-business party that governed for eight years but lost Sunday's election amid voter disillusionment with scandals.\nAn energetic professional who used to work at the World Bank , Petru appealed to young urban Poles. Among his proposals is a lower flat tax of 16 percent on personal income, corporations and as a sales tax.\n___\n10:10 p.m.\nFor the first time in Poland's post-communist history, no left-wing forces have won enough votes to enter into parliament.\nAmid a decisive shift to the right, Poles elected a new parliament Sunday that will not include the Democratic Left Alliance , the heir to the former communists, or any other parties on the left.\nThat is the prediction of an Ipsos exit poll, and must still be confirmed by official results. The exit poll shows that only five parties gained enough votes to make it into parliament: the conservative Law and Justice party; the centrist Civic Platform; a right-wing party led by rock star Pawel Kukiz; the new pro-business party Modern Poland and the Polish Peasants Party .\nTwo left-wing forces had been in the running: United Left , a coalition of several parties, and a new party, Together.\n___\n9:55 p.m.\nJaroslaw Kacyznski , the leader of Poland's conservative Law and Justice party, has declared victory in the country's parliamentary election and has credited his late brother, President Lech Kaczynski , for the party's strong showing.\nLech Kaczynski died in a plane crash in Russia in 2010 along with many other top Polish officials. For a time, the two brothers had governed the country together, with Jaroslaw as prime minister and Lech as president.\nOn Sunday night, Jaroslaw Kacyznski recalled his brother's \"total dedication to Poland\" and said \"I think that without him we would not be here.\"\nHe also said his party would govern the country with humility despite its decisive win.\n___\n9:15 p.m.\nPolish Prime Minister Ewa Kopacz has conceded defeat after an exit poll showed that her pro-European Civic Platform party faced a decisive defeat by the right-wing Law and Justice party.\nThe exit poll by Ipsos shows that Law and Justice won 39.1 percent of Sunday's parliamentary vote. If confirmed by official results, which are expected Monday, that would give Law and Justice 242 seats in the 460-seat lower house of parliament, allowing it to govern alone.\nThat would mark the best showing yet for the party in a parliamentary election.\nAccording to the exit poll, Civic Platform would get 133 seats and only three other parties would make it into parliament: a party led by rock star Pawel Kukiz, a new pro-business party named Modern Poland and the Polish Peasants Party.\n___\n9:05 p.m.\nAn exit poll shows that the conservative Law and Justice party has won the parliamentary election in Poland with 39.1 percent of the vote.\nThe exit poll by the Ipsos agency shows that Civic Platform, the pro-business and centrist party that has governed for the past eight years, took only 23.3 percent in Sunday's vote.\nIf the exit poll is confirmed by official results, it would mark the first time Law and Justice will govern this central European nation of 37 million people since 2007. Lawmakers are elected for four-year terms.\nOfficial results are expected Monday.\n___\n7:30 p.m.\nAuthorities say nearly 39 percent of eligible voters had cast ballots in Poland's general election by late afternoon, with four hours of voting left to go.\nSylwester Marciniak , an official with the State Electoral Commission , said more than 11.7 million of Poland's 30.9 million eligible voters had cast their ballots by 5 p.m. on Sunday.\nExit polls and preliminary turnout are expected when the polls close at 9 p.m. local time (2000 GMT.)\nOpinion polls have consistently showed the conservative opposition Law and Justice party ahead of the ruling Civic Platform party.\n___\n3:35 p.m.\nAuthorities say 16.47 percent of eligible voters had cast their votes in Poland's general election at noon.\nThe head of the State Electoral Commission, Wojciech Hermelinski , says that 4.9 million of Poland's 30.9 million eligible voters had cast their ballots by noon on Sunday, in the voting for 460 Parliament members and 100 Senators.\n___\n11:05 a.m.\nVoters in Warsaw are voicing criticism of the establishment while declaring support for an array of new, small right- and left-wing parties.\nRetired physicist Adam Jadacki and his wife, Janina, say they voted for the modern party, Nowoczesna \"because it is the only sensible and rational party, free of emotions and of political infighting.\"\nThe couple say they believe the party has \"sound economic plans, not some empty promises\" like the ruling Civic Platform party.\nNowoczesna is a new force founded by an economist who focuses on creating sound state finances.\nLawyer Katarzyna Bielska says she supports a coalition of left-wing parties in order to end Civic Platform's eight-year-rule while not backing the favored conservative Law and Justice party.\nInterpreter Slawomir Krantz says he voted for Civic Platform because he fears other parties might spoil the stability Poland has achieved.\n___\n11:05 a.m.\nA fire has broken out at a polling station in Poland, forcing officials to move the voting station to a nearby school.\nWojciech Hermelinski, the head of the state electoral commission, says the fire broke out Sunday morning in Biskupin, near the northern Polish city of Bydgoszcz, after only six people had voted in a small wooden building. He says nobody was hurt and officials were able to secure all the documentation.\nPoles are voting to pick 460 lawmakers to the lower house of parliament and 100 to the Senate. Whichever party wins the most votes gets the chance to form the next government.\nOpinion polls in recent days show that the expected winner is Law and Justice, a socially conservative party that favors greater welfare spending to help the poor.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T00:31:31.561+02:00", "highlightTitle": ""}