{"organizations": [], "uuid": "818dc745e8fecfd24a2aa06f4ee00faa3b49d516", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.charismanews.com", "main_image": "http://www.charismanews.com/images/stories/2015/featured-news/Reuters-Mitch-McConnell-Downcast.jpg", "site_section": "http://www.charismanews.com/politics", "section_title": "Politics", "url": "http://www.charismanews.com/politics/opinion/52383-one-of-the-most-stunning-admissions-in-establishment-republican-deceit", "country": "US", "title": "One of the Most Stunning Admissions in Establishment Republican Deceit", "performance_score": 0, "site": "charismanews.com", "participants_count": 3, "title_full": "One of the Most Stunning Admissions in Establishment Republican Deceit — Charisma News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:00:00.000+03:00", "replies_count": 2, "uuid": "14573bd3b801e2a92606a6d3328e631a7b1f00eb"}, "author": "CHQ Staff/Conservative HQ", "url": "http://www.charismanews.com/politics/opinion/52383-one-of-the-most-stunning-admissions-in-establishment-republican-deceit#post-0", "ord_in_thread": 0, "title": "One of the Most Stunning Admissions in Establishment Republican Deceit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mitch McConnell has a stunning admission. ( Reuters ) In one of the most stunning admissions of establishment Republican perfidy in recent political history, Senate Majority Leader Mitch McConnell has admitted that he and his staff \"box out\" one of his own Republican colleagues—principled limited government constitutional conservative Sen. Ted Cruz—to the advantage of our political opponents, far-Left Democratic President Barack Obama and his allies in the Congress.\nThat there has long been enmity between the conservative Republican senator from Texas and the establishment Republican Senate Majority Leader is not news—they could hardly be more different in terms of temperament and politics.\nTed Cruz is the straightforward advocate of limited government constitutional conservatism and the grass-roots conservative view that the Republican majority in Congress should use all the tools the Constitution provides to rein in the lawless overreach of President Barack Obama.\nMitch McConnell is the embodiment of the go-along-get-along approach to \"governing\" embraced by the old bulls of the Capitol Hill Republican establishment. McConnell and Republicans of his ilk believe that the chief job of Congress is to divvy-up the spoils the welfare state extorts from producers and as long as his cronies are rewarded and his state of Kentucky gets a proper share of earmarks, all is right with the world.\nMcConnell, with his usual self-satisfied smirk, has long maintained that his disagreements with Ted Cruz and other conservatives are really just tactical in nature and that he and conservatives really agree on the goals, he just disagrees on how and how fast Congress can get there.\nWe have long maintained that was a lie, and that McConnell and the Republican establishment have no intention of actually confronting and defeating Obama—and now Sen. McConnell has admitted we are right.\nAn article in Tuesday's POLITICO, \"How McConnell outfoxed Ted Cruz,\" outlines how \"in the latest shutdown scare, which will end on Wednesday, the leader (McConnell) and his team executed a coordinated strategy to box Cruz out, according to interviews with GOP leaders and aides.\"\nThe truly bizarre premise of the Republican \"leaders\" Quote: d in the article is perhaps best expressed by Sen. John Thune of South Dakota, the No. 3 Senate Republican: \"He's (Cruz) running for national office. He's got a different endgame than we do. There are things we have to do here. We've got to fund the government every year.\"\nThune's comments are bizarre for at least four reasons:\nadvertisement First, what Thune is saying is that Republicans will never fight to defund any Democratic initiative, no matter how unpopular. If Democrats threaten to \"shut down the government,\" then no program, once funded, can ever be eliminated as long as a Democratic president or Democratic senators want to keep it. Such a concept of \"governing\" is absurd and makes electing a Republican Senate majority an exercise in futility since, under Thune's formulation, such a majority would never fight for any conservative principle or spending priority.\nSecond, the notion that Ted Cruz is pursuing conservative policy outcomes solely to advance his presidential campaign is ridiculous on its face. What Cruz is doing is fulfilling promises he made in the Republican primary in which his underdog campaign defeated his establishment Republican opponent, long before the notion of a Cruz presidential run had any currency.\nThird, the actions that Ted Cruz is advocating are not unique Cruz ideas—they are positions Republicans campaign on every election and most promptly abandon when they get to Washington. If Ted Cruz's sin in the eyes of the Senate's Republican leadership is taking the Republican platform and campaign promises seriously, it's an indictment of them, not him.\nFourth and perhaps most importantly, conservative policy success is an end in itself. It is what Republicans supposedly come to Congress to achieve, and the idea that Republican leaders would oppose defeating Obama or stymieing his far-Left agenda because Ted Cruz might get the credit is beyond appalling. It is the best argument we've heard yet for a complete house cleaning in the Capitol Hill Republican leadership.\nIn a blistering speech on Monday, which we reported and you can read on CHQ through this link , Cruz said that McConnell is \"not willing to lift a finger\" to take on Planned Parenthood or Iran and said that, despite massive GOP majorities, \"Harry Reid and Nancy Pelosi remain the de facto leaders in the Senate and the House.\" He also accused McConnell of using an \"unprecedented procedural trick\" to deny Cruz a roll call vote on Monday.\nAnd let's be clear about who wins and who loses when Mitch McConnell and other establishment Republican Senators, like John Thune and Cruz's fellow Texan John Cornyn, stifle Ted Cruz's efforts to roll back Obama's far-Left agenda.\nThe winner isn't Mitch McConnell and his go-along-get-along cabal in the Senate. It is Barack Obama, which means the losers are America's taxpaying citizens who have seen their liberty eroded and their quality of life destroyed by Obama's relentless assault on constitutional liberty.\nIf that isn't an undebatable justification for new Republican leadership in the Senate, we doubt we will ever hear one.\n ", "external_links": ["http://ox-d.charisma.net/w/1.0/rc?cs=6421ee36eb&cb=1460966761", "https://secure.strangmagazines.com/~strangma/charisma/2015/40years/?utm_source=charismanews.com&utm_medium=article", "http://ox-d.charisma.net/w/1.0/afr?auid=536873539&cb=1460966761", "http://www.conservativehq.com/node/21231", "http://shop.charismamag.com/collections/life-in-the-spirit/products/life-in-the-spirit?utm_source=charismanews.com&utm_medium=article", "http://ox-d.charisma.net/w/1.0/ai?auid=536873539&cs=6421ee36eb&cb=1460966761"], "published": "2015-10-01T20:00:00.000+03:00", "crawled": "2015-10-01T20:11:27.725+03:00", "highlightTitle": ""}