{"organizations": [], "uuid": "056c3e2d328f62211571d561018b4ab07032bc6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30261124/denvers-thanksgiving-weekend-to-kick-off-2015-mile-high-holidays", "country": "US", "title": "Denver's Thanksgiving Weekend to Kick Off 2015 Mile High Holidays", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Denver's Thanksgiving Weekend to Kick Off 2015 Mile High Holidays - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "056c3e2d328f62211571d561018b4ab07032bc6b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30261124/denvers-thanksgiving-weekend-to-kick-off-2015-mile-high-holidays", "ord_in_thread": 0, "title": "Denver's Thanksgiving Weekend to Kick Off 2015 Mile High Holidays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " VISIT DENVER, The Convention & Visitors Bureau\nThe holiday begins a festive season of events, performing arts, family-friendly activities and special hotel deals\nDENVER, Oct. 14, 2015 /PRNewswire-USNewswire/ -- Thanksgiving weekend in The Mile High City bustles with activities full of holiday spirit that kick off the annual Mile High Holidays celebration. Starting with a beloved annual event, the Grand Illumination of downtown Denver's more than 600,000 holiday lights, the entire weekend is packed with shopping, seasonal events, dining and deals on hotel stays.\nPhoto - http://photos.prnewswire.com/prnh/20151014/276824\n\" Thanksgiving is a perfect opportunity to spend the weekend in downtown Denver,\" says Richard Scharf , president and CEO of VISIT DENVER, The Convention and Visitors Bureau. \"The entire city comes alive with the holiday spirit, and it is a wonderful time to kick off the season by taking advantage of everything it has to offer – from festive light displays and plenty of shopping to delicious dining and family-friendly experiences.\"\nBelow are just a few events happening around Denver during Thanksgiving weekend. For a full list of events during the weekend, including a list of the best restaurants open on Thanksgiving Day , go to VISIT DENVER's Thanksgiving page ; and for the most up-to-date list of holiday events, activities and deals throughout the entire season, visit the Mile High Holidays website.\nRestaurants Open for Thanksgiving Dinner\nSome of Denver's best restaurants will host a delicious Thanksgiving Dinner this year, including all of the following places. Reservations are recommended.\nAltitude at Hyatt Regency Colorado Convention Center will host a Thanksgiving buffet from 11:00 am – 8:00 pm featuring carved-to-order meats, an autumn-themed local menu and traditional holiday desserts. Reservations recommended; $49 for adults, $17 for children under 12 (4 and under dine free).\nThe Capital Grille will offer their take on Thanksgiving favorites alongside their full menu. Reservations recommended.\nDowntown Aquarium will feature traditional favorites, a kids' buffet and discounts on rides and exhibits. Reservations required.\nMaggiano's Little Italy creates a family-style, full turkey dinner menu for Thanksgiving Day . Reservations recommended; pricing based on number of people in party.\nRialto Café will be open from 9:00am to 6:00pm , serving off-the menu brunch and dinner as well as a classic turkey dinner. Reservations recommended.\nRodizio Grill, The Brazilian Steakhouse – On Thanksgiving , Rodizio Grill will serve dinner meats all day long, in addition to some seasonal favorites, including orange turkey, sweet potatoes, and pumpkin pie, among other items. Reservations recommended; cost is around $40 per person, depending on order.\nRuth's Chris Steak House will feature a traditional turkey dinner in addition to their regular menu. Reservations recommended; average of $29-30 per person, depending on order.\nOther restaurants that will be open on Thanksgiving Day include 1515 Restaurant, The Corner Office Restaurant & Martini Bar, Jake's Food and Spirits, Ship Tavern at The Brown Palace Hotel & Spa and more.\nThanksgiving Weekend Events\nDowntown Denver Grand Illumination\nWHEN: Nov. 27\nWHERE: Downtown Denver\nAs part of Downtown Denver's Winter in the City program, at 6 p.m. on Nov 27, 2015 Downtown Denver's Grand Illumination event will light up Downtown, from Denver Union Station to the City and County Building. Following a countdown shortly after 6:30 p.m. , Denver Union Station will be ablaze with brightly colored floodlights illuminating the historic structure in the heart of Lower Downtown and its lighted tree in front.\nBlossoms of Light\nWHEN: Nov. 27, 2015 – Jan. 2, 2016\nWHERE: Denver Botanic Gardens\nThe first night of Blossoms of Light will display over one million colorful lights draped in elegant designs highlighting the Gardens' winter beauty. The show features sparkling passages, brand new displays and romantic mistletoe kissing spots, as well as the always-anticipated HoloSpex glasses. Refreshments will be available.\nAnnual Denver Christkindl Market\nWHEN: Nov. 20 - Dec. 23\nWHERE: Skyline Park\nThe Christkindl Market, a traditional German-style Christmas market, includes vendors from Germany and other countries, as well as local artisans, offering high-quality, handcrafted gifts such as traditional hand-carved wooden figurines, handmade candles and ornaments. The event will also feature traditional German food, Glühwein (hot spiced wine) and live entertainment. Free entry to all ages.\nSouthwest Rink at Skyline Park\nWHEN: Nov. 24, 2015 – Feb. 15, 2016\nWHERE: Skyline Park\nIn the heart of Downtown Denver , Southwest Airlines will once again sponsor a public ice skating rink in Skyline Park. Skating is free for those who bring their own skates; there are also skates and lockers available to rent for a small fee, and music playing for people to skate along to.\nDrums of the World\nWHEN: Nov. 29\nWHERE: Boettcher Concert Hall\nThis popular annual family concert takes attendees on a musical journey. Drums of the World features the Colorado Symphony percussionists with a variety of rhythmic instruments that reflect styles from around the world.\nSuper Indian: Fritz Scholder , 1967-1980\nWHEN: Oct. 4, 2015 – Jan. 17, 2016\nWHERE: Denver Art Museum\nWith a signature blend of figurative and pop art influences, renowned 20 th century artist Fritz Scholder created colorful, compelling and revolutionary images depicting the reality of being an American Indian. This Denver Art Museum exhibition will feature more than 40 rarely seen paintings and lithographs by Scholder.\nWyeth: Andrew and Jamie in the Studio\nWHEN: Nov. 8, 2015 – Feb. 7, 2016\nWHERE: Denver Art Museum\nThis fall, Denver Art Museum will host this groundbreaking Wyeth exhibition. With more than 100 works created in a variety of media, the exhibition explores the connection between the father and son duo of American artists through more than 100 works executed in a variety of media.\nMarilyn Minter : Pretty/Dirty\nWHEN: Sep. 19, 2015 – Jan. 31, 2016\nWHERE: Museum of Contemporary Art Denver\nThis exhibition explores in detail the myriad image choices Minter has made as a painter and photographer, the evolution of her style and technique, and her mode of production, including her organization of an unusual studio of assistants trained to create hyper-real, sometimes dizzyingly painted surfaces.\nThe International Exhibition of Sherlock Holmes\nWHEN: Oct. 23, 2015 – Jan. 31, 2016\nWHERE: Denver Museum of Nature & Science\nThis exhibition at the Denver Museum of Nature & Science takes visitors to Victorian London to work alongside Holmes and Watson as they unravel a new case. It also explores the Sherlock fascination through more than 300 artifacts including first edition publications, original artwork and more.\nThe Power of Poison\nWHEN: Jul. 10, 2015 – Jan. 10, 2016\nWHERE: Denver Museum of Nature & Science\nThe exhibition uses models, objects, interactives, and live animals to explore various forms of poison and their role in nature, health, myths, and legends. Whether as a defense against predators, a source of magical strength, or a lethal weapon used in a medical treatment, the story of poison is surprising at every turn.\nToys of the '50s, '60s and '70s\nWHEN: Extended until Jan. 31, 2016\nWHERE: History Colorado Center\nDue to popular demand, History Colorado Center just announced an extension of the playful traveling exhibit, Toys of the '50s, '60s and '70s. Through January 31 , History Colorado Center will host this imaginative exhibit featuring some of the most popular toys in history – from Barbie to Mr. Potato Head, Slinky to Spirograph. The exhibit explores the nostalgia, memories and history behind the toys, and their impact on American life; and it encourages people to play, have fun and explore some of the country's favorite toys.\nThe Lion King (Final Weekend)\nWHEN: Nov. 4-29\nWHERE: Buell Theatre, Denver Performing Arts Complex\nThe renowned musical returns to Denver for just four weeks. Winner of six Tony Awards, the show is unlike anything else and an absolute must-see.\nA Christmas Carol\nWHEN: Nov. 27 – Dec. 27\nWHERE: Stage Theatre, Denver Center for the Performing Arts\nBased on Charles Dickens' classic novel, this joyous and opulent musical adaptation traces money-hoarding skinflint Ebenezer Scrooge's triumphant overnight journey to redemption. Live from the Stage Theatre, A Christmas Carol is a Denver holiday tradition that illuminates the meaning of the holiday season in a way that has resonated for generations.\nThe Santaland Diaries\nWHEN: Nov. 27 – Dec. 27\nWHERE: Jones Theatre, Denver Performing Arts Complex\nBased on David Sedaris' offbeat tales from his stint as a Macy's elf in New York City , this acclaimed one-man show is full of holiday hijinks and laughs for mature audiences.\nThe Nutcracker\nWHEN: Nov. 28 – Dec. 27\nWHERE: Ellie Caulkins Opera House, Denver Performing Arts Complex\nChildren and adults will enjoy Colorado Ballet's 55th annual production of The Nutcracker, featuring fantastic characters, brilliant dancing, exquisite sets, dazzling costumes, timeless choreography and Tchaikovsky's extraordinary arrangement performed live by the Colorado Ballet Orchestra. This enchanting production brings the timeless story to life and transports audiences to lands of wintertime magic and delicious sweets. Whether it is your first time or 55th, you and your entire family will adore Colorado's most spectacular holiday tradition.\nThanksgiving Hotel Deals\nVisitors and locals alike can make a weekend out of the holiday and stay at a number of hotels for a great value – from properties near premiere shopping areas to deals on rooms that will make holiday travel a breeze, there are several Thanksgiving weekend deals and packages available.\nAbout VISIT DENVER, The Convention & Visitors Bureau\nCelebrating more than 106 years of promoting The Mile High City, VISIT DENVER is a nonprofit trade association that contracts with the City of Denver to market Denver as a convention and leisure destination, increasing economic development in the city, creating jobs and generating taxes. A record 15.4 million visitors stayed overnight in Denver in 2014, generating $4.6 billion in spending, while supporting nearly 54,000 jobs and making tourism the second largest industry in Denver . Learn more about Denver on the VISITDENVER website and at TOURISMPAYSDENVER or by phone at 800 2 Denver. Follow Denver's social media channels for up-to-the-minute updates at: Facebook.com/visitdenver ; Twitter.com/visitdenver ; Instagram.com/visitdenver ; and YouTube.com/visitdenver .\nWith press or photo inquiries, please contact:\nJesse Davis : (303) 571-9450 or jdavis@visitdenver.com\nAshley Taufen : (303) 571-9451 or ataufen@visitdenver.com\nRochelle Jones : (303) 571-9418 or rjones@visitdenver.com\nLogo - http://photos.prnewswire.com/prnh/20101210/DC15827LOGO-b\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/denvers-thanksgiving-weekend-to-kick-off-2015-mile-high-holidays-300159716.html\n ", "external_links": ["http://www.twitter.com/visitdenver", "http://photos.prnewswire.com/prnh/20151014/276824", "http://www.denver.org/milehighholidays/", "http://www.xmlnews.org/ns/", "http://www.facebook.com/visitdenver", "http://photos.prnewswire.com/prnvar/20101210/DC15827LOGO-b", "http://www.prnewswire.com/news-releases/denvers-thanksgiving-weekend-to-kick-off-2015-mile-high-holidays-300159716.html", "http://www.denver.org/includes/calendar-of-events/Downtown-Denver-Grand-Illumination/5211/1623/", "http://www.instagram.com/visitdenver", "http://www.youtube.com/visitdenver", "http://photos.prnewswire.com/prnh/20101210/DC15827LOGO-b", "http://www.denver.org/tourismpays", "http://www.denver.org/milehighholidays/holiday-weekends/thanksgiving/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC28056&Transmission_Id=201510141400PR_NEWS_USPR_____DC28056&DateId=20151014", "http://www.denver.org/denver-hotels/hotel-deals-denver/?CouponCatId=38&redeemstart=10-01-2015&redeemend=04-01-2016&keyword=&regionSearch=0&sortby=default&kc=17&kc=15&kc=18&kc=19&kc=26&kc=29&kc=38&btnSubmit=Search", "http://www.visitdenver.com/"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:54:36.272+03:00", "highlightTitle": ""}