{"organizations": [], "uuid": "21b8a6b0d194340c81042cc1754c88690c60daef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30223777/cno-financial-group-named-2015-healthiest-100-workplace-in-america", "country": "US", "title": "CNO Financial Group Named 2015 Healthiest 100 Workplace in America", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CNO Financial Group Named 2015 Healthiest 100 Workplace in America - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "21b8a6b0d194340c81042cc1754c88690c60daef"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30223777/cno-financial-group-named-2015-healthiest-100-workplace-in-america", "ord_in_thread": 0, "title": "CNO Financial Group Named 2015 Healthiest 100 Workplace in America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " CNO Financial Group, Inc.\nRecognized Among the \"Best of the Best\" in Worksite Wellness\nCARMEL, Ind. , Oct. 9, 2015 /PRNewswire/ -- For the second consecutive year, CNO Financial Group , Inc. (NYSE: CNO) has been recognized as a Healthiest 100 Workplace in America by Healthiest Employer, the leader in employee health analytics, best practices and benchmark data.\nCNO Financial Group ranked 56 out of the top 100 and was selected from approximately 800 participating companies for its commitment to employee health and exceptional corporate wellness programs and practices.\n\"Our associates are our company's greatest asset,\" said Ed Bonach , CEO of CNO Financial Group. \"Investing in the health of our associates and their families is an important strategy that benefits our associates and helps us better serve our customers and other stakeholders. We are honored to be recognized for our strategic direction and leadership in the area of workplace wellness.\"\nCNO Financial Group and other peer award-winners attained this recognition as a result of a year-long, highly selective assessment process spanning companies of all sizes from all industries across the country.\nAward applicants were scored based on six critical dimensions of workplace wellness: culture and leadership commitment, foundational components, annual planning, communications and marketing, programming and interventions, and reporting and analysis.\n\"It's exciting to see the nation's healthiest employers at work,\" noted Rod Reasen , CEO of Healthiest Employer. \"These organizations are leading the charge in worksite health and demonstrate a remarkable commitment to improve the lives of their workforce and community.\"\nAbout CNO Financial Group\nCNO Financial Group, Inc. (NYSE: CNO) is a holding company. Our insurance subsidiaries – principally Bankers Life and Casualty Company, Colonial Penn Life Insurance Company and Washington National Insurance Company – primarily serve middle-income pre-retiree and retired Americans by helping them protect against financial adversity and provide for a more secure retirement. For more information, visit CNO online at CNOinc.com .\nAbout Healthiest Employer\nHealthiest Employer® is an analytics firm focused on population health/corporate wellness. The firm collects corporate health data from over 18,000 employers that represent over 60 million employee lives. Through the Springbuk ® health analytics platform, Healthiest Employer enables employers to unify health data, target engagement and improve outcomes in their population. Learn more at www.HealthiestEmployers.com and http://www.springbuk.com .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/cno-financial-group-named-2015-healthiest-100-workplace-in-america-300156836.html\n ", "external_links": ["http://www.springbuk.com/", "http://www.cnoinc.com/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DE23915&Transmission_Id=201510090720PR_NEWS_USPR_____DE23915&DateId=20151009", "http://www.prnewswire.com/news-releases/cno-financial-group-named-2015-healthiest-100-workplace-in-america-300156836.html", "http://www.healthiestemployers.com/"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T16:41:38.026+03:00", "highlightTitle": ""}