{"organizations": [], "uuid": "d26e1fd5ca63025a58833409b0cbe1ce8d8c252a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/3/422035/default/v2/northern-powerhouse-1-1600x900.jpg", "site_section": "http://news.sky.com/feeds/rss/politics.xml", "section_title": "Political News - International and UK Politics | Sky News", "url": "http://news.sky.com/story/1565941/digital-maturity-risk-to-northern-powerhouse", "country": "IL", "title": "'Digital Maturity' Risk To Northern Powerhouse", "performance_score": 0, "site": "sky.com", "participants_count": 2, "title_full": "'Digital Maturity' Risk To Northern Powerhouse", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:05:00.000+03:00", "replies_count": 1, "uuid": "85527af46c0039f8643be1447926b2e210a61a51"}, "author": "news.sky", "url": "http://news.sky.com/story/1565941/digital-maturity-risk-to-northern-powerhouse#post-0", "ord_in_thread": 0, "title": "'Digital Maturity' Risk To Northern Powerhouse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A deficit of digital skills risks stifling the Government's ambition to create a Northern Powerhouse, a report has warned. Research by Development Economics suggested there was a North/South divide in the creation of jobs in the sector, with London and the South East accounting for almost half of the estimated 766,000 positions in the pipeline over the next four years.\nIt claimed the UK economy needed almost 2.3 million trained workers by 2020 just to remain competitive.\nThe study was commissioned by O2 to coincide with the launch of a pilot project aimed at giving people and businesses 'digital makeovers' to help grow opportunities outside the capital.\nO2 said its Digital Communities project in St Helens could be expanded.\nIt cited a number of examples of help to date, including a 150-year old pickle company now having new stock management tools and a digital marketing strategy.\nThe company's business director, Ben Dowd, said: \"We’re committed to playing our part, which is why we’ve launched an ambitious partnership with St Helens Council to show other communities what’s possible when they put connectivity at their heart.\n\"We’re helping analogue businesses go digital; matching local companies with the digital talent on their doorstep, and supporting the council to offer more digital services, to create a blueprint for other communities up and down the country.\nThe Government's Northern Powerhouse ambition is aimed at rebalancing economic growth across the UK to communities outside London, especially the major cities of northern England such as Manchester, Leeds, Liverpool, Leeds and Hull.\nIt was first raised by the Chancellor George Osborne in the last Parliament.\nHe hopes that investment in transport - especially £13bn in rail - and other infrastructure will encourage more business start-ups and opportunities for companies to grow.", "external_links": [], "published": "2015-10-08T14:05:00.000+03:00", "crawled": "2015-10-08T16:57:38.802+03:00", "highlightTitle": ""}