{"organizations": [], "uuid": "9a93f1621cbb8bf279d1f0b118ef543c7a865bf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/current-events/51052-thanks-sanders-democratic-party-just-debated-merits-capitalism.html", "country": "US", "title": "Thanks to Sanders, Democratic Party Just Debated Merits of Capitalism", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "Thanks to Sanders, Democratic Party Just Debated Merits of Capitalism", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:43:00.000+03:00", "replies_count": 0, "uuid": "9a93f1621cbb8bf279d1f0b118ef543c7a865bf0"}, "author": "LongWinded", "url": "http://defendingthetruth.com/current-events/51052-thanks-sanders-democratic-party-just-debated-merits-capitalism.html", "ord_in_thread": 0, "title": "Thanks to Sanders, Democratic Party Just Debated Merits of Capitalism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posts: 9,925 Thanks to Sanders, Democratic Party Just Debated Merits of Capitalism Thanks to Sanders, Democratic Party Just Debated Merits of Capitalism | Common Dreams | Breaking News & Views for the Progressive Community Quote: Breaking the usual parameters of election season discourse, Democratic presidential hopefuls Tuesday night debated the merits of capitalism on the national stagea development that many attribute to the candidacy of self-described socialist U.S. Senator Bernie Sanders and rising inequality and discontent. When CNN's Anderson Cooper asked Sanders whether he considers himself a capitalist, the Vermont Senator replied: \"Do I consider myself part of the casino capitalist process by which so few have so much and so many have so little, by which Wall Street's greed and recklessness wrecked this economy? No, I don't.\"\"I believe in a society where all people do well,\" he continued, \"not just a handful of billionaires.\" Cooper then asked the panel: \"Is there anybody else on the stage who is not a capitalist?\" Former Secretary of State Hillary Clinton responded with a vague defense of the capitalist system. Common Dreams needs you today!\"Let me follow-up on that, Anderson,\" Clinton said. \"When I think about capitalism, I think about all the small businesses that were started because we have the opportunity and the freedom in our country for people to do that and make a good living for themselves and their families. I don't think we should confuse what we have to do every so often in America, which is save capitalism from itself.\" While direct criticism of capitalism in mainstream politics is not unique to U.S. history, it is unusual for modern times.\"From the late 1970s to fairly recently, this was certainly outside the norm as a combination of Cold War politics and Reaganomics and other dynamics made it taboo to criticize capitalism, especially on the national stage of presidential politics,\" Marjorie Wood, senior economic policy associate at the Institute for Policy Studies and managing editor of Inequality.org, told Common Dreams.\"But if you go back further, this kind of debate isn't all that unusual in America,\" Wood added. \"In fact, debating the merits of capitalism was completely the norm during the first Gilded Age of extreme inequality and abuses of the democratic system. But still, it was a remarkable moment last night that reflects the new moment of inequality we find ourselves in.\" To deny capitalism, or this \"Free Market\" is NOT destroying this nation is to be a fool with a tin foil hat; or a 1%.", "external_links": [], "published": "2015-10-14T23:43:00.000+03:00", "crawled": "2015-10-15T05:40:24.703+03:00", "highlightTitle": ""}