{"organizations": ["Asia Justice Dept.", "Justice Dept."], "uuid": "1a1eccb0282eaa3b7ae38f88f53ad2087eee01b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "", "site_section": "http://www.fox8live.com/category/13571/political-news?clienttype=rss", "section_title": "FOX 8 News WVUE-TV - Political - Headline", "url": "http://www.fox8live.com/story/30275452/justice-dept-expands-cybercrime-reach-into-southeast-asia", "country": "US", "title": "Justice Dept. expands cybercrime reach into southeast Asia", "performance_score": 0, "site": "fox8live.com", "participants_count": 0, "title_full": "Justice Dept. expands cybercrime reach into southeast Asia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:23:00.000+03:00", "replies_count": 0, "uuid": "1a1eccb0282eaa3b7ae38f88f53ad2087eee01b3"}, "author": "", "url": "http://www.fox8live.com/story/30275452/justice-dept-expands-cybercrime-reach-into-southeast-asia", "ord_in_thread": 0, "title": "Justice Dept. expands cybercrime reach into southeast Asia", "locations": ["Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Justice Dept. expands cybercrime reach into southeast Asia By ERIC TUCKERAssociated Press \nWASHINGTON (AP) - The Justice Department is broadening its overseas efforts against cybercrime, for the first time stationing a legal adviser in Malaysia to help ensure that Southeast Asian countries have the laws and tools to fight hackers. \nThe position is intended to shore up international partnerships against a type of crime that's without geographic borders and is often carried out by overseas hackers who elude American prosecution. \nOfficials say they see stronger foreign cybercrime laws as essential if other countries hope to address the problem, especially given the obstacles U.S. officials often face in locating, extraditing and convicting overseas hackers. \nThe post is funded by the State Department and lasts for a year, though Justice Department officials hope to expand the initiative to other parts of the world if it proves successful. \n\"It's a region of the world where there's a high level of sophistication with technology\" where cyber criminals can set up \"and prey on others in the world,\" Assistant Attorney General Leslie Caldwell, head of the Justice Department's criminal division, said in an interview with The Associated Press. She was scheduled to discuss the move in a speech Friday in Rhode Island. \nOn Thursday, the Justice Department said Malaysian authorities had detained a citizen of Kosovo on a U.S. provisional arrest warrant. The man is alleged to have provided material support to the Islamic State group and committed computer hacking and identity theft violations in conjunction with the theft and release of personally identifiable information of U.S. service members and federal employees. \nThe new Justice Department post in Malaysia is occupied by Thomas Dougherty, who spent years as a Justice Department computer crimes prosecutor. He already has met with officials from Vietnam to discuss potential improvements to that country's penal code and has reviewed cases with Malaysian officials. \nHe'll also be a point of contact for coordinating training on cyber investigations and prosecutions and a resource for questions about the use of electronic evidence and other topics, State Department officials said. \nThe new position is an acknowledgement that encouraging foreign countries to arrest hackers within their own borders can be a more efficient strategy than hauling them into U.S. courts. But U.S. officials say they'll continue seeking extradition of those captured overseas, and that improving laws in foreign countries is part of that process. \nCaldwell called it \"a two-way street\" because U.S. extradition laws require that the laws be similar in the country that's extraditing a suspect. \nThe initiative is similar to one undertaken by the FBI, which for several years has stationed specialized cyber agents at some of the 64 legal attache offices the bureau maintains around the world. \nThe FBI has permanent agents in seven countries, including Estonia, Romania, Australia and Canada. It has temporary positions in 12 countries, said Gerald Bessette, an FBI cyber section chief. \n\"Every country has different legal investigative structures,\" Bessette said. \"So we want to know who our partners are if we have an investigation where we're going to ask a foreign country to take legal action\" such as seizing a computer server that's being used to commit crimes. \nHe said those partnerships paid off in an investigation last year into sophisticated malware known as BlackShades that infected more than a half-million computers worldwide and that permitted cybercriminals to remotely hijack a computer and its webcam. Federal authorities charged about 100 people and police throughout Europe were involved in coordinating arrests. \nShawn Henry, a former FBI executive assistant director, said good relationships are crucial because the FBI generally can't work an international case successfully without a host government's cooperation. \n\"I don't care who arrests them, as long as they're bad guys and off the playing field,\" said Henry, president of CrowdStrike Services, a security technology company. \"If a foreign government can arrest them and charge them successfully, I'm happy.\" \n____ \nFollow Eric Tucker on Twitter at http://www.twitter.com/etuckerAP Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-16T14:23:00.000+03:00", "crawled": "2015-10-16T14:39:45.789+03:00", "highlightTitle": ""}