{"organizations": ["Senate", "Russ Feingold Journal Sentinel", "Russ Feingold Uihleins"], "uuid": "2278eb213a9c64220c4520830e4c50157becee96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/b99589973z.1_20151004172343_000_gnlcr2ak.1-1.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=/news/statepolitics/headlines&atom=y", "section_title": "JSOnline.com HL - Inside State Politics", "url": "http://www.jsonline.com/watchdog/noquarter/uihleins-spend-big-to-help-ron-johnson-defend-senate-seat-from-russ-feingold-b99589973z1-330585321.html", "country": "US", "title": "Uihleins spend big to help Ron Johnson defend Senate seat from Russ Feingold", "performance_score": 0, "site": "jsonline.com", "participants_count": 0, "title_full": "Uihleins spend big to help Ron Johnson defend Senate seat from Russ Feingold", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T01:28:00.000+03:00", "replies_count": 0, "uuid": "2278eb213a9c64220c4520830e4c50157becee96"}, "author": "", "url": "http://www.jsonline.com/watchdog/noquarter/uihleins-spend-big-to-help-ron-johnson-defend-senate-seat-from-russ-feingold-b99589973z1-330585321.html", "ord_in_thread": 0, "title": "Uihleins spend big to help Ron Johnson defend Senate seat from Russ Feingold", "locations": ["Uihleins"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Russ Feingold", "Ron Johnson"], "text": "Uihleins spend big to help Ron Johnson defend Senate seat from Russ Feingold Journal Sentinel files Records show that the Uihleins and their company already have pumped at least $1.3 million into three outside groups putting up ads either helping Ron Johnson or criticizing Russ Feingold. Oct. 4, 2015 5:28 p.m. (4) Comments \nIt's not enough that Richard and Elizabeth Uihlein are trying to buy up and lock down important parcels of property in northern Wisconsin. \nThe Uihleins — owners of Pleasant Prairie-based Uline Corp. — also are staking a claim in the hotly contested race between U.S. Sen. Ron Johnson and his predecessor, former U.S. Sen. Russ Feingold . \nRecords show that the Uihleins and their company already have pumped at least $1.3 million into three outside groups putting up ads either helping Johnson, a Republican, or criticizing Feingold, a Democrat. \nThe election, of course, is still 13 months away. \nMost recently, Uline Corp. gave $500,000 to Club for Growth , making the company the biggest donor by far to the national conservative group this year. Uline's support represents more than two-thirds of Club for Growth's total take of $762,767 in 2015. \nThe Uline money arrived a few months before the group launched a $700,000 ad campaign attacking Feingold. Club for Growth has announced that it hopes to spend more than three times that amount helping to re-elect Johnson. \nTom Russell, campaign manager for Feingold, said it's not surprising that out-of-state multimillionaires are \"bankrolling\" his opponent's campaign via Club for Growth. Russell said they are doing this because Johnson supported, among other things, the policies that led to the 2013 federal government shutdown. \nEarlier this year, Richard Uihlein chipped in $800,000 to two conservative political action committees running TV and radio spots on the race — $300,000 to Restoration PAC and an additional $500,000 to Americas PAC . \nRichard Uihlein, who lives in Lake Forest, Ill., did not return calls last week. But in an August email, he told No Quarter that his company and family have deep roots in the state. \n\"My company's corporate headquarters are located in Pleasant Prairie, WI. Wisconsin is a very important part of our business,\" Richard Uihlein wrote. \nIt goes even further than that. \nThe Uihleins — who own property in northern Wisconsin — have come under scrutiny in recent weeks for asking Gov. Scott Walker's administration to approve two land deals that would benefit them. \nFirst, Elizabeth Uihlein is trying to buy 1.75 acres of prime lakefront property in Vilas County from the Department of Natural Resources. Richard Uihlein also wants state approval to tie down a 12-acre floating bog to keep it away from his family property. \nThe politically active couple has given some $3 million in support of Walker's successful gubernatorial and unsuccessful presidential campaigns. \nThe Uhleins, in other words, are quickly becoming the Koch brothers of Wisconsin politics. \nIn his email to the Milwaukee Journal Sentinel , Richard Uihlein said the Johnson-Feingold contest is among the most important U.S. Senate races in 2016. \nHe said he put money into the Restoration PAC to draw attention to Feingold's support of the Iran nuclear deal, which Uihlein called \"one of the greatest threats to our nation's security.\" He added, \"We thought it would be a good time to highlight this.\" \nAs for out-of-state spending in this crucial contest, Richard Uihlein said, \"I think you might want to have a look at where Feingold's money is coming from.\" \nIndeed, Feingold acknowledged that he was abandoning his long-held pledge to raise a majority of his funds from Wisconsin residents. The National Journal reported this year that only 43% of his cash came from in-state sources. \nBeyond that, Feingold is the beneficiary of heavy spending by third-party groups early in the contest. \nUnofficially, it appears that five liberal groups — led by the League of Conservation Voters — have already spent or have bought air time worth $1.8 million in the race. \nThat's at least $300,000 more than the three outside conservative groups have poured into helping Johnson, who defeated Feingold in 2010. \n(Some don't include Americas PAC's radio spots in their tally because the ads simply urge people to vote Republican in national races; others say these commercials should count because they help Johnson. Either way, liberal groups are outspending conservative ones.) \nIn short, Feingold — long a champion of campaign finance reform — is getting a lot of help from friends and allies outside Wisconsin. \nThis has not gone unnoticed. \n\"Mr. Clean has gone from battling outside money to accepting as much help as he can get and breaking his own career-defining pledge to rely on Wisconsin donors,\" said Brian Reisinger , spokesman for Johnson's campaign. \nSo here is where we stand long before the November 2016 election: \nLiberal groups are dropping millions to knock off Johnson, and millionaires are spending big through conservative groups to make sure Johnson sticks around. \nExpect more — lots more — of the same for the next year. No further comment \nWalker was given a chance late last week to defend Rick Wiley , his embattled former presidential campaign manager. \nWalker took a pass. \nWiley has been under attack from a number of conservative outlets for burning through campaign cash and seemingly pinning the blame for the now-defunct campaign operation on the GOP candidate. Walker dropped out of the race for the 2016 Republican presidential nomination on Sept. 21. \nAmong those leveling criticism was R.J. Johnson , the architect of much of Walker's statewide success in Wisconsin. Johnson said Wiley's comments about the governor \"crosses a line.\" \nOn Friday, Walker declined to comment about the sharp rebukes directed at Wiley. \n\"In terms of the campaign, I made a statement on the 21st of last month,\" Walker told the Journal Sentinel's Mary Spicuzza . \"I'm not going to comment any more on the campaign, other than to say I'm committed to being governor moving forward.\" \nContact Daniel Bice at (414) 224-2135 or dbice@jrn.com. Follow him on Twitter @ DanielBice or on Facebook at fb.me/daniel.bice . © 2015 , Journal Sentinel Inc. All rights reserved.", "external_links": [], "published": "2015-10-05T01:28:00.000+03:00", "crawled": "2015-10-05T02:06:13.226+03:00", "highlightTitle": ""}