{"organizations": [], "uuid": "6d20b2e2f61e21cd936d9cfef24924dd8f92c925", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/03/381975-markandey-katju-rna.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/india/report-cow-cannot-be-anyone-s-mother-it-s-just-another-animal-markandey-katju-2131385", "country": "SG", "title": "Cow cannot be anyone's mother, it's just another animal: Markandey Katju on beef ban", "performance_score": 0, "site": "dnaindia.com", "participants_count": 6, "title_full": "Cow cannot be anyone's mother, it's just another animal: Markandey Katju on beef ban | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T19:20:00.000+03:00", "replies_count": 6, "uuid": "8c1aadc1765accc0f610c88083d41136fe9d6d25"}, "author": "PTI", "url": "http://www.dnaindia.com/india/report-cow-cannot-be-anyone-s-mother-it-s-just-another-animal-markandey-katju-2131385#post-0", "ord_in_thread": 0, "title": "Cow cannot be anyone's mother, it's just another animal: Markandey Katju on beef ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Agitated over Katju's remarks, several students staged protest and shouted slogans against him (File Photo) undefined Describing lynching of a man near Delhi over rumours that he had consumed beef as \"politically motivated\", former Supreme Court judge Markande Katju on Saturday said cow was just another animal \"which cannot be anyone's mother\". \"Cow is just an animal and an animal cannot be anyone's mother, if I like to eat beef then what's harm in it, even people worldwide consume beef, if I like to too eat then who can stop me...\" he said during a function at Banaras Hindu University here. Katju said he too ate beef and was not harm in it.\n\"Are those people across the world who eat beef are bad and only we (in the country) who don't eat are saints and seers, whats harm in it when people eat beef, I too eat and will even continue to eat further...\" he said.\nhttp://t.co/ma1LPQ3BGo I see nothing wrong in eating beef. Most of the world eats it. R they all sinners ? I have eaten beef several times\n— Markandey Katju (@mkatju) October 2, 2015\nI have eaten beef many times,& will eat it again. Let us see whether u r brave enough to execute ur threat. @amanlobana @sardesairajdeep\n— Markandey Katju (@mkatju) September 30, 2015\nThe former Allahabad High Court judge strongly condemned the killing of the man in Dadri and demanded severe punishment to those involved in it. \"I too came to know from media and others that an announcement was made from (inside) a temple that a man eats beef and then mob rushed and lynched that man. \"What could be more unfortunate than this that a man is killed on the basis of rumour and for no other reason. The culprits must be given severe punishment at an earliest,\" he told reporters.\nLater, agitated over Katju's remarks, several students staged protest and shouted slogans against him. They also tried to block the way of Katju while he was heading to the seminar hall. Later the security guards shielded Katju and took him wit them.\nIqlakh was dragged out of his home and stoned to death on a village street after a public announcement from the local temple that the family had slaughtered a calf and eaten its meat. While Iqlakh died, his 22-year-old son Danish is battling for life at a hospital following two brain surgeries.", "external_links": ["https://twitter.com/mkatju/status/649923850327556097", "https://twitter.com/amanlobana", "https://twitter.com/sardesairajdeep", "http://t.co/ma1LPQ3BGo", "https://twitter.com/mkatju/status/649186551671316481"], "published": "2015-10-03T19:20:00.000+03:00", "crawled": "2015-10-03T22:33:09.308+03:00", "highlightTitle": ""}