{"organizations": [], "uuid": "1fb12b5a5d2909821e852ca8816b2611d46e9b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/1/64/Egypt/Politics-.aspx", "section_title": "Politics - Egypt - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/1/64/151667/Egypt/Politics-/Egypt-officially-complains-against-Brotherhood-ass.aspx", "country": "EG", "title": "Egypt officially complains against Brotherhood assault on journalists in NY", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 2, "title_full": "Egypt officially complains against Brotherhood assault on journalists in NY - Politics - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 1, "uuid": "83c9fe68bb0ce549f048e621d2a4f9e597862653"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/64/151667/Egypt/Politics-/Egypt-officially-complains-against-Brotherhood-ass.aspx#post-0", "ord_in_thread": 0, "title": "Egypt officially complains against Brotherhood assault on journalists in NY", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Egypt's Sisi thanks Hollande in person for warship deal Egypt's Sisi calls for building a 'united, democratic Syria' in UN Speech Egypt's Sisi to CNN: Egypt enjoys unprecedented freedom of expression Egypt's Sisi to AP: Country in 'ferocious war' with terrorism Egypt’s Sisi meets Angela Merkel in UN General Assembly All sectors must contribute to Egypt's prosperity, Sisi tells UN Egypt’s foreign ministry announced that an official complaint was made on Tuesday against offenses made by Muslim Brotherhood members' in New York to the media team accompanying Egyptian President Abdel-Fattah El-Sisi.\nEl-Sisi is currently on a visit to New York City to attend the UN General Assembly's 70 th session.\nVideos circulated on social media on Monday showing a group of Muslim Brotherhood sympathisers organising a protest around the well-known streets of New York wearing yellow Rabaa signs while verbally and physically assaulting a group of media persons from Egypt.\nThe Egyptian consulate in New York sent an official complaint to the U.S. state department demanding an urgent arrest of all those who insulted the media team accompanying the president.\nAmong the media personnel was the well-known TV anchor Youssef El-Housseiny, as well as Mohamed Sherdy and Ramy Radwan.\nThe media group also included other figures such as anchors Ahmed Moussa and Wael El-Ebrashy. As soon as they arrived, many Sisi supporters welcomed them cheerfully while chanting slogans supporting the Egyptian president and praising their efforts.\nThe complaint sent to the U.S. state department was accompanied by videotapes showing the incidents of assault, according to a statement by the Egyptian foreign ministry.\n“The memo sent to the state department explained that the protest organised by the Muslim Brotherhood group violated all laws defining peaceful protests in the US,” the statement read.\nMeanwhile, the memo also demanded the termination of all demonstration permits given to Brotherhood members.\nMany Brotherhood members fled to the US and to European countries shortly following the ouster of the Islamist President Mohamed Morsi in July 2013.\nIn November of the same year, the Egyptian government designated the Muslim Brotherhood as a terrorist group.\nThe 86-year-old Brotherhood is currently facing an existential challenge, with a relentless security crackdown that has jailed thousands of its members and supporters.", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-10-01T16:42:57.302+03:00", "highlightTitle": ""}