{"organizations": [], "uuid": "c326bf59e859d1e0f3fd04c3f0d173d3923cf944", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.basingstokegazette.co.uk", "main_image": "http://www.basingstokegazette.co.uk/resources/images/2611533/", "site_section": "http://www.basingstokegazette.co.uk/news/politics/rss/", "section_title": "Basingstoke Gazette | Politics", "url": "http://www.basingstokegazette.co.uk/news/politics/13885642.Public_invited_to_Manydown_planning_open_days_next_month/?ref=rss", "country": "GB", "title": "Public invited to Manydown planning open days next month", "performance_score": 0, "site": "basingstokegazette.co.uk", "participants_count": 0, "title_full": "Public invited to Manydown planning open days next month", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T12:55:00.000+03:00", "replies_count": 0, "uuid": "c326bf59e859d1e0f3fd04c3f0d173d3923cf944"}, "author": "", "url": "http://www.basingstokegazette.co.uk/news/politics/13885642.Public_invited_to_Manydown_planning_open_days_next_month/?ref=rss", "ord_in_thread": 0, "title": "Public invited to Manydown planning open days next month", "locations": ["Manydown"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1 comment \nRESIDENTS and community and neighbourhood groups are being invited to help draw up a masterplan for the first phase of a major development at a special event next month. \nBasingstoke and Deane Borough Council and Hampshire County Council are inviting residents and community groups, as well as environmental, ecological and heritage groups, to the Shaping Manydown : The Place and its Community event. \nWorking with planners and other designers, those taking part will be helping to shape the picture of what the development of Manydown up to 2029 needs to look, feel and be like. \nAround 3,400 new homes are planned on the site between now and 2029. \nThe planners and urban design specialists will be drawing up the community ideas and suggestions in “real time” as they start outlining the plans for locations of key parts of the development, including neighbourhood centres, community facilities, schools, health services and open spaces, and the type and style of homes and businesses. \nTwo days of workshops will be held on November 12 and November 13, before the public will be able to give their thoughts on plans during two public open days on November 14 and November 15. Promoted stories \nThe open days will take place in a large marquee at Basingstoke’s War Memorial Park between 12noon and 6pm on November 14 and between 10am and 4pm on November 15. \nThe borough council’s Cabinet member leading on the Manydown project, Councillor John Izett, said: “We have a real opportunity with Manydown to do something different and outstanding in the way the vision for this new community is taken forward. \n“It is crucial that we have real engagement with the local community from the earliest stages, going beyond the traditional planning consultation that a developer would do normally.” \nCllr Izett added: “Manydown is about creating a new successful community for the long term. The two councils want to harness the potential offered by public ownership of the land to create a place that will promote a full and healthy lifestyle for people living in and around the new community.” \nLeader of Hampshire County Council, Cllr Roy Perry, added: “Hampshire is an extremely popular place to live and quality of life is a key priority for the County Council. \n“With a growing population in the area, Manydown will become home to significant numbers of people. The involvement of local people in the design is crucial, and we would very much encourage residents to attend the event so we can hear their views and ideas.” \nFollowing the event, a draft masterplan with preferred layout and design options will be drawn up for further public engagement in early 2016. Share article \nThe councils are planning further consultation on the planning application in summer 2016 before a planning application is submitted next autumn. \nAnyone who can’t attend the public sessions will be able to contribute comments by visiting www.manydownbasingstoke.co.uk or by calling 08081 683600. Promoted Stories Public invited to Manydown planning open days next month   merciful release 12:44pm Wed 21 Oct 15 \nDont build that\"s people want you to do it will only end up looking like the John Hunt site If people were made to live in boxes God would have given them string To tie around their selves at bed time And stop their dreams falling through the ceiling The Basingstoke cllrs just not qualified enough to take big decisions like this.... Dont build that\"s people want you to do it will only end up looking like the John Hunt site If people were made to live in boxes God would have given them string To tie around their selves at bed time And stop their dreams falling through the ceiling The Basingstoke cllrs just not qualified enough to take big decisions like this.... merciful release \nDont build that\"s people want you to do it will only end up looking like the John Hunt site If people were made to live in boxes God would have given them string To tie around their selves at bed time And stop their dreams falling through the ceiling The Basingstoke cllrs just not qualified enough to take big decisions like this.... Report", "external_links": [], "published": "2015-10-21T12:55:00.000+03:00", "crawled": "2015-10-21T22:56:34.365+03:00", "highlightTitle": ""}