{"organizations": [], "uuid": "44f2b3f731051724214bcab3af32225b2058c600", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-1832b64c3bdc2c979686743db6ed5386.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/trump-raised-87k-at-event-he-said-wasnt-fundraiser/article/2574281?custom_click=rss", "country": "US", "title": "Trump raised $87K at event he said wasn't fundraiser", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Trump raised $87K at event he said wasn't fundraiser | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:29:00.000+03:00", "replies_count": 0, "uuid": "44f2b3f731051724214bcab3af32225b2058c600"}, "author": "Gabby Morrongiello", "url": "http://www.washingtonexaminer.com/trump-raised-87k-at-event-he-said-wasnt-fundraiser/article/2574281?custom_click=rss", "ord_in_thread": 0, "title": "Trump raised $87K at event he said wasn't fundraiser", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At an August campaign event in Norwood, Mass., Donald Trump, who's pledged to self-fund his bid for the presidency, made clear to reporters \"this is not a fundraiser.\"\nAccording to the latest Federal Election Commission records , however, Trump received nearly $87,000 from residents of the 10-square-mile town in the third fundraising quarter — the largest sum contributed to the Republican front-runner's presidential campaign from any zip code in the U.S.\nIn August, local automobile dealer Ernie Boch Jr. hosted a $100-per-plate campaign event for Trump at his Norwood mansion where Trump supporters and curious spectators could pay to hear the billionaire businessman speak.\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ \"This is not a fundraiser tonight, just so you understand,\" Trump told members of the press outside the sprawling Massachusetts estate at the time. \n  Colorado to close Obamacare co-op Insurer is the third to close in a week and the seventh of 23 taxpayer-funded startups to shutter.\nBy Robert King • 10/16/15 12:34 PM Trump and Boch reportedly insisted that any money raised from the event would be used to cover the cost of the event itself, but attendees were free to make additional donations once they'd met the $100 entry fee.\nThe event was held just over a month after Trump said during his presidential announcement, \"I don't need anybody's money.\"\n\"I'm using my own money. I'm not using the lobbyists. I'm not using donors. I don't care. I'm really rich,\" he said at his Fifth Avenue skyscraper the day he announced his candidacy. His campaign later said they would accept small dollar donations.\nTrump's campaign released a statement Thursday hours before the FEC's October quarterly deadline, saying the GOP's leading man had received almost 74,000 \"unsolicited donations\" during the third quarter.\n\"The Trump campaign will continue to accept small dollar donations as people across the country proudly invest in Mr. Trump's vision to Make America Great Again,\" read the statement.\nAlso from the Washington Examiner Report: DNC officials revolting against Wasserman Schultz DNC officials are speaking out against the chairwoman and the chaos she continued to engage in with Gabbard.\nBy Al Weaver • 10/16/15 12:11 PM Neither Boch nor a spokesperson for Trump's campaign could be reached for comment.\n ", "external_links": [], "published": "2015-10-16T15:29:00.000+03:00", "crawled": "2015-10-16T20:13:03.161+03:00", "highlightTitle": ""}