{"organizations": [], "uuid": "517037f796264656ac806ec0e3015a5d1dd72956", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/09/25/Development-Transportation/Images/PHO-05Jun03-6317.jpg", "site_section": "http://www.washingtonpost.com/opinions", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/playing-games-with-metro-safety/2015/10/13/3889a360-711e-11e5-9cbb-790369643cf9_story.html", "country": "US", "title": "Playing games with Metro safety", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Playing games with Metro safety - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "517037f796264656ac806ec0e3015a5d1dd72956"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/playing-games-with-metro-safety/2015/10/13/3889a360-711e-11e5-9cbb-790369643cf9_story.html", "ord_in_thread": 0, "title": "Playing games with Metro safety", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patrons board Metro at the Stadium-Armory station. (Kevin Clark/The Washington Post) By Editorial Board October 13 at 7:43 PM F OR YEARS, Metro and its two nominal overseers — one local, the other federal — have played a game of “Let’s Pretend.” The game entails willful blindness and brazen irresponsibility in the face of spiraling deterioration of a mismanaged, accident-prone subway system.\nIt works like this: The local overseer, called the Tri-State Oversight Committee, or the TOC, identifies safety lapses on Metro and demands action. Metro sometimes responds, sometimes responds late and sometimes doesn’t respond at all. Eventually it devises an “action plan” to resolve the TOC’s concerns. The action plan may or may not be carried out. Occasionally, Metro withholds critical data on safety incidents and accidents.\nThis game is one-sided: Metro holds all the cards — the resources, the information and the personnel. The TOC has only token amounts of each.\nThe third player, the Federal Transit Administration, enters the game sporadically, generally in the aftermath of serious mishaps. The FTA excoriates Metro for its incompetence, notes the TOC’s toothlessness and demands change. Everyone then settles back and pretends that things will get better.\nFor example: It was first noted shortly after the Red Line accident that left nine people dead and dozens injured that the TOC was ineffectual and", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:11:08.241+03:00", "highlightTitle": ""}