{"organizations": [], "uuid": "b1f4f0ca33b8293aa65879e3bc34084c13408ccd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/current-events/50797-elizabeth-warren-made-washington-angry-again.html", "country": "US", "title": "Elizabeth Warren Made Washington Angry Again", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "Elizabeth Warren Made Washington Angry Again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T20:54:00.000+03:00", "replies_count": 0, "uuid": "b1f4f0ca33b8293aa65879e3bc34084c13408ccd"}, "author": "LongWinded", "url": "http://defendingthetruth.com/current-events/50797-elizabeth-warren-made-washington-angry-again.html", "ord_in_thread": 0, "title": "Elizabeth Warren Made Washington Angry Again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Elizabeth Warren Made Washington Angry Again User Name Current Events Current Events Forum - Latest political news and events Quote: . . . This much, at least, is certain. Brookings forced Litan -- a former Clinton administration economist -- to resign his unpaid position as a non-resident senior fellow at the prestigious think tank. Warren did not call for Litan's ouster, but her letter to Brookings did publicize some embarrassing details about his work. In July, Litan testified before a Senate committee against a Department of Labor proposal to protect retirement accounts from unscrupulous fund managers. The rule would impose a fiduciary duty on investment professionals, requiring them to manage accounts in the best interests of their retiree clients, barring them from selecting investments simply because they come with side perks for the account manager. While well-intentioned, Litan argued, the DOL proposal will ultimately end up costing low-income savers a lot of money. This testimony raised quite a few eyebrows, since a great deal of credible research on the topic has reached the opposite conclusion. The Obama administration estimates Americans lose $17 billion a year from conflicted investment advice. And it turns out the study Litan conducted to draw this conclusion was paid for by the Capital Group -- an investment company actively fighting the DOL rule. The company paid him $38,800 and provided editorial input on the paper. Litan was introduced at the hearing as a Brookings fellow. And while his written testimony included a footnote disclosing the \"support\" he received from the Capital Group, nobody watching the event would have known that Litan was being paid by a financial firm with a stake in the outcome of the policy fight. Neither, for that matter, would the readers of a Washington Post letter to the editor by American Council of Life Insurers CEO Dirk Kempthorne, who cited Litan's work and his affiliation with Brookings but somehow forgot to mention who funded it. . . . Ousting neoliberals is as much a goal for the democratic party as ousting republican/teabaggers.", "external_links": [], "published": "2015-10-02T20:54:00.000+03:00", "crawled": "2015-10-03T10:49:14.866+03:00", "highlightTitle": ""}