{"organizations": [], "uuid": "15ef47000d5b92bd55f4c970408ab1407b3e62a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/22/Editorial-Opinion/Images/Was8975291.jpg", "site_section": "http://www.washingtonpost.com/opinions", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/benghazi-business-as-usual/2015/10/22/5a09b31e-7901-11e5-a958-d889faf561dc_story.html", "country": "US", "title": "The GOP’s unfortunate Benghazi hearing", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "The GOP’s unfortunate Benghazi hearing - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "15ef47000d5b92bd55f4c970408ab1407b3e62a4"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/benghazi-business-as-usual/2015/10/22/5a09b31e-7901-11e5-a958-d889faf561dc_story.html", "ord_in_thread": 0, "title": "The GOP’s unfortunate Benghazi hearing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hillary Clinton testifies before the House Select Committee on Benghazi on Capitol Hill on Oct. 22. (Saul Loeb/Agence France-Presse via Getty Images) By Editorial Board October 22 at 8:25 PM THE HOUSE Select Committee on Benghazi further discredited itself on Thursday as its Republican members attempted to fuel largely insubstantial suspicions about Hillary Clinton’s role in the 2012 Benghazi attacks. Grilling Ms. Clinton all day, they elicited little new information and offered little hope that their inquiry would find anything significant that seven previous investigations didn’t.\nIn fact, the highlight of the hearing came before lawmakers asked any question at all, in Ms. Clinton’s opening statement , as she offered a stout defense of the need for assertive U.S. diplomacy and engagement — even, or especially, when the circumstances are not ideal.\n“America must lead in a dangerous world, and our diplomats must continue representing us in dangerous places,” Ms. Clinton said. “We have learned the hard way when America is absent, especially from unstable places, there are consequences. Extremism takes root, aggressors seek to fill the vacuum, and security everywhere is threatened, including here at home.” It would be disastrous if future administrations held back in fear of politicized backlash if and when tragedies occurred.\nWhen questioning began, Ms. Clinton repeatedly pointed out that Ambassador J. Christopher Stevens, one of four Americans who died in the attacks, did not ask to pull out of Benghazi; in fact, he chose to travel there with knowledge that doing so carried significant risk. Republicans argued that those facts did not excuse the lack of significant diplomatic security in Libya, grilling Ms. Clinton on why more of Mr. Stevens’s requests for additional security were not honored.\nOn that, Ms. Clinton argued that she was not personally responsible for diplomatic security — the State Department’s security experts were — and she insisted that budget constraints limited how much security they could deploy around the world. She also pointed out that intelligence experts lacked knowledge about the dangers in eastern Libya around Sept. 11 and 12, 2012, and they knew of no credible threat to U.S. diplomats on those days in particular. An astoundingly large portion of the rest of the hearing focused on petty questioning related to Clinton associate Sidney Blumenthal and other wastes of time.\nMs. Clinton is not blameless. As she admitted, she had final responsibility for the actions of those who served under her. A State Department review found bureaucratic failures that contributed to the relatively light security in Benghazi. While it’s unreasonable to expect Ms. Clinton to have known about Mr. Stevens’s precise circumstances, she bears some blame for the bureaucratic context in which security decisions were made.\nYet the major, top-line policy fumble in Libya stemmed not from callousness or incompetence on Ms. Clinton’s part but from the Obama administration’s broader failure to live up to the vision of assertive U.S. engagement she articulated on Thursday. Had the United States devoted more effort and resources to helping the fledgling Libyan government, the country might well have been more stable in 2012 and since.\nAs she has on the campaign trail, Ms. Clinton hinted Thursday that she would use America’s international toolbox with ambition — “I believe, lead with diplomacy, support with development and, as a last resort, defense” — and probably more confidently than President Obama has. If the hearing was useful at all, it was in filling out her larger vision for U.S. foreign policy.\nRead more about this topic:\nRichard Cohen: The Benghazi panel is a scandal of a committee\nThe Post’s View: Benghazi debunked\nElijah Cummings: Republicans must stop derailing the Benghazi committee\nE.J. Dionne Jr.: Kevin McCarthy’s truthful gaffe on Benghazi", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T03:30:13.566+03:00", "highlightTitle": ""}