{"organizations": [], "uuid": "1cf74dd4b65defee56ae01c61a63348cccc4fe82", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz/politics/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/euthanasia-bill-pre-empts-important-national-conversation/5/234287", "country": "US", "title": "Euthanasia bill 'pre-empts important national conversation'", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Euthanasia bill 'pre-empts important national conversation'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:16:00.000+03:00", "replies_count": 0, "uuid": "1cf74dd4b65defee56ae01c61a63348cccc4fe82"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/euthanasia-bill-pre-empts-important-national-conversation/5/234287", "ord_in_thread": 0, "title": "Euthanasia bill 'pre-empts important national conversation'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Wednesday, 14 October, 2015 - 06:16 \nFamily First NZ says that a private members bill by ACT MP David Seymour on euthanasia is premature, and pre-empts an important national conversation that is just getting under way regarding assisted suicide and the ending of one’s life. \n\"David Seymour should wait for the Inquiry that he supported to be completed. Rather than a flawed euthanasia bill which will contain the same pitfalls as Maryan Street’s earlier proposed bill, it makes absolute sense to debate euthanasia within the wider context of the premature ending of one’s life. There has always been a concern about conflicting messages being sent regarding euthanasia and suicide. There are mixed messages when society wants to approve a person taking their life but also take a zero tolerance approach to other suicides,\" says Bob McCoskrie, National Director of Family First NZ. \n\"The country needs to have a robust honest debate about euthanasia without the emotion of a law change in the mix, and examine whether so-called safeguards deserve that label, whether coercion is subtle but real, and whether patients will ask themselves why they are not availing themselves of assisted suicide. The potential for abuse and flouting of procedural safeguards is a strong argument against euthanasia. Overseas experience proves that the risk of abuse cannot be eliminated.\" \n\"Allowing euthanasia could potentially institutionalise suicide as a method of coping with personal problems. The risk of ‘suicide contagion’ associated with a media campaign around promoting euthanasia is also a real concern,\" says Mr McCoskrie. \n\"We would argue that the international evidence confirms that to allow assisted suicide would place large numbers of vulnerable people at risk - in particular those who are depressed, elderly, sick, disabled, those experiencing chronic illness, limited access to good medical care, and those who feel themselves to be under emotional or financial pressure to request an early death because they don’t want to be a burden. This is not ‘autonomy’ or ‘choice’ or ‘dignified’.\" \n\"Voluntary euthanasia has the allure of being an enlightened and compassionate response to the plight of the suffering, but its practical operation is fraught with risks and there are slippery slopes that are indeed very slippery. There will be an irreversible alteration to the way society and medical professionals view the demise of the elderly, the disabled, the incurably afflicted and the terminally ill. Death will be planned, coordinated and state-sanctioned in a manner hitherto unknown,\" says Mr McCoskrie. \n\"David Seymour should put the brakes on his private members bill and allow the conversation to happen.\" \nAll articles and comments on Voxy.co.nz have been submitted by our community of users. Please notify us through our contact form if you believe an item on this site breaches our community guidelines .", "external_links": [], "published": "2015-10-13T21:16:00.000+03:00", "crawled": "2015-10-13T22:43:10.844+03:00", "highlightTitle": ""}