{"organizations": [], "uuid": "77f052fc91ae855f9cad94edbe86101b9885dbfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://pics.mcclatchyinteractive.com/wire_photos/cqj2bh/picture38678478/ALTERNATES/LANDSCAPE_1140/882Million%20Man%20March%20Anniversary.JPEG", "site_section": "http://www.bellinghamherald.com/news/politics-government/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Politics & Government News | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/news/politics-government/article38671377.html", "country": "US", "title": "The Latest on the Million Man March anniversary: Farrakhan", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "The Latest on the Million Man March anniversary: Farrakhan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T22:19:00.000+03:00", "replies_count": 0, "uuid": "77f052fc91ae855f9cad94edbe86101b9885dbfe"}, "author": "The Associated Press", "url": "http://www.bellinghamherald.com/news/politics-government/article38671377.html", "ord_in_thread": 0, "title": "The Latest on the Million Man March anniversary: Farrakhan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order Reprint of this Story WASHINGTON \nThe latest from the National Mall as thousands of African-Americans from across the country mark the 20th anniversary of the Million Man March, calling for changes in policing and in black communities. All times are local. \n--- \n2:30 p.m. \nNation of Islam leader Louis Farrakhan says black men and women should forsake foul language and violence against each other. \nFarrakan says that if things don't change in the black community, participating in the 20th anniversary of the Million Man March is just \"vanity.\" \nHe spoke out against using foul language against women, and against domestic violence and abortion. \nFarrakan says, \"It is your body, you can do what you want with it.\" But he added it would be tragic if a scientist or leader was aborted. \nFarrakhan also praised the young protesters behind Black Lives Matter. He called them the next leaders of the civil rights movement and called on older leaders to support them. \nHe asks: \"What good are we if we don't prepare young people to carry the torch of liberation to the next step?\" \n--- \n1:30 p.m. \nThe families of several unarmed African-American men and women killed in encounters with police have encouraged the crowd at the 20th anniversary of the Million Man March to continue to speak out against police misconduct. \nThe families have asked the marchers not to forget the names of Michael Brown, Trayvon Martin and Sandra Bland and not be silent about their deaths. \nMartin's mother, Sybrina Fulton, says: \"We will not continue to stand by and not say anything anymore.\" \nAttention has been focused on the deaths of unarmed black men since the shootings of 17-year-old Martin in 2012 in Florida and 18-year-old Michael Brown in 2014 in Ferguson, Missouri. \nAuthorities say Bland hanged herself in July in a Texas jail cell after a traffic stop, but her family disputes those findings. \n--- \n11:30 a.m. \nThousands of African-Americans crowded on the National Mall Saturday for the 20th anniversary of the Million Man March. \nWaving flags, carrying signs and listening to speeches and songs, the crowd gathered at the U.S. Capitol and spread down the Mall under on a sunny and breezy fall day. \nSouvenir vendors hawked t-shirts, signs, buttons and posters as people wove their way through security barricades surrounding the Capitol and other buildings on the mall. \nNate Smith of Oakland, California, attended the 1963 March on Washington and the 1995 Million Man March and said he was glad to be at Saturday's event. \nThe 70-year-old man said: \"It's something that I need to do. It's like a pilgrimage for me, and something I think all black people need to do.\" Related content", "external_links": [], "published": "2015-10-10T22:19:00.000+03:00", "crawled": "2015-10-10T23:44:54.989+03:00", "highlightTitle": ""}