{"organizations": [], "uuid": "db88d58b313b184d1c3c79acddef720eb0f3e536", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livemint.com", "main_image": "http://www.livemint.com/rf/Image-621x414/LiveMint/Period1/2015/10/05/Photos/solidwaste-kGUC--621x414@LiveMint.jpg", "site_section": "http://www.livemint.com/politics", "section_title": "Breaking Political News, Politics, Headlines &amp;amp; Opinion - Livemint", "url": "http://www.livemint.com/Politics/nKqRqSc05YhVepA1ShnBOP/Six-wastetoenergy-plants-to-be-set-up-under-Swachh-Bharat.html", "country": "IN", "title": "Six waste-to-energy plants to be set up under Swachh Bharat Mission", "performance_score": 0, "site": "livemint.com", "participants_count": 1, "title_full": "Six waste-to-energy plants to be set up under Swachh Bharat Mission - Livemint", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:32:00.000+03:00", "replies_count": 0, "uuid": "db88d58b313b184d1c3c79acddef720eb0f3e536"}, "author": "PTI", "url": "http://www.livemint.com/Politics/nKqRqSc05YhVepA1ShnBOP/Six-wastetoenergy-plants-to-be-set-up-under-Swachh-Bharat.html", "ord_in_thread": 0, "title": "Six waste-to-energy plants to be set up under Swachh Bharat Mission", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Delhi: In a significant step towards generating power from garbage under the Swachh Bharat Mission, six waste-to-energy plants with an installed capacity of about 74 MW will be commissioned next year including two in the national capital. “We have launched the waste-to-wealth scheme for which steps have been taken for commissioning of these waste-to-energy plants to produce a total 73.6 MW,” said a senior urban development ministry official.\nSolid Waste Management (SWM) is a crucial component of Swachh Bharat Mission. While a waste-to-energy plant is coming up at Ghazipur to produce 12 MW power by processing 2,000 tonnes waste per day, another plant will be commissioned at Narela-Bawana here to generate 24 MW power from waste. There will be two waste-to-energy plants producing 11 MW each in Jabalpur and Hyderabad, besides a 12.6 MW plant at Nalgonda in Telangana, and 3 MW plant in Chennai. These will be commissioned next year. The official said for making solid waste management (SWM) projects viable, there is a proposal to provide market development assistance and the government will also make it mandatory for the state electricity boards to procure power from these units.\nBesides the Central Electricity Regulatory Commission (CERC) is also working to determine the tariff for the power generated from waste-to-energy plants to boost their financial viability. In order to improve the scope for waste-to-energy projects, the official said power ministry is in the process of amending the Electricity Act, 2003 to include a provision for state electricity discoms to mandatorily purchase all power generated from municipal solid waste. A proposal to this effect is likely to come up before the cabinet soon.\nCERC is also working on determining a generic tariff for solid waste-to-energy projects. “Determination of generic tariff will boost the financial viability of waste-to-energy plants in the country,” he said.", "external_links": [], "published": "2015-10-05T08:32:00.000+03:00", "crawled": "2015-10-04T22:24:38.292+03:00", "highlightTitle": ""}