{"organizations": [], "uuid": "2065af1c602bbbc173ed15e20ddb41b118f89074", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.isthmus.com", "main_image": "http://www.isthmus.com/downloads/35105/download/Stage-WisconsinWrightsLogo-10012015.jpg?cb=7fc85d1fb2d9af74b40af537a7eb01f0", "site_section": "http://www.thedailypage.com/daily/rss.php", "section_title": "Isthmus : Madison, Wisconsin : News, Politics, Music, Movies, Restaurants, Calendar of Events", "url": "http://www.isthmus.com/arts/stage/three-plays-debut-wisconsin-wrights-festival/", "country": "US", "title": "Audience testing", "performance_score": 0, "site": "isthmus.com", "participants_count": 1, "title_full": "Audience testing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T12:00:00.000+03:00", "replies_count": 0, "uuid": "2065af1c602bbbc173ed15e20ddb41b118f89074"}, "author": "Amanda Finn", "url": "http://www.isthmus.com/arts/stage/three-plays-debut-wisconsin-wrights-festival/", "ord_in_thread": 0, "title": "Audience testing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expand It’s tough for playwrights to know whether their work will resonate with audiences until it is performed. That’s where the Wisconsin Wrights New Play Festival comes in. \nForward Theater Company is producing the three-day event, which includes public readings of three plays chosen from 18 total submissions. Performances take place at the Memorial Union’s Fredric March Play Circle Oct. 1-3. \nAccording to artistic director Jennifer Uphoff Gray, Forward chose plays that “were sufficiently developed in that they were already telling a complete story and showed substantial promise in the writing.” They were looking for new work that would benefit from the experience of working with professional actors and directors, she adds. \nThe Oct. 1 reading, In a Clearing, by Madisonian Karen Saari, focuses on Mark, a recovering alcoholic in a rural community struggling to regain control of his life. \nFaithless, on Oct. 2, by Michael Proft, is a fictionalized account of interviews between journalist Sibyl Wilford O’Bryne and Mary Baker Eddy, the founder of Christian Science. \nOn Oct. 3, audiences will get a first look at American Players Theatre veteran James DeVita’s adaptation of Erin Celello’s book, Learning to Stay , which explores an injured veteran’s adjustment to post-war life and marriage. \nGray calls the festival “an investment in local writing talent.” \n“On a more global scale, if we want to continue to see plays that speak to our world and to our concerns, we sometimes need to invest our resources in the creation of new works. That’s why we do this.” Tags", "external_links": [], "published": "2015-10-02T12:00:00.000+03:00", "crawled": "2015-10-02T20:23:11.968+03:00", "highlightTitle": ""}