{"organizations": [], "uuid": "311d75e7614da61c62bb02f0fca673a9f5071647", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/3d/c4/76b0b6bc430a8f383692d1bd8272/151014-medicareenrollment-stock.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/15/seniors-miss-out-on-social-security-bump", "country": "US", "title": "Seniors Miss Out on Social Security Bump", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Seniors Miss Out on Social Security Bump - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "311d75e7614da61c62bb02f0fca673a9f5071647"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/15/seniors-miss-out-on-social-security-bump", "ord_in_thread": 0, "title": "Seniors Miss Out on Social Security Bump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seniors Stung by No Social Security Bump And the lack of a cost-of-living increase isn't the only thing that could hit older Americans right in the pocketbook. This is only the third year in the last 40 that seniors won't get a Social Security benefit increase.\nBy Andrew Soergel Oct. 15, 2015 | 6:51 p.m. EDT + More It might be a good time to check in on Grandma.\nThat's because she and millions of other older Americans just missed out on a boost to Social Security benefits that would've helped blunt the rising costs connected to their everyday lives. And they also might be dependent on a fractured Congress to step in before their Medicare premiums soon skyrocket.\nThe Social Security Administration's announcement Thursday that there would be no upward adjustment to the income benefits paid out to nearly 65 million Americans in 2016 marks only the third time in the past 40 years that an annual adjustment will not be made to account for rising food, rent and utility prices.\nSocial Security benefits account for about 39 percent of the income received by individuals at least 65 years old, according to the Social Security Administration , while only about 3 percent of the population between 60 and 89 years old doesn't receive any benefits.\nRELATED\nSeptember Prices in U.S. Still Shy of Fed's Goal \"It's a really bad knock for seniors. It's become the single-biggest issue for our membership,\" says Sean Ferritor, executive director of advocacy group The Seniors Coalition.\nMeanwhile, the prices of goods and services that many senior citizens rely on have skyrocketed over the last several years. A recent study conducted by the The Senior Citizens League found that Social Security beneficiaries in 2015 have 22 percent less purchasing power than they had in 2000. The prices paid for heating oil have climbed 159 percent over that 15-year period, while general homeownership costs jumped 44 percent. Out-of-pocket medical expenses expanded 30 percent.\n\"Seniors spend far more on health care and heating and cooling their homes than on televisions or new cars. We owe it to them to make sure we truly account for the real costs they incur,\" Rep. John Larson, D-Conn., said in a statement Thursday.\nEven within the last year, price tags on necessary expenses have inched up. Prescription drug costs ballooned 4.2 percent in September from a year earlier, while medical care services were up 2.4 percent, according to the Labor Department . Water, sewer and trash collection services have climbed 4.8 percent in the last year. Food costs are up 1.6 percent, with egg prices alone sitting 36.2 percent higher than where they were a year ago.\n\"Milk, eggs – everything that seniors use is going up. And the main statistic they use to cite lower inflation is gas prices, which are manipulated worse than the Chinese currency every year,\" Ferritor says.\nSo why no increase? Because, as Ferritor alludes to, energy prices figure prominently in the rationale for passing on an annual benefit boost. The steep declines Americans have seen in gasoline and fuel prices in the last year have essentially offset the rising costs of food, medical care and other day-to-day necessities. So when the government tallied up price increases in the U.S. over the past year, it could comfortably say that the cost of living in the U.S. hadn't risen.\nBut that isn't the whole picture.\nRELATED\nRetail Sales Fall Short as Holiday Season Looms The Social Security Administration points to a pricing index known as the Consumer Price Index for Urban Wage Earners and Clerical Workers, or CPI-W. On a fundamental level, the CPI-W tracks prices paid for an assorted basket of goods and services by a relatively small subset of the U.S. population.\nDragged down by low energy prices, that CPI-W measure fell 0.3 percent in September and was ultimately down 0.6 percent from where it was a year ago. And since \"there was no increase in the CPI-W from the third quarter of 2014 to the third quarter of 2015,\" the Social Security Administration said that \"under existing law, there can be no [cost of living adjustment] in 2016.\"\nA catch, however, is that seniors typically don't necessarily reap the rewards of low gas prices. While about 78 percent of Americans at least 70 years old were licensed drivers in 2013, according to the Insurance Institute for Highway Safety , drivers in that age range are estimated to drive about 45 percent fewer miles than those in middle age.\n\"A lot of these people who rely on Social Security are in their 80s and 90s. They don't drive,\" Ferritor says.\nWhat's more, a legislative provision tied to both Social Security and Medicare could cause medical care premiums to explode for millions of Medicare recipients.\nAccording to the Social Security Administration, existing legislation protects about 70 percent of Medicare recipients from an increase in their Medicare Part B premiums in a year that a cost of living adjustment isn't provided. The idea behind the carve-out is that the majority of seniors shouldn't have to pay more money for medical treatment in a year they aren't receiving more money in the form of benefits.\nThe problem is the remaining beneficiaries – 30 percent, made up primarily of new registrants, federal retirees and particularly wealthy senior citizens – are left to pick up the slack and pay for the increased prices the majority is exempt from.\nRELATED\nFortune Favoring the Freelance Economy \"This is about more than just money. It is about basic fairness,\" Richard Thissen, president of the National Active and Retired Federal Employees Association, said in a statement earlier this month.\nMany are now calling on Congress to step in and pass legislation that would either enact revisions to the cost-of-living adjustment methodology or protect senior citizens from paying more than their fair share in Medicare premiums – or both.\nFerritor says The Seniors Coalition has supported Rep. Eliot Engel, D-N.Y., in his bid to launch an automatic 3 percent annual cost-of-living adjustment and has put together a petition drive backing such legislation.\nThe AARP also sent a letter to Congress this week, calling on Washington to \"reduce and mitigate the impact of the sudden, sharp increases\" millions of Americans would face in Medicare premiums.\n\"Social Security recipients spend more of their monthly budget on health care, food and housing than do younger workers, and all three of those categories have experienced meaningful price increases over the past year,\" Nancy LeaMond, AARP's chief advocacy and engagement officer, said in the organization's letter to Congress. \"If the [cost-of-living adjustment] was based on a measure which more accurately reflected the living expenses of seniors, there would have been [an increase] for 2016.\"\nTAGS: social security Social Security Administration Medicare economy", "external_links": ["http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe8jff%3Fsrc=usn_li&title=Seniors%20Miss%20Out%20on%20Social%20Security%20Bump&summary=And%20the%20lack%20of%20a%20cost-of-living%20increase%20isn%27t%20the%20only%20thing%20that%20could%20hit%20older%20Americans%20right%20in%20the%20pocketbook.&source=U.%20S.%20News", "http://www.bls.gov/news.release/cpi.t02.htm", "http://www.senior.org/index.php/2-uncategorised/93-cola-lead-sponsor-eliot-engel-receives-your-signed-petitions-in-favor-of-hr-1585", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe8jff%3Fsrc=usn_rd&title=Seniors%20Miss%20Out%20on%20Social%20Security%20Bump", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe8jff%3Fsrc=usn_gp", "http://www.iihs.org/iihs/topics/t/older-drivers/qanda#cite-text-0-0", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe8jff%3Fsrc=usn_tw&via=usnews&text=Seniors%20Miss%20Out%20on%20Social%20Security%20Bump", "https://www.ssa.gov/news/press/basicfact.html", "https://www.ssa.gov/news/press/releases/#/post/10-2015-1", "http://seniorsleague.org/2015/social-security-benefits-lose-22-of-buying-power-since-2000/", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe8jff%3Fsrc=usn_fb", "https://www.ssa.gov/retirementpolicy/fact-sheets/never-beneficiaries.html", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe8jff%3Fsrc=usn_su"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T02:01:22.494+03:00", "highlightTitle": ""}