{"organizations": [], "uuid": "f69fe8a7d401c1b5fb7ab6e3db7cd3f92527bb74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://www.yallpolitics.com/index.php/yp/atom", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/21_county_sheriffs_endorse_hurstforag/", "country": "US", "title": "21 County Sheriffs endorse @HurstForAG", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "21 County Sheriffs endorse @HurstForAG", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:00:00.000+03:00", "replies_count": 0, "uuid": "f69fe8a7d401c1b5fb7ab6e3db7cd3f92527bb74"}, "author": "Frank Corder", "url": "http://yallpolitics.com/index.php/yp/post/21_county_sheriffs_endorse_hurstforag/", "ord_in_thread": 0, "title": "21 County Sheriffs endorse @HurstForAG", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RELEASE: 21 Sheriffs Endorse Mike Hurst for Attorney General Calhoun, DeSoto, George, Hancock, Harrison, Jackson, Jones, Lamar, Lauderdale, Lawrence, Leake, Lee, Lincoln, Madison, Marion, Neshoba, Newton, Pike, Rankin, Scott, Simpson counties sheriffs endorse Hurst Today Republican Mike Hurst announced the endorsements of 21 sheriffs, including a Democrat, in support of Hurst’s campaign for Attorney General. “While prosecuting illegal immigration and public corruption cases as Assistant U.S. Attorney, I frequently worked with county sheriffs who serve as the top law enforcement official in their communities. Sheriffs and their teams serve their neighbors and frequently put themselves in harms’ way to protect all of us. Unfortunately, many of them have not received the support and assistance they should expect from our Attorney General's Office. I’m honored these law enforcement leaders would endorse my campaign, and I pledge as Attorney General to work with them and all Mississippi sheriffs and law enforcement to foster a better working relationship in serving the people of Mississippi,” Hurst said. Leake County Sheriff Greg Waggoner expressed his support of Hurst in a web video saying, “Mike has done a wonderful job. He's the type of prosecutor that law enforcement guys like. He makes our job easy. He makes us look good. We need people like Mike Hurst in that type of position. I'm very proud to be able to know Mike Hurst and to say I’ve worked with Mike Hurst. He is an honest man of the upmost integrity.” You can view the web video and listen to Waggoner discuss the case “Mississippi Hustle” he and Hurst worked on that brought down a corrupt mayor and eventually Mississippi Department of Corrections Commissioner Chris Epps here: https://youtu.be/q53yO-9qU7s online. Simpson County Sheriff Ken Lewis discussed a case of a corrupt police chief he investigated and Mike Hurst prosecuted in a television ad saying, “\"I called Attorney Hood's office, asked them if they would come help me to investigate this police chief because we had had other allegations on him. I was looking for a confidential investigation with the AG's Office and when I would talk to the investigators it always came right back to the police chief. Jim Hood's office looked out for their buddy more than he did for the citizens of the United States and the state of Mississippi. The Attorney General's Office actively interfered in my investigation. Jim Hood turned a blind eye to the problems with public corruption in Simpson County. And my office, along with Mike Hurst, put a public official in jail.\" You can view the full version of the ad here: https://youtu.be/1PClE2E-DCk online. At a press conference in front of the U.S. Courthouse in Gulfport in late September, Hancock County Sheriff Ricky Adam, Harrison County Sheriff Melvin Brisolara, and Jackson County Sheriff Mike Ezell announced their endorsements and support of Hurst. Harrison County Sheriff-Elect Troy Peterson also endorsed Hurst and said in a statement, “As Sheriff Elect of Harrison County and a law enforcement veteran, I want an Attorney General I can call personally, tell him we have a problem and know that when I hang up the phone, the case is being handled professionally and promptly. Mike Hurst will be that Attorney General. Mike is serious about crime but more importantly, convicting those who commit those crimes. I am certain that Mike will respond to law enforcement, assist with our criminal investigations and be the positive advocate we need in Mississippi by helping law enforcement across this state to protect the citizens were are all sworn to serve. I am convinced Mike Hurst will put Mississippi priorities first, protect the people of this great state and uphold the Office of Attorney General with integrity and transparency.” In his endorsement, Madison County Sheriff Randy Tucker said, \"I respect Mike Hurst, his commitment to the law, and his focus on putting the bad guys in jail. He is a man of integrity who I know will serve all Mississippians as attorney general.” List of Sheriffs Endorsing Republican Mike Hurst for Attorney General Greg Pollan - Calhoun County", "external_links": [], "published": "2015-10-23T00:00:00.000+03:00", "crawled": "2015-10-23T09:47:27.783+03:00", "highlightTitle": ""}