{"organizations": [], "uuid": "c675ab1c93688b86e9c0d0d9c6a6d5d01eb7f8a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livemint.com", "main_image": "http://www.livemint.com/rf/Image-621x414/LiveMint/Period1/2015/10/09/Photos/samsung.JPG", "site_section": "http://livemint.com//rss/economy_politics", "section_title": "economy_politics", "url": "http://www.livemint.com/Politics/Po3Lx6G1XOX3u8jqQGvTcL/Samsungs-Lees-top-Asias-richest-families-list.html", "country": "IN", "title": "Samsung’s Lees top Asia’s richest families list", "performance_score": 0, "site": "livemint.com", "participants_count": 2, "title_full": "Samsung’s Lees top Asia’s richest families list - Livemint", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:49:00.000+03:00", "replies_count": 1, "uuid": "98735a0f8855f617fb9736085287df5a13a6987f"}, "author": "AFP", "url": "http://www.livemint.com/Politics/Po3Lx6G1XOX3u8jqQGvTcL/Samsungs-Lees-top-Asias-richest-families-list.html#post-0", "ord_in_thread": 0, "title": "Samsung’s Lees top Asia’s richest families list", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Singapore: South Korea’s Lee family, which controls the formidable Samsung conglomerate, topped an inaugural list of Asia’s 50 richest families published on Thursday by Forbes Asia magazine.\nThe family had a net worth of $26.6 billion as of late September, with second- and third-generation members now running more than 50 businesses, the magazine said.\nThe Samsung empire, founded in 1938 by wealthy landowner’s son Lee Byung-Chull, has diversified interests ranging from mobile phones to construction and shipbuilding.\nForbes Asia said Samsung, the biggest of the “chaebol” or family-run conglomerates dominating South Korea’s economy, accounted for 22% of the country’s gross domestic product (GDP) in 2014.\n“Nearly half of the richest families in Asia are of Chinese descent, yet none of the inaugural 50 is based in the mainland, where conglomerates are young, run by the first generation,” it said in a report.\nThe second richest is the Hong Kong Chinese family, also surnamed Lee, which controls Henderson Development and boasts a fortune of $24.1 billion.\nThe third richest are the Ambanis of India’s Reliance Group with a combined net worth of $21.5 billion, followed by Thailand’s Chearavanont family with $19.9 billion, generated from the agriculture-based Charoen Pokphand group.\nRounding out the top five is the Kwok family, which controls Hong Kong’s Sun Hung Kai property empire, with a combined net wealth of $19.5 billion.\nOnly families with business involvement extending to at least three generations were included in the survey, the magazine said.\nThe family of Hong Kong tycoon Li Ka-shing, who has a current net worth of $25 billion based on a Forbes global list, was excluded because he has no grandchildren who have taken serious roles in the family business, it said.\nThe estimates of family fortunes were based on stock prices and exchange rates at the close of markets on 25 September.\nThe top 10 richest families in Asia on the Forbes Asia list with their main businesses:\n1) Lee from South Korea (Samsung): US$26.6 billion\n2) Lee from Hong Kong (Henderson): $24.1 billion\n3) Ambani from India (Reliance): $21.5 billion\n4) Chearavanont from Thailand (Charoen Pokphand): $19.9 billion\n5) Kwok from Hong Kong (Sun Hung Kai): $19.5 billion\n6) Kwek/Quek from Singapore, Malaysia (Hong Leong): $18.9 billion\n7) Premji from India (Wipro): $17 billion\n8) Tsai from Taiwan (Cathay Financial): $15.1 billion\n9) Hinduja from India, Britain (Hinduja Group): $15 billion\n10) Mistry from India (Shapoorji Pallonji Group): $14.9 billion", "external_links": [], "published": "2015-10-08T19:49:00.000+03:00", "crawled": "2015-10-09T21:05:43.116+03:00", "highlightTitle": ""}