{"organizations": [], "uuid": "5805fa6ff59471c43c6a79e7ba44678f9e75740c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13571/political-news", "section_title": "Political News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30252910/bergdahl-lawyer-accuses-mccain-of-interfering-in-case", "country": "US", "title": "Bergdahl lawyer accuses McCain of interfering in case", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Bergdahl lawyer accuses McCain of interfering in case - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "5805fa6ff59471c43c6a79e7ba44678f9e75740c"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30252910/bergdahl-lawyer-accuses-mccain-of-interfering-in-case", "ord_in_thread": 0, "title": "Bergdahl lawyer accuses McCain of interfering in case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By DEB RIECHMANN\nAssociated Press WASHINGTON (AP) - The lawyer for Sgt. Bowe Bergdahl, who walked off his post in Afghanistan and was held by the Taliban for five years, has accused Republican Sen. John McCain of exerting \"congressional influence\" in his client's case.\nBergdahl was charged in March with desertion and misbehavior before the enemy, a charge that carries up to life in prison. But Lt. Col. Mark Visger recently recommended that there be no prison time or punitive discharge against Bergdahl.\nMcCain, who is chairman of the Senate Armed Services Committee, told the Boston Herald last weekend that he'll hold a hearing about the case if Bergdahl is not punished for leaving his post in June 2009.\n\"If it comes out that he has no punishment, we're going to have to have a hearing in the Senate Armed Services Committee,\" McCain told the newspaper. \"And I am not prejudging, OK, but it is well known that in the searches for Bergdahl, after - we know now - he deserted, there are allegations that some American soldiers were killed or wounded, or at the very least put their lives in danger, searching for what is clearly a deserter. We need to have a hearing on that.\"\nIn court papers filed Monday in the U.S. Court of Appeals for the Armed Forces, Bergdahl's lawyer, Eugene Fidell, said McCain's comments amount to \"unlawful congressional influence.\" Fidell also wrote that a nomination to fill a vacancy on the court is pending before McCain's committee and that steps should be taken to avoid any conflict of interest. McCain's committee also votes on promotions for military officers.\nLast year, five senior Taliban figures were released from the U.S. prison at Guantanamo in exchange for the Army sergeant who had disappeared from his post in Paktika province in eastern Afghanistan on June 30, 2009. The five from the Taliban were transferred to Qatar.\nRepublicans were furious that the Obama administration failed to give 30-days notice to Congress.\nLast month, the commanders of Bergdahl's platoon, company and battalion testified in a court hearing that his disappearance from his post in Afghanistan six years ago put a strain on their forces and put his fellow soldiers in danger.\nBergdahl's battalion commander, Col. Clinton Baker, said that although no soldiers died as part of the search, there was a spike in improvised explosive device attacks because soldiers were going to places they ordinarily wouldn't have gone. He also said he had to put counter-insurgency efforts on hold due to the search and that it hurt partnerships with the Afghan government and Afghan forces.\nA spokesman for the Senate committee said Tuesday that it would continue its oversight into the Bergdahl matter.\nCountering the complaint that McCain is interfering, the panel said: \"Chairman McCain wants the legal proceedings to run their course before making a determination how best to continue the committee's oversight work.\"\n ", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-16T07:34:46.310+03:00", "highlightTitle": ""}