{"organizations": [], "uuid": "c65381378fe2838ed82d54a6e9fe2c1f6f3601a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/digital/images/FBSharingIcons_dispatch.png", "site_section": "http://www.dispatch.com/content/syndication/news_ohio_politics.xml", "section_title": "Political News - Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/21/paul-ryan-pat-tiberi.html", "country": "US", "title": "Speaker job for Paul Ryan could mean chairmanship for Pat Tiberi", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Speaker job for Paul Ryan could mean chairmanship for Pat Tiberi | The Columbus Dispatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:46:00.000+03:00", "replies_count": 0, "uuid": "c65381378fe2838ed82d54a6e9fe2c1f6f3601a1"}, "author": "The Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/21/paul-ryan-pat-tiberi.html", "ord_in_thread": 0, "title": "Speaker job for Paul Ryan could mean chairmanship for Pat Tiberi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON — Should Rep. Paul Ryan become the next Speaker of the House, Rep. Pat Tiberi will be a front-runner to head the powerful House Ways and Means Committee, the key tax-writing committee for the U.S. House of Representatives.\nTiberi, R-Genoa Township, has been a senior member of the committee and currently chairs its trade subcommittee. Breann Gonzalez, a spokesperson for Tiberi, said Tiberi’s current focus is on getting Ryan elected speaker.\n“If Chairman Ryan becomes speaker, Congressman Tiberi would be honored to be the next chairman of the Ways and Means Committee,” she said.\nRep. Kevin Brady, R-Texas, who ran for the chairmanship at the beginning of the current Congress, is thought to also be a possible contender for that chairmanship as well. Brady declined to say whether he’d run Wednesday, saying instead his focus is on getting Ryan elected speaker.\nWere Tiberi to ascend to the chair, it would mean an Ohioan would take a powerful chairmanship at a time when Boehner, the first speaker from Ohio since the 1930s, is stepping down.\n“It would be great for Ohio, but more important it would be great for America,” said Rep. Steve Stivers, R-Upper Arlington. “Pat’s shown his leadership on the Select Committee for Revenue in the last Congress and now on the Trade subcommittee. The biggest bill to come out of Ways and Means this Congress has been under Pat’s leadership. He’s a leader, he’s a team player, but he works with members and will help solve the problems of this committee inside this committee.”\n“Pat would be a tremendous chairman of any committee he’s on, but Ways and Means is one of the best,” said Rep. Dave Joyce, R-Russell Township.\nBut there’s a lot that must happen before Tiberi can formally pursue the chairmanship.\nFirst, Ryan, who signaled an interest in the speaker position on Tuesday, must formally decide to run. Ryan, the 2012 GOP vice-presidential nominee, laid out a series of conditions that would need to be met before he could run.\nKey among them: He must have the endorsement of three major groups within the GOP caucus, including the Freedom Caucus, the conservative group led by Rep. Jim Jordan, R-Urbana, that gave current Speaker John Boehner, R-West Chester, fits throughout his time as speaker and whose constant dissent contributed to Boehner’s decision to step down.\nMembers of the Freedom Caucus in particular are concerned about a Ryan request to change House rules in order to make it more difficult to oust him during the middle of a congressional session. Boehner’s resignation came after a North Carolina Republican threatened to make a motion to “vacate the chair,” a legislative maneuver that would’ve overthrown Boehner that has not been used for years.\nRyan also made it clear that were he to serve, he would not be able to fill the big fundraising shoes left by Boehner, who raised millions for members of his party. Ryan has small children and travels home to Janesville, Wis., on weekends and has little interest in changing that routine.\nRyan’s decision comes after House Majority Leader Kevin McCarthy, R-Calif., abruptly decided not to run for Speaker two weeks ago.\nRyan has said he wants the endorsement of three key GOP groups before Friday. The election will occur on Wednesday.\nMany Ohio Republicans — including Boehner — support Ryan for speaker, arguing he’ll be able to unify a fractured caucus.\n“I’m totally supportive of him,” said Stivers, who said if Ryan is not elected “there is no Plan C.”\n“If you can’t agree on a guy like Paul Ryan, you’re not going to agree on anybody,” said Joyce.\n“I think Paul Ryan would make a great speaker,” said Boehner. “But this decision is up to the members.”\nRyan actually got his political start volunteering for one of Boehner’s campaigns when Ryan was in college. He is a graduate of Miami University in Oxford, Ohio.\nBut support for Ryan was far from unanimous.\n“This is a big job,” said Rep. Tim Huelskamp, a Jordan ally and a Republican from Kansas. “It’s two heartbeats away from the presidency and it’s not to be taken lightly. And I don’t think we should rush through this.”\nJordan, meanwhile, told Fox News on Wednesday morning that Ryan was a “good spokesman” who has been a “good messenger” for Republicans.\nBut he stopped short of endorsing him for speaker. “We all like Paul,” he said. “Paul’s a good friend. We want to make sure there will be changes that we think will make an environment more conducive to the environment that we told voters we would accomplish.”\nJordan said he wasn’t rattled by the uncertainties. “This is how this place is supposed to work,” he said. “You have a real debate. You decide, you work things out. Sometimes it gets a little messy.”\njwehrman@dispatch.com\n@jessicawehrman", "external_links": [], "published": "2015-10-21T23:46:00.000+03:00", "crawled": "2015-10-21T23:26:13.896+03:00", "highlightTitle": ""}