{"organizations": ["Facebook Email Twitter Google", "Facebook", "AP"], "uuid": "056402358d850e420f7ac92805c2b1dae3517e64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://cdn.tegna-tv.com/-mm-/6bad109db5b1fb2e6169e669b4e6ca023d0d6657/c=0-14-1000-579&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/23/WTSP/WTSP/635812028330630196-Jeb-Bush.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/108343012/wtsp/politicsandelections", "section_title": "WTSP - Politics", "url": "http://www.wtsp.com/story/news/politics/elections/2015/10/23/jeb-bushs-struggling-campaign-cuts-pay-staff-positions/74464232/", "country": "US", "title": "Jeb Bush's struggling campaign cuts pay, staff positions", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Jeb Bush's struggling campaign cuts pay, staff positions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T20:14:00.000+03:00", "replies_count": 0, "uuid": "056402358d850e420f7ac92805c2b1dae3517e64"}, "author": "", "url": "http://www.wtsp.com/story/news/politics/elections/2015/10/23/jeb-bushs-struggling-campaign-cuts-pay-staff-positions/74464232/", "ord_in_thread": 0, "title": "Jeb Bush's struggling campaign cuts pay, staff positions", "locations": ["USA", "Georgia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pinterest Jeb Bush", "Jeb Bush", "John Bazemore", "David Jackson"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Jeb Bush's struggling campaign cuts pay, staff positions His presidential campaign under fire from donors, Jeb Bush is cutting his payroll while focusing more on the early contests in the 2016 contest. Post to Facebook Jeb Bush's struggling campaign cuts pay, staff positions His presidential campaign under fire from donors, Jeb Bush is cutting his payroll while focusing more on the early contests in the 2016 contest. Check out this story on wtsp.com: http://on.wtsp.com/1LSfX49 Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Jeb Bush's struggling campaign cuts pay, staff positions David Jackson, USA TODAY 1:14 p.m. EDT October 23, 2015 Jeb Bush, tailgating last month in Georgia. (Photo: John Bazemore, AP) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nHis presidential campaign under fire from donors, Jeb Bush is cutting his payroll while focusing more on the early contests in the 2016 contest. \n“We are moving our resources into the states to ensure that voters in primary and caucus states are introduced to his record and vision for the future,” said Bush spokeswoman Allie Brandenburger. \nThe emphasis will now be on Iowa, which opens the nominating process with caucuses on Feb. 1, as well as the three other states that pick convention delegates that month: New Hampshire, South Carolina and Nevada. \nBush has said his campaign is making an especially intense effort in New Hampshire, site of the race’s first primary on Feb. 9. \n“We are making changes today to ensure Jeb is best positioned to win the nomination and general election,” Brandenburger said in a statement. “Jeb is the one candidate with a proven conservative record, bold ideas and the strong leadership needed to fix the problems America faces.” \nOnce considered a front-runner for GOP nomination, Bush — the son and brother of previous presidents — now finds himself in the middle of a crowded pack in many Republican polls. The well-funded Bush campaign has taken flak from some its donors over its performance to date. \nThe ex-Florida governor has lost ground to Donald Trump, Ben Carson and other “outsider” candidates. A number of Republican voters have questioned whether a “third Bush” can win the presidency. \nAs first reported by Bloomberg Politics : The campaign is parting ways with some consultants and downsizing its staff at their Miami headquarters in moves that will save more than $1 million per month and cut payroll by 40 percent this week, according to Bush campaign officials who requested anonymity to speak about internal changes. The campaign is also cutting back 45 percent of its budget, except for dollars earmarked for TV advertising and spending for voter contacts, such as phone calls and mailers. Some senior level staff and consultants will continue to work with the campaign on a volunteer basis, while other junior level consultants, primary in finance but including other areas, will be let go, the officials said. The officials declined to say who would be removed from the payroll or provide an exact dollar figure for the savings.", "external_links": [], "published": "2015-10-23T20:14:00.000+03:00", "crawled": "2015-10-23T20:51:26.805+03:00", "highlightTitle": ""}