{"organizations": ["Catholic University", "House Freedom Caucus", "GOP", "House"], "uuid": "4a0c239006004c7c66baabdbd6b4a8287276d607", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_144571918214926.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/politics/index.rss2", "section_title": "Politics", "url": "http://www.startribune.com/the-reluctant-speaker-risks-loom-large-for-wisconsin-rep-paul-ryan/336666841/", "country": "US", "title": "The reluctant speaker: Risks loom large for Wisconsin Rep. Paul Ryan", "performance_score": 0, "site": "startribune.com", "participants_count": 0, "title_full": "The reluctant speaker: Risks loom large for Wisconsin Rep. Paul Ryan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T00:53:00.000+03:00", "replies_count": 0, "uuid": "4a0c239006004c7c66baabdbd6b4a8287276d607"}, "author": "", "url": "http://www.startribune.com/the-reluctant-speaker-risks-loom-large-for-wisconsin-rep-paul-ryan/336666841/", "ord_in_thread": 0, "title": "The reluctant speaker: Risks loom large for Wisconsin Rep. Paul Ryan", "locations": ["R-Maine", "Washington", "R-Ohio", "WASHINGTON", "R-Ala.", "Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Matthew Green", "Reagan", "Jack Kemp", "James Blaine", "Ryan", "Paul Ryan", "Mo Brooks", "John Boehner", "Newt Gingrich", "Gregg Harper"], "text": "  WASHINGTON – Poised to become the next House speaker, Republican Rep. Paul Ryan finds himself in a position he once seemed eager to avoid: leading an unforgiving GOP majority that is not sure it wants him. Risks loom large for the Wisconsin congressman, who failed to secure all the conditions he demanded as trade-offs for taking the job. Instead, Ryan now appears willing to settle for less than complete support from the conservative base as he tries to steer the GOP away from dysfunction and redefine the speaker’s office on his terms. Late Thursday, Ryan in a letter to colleagues made it official: “I am ready and eager to be our speaker.” The road ahead will not be easy. But if Ryan can emerge intact from the next few weeks of budget and debt battles, he could potentially transform the job into one he wants — allowing him to utilize his skill set as the party’s visionary spokesman during a presidential election year. “What Ryan has created is this window of opportunity that may allow him to be a little bit flexible,” said Matthew Green, a politics professor at Catholic University. “He’s got to find a way to avoid crises. … Then he’s got to find a way to reunify his party.” Ryan was mentored during his early years in Washington by former Housing Secretary Jack Kemp, a mastermind of Reaganomics. Ryan modeled his rise on President Reagan’s sunny optimism in pursuit of small-government tenets. At 45, Ryan will be the youngest speaker since 1869, after the Civil War, when 39-year-old Rep. James Blaine, R-Maine, took the job. Historically, speakers have been an older and grayer sort, but Ryan is expected to shift away from the era of backroom deal-making and toward big-picture thinking. The most recent model for the visionary speaker was Newt Gingrich, who wowed voters in the GOP until his top-down style resulted in an internal coup that did him in. Ryan’s backers are counting on the nine-term congressman’s ability to articulate a conservative message for the 2016 campaign. “His ability to speak to people who aren’t necessarily conservative will be vital going into the election,” said Rep. Gregg Harper, R-Miss. Ryan wanted to become speaker only if he could have some assurances that the conservative forces that pushed Speaker John Boehner, R-Ohio, to early retirement would give him a chance to lead. On Wednesday, two-thirds of the members of the House Freedom Caucus agreed to back Ryan, short of a full endorsement. Some conservatives are concerned about Ryan’s reluctance to fight for the speaker’s job, questioning whether he might prefer they withhold their support. “The impression I got speaking to Paul Ryan is that he would be somewhat thankful if he did not have to be speaker of the House,” said Rep. Mo Brooks, R-Ala., a Freedom Caucus member.", "external_links": [], "published": "2015-10-25T00:53:00.000+03:00", "crawled": "2015-10-25T01:57:21.787+02:00", "highlightTitle": ""}