{"organizations": [], "uuid": "f67924ac8396c4790406da071ea94d52c84c60e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nymag.com", "main_image": "http://pixel.nymag.com/imgs/fashion/daily/2015/10/04/04-slutwalk-la-lede.w1200.h630.jpg", "site_section": "http://nymag.com/thecut/", "section_title": "The Cut – Fashion, Beauty, Politics, Sex and Celebrity", "url": "http://nymag.com/thecut/2015/10/amber-rose-populist-slut-hero-of-our-time.html", "country": "US", "title": "Amber Rose, Populist Slut Hero of Our Time", "performance_score": 0, "site": "nymag.com", "participants_count": 1, "title_full": "Amber Rose, Populist Slut Hero of Our Time -- The Cut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T06:40:00.000+03:00", "replies_count": 0, "uuid": "f67924ac8396c4790406da071ea94d52c84c60e0"}, "author": "Allison P. Davis", "url": "http://nymag.com/thecut/2015/10/amber-rose-populist-slut-hero-of-our-time.html", "ord_in_thread": 0, "title": "Amber Rose, Populist Slut Hero of Our Time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Nathaniel Wood\n“Amber Rose is feminist as fuck.” A young woman wearing a hot-pink T-shirt as a dress, the president of her campus feminist club, shared this sentiment with me Saturday morning at the inaugural Amber Rose SlutWalk Los Angeles.\nMost of the crowd seemed to be of the same opinion. Everyone was in their full slut regalia — leather jackets with no shirt underneath, teddies, see-through dresses, and a lot of thongs over tights. Some had skipped tops altogether and wore pasties or black tape over their nipples and scrawled messages like “No Shame in My Slut Game” on their stomachs and backs. There were women and men of all colors and sizes hoisting signs like “My Pussy, My Choice,” and, because it was an all-inclusive event with no orifice left out, “My Anus, My Choice.” There were actual clowns in clown costumes holding up signs that said “Clowns for Women’s Rights,” which really felt like trolling, though I was assured it was not.\nPhoto: Nathaniel Wood\nOur hostess for this particular SlutWalk , Amber Rose, is famous for a number of things: appearing in several rap videos; modeling in a Louis Vuitton ad; having once dated Kanye West and later marrying and divorcing Wiz Khalifa (the father of her toddler, Bash). She likes sex, and talking about sex, and she posts nearly naked pictures of herself on Instagram because she likes her big butt and her big boobs. Unashamed of her past as a teen-stripper, or the several leaked nude photos from the time, Rose tells me she’s teaching her son to be a male feminist while penning a slightly gimmicky guide to self-care titled, How to Be a Bad Bitch.\nPhoto: Nathaniel Wood\nRose became a player in the slut cause earlier this year, after her ex-boyfriend Kanye West went on a popular morning radio show and shared that, in his opinion, his association with Rose made him dirty: “It's very hard for a woman to want to be with someone that's with Amber Rose … I had to take 30 showers before I got with Kim.”\nPhoto: Nathaniel Wood\nShe announced her intention to hold the event soon after, and stepped out in full SlutWalk gear at the VMAs , along with her friend Blac Chyna. The announcement, which was on Instagram and Twitter, said in part:\nMy Slut Walk will be about every Woman Equality issue we deal with everyday u can walk and make signs for the issues ur passionate about. I’m in the beginning stages of putting this together but with ur help this could be an amazing liberating experience for us women. Stay tuned for more info in weeks to come.\nRose’s call to action instantly inspired many of her legions of Instagram and Twitter followers — but it also raised questions. Her message of empowerment is deeply entwined with her celebrity. Is this a marketing ploy? Does a branded SlutWalk cheapen the movement, which began back in 2011 in the wake of a campus sexual assault ? (One of the founders of the original Toronto SlutWalk, Heather Jarvis, is an adviser to the Amber Rose SlutWalk. ) There were sponsors, and vendors, and a GoFundMe . Nicki Minaj donated $5,000. (Rose didn’t reach her financial goal of raising $65,000, but she’s close — as of this writing the fund was at about $55,000.) The money is going to the walk, and the Amber Rose Foundation , which is intended to “promote discussion about women’s rights and equality issues.”\nRose certainly has slut cred. In addition to West’s comments, she’s been called maybe every sex-related slur you can think of in every forum possible: a gold-digger, a bald-ass hoe, a dirty bitch. Instagram commenters recommend that her child be taken away, write that she’s gotten laid by half the industry, and think that she should choke on a dick . And those are just comments on a picture of her, in jeans and a tank top, walking down the street with her son.\nDon’t look at the comments on the pictures of her in a bikini.\nBut Rose remembers exactly when she stopped caring about all of that. Prior to the event she told me, “You just get to a point where you’re like, ‘Man, listen, I just gotta do me, and y’all gonna say whatever you want anyway. So I need to live my life the way I want to live it.'”\nPhoto: Nathaniel Wood\nAmber Rose’s brand of female empowerment, one in which a woman just finally gets over the haters, makes her attractive to a generation of women who define ownership over their bodies and sexuality in a slightly different way — say, for example, posting belfies on Instagram without fear of vicious trolls threatening to rape them.\n“She is so confident in herself. She got so much criticism after Kanye, and she hasn’t let it break her. She’s not ashamed of her past and that’s something I admire. She’s a strong woman,\" explained Courtney Scott, a 22 year-old who had come to the walk with her 50-year-old mother and her 19-year-old sister. They were holding handmade signs that said “Slut,” “Gold-Digger,\" “Whore,” etc. — insults that had all been hurled at Rose in the past, including that morning on Instagram.\nJennifer Gonzalez, a 25-year-old former stripper, told me her ex often called her a whore and a slut for the work she did. She feels a strong connection to Amber. “Amber’s been through a lot. But now look at her. She’s doing this for girls that can’t make a statement. She’s famous. If we were to do this, people would call us dumb. But she’s doing it for us.”\nPhoto: Nathaniel Wood\nThe SlutWalk wasn’t much of a march — just about 500 of us walking four blocks from the starting gate to the actual event in Pershing Square. There, Amber greeted fans, twerking gleefully for the cheering crowd. The show began.\nThere was an impressive roster of speakers, curated by Feministing editor-in-chief Lori Adelman, that included porn star Bonnie Rotten, comedian Sarah Hillier, and vocal male feminist of the moment Matt McGorry of Orange Is the New Black . The entertainment also included an audience twerking contest, and a “Feminist Fashion Show” with models strutting in booty-baring dresses emblazoned with slogans such as “No Thigh Gap Here” and “We Need More Women Helping Women.” Between acts, Rose occasionally went onstage to twerk and make short speeches about promoting women, trans rights, sex work, and masturbation.\nThe commercial aspects of this particular SlutWalk were never far away and occasionally troubling. Between the speeches and the other acts, we ate Chick-fil-A in the VIP area. Everyone onstage encouraged the audience to visit the sexual-assault counseling booths and share their stories, get free HIV tests, and to visit the merch tent for official Amber Rose SlutWalk merchandise. When I bought a pair of booty shorts that said THOT on the butt, the saleswoman gave me a fist bump and a hearty, “That’s right, girl!”\nRose waited until the end of the day, to wield her most powerful weapon — her own story.\nAs she took the crowd through her first experiences with slut-shaming at age 14 — she was making out with a boy at a party and he convinced her to kneel down in front of him, then whipped out his penis and opened the door so the whole party could see — to the more recent, widely publicized disses from Wiz Khalifa and Kanye West, she cried. The crowd also cried. She said, unexpectedly, that she forgave Kanye. She also forgave Khalifa. Her raw honesty and unapologetic tone exemplified her membership in their slut-shamed tribe while offering a way of processing those feelings. The moment managed to feel self-serving, generous, and heartfelt all at once — like her feminist coming-out ball.\nPhoto: Nathaniel Wood\nEven though there weren't thousands of women there, Rose’s SlutWalk had far more women of color, especially black women, than I am used to seeing at such events. In her public catharsis, Rose has done something unexpected: positioning herself as a new feminist folk hero for women who might not feel comfortable calling themselves feminists. Her fans in the crowd certainly didn’t have to know the full history of the feminist movement to understand, inherently, that there is something wrong with the way they’ve been treated and with the way the world regards them. And her fans saw themselves in their self-proclaimed “Muvva.”\nAt the end of her speech Rose declared, “I decided to have this SlutWalk for women that have been through shit. And even though I’m up here crying I want to be the strong person you guys can look up to.” The crowd roared.\n“I’ll be 32 this month,” Rose told me backstage at the event, “and I guess for so long I’m kind of like I know what I like to do: I like Fashion Week, I like clothes, I like sunglasses, but what’s my passion? I finally found my passion and I’m going to do this for the rest of my life. Every year, I’m going to have a SlutWalk. I’m going to have them all over the world. And I’m happy.”\nPhoto: Christopher Polk/Getty Images", "external_links": ["http://www.youtube.com/watch?v=JEau_ij8Szs_", "http://www.slutwalktoronto.com/about/how", "http://www.mtv.com/news/2231352/nicki-minaj-amber-rose-slutwalk/", "http://www.usmagazine.com/celebrity-news/news/wiz-khalifa-seemingly-bashes-estranged-wife-amber-rose-in-new-song-201533", "https://en.wikipedia.org/wiki/Chick-fil-A_same-sex_marriage_controversy", "http://www.amberroseslutwalk.com/", "https://www.youtube.com/embed/3xhED-DLSco?rel=0&enablejsapi=1", "http://www.vibe.com/2015/03/amber-rose-slut-walk-womens-equality/", "https://instagram.com/p/8T_lMWEq1c/", "http://www.theamberrose.org/", "http://www.usmagazine.com/celebrity-style/news/amber-rose-blac-chyna-make-a-statement-at-vmas-2015-in-slut-outfits-2015308", "http://instagram.com/p/8T_lMWEq1c/embed/", "https://www.gofundme.com/amberroseslutwalk"], "published": "2015-10-06T06:40:00.000+03:00", "crawled": "2015-10-06T02:59:00.754+03:00", "highlightTitle": ""}