{"organizations": [], "uuid": "d79e876e5a25fad761c91c226e4a7c6b204e16dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/local/", "section_title": "Local News: Seattle Crime, Politics, Traffic, Weather and More - seattlepi.com", "url": "http://www.seattlepi.com/business/energy/article/Equipment-malfunction-causes-explosion-at-6561114.php", "country": "US", "title": "Equipment malfunction causes explosion at Washington dam", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Equipment malfunction causes explosion at Washington dam - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "d79e876e5a25fad761c91c226e4a7c6b204e16dd"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/business/energy/article/Equipment-malfunction-causes-explosion-at-6561114.php", "ord_in_thread": 0, "title": "Equipment malfunction causes explosion at Washington dam", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SPOKANE, Wash. (AP) — An electrical equipment malfunction caused an explosion at a hydroelectric dam on Washington's Columbia River that injured six workers, utility officials said Friday.\nThe explosion occurred Thursday afternoon at one of 10 electricity generating units at the Priest Rapids Dam near the central Washington city of Mattawa, Grant County Public Utility District spokesman Chuck Allen said.\n\"There was no structural damage to the facility and no resulting threats to public safety related to this incident,\" he said. \"The dam is being operated safely at this time.\"\nFive workers were being treated at Harborview Medical Center in Seattle. Two men, both in their 40s, are in critical condition and in the intensive care unit, while three men are in satisfactory condition, spokesman Susan Gregg said Friday. All were being treated for burns.\nThe sixth worker has been released from a hospital, the utility said in a press release.\nThe utility declined to release the identities or other information about the injured employees, saying it wanted to protect their privacy.\n\"This is a difficult day for everyone here at Grant PUD,\" said acting general manager Kevin Nordt . \"We are all concerned for our co-workers who were injured yesterday and are doing everything we can to show them our support in this difficult time.\"\nThe generating unit where the explosion occurred will be shut down until officials determine what happened and how to prevent it, Allen said.\nThe utility is investigating, along with state workplace regulators. They don't know yet what caused the equipment to fail, Allen said.\nKyle Foreman , a spokesman with the Grant County Sheriff's Office, said his agency won't be investigating because \"there's no indication of criminal wrongdoing or terrorism.\"\nThe people injured in the explosion are power plant electricians and operators whose primary duties are to work on equipment at the dam, Allen said.\nThe Priest Rapids Dam was built in the 1950s and is one of two operated by the Grant PUD along the Columbia River to provide some of the nation's cheapest electricity to residents. The publicly-owned utility serves about 46,000 customers in Grant County, which is about 150 miles east of Seattle. The concrete dam is 178 feet high and more than 10,000 feet long\nLast year, power production from the utility's other dam was reduced for a time after a crack was discovered in one spillway. The reservoir behind the Wanapum Dam was drawn down by more than two dozen feet to reduce pressure on the structure while repairs were made. The repairs on that dam, which opened in 1963, cost more than $86 million.\n___\nAssociated Press reporter Phuong Le contributed from Seattle.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T20:30:33.620+03:00", "highlightTitle": ""}