{"organizations": [], "uuid": "011ec8435e339f1ea59c93038ed9b5393fa19165", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/3fcdcfad-0c87-4fb6-b4f6-c044dc6eef93.img", "site_section": "http://www.ft.com/rss/world/us/politics", "section_title": "US politics news - latest US politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/7f174be0-6ece-11e5-aca9-d87542bf8673.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "US candidates bask in glow of evening TV", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "US candidates bask in glow of evening TV", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T13:10:00.000+03:00", "replies_count": 0, "uuid": "011ec8435e339f1ea59c93038ed9b5393fa19165"}, "author": "", "url": "http://www.ft.com/cms/s/0/7f174be0-6ece-11e5-aca9-d87542bf8673.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "US candidates bask in glow of evening TV", "locations": ["New York", "US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Shannon Bond", "Ellen DeGeneres"], "text": "US candidates find reception better on late night TV Shannon Bond in New York ©AP Political swing: Hillary Clinton seeks to bring humour to her campaign by appearing on the Ellen DeGeneres Show \nThe reality television star Donald Trump has transformed expectations about how to conduct an American presidential campaign, using Twitter as a bullhorn and turning once-staid debates into must-see TV events. \nOn Tuesday night, the Democratic party gets its first taste of this new environment when Hillary Clinton debates with Bernie Sanders and other challengers for the first time. More Clinton opposes Obama landmark trade deal \nWhile it will lack the star power of Mr Trump — and, probably, the record 24m viewers who tuned into the first Republican debate on Fox — TV executives still hope it will draw a large audience as the lines between politics and show business blur. \nNowhere is that distinction breaking down more quickly than on entertainment shows, where politicians are appearing with the regularity of Hollywood stars promoting their latest films. \nSome of the most attention-grabbing moments in the campaign thus far have come not on Fox News or CNN but on chat and comedy programmes. \nMrs Clinton has danced with Ellen DeGeneres and broke out a well-received impression of Mr Trump on the recent season premiere of NBC’s Saturday Night Live . The real estate mogul, meanwhile, interviewed himself (host Jimmy Fallon in costume) on The Tonight Show . And Joe Biden , the vice-president, made a teary-eyed appearance on Stephen Colbert ’s CBS programme about his late son and his torn emotions over whether to run for president. \n“These appearances do tend to be useful on the humanising level” for candidates and politicians, says Robert Thompson, professor of media and popular culture at Syracuse University. “They can seem warmer while not answering tough questions” they might otherwise face on news shows. <!--.--> \nPoliticians have turned to entertainment venues in an attempt to connect with voters since long before President Barack Obama went on the internet comedy show Between Two Ferns to promote his healthcare plan. \nJohn F Kennedy was the first presidential candidate to woo late-night viewers on Jack Paar’s Tonight Show in 1960. Answering audience questions, his ease in front of the camera previewed his triumph later that year over Richard Nixon in the US’s first televised debate. \nNixon himself appeared several times on Paar’s show, once playing a piano piece of his own composing. In 1968 the dour Republican made a brief cameo on Rowan & Martin’s Laugh-In , where he drawled one of the sketch comedy show’s regular punchlines, “Sock it to me”. \n“Nixon would have won that election anyway, but an awful lot of people thought it was a good sport thing to do,” Mr Thompson says. \nIn Bill Clinton’s case, a 1992 appearance on Arsenio Hall’s late-night show in which the sunglasses-sporting presidential hopeful played “Heartbreak Hotel” on the saxophone marked a turning point. <!--.--> \n“His candidacy was building up steam anyway, but that launched it to a whole new place,” Mr Thomson says. The performance helped define Mr Clinton’s image as a representative of a new generation — the baby boomers, in contrast with the incumbent president George H W Bush, who came of age during the second world war. \nIt also aligned him with a new generation of talk show host in Mr Hall. The episode with Mr Clinton aired just weeks after Johnny Carson handed The Tonight Show over to Jay Leno at the end of a 30-year run. \nThe era of Mr Leno and Mr Hall has given way to a new crop of late-night hosts. The debut of Mr Colbert on CBS’s The Late Show and Trevor Noah on Comedy Central’s The Daily Show coincided with a seeming cast of thousands running for the Republican nomination and unexpected competition for Mrs Clinton, once seen as a shoo-in for the Democrats. \nIn the first month of his show, Mr Colbert has sat down with Jeb Bush , Ted Cruz, Mr Trump and Mr Biden. Mr Bush, Mr Trump, Mrs Clinton, Carly Fiorina and Chris Christie have all shown up on Mr Fallon’s Tonight Show . Mr Noah and fellow hosts Seth Meyers, Bill Maher and Larry Wilmore have also landed interviews with presidential wannabes. \nLate-night is a low-risk venue for candidates, according to Two.42.Solutions, a media analytics company. The group measured changes in polling data as well as online discussions of candidates and found that every candidate (or potential candidate, in Mr Biden’s case) was viewed more positively after their appearances. \nBut not all entertainment programmes are created equal. The contenders who visited Mr Colbert’s show saw bigger effects on average than those who sat down with Mr Meyers. Results varied widely for Tonight Show guests. \n“It may have to do with the public persona of the hosts themselves,” says Mohammad Hamid, Two.42.Solutions chief technology officer. “Colbert is more popular than Seth Meyers. That might have some effect on how good a choice it was to appear on that show.” \nAnalysts also warn that candidates run the risk of wearing viewers out by popping up too often in the same format. \nMrs Clinton’s Saturday Night Live role was mentioned more than 39,000 times online, according to Brandwatch, a social media analytics company. That was more than twice the 18,000 mentions garnered by Mr Bush’s appearance on the debut of Mr Colbert’s programme. \n“Viewers were probably tired of watching politicians on late-night talk shows. By appearing on SNL, Hillary got to bypass the viewers’ fatigue,” Brandwatch says. “While every other candidate had to remain themselves and discuss the issues, Hillary was allowed to ‘be fun’ and play a character.”", "external_links": [], "published": "2015-10-12T13:10:00.000+03:00", "crawled": "2015-10-12T14:08:23.282+03:00", "highlightTitle": ""}