{"organizations": [], "uuid": "6e52ae63a7d7902cbbfc4a43b2df3ffe26f0c1b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/2e/e23d061036255c9f30daf9aaa18331/media:5daf75b28b60441ba004b0c013fb33faAfghanistanNationalSecurity.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/26/afghan-security-adviser-warns-of-risk-from-is-al-qaida", "country": "US", "title": "Afghan security adviser warns of risk from IS, al-Qaida", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Afghan security adviser warns of risk from IS, al-Qaida - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "6e52ae63a7d7902cbbfc4a43b2df3ffe26f0c1b4"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/26/afghan-security-adviser-warns-of-risk-from-is-al-qaida", "ord_in_thread": 0, "title": "Afghan security adviser warns of risk from IS, al-Qaida", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By LYNNE O'DONNELL, Associated Press\nKABUL, Afghanistan (AP) — Al-Qaida has re-established a presence in Afghanistan and the Islamic State group has become a serious threat, the Afghan national security adviser warned, saying the country was in danger of again becoming a safe haven for terrorists and calling for U.S. and NATO military backing to help drive them out.\nThe warning by Mohammad Hanif Atmar follows the announcement earlier this month by President Barack Obama that the U.S. would keep 9,800 troops in Afghanistan through most of next year, casting aside a pledge to withdraw most U.S. forces before leaving office. Obama cited the fragile security situation in the face of a resurgent Taliban.\nSpeaking to The Associated Press in an interview late Saturday, Atmar said al-Qaida, the Taliban, the Islamic State group and other insurgents, including the brutal Haqqani network, which has ties to the Taliban, \"are morphing.\"\n\"They have not been degraded, they have regenerated themselves,\" he said.\nAtmar warned the insurgent groups are reinventing themselves, joining forces, and drawing funds and support from outside as they take advantage of a perceived weakness of Afghan forces following the end of the U.S.-led international combat mission last year.\nHighlighting Afghanistan's need for continued support from the U.S. and NATO, the Taliban overran the key northern city of Kunduz on Sept. 28 — their first seizure of a major urban area since being toppled in 2001 by the U.S. invasion — before being driven out over a period of two weeks. The Taliban then threatened cities in different corners of the country, including Lashkar Gah, capital of southern Helmand province, and Maymana, capital of northwestern Faryab.\nThe Taliban have been stretching Afghan forces to the limit this year, and the shift in tactics — from scattered shootings and bombings to coordinated assaults on cities — has posed a challenge to a force accustomed to coming in behind U.S. troops to hold territory, rather than going on the offensive.\nThis has provided fertile ground for insurgent groups to move into Afghanistan from other countries, particularly Pakistan, where a military campaign to eliminate their safe havens from the tribal areas of North Waziristan has pushed militants into Afghanistan.\nAtmar said several groups are now using Afghanistan as a staging ground to reach their \"home countries,\" including China, Uzbekistan and other Central Asian states, and Russia.\n\"What needs to be well understood is that the symbiotic network of terrorists that we are confronted with is going to be a threat to every country in this region and by extension the whole world,\" Atmar said.\n\"We are hoping that assessment is shared not just by Central Asia, Russia and China, but by our neighbors to the south and east,\" he said, referring principally to Pakistan.\nAl-Qaida has made a return to Afghanistan since the drawdown of U.S. and NATO troops began picking up steam from 2011 to 2013, Atmar said, blaming the simultaneous withdrawal of intelligence and eye-in-the-sky technology that the international forces had provided.\nHe said the Islamic State group now poses an \"existential threat\" because it no longer includes only disaffected Taliban, unhappy with the lack of progress after years of fighting to topple the Kabul government, but has an \"institutional connection\" to the group's leadership in Iraq and Syria.\nLeaders are now being appointed directly by the IS leader Abu Bakr al-Baghdadi, Atmar said, entrenching the rivalry with the Taliban — which believes itself the rightful ruler of an Afghan Islamic state.\n\"They have well-established connections to the Islamic State (in Syria and Iraq). Islamic State is commanding and controlling them, Islamic State is financing them, Islamic State is giving them the strategy to pursue. We have no doubt about that,\" he said.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T08:33:28.051+02:00", "highlightTitle": ""}