{"organizations": ["Facebook Email Twitter Google", "KUSA"], "uuid": "f5452f44a1fce489260f5950d377868725bd07b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.9news.com", "main_image": "http://cdn.tegna-tv.com/-mm-/e2a62e279b08edc40e3ff364b384684560472d01/c=4-0-1916-1080&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/19/KUSA/KUSA/635808806371026239-Still1019-00014.jpg", "site_section": "http://rssfeeds.9news.com/_/20/109680894/kusa-politics", "section_title": "KUSA - Politics", "url": "http://www.9news.com/story/news/politics/truth-tests/2015/10/19/measure-2c-denver-national-western-stock-show/74244182/", "country": "US", "title": "Truth Test: Is there any 'bull' in measure 2C?", "performance_score": 0, "site": "9news.com", "participants_count": 0, "title_full": "Truth Test: Is there any 'bull' in measure 2C?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:44:00.000+03:00", "replies_count": 0, "uuid": "f5452f44a1fce489260f5950d377868725bd07b8"}, "author": "", "url": "http://www.9news.com/story/news/politics/truth-tests/2015/10/19/measure-2c-denver-national-western-stock-show/74244182/", "ord_in_thread": 0, "title": "Truth Test: Is there any 'bull' in measure 2C?", "locations": ["Denver"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brandon Rittiman"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Truth Test: Is there any 'bull' in measure 2C? Ballots are in the mail for this off-year election in 2015 and Denver is asking voters to approve a big-money deal to overhaul and expand the National Western Stock Show, paid for by taxes on hotel rooms and rental cars. Post to Facebook Truth Test: Is there any 'bull' in measure 2C? Ballots are in the mail for this off-year election in 2015 and Denver is asking voters to approve a big-money deal to overhaul and expand the National Western Stock Show, paid for by taxes on hotel rooms and rental cars.  //on9news.tv/1RT3spO   Truth Test: Is there any 'bull' in measure 2C? Brandon Rittiman, KUSA 5:44 p.m. MDT October 19, 2015 Brandon Rittiman takes a look at a \"Yes on 2C\" ad (Photo: KUSA)   \nKUSA— Ballots are in the mail for this off-year election in 2015 and Denver is asking voters to approve a big-money deal to overhaul and expand the National Western Stock Show, paid for by taxes on hotel rooms and rental cars. \nAided on-camera by a longhorn steer in an ad on Denver TV stations , Denver Mayor Michael Hancock is serving as chief pitchman for ballot question 2C with a tagline \" that ' s no bull. \" \n9NEWS will hold those who run political ads on our networks accountable for what they say. To learn more about how political ads and fact-checking work on 9NEWS, please read these answers to our common questions and comments. \nMORE POLITICAL ADS: Find the entire collection of Truth Tests here \nThough the deal does have opponents, the money is on the \"yes\" side of 2C—with the campaign in favor receiving contributions from several construction companies and trade groups. \nWith an estimated price tag just shy of a billion dollars (which could eventually top that amount once the bonds are paid back by the tax continuation,) there's a lot of work at stake. \nTo pay for it, the ballot question would continue current taxes on tourists which would otherwise expire in 2023. \nIt's important to know that tax money isn't enough to pay for the whole thing-- and there's not a plan to find the rest of the money yet. \nCLAIM: \"When you vote yes on 2C, you won't just be renewing one of our oldest traditions, you will also be restoring historic neighborhoods, creating a new CSU Ag science center.\" \nVERDICT: FAIR \nThese claims are fair. \nWith the caveat that 2C doesn't raise enough money to do it all: the master plan it's a part of aims to build roads and bridges in nearby neighborhoods. \nExecuting the master plan would also trigger $250 million in state funding that was approved by the legislature to build the CSU agricultural facility. \nCLAIM: 2C would \"boost our tourism industry, which supports our hotels, our restaurants, and conventions... creating thousands of jobs.\" \nVERDICT: NEEDS CONTEXT \nThe job benefit could be explained in clearer terms. \nAccording to the application for the plan under the regional tourism act, supporters estimate only 108 permanent jobs at the complex itself. \nThe construction is estimated to create 6,270 jobs, but of course-- those are only temporary. \nOn top of that, supporters claim 6,000 to10,000 indirect jobs will open up, as the ad says, at other surrounding businesses. \nIt's always worth considering the source—these estimates all come from supporters of the project. \nIt's fair to conclude you're going to create jobs if you spend this kind of money, it's just worth knowing the full picture. \nCLAIM: 2C would work \"all without raising taxes.\" \nVERDICT: NEEDS CONTEXT \nThe rental car and hotel taxes that voters are being asked to bless aren't an increase—and they aren't new. \nHowever, that's not enough to give you the full understanding of what you're being asked to vote on. \n2C would continue tax increases approved by the voters back in 1999 , which would otherwise expire on their own. \nQuestion 2C would make the tax permanent instead, which means that in addition to paying toward this project-- a yes vote would also give Denver officials a new stream of tax money forever to use however they see fit. \nBOTTOM LINE: \nThe ad puts a rosy face on the selling points of a complex deal, but it leaves out some of the basic facts about how all this will work, and how long the tax will last. \nThat's your Truth Test. And that's no bull. \n(© 2015 KUSA)  //on9news.tv/1RT3spO TOP VIDEOS", "external_links": [], "published": "2015-10-20T02:44:00.000+03:00", "crawled": "2015-10-20T03:03:54.689+03:00", "highlightTitle": ""}