{"organizations": [], "uuid": "d2c91dba42b42e6465d835217e238e2c022ed7b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/us/articles/2015/10/12/old-gift-to-dartmouth-college-leads-to-a-new-investigation", "country": "US", "title": "Old gift to Dartmouth College leads to a new investigation", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Old gift to Dartmouth College leads to a new investigation - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "d2c91dba42b42e6465d835217e238e2c022ed7b8"}, "author": "USNews", "url": "http://www.usnews.com/news/us/articles/2015/10/12/old-gift-to-dartmouth-college-leads-to-a-new-investigation", "ord_in_thread": 0, "title": "Old gift to Dartmouth College leads to a new investigation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Did Ivy League college hold up its end of bargain with New Hampshire? Lawmaker seeks answer Associated Press Oct. 12, 2015 | 1:46 a.m. EDT + More By HOLLY RAMER, Associated Press\nCONCORD, N.H. (AP) — Frustrated by a lack of response from Dartmouth College, a state lawmaker hopes the Legislature will force the Ivy League school to explain how it has repaid New Hampshire for its generosity more than a century ago.\nIn 1807, the state gave the then-cash-strapped college 42 square miles of land in far northern New Hampshire, with the provision that all income produced from it be used to educate students from poor New Hampshire families. Seventy-six years later, the Legislature gave the private college $10,000 on the condition it be invested in a perpetual fund for poor students from New Hampshire.\nThe 1883 law also required college trustees to make annual reports to the Legislature, but Rep. Renny Cushing said he has been unable to locate anyone in New Hampshire state government with any memory of such reports. He has also asked legislative leaders going back to the 1970s about whether Dartmouth ever consulted the state about managing the land, but none could remember hearing anything about it.\n\"The complete lack of transparency is pretty bothersome,\" said Cushing, a Democrat from Hampton who was researching possible legislation aimed at making college education more affordable when he began wondering about the land, which is used for timber harvesting and recreation. \"I feel like they don't respect the state. ... They took the money, put it in their pocket and walked away.\"\nAsked about the land deal in early July, Dartmouth officials pointed out that subsequent lawmakers in 1919 lifted the requirement about how the income was to be used. When Cushing followed up a few weeks later with questions about the $10,000 gift, officials said they would research the issue, but more than two months later have yet to respond.\nA college spokeswoman said last week officials would not comment on Cushing's proposed bills because he has not shared them with the college.\n\"Dartmouth appreciates all of the support it has received from the state of New Hampshire and is confident that it has honored all of its commitments,\" Diana Lawrence said.\nOne of Cushing's proposals would require Dartmouth to file a report on the income generated by the land, while another would prohibit Dartmouth from selling the land without approval from the state. The third, which exists only as a title at this point, is aimed at \"reinvigorating the collaboration between the state of New Hampshire and Dartmouth to educate poor students from New Hampshire,\" Cushing said.\n\"It seems like Dartmouth is no longer interested in meeting the needs of New Hampshire students,\" he said.\nDartmouth's total endowment last year grew to $4.5 billion. Undergraduate tuition for 2015-2016 will be $48,120, though it is free for students from families making $100,000 per year or less. That policy — similar to those at other elite universities — has been in place since 2008; the threshold was raised from $75,000 in 2012.\nDartmouth did create an endowment in 1921 using timber harvesting profits that is expected to distribute about $330,000 in financial aid this year to needy male students from New Hampshire. Female students receive the same level of aid from other sources of revenue, and altogether, Dartmouth awarded more than $2.9 million in scholarship funds to 84 New Hampshire students in the last year, the college said.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe47oe%3Fsrc=usn_tw&via=usnews&text=Old%20gift%20to%20Dartmouth%20College%20leads%20to%20a%20new%20investigation", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe47oe%3Fsrc=usn_gp", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe47oe%3Fsrc=usn_su", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe47oe%3Fsrc=usn_li&title=Old%20gift%20to%20Dartmouth%20College%20leads%20to%20a%20new%20investigation&summary=&source=U.%20S.%20News", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe47oe%3Fsrc=usn_fb", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe47oe%3Fsrc=usn_rd&title=Old%20gift%20to%20Dartmouth%20College%20leads%20to%20a%20new%20investigation"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T09:38:13.780+03:00", "highlightTitle": ""}