{"organizations": ["Freedom Caucus"], "uuid": "35c61dd2d9a7acb0628b9699b70565b449ba42d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.naplesnews.com", "main_image": "http://mediaassets.naplesnews.com/photo/2015/10/23/Clawson_Curt_25668064_ver1.0_640_480.jpg", "site_section": "http://www.naplesnews.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100108&categoryId=60013", "section_title": "Politics | NPDN", "url": "http://www.naplesnews.com/news/politics/rep-curt-clawson-splits-from-freedom-caucus-and-not-supporting-paul-ryan-for-speaker-supports_67805035", "country": "US", "title": "Clawson not supporting Ryan for House Speaker", "performance_score": 0, "site": "naplesnews.com", "participants_count": 0, "title_full": "Clawson not supporting Ryan for House Speaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:56:00.000+03:00", "replies_count": 0, "uuid": "35c61dd2d9a7acb0628b9699b70565b449ba42d4"}, "author": "", "url": "http://www.naplesnews.com/news/politics/rep-curt-clawson-splits-from-freedom-caucus-and-not-supporting-paul-ryan-for-speaker-supports_67805035", "ord_in_thread": 0, "title": "Clawson not supporting Ryan for House Speaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Webster Bartholomew Sullivan", "Ryan", "Clawson", "Paul Ryan"], "text": "Rep. Clawson splits from Freedom Caucus and not supporting Paul Ryan for Speaker; supports Webster Bartholomew Sullivan 5:56 PM, Oct 23, 2015 6:06 PM, Oct 23, 2015   Show Caption Previous Next \nWASHINGTON — Congressman Curt Clawson wants a Floridian and an “outsider” candidate not promoted from within the existing Republican leadership to be the next Speaker of the House and said Friday has split with his Freedom Caucus on backing Rep. Paul Ryan. \nThe Bonita Springs Republican said he expects to support U.S. Rep. Daniel Webster, R-Orlando, if Webster remains a candidate, but he said delicate negotiations with House Ways and Means Committee Chairman Ryan, of Wisconsin, over House procedures are ongoing and “there are several variables at play to be decided in the next several days.” \nRyan wants conservatives to withdraw a pending motion to vacate the speakership that prompted the current speaker, John Boehner, to announce his retirement last month. The speaker vote has been scheduled for next Wednesday. \nMore than 50 percent of the roughly 40-member Freedom Caucus agreed they didn’t want to put forward a member of the caucus and agreed to back Ryan if they can “horse trade” and get him to agree to certain procedural changes that end a top-down leadership style the caucus condemns, he said. \n“I did not vote with the group on that,” he said. “But I respect the caucus and I’m a team player.” \n“When I say I’d like an outsider, what that means is I want someone we can credibly say to our constituents is going to change how things are done and is not business as usual,” he said. \nBoehner announced last month that he is stepping down next week. The House GOP conference has been in chaos since his hand-picked successor, Majority Leader Kevin McCarthy of California, decided not to seek the speakership. Ryan has become the consensus candidate but has said he needed the support of the Freedom Caucus before declaring his formal candidacy. \nClawson said as recently as last week, speaking with the Lee County Republican Executive Committee, he heard loud and clear they want to end business as usual in Washington. \nOf the three criteria he will base his vote for speaker on next Wednesday, he said, “with respect to Webster, we get at least two out of those three: he’s Floridian; he’s not promotion from within; and you can decide for yourself about the outsider thing.” \nWebster rose through the ranks of the Florida House of Representatives to become speaker in Tallahassee. \nAsked if the remaining members of the Freedom Caucus not supporting Ryan can deprive Ryan of the 218 votes he needs to become speaker, Clawson said the caucus has a “blocking position” but said “too much is in play between here (Friday) and ” Wednesday to say what will happen. \nBut he plans to stick with Webster. \n“I anticipate that, if Webster stays in the game, my full expectation is to support Webster,” he said.  ", "external_links": [], "published": "2015-10-24T00:56:00.000+03:00", "crawled": "2015-10-24T08:57:38.784+03:00", "highlightTitle": ""}