{"organizations": [], "uuid": "01747f0db00862632c3ded6a8c9c6079222cb359", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30336746/texas-company-goes-extra-mile-to-give-the-gift-of-life", "country": "US", "title": "Texas Company Goes Extra Mile to Give the Gift of Life", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Texas Company Goes Extra Mile to Give the Gift of Life - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "01747f0db00862632c3ded6a8c9c6079222cb359"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30336746/texas-company-goes-extra-mile-to-give-the-gift-of-life", "ord_in_thread": 0, "title": "Texas Company Goes Extra Mile to Give the Gift of Life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " APG&E\nHOUSTON , Oct. 23, 2015 /PRNewswire/ -- As the days get shorter and temperatures begin to drop, we're reminded that the season of giving is approaching. AP Gas & Electric (TX), LLC, a leading independent provider of electricity for consumers and businesses located in Houston , is already gearing up to celebrate the season, starting with a gift of life through their partnership with Gulf Coast Regional Blood Center. A blood drive sponsored by the company, held on October 15 , included APG&E employees as well as employees from other companies in the 6161 Savoy office building. Both Gulf Coast and APG&E are pleased to announce their first annual blood drive provided more pints than their original objective.\nAPG&E CEO Barend VanderHorst has a vision for the company that involves a focus on both residential and business customers in more ways than providing electricity alone. VanderHorst's vision, influenced by all members of the new leadership team at APG&E, is committed to supporting community outreach programs in Houston throughout the year. \"Our team will steer APG&E to succeed with a customer-centric approach that includes helping others in our community,\" states VanderHorst of the strategy.\nOther community outreach initiatives that the energy provider, APG&E, will be participating in for the remainder of the year include a second partnership with the Houston Food Bank, collecting food for the needy with a company-wide food drive in November. The Houston Food Bank provides nutritious food for the Houston area via soup kitchens, meal sites and food pantries, among other locations.\nIn December, APG&E will come together once again to collect and distribute toys to children in the Texas Children's Hospital to make their holiday a little brighter.\nAbout APG&E\nAPG&E is the #1 go-to resource for residential and small commercial customers. They deliver electricity at affordable rates and with easy to understand pricing plans.\nAPG&E's seasoned team of energy professionals provides a sincere, dependable and transparent approach in partnering with customers. What is important to them is to deliver the products and services that their customers need with the highest level of customer service.\nFounded in 2004 and originally serving customers in Texas , they have rapidly expanded their reach to over a dozen other markets throughout the country. Their customers rely on them to make buying energy supply simple and efficient.\nMedia Contact\nLori Vehmas-Falkin\nAP Gas & Electric\nlvehmas@apge.com\n908-970-9996\n releases/texas-company-goes-extra-mile-to-give-the-gift-of-life-300165534.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA37187&Transmission_Id=201510231451PR_NEWS_USPR_____DA37187&DateId=20151023", "http://www.prnewswire.com/news-releases/texas-company-goes-extra-mile-to-give-the-gift-of-life-300165534.html"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T22:48:40.634+03:00", "highlightTitle": ""}