{"organizations": [], "uuid": "796a263ab444bfeb099575b046b46340eebd8183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30308424/canada-steamship-lines-partners-with-the-romm-to-collect-and-record-whale-sightings", "country": "US", "title": "Canada Steamship Lines partners with the ROMM to collect and record whale sightings", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Canada Steamship Lines partners with the ROMM to collect and record whale sightings - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "796a263ab444bfeb099575b046b46340eebd8183"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30308424/canada-steamship-lines-partners-with-the-romm-to-collect-and-record-whale-sightings", "ord_in_thread": 0, "title": "Canada Steamship Lines partners with the ROMM to collect and record whale sightings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The CSL Group Inc.\nMONTREAL , Oct. 20, 2015 /CNW Telbec/ - Canada Steamship Lines (CSL) has partnered with the Réseau d'observation des mammifères marins (ROMM) to record marine mammals sightings by vessel crews to advance scientific research in whale behaviour. The data collected over the course of the program will serve to protect and preserve marine habitats and species.\nVeronique Nolet , Biologist and Assistant Director at the ROMM, joined the crew of the CSL vessel Salarium for a week in early September 2015 , to launch the program among CSL seafarers and establish a protocol for marine observation and recording.\n\"The information gathered by maritime carriers such as CSL is essential because it contains a large quantity of valuable new information on whales, often in zones rarely covered by the scientific community,\" points out Ms. Nolet.\nWhile onboard Salarium, Ms. Nolet educated crew members about the whales they can encounter in the waters of the St. Lawrence and taught them how to collect observation data. Supported by A Mariner's Guide to Whales in the Northwest Atlantic , published by the Shipping Federation of Canada and the ROMM, Ms. Nolet equipped seafarers with the knowledge and tools necessary to contribute to our understanding of whale patterns and behaviour.\nFor crew members, the experience was rewarding, relevant, and highly educational. \"We occasionally see whales off the Gaspé coast near the Magdalen Islands, or in the lower part of the St. Lawrence Gulf in St-George's Bay\" explained Captain Joey Ransom .\nThe data collected by crew members will be transferred to the ROMM and then shared with the\nSt. Lawrence Global Observatory where it will be made public at www.slgo.ca .\nAs a primary user of the St. Lawrence River and other waterways, CSL recognizes its responsibility to protect the delicate marine, coastal and estuarine ecosystems in which it operates. Among the many initiatives it has introduced to reduce its environmental impact, CSL has voluntarily committed to reducing the speed of its vessels in areas containing a large number of whales.\nCSL is a long-standing supporter of research and programs to protect marine mammals and habitats including the World Wildlife Fund's conservation work to protect North Atlantic Right Whales, the whales of the Grand Banks of Newfoundland and the belugas of the St. Lawrence .\nCanada Steamship Lines\nCanada Steamship Lines is a division of The CSL Group, the world's largest owner and operator of self-unloading vessels. Headquartered in Montreal with divisions based in the United States , Europe , Asia and Australia , CSL delivers more than 76 million tonnes of cargo annually for customers in the construction, steel, energy and agricultural sectors.\nRéseau d'observation de mammifères marins\nThe Réseau d'observation de mammifères marins (ROMM) is a non-profit organization based in Rivière-du-Loup, which is dedicated since 1998 to the conservation and enhancement of the St. Lawrence and its wildlife. ROMM works with integrated management and collaborates with various actors of the shipping industry in order to engage in a concerted effort to conserve the marine ecosystems.\n ", "external_links": ["http://www.slgo.ca/", "http://rt.prnewswire.com/rt.gif?NewsItemId=C6814&Transmission_Id=201510201418CANADANWWEB______C6814&DateId=20151020", "http://www.xmlnews.org/ns/"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T10:22:44.205+03:00", "highlightTitle": ""}