{"organizations": ["Red Flag John Springer Collection/ Corbis Patrick Kidd Published", "The Times Subscribe now Blunderbuss"], "uuid": "b3c2a81ac84ca70d44db0c73049b0e68504289a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thetimes.co.uk", "main_image": "http://www.thetimes.co.uk/tto/multimedia/archive/00985/6bc9c6f0-67b0-11e5-_985465h.jpg", "site_section": "http://www.thetimes.co.uk/tto/news/politics/rss", "section_title": "Politics | The Times", "url": "http://www.thetimes.co.uk/tto/news/politics/sketch/article4572613.ece", "country": "GB", "title": "Blunderbuss comes out and then the party’s over", "performance_score": 0, "site": "thetimes.co.uk", "participants_count": 0, "title_full": "Blunderbuss comes out and then the party’s over", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T12:28:00.000+03:00", "replies_count": 0, "uuid": "b3c2a81ac84ca70d44db0c73049b0e68504289a2"}, "author": "", "url": "http://www.thetimes.co.uk/tto/news/politics/sketch/article4572613.ece", "ord_in_thread": 0, "title": "Blunderbuss comes out and then the party’s over", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Strangelove"], "text": "Welcome to your preview of The Times Subscribe now Blunderbuss comes out and then the party’s over Dr Strangelove might have been more suitable than The Red Flag John Springer Collection/ Corbis Patrick Kidd Published 1 minute ago \nThere was no chance of Jeremy Corbyn standing in silence for this song. The Labour conference drew to its close with The Red Flag , sung with a vigour that had not been seen since Peter Mandelson shaved his moustache. Given the nuclear war that had just been ignited in the parliamentary party, maybe We’ll Meet Again and a montage of mushroom clouds, echoing the ending of Dr Strangelove , would have been more suitable. \nIn the hall, it seemed that all the leader’s pleas for a kinder approach to politics had fallen on deaf ears. First Andy Burnham repeated, for the Subscribe now \nTo see the full article you need to subscribe Subscribe \nIn his first conference speech as Labour party leader, Jeremy Corbyn managed to avoid disaster but he also avoided... Sponsored Editorial \nThinking of setting up a business abroad? Don’t go anywhere without consulting this guide More from Political Sketch Short on excitement, but long on delivery Published at 12:01AM, September 30 2015 \nIt certainly felt as if he had taken us deep into the night with a series of unconnected riffs on a general jazz theme of ‘let’s be kinder to each other’ Bank manager opens his account Published at 12:01AM, September 29 2015 \nJohn McDonnell compared himself to a bank manager on the Today programme, warning listeners that he would be ‘pretty boring’ Great philosophical questions unanswered Published at 12:01AM, September 28 2015 \nJeremy Corbyn is as adept at ducking difficult questions as the more polished politicians - it’s just that he sounds so reasonable and human while doing so that it’s easy to overlook the lack of an answer Find", "external_links": [], "published": "2015-09-30T12:28:00.000+03:00", "crawled": "2015-10-01T00:52:46.206+03:00", "highlightTitle": ""}