{"organizations": [], "uuid": "c5020e310173d054d022e3fc7ebdd55ec4bc553d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/resrsc/images/facebook-default.jpg", "site_section": "http://www.dallasnews.com/news/politics/national-politics/", "section_title": "National Politics and Election News - News for Dallas, Texas ", "url": "http://www.dallasnews.com/news/politics/national-politics/20151013-democrats-to-confront-identity-crisis-in-debate.ece", "country": "US", "title": "Democrats to confront identity crisis in debate", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Democrats to confront identity crisis in debate | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:14:00.000+03:00", "replies_count": 0, "uuid": "c5020e310173d054d022e3fc7ebdd55ec4bc553d"}, "author": "dallasnews", "url": "http://www.dallasnews.com/news/politics/national-politics/20151013-democrats-to-confront-identity-crisis-in-debate.ece", "ord_in_thread": 0, "title": "Democrats to confront identity crisis in debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LAS VEGAS — Hillary Clinton takes the debate stage for the first time in this campaign Tuesday night to face four rivals looking for something — anything — to knock down her lead in the race for the Democratic nomination for president.\nClinton must use the debate to explain her rationale for her second candidacy for the White House or risk seeing her chief rival, Sen. Bernie Sanders of Vermont, steal her front-runner status, which already has eroded in part because of the inquiries into her use of personal email for government business.\nThe two-hour debate at the Wynn Las Vegas will feature the five Democratic candidates who received at least 1 percent in a trio of national polls within the last six weeks.\nVice President Joe Biden, who is considering a run, will not participate.\nHere’s what to look for:\nHow does Clinton relate?\nThe former secretary of state, U.S. senator and first lady has been trying throughout the campaign to show she can relate to working American families after years of being criticized as an out-of-touch Washington insider garnering hefty paychecks for speeches and books.\nWith recent polls showing an increasing number of voters do not trust her or believe she understands their problems, it’s clear she has more work to do to show them that she’s not forgotten her middle-class, Middle America sensibilities. Recently, she poked fun at herself on Saturday Night Live .\nWill Clinton be able to articulate a softer side by speaking about herself, her family or those she has met on the campaign trail, or will she continue to appear overly cautious and inaccessible?\nDoes Sanders look like a protester or a president?\nSanders has drawn massive crowds and millions of dollars by being a champion of the underpaid, overworked American. The 74-year-old self-described democratic socialist boasts a passionate following — which engages in enthusiastic tweets that use the hashtag #FeeltheBern — but he isn’t well known for much more than blasting what he calls the “billionaire class.”\nFor Sanders to be seriously considered, he needs for potential voters outside the early states to get to know him better.\nWill he use the debate to speak confidently about a host of other policy issues — foreign and domestic — and explain how he would govern as president?\nWho are those other guys?\nThe three remaining candidates — former Rhode Island Gov. Lincoln Chafee, former Maryland Gov. Martin O’Malley and former Virginia Sen. Jim Webb — have one goal: Get noticed.\nEach is garnering less than 2 percent in most national polls behind Clinton, Sanders and Biden, who isn’t even a candidate. Some people do not know who they are.\nWill any of the trio get attention by attacking Clinton or Sanders, making a joke or delivering a memorable one-liner? Webb and Chafee have struggled to serve as attack dogs in previous joint appearances. O’Malley has not hesitated to criticize his opponents, particularly Clinton, but he has not managed to move the polls.\nWill the five candidates differ on the issues?\nUnlike the Republicans running for president, the Democratic candidates haven’t distinguished themselves from each other on many of the main issues. They’ve focused on attacking the other party instead of each other.\nFor the most part, but not in all cases, they want to raise the minimum wage, lower college costs, get rid of unaccountable money in politics and support a deal with Iran that would curb the country’s nuclear program. Their central messages have largely focused on tackling income inequality and lifting the middle class.\nWill they try to use the first debate to set themselves apart from one other and contrast the ways they would govern?\nAnita Kumar,\nMcClatchy Washington Bureau", "external_links": [], "published": "2015-10-14T04:14:00.000+03:00", "crawled": "2015-10-20T21:49:10.264+03:00", "highlightTitle": ""}