{"organizations": [], "uuid": "0f16258d95687291e73d1a5c53cb41a4d4654cb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theatlantic.com", "main_image": "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/AP_253502912008/facebook.jpg?1444305847", "site_section": "http://www.theatlantic.com/writers/", "section_title": "The Atlantic — News and analysis on politics, business, culture, technology, national, international, and life – TheAtlantic.com", "url": "http://www.theatlantic.com/entertainment/archive/2015/10/the-nobel-prize-in-literature-and-a-monument-to-suffering-and-courage/409621/", "country": "US", "title": "Belarusian Author Svetlana Alexievich Wins Nobel Prize in Literature", "performance_score": 0, "site": "theatlantic.com", "participants_count": 1, "title_full": "Belarusian Author Svetlana Alexievich Wins Nobel Prize in Literature - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T16:06:00.000+03:00", "replies_count": 0, "uuid": "0f16258d95687291e73d1a5c53cb41a4d4654cb3"}, "author": "Krishnadev Calamur", "url": "http://www.theatlantic.com/entertainment/archive/2015/10/the-nobel-prize-in-literature-and-a-monument-to-suffering-and-courage/409621/", "ord_in_thread": 0, "title": "Belarusian Author Svetlana Alexievich Wins Nobel Prize in Literature", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Belarusian author Svetlana Alexievich has been awarded this year’s Nobel Prize in Literature for her “polyphonic writings, a monument to suffering and courage in our time.”\nAlexievich, 67, is perhaps best known for Voices from Chernobyl , which told the consequences of the nuclear disaster, and Boys In Zink , which collected accounts from the Soviet war in Afghanistan. It is rare for writers who primarily write nonfiction to win the Nobel Prize.\nBorn in Ukraine in 1948 to a Belarusian father and a Ukrainian mother, Alexievich and her family moved to Belarus where her parents worked as teachers. Alexievich, who studied journalism at the University of Minsk, herself worked as a teacher and as a journalist.\nAfter graduating in 1972, she was sent to a local newspaper in Brest, near the border with Poland, because of her dissident political views. She returned to Minsk later and worked at Sel’skaja Gazeta, a local newspaper.\nHer first book, War’s Unwomanly Face , published in 1985, is based on interviews with women who took part in World War II. It’s the first in her grand cycle of books, Voices of Utopia , which told of life in the Soviet Union from an individual’s perspective.\nA critic of the Belarusian regime, Alexievich lives in Minsk, but she has also lived in Italy, France, Germany, and Sweden.\nWinners of the Nobel Prize for literature receive 8 million kronor , about $970,000. The winner of last year’s award was the French writer Patrick Modiano.", "external_links": ["http://www.nobelprize.org/nobel_prizes/about/amounts/prize_amounts_15.pdf"], "published": "2015-10-08T16:06:00.000+03:00", "crawled": "2015-10-08T15:09:38.867+03:00", "highlightTitle": ""}