{"organizations": [], "uuid": "cb600f4e9d1473768ad849d73290aed068f253dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/politics/articles/2015/10/14/ron-paul-blames-government-for-timing-of-ex-aides-charges", "country": "US", "title": "Ron Paul blames government for timing of ex-aides' charges", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Ron Paul blames government for timing of ex-aides' charges - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb600f4e9d1473768ad849d73290aed068f253dc"}, "author": "USNews", "url": "http://www.usnews.com/news/politics/articles/2015/10/14/ron-paul-blames-government-for-timing-of-ex-aides-charges", "ord_in_thread": 0, "title": "Ron Paul blames government for timing of ex-aides' charges", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ron Paul says charges versus ex-aides deliberately timed just before son's GOP debate debut Associated Press Oct. 14, 2015 | 6:26 p.m. EDT + More By BARBARA RODRIGUEZ, Associated Press\nDES MOINES, Iowa (AP) — Former presidential candidate Ron Paul said Wednesday the government purposely announced charges against his ex-aides shortly before his son, Rand Paul, was scheduled to appear this summer in a national debate for the Republican presidential nomination.\nThe former Texas congressman told jurors in a federal courthouse in Des Moines that he was suspicious of the timing of the unsealed indictment against Jesse Benton and Dimitri Kesari, two former aides to Ron Paul when he ran for his party's nomination in 2012. The indictment was unsealed in August, one day before Kentucky Sen. Rand Paul was set to appear onstage at the Republican Party's first debate of the 2016 campaign.\n\"I don't consider that a coincidence,\" Ron Paul said.\nProsecutors say Benton and Kesari concealed payments to former Iowa Sen. Kent Sorenson after the lawmaker jumped from the Michele Bachmann campaign to the Ron Paul campaign days before the January 2012 Iowa caucuses. Paul finished third in the Iowa caucuses behind former Pennsylvania Sen. Rick Santorum and the eventual Republican nominee former Massachusetts Gov. Mitt Romney. Kesari faces five charges, including conspiracy and obstruction. Benton faces one count of making false statements. They have pleaded not guilty.\nRon Paul told jurors during the second day of the trial that he didn't know anything about the alleged secret payments to Sorenson. He said his staff also knew he was the type of candidate who didn't believe in paying for endorsements.\n\"I just don't think people are supposed to do that,\" he said.\nRon Paul said he didn't feel \"victimized\" by his ex-aides, but he was concerned about the trial's effect on his family. He said he still cared for Benton, who is married to his granddaughter. She is also Rand Paul's niece.\n\"As far as I'm concerned, nothing has changed,\" he said about Benton.\nJurors also heard testimony on Wednesday from a special FBI agent who previously interviewed Benton about emails presented in the trial. Prosecutors say the emails show proof that Benton lied to federal authorities on his knowledge of the payments. They contend the emails show Kesari purposely tried to hide the payments through a company.\nAttorneys for both men attempted during the trial to question the authenticity of the emails.\nThe trial is expected to resume Thursday.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe7ea7%3Fsrc=usn_tw&via=usnews&text=Ron%20Paul%20blames%20government%20for%20timing%20of%20ex-aides%27%20charges", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe7ea7%3Fsrc=usn_rd&title=Ron%20Paul%20blames%20government%20for%20timing%20of%20ex-aides%27%20charges", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe7ea7%3Fsrc=usn_su", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe7ea7%3Fsrc=usn_gp", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe7ea7%3Fsrc=usn_fb", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe7ea7%3Fsrc=usn_li&title=Ron%20Paul%20blames%20government%20for%20timing%20of%20ex-aides%27%20charges&summary=&source=U.%20S.%20News"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T01:49:02.793+03:00", "highlightTitle": ""}