{"organizations": [], "uuid": "84a35ed0314524c3ab2da5d8e0f3211458cd2fde", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.vice.com", "main_image": "https://news-images.vice.com/images/articles/meta/2015/09/30/the-state-department-just-released-a-another-6000-pages-of-hillary-clinton-emails-1443642821.jpg?crop=1xw:0.6790697674418604xh;0xw,0.21550387596899226xh", "site_section": "https://news.vice.com/topic/politics/page/0", "section_title": "Politics | VICE News", "url": "https://news.vice.com/article/the-state-department-just-released-another-6300-pages-of-hillary-clinton-emails", "country": "US", "title": "The State Department Just Released Another 6,300 Pages of Hillary Clinton Emails", "performance_score": 0, "site": "vice.com", "participants_count": 5, "title_full": "The State Department Just Released Another 6,300 Pages of Hillary Clinton Emails | VICE News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 9, "uuid": "4032113e04e6244a9718dbe0d4e446bac624480b"}, "author": "VICE News", "url": "https://news.vice.com/article/the-state-department-just-released-another-6300-pages-of-hillary-clinton-emails#post-0", "ord_in_thread": 0, "title": "The State Department Just Released Another 6,300 Pages of Hillary Clinton Emails", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The US Department of State just released more than 6,000 pages of emails sent by Hillary Clinton during her tenure as Secretary of State, with the latest batch of correspondence including messages sent between October 2010 and September 2011.\nThe period encompasses many of the major events that took place during the Arab Spring, when civil unrest spread across the Middle East and forced regime changes in Egypt, Libya, and Tunisia. Many of the emails also include information and news articles about current events that were unfolding at the time.\nClinton's emails are being released in response to a Freedom of Information Act (FOIA) lawsuit filed by VICE News senior investigative reporter Jason Leopold. A federal judge has ordered the government to release 15 percent of the 35,000 emails each month. The latest document release met the State Department's goal of giving up 37 percent of her email archive by September 30, the agency said in a statement on Wednesday. The State Department has now released 19,569 pages of Clinton's emails.\nThe State Department was previously running behind schedule on releasing the emails due to US intelligence officials screening the messages for classified information. US government lawyers said previously that intelligence officials have flagged 305 documents from Clinton's emails for further review.\nRelated: Intelligence Officials Flag 305 Hillary Clinton Emails for Possible Classified Info\nClinton has insisted that she never used her private email server, which was hosted at her home in Chappaqua, New York, to transmit information that had been marked \"classified,\" and insists she did nothing wrong.\n\"I did what other secretaries of state have done,\" Clinton told Iowa Public Radio in August. \"I was permitted to and used a personal email and, obviously in retrospect, given all the concerns that have been raised, it would have been probably smarter not to. But I never sent nor received any classified email, nothing marked 'Classified.' And I think this will all sort itself out.\"\nPrevious batches of Clinton's emails have been heavily redacted, but have included discussions about the prosecution of alleged 9/11 mastermind Khalid Sheikh Mohammed, the transfer of Guantanamo Bay detainees to Belgium, and the delicate US-Israel relationship in the aftermath of the 2008-2009 Gaza War.\nVICE News reporters are currently reviewing the latest batch of emails.\nRelated: Hillary Clinton Is Not a Fan of Obama's Arctic Drilling Decision\nFollow VICE News on Twitter: @vicenews", "external_links": ["http://iowapublicradio.org/post/hillary-clinton-email-controversy-education-and-clean-energy#stream/0", "https://twitter.com/vicenews", "https://foia.state.gov/Search/results.aspx?searchText=Clinton+Email&beginDate=&endDate=&publishedBeginDate=&publishedEndDate=&caseNumber="], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-02T06:28:02.048+03:00", "highlightTitle": ""}