{"organizations": [], "uuid": "8054235041e51a08b8d4f9079e458b032286cf15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/124/440_490x490_309648691_490x490.jpg", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/Northern-Ireland-make-history-with-Gre-1", "country": "IE", "title": "Northern Ireland make history with Greece win", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "Northern Ireland make history with Greece win - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T06:15:00.000+03:00", "replies_count": 0, "uuid": "8054235041e51a08b8d4f9079e458b032286cf15"}, "author": "Content Admin", "url": "https://www.oximity.com/article/Northern-Ireland-make-history-with-Gre-1", "ord_in_thread": 0, "title": "Northern Ireland make history with Greece win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Northern Ireland qualify for first EURO with victory against Greece Steven Davis scores 35th-minute opener to settle home nerves Josh Magennis header makes it 2-0 shortly after interval Davis gets his second; Christos Aravidis nets late consolation for winless Greece Final games: Finland v Northern Ireland, Greece v Hungary (Sunday)\nRelated Items\nHungary keep hopes alive Romania foil Finland Portugal progress Long downs Germany\nNorthern Ireland reached the UEFA European Championship finals for the first time with victory against Greece, Steven Davis scoring twice on a historic night at Windsor Park .\nMichael O'Neill's side needed two points from their last two Group F games to secure progress, and took a significant stride towards that target when captain Davis finished off a slick move ten minutes before half-time.\nJosh Magennis headed a second early in the second period, before Davis's second and the Northern Irish third ensured the celebrations could begin in earnest despite Christos Aravidis's late consolation for the 2004 champions.\nThe hosts, buoyed by a raucous Belfast crowd, almost took the lead after 25 minutes when Stuart Dallas skipped inside José Holebas on the left and sent a low cross to Magennis. The Kilmarnock striker, a goalkeeper until switching positions in 2008, tried to curl his close-range effort past Orestis Karnezis but was denied by the outstretched leg of Vangelis Moras.\n©Getty Images\nThe expectant home supporters only had a few minutes to wait for the breakthrough, however. Corry Evans supplied an incisive through ball to Dallas who had time and space to set up Davis for a simple close-range finish.\nKostas Mitroglou offered a timely reminder that there was still work to be done when, seconds before the interval, his shot came back off the far post. So Magennis's strike four minutes after the restart soothed Northern Irish nerves, his header from Oliver Norwood's corner looping over Aravidis on the line.\nVictory was wrapped up just before the hour as Chris Brunt's corner was headed clear by Andreas Samaris only as far as the lurking Davis, who nodded past Karnezis from the edge of the area.\nGreece, still without a Group F win, will finish bottom but at least had the last word three minutes from time as Vasilis Torosidis benefited from Brunt's failed attempt to clear, crossing for Aravidis to slide past Michael McGovern. It mattered little to the home team, however, who need a point from their final fixture to clinch the section.", "external_links": ["https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/124/441_324x182_326226722_324x182.jpg", "http://www.uefa.com/uefaeuro/qualifiers/season=2016/matches/round=2000446/match=2014025/postmatch/report/index.html#hungary+keep+hopes+alive", "http://www.uefa.com/uefaeuro/qualifiers/season=2016/matches/round=2000446/match=2014029/postmatch/report/index.html#portugal+progress", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/124/440_490x490_309648691_555x555.jpg", "http://www.uefa.com/uefaeuro/qualifiers/season=2016/matches/round=2000446/match=2014027/postmatch/report/index.html#romania+foil+finland", "http://www.uefa.com/uefaeuro/qualifiers/season=2016/matches/round=2000446/match=2014023/postmatch/report/index.html#long+downs+germany"], "published": "2015-10-09T06:15:00.000+03:00", "crawled": "2015-10-09T06:27:45.981+03:00", "highlightTitle": ""}