{"organizations": [], "uuid": "ca27e4e2c132402e120e3be1b77db903ed1a42fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/10/423401/default/v1/gettyimages-57547084-1-1600x900.jpg", "site_section": "http://news.sky.com/feeds/rss/politics.xml", "section_title": "Political News - International and UK Politics | Sky News", "url": "http://news.sky.com/story/1567193/former-chancellor-lord-howe-dies-aged-88", "country": "IL", "title": "Former Chancellor Lord Howe Dies Aged 88", "performance_score": 1, "site": "sky.com", "participants_count": 5, "title_full": "Former Chancellor Lord Howe Dies Aged 88", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:43:00.000+03:00", "replies_count": 4, "uuid": "6f81d45fe88e583cb5aa774a398288789fee1941"}, "author": "news.sky", "url": "http://news.sky.com/story/1567193/former-chancellor-lord-howe-dies-aged-88#post-0", "ord_in_thread": 0, "title": "Former Chancellor Lord Howe Dies Aged 88", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Chancellor Lord Howe has died after a suspected heart attack, his family has announced. Lord Howe was Margaret Thatcher's longest-serving Cabinet minister and his resignation in 1990 is widely seen as a central factor in the end of Mrs Thatcher's premiership.\nLord Howe had become Chancellor after Mrs Thatcher won the 1979 election and was made Foreign Secretary in her second term before being moved in 1989 to Leader of the House of Commons and Deputy Prime Minister.\nA statement issued by his family said: \"It is with deep sadness that the Howe family today announced that Geoffrey Howe died suddenly late yesterday evening, aged 88, at his home in Warwickshire, of a suspected heart attack, after enjoying a local jazz concert with his wife Elspeth.\"\nPrime Minister David Cameron remembered Lord Howe as a \"kind, gentle and deeply thoughtful man - but at the same time he had huge courage and resolve\".\nMr Cameron added that Lord Howe's time as Chancellor had been \"vital\" in \"turning the fortunes of our country around\", describing him as \"the quiet hero of the first Thatcher government\".\n\"He loved his politics and never stopped giving strong and sound advice. George Osborne and I benefited greatly from his wisdom and determination to improve the state of the country.\nGeoffrey Howe with Margaret Thatcher in the House of Commons in 1984\n\"The Conservative family has lost one of its greats. Our thoughts are with his family.\"\nFormer Conservative Deputy Prime Minister Michael Heseltine, who described Lord Howe as \"one of my oldest political friends and colleagues\", said: \"He was that most admirable of characters, a politician of great integrity. He could have made a huge fortune for himself outside politics but he never did.\"\n1 / 6 Gallery: Former Chancellor Lord Howe Dies\nLord Howe when he was Geoffrey Howe QC, pictured with his wife and family in 1970\nChancellor George Osborne posted on Twitter: \"I will miss Geoffrey Howe. He was a great source of advice to me; a quietly-spoken radical, whose bitterly contested budgets rescued Britain.\"\nConservative peer Lord Archer described Lord Howe as \"a thoroughly decent kind, thoughtful man who went into politics to give service\".\nSky News deputy political editor Joey Jones said that, while Lord Howe retired from the House of Lords a short time ago, he was still seen at Parliament until quite recently, despite being \"quite frail for some time\".\nJones said: \"He will be remembered for having been a staunch member and key figure in the Tory government but above all for the electrifying moment in 1990 when he made his resignation speech…anybody who heard it…it was a jaw dropping electrifying moment.\"\nThe 18-minute speech came as he resigned from the post of Deputy Prime Minister, and he used it to rip into Mrs Thatcher's inability to unite the party over Europe.\nIn possibly the most damaging passage, he said of Mrs Thatcher's attitude towards Europe and how her Chancellor and Bank of England officials could cope: \"It is rather like sending your opening batsmen to the crease only for them to find, the moment the first balls are bowled, that their bats have been broken before the game by the team captain.\"\nEven after he had \"retired\" to the House of Lords, Lord Howe was active in opposing what he considered to be damaging anti-European policies of the new Tory leader, William Hague, early in 1998.\nLord Howe, born Geoffrey Richard Edward Howe in Port Talbot in 1926, leaves a wife and three children.", "external_links": [], "published": "2015-10-10T18:43:00.000+03:00", "crawled": "2015-10-10T19:02:12.248+03:00", "highlightTitle": ""}