{"organizations": [], "uuid": "829a47d2214f6f12bf18e3ca6b4dc8446d395783", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://washingtontimes.com//rss/headlines/news/politics/", "section_title": "www.washingtontimes.com stories: Politics", "url": "http://www.washingtontimes.com/news/2015/oct/23/the-latest-new-mexico-secretary-of-state-resigns/", "country": "US", "title": "The Latest: Possible deal in New Mexico official fraud case", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "The Latest: Possible deal in New Mexico official fraud case", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:35:00.000+03:00", "replies_count": 0, "uuid": "829a47d2214f6f12bf18e3ca6b4dc8446d395783"}, "author": "RUSSELL CONTRERAS", "url": "http://www.washingtontimes.com/news/2015/oct/23/the-latest-new-mexico-secretary-of-state-resigns/", "ord_in_thread": 0, "title": "The Latest: Possible deal in New Mexico official fraud case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Latest: Possible deal in New Mexico official fraud case By RUSSELL CONTRERAS - Associated Press - Friday, October 23, 2015 \nALBUQUERQUE, N.M. (AP) - The latest developments on the resignation of New Mexico’s secretary of state (all times local): \n9:30 a.m. \nA state judge is reviewing a possible plea agreement in the fraud case against New Mexico Secretary of State Dianna Duran. \nDuran, who abruptly resigned late Thursday, had her lawyer submit a plea deal Friday in response to allegations that she misused campaign donations by funneling some $13,000 into personal accounts and filed false campaign finance reports with her own office. \nProsecutors say bank statements show transactions at casinos, restaurants and cash withdrawals at ATMs. \nDetails of the agreement are not yet public. \nAs secretary of state, the Republican was one of New Mexico’s highest-ranking elected officials. She was in her second term. \nBefore Friday’s announcements, Duran had faced calls to resign and a pending impeachment from the New Mexico House. \n8:30 a.m. \nRepublican Party of New Mexico officials say they respect New Mexico Secretary of State Dianna Duran’s decision to resign amid fraud allegations. \nNew Mexico GOP Chairman Debbie Maestas said Friday that the move will help restore credibility to the Secretary of State’s Office. \nMaestas says voters demand that elected officials be accountable to the law and Republicans advocate for accountability in government. \nDuran resigned from office Friday amid a fraud investigation that alleges she siphoned off thousands of dollars from her election account and withdrew the money at casinos around the state. \nDuran attorney Erlinda Johnson and Martinez spokesman Chris Sanchez said Duran’s resignation was effective immediately \nShe had previously ignored calls to step down and was facing impeachment.", "external_links": [], "published": "2015-10-23T18:35:00.000+03:00", "crawled": "2015-10-23T19:11:26.332+03:00", "highlightTitle": ""}