{"organizations": [], "uuid": "cc7bef789c28731e260f034a752cf6df6b39b6d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newrepublic.com", "main_image": "http://www.newrepublic.com/sites/default/files/candy.jpg", "site_section": "http://www.newrepublic.com/taxonomy/term/17538/feed#", "section_title": "The New Republic - Politics", "url": "http://www.newrepublic.com/article/123180/free-market-preys-your-every-weakness", "country": "US", "title": "The Free Market Preys on Your Every Weakness", "performance_score": 0, "site": "newrepublic.com", "participants_count": 1, "title_full": "The Free Market Preys on Your Every Weakness", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:30:00.000+03:00", "replies_count": 0, "uuid": "cc7bef789c28731e260f034a752cf6df6b39b6d2"}, "author": "George A. Akerlof", "url": "http://www.newrepublic.com/article/123180/free-market-preys-your-every-weakness", "ord_in_thread": 0, "title": "The Free Market Preys on Your Every Weakness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Free Market Preys on Your Every Weakness The economics of manipulation; or, why there's so much candy at the checkout counter. By George A. Akerlof and Robert J. Shiller Photo: frankieleon/Flickr \nI t is now not uncommon for 11-year-olds to be diabetic. I see one reason for it every time I check out at my local Safeway in Washington. The candy is right there at the cash register, waiting to be eaten. \nBut this does not mean that the manager of the store is mean or even irresponsible. If she has qualms about this practice, she would face a real dilemma: she needs to show a profit. The margins at supermarkets are tiny. No matter what her morals, she has almost no choice but to place those sweet impulse buys where customers can see them. In other words, there is an economic equilibrium in which businesses take advantage of every opportunity to increase profits. In such an equilibrium, the candy will be at the checkout counter. \nCuriously, while economists understand each and every such instance where people are tempted to buy things that are not good for them, they fail to appreciate that this occurs because of a general principle of economics. They fail to understand that free markets, as bountiful as they may be, will not only provide us with what we want, as long as we can pay for it; they will also tempt us into buying things that are bad for us, whatever the costs. Markets will deceive \nJust as free markets can serve the public good “by an invisible hand” (as Adam Smith saw more than two centuries ago, and is the foundation of the field of economics), free markets will do something else. As long as there is a profit to be made, they will also deceive us, manipulate us and prey on our weaknesses, tempting us into purchases that are bad for us. That is also a fundamental feature of market equilibrium, in which supply and demand balance each other out. \nMy fellow economists, while they recognize such behavior in individual instances, fail to see this as a general principle. And thus a lot of bad things happen, such as the candy at the checkout counter. Most notably, we economists should have been a chorus warning of the financial crash of 2008. We should have recognized that people should not be buying overrated mortgage-based securities, nor should banks have been creating the insecure loans that backed them. Instead there were at most a few lone voices of protest. We should have been more skeptical. \nBut this is not just about economists and what we think, because through long chains of reportage and other channels (such as this one), what we say in our faculty lounges affects politicians and the public opinion more generally. \nThis failure to understand that markets have this downside is then passed on into policy more narrowly defined. The public fails to understand that in the economic equilibrium, if there is a profit to be made, someone will take it up, as long as it is legal and as long as there is no public protest against it. The consequences of being a ‘phool’ \nA recent book we wrote called Phishing for Phools describes how the fundamental logic of economics, going back to Adam Smith, delivers this conclusion. That is, markets are not benign forces working for the greater good but instead are filled with businesses that “phish” by exploiting our weaknesses to get us to buy their products. We are the subjects of those phishes—the “phools”—when we fall for it. \nThe onus in the book was on us to show that temptations to make bad decisions really do significantly affect our well-being. Such a demonstration was surprisingly easy. \nThere are four huge areas of our lives—consumer spending, investment, health and politics—in which we are making decisions that no one (on reflection) could possibly want. Yet we make those decisions, and the free market provides them, just as bountifully as it satisfies our more benign impulses. \nFirst, even in the US, as rich as we are by all historical standards, most of us go to bed at night worried about how to pay our bills. We are continually tempted, and have a very hard time sticking to a budget . Thus, the median American family has on average less than one month’s expenditure in its bank account; half of all US respondents in a 2011 survey said they would have a very hard time raising US$2,000 in a month’s time if an emergency occurred; and my rough estimate suggests that 20% of us will go bankrupt at some point over our lifetimes. \nSecond, there are financial booms and busts because stories—what we are saying to ourselves and what we say to each other when we make our decisions—spread like epidemics. Those stories lead people into bad investments, and then, when those investments go sour, there are declines in confidence that threaten the whole financial system. Humpty Dumpty has a great fall and only slowly is pieced back together again. \nThird, regarding health, the market gives us tobacco, which, according to Centers for Disease Control estimates , is responsible for almost 20% of deaths in the United States. The pharmaceuticals industry sells us drugs with unknown long-term effects, which are sometimes severe. And Big Food serves us sugar and fat, so that two-thirds of Americans are overweight , with more than half of them also obese. The list goes on. \nFinally, the political system in a democracy is like a market system: there is a competition for votes. But that too has a “phishing equilibrium.” To keep their jobs, politicians have to raise money from “the interests” and use it for TV ads that show what nice folks they really are. Prosperity at a steep premium \nFree markets may lead to prosperity, but they also deliver more than the unalloyed benefits ascribed to them. This unwillingness to acknowledge their dark side undergirds the basic fundamental thinking of economists and leads to bad government policies. A grownup’s view of the economy that incorporates the downsides of capitalism is a prerequisite for sane policy. \nThe economic system works as well as it does not just because of individual incentives, but also because a whole raft of individual heroes, social agencies and government regulation puts limits on this downside of markets to phish us for phools. Such policy is a balancing act, to filter out the bad sediment while allowing through the true benefits of free markets. \nThis view of a phishing equilibrium thus challenges current economic thinking in a new way. There is a huge payoff to incorporating it into our view of the economy. Just as we love our children, we should love free markets; but as with our children, it would be a mistake to think that they can do no wrong. \nThis article was originally published on The Conversation . Read the original article . \nGeorge A. Akerlof is a University Professor at Georgetown University and Robert J. Shiller is a Professor of Economics at Yale University For more stories, like the New Republic on Facebook: Loading Related Articles...", "external_links": [], "published": "2015-10-21T23:30:00.000+03:00", "crawled": "2015-10-22T03:07:28.084+03:00", "highlightTitle": ""}