{"organizations": [], "uuid": "7aa62c28a8693860ff7e9c525c3917cc65a9b059", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "marijuanastocks.com", "main_image": "http://marijuanastocks.com/wp-content/uploads/2014/09/NEWS.jpg", "site_section": "http://marijuanastocks.com/category/political-marijuana-news/page/6/", "section_title": "Political Marijuana News Archives - Page 6 of 32 - Marijuana Stocks | Cannabis Investments and News. Roots of a Budding Industry.™", "url": "http://marijuanastocks.com/fwdg-scientific-markets-cannabis-thc-hemp-cbd-hempseed-energy-drinks/", "country": "US", "title": "$FWDG Scientific Markets Cannabis THC, Hemp CBD & Hempseed Energy Drinks", "performance_score": 0, "site": "marijuanastocks.com", "participants_count": 1, "title_full": "$FWDG Scientific Markets Cannabis THC, Hemp CBD & Hempseed Energy Drinks - Marijuana Stocks | Cannabis Investments and News. Roots of a Budding Industry.™", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "7aa62c28a8693860ff7e9c525c3917cc65a9b059"}, "author": "marijuanastocks.com", "url": "http://marijuanastocks.com/fwdg-scientific-markets-cannabis-thc-hemp-cbd-hempseed-energy-drinks/", "ord_in_thread": 0, "title": "$FWDG Scientific Markets Cannabis THC, Hemp CBD & Hempseed Energy Drinks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FutureWorld (FWDG) CB Scientific Markets Cannabis THC, Hemp CBD & Hempseed Infused Energy & Chill Drinks under Brand “Magic Dragon High” “Magic Dragon High Brands” Initially to Produce Hemp Infused Beverages FutureWorld Corp. (FWDG), a cannabis technology accelerator and a leading provider of advanced technologies and solutions to the global cannabis industry, announced today that its subsidiaries, Bioceutical Sciences and CB Scientific, have joined forces to develop and unveil next generation Cannabis based THC & Hemp based infused energy and chill drinks for the consumers and patients under the brand “Magic Dragon High”. Magic Dragon High Brands will initially produce Hempseed and Hemp based CBD infused beverages. Hempseed and Hemp based CBD infused energy & chill drinks will be sold globally through all channels which may include eBay and Amazon. FutureWorld and its subsidiaries have been working and developing exciting Hemp and CBD based formulations for almost a year using leading edge technologies and great talents. We believe we are on the cusp of a great change coming to the world with the advent of Hemp and Cannabis as medicinal harbingers hence making companies such as FWDG pioneers in a vast undeveloped market.\nCB Scientific will be marketing and selling both products developed by Bioceutical Sciences. The Company has set a goal of producing over 500,000 (or more) bottles of Hempseed, Hemp CBD and Cannabis THC infused beverages for this calendar year.\nFor updated information on the progress of the Magic Dragon High Brands products please visit our Facebook page: https://www.facebook.com/magicdragonhigh\nAccording to new market data from Packaged Facts; the energy drinks sector comprises an increasing portion of the non-alcoholic beverage market, and as the sector, has grown 60% from 2008-2012 with a total U.S. sales of more than $12.5 billion in 2012. According to “Energy Drinks & Shots Market Trends in the U.S.”, sales of energy drinks will grow to a value of $21.5 billion by 2017, driven by expansion in retail distribution, and strong potential in new product development. Packaged Facts also estimates that convenience stores hold the largest share of market sales (59%), followed by mass merchandisers (13%), supermarkets (10%), club stores/warehouse (5%), and drug stores (2%). In aggregate, all other retailers contribute a significant 11% to market sales.\nMore exciting product lines are in development by both CB Scientific and Bioceutical Sciences and will be introduces when available.\nAbout Bioceutical Sciences\nIt has taken over a year of due diligence, ironing out every detail regarding linear and nonlinear obstacles; creating doctoral connections in every division of laboratory control and procedure to ensure proper operation of a state-of-the-art laboratory. These factors ensure that Bioceutical Sciences(TM) follows proper manufacturing, analytic, and production standards and practices for continuous operation. Currently Bioceutical Sciences(TM) manufactures, designs, processes and develops the following:\n–(Hemp) CBD oil testing and analytics\n–Raw (Hemp) CBD oil\n–Processed (Hemp) CBD oil with multi-variation in strength and quality\n–(Hemp) CBD oil formulations such as Vapes, Tinctures, Pills, Capsules, Edibles, and custom formulations for nutraceutical companies\n— Specialty formulations for patience in the legal cannabis states\nBioceutical Sciences(TM) products and services are also available as Private label to retailers, wholesalers and distributors worldwide. Bioceutical Sciences(TM) has also been instrumental in developing unique products for CB Scientific, and URVape and will continue to do so in the foreseeable future.\nAbout CB Scientific\nCB Scientific (www.cbscientific.com) is a wholly owned subsidiary of FutureWorld Corp based in Denver, Colorado. CB Scientific is continuing to develop new technologies specifically for cannabis (hemp) analytics. CB Scientific believes every product sold to patients as “Medical Quality” should be inspected for health benefits, safety, consistency, purity, potency and packaged properly for distribution. CB Scientific has worked with many of the cannabis industry leaders in the country and have also been featured in cannabis industry publications including High Times Magazine, Culture and many trade publications, on-air interviews and panel discussions across the United States. CB Scientific’s focus has been the education and safety of consumers combined with innovation to put power into the hands of the patients. Values that FutureWorld is pleased to embrace while ever striving to raise the bar of cannabis analytics even higher.\nThe test kits have been featured on ABC, CBS, Fox, Telemundo, The Adam Dunn Show, as well as in publications such as High Times, Culture and Forbes Magazine. In December 2014, just 94 days after its launch the THC & CBD Test Kits were awarded “Product of the Year” by the Cannabis Business Awards in Colorado.\nTo request further information about CB Scientific, please email us at info@cbscientific.com, log onto our website at http://www.cbscientific.com or visit us on FB @ cbscientificinc and Twitter @cbscientific.\nAbout FutureWorld Corp.\nFutureWorld (FWDG), a Delaware corporation, is a leading provider of advanced technologies and solutions to the global cannabis industry. FutureWorld, together with its subsidiaries, focuses on the identification, acquisition, development, and commercialization of cannabis related products and services, such as industrial Hemp. FutureWorld, through its subsidiaries, provides personal and professional THC and CBD test kits, pharmaceutical grade CBD oil solutions, SafeVape vaporizers, smart sensor technology, communication network, surveillance security, data analysis for smart cultivation and consultation for the industrial hemp and legal medicinal cannabis. Our wireless agricultural smart sensor networks offer precision to the agriculture, irrigation systems, and greenhouses for the global cannabis and hemp industry. FutureWorld and its subsidiaries do not grow, distribute or sell marijuana.\nAs the only Cannabis Technology Accelerator, FutureWorld will incubate and fund leading technologies, products, and services for Cannabis industry (Industrial Hemp) for foreseeable future; bringing value to its core and its shareholders.\nTo request further information about FutureWorld, please email us at info@futureworldcorp.com, log onto our website at http://www.futureworldcorp.com or visit us at our Facebook page facebook.com/futureworldcorp or on Twitter @futureworldinc.\nForward-Looking Statements\nThis press release may contain forward-looking statements covered within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements relate to, among other things, plans and timing for the introduction or enhancement of our services and products, statements about future market conditions, supply and demand conditions, and other expectations, intentions and plans contained in this press release that are not historical fact and involve risks and uncertainties. Our expectations regarding future revenues depend upon our ability to develop and supply products and services that we may not produce today and that meet defined specifications. When used in this press release, the words “plan,” “expect,” “believe,” and similar expressions generally identify forward-looking statements. These statements reflect our current expectations. They are subject to a number of risks and uncertainties, including, but not limited to, changes in technology and changes in pervasive markets. This release includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 27E of the Securities Act of 1934. Statements contained in this release that are not historical facts may be deemed to be forward-looking statements. Investors are cautioned that forward-looking statements are inherently uncertain. Actual performance and results may differ materially from that projected or suggested herein due to certain risks and uncertainties including, without limitation, ability to obtain financing and regulatory and shareholder approval for anticipated actions.\nContact: Media Contact FutureWorld Corp. Http://www.futureworldcorp.com info@futureworldcorp.com (727) 474-1816 ext. 103 Twitter - @futureworldinc Facebook - futureworldcorp", "external_links": ["https://www.facebook.com/magicdragonhigh", "http://www.addtoany.com/add_to/facebook?linkurl=http%3A%2F%2Fmarijuanastocks.com%2Ffwdg-scientific-markets-cannabis-thc-hemp-cbd-hempseed-energy-drinks%2F&linkname=%24FWDG%20Scientific%20Markets%20Cannabis%20THC%2C%20Hemp%20CBD%20%26%20Hempseed%20Energy%20Drinks", "http://www.addtoany.com/add_to/twitter?linkurl=http%3A%2F%2Fmarijuanastocks.com%2Ffwdg-scientific-markets-cannabis-thc-hemp-cbd-hempseed-energy-drinks%2F&linkname=%24FWDG%20Scientific%20Markets%20Cannabis%20THC%2C%20Hemp%20CBD%20%26%20Hempseed%20Energy%20Drinks", "https://www.addtoany.com/share_save", "http://www.addtoany.com/add_to/google_plus?linkurl=http%3A%2F%2Fmarijuanastocks.com%2Ffwdg-scientific-markets-cannabis-thc-hemp-cbd-hempseed-energy-drinks%2F&linkname=%24FWDG%20Scientific%20Markets%20Cannabis%20THC%2C%20Hemp%20CBD%20%26%20Hempseed%20Energy%20Drinks"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T16:45:41.213+03:00", "highlightTitle": ""}