{"organizations": [], "uuid": "4fe942990d5c5b7489e7c3f780c62187244b9684", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/9e/4e/883675f64759922fbb706751f035/biden-gty-629.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/clinton-donors-biden-214598", "country": "US", "title": "Clinton donors place side bets on Biden", "performance_score": 9, "site": "politico.com", "participants_count": 9, "title_full": "Clinton donors place side bets on Biden - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:33:00.000+03:00", "replies_count": 8, "uuid": "52ad362f6dd1501da795e66eca231c2f8124b8c6"}, "author": "Eliza Collins", "url": "http://www.politico.com/story/2015/10/clinton-donors-biden-214598#post-0", "ord_in_thread": 0, "title": "Clinton donors place side bets on Biden", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DENVER -- A Denver-based philanthropist who in May was appointed to the board of the pro-Hillary Clinton PAC Correct the Record has stepped down from the position and donated to the campaign to draft vice president Joe Biden into the race, POLITICO has learned. LGBT rights activist Scott Miller and his husband, mega-donor Tim Gill, each gave $25,000 to Ready for Hillary last year and have supported her candidacy and the coordinating rapid response PAC.\nBut the couple, who over the years have given millions to progressive candidates and causes, are close to Biden and his potential entry into the race has changed the calculus for them -- together they have now donated $50,000 to the Draft Biden campaign as well.\n“To the extent that you are ever personal friends with a politician, I would put the vice president in that category,” Miller told POLITICO in an interview. “When I joined Correct the Record earlier this summer, I had no inclination that the vice president was even considering this.\"\nHe said that his association with the Draft Biden group has been \"exactly the same as it was with Ready for Hillary people from a financial standpoint. [Tim Gill and I] each gave $25,000 to Ready for Hillary and we gave an equal amount to the Draft Biden campaign.”\nClinton heckled at Hispanic Caucus event By Eliza Collins\nMiller conceded that the potential face-off between two Democrats he believes are equally qualified to be President puts him in an awkward position, and that he will ultimately continue donating to both.\n“I don’t think anyone is looking forward to blue-on-blue competition,” he said. “At the end of the day, I’ve met both of them, I know both of them. I will support whoever wins -- at the end of the day we can’t go wrong with either of them.”\nFor some top Democratic donors who are supporting Clinton but have strong ties to Biden, a run by the vice president will not mean choosing -- it will mean shelling out double the number of checks they were planning to write.\n“With two equally qualified people, it will cost a lot of donors a lot more, unfortunately,” Miller joked.\nAnother major Obama bundler who declined to be named said that he recently spoke with Biden and told him that if he entered the race, he would immediately write him a check for $2,700, the maximum an individual can give to a candidate, but that he was already committed to Clinton all the way.\nBoth Miller and the donor who declined to give his name said Biden had not directly asked for their support.\nCorrect the Record is a group founded by Clinton ally David Brock to serve as a rapid response and research firm to defend Clinton from right-wing attacks. Brock had no comment for this story.\nNew York Magazine reported last week that the group has been digging into Biden’s record to develop attack lines against the vice president if he should enter the race. In an interview on PBS News Hour earlier this week, Clinton said she has “no knowledge” of any opposition research targeting Democrats.\nMiller said as he leaves Correct the Record, he is joining the board of American Bridge, a PAC also founded by Brock that researches Republicans' records and holds them accountable. On Thursday night, he and Gill both came out to fete the publication of Brock's book, \"Killing the Messenger,\" at a book signing in Denver.\nHillary's Wall Street crackdown: Less than meets the eye By Zachary Warmbrodt\n“I admire what David has done,” he said, “His group Media Matters was so helpful for the LGBT community, and American Bridge can be a little more aggressive.”\nHis husband, philanthropist Gill, the founder of Quark who is said to be worth $400 million, told POLITICO he has been solicited by Priorities USA, the super PAC that is supporting Clinton’s bid. But he declined to donate and does not plan to in this cycle.\n“Priorities has approached me,” said Gill, whose eponymous foundation has invested more than $277 million in programs supporting LGBT rights across the country. “I tend to not like giving to big things where I don’t understand what’s going to come out of them. I don’t dislike PACs, I just like to understand how my money is being spent. On the Obama campaign, we spent money very specifically on Colorado as a mechanism to make sure Obama took Colorado. I assume we will do that again this time. There are things that I like and things that I don’t like. I tend to like ground games, I’m not as big fan of TV commercials.”\nHe added that he remains a big fan of Biden’s but declined to comment about his potential entry. “We love Joe, he’s done so many things for the LGBT community, you can’t not like Joe,” Gill said. “He’s not a candidate at this point, so I don’t think about it too much.”\n<div", "external_links": ["http://nymag.com/daily/intelligencer/2015/10/clinton-readies-oppo-research-against-biden.html"], "published": "2015-10-08T19:33:00.000+03:00", "crawled": "2015-10-09T09:54:17.385+03:00", "highlightTitle": ""}