{"organizations": [], "uuid": "e3b3c5058175871cf5b94f8caf84f27bac68aefe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.csmonitor.com", "main_image": "http://images.csmonitor.com/csm/2015/10/941041_1_pp_standard.jpg?alias=standard_900x600", "site_section": "http://www.csmonitor.com/USA/Politics", "section_title": "Politics - The Christian Science Monitor - CSMonitor.com", "url": "http://www.csmonitor.com/USA/Politics/2015/1014/Under-pressure-Planned-Parenthood-forgoes-all-fetal-tissue-reimbursement", "country": "US", "title": "Under pressure: Planned Parenthood forgoes all fetal tissue reimbursement", "performance_score": 0, "site": "csmonitor.com", "participants_count": 1, "title_full": "Under pressure: Planned Parenthood forgoes all fetal tissue reimbursement - CSMonitor.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "e3b3c5058175871cf5b94f8caf84f27bac68aefe"}, "author": "Story Hinckley", "url": "http://www.csmonitor.com/USA/Politics/2015/1014/Under-pressure-Planned-Parenthood-forgoes-all-fetal-tissue-reimbursement", "ord_in_thread": 0, "title": "Under pressure: Planned Parenthood forgoes all fetal tissue reimbursement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After contentious videos were released suggesting Planned Parenthood officials received profits for fetal tissue, the organization announced Tuesday it will no longer accept reimbursements of any kind.\nCecile Richards, the president of Planned Parenthood, testified before Congress in September that the videos were deceptively edited and the organization has never sought reimbursement from researchers for post-abortion fetal tissue outside of what is legally permissible.\nBut a new policy, outlined in a letter Tuesday from Ms. Richards to Francis Collins, the director of the National Institutes of Health, says the controversy has led the organization to cover the costs of the program itself and reject even legal reimbursement.\nRecommended: 11 states charging hard against abortion “Planned Parenthood’s policies on fetal tissue donation already exceed the legal requirements,” Richards wrote in the letter . “Now we’re going even further in order to take away any basis for attacking Planned Parenthood to advance an anti-abortion political agenda.”\n11 states charging hard against abortion In Pictures Debating abortion Opponents of Planned Parenthood say this is more than an effort to save face – it’s “an admission of guilt.”\n“If the money Planned Parenthood has been receiving for baby body parts were truly legitimate ‘reimbursement,’ why cancel it?” asked David Deleiden, who led the attack against the program, an a statement responding to the decision.\n“It is curious that, while Planned Parenthood officials maintain there has been no wrongdoing, they still find it necessary to change their policy,” Rep. Diane Black, a Tennessee Republican who continues to oppose the program, told the Associated Press. “Clearly, this was a decision motivated by optics rather than the organization’s conscience.”\nPlanned Parenthood maintains that the decision represents an attempt to take \"away any basis for attacking Planned Parenthood’s limited work in fetal tissue donation.\"\nAnd although the organization will now cover the cost of research donation, “I don’t think it will have a huge impact on their budget,” Dawn Laguens, Planned Parenthood’s executive vice president told the Associated Press. “For Planned Parenthood, this was always about one thing – honoring the desire of women to contribute to lifesaving research. It was never about money.”\nSome supporters of the organization say this move can do nothing but help.\n“The fees are being used to promote the canard that PP is killing babies for profit. They are not,” Professor Arthur Caplan, director of the Division of Medical Ethics at NYU Langone Medical Center’s Department of Population Health, told the Associated Press. “But deciding not to accept reimbursement for any processing or handling would effectively end the lying about what PP is and has been doing.”\nScientists continue to support Planned Parenthood’s research efforts. The Department of Health and Human Services wrote a letter of support for the organization to Congress in August, saying “fetal tissue continues to be a critical resource for important efforts.”\nOf Planned Parenthood’s 700 health centers nationwide, only two provide scientific researchers with fetal tissue: one in Washington and one in California. Ms. Laguens says Washington already had a no-reimbursement-whatsoever policy, so the new policy will simply require the state of California to do the same.\nThis report contains material from the Associated Press.", "external_links": ["http://www.centerformedicalprogress.org/2015/10/cmp-statement-on-planned-parenthoods-alleged-policy-change/", "http://ppfa.pr-optout.com/ViewAttachment.aspx?EID=mr9WXYw4u2IxYnni1dBRVmiqCFHVBXQWHDzndIMBxKo%3d", "https://www.plannedparenthood.org/about-us/newsroom/press-releases/taking-away-basis-for-discredited-smear-campaign-planned-parenthood-declines-any-reimbursement-for-fetal-tissue-donation"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-17T05:03:10.154+03:00", "highlightTitle": ""}