{"organizations": [], "uuid": "d7776109b7b66396a08b8969bee9eeab1baf549b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "politicaloutcast.com", "main_image": "http://cdn3.politicaloutcast.com/wp-content/uploads/2015/10/photo_badge.jpg", "site_section": "http://feeds.feedburner.com/PoliticalOutcast", "section_title": "Political Outcast", "url": "http://politicaloutcast.com/2015/10/zero-tolerance-not/", "country": "US", "title": "Zero Tolerance--Not!", "performance_score": 0, "site": "politicaloutcast.com", "participants_count": 1, "title_full": "Zero Tolerance--Not!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T09:02:00.000+03:00", "replies_count": 0, "uuid": "d7776109b7b66396a08b8969bee9eeab1baf549b"}, "author": "Mack Stetson", "url": "http://politicaloutcast.com/2015/10/zero-tolerance-not/", "ord_in_thread": 0, "title": "Zero Tolerance--Not!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A 14-year-old high school student was choked by the on-campus police officer who was there to break up a fight between the boy and a classmate. \nAt Brietbart.com we read: “One male student refused to comply with an administrator and was attempting to continue to fight the other student,” read the Round Rock Police Department statement about the incident, highlighting police action was taken “for his safety and the safety of others.” It said this came after “repeated attempts to calm the non-compliant student, and stop him from going after the other student.” However, the police statement did not specifically address what another student caught on cellphone — one of the two campus police grabbing the student by the throat and then taking him by force face down to the ground. \nEvery week, we hear news stories from around the country of some small infraction by a student that is treated as if it is a crime or something equally heinous. Schools defend their behavior in the name of \"zero tolerance.\" No judgement, no discernment on the parts of school officials. Just clamping down on every offense so as not to set a precedence of doing the wrong thing. All decisions are made in the name of setting an example to make sure the students know the schools are serious about their policies. \nNow, at this school in Austin, Texas, the school system, along with the local police, must be held to the same zero tolerance policy. Officer Rigo Valles was not held to a zero tolerance policy standard. He did not lose his job, despite his clear violation of the school policy to keep students safe at all times. If zero tolerance is going to work for any part of the school system, it should be honored on parts of students as well as faculty and staff. \nMaybe its time to stop hiding behind \"zero tolerance\" and to begin to use some common sense when dealing with everyday mistakes that kids make.", "external_links": [], "published": "2015-10-20T09:02:00.000+03:00", "crawled": "2015-10-20T09:13:08.386+03:00", "highlightTitle": ""}