{"organizations": [], "uuid": "e5cde02314eb6d2adba91942548b5b140cac6207", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/anthrax-congressman-michael-farley-214485", "country": "US", "title": "Anthrax claims life of former congressman, Oct. 8, 1921", "performance_score": 0, "site": "politico.com", "participants_count": 1, "title_full": "Anthrax claims life of former congressman, Oct. 8, 1921 - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:00:00.000+03:00", "replies_count": 0, "uuid": "e5cde02314eb6d2adba91942548b5b140cac6207"}, "author": "Andrew Glass", "url": "http://www.politico.com/story/2015/10/anthrax-congressman-michael-farley-214485", "ord_in_thread": 0, "title": "Anthrax claims life of former congressman, Oct. 8, 1921", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On this day in 1921, Michael Farley, a former one-term Democratic congressman from New York’s West Side, died — less than seven hours after having been exposed to a deadly form of anthrax and being admitted to Manhattan’s Bellevue Hospital. He was 56. Two days earlier, Farley, a stalwart in New York’s Tammany Hall political machine, had shaved with an imported brush contaminated with the anthrax bacillus. What at first appeared to be a pimple on his chin, spread to his neck and face, which became swollen and painful. He received anti-anthrax serum, but the treatment proved unsuccessful.\nAt the time, New York public health officials were waging a campaign to bar the importation of infected hides and animal hair products. These items, including shaving brushes and toothbrushes, had recently caused 11 deaths in the New York City area.\nFarley was born in Ireland. When he was 18, he immigrated to New York City and opened a tavern. In time, he made a small fortune in the saloon business and became president of the Wine and Liquor Dealers Association of New York.\nDuring his two years in Congress, from 1915 to 1917, Farley generally supported the policies of President Woodrow Wilson. He did, however, back a congressional resolution, triggered by the World War I vortex, which Wilson opposed. It urged U.S. citizens not to travel on belligerent merchant ships and called upon Secretary of State William Jennings Bryan to refuse to issue passports to Americans who intended to travel on such vessels.\nFarley was often absent from the Capitol, tending to his saloon business in New York. That became a wedge issue in his 1916 reelection campaign, which he lost to Fiorello La Guardia, a reform-minded Republican. During the campaign, La Guardia often referred to him as “the sitting congressman.”\nSOURCE: OFFICE OF THE HOUSE HISTORIAN AND CLERK OF THE HOUSE OFFICE OF ART AND ARCHIVES\n<div", "external_links": [], "published": "2015-10-08T20:00:00.000+03:00", "crawled": "2015-10-08T08:37:57.396+03:00", "highlightTitle": ""}