{"organizations": [], "uuid": "219ac75c3abaa1a7fcdc0c5682b0e05428013755", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-35af67fe45ac5260000f101f9d571bb4.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/fracking-topples-old-king-coal/article/2574670?custom_click=rss", "country": "US", "title": "Fracking topples old King Coal", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Fracking topples old King Coal | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:01:00.000+02:00", "replies_count": 0, "uuid": "219ac75c3abaa1a7fcdc0c5682b0e05428013755"}, "author": "John Siciliano", "url": "http://www.washingtonexaminer.com/fracking-topples-old-king-coal/article/2574670?custom_click=rss", "ord_in_thread": 0, "title": "Fracking topples old King Coal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "King Coal may be losing its throne sooner than expected, as the U.S. goes through a change in how it gets the bulk of its electricity.\n“ 'Back in the 1980s they probably bitched and moaned about nuclear plants.' ” The change is not coming from solar and wind as environmental groups would like to believe, although renewables are growing. The big switch is coming from natural gas produced from fracking shale rock deep underground.\nNatural gas is replacing coal as the dominant way Americans receive electricity to power everything from their lights to their iPhones to the big screen televisions. It is cheaper than coal, which is why natural gas power plants are increasing in numbers. But it is also domestically produced, in abundant supply and cleaner than coal, experts say.\n  Obamacare regs give nurses a headache Hospitals want more education in a profession that has been   low-income people.\nBy Sean Higgins • 10/26/15 12:01 AM Record low prices, in particular, have been driving the use of natural gas.\nPeter Abt, managing director for consulting firm Black & Veatch, said \"with respect to growth, we are in a period of sustained low prices,\" with enough gas reserves to last a century. Abt said historic low prices, still well below $3 per unit of gas, paired with large 100-year reserves, will encourage gas-fired power plants to \"grow out for decades.\"\nThe Environmental Protection Agency's Clean Power Plan, which is meant to curb power plant emissions blamed for global warming, \"exacerbates that\" by encouraging even faster growth in gas-fired power plants, while coal use falls. Gas prices have been low for more than a year, but the recent jump in gas-fired electricity that began in April came at a bit of a surprise.\nOther factors are playing into the recent rise of natural gas ahead of schedule, according to experts. Many acknowledge that the share of gas-fired electricity will grow with the Clean Power Plan coming into place beginning next year. But there is growing evidence that companies and states aren't waiting, and have been preparing for the rules even though many states plan to fight them in court.\nFactors for the rush to gas include: anticipation of a climate deal in Paris in December requiring emissions to be lower; states and even coal-based utilities beginning to develop plans to comply with the administration's power plant rules that are key to the Paris deal; and utility companies building new natural gas plants to replace coal facilities that have been closed due to federal regulations for other gases.\nAlso from the Washington Examiner For Priebus, it's win or bust for 2016 Priebus says the party will be \"cooked\" if it loses to a Democrat for a third straight cycle.\nBy Al Weaver • 10/26/15 12:01 AM October saw a spike in the number of companies announcing they are building new natural gas plants or buying them from other firms to increase the size of their gas-fired fleets. TransCanada, the developer of the embattled Keystone XL pipeline, announced it is acquiring gas plants in the United States.\nThe percentage of electricity produced from natural gas exceeded that of coal for the second time in history this year, according to the Energy Information Administration, the Department of Energy's analysis arm.\nSurprisingly, \"this switch occurred in April, generally the month with the lowest demand for electricity,\" the Energy Information Administration said.\nBoth coal and gas output did rise in the summer as expected. But natural gas soared at a rate that coal-fired plants could not keep up with. As gas use spiked, coal suffered losses. Coal-fired electricity dropped from 150 billion kilowatt hours (kWh) to 139 billion kWh, while gas-fired power output rose from 114 to 140 billion kWh.\nCoal now occupies 34.9 percent of electricity generation, while gas dominates at 35 percent of generation.\nAlso from the Washington Examiner New 'smart' drugs tell doctor you're not taking them A new smart drug could be particularly useful in ensuring the mentally ill continue taking their medications.\nBy Paige Winfield Cunningham • 10/26/15 12:01 AM Kimberly Vanwyhe, energy policy director at the conservative American Action Forum, said the difference may be small, but it's significant given the decades that coal has dominated as the nation's main form of power generation.\n\"Domestically, I think that's where we are going,\" with more natural gas taking away coal's historic \"lion's share\" of the nation's electricity production, Vanwyhe said. \"You are really seeing a shift to gas …, and with the [Obama administration's] Clean Power Plan in play, you will\" see that continue.\nThe coal industry is trying to downplay the switch, saying the patterns are cyclical.\n\"These data fluctuate from quarter to quarter, but year-on-year coal still generates more electricity than any other fuel, including gas,\" said National Mining Association spokesman Luke Popovich in an email.\n\"That said,\" he says, there is \"no question that coal has lost [market] share to gas – in part, though, thanks to the administration's energy policies that destroy existing coal plants, prohibit new ones from being built and then offers the jobless coal miners state welfare.\"\nLast year, coal beat out natural gas by almost 12 percentage points in electricity production, according to the Energy Department. Coal supplied 39 percent, while natural gas provided 27 percent.\nVanwyhe concedes fluctuations in the coal-to-gas mix, due to power plant maintenance cycles. But she sees the data as historic and illustrative of the way the market is going. She understands that those in the coal industry are \"not happy campers,\" but natural gas is here to stay and environmental regulations such as the \"Clean Power Plan won't go away any time soon.\"\nGroups representing manufacturers, which are large users of electricity, say the industry invites the increased use of natural gas because its keeping their operational costs low. Those savings are passed on to residential consumers.\nJohn Hughes, technical expert and vice president for the Electric Consumer Resource Council, says, \"I think it's a good thing … and I know [our] members love it,\" although \"environmentalists hate it\" because natural gas is still a fossil fuel. But overall, \"I can't think of anything better that had happened\" for large consumers than the switch to low-price gas.\nHughes doesn't buy the mining association's argument that regulations are to blame for coal's losses. He says its \"kind of a mixed bag for them,\" but the argument that environmental regulations \"are killing coal\" is \"kind of weak\" when gas prices are so low. \"Back in the 1980s they probably bitched and moaned about nuclear plants,\" which offered very cheap power.\n\"Cheap gas is sort of [an increasing] phenomenon right now,\" Hughes said. \"There is growing evidence … that is not a bubble that is about to burst.\"\n\n\nTop Story Joe Biden: 'I'm   Trump' \n \nBy Curt Mills • 10/25/15 8:16 PM", "external_links": [], "published": "2015-10-26T02:01:00.000+02:00", "crawled": "2015-10-26T11:06:49.647+02:00", "highlightTitle": ""}