{"organizations": [], "uuid": "b0220b2fd441515d4ec0f3e299f31933bd85aaa9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.berkeley.edu", "main_image": "http://news.berkeley.edu/wp-content/uploads/2015/10/CITC_1967-750.jpg", "site_section": "http://www.berkeley.edu/news/rss/UCBArcSocSci.rss", "section_title": "Berkeley News » Politics & society", "url": "http://news.berkeley.edu/2015/10/06/cal-in-the-capital-marks-half-century-of-service-in-d-c/", "country": "US", "title": "Cal in the Capital marks half century of service in D.C.", "performance_score": 0, "site": "berkeley.edu", "participants_count": 1, "title_full": "Cal in the Capital marks half century of service in D.C.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T18:46:00.000+03:00", "replies_count": 0, "uuid": "b0220b2fd441515d4ec0f3e299f31933bd85aaa9"}, "author": "Cathy Cockrell", "url": "http://news.berkeley.edu/2015/10/06/cal-in-the-capital-marks-half-century-of-service-in-d-c/", "ord_in_thread": 0, "title": "Cal in the Capital marks half century of service in D.C.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Generations of Berkeley students gathered Oct. 1 to mark the 50th anniversary of Cal in the Capital, the summer internship program in Washington, D.C., founded by Berkeley students in 1965. (Text continues below slideshow.) This slideshow requires JavaScript. \nAbout 75 CITC alumni, including current students recently returned from summer internships, met at the Bancroft Hotel to celebrate and reminisce. Mike Williams, director of intercollegiate athletics and a 1982 Cal in the Capital intern, offered the keynote address. \nCal in the Capital is believed to be the oldest internship program in Washington. Since its founding during Lyndon Johnson’s presidency, it has placed more than 3,500 summer interns in more than 400 organizations – congressional offices, government agencies, nonprofits, think tanks and private businesses – launching political and public-service careers and forging friendships of a lifetime. \nOne past participant is U.S. Rep. Barbara Lee, who began her political career as a CITC intern in the office of then-Rep. Ron Dellums, while studying social work at Berkeley in the mid ‘70s. Lee went on to become Dellums’ chief of staff, then a member of the California state Assembly and Senate. She won election to Congress in 1998. \n“Since 1965, this student-led organization has prepared 75 UC Berkeley students each year for once-in-a-lifetime internship opportunities…,” combining “world-class education with hands-on experience,” Lee said in a proclamation on Capitol Hill Thursday. “This program changed my life,” she said on a personal note, “as it has for so many others.” \n“This unique program provides students with an opportunity to learn what social change means at the national level, and the chance to develop real-world experience and professional growth,” U.S. Sen. Diane Feinstein wrote in another commendation. \nThe roster of notable CITC alums includes faculty member Lisa García Bedolla, a professor of education and political science; Zoë Baird, president of the Markle Foundation; and J. Michael McGinnis, a health policy leader through four presidential administrations and currently a senior scholar at the national Institute of Medicine. McGinnis helped to found CITC while an undergraduate at Berkeley and remains an active supporter of the program today. \nThe UC Berkeley Public Service Center, which administers Cal in the Capital and prepares students for their internship experiences, estimates that CITC interns have provided more than 1.6 million hours of public service since the program’s inception. \nFor its golden anniversary, Cal in the Capital hopes to raise $5 million for an endowment fund to help make the program, whose internships are mostly unpaid, accessible to all interested students. It costs more than $5,000 for travel, living expenses and summer housing at the UC Washington Center, where students from UC campuses live and study while participating in programs like CITC and UCDC (which sends Berkeley students to D.C. during spring and fall semesters). Most Cal in the Capital internships are unpaid. \nChancellor Nicholas Dirks will be the keynote speaker at a Cal in the Capital anniversary event in Washington, D.C., on Oct. 20.", "external_links": [], "published": "2015-10-06T18:46:00.000+03:00", "crawled": "2015-10-07T04:08:03.169+03:00", "highlightTitle": ""}