{"organizations": [], "uuid": "a13eeb6ce6bd6f373e3f6cdd05557c8a3e331726", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-561e743e/turbine/la-na-clinton-debate-analysis-20151014", "site_section": "http://www.baltimoresun.com/news/maryland/politics/rss2.0.xml", "section_title": "Politics - Baltimore Sun", "url": "http://www.baltimoresun.com/news/maryland/politics/la-na-clinton-debate-analysis-20151014-story.html", "country": "US", "title": "Hillary Clinton reassures Democrats, but did she scare off Joe Biden?", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Hillary Clinton reassures Democrats, but did she scare off Joe Biden?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:16:00.000+03:00", "replies_count": 0, "uuid": "a13eeb6ce6bd6f373e3f6cdd05557c8a3e331726"}, "author": "David Lauter", "url": "http://www.baltimoresun.com/news/maryland/politics/la-na-clinton-debate-analysis-20151014-story.html", "ord_in_thread": 0, "title": "Hillary Clinton reassures Democrats, but did she scare off Joe Biden?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Evan Halper and Kurtis Lee) \n\"What I did was allowed by the State Department, but it wasn't the best choice,\" she said, then quickly pivoted to an attack on Republicans that drew cheers from the crowd in the hall. \nRepublicans had spent $4.5 million in taxpayer funds on an investigative committee in Congress that was acting as an \"arm of the Republican National Committee,\" she said. \"It is a partisan vehicle\" designed to \"drive down my poll numbers,\" she added, citing a statement made recently by House Majority Leader Kevin McCarthy of Bakersfield. \n\"That's what they have attempted to do,\" she said. \"I am still standing.\" \nA moment later, Sanders endorsed Clinton's stance. \n\"Let me say something that may not be great politics,\" he said. \"I think the secretary is right.… The American people are sick and tired of hearing about your damn emails.\" As the two shook hands the audience roared its approval. \nIt was, to be sure, a partisan crowd. An exchange like that will by no means reduce the intensity of Republican dislike for Clinton. Nor will it necessarily win over the relatively small number of voters who remain undecided about her after a generation in the public eye. \nBut for Clinton, winning over those voters is a problem for the future. Her more immediate challenge has been to quiet the worries among Democrats about whether she could respond to attacks without alienating voters. The cheers were partisan, but partisans are the voters Clinton largely needs to impress for the next several months. \nOn the second task, Sanders made drawing contrasts fairly easy. His debate performance probably reinforced an image as a political figure who is not afraid to take positions that lie outside the perceived mainstream. \nIn the short run, that could be good for both candidates. For many viewers, Tuesday night was probably their first sustained exposure to the independent Vermont senator. His repeated calls for political \"revolution\" and suggestions that the U.S. should look to Denmark for answers to social policy problems almost certainly appealed to his followers on the party's left, and they could further fuel his campaign for now. \nBut over the longer run, Sanders needs to expand his support beyond the college-educated white liberals who have flocked to his rallies if he is actually to win the nomination. \nWith the Denmark line, Sanders gave Clinton an easy opening to portray herself as a champion of American capitalism, just one who wants to \"rein in the excesses.\" By maintaining his skepticism about certain gun control measures, he allowed her to depict herself as a stronger opponent of the National Rifle Assn. And by insisting that he would oppose any sort of \"no-fly\" zone over Syria, he allowed her to paint herself as tougher on international issues. \nExcept for a few remarks critical of the criminal justice system and supportive of immigration reform, the debate showed little indication that Sanders has a plan to reach beyond his core base of support to appeal either to minority voters or moderates - the two constituencies Clinton is relying on. \nThe debate also served as a reminder of the relative unity that Democrats have enjoyed through most of President Obama's tenure in office. It's a unity that is particularly striking at a time when the Republican Party struggles, both on the presidential campaign trail and in Congress, to find a way to bridge fundamental divisions. \nThat relative unity affects Clinton's third task -- deterring Biden. The more Democrats agree on issues, the less rationale exists for multiple candidates to compete. A Biden candidacy has to turn, at least in part, on a perception that Clinton is a weak candidate for a general election. \nClinton and her campaign aides have been careful to avoid saying or doing anything to indicate impatience with Biden's on-again, off-again flirtation with entering the race. But they clearly understood that a poor debate on the part of Clinton would dramatically ratchet up the pressure on Biden to go ahead. \nThat didn't happen. Biden's window for entering the race has seemed to be closing in recent days, as Clinton's campaign appeared to stabilize after several bad weeks. Last month, in an interview with a Catholic magazine, Biden said he understood that the time to decide on a presidential bid might run out before he could make up his mind. Tuesday's debate seemed to make that prediction more prescient.", "external_links": [], "published": "2015-10-14T18:16:00.000+03:00", "crawled": "2015-10-14T23:14:07.600+03:00", "highlightTitle": ""}