{"organizations": [], "uuid": "15f9797c0225349500870575d61de4eb367b2cb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "", "site_section": "http://www.rocketnews.com/category/politics/feed/", "section_title": "» Politics", "url": "http://www.rocketnews.com/2015/10/republican-presidential-candidates-talk-smack-after-receiving-hillary-clintons-book/", "country": "US", "title": "Republican Presidential Candidates Talk Smack After Receiving Hillary Clinton’s Book", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "Republican Presidential Candidates Talk Smack After Receiving Hillary Clinton’s Book", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:39:00.000+03:00", "replies_count": 0, "uuid": "15f9797c0225349500870575d61de4eb367b2cb3"}, "author": "Editor - Political News", "url": "http://www.rocketnews.com/2015/10/republican-presidential-candidates-talk-smack-after-receiving-hillary-clintons-book/", "ord_in_thread": 0, "title": "Republican Presidential Candidates Talk Smack After Receiving Hillary Clinton’s Book", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted on October 8, 2015 by Editor - Political News \nHillary Clinton said this week she sent a copy of her book “ Hard Choices ” to many of the Republican presidential candidates — some of whom have shot back at the Democratic candidate with some sarcasm and snark of their own. \nClinton suggested on Monday that her GOP opponents should form a book club and could read about what she accomplished as secretary of state. Her campaign said she sent all 15 of the Republican candidates a copy of the book, except for former Virginia Gov. Jim Gilmore (it did not explain why Gilmore was excluded, except to suggest there didn’t seem to be a point given his low poll numbers). \nIt doesn’t look like there will be a presidential-contender book club anytime soon. \nHere’s how some of the candidates responded: \nRAND PAUL \nThe Kentucky senator decided to have a little fun and do a little fundraising with Clinton’s book. Paul signed it and added an inscription that read, “Hillary, Your refusal to provide security for our mission in Benghazi should forever preclude you from higher office!” Paul put the book up for auction on eBay where bids are up to $7,100. The winner will receive a copy of Paul’s latest book, too. \nSergio Gor, a spokesman for Paul, said that the presidential hopeful is “a big fan of fiction.” \n“Hard Choices is a great example of revisionist history. We encourage everyone to bid and get their own copy now,” Gor said. \nFormer Arkansas Gov. Mike Huckabee used the tome’s title to hit her on Benghazi. \nHe also poked fun at the controversy over Clinton’s emails. \nBEN CARSON \nBen Carson’s campaign told ABC News it received the book — and that skimming it turned out to be enlightening, in one way or another. \n“We were wondering where all of those unsold books were,” Carson spokesman Doug Watts told ABC News. “But after skimming the book we now understand why it didn’t sell. It should have been in the Fiction section.” \nCARLY FIORINA \nCarly Fiorina¹s campaign confirmed that the former Hewlett Packard CEO received the book and jabbed at Clinton and the 600-plus pages. \n“Sending a book isn’t an accomplishment. It’s an activity,” the Fiorina campaign said in an email to ABC News. \nJOHN KASICH \nJohn Kasich’s campaign told ABC News it had received the book from Clinton on Monday. But Rob Nichols, a spokesman for Kasich, the governor of Ohio, told ABC News another envelope bearing the Clinton campaign’s logo arrived at the Ohio governor’s mansion last Wednesday — and that it was addressed to the previous governor, a Democrat. \nIn an image of the envelope Nichols provided to ABC News, Ted Strickland’s name and the address of the governor’s mansion were crossed out, and “RTS” – return to sender – was scrawled in red ink across the unopened mail. \n“We get a lot of junk mail,” Nichols said. “We also got this, so I’m not sure who is in charge of quality control at her end.” \nMARCO RUBIO \nFlorida Senator Marco Rubio addressed receiving Clinton’s book at a campaign stop in New Hampshire. Rubio joked, “Did she send me a book?” Rubio, who has written a book of his own, delivered a message to Clinton, author to author. “I’ll send her mine. Fellow author. My paperback came out yesterday so I’ll send her that.”", "external_links": [], "published": "2015-10-09T01:39:00.000+03:00", "crawled": "2015-10-09T08:00:00.086+03:00", "highlightTitle": ""}