{"organizations": [], "uuid": "000f7a1713c5f8773e0e2b0e41d9cc5ae521e787", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/09/09/Others/Images/2015-09-09/AP_9867003418511441817412.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/how-newark-schools-partially-squandered-a-great-prize/2015/10/20/ffff660c-7743-11e5-a958-d889faf561dc_story.html", "country": "US", "title": "How Newark schools partially squandered Mark Zuckerburg’s $100 million donation", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "How Newark schools partially squandered Mark Zuckerburg’s $100 million donation - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "000f7a1713c5f8773e0e2b0e41d9cc5ae521e787"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/how-newark-schools-partially-squandered-a-great-prize/2015/10/20/ffff660c-7743-11e5-a958-d889faf561dc_story.html", "ord_in_thread": 0, "title": "How Newark schools partially squandered Mark Zuckerburg’s $100 million donation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mark Zuckerberg, right, and Newark, N.J., Mayor Cory Booker in 2010, (Associated Press/Rich Schultz) (Rich Schultz/AP) By Ruth Marcus Columnist October 20 at 8:07 PM Follow @RuthMarcus When Dale Russakoff began writing about Facebook founder Mark Zuckerberg’s $100 million gift to help fix the failing schools in Newark, N.J., she assumed she would end up telling an uplifting story of transformational change.\n“It sounded to me at the time like, well, that’s enough money to do anything,” Russakoff recalled of watching Zuckerberg announce the gift before a whooping “Oprah” audience in 2010, joined by a political odd couple in the form of Newark’s charismatic, reform-minded Democratic mayor at the time, Cory Booker, and New Jersey’s Republican governor, Chris Christie.\nRuth Marcus is a columnist for The Post, specializing in American politics and domestic policy. View Archive Facebook RSS “I didn’t think it was going to be the miracle that they talked about,” Russakoff said, “but I thought that it was going to be noticeable, positive change in education in a city that had been so neglected by history.”\nPlagued by corruption and mismanagement, the schools had been taken over by the state in 1995 — hence the importance of Christie’s involvement. But the system remained a disaster, with fewer than 40 percent of third- through eighth-graders reading or doing math at grade level.\nRussakoff, a former Post reporter, devoted the next several years to real-time reporting about what happened to Zuckerberg’s $100 million and another $100 million in matching funds. The effort she relates in her resulting book, “ The Prize ,” is a far more complex and humbling endeavor than anticipated, a case study in the difficulty of translating good intentions into concrete results.\nAs told by Russakoff, it is a story of well-meaning reformers so convinced of the correctness of their approach, and the urgency of their task, that they failed to do the hard work of winning the support of a wary community, while spending millions on $1,000-a-day consultants.\nIt is a story of politicians, especially then-Mayor Booker, with more ambition than attention span, leaving behind unfinished business — and students lagging years below grade level — as they climb the political ladder.\nIt is a story of the earnest young billionaire whose conviction that the key to fixing schools is paying the best teachers well collided with the reality of seniority protections not only written into teacher contracts but also embedded in state law.\nIt is a story of dedicated teachers like Princess Williams , whose kindergartners began the school year not knowing the difference between the front and back covers of a book, and the difficulty of solving educational problems in the context of such pervasive poverty and neglect.\nIt is, above all, a heart-breaking story of students like Alif Beyah , a seventh-grader reading at a second-grade level, stumbling over simple words yet “promoted year after year despite failing basic subjects.”\nAs they envisioned the enterprise before its launch, Russakoff writes of Booker and Zuckerberg, “their stated goal was not to repair education in Newark but to develop a model for saving it in all of urban America.” Yet “two hundred million dollars and five years later, there was at least as much rancor as reform.”\nThat glum assessment notwithstanding, there is a more optimistic way to interpret the Newark experience, much of which has to do with the success of the city’s fast-growing charter schools. Charters, which received about $60 million of the philanthropy, now serve 30 percent of the district’s students, and families are clamoring to enroll their children.\nThe reasons are obvious. Unencumbered by bureaucracy and legacy labor costs, charters can devote far more resources to students, providing the kind of wraparound services that students like Beyah need.\nAn analysis by Advocates for Children of New Jersey noted “a substantial and persistent achievement gap” between students at charter and traditional public schools: “For example, while 71 percent of charter school students in Newark passed third-grade language arts tests in 2013-14 — higher than the state average of 66 percent — only 41 percent of students in Newark traditional public schools passed those tests.”\nAs for the district schools forced — or incentivized — to compete with charters, those involved with the Newark effort point to green shoots of change. Graduation rates are up. More higher- rated teachers are staying than lower- performing ones. Still, on state tests of third- to eighth-graders, math and reading proficiency went down in all six grades between 2011 and 2014.\nRussakoff offers instruction in the daunting complexity of education reform — but also insight into the at least partial promise of charters. Because five years, it turns out, is not a long time in the quest to fix a failing system. It is a long time in the life of a child who is being failed.\nRead more from Ruth Marcus’s archive , follow her on Twitter or subscribe to her updates on Facebook .\nRead more:\nSarah Carr: When good intentions fall short in fixing schools\nPatrick Welsh: Four decades of failed school reform\nRichard Whitmire: The next phase of D.C. education reform\nDouglas N. Harris: How everyone is getting it wrong on New Orleans school reform", "external_links": ["http://www.nj.com/essex/index.ssf/2015/10/baraka_calls_potential_expansion_of_newark_charter.html", "https://twitter.com/@RuthMarcus", "http://www.philly.com/philly/blogs/thinktank/How-Zuckerbergs-school-reform-for-NJ-went-awry.html", "http://www.amazon.com/exec/obidos/ASIN/0547840055", "http://www.npr.org/2015/09/21/442183080/assessing-the-100-million-upheaval-of-newarks-public-schools", "http://www.oprah.com/oprahshow/Mark-Zuckerbergs-Big-Announcement-Video", "http://www.wnyc.org/story/how-booker-christie-spent-facebook-money-schools/", "https://twitter.com/RuthMarcus", "https://www.facebook.com/ruthmarcus", "http://www.facebook.com/ruthmarcus", "http://acnj.org/downloads/2015_03_10_newark_kids_count.pdf"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T03:57:58.587+03:00", "highlightTitle": ""}