{"organizations": [], "uuid": "3ef83b2524c4afe93e1c568b66f063cddccb822f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20151016&t=2&i=1087581911&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9F0WW", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "http://www.reuters.com/article/2015/10/17/us-usa-election-benghazi-idUSKCN0SA2D120151017?feedType=RSS&feedName=politicsNews", "country": "US", "title": "U.S. House Benghazi panel grills Clinton aide for six hours", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "U.S. House Benghazi panel grills Clinton aide for six hours", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T03:59:00.000+03:00", "replies_count": 0, "uuid": "3ef83b2524c4afe93e1c568b66f063cddccb822f"}, "author": "", "url": "http://www.reuters.com/article/2015/10/17/us-usa-election-benghazi-idUSKCN0SA2D120151017?feedType=RSS&feedName=politicsNews", "ord_in_thread": 0, "title": "U.S. House Benghazi panel grills Clinton aide for six hours", "locations": ["U.S.", "WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Susan Cornwell"], "text": "WASHINGTON | By Susan Cornwell \nWASHINGTON Turmoil swirled again around the Republican-controlled Benghazi committee on Friday as it questioned a senior aide to Hillary Clinton, prompting fresh accusations that the panel was created to damage the Democratic front-runner's presidential campaign. \nIn a six-hour closed door interview, members and staff sought answers from Huma Abedin, for years a close confidante of Clinton. Abedin has served as the former secretary of state's assistant at the time of the 2012 attacks on U.S. diplomatic facilities in Benghazi, Libya that killed four Americans. \nDemocratic Representative and panel member Elijah Cummings told reporters that summoning Abedin raised more questions about whether the panel is \"a taxpayer funded effort to derail the candidacy of Hillary Clinton.\" \nCummings said Abedin, now campaign vice chairwoman of Clinton's 2016 presidential campaign, had no responsibilities related to the tragedy the committee was set up to investigate. \nAbedin said little about the interview. But she read a handwritten statement afterward, saying she \"answered all of their questions to the best of my ability.\" \n\"I came here today to be as helpful as I could be to the committee. I wanted to honor the service of those lost and injured in the Benghazi attacks,\" Abedin said, adding she was \"honored\" to work for Clinton at State and \"proud\" of her service there. \nRepresentative Lynn Westmoreland, a Republican panel member, said Abedin frequently answered questions with responses of \"'I don't remember' and 'I don't recollect.'\" \nHe did not reveal the questions that prompted such answers. \nRepresentative Trey Gowdy, the panel's Republican chairman, said Abedin's testimony would assist the committee in writing a final report. \nThough not in attendance, Gowdy said in a statement that the panel \"greatly appreciates her willingness to take the time to voluntarily appear before the committee.\" \nAbedin's appearance came less than a week before Clinton is to appear before the panel. \nOrganized originally to probe the 2012 attack on U.S. facilities in Benghazi, Libya, the committee has been under attack by Democrats, who say it is a partisan investigation unleashed by the Republican-majority House. \nThe committee has come under especially harsh criticism since Representative Kevin McCarthy, the No. 2 House Republican, suggested in a recent television interview that the probe had helped to drive down Clinton's presidential poll ratings. \nCummings said Friday that the panel's calling in Abedin was more evidence that McCarthy had been telling the truth about the committee's real aims. Huma Abedin (C), longtime aide to U.S. Democratic presidential candidate Hillary Clinton, enters the room to meet with the House Select Committee on Benghazi in the U.S. Capitol in Washington October 16, 2015. Reuters/Kevin Lamarque 1 of 3 right Huma Abedin, aide to Hillary Clinton, arrives to meet with the House Select Committee on Benghazi in the U.S. Capitol in Washington October 16, 2015. Reuters/Kevin Lamarque 2 of 3 right House Select Committee on Benghazi ranking member Elijah Cummings (D-MD) speaks outside the room where Huma Abedin, longtime aide to U.S. Democratic presidential candidate Hillary Clinton, was meeting with the committee in the U.S. Capitol in Washington October 16, 2015. Reuters/Kevin Lamarque", "external_links": [], "published": "2015-10-17T03:59:00.000+03:00", "crawled": "2015-10-17T04:44:09.211+03:00", "highlightTitle": ""}