{"organizations": [], "uuid": "81539a2aa1c1fab34480f3234a4f359d1abf7f85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30295849/50-turn-out-for-first-ever-business-association-hackathon", "country": "US", "title": "50 Turn out for First-Ever Business Association Hackathon", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "50 Turn out for First-Ever Business Association Hackathon - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "81539a2aa1c1fab34480f3234a4f359d1abf7f85"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30295849/50-turn-out-for-first-ever-business-association-hackathon", "ord_in_thread": 0, "title": "50 Turn out for First-Ever Business Association Hackathon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " U.S. Chamber of Commerce\nFree Enterprise Hackathon Winners Create Economic Impact Web App Map\nWASHINGTON , Oct. 19, 2015 /PRNewswire-USNewswire/ -- Team Growth Economic Trends Map (GETMap) won the U.S. Chamber of Commerce's Free Enterprise Hackathon , the first-ever hackathon hosted by a business association. The Chamber organized the 36-hour-long event at its Washington, D.C. headquarters to encourage the creation of a web application or tool that could be integrated into FreeEnterprise.com , its flagship web magazine, showing the positive effect that businesses have across the U.S.\n\"Even though the Chamber turned 103 this year, we are still working to find ways to innovate and incorporate input from entrepreneurs and the technology industry into our communications tools,\" said U.S. Chamber Senior Vice President of Communications and Strategy Tom Collamore . \"Free Enterprise is alive and thriving in the U.S., and we were thrilled to work with talented developers, designers, and data scientists to help tell the story of American business owners who are creating jobs and encouraging growth.\"\nAfter working overnight, team GETMap received a monetary prize, as well as the opportunity to accelerate their winning prototype with the FreeEnterprise.com team. The program will include desk space at D.C.-based global incubator and seed fund 1776 , and additional networking opportunities.\nSelected from among eight teams, GETMap won for their web application that helps visualize the economic impact of small and medium business on their states by providing a simple state economic impact score based on a number of categories of data.\n\"This was an incredibly hard decision to make since all of the teams showcased great creativity and innovation in their presentations,\" said Margaret Shepard , editor-in-chief of FreeEnterprise.com and one of the judges for the competition. \"Ultimately, team GETMap's tool won for its unique scoring functionality and intuitive design.\"\nA hackathon is a social coding event that brings computer programmers and other interested people together to improve upon or build something new. Click here to learn more about why the Chamber hosted the Free Enterprise Hackathon. If you want read about how hackathons are changing the research and development landscape, check out this post on FreeEnterprise.com .\nFreeEnterprise.com features the faces of American businesses and all that they do to inspire, innovate, and create opportunities. Brought to you by the U.S. Chamber of Commerce, our stories show the power of free enterprise in action, highlighting the successes and challenges that face our nation's business community.\nThe U.S. Chamber of Commerce is the world's largest business federation representing the interests of more than 3 million businesses of all sizes, sectors, and regions, as well as state and local chambers and industry associations.\nwww.uschamber.com\n@USChamber\nwww.freeenterprise.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/50-turn-out-for-first-ever-business-association-hackathon-300162002.html\n ", "external_links": ["https://www.freeenterprise.com/the-2015-hackathon/", "http://www.xmlnews.org/ns/", "http://www.1776.vc/", "https://www.freeenterprise.com/how-hackathons-are-flipping-rd-on-its-head/", "http://freeenterprise.com/", "https://www.freeenterprise.com/why-were-hosting-a-hackathon/", "http://twitter.com/#!/uschamber", "http://www.freeenterprise.com/", "http://www.uschamber.com/", "http://www.prnewswire.com/news-releases/50-turn-out-for-first-ever-business-association-hackathon-300162002.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC31998&Transmission_Id=201510191252PR_NEWS_USPR_____DC31998&DateId=20151019"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T22:19:51.921+03:00", "highlightTitle": ""}