{"organizations": [], "uuid": "2fdd6687c10637a19f13c5ff5b289597703d9a5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30333822/what-doctors-may-be-keeping-from-you-blue-spectrum-light-can-still-damage-your-eyes-even-with-anti-blue-spectrum-screen-covers", "country": "US", "title": "What Doctors May Be Keeping from You! Blue-Spectrum Light Can Still Damage Your Eyes, Even with Anti-Blue-Spectrum Screen Covers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "What Doctors May Be Keeping from You! Blue-Spectrum Light Can Still Damage Your Eyes, Even with Anti-Blue-Spectrum Screen Covers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "2fdd6687c10637a19f13c5ff5b289597703d9a5d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30333822/what-doctors-may-be-keeping-from-you-blue-spectrum-light-can-still-damage-your-eyes-even-with-anti-blue-spectrum-screen-covers", "ord_in_thread": 0, "title": "What Doctors May Be Keeping from You! Blue-Spectrum Light Can Still Damage Your Eyes, Even with Anti-Blue-Spectrum Screen Covers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hualee Tech\nQINGDAO, China , Oct. 23, 2015 /PRNewswire/ -- These days, with so much exposure to the blue-spectrum light emitted from computers, cell phones, and LCD-TVs, you may feel as if you are surrounded by blue-spectrum light all day long. In fact, in order to protect the eyes of both you and your family, you may even start to search for some type of protection, such as anti-blue-spectrum glasses or screen covers. Unfortunately, however, these devices usually do not solve this problem, and eventually, your children may end up with myopia while the quality of your sleep will likely remain unimproved.\nPhoto - http://photos.prnewswire.com/prnh/20151022/279737\nPhoto - http://photos.prnewswire.com/prnh/20151022/279738\nIf you went to see an ophthalmologist with such problems, the doctor would likely conclude that you are suffering from eye strain. You may even start to wonder if anti-blue-spectrum screen covers are really effective at cutting blue light out of your life.\nIn 2011, a report entitled \"The Influence of Blue Light on Photoreceptors in a Live Retinal Explant System\" was published in the European Journal of Neuroscience , and it raised the issue of using filter lenses and screen covers for full protection. Most people, however, are probably unaware that blue light is present in the visible light that is radiated from the LED screens of smart phones. Basically speaking, the blue spectrum is a shortwave ranging from 430 to 470nm. In most cases, high saturations of red, blue, and green are essential for the colors on a screen. If the blue-light spectrum is cut out entirely, it will lead to a chromatic aberration. What's more, the experience of looking at the screen will be greatly diminished.\nTherefore, in order to reduce the harm that can be done to the eyes, the skin, and the nerves, this shortwave blue spectrum needs to be cut off effectively. Hualee Technology Co., Ltd., manufactures innovative optical films, and its parent company, Efun Technology Co., Ltd., is one of the top manufacturers of optical films, such as Collism, which is used in LCD back-light modules. Hualee Tech has mastered the art of optical production. What's more, it has taken maximum advantage of its own product development, R & D, and production lines to produce authentic anti-blue-spectrum screen covers. Over the past few decades, Hualee has worked hard not only to develop patented screen covers but also to gain SGS certification. Hualee's Blue Spectrum Filter actually does cut out UV-Tmax, the shortwave blue-light in high energy, and this is something that has been verified by tests and analysis conducted on professional spectrum equipment.\nBased on the basic optical principles that yellow light can easily cover blue-spectrum light, Hualee Tech has developed the Blue Spectrum Filter, which not only protects the eyes but also preserves true colors. To explain, a 99 percent reduction rating filters out one of the three primary colors, but Hualee has developed a solution that delivers health benefits and real world colors to its screen cover, which has a 30 to 40 percent reduction rating, instead of the \"real\" reduction.\nHualee Tech has developed anti-blue spectrum screen covers in order to provide people with better protection, and its patented covers deliver some of the best eye protection available today. Hualee Tech is expanding through a network of dealers and is currently looking for international partners. For detailed information, please take a look at: https://www.youtube.com/watch?v=M9AsDeVMRZI , or visit its website at: www.efun.com.cn\nMedia Contact:\nGeorge Hu\n886-919563599\n releases/what-doctors-may-be-keeping-from-you-blue-spectrum-light-can-still-damage-your-eyes-even-with-anti-blue-spectrum-screen-covers-300165267.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH36303&Transmission_Id=201510230840PR_NEWS_USPR_____PH36303&DateId=20151023", "http://www.prnewswire.com/news-releases/what-doctors-may-be-keeping-from-you-blue-spectrum-light-can-still-damage-your-eyes-even-with-anti-blue-spectrum-screen-covers-300165267.html", "http://photos.prnewswire.com/prnh/20151022/279738", "http://www.youtube.com/watch?v=M9AsDeVMRZI", "http://photos.prnewswire.com/prnh/20151022/279737", "http://www.efun.com.cn/"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T16:57:58.172+03:00", "highlightTitle": ""}