{"organizations": [], "uuid": "f6be1fc058ca4e112be016c31894c2d09daeaae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/GHMC_12_0_0_1_0_0_0_0_0_0_2_0_1_0_0_0_0_0_0_0_0_0_0_0_0_0_1_0.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151021/nation-current-affairs/article/taxpayers%E2%80%99-money-likely-go-down-ghmc-drains", "country": "US", "title": "Taxpayers’ money likely to go down GHMC drains | Deccan Chronicle", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Taxpayers’ money likely to go down GHMC drains | Deccan Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:59:00.000+03:00", "replies_count": 0, "uuid": "f6be1fc058ca4e112be016c31894c2d09daeaae4"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151021/nation-current-affairs/article/taxpayers%E2%80%99-money-likely-go-down-ghmc-drains", "ord_in_thread": 0, "title": "Taxpayers’ money likely to go down GHMC drains | Deccan Chronicle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | Coreena Suares | October 21, 2015, 02.58 am Representational image Hyderabad : Another few crores of taxpayers’ money will go down the drain if the Greater Hyderabad drainage system has not put in proper shape before taking up the proposed road works in a comprehensive manner. As per an RTI report, as high as Rs 2,298.33 crore, Rs 608.11 crore for road repairs plus Rs 1,690.22 crore for road development, was spent during 2009-2015. In spite of that, the roads remain in a worse condition. Similarly, Rs 675.44 crore was spent on drainage and sewerage works in the Greater Hyderabad area, leaving out the Old Municipal Corporation of Hyderabad area or the merged municipalities. Despite this, the drains overflow to the roads. For this purpose, previous governments had conducted a survey and prepared a plan, which is not being talked about anymore. A drainage and sewage system is a pre-requisite, before taking up the 1,400-km road development work. Sambi Reddy, who sent a query to HMWS&SB on the drainage system in Hyderabad said, “Previous governments conducted a survey and prepared a plan. As part of this scheme, with the funds available under JNNURM, drainage and sewerage works were taken up in the South Musi area, along with Serilingampally and Rajendra Nagar. In the remaining areas, due to paucity of funds, and more importantly due to the negligence attitude of the governments, roads constructed with crores of public funds are largely damaged. “In another query addressed to HMWS&SB, the Water and Sewerage Board disclosed that over Rs 1,240 crore was needed for the merged municipalities and Rs 2,008 crore for Outer Greater Hyderabad area for a proper drainage and sewerage system.” The sewerage network in all the 12 merged municipalities are still under the control of the GHMC, while 3,500 km in the core city is handled by the HMWS&SB. It is mainly in the 12 merged municipalities that the sewerage network needs major overhaul. The suburbs either have zero or incomplete network. In most households, especially in Rajendar Nagar, Serilingampally and Attapur, sewers are either linked to stormwater drains or are let out into water bodies. While stormwater drains are supposed to be dry except during the rains, the flow in these drains is perennial, indicating illegal links with sewers. The poor sewerage system has led to water stagnation, mosquito-breeding and increased pollution in Musi river. The continuing battle for taking over sewer maintenance is another reason for lack of urgency in taking up any work. K. Ansari, a resident of Golden Heights in Rajender Nagar circle added, “Colonies are ready to even install pipelines themselves if the municipality provides 70 per cent funds. Not just the sewerage system, but treatment plants and even the prospect of recycling water are lacking. The Sewerage Board currently has the capacity to treat just about 50 per cent of the sewage outflow with its three Sewage Treatment Plants.” States: Telangana nation Current affairs Telangana GHMC Also Read MU students stage protest to remove vice-chancellor First foreign visit: Sushma Swaraj arrives in Bangladesh for 2-day visit Vyapam scam: All cases to be probed by CBI, says Supreme Court Panel has no legal sanctity: Mohd Ali Shabbir", "external_links": ["http://platform.twitter.com/widgets.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151021/nation-current-affairs/article/taxpayers’-money-likely-go-down-ghmc-drains", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/GHMC_12_0_0_1_0_0_0_0_0_0_2_0_1_0_0_0_0_0_0_0_0_0_0_0_0_0_1_0.jpg", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/GHMC_12_0_0_1_0_0_0_0_0_0_2_0_1_0_0_0_0_0_0_0_0_0_0_0_0_0_1_0.jpg", "http://vuukle.com/js/vuukle.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share"], "published": "2015-10-22T03:59:00.000+03:00", "crawled": "2015-10-21T17:36:51.696+03:00", "highlightTitle": ""}