{"organizations": [], "uuid": "d71b232ec0b418549e55b7fc771b0ac2e38f654e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/22/51d4ba23-d5be-44d5-b172-cc37403eecf1/thumbnail/620x350/c2d44a81eeed73ca5b7b732c33e2caf8/donald-trump-speech-promo-getty-491877616.jpg", "site_section": "http://www.cbsnews.com/feeds/rss/the_skinny.rss", "section_title": "Politics - CBSNews.com", "url": "http://www.cbsnews.com/news/trump-hits-bush-fundraising-woes-mommy-and-daddy-help/", "country": "US", "title": "Trump hits Bush over fundraising woes, \"mommy and daddy\" help", "performance_score": 1, "site": "cbsnews.com", "participants_count": 0, "title_full": "Trump hits Bush over fundraising woes, \"mommy and daddy\" help", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:24:00.000+03:00", "replies_count": 0, "uuid": "d71b232ec0b418549e55b7fc771b0ac2e38f654e"}, "author": "", "url": "http://www.cbsnews.com/news/trump-hits-bush-fundraising-woes-mommy-and-daddy-help/", "ord_in_thread": 0, "title": "Trump hits Bush over fundraising woes, \"mommy and daddy\" help", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Reena Flores", "Bush"], "text": "By Reena Flores CBS News October 24, 2015, 2:53 PM Trump hits Bush over fundraising woes, \"mommy and daddy\" help \nRepublican presidential candidate Donald Trump speaks during a campaign rally at the Treasure Island Hotel & Casino on October 8, 2015 in Las Vegas, Nevada. Isaac Brekken/Getty Images More + \nDonald Trump attacked Republican presidential rival Jeb Bush on the Florida Republican's home turf on Saturday, a day after the former governor announced he was restructuring his campaign and slashing staff salaries. \n\"Bush now has gotta cut back,\" Trump said at a campaign rally in Jacksonville, Florida. \"Here's a guy who wants to run our country. And he can't even run his own campaign. And you know what? He's cutting back big.\" \nThe billionaire diagnosed Bush's campaign as \"failing\" and supplied with \"no money.\" His White House bid, Trump said to wild applause, was \"losing badly and embarrassing his family.\" Jeb Bush is questioning Donald Trump's 'judgement to be president' after Trump implied that George Bush's policies in office made America vulnera... \nWhile Trump's claims may be exaggerated -- Bush isn't in the red just yet, with third quarter fundraising totals showing his campaign with $10.3 million cash on hand -- the former Florida governor is struggling with finances. \nA Bush campaign memo obtained by CBS News showed \"aggressive changes\" to his campaign structure, including reducing payroll costs by 40 percent and downsizing the operation's Miami headquarters. \nCBS News also reported Friday that Bush is expected to attend a finance meeting over the weekend in Texas, called together by former President George H. W. Bush. Brother George W, Bush will also be in attendance, along with his mother, Barbara Bush. \nThe Bush family is becoming increasingly involved with the former Florida governor's campaign for the White House. On Oct. 29, George W. Bush, who has stayed out of the spotlight since leaving the Oval Office, will also headline a fundraiser for his brother in Washington, D.C.'s affluent Georgetown neighborhood. \nIn Florida, Trump lambasted Bush's pivot towards family support, mocking Bush for \"meeting today with mommy and daddy.\" \n\"They're working on the campaign,\" Trump jeered. \"They're working!\" \nHe contrasted Bush's failures to manage his campaign with his own success and lean operating costs. \n\"I put up less money than anybody else, and I'm number one,\" Trump said. \"Other people have spent $25, 30 [million]. I think they reported the other day I put up $2 million. I could trade that to one of these other candidates.\" \nTrump supporters at the Jacksonville rally have taken the real estate mogul's business acumen as a sign that he's more than capable of jumpstarting the American economy. \n\"I believe Mr. Trump's the man that can find that waste and can put it to good use,\" Larry Koonce, a 67-year-old retiree from Georgia, told CBS News. \"We have a tremendous amount of debt in this country. Congressional Budget Office has put the numbers out. $24 trillion in debt. It's pretty much the point of no return. We don't have long to go.\" \nCBS News' Sopan Deb contributed to this report. © 2015 CBS Interactive Inc. All Rights Reserved. Shares", "external_links": [], "published": "2015-10-25T01:24:00.000+03:00", "crawled": "2015-10-24T22:19:37.673+03:00", "highlightTitle": ""}