{"organizations": [], "uuid": "04a8dc08d8b1ab365bf77562d4a5f298dcb01d24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/d0/81e6e6189675239ce360a06db0664b/media:40f682b90d3449b4a4a269c7f51dd8f7FederalReserve.JPEG", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/business/articles/2015/10/26/no-fed-rate-hike-likely-yet-as-it-monitors-global-pressures", "country": "US", "title": "No Fed rate hike likely yet as it monitors global pressures", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "No Fed rate hike likely yet as it monitors global pressures - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "04a8dc08d8b1ab365bf77562d4a5f298dcb01d24"}, "author": "USNews", "url": "http://www.usnews.com/news/business/articles/2015/10/26/no-fed-rate-hike-likely-yet-as-it-monitors-global-pressures", "ord_in_thread": 0, "title": "No Fed rate hike likely yet as it monitors global pressures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARTIN CRUTSINGER, AP Economics Writer\nWASHINGTON (AP) — Not long ago, it seemed a sure bet: The Federal Reserve would raise interest rates by year's end. Fed Chair Janet Yellen herself said she expected it.\nNow, doubts are rising that the Fed will start raising rates before next year from the record lows where they've stood since 2008. When its policymakers meet this week, the likelihood of a rate hike is widely seen as close to zero.\nWhat's changed?\nMainly, a global economic slowdown, led by China, that's inflicted wide-ranging consequences: U.S. job growth has flagged. Wages and inflation are subpar. Consumer spending is sluggish. Home sales have flattened. Investors are nervous. And manufacturing is being hurt by a stronger dollar, which has made U.S. goods pricier overseas.\n\"The data has gotten weaker, and the Fed is farther away from achieving its target on inflation,\" said Diane Swonk, chief economist at Mesirow Financial in Chicago. \"The greatest risk at the moment is the slowdown in China and other emerging markets and what impact that will have on the U.S. economy.\"\nThough analysts say a rate hike at the central bank's next meeting in December is still possible, two key Fed officials have called even that prospect into question.\nFor months, policymakers had sounded generally confident that the economy was improving consistently, despite a global economic slowdown, and soon would no longer need the support of ultra-low rates. The Fed had cut its benchmark rate to near zero during the Great Recession to encourage borrowing and spending. Hiring had since risen sharply, consumers were spending and the housing market was steadily recovering.\nWhen 2015 began, midyear seemed a likely time for the first rate hike in nearly a decade. But after a harsh winter slowed growth, the consensus view shifted to September.\nThen in August, China announced a surprise devaluation of its currency that rocked markets and escalated fears that the world's second-largest economy was weaker than thought and could derail growth in the United States. Uncertainty was too high, Fed officials decided, for a rate hike in September.\nSince then, the outlook has dimmed further with a hiring slowdown, tepid retail sales and factory output and a pause in the housing recovery.\nInflation might be the biggest obstacle. The Fed has essentially achieved one of its mandates — to maximize employment — as the unemployment rate has reached a seven-year low of 5.1 percent. But it's much further from its other mandate — to stabilize prices. Its inflation target is 2 percent; anything less could signal economic weakness. Yet a price gauge the Fed tracks has stayed below 2 percent for three years and has recently slowed further, reflecting cheaper energy and a stronger dollar, which depresses import prices.\nThe Fed has said it will start raising rates once it's \"reasonably confident\" inflation will return to 2 percent within two to three years. Yellen has said that confidence should be boosted by a stronger job market, which will help raise workers' pay.\nBut this month, two Fed board members — Lael Brainard and Daniel Tarullo — questioned the link between falling unemployment and higher inflation. Both expressed doubts about whether the timing would be right for a rate hike this year.\nIn addition, this week's Fed's meeting occurs just as other major central banks — from Europe to China and Japan — are pursuing their own low-rate policies. Against that backdrop, a Fed rate hike would boost the dollar's value and thereby squeeze U.S. exporters of farm products and factory goods by making them costlier overseas.\nThose concerns, of course, must be balanced against other officials who favor rate increases. Jeffrey Lacker, president of the Fed's regional bank in Richmond, dissented at last month's meeting because the Fed chose not to raise rates. And in speeches, other officials have expressed a desire to begin raising rates soon.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T18:33:45.607+02:00", "highlightTitle": ""}