{"organizations": ["PKK", "Washington Post"], "uuid": "313bc5063c127b019751ff125f89b6a77219d4d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailysabah.com", "main_image": "http://i.tmgrup.com.tr/dailysabah/2015/10/06/HaberDetay/1444163693726.jpg", "site_section": "http://dailysabah.com//rss/politics", "section_title": "Daily Sabah - Politics", "url": "http://www.dailysabah.com/diplomacy/2015/10/07/the-washington-post-promotes-pkk-agenda-turkeys-ambassador-to-washington-says", "country": "", "title": "The Washington Post promotes PKK agenda, Turkey's Ambassador to Washington says", "performance_score": 0, "site": "dailysabah.com", "participants_count": 0, "title_full": "The Washington Post promotes PKK agenda, Turkey's Ambassador to Washington says", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T21:35:00.000+03:00", "replies_count": 0, "uuid": "313bc5063c127b019751ff125f89b6a77219d4d5"}, "author": "", "url": "http://www.dailysabah.com/diplomacy/2015/10/07/the-washington-post-promotes-pkk-agenda-turkeys-ambassador-to-washington-says", "ord_in_thread": 0, "title": "The Washington Post promotes PKK agenda, Turkey's Ambassador to Washington says", "locations": ["Washington", "Turkey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ADD A MESSAGE YOUR E-MAIL This August 6, 2013 file photo shows a sign outside of the Washington Post Building in Washington, DC (AFP Photo) \nTurkey's Ambassador to Washington said Tuesday that portraying operations against the PKK as a way to garner votes ahead of elections next month \"echoes the terrorist organization's propaganda\". Serdar Kılıç's comments came in response to an October 1 editorial in the Washington Post that accused Turkey's President Recep Tayyip Erdoğan of \"destabilizing the nation in his quest for more power,\" referring to the resumption of operations against PKK in July. It also claimed that the Turkish military broke a two-year cease-fire with the terror group after Turkey agreed to take part in U.S.-led coalition airstrikes against ISIS. \"The continued acts of terrorism by the PKK, even during the peace process, lie at the heart of Turkey's recent actions to defend its citizens and public order,\" Kılıç said. \"To portray these as an ill-conceived attempt of the government to win the upcoming elections distorts the facts and echoes the terrorist organization's propaganda.\" The governing Justice and Development Party (AK Party) under Erdoğan launched a democratic reconciliation process in 2009, including a peaceful solution to the Kurdish issue to end PKK terrorism. Since then, casualties from the conflict between the PKK and Turkish armed forces have been minimized and the government lifted bans on the Kurdish language as well as allowed the intelligence service to talk to the terrorist group's leader, Abdullah Öcalan, who is imprisoned on İmralı Island on the Marmara Sea. Kılıç said in his letter to the Post that it was PKK that declared an end to the peace process in July after it claimed responsibility for killing two Turkish police officers in the southeastern province of Adıyaman. As of September 29, according to the Turkish government, the terror group has martyred 130 members of the Turkish police, gendarmerie and military, and 43 civilians have been killed while 536 security personnel and 288 civilians wounded in less than three months. Turkish security forces have killed more than 2,000 PKK members in operations inside Turkey since operations began July 22, according to the Turkish interior ministry. \"No responsible government could be expected to refrain from taking action while its law enforcement personnel and civilians are being murdered by a terrorist organization that is designated as such by the international community, including the United States and European Union,\" Kılıç said. As the Turkish parties could not form a coalition government following the June elections in which the AK Party lost its majority in Parliament to establish a single party government, Erdoğan ruled for new elections November 1. In addition to the political impasse, Turkey has been grappling with several other problems including the fight against ISIS, the continuing refugee influx and PKK terrorism. Turkey agreed to join the U.S.-led coalition airstrikes against ISIS in late July and allowed American jets to fly from the İncirlik Air base in the southern province of Adana by early August. At the very same time PKK intensified its attacks in eastern and southeastern cities and towns. The Turkish government has intensified its counterterror operations following the recent attacks carried out by the PKK, which is recognized as a terrorist organization by the U.S., the EU and Turkey. Formed in 1978, the terrorist group has been fighting the Turkish government for an independent state until the early 2000's. The group then shifted its goal to autonomy in predominately Kurdish inhabited regions of Turkey.", "external_links": [], "published": "2015-10-06T21:35:00.000+03:00", "crawled": "2015-10-07T00:52:47.527+03:00", "highlightTitle": ""}