{"organizations": [], "uuid": "6986576b598294b6f8c1fe8ab80ed6086334cd61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/a3/d4/bb5be44b4d7aaf4f6fb5b5ff9c9e/151002-mitch-mcconnell-harry-reid-gty-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/budget-congress-mitch-mcconnell-harry-reid-214376", "country": "US", "title": "Budget talks: The Harry and Mitch show", "performance_score": 1, "site": "politico.com", "participants_count": 1, "title_full": "Budget talks: The Harry and Mitch show - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:10:00.000+03:00", "replies_count": 0, "uuid": "6986576b598294b6f8c1fe8ab80ed6086334cd61"}, "author": "Burgess Everett", "url": "http://www.politico.com/story/2015/10/budget-congress-mitch-mcconnell-harry-reid-214376", "ord_in_thread": 0, "title": "Budget talks: The Harry and Mitch show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Delicate negotiations to avoid a budget disaster this fall stumbled out of the gate as two long-time adversaries — Mitch McConnell and Harry Reid — are once again butting heads. Reid and House Minority Nancy Pelosi thought they had an agreement with Republicans that a private conversation between GOP leaders and President Barack Obama about the budget would not be publicly disclosed – an effort to protect the early talks from political attacks.\nBut on Tuesday, with a little prompting from a reporter, Senate Majority Leader McConnell divulged that he’d been talking to the president along with House Speaker John Boehner (R-Ohio). The Kentucky Republican conveniently didn’t mention Senate Minority Leader Reid or Pelosi, who will both ultimately be integral to the talks despite McConnell’s attempt to publicly freeze them out.\nJust like that, the fall’s high-stakes budget talks are off to a rough start.\nIn the aftermath, senior staffers in Reid and McConnell’s office pointed fingers at each other and an air of mistrust poured into a Capitol already riven by a chaotic leadership election in the House and bitter partisanship in the Senate.\nReid, asked about the comments by the majority leader, raised his hands to his head and shook his head incredulously for nearly 10 seconds.\n“Didn’t matter to me,” Reid said. “Not factual.”\nBut the incident certainly didn’t help the early budget deliberations, which began in earnest last week when GOP and Democratic staffers huddled at the White House to begin negotiations after Congress passed a 10-week stopgap spending bill. With Boehner’s sudden resignation leaving a power vacuum at the top of the House, and lingering questions about Obama’s ability to sway Hill votes, a final deal will likely hinge on whether Reid and McConnell can put the past few months of parliamentary warfare behind them to keep the government funded for the next two years.\n“That’s going to be a tall order,” said Sen. Jeff Flake (R-Ariz.) when asked if McConnell and Reid can come together.\n“I would say it’s still a challenging relationship,” Senate Majority Whip John Cornyn (R-Texas), McConnell’s top deputy, said of the two leaders. Reid is “a tough guy and he plays hardball.”\nAfter McConnell’s comments, which Congress’s Democratic minority viewed as an attempt to cut Democrats out of the talks, top aides rushed to emphasize the obvious: No deal can be made without Reid and Pelosi’s assent, given that Republicans don’t hold enough Senate seats to muscle a budget deal through, and House GOP leaders haven’t been able to pass major spending deals without Democratic help. And, they added, Reid and Pelosi were fully aware of the GOP’s talks with the president.\nThere are incentives for both parties to avoid budget brinkmanship during a presidential election. Plus, continuing resolutions are considered bad governance by many senior lawmakers, given that they keep old spending laws in place and don’t allow Congress to adjust priorities. Influential Democrats and Republicans have already said they won’t vote for yet another fiscal punt in December.\nBut senators in both parties expressed some concern that the early elbow throwing could stymie a broad budget agreement between the two Senate leaders.\nThe relationship is “about where it’s been for a long time: It has its moments of productivity, and a long history of differences over some fundamental issues and how to run the Senate,” said Senate Minority Whip Dick Durbin, Reid’s No. 2.\n“Well, let’s just say it’s not as good as it could be,” added Sen. Lamar Alexander (R-Tenn.), a close McConnell ally who’s occasionally deployed as a back-channel negotiator when Reid and McConnell hit a wall.\nSources close to the leaders privately said their relationship has always been tense and seems to be getting worse as Reid digs in for a confrontational final 15 months in the Senate and McConnell seeks to steady the Senate ahead of a brutal battle to control the chamber 2016.\nNeither is known for being chummy, and beyond brief private talks on the floor preceding their often bitterly partisan speeches there’s little day to day contact between the two, according to interviews with more than a dozen senators and aides in both parties that know both men well.\nThat’s not entirely unusual for Senate leaders, who often communicate through staff for the Senate’s daily business, and it suits each man’s personality.\n“It’s not as if we call each other to see how we’re doing during the day,” Reid said in an interview. “We’re both non-talkers, so we talk enough.”\nTheir working relationship on the floor has been in a deep freeze for years. In a typical exchange last Thursday, McConnell trotted a familiar attack on Democrats for voting down a spending bill on the floor that they supported in committee. Reid responded by saying that it was hard to listen to McConnell because he’s talking about something that’s “not real.”\n“They give the same speech every morning. Always about how bad the other is,” lamented one Republican senator. Asked how much of that is for show, the senator replied: “All of it … they’ll both cut a deal.”\nBoth leaders consider themselves pragmatists at heart. But Reid and McConnell are warily eyeing each other following the budget scuffle this week. After the Sept. 17 call with the GOP leaders and Obama, Reid and Pelosi went to the White House to meet with the president, who assured them no one was being cut out.\nObama’s pledge to the Democrats was prompted by McConnell’s private indication that he would prefer to exclude Reid and Pelosi from the budget negotiations – an account relayed by Democratic sources that McConnell aides declined to dispute.\nSenior Republicans noted that Democrats weren’t on the call, so could have little insight into what was discussed, but Democrats said the White House has kept them fully briefed of the president’s interactions with the GOP leaders. The president held a subsequent call with the GOP leaders in late September that’s remained under wraps.\nSo far, there’s been no budget meeting including Obama, Pelosi, Reid, Boehner and McConnell all in the same room.\nMcConnell, a dispassionate tactician who’s been able to strike key fiscal deals with Vice President Joe Biden, sees the White House as more of an honest broker than Reid in a major negotiation like a two-year budget blueprint.\nTo McConnell loyalists, working with Reid just invites drama. They view him as someone who fights his battles in the press and with over-the-top insults, a turnoff for the taciturn and calculating GOP leader.\n“I’m sure that with fewer people you have in the room, the more serious the negotiations and discussion, and in a quicker way,” said South Dakota Sen. John Thune, the third-ranking Senate Republican.\nBut Reid backers say McConnell is afraid of being schooled by Reid at the negotiating table.\n“It’s not just about mistrust,” said one source close to Reid. “Democrats do worse when Reid is not there.”\n“The White House is a more reliable negotiating partner,” shot back a source close to McConnell.\nAlready, some red lines are being drawn: McConnell will demand that any bump-ups to existing spending caps be offset with savings elsewhere. He won’t accept tax hikes to pay for them, although other revenue-raisers such as fee increases could be an option.\nAnd then he has to see what the House and its new speaker will be able to accept given the deeply divided and sharply conservative House Republican conference.\n“The question is what he’s promised these 40 off-the-deep end guys. That’s the $64,000 question,” said Sen. Chuck Schumer (D-N.Y.) of expected new speaker Kevin McCarthy. “It’s hard to see how things get better with Boehner leaving.”\nDemocrats, for their part, are demanding domestic spending increases, which some hawkish Republicans are willing to accept in exchange for more money for the Pentagon that was slashed under a 2011 deficit-reduction deal. But many fiscal conservatives in the Capitol are happy with the lower budget caps for both domestic and defense – spending limits from the Budget Control Act that McConnell has regularly touted with pride as one of his big achievements.\nStill, many senators are already sounding this refrain: No more stopgap continuing resolutions.\nSenate Armed Services Committee Chairman John McCain (R-Ariz.) said he has “voted for my last CR,” angrily adding: “I will not stand by and watch our military be destroyed.” Durbin said he wouldn’t support another continuing resolution either: That would be a “disaster.”\nMcConnell’s allies say Reid is largely to blame for the frosty relationship, noting that the minority leader has blockaded key measures such as annual appropriations bills. Republicans were guilty of similar tactics in the minority.\nDemocrats have said their confrontational procedural posture is meant to push Republicans to negotiate on a broader budget deal that boosts both domestic and defense spending sooner rather than later. But that strategy has frustrated Republicans, who’ve instead forced Democrats to vote on the same bills over and over – to no avail. It took a government shutdown threat last week to get everyone at the table.\nThe Senate GOP leadership says it has occasional success in maneuvering around Reid by finding other Democratic partners, such as Sen. Barbara Boxer (D-Calif.) on a highway bill and Sen. Patty Murray (D-Wash.) on trade policy.\nBut when Reid gets all his members on board, “We’ve been stuck,” Cornyn said.\n<div", "external_links": [], "published": "2015-10-05T13:10:00.000+03:00", "crawled": "2015-10-05T13:08:05.989+03:00", "highlightTitle": ""}