{"organizations": [], "uuid": "bf8a811de4460005b76d7a2bf78ae808b23b4baf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-d9dd702dd5ea0126173e36ca0dcdb922.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/paul-blasts-rubio-were-lucky-he-wasnt-president-during-the-cold-war/article/2574408?custom_click=rss", "country": "US", "title": "Paul blasts Rubio: 'We're lucky he wasn't president during the Cold War'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Paul blasts Rubio: 'We're lucky he wasn't president during the Cold War' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:30:00.000+03:00", "replies_count": 0, "uuid": "bf8a811de4460005b76d7a2bf78ae808b23b4baf"}, "author": "Gabby Morrongiello", "url": "http://www.washingtonexaminer.com/paul-blasts-rubio-were-lucky-he-wasnt-president-during-the-cold-war/article/2574408?custom_click=rss", "ord_in_thread": 0, "title": "Paul blasts Rubio: 'We're lucky he wasn't president during the Cold War'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In his response Monday to Marco Rubio's support for the use of force against Russian aircraft in Syria, Kentucky Sen. Rand Paul said Americans are \"really lucky\" his Republican rival wasn't president during the Cold War.\nThe libertarian-leaning presidential hopeful, who splits from most of the GOP field on foreign policy, told CNBC that a no-fly zone in Syria and military conflict with Russian forces is a \"terrible idea\" and antithetical to former President Ronald Reagan's \"peace through strength\" doctrine.\n\"We are really lucky [Rubio] was never president during the Cold War,\" Paul told CNBC's John Harwood. \"[Reagan] avoided a Cold War by, one, not setting red lines like that, continuing to have open communication with the Russians, having a strong enough defense to repel attack and to worry the Russians.\"\nHe continued, \"This is where the Rubios and the McCains of this world need to re-examine history. When you look at what happened in Iraq, we spent a trillion dollars, we toppled Saddam Hussein. Who is their number one ally now? Iran. Who is Iran and Iraq allied with? Russia. Who gave Russia permission to fly over them to bring the equipment in? Iraq.\"\n  Texas cuts funding to Planned Parenthood Texas is the latest state to try to strip federal and state dollars from the women's health provider.\nBy Paige Winfield Cunningham • 10/19/15 1:06 PM Rubio, who's been credited with accurately predicting Russian airstrikes in Syria weeks in advance, said in early October the U.S. cannot stand by and say, \"Well, if [Russian President Vladimir] Putin is going to test us, then we can't do anything.\"\n\"I don't believe [Putin] will look for a direct military conflict against the U.S. in order to go into a safe zone,\" the Florida senator told Harwood during a separate interview with CNBC.\nPaul, however, blasted Rubio's proposal to establish a no-fly zone in Syria, calling it a \"recipe for confrontation\" with Russia.\n\"People will say, 'Well, we've got to choose sides,'\" Paul told Harwood.\n\"Why?\" he added \"[Syrian President Bashar] Assad's a bad person and so is ISIS, but we shouldn't be involved in the civil war over there.\"\nAlso from the Washington Examiner U.S. troops ram gate to bombed-out Kunduz hospital A U.S. military team thought the hospital was unoccupied, however, there were personnel inside.\nBy Jacqueline Klimas • 10/19/15 1:04 PM Rubio and Paul are third and tenth in the Washington Examiner's presidential power rankings. According to the latest RealClearPolitics polling average, the Kentucky senator trails his hawkish opponent by more than 7 percentage points among GOP voters nationwide.\nTop Story Is the GOP really still a party?  \nBy W. James Antle III • 10/19/15 12:01 AM", "external_links": [], "published": "2015-10-19T14:30:00.000+03:00", "crawled": "2015-10-19T20:41:41.031+03:00", "highlightTitle": ""}