{"organizations": [], "uuid": "4b64ad56ccd6913f7f05cb9ac30f248ac972075c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/tpphotos/photo/2015/10/01/18880824-large.jpg", "site_section": "http://www.nola.com/elections/index.ssf/2015/05/", "section_title": "Louisiana Politics, Elections and State Legislature News - NOLA.com ", "url": "http://www.nola.com/politics/index.ssf/2015/10/2016_gubernatorial_debate_wdsu.html", "country": "US", "title": "Gubernatorial candidates go on the attack at social issues-oriented WDSU debate", "performance_score": 0, "site": "nola.com", "participants_count": 3, "title_full": "Gubernatorial candidates go on the attack at social issues-oriented WDSU debate | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:46:00.000+03:00", "replies_count": 2, "uuid": "a31faef9fe1081f3c70b4ff0afe8e00857d02a89"}, "author": "Kevin Litten, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/politics/index.ssf/2015/10/2016_gubernatorial_debate_wdsu.html#post-0", "ord_in_thread": 0, "title": "Gubernatorial candidates go on the attack at social issues-oriented WDSU debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The four major gubernatorial candidates found much to agree on in a social issue-dominated debate held Thursday (Oct. 1) but wasted no time attacking each other in the first televised debate featuring U.S. Sen. David Vitter.\nEach candidate came armed with attacks at the ready -- Public Service Commissioner Scott Angelle even had a few that rhymed -- as moderator Scott Walker oversaw an hourlong format that allowed candidates to challenge each other on their answers. The debate aired at 6 p.m. on WDSU-TV and also featured candidates Jeremy Odom, an independent, and Cary Deaton, a Democrat.\nMany of the attacks lobbed by the Republican Angelle, Democratic state Rep. John Bel Edwards and Republican Lt. Gov. Jay Dardenne were aimed at Vitter. But it was Vitter who was the first to come out swinging as he sought to attack Dardenne's legislative voting record on abortion, after each candidate said they agreed with efforts to defund Planned Parenthood.\nNext, Vitter went after Edwards for voting for President Barack Obama, marking the first time he has openly attacked the Democratic candidate in a major forum. Vitter has mostly been content to go after Dardenne and Angelle in television ads -- often painting them as liberals -- in an effort to keep the two out of a runoff race after the primary.\n\"John Bel Edwards actively supported Barack Obama, voting for him twice — not just in the hope and change election in 2008 — but when he clearly should've known better in 2012,\" Vitter said.\nEdwards responded by saying that while he did vote for Obama, he is \"not a single issue voter\" and votes his \"conscience on an array of issues.\" He put an exclamation point on his response by saying he had never voted for Vitter.\nDardenne used his response to the question of whether he would defund Planned Parenthood to say he would, but he also used his time to accuse Vitter of being \"desperate\" in his attacks. Dardenne said Vitter has consistently mischaracterized his positions, defending six votes in the Senate that abortion opponents have attacked him over as stem cell bills that didn't involve abortion.\nThe candidates also spent time discussing the issue of medical marijuana and the legalization of recreational marijuana. All said they'd oppose the legalization of recreational marijuana, and Dardenne, Angelle and Edwards said they supported the legislature's recent passage of bills setting up a framework for medical marijuana.\nVitter, however, said he opposed the legalization of both recreational and medical marijuana, saying he has it on \"good authority\" that the Federal Drug Administration \"may be approving pills nationally for people with serious and real medical conditions.\"\n\"It's far more prudent than passing this sort of legislation,\" Vitter said.\nAsked whether they had smoked marijuana in the past, and only Odom raised his hand to admit using the drug recreationally.\nFor all the discussion of social issues -- including religious freedom, which all four candidates said they supported -- they touched on the state budget and higher education only briefly. Those two issues have dominated several other forums, and all four candidates have said they'd call a special session early next year to sort out a structural deficit that topped $1.6 billion this year.\nEdwards used the opportunity to talk about the state budget to promote his support for expanding Medicaid, which he said would've saved the state $52 million. Gov. Bobby Jindal has declined to expand Medicaid coverage for thousands of Louisianians because it is a major element of the Affordable Care Act, which he opposes.\nVitter described the state's fiscal situation as a \"crisis,\" adding, \"we should be acting now,\" and not wait for a special session. He also touted a \"concrete plan\" he's been promoting throughout his campaign, holding up a copy of the plan as a prop and urging viewers to visit his website to read it. It was a tactic he used at least three times during the debate.\nDardenne, however, used his time discussing the budget to jab Vitter, saying, \"we shouldn't legalize marijuana just like we shouldn't legalize prostitution\" to raise revenue. Although Dardenne did not mention Vitter by name, he was clearly seeking to draw attention to Vitter being linked to a Washington, D.C., escort service in which he admitted to a \"very serious sin.\"\nThe area where the candidates perhaps sought to differentiate themselves the most was on Common Core, the controversial federal education standards that Louisiana began implementing until Gov. Bobby Jindal changed his position in the face of a conservative backlash. Vitter, like Jindal, had expressed support for Common Core but later changed his position.\nAngelle used Vitter's change in position as an opportunity to portray the senator as a flip-flopper, saying, \"I don't know where he's going to be tomorrow.\" He also sought to attack Vitter over his tawdry past, saying, \"he's been wrong on fornication\" and \"he's been wrong on education.\"\nVitter responded to Angelle's attack by accusing Angelle of carrying water for Jindal in the legislature, saying that it was Angelle who \"was the quarterback going to the legislature\" to shepherd Common Core bills to passage. He described his decision to change his position on Common Core by saying, \"I was always focused on vigorous standards. But I listened to parents, I listened to teachers, and I did a lot of that traveling the state.\"\nDardenne, who has voiced support for Common Core in the past, said he supports the \"middle ground\" the legislature reached this spring over how to set standards for education reform in Louisiana. Edwards, who serves on the House education committee and whose wife is a teacher, has been a longtime opponent of Common Core,\" saying \"Common Core does not have a monopoly on rigorous standards.\"\n. . . . . . Kevin Litten is a state politics reporter based in Baton Rouge. Reach him at klitten@nola.com or 225-436-2207. Follow him on Twitter ( @kevinlitten ).", "external_links": ["https://twitter.com/kevinlitten"], "published": "2015-10-02T03:46:00.000+03:00", "crawled": "2015-10-02T06:26:58.421+03:00", "highlightTitle": ""}