{"organizations": [], "uuid": "c26ba469f189bcad70cd17f336026f0a823d72cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/13/us/13congweb/13congweb-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Washington.xml", "section_title": "NYT > Politics", "url": "http://www.nytimes.com/2015/10/13/us/politics/latest-unease-on-right-ryan-is-too-far-left.html?partner=rss&emc=rss", "country": "US", "title": "Latest Unease on Right: Ryan Is Too Far Left", "performance_score": 10, "site": "nytimes.com", "participants_count": 1, "title_full": "Latest Unease on Right: Ryan Is Too Far Left", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:43:00.000+03:00", "replies_count": 0, "uuid": "c26ba469f189bcad70cd17f336026f0a823d72cb"}, "author": "JENNIFER STEINHAUER", "url": "http://www.nytimes.com/2015/10/13/us/politics/latest-unease-on-right-ryan-is-too-far-left.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "Latest Unease on Right: Ryan Is Too Far Left", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Graphic: The Power of the Hard-Line Republicans in the Race for House Speaker “Tryouts for speaker continue,” Phyllis Schlafly, founder and chairwoman of the conservative Eagle Forum, said in a statement Friday, when Mr. Ryan was escaping Capitol Hill for the week. “The kingmakers are so desperate for someone to carry their liberal priorities that they are trying to force Congressman Paul Ryan into a job he does not want.” The influence of conservative websites has enraged members who were once considered right of center themselves, and who are desperately trying to keep Mr. Ryan from getting spooked. “Anyone who attacks Paul Ryan as being insufficiently conservative is either woefully misinformed or maliciously destructive,” said Representative Tom Cole, Republican of Oklahoma. “Paul Ryan has played a major role in advancing the conservative cause and creating the Republican House majority. His critics are not true conservatives. They are radical populists who neither understand nor accept the institutions, procedures and traditions that are the basis of constitutional governance.” \nAdvertisement Continue reading the main story To some degree, the attacks on Mr. Ryan, so far an unwilling draft pick by his colleagues to replace Speaker John A. Boehner , reflect criticism of flashes of pragmatism by Mr. Ryan, the architect of his party’s conservative budget dogma. Since the 2012 general election defeat, Mr. Ryan has indeed become more of a consensus builder and leader in the House, even as he has maintained his ideological tilt. He has largely voted for bills to keep the government operating and the debts paid when many other Republicans vote against them these days. He was half the brain on a 2013 compromise with Senator Patty Murray, Democrat of Washington, to funnel more money to the government and avert two years of budget brinkmanship, even though two years earlier, he had refused to sit on the original committee that tried and failed to find a solution to the government’s financial problems. \nAdvertisement Continue reading the main story Mr. Ryan moved this year to the chairmanship of the tax-writing Ways and Means Committee from the Budget Committee because he said he wanted even greater influence on national fiscal policy, and his prescriptions are anathema to most Democrats. But the current flak following Mr. Ryan stems from a growing and powerful collection of far-right pundits and news media — from Mark Levin to Laura Ingraham to the sites RedState and Breitbart and the new Conservative Review — that have successfully wielded influence over Republican voters and lawmakers in strongly conservative districts. Their bill of particulars against Mr. Ryan have shifted from the national debt and spending to immigration. Lately, they have focused on Mr. Ryan’s enthusiastic support for free trade, traditionally a policy that has gotten broad Republican support but is now being used as a bat against him. Beyond Mr. Ryan, the conservative targets have seemingly shifted from old time establishment lawmakers to a process seemingly more akin to random selection.", "external_links": [], "published": "2015-10-13T03:43:00.000+03:00", "crawled": "2015-10-13T03:52:29.227+03:00", "highlightTitle": ""}