{"organizations": [], "uuid": "8dbf43746bfaa9381cabe0822abfa381371acdd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Dada_Pele_PTI_0.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151012/sports-football/article/when-king-football-meets-prince-kolkata", "country": "US", "title": "IN PICS| When King of Football meets Prince of Kolkata", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "IN PICS| When King of Football meets Prince of Kolkata", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T09:37:00.000+03:00", "replies_count": 0, "uuid": "8dbf43746bfaa9381cabe0822abfa381371acdd6"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151012/sports-football/article/when-king-football-meets-prince-kolkata", "ord_in_thread": 0, "title": "IN PICS| When King of Football meets Prince of Kolkata", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 12, 2015, 17.55 pm Co-owner of Indian Super League (ISL) team Atletico de Kolkata Sourav Ganguly asked about the importance of infrastructure and Pele said, \"No doubt about that. It's easy to say that but if you don't give the base in school or club level how they would grow.\" (Photo: PTI) Kolkata: The legendary Pele on Monday offered a solution to bring Indian football out of its current abyss, saying that the game should be made an integral part of growing up for kids here besides ensuring maximum foreign exposure for promising players.\nBrazil football legend Pele, Atletico de Kolkata's co-owners Sourav Ganguly and Sanjiv Goenka share a candid moment during an event in the city.\nAt a media interaction moderated by former Indian cricket captain and Indian Super League (ISL) side Atletico de Kolkata's co-owner Sourav Ganguly, Pele offered his advice to develop the sport languishing in India.\nWithout delving into the nitty-gritties, the three-time World Cup winner said, \"Most important to grow is to start a base. To get the players who are promising and start working on them.\nAtletico de Kolkata presented Pele their team jersey during the event.\n\"The important thing is to send the players abroad for training. Today with the facility of communication, you can send your players abroad. Sometimes, you have young and good players at home but without any international experience. It's important to give exposure to the players,\" he said.\nGanguly asked about the importance of infrastructure and Pele said, \"No doubt about that. It's easy to say that but if you don't give the base in school or club level how they would grow.\"\nCricket may not be known that well back in his country but Pele seemed quite familiar with Ganguly. Asked if he is the king of football, as is widely said, who is the 'prince', Pele replied: \"In sport, we have a Prince (Ganguly) next to us.\"\nThe King of football had an advice for defending ISL champions Atletico de Kolkata who're known for their attacking game.\nAt a media interaction, the team's co-owner Harsh Neotia asked him what is his advice would be for the Kolkata franchise and the three-time World Cup winner replied: \"Always respect your opponents and to the people, you may be the best but you can always learn something.\"\n\"Football is the biggest family in the world and only in football you see this kind of love,\" Pele, who is known around the world for his humility, said in his message during his tour to India where he would spend three days in Kolkata before flying to Delhi for the Subroto Cup final.\n\"I always played with a good heart. One more time I say thank you very much. I love you.\"\nCo-owners Ganguly, Sanjiv Goenka, Utsav Parekh and Neotia presented the 74-year-old an autographed jersey and an overwhelmed Pele said: \"Thank you very much for this reception. I thank all of you from my heart and accept my thanks from all my fellow Brazilians.\"\nPele has returned to the city 38 years after he had enthralled the crowd with New York Cosmos in a 2-2 draw against Mohun Bagan in an exhibition match at Eden Gardens.\n\"I see a new generation here. I thank God because I've received this kind of love because of the God's grace,\" he said.\nPele will be the guest of honour at ATK's first home match on Tuesday against Kerala Blasters FC and in the morning the team will host the Brazilian over a lunch.\nGanguly regretted that they would not be able to watch Pele in action. \"Hope we could see a bit of action but age catches up with everyone. It's a sporting mad city be it cricket or football. It will not change. I am sure you have fond memories of the reception 38 years ago,\" Ganguly told Pele.\n\"I could not see you live in action. I've seen you only in videos but it's an unbelievable sight to watch your skills on the field. Cricket has not gone into Brazil but I've been through the life of a sportsman. To see so much of appeal, speak volumes of your achievement. For all of us, it's the respect that matters and will live forever.\nWhen I was young, I saw a movie about Pele and now I'm getting to see the giant close. It's so special. I've been an avid football fan and watched him play,\" Ganguly added. (Photos: PTI)\nGoenka said, \"This is a historic visit. All of us welcome the living legend individually.\"\nRemembering the 1977 visit, Neotia said he had seen him with his father whose travel agency was associated with tour. \"My father was so excited to see him and I realised how great a player he was,\" he said.\nFor Parekh it was like a dream come true to sit next to Pele. \"I see my dream coming into reality. I always dreamt of meeting you and today I'm sitting next to you. My dream is more than realised.\"\n football Pele Indian Super League Atletico de Kolkata Sourav Ganguly New York Cosmos Mohun Bagan Also Read ‘Thank you Kolkata,’ says Pele after his 38-year return to ‘City of Joy’ Steamed hilsa, prawns cooked in coconut milk among other finest Bengali dishes await Pele Have no intention to contest for the post of FIFA president: Pele", "external_links": ["http://www.apexchange.com/Content/preview/2015/20151012/11/98f83679e0279b2d840f6a706700e297.jpg", "http://platform.twitter.com/widgets.js", "http://www.apexchange.com/Content/preview/2015/20151012/10/9c59d4e8dfd39a2d840f6a706700e3fc.jpg", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://twitter.com/share?url=http://www.deccanchronicle.com/151012/sports-football/article/when-king-football-meets-prince-kolkata", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif", "http://www.apexchange.com/Content/preview/2015/20151012/10/438691d9dfe79a2d840f6a7067006e0d.jpg", "http://www.apexchange.com/Content/preview/2015/20151012/10/53006320dfe89a2d840f6a706700e3ab.jpg", "https://apis.google.com/js/plusone.js", "http://www.apexchange.com/Content/preview/2015/20151012/10/7048b84adfd39a2d840f6a706700b48e.jpg", "http://vuukle.com/js/vuukle.js", "http://www.apexchange.com/Content/preview/2015/20151012/10/08c9e3e6dfe89a2d840f6a70670033bf.jpg", "http://www.apexchange.com/Content/preview/2015/20151012/10/176f3395dfe89a2d840f6a7067007dbb.jpg", "http://www.apexchange.com/Content/preview/2015/20151012/11/88389adfe0289b2d840f6a7067009cfe.jpg", "http://www.apexchange.com/Content/preview/2015/20151012/10/50e2aeefdfd59a2d840f6a70670034aa.jpg", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Dada_Pele_PTI_0.jpg", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Dada_Pele_PTI_0.jpg"], "published": "2015-10-13T09:37:00.000+03:00", "crawled": "2015-10-12T23:11:19.031+03:00", "highlightTitle": ""}