{"organizations": [], "uuid": "139c92fdcaf2fe47e841cbf1da35c64a260fbc94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30351168/new-yorks-bayview-prison-to-be-redeveloped-into-the-womens-building", "country": "US", "title": "New York's Bayview Prison To Be Redeveloped Into The Women's Building", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New York's Bayview Prison To Be Redeveloped Into The Women's Building - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "139c92fdcaf2fe47e841cbf1da35c64a260fbc94"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30351168/new-yorks-bayview-prison-to-be-redeveloped-into-the-womens-building", "ord_in_thread": 0, "title": "New York's Bayview Prison To Be Redeveloped Into The Women's Building", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " NoVo Foundation\nNoVo Foundation, In Collaboration With Goren Group, To Transform Former Women's Prison Into Home For Women's Rights Movement\nNEW YORK , Oct. 26, 2015 /PRNewswire-USNewswire/ -- Empire State Development today awarded NoVo Foundation, in collaboration with Goren Group, rights to restore and redevelop the former Bayview Correctional Facility, located at 550 West 20th Street, New York , into The Women's Building. The medium-security women's prison will be reclaimed by girls' and women's rights groups working to create a world free from violence, poverty, and injustice. The Women's Building will serve as a hub for the women's movement, service providers, and the community.\n\"The Women's Building will demonstrate what's possible when the potential of girls and women is nurtured rather than locked away. A physical home for the women's rights movement, in a city that already serves as a global hub for advocates, activists, community leaders, service providers, and policymakers, could be a model for the world,\" said Jennifer Buffett , co-president of NoVo Foundation. \"The metamorphosis will create a place where organizations advocating for the rights of girls and women can pool resources, share ideas, and strengthen connections with one another.\"\nNoVo Foundation plans to turn the former women's prison into a space where organizations helping women and girls have the support and resources they need, including gallery space for public meetings, and organizational support services for women's rights groups. It has entered into a long-term lease for the space, paying an initial base rent of $3.5 million per year.\n\"We hear time and time again from women's organizations that they are struggling to keep the lights on, to connect with peer organizations, and to maintain their services for communities,\" said Pamela Shifman , executive director of NoVo Foundation. \"A building with shared resources will go a long way toward enabling these organizations to work together to make change in New York City and beyond. We hope the building can be a living model of the values we hold dear: collaboration and partnership, equality and fairness.\"\nAi-jen Poo, director of the National Domestic Workers Alliance, added, \"The Women's Building will ensure the sustainability and longevity of the housed organizations and, subsequently, the very broad networks and deep communities they support. These organizations will contribute to a living model of collective values and make groundbreaking work possible.\"\nGoren Group, a woman-owned and operated real estate development and investment company, will be developing the property on behalf of NoVo Foundation. The building was originally designed in 1931 as a YMCA for merchant sailors and is characterized by its distinctive masonry work, terra cotta detailing, and nautical references. Goren Group will work closely with New York's State Historic Preservation Office to preserve and restore historical elements of the building.\nLela Goren , founder and president of Goren Group, articulated, \"The vision for this building is unique in its global purview, values, mission, and operations. Housing what we refer to as 'The Women's Building' in a former women's correctional facility will make a profound statement about where New York State has come from and what it and its citizens aspire to achieve. Women's rights organizations have practical needs and inspirational needs, and this adaptive re-use project will provide all of that for them. This historic rehabilitation will shape the next chapter of this building's history.\"\nGloria Steinem, author and feminist activist, is one of the project's many supporters. \"I've known personally since the mid-1970s – and I heard even earlier – about the need and hope for a women's building in New York City ,\" said Steinem. \"Now, there is even more need because of high rent and operating costs here, and more hope because we've seen how much such buildings benefit other cities. New York has the greatest need because it receives so many women leaders from other states, other countries, other continents, yet they have no central place to visit – this building will unite them.\"\nNoVo Foundation and Goren Group plan to start development activities as soon as possible and are committed to using union labor throughout the redevelopment process.\n\"This vision goes beyond sharing resources and physical proximity to other groups,\" said Peter Buffett , co-president of NoVo Foundation. \"NoVo Foundation acts from the original meaning of philanthropy: the love of humanity. We seek to create conditions where mutual respect, collaboration, and civic participation inevitably arise. Transforming the former Bayview Correctional Facility to a home for those creating justice and equality will do just that. We believe it will bring so much good to our city and our world.\"\nwomensbuildingnyc.org\n#WomensBldg\nABOUT NOVO FOUNDATION\nThe NoVo Foundation is dedicated to building a more just and balanced world. Founded in 2006 by Jennifer and Peter Buffett , NoVo has become one of the largest private foundations in the world to support initiatives focused explicitly on girls and women. It also works to advance social and emotional learning and promote local living economies. Across all of its work, the NoVo Foundation supports the development of capacities in people-individually and collectively-to help create a world based on mutual respect, collaboration,\nand love.\nnovofoundation.org\nABOUT GOREN GROUP\nGoren Group is a registered WBE woman-owned and operated real estate development and investment company devoted to making buildings that create change and foster community. Founded in 2007 by Lela Goren , Goren Group develops complex, significant and historic buildings with entrepreneurial finesse and an unwavering commitment to social engagement.\nthegorengroup.com\n releases/new-yorks-bayview-prison-to-be-redeveloped-into-the-womens-building-300165656.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/new-yorks-bayview-prison-to-be-redeveloped-into-the-womens-building-300165656.html", "http://novofoundation.org/", "http://www.xmlnews.org/ns/", "http://www.womensbuildingnyc.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC37338&Transmission_Id=201510261330PR_NEWS_USPR_____DC37338&DateId=20151026", "http://thegorengroup.com/"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T20:53:33.471+02:00", "highlightTitle": ""}