{"organizations": [], "uuid": "abb78f3afa250fcd884f298ccfb5e7711e505743", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/tpphotos/photo/2015/10/10/18940998-large.jpg", "site_section": "http://www.nola.com/politics/index.ssf/2015/10/", "section_title": "October, 2015 Monthly News Archives | Louisiana Politics &amp; Government - NOLA.com", "url": "http://www.nola.com/politics/index.ssf/2015/10/turkey_bomb_attacks_leave_30_k.html", "country": "US", "title": "Turkey bomb attacks' tally rises to 86 dead, 186 injured", "performance_score": 0, "site": "nola.com", "participants_count": 7, "title_full": "Turkey bomb attacks' tally rises to 86 dead, 186 injured | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T15:01:00.000+03:00", "replies_count": 8, "uuid": "fc33fc7f2238a3943e928678ebdb82e06d9a9474"}, "author": "The Associated Press", "url": "http://www.nola.com/politics/index.ssf/2015/10/turkey_bomb_attacks_leave_30_k.html#post-0", "ord_in_thread": 0, "title": "Turkey bomb attacks' tally rises to 86 dead, 186 injured", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANKARA, Turkey — Two bomb explosions on Saturday targeting a peace rally by leftist and Kurdish activists in Turkey's capital Ankara killed at least 86 people and injured 186 others, Turkish authorities said.\nThe explosions occurred minutes apart outside Ankara's main train station as hundreds of people were gathering for the rally, organized by the country's public sector workers' trade union and other civic society groups. The rally aimed to call for increased democracy and an end to the renewed violence between Kurdish rebels and Turkish security forces.\nHealth Minister Mehmet Muezinoglu said 62 people died at the scene while 24 others died after being taken to the hospital. He said another 186 people were injured in the attacks.\nAuthorities said they were investigating whether the attacks — which hit some 50 meters (yards) apart from each other — were suicide bombings. There was no immediate responsibility claim.\nThe attacks came at a tense time for the NATO-member country, which will hold a general election on Nov. 1.\nAuthorities had been on alert after Turkey agreed to take a more active role in the U.S.-led battle against the Islamic State group, opening up its bases to U.S. aircraft to launch air raids on the group in Syria, while carrying out a limited number of strikes on the group itself.\nTurkish jets have also carried out numerous airstrikes on Kurdish rebel targets in northern Iraq. Some 150 police and soldiers and hundreds of rebels of the Kurdistan Workers' Party, or PKK, have been killed since July when the conflict flared anew.\nAn Associated Press photographer at the scene Saturday reported seeing several bodies covered with bloodied flags and banners that demonstrators had brought with them for the rally. Police later cordoned off the area.\nTelevision footage from Turkey's Dogan news agency showed a line of protesters fanned out on the street near the train station, chanting and performing a traditional dance with their hands locked, when a large explosion hit behind them.\nThe video also showed several people later lying injured on the streets or being taken into ambulances. Scuffles broke out between police and people frantically searching for loved ones or complaining about poor police response.\nSmall anti-government protests broke out at the scene of the explosions and outside of hospitals as Interior Minister Selami Altinok visited.\nPresident Recep Tayyip Erdogan condemned the attacks, which he said targeted the country's unity and peace, and called for solidarity.\n\"The greatest and most meaningful response to this attack is the solidarity and determination we will show against it,\" Erdogan said.\nCritics have accused Erdogan of re-igniting the fighting with the Kurds for electoral gains in the hope that the turmoil would rally nationalist votes around the ruling Justice and Development Party, or AKP. Electoral gains by the country's pro-Kurdish party caused the party, founded by Erdogan, to lose its parliamentary majority in an election in June, following a decade of single-party rule. Erdogan denies the accusation.\nPrime Minister Ahmet Davutoglu held an emergency security meeting to discuss the attack. His office said he was suspending his election campaign programs for the next three days.\nIt was the third attack targeting meetings of Kurdish activists. In July, a suicide bombing blamed on the Islamic State group killed 33 peace activists, including many Kurds, in the town of Suruc near Turkey's border with Syria. Two people were killed in June in a bomb attack at a pro-Kurdish party's election rally.\n\"This attack resembles and is a continuation of the Diyarbakir and Suruc (attacks),\" said Selahattin Demirtas, leader of the Turkey's pro-Kurdish party. \"We are faced with a huge massacre.\"\nThe attack came amid reports that the PKK was preparing to announce a unilateral cease-fire that would last until the Nov. 1 election. The government has however dismissed the possible cease-fire plans, saying the rebels must lay down their arms and leave the Turkish territory.\nBusloads of activists had travelled to Ankara from other cities to attend the rally.\n\"There was a massacre in the middle of Ankara,\" said Lami Ozgen, head of the Confederation of Public Sector Trade Unions, or KESK.\nThis story was updated to reflect the latest official figures on the number of victims.", "external_links": [], "published": "2015-10-10T15:01:00.000+03:00", "crawled": "2015-10-11T15:43:24.829+03:00", "highlightTitle": ""}