{"organizations": [], "uuid": "2e95a4ec65b6af8b694b60538a481a5b2e8ea7aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmur.com", "main_image": "http://www.wmur.com/image/view/-/31174878/highRes/1/-/maxh/630/maxw/1200/-/gsralnz/-/Commitment-2016-generic-graphic-jpg.jpg", "site_section": "http://www.wmur.com/9858824?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.wmur.com/politics/no-labels-problem-solver-convention-attracting-8-candidates/35789710", "country": "US", "title": "No Labels Problem Solvers convention attracting 8 candidates", "performance_score": 0, "site": "wmur.com", "participants_count": 0, "title_full": "No Labels Problem Solvers convention attracting 8 candidates", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T16:26:00.000+03:00", "replies_count": 0, "uuid": "2e95a4ec65b6af8b694b60538a481a5b2e8ea7aa"}, "author": "", "url": "http://www.wmur.com/politics/no-labels-problem-solver-convention-attracting-8-candidates/35789710", "ord_in_thread": 0, "title": "No Labels Problem Solvers convention attracting 8 candidates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No Labels Problem Solvers convention attracting 8 candidates 5 candidates live, 3 via live stream UPDATED 9:26 AM EDT Oct 12, 2015 A Large Text Photos \nAbout 2,000 activists, most from New Hampshire, jammed the Radisson Hotel expo center Monday to hear eight presidential candidates – six of them live – stress the need for bipartisanship in the political debate. Watch live: 8 presidential candidates speak at No Labels... \nEight presidential candidates, including six in person, will speak to an estimated 2,000 political activists in Manchester on Monday at the No Labels’ Problem Solvers Convention. The daylong event, also featuring local and out-of-state elected officials, highlights the coming week on the New Hampshire first-in-the-nation primary campaign trail. \nIf the candidates and other officials speaking are faithful to the goals of the sponsor, NoLabels.org, it would be a radical departure from the highly charged rhetoric Granite Staters have become accustomed to during the presidential campaign. \nFollow the No Labels convention on WMUR.com. \nEight candidates are scheduled to speak to the convention, five of them live and three via livestream. \nThe two co-chairs called it an opportunity to \"speed date\" candidates, from Donald Trump to Bernie Sanders. \nSeveral state officials, including U.S. Sen. Kelly Ayotte and Gov. Maggie Hassan, are speaking to the convention. \nDemocratic former Maryland Gov. Martin O’Malley, the first candidate to speak to the convention, called for Republicans, Democrats and independents to “return to the table and deal with these problems.” \nHe called for governments at the local, state and federal levels to become “performance measured entities.” \nHe also said that he is the only candidate to put forward a comprehensive program to deal with climate change. \n“It’s not about words,” O’Malley said, “It’s about action.” \nFormer U.S. Sen. Joe Lieberman of Connecticut, a 2004 presidential candidate and running mate with Al Gore in 2000, said he was “thrilled” by the number of candidates speaking to the convention. \n\"New Hampshire, you're making history today,\" Lieberman told the group. \n“In New Hampshire, you know that over 40 percent of the voters are undeclared,” he said. “There is a potential her for the candidates to speak to the issues and not just try to appeal to the core bases of their parties,” Lieberman, a No Labels co-chair, said, noting that undeclared voters can participate in either party’s primary. \n“What we’re hoping to hear is not just what these candidates intend to do but how they are going to do it.” \nFormer Utah Gov. Jon Huntsman, a 2012 Republican presidential candidate and No Labels co-chair, said the convention is the first of its kind to hear from candidates and “throw away the sound bites and talk about not just what will happen but how it will happen.” \nPresidential candidates who will address the group throughout the day are, in chronological order: former Maryland Gov. Martin O’Malley (D), U.S. Sen. Lindsey Graham of South Carolina (R), business executive Donald Trump (R), New Jersey Gov. Chris Christie (R), U.S. Sen. Bernie Sanders of Vermont (D), former New York Gov. George Pataki (R), former U.S. Sen. Jim Webb of Virginia (D), and Ohio Gov. John Kasich (R). \nO'Malley, Sanders and Webb are appearing via live stream. \nBoth state political party chairs, spoke to the convention. \nState Democratic Party Chairman Raymond Buckley said, “This is where we take citizen involvement very seriously.” \nNew Hampshire Republican Party Chairwoman Jennifer Horn promoted small government as providing “unlimited opportunity for all.” \nHorn took the occasion to promote Ayotte as a nonpartisan leader. \nHer comments prompted Lieberman to say with a hint of sarcasm: “Thank you for getting us going in a nonpartisan way.”", "external_links": [], "published": "2015-10-12T16:26:00.000+03:00", "crawled": "2015-10-12T16:42:08.406+03:00", "highlightTitle": ""}