{"organizations": [], "uuid": "744de8d20668686321451490d5f5dab4a4091a01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nymag.com", "main_image": "http://pixel.nymag.com/imgs/daily/intelligencer/2015/10/15/15-jacob-degrom.w1200.h630.jpg", "site_section": "http://nymag.com/", "section_title": "NYMag - Politics, Entertainment, Fashion, Restaurants &amp; NY", "url": "http://nymag.com/daily/intelligencer/2015/10/jacob-degrom-can-pitch-himself-into-mets-lore.html", "country": "US", "title": "Jacob deGrom Can Pitch Himself Into Mets Lore", "performance_score": 0, "site": "nymag.com", "participants_count": 1, "title_full": "Jacob deGrom Can Pitch Himself Into Mets Lore -- NYMag", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T00:28:00.000+03:00", "replies_count": 0, "uuid": "744de8d20668686321451490d5f5dab4a4091a01"}, "author": "Joe DeLessio", "url": "http://nymag.com/daily/intelligencer/2015/10/jacob-degrom-can-pitch-himself-into-mets-lore.html", "ord_in_thread": 0, "title": "Jacob deGrom Can Pitch Himself Into Mets Lore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jacob deGrom. Photo: Stephen Dunn/Getty Images\nIn the first postseason of his young career, Jacob deGrom has already outdueled the Dodgers' Clayton Kershaw, a three-time Cy Young winner who was again one of the best pitchers in baseball this year. The 27-year-old deGrom was masterful in Game 1 of the NLDS, throwing seven shutout innings and striking out 13 batters. Tonight deGrom will make his second start of the NLDS in a winner-take-all Game 5 in Los Angeles, and again he’ll be starting against one of baseball’s most talented pitchers, this time in Zack Greinke, who led the league with a 1.66 ERA this season. And if deGrom comes up big again — if he outduels another Cy Young candidate and picks up his second win in a five-game series — he won’t just be pitching his team into the NLCS. He’ll be pitching himself into Mets postseason lore.\nDuring the regular season, deGrom was named an All-Star and led qualified Mets pitchers with a 2.54 ERA, and coming off a 2014 campaign in which he was named Rookie of the Year, he’s established himself as a pillar of the team’s up-and-coming rotation. But if not for Matt Harvey’s much-discussed innings limit — put in place to protect his surgically repaired arm — it’s possible deGrom wouldn’t have gotten the top spot in the Mets’ rotation during these playoffs. But Harvey was slotted for Game 3 so he’d only pitch once in the NLDS, making deGrom the easy choice for the Game 1 start — and the responsibilities that go with it. And since Mets manager Terry Collins opted not to pitch him on short rest in Game 4 (as Dodgers manager Don Mattingly did with Kershaw), deGrom returns to the mound tonight, on an extra day’s rest, in a must-win Game 5.\nCollins has tried to frame tonight’s game in such a way to take the pressure off his club, which could have clinched the series on Tuesday night at Citi Field but got shut down by Kershaw. “This, to me, is gravy,” Collins said yesterday about where the Mets are right now, after an unexpectedly great regular season. And deGrom doesn’t seem too worried about pitching in such a pressure-filled spot. “I try to block everything out once I get on the field,” he said . “Kind of the nerves go away, and it’s the same game we’ve been playing all year.” Indeed, after pitching a plenty important game to start the series, deGrom seemed pretty loose, especially during this delightful moment at the postgame press conference:\nYour browser does not support iframes. Tonight’s pitching matchup, statistically at least, is one of the best in postseason history. According to Elias , the combined ERA of deGrom and Greinke (2.07) is the third lowest in history for starting pitchers in a winner-take-all game. And so for the second time in a week, deGrom gets the ball in the biggest game of his life. He’s already been up to the task once; another gem tonight would make him an instant postseason hero.", "external_links": ["http://nypost.com/2015/10/15/pressure-what-pressure-jacob-degroms-game-5-approach/", "http://espn.go.com/blog/newyork/mets/post/_/id/112072/terry-collins-game-5-gravy-after-successful-season", "https://twitter.com/ESPNStatsInfo/status/654673273989369857", "http://mlb.mlb.com/shared/video/embed/embed.html?content_id=521260183&width=560&height=314&property=mlb"], "published": "2015-10-16T00:28:00.000+03:00", "crawled": "2015-10-15T20:04:57.217+03:00", "highlightTitle": ""}