{"organizations": [], "uuid": "6e33229957cd90a3998a5dbe1dfc1fadfbed035e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jpost.com", "main_image": "http://www.jpost.com/HttpHandlers/ShowImage.ashx?ID=274219", "site_section": "http://www.jpost.com/Israel-News/Politics-And-Diplomacy", "section_title": "Israel politics and world diplomacy | The Jerusalem Post ", "url": "http://www.jpost.com/Opinion/Palestinians-want-hope-not-just-cycles-of-revenge-421527", "country": "IL", "title": "Palestinians want hope, not just cycles of revenge - Opinion", "performance_score": 0, "site": "jpost.com", "participants_count": 2, "title_full": "Palestinians want hope, not just cycles of revenge - Opinion - Jerusalem Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:34:00.000+03:00", "replies_count": 1, "uuid": "c782e3df8054ab301af0672319c29dfa3e42f6d9"}, "author": "HAYAT AL-HAKIM", "url": "http://www.jpost.com/Opinion/Palestinians-want-hope-not-just-cycles-of-revenge-421527#post-0", "ord_in_thread": 0, "title": "Palestinians want hope, not just cycles of revenge - Opinion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " I was born in Hebron in 1993, and have lived there since. It is a very beautiful city with many friendly people, who love and care about each other. It is a great city, where you can find a lot of good industries, such as the shoe and glass industries. The old city of Hebron is also breathtaking.\nWhen you walk in it, you get the feeling that you are attached to everything there. Even though it is under occupation, it is still amazing.\nThe occupation makes Hebron a hard place to live in. We have a lot of restrictions, and we can’t move around freely and do whatever we want. There are a lot of checkpoints in the area, and we are checked by soldiers every time we go through a checkpoint. It is uncomfortable. It feels as if you are in an open prison.\nTo tell you that I am happy would be lying. I’m not happy, and I will never be until the occupation is over. I know that because of the occupation I will always get late to class, because I was stopped at a checkpoint. I will keep seeing mothers crying for having lost their sons to the IDF, and I will keep seeing people losing their houses, and I will keep seeing all other kinds of injustice.\nThe first incident that I remember was when I was seven years old, during the second intifada. I was so young and naïve; I didn’t understand the conflict or what was happening around me. My older brother, who now is 33, was with his friends having fun and didn’t get back home. I saw my parents getting worried about him because the situation really wasn’t safe. They thought that he stayed at his friend’s place. Then at four in the morning someone knocked on the door, and when we opened the door my brother was standing there, bleeding all over.\nHe told us that the soldiers caught him walking home at midnight and beat him until they broke his bones. I just gave him a hug and started crying.\nAnother time, during the most recent war in Gaza, my 17-year-old brother was going home from school, and there were clashes on the road between Palestinian boys and Israeli soldiers. He got shot in the hand with a rubber bullet.\nIn the same summer my other brother – the one who got beaten in 2000 – got beaten again for not having his ID with him. They broke his hands. I don’t know why they keep on beating him – my brother is the most peaceful guy I know! I once followed a group of settlers doing a tour of the old city of Hebron with an Israeli tour guide, a tour that takes place every Saturday for settlers specifically. I didn’t really follow it actually, but I joined EAPPI [Ecumenical Accompaniment Programme in Palestine and Israel], who follows the group from behind – as we are not allowed to walk beside them or in front of them – to try to avoid any clashes between the settlers and Palestinians.\nThe tour guide begins by showing them around and tells them stories about the places they see and visit.\nWhen I joined it once, I walked next to the corner of a building at some point, meaning I couldn’t see what came after the corner. When I passed the corner I was faced with a settler pointing his gun at my forehead.\nThe settler seemed to be in his 30s, very tall, with a beard. I don’t know what he meant with his move, since he didn’t shoot me in the end. He looked very angry, and he didn’t even say sorry or smile to make me feel better. Did he just mean to scare me? I wonder if what stopped him from doing it was because of the police and the soldiers around him.\nI never spoke to a settler, until I began speaking to a settler guy on Facebook one day. At the time he said that he hated Arabs and probably wanted us all dead. After having talked to me for a while, he told me how much he liked me, and that I helped changing his thoughts about Arabs.\nSo he turned from hating Arabs to loving them, and that was because of me, which makes me happy. It makes me feel like Arabs and settlers could actually like each other; we just need to make other people accept it.\nI am a human, and revenge is something inside almost everyone of us.\nWhenever a war happens, someone gets killed, a child gets arrested or people get treated badly by the IDF, it makes me lose hope, and it stops all the good work that I am doing for achieving peace.\nBut sometimes I still would like to make the other side feel how we feel, when their army does such things to us. Perhaps this would me feel like I gained victory? I then think about it again and see how stupid this idea is; I shouldn’t even be thinking about it.\nEveryone comes to a point where he loses hope and says: “I am going to give up and do something else.” But if to do something at all, then it needs to be a good thing and not a silly thing like seeking revenge. The conflict is really complex; we need strong people to work on solving it with the best ways and less losses.\nI have visited some cities in the West Bank like Bethlehem and Ramallah, and I have been to Jordan, because I have relatives there. My mother’s family left Palestine in the war of 1967.\nThey can’t come and visit us here, so it’s easier for us to go and visit them.\nBut one of my dreams is actually to visit Israel, a dream which I am trying to fulfill. I have lived here, in Hebron, for 22 years, and yet I have still not got the chance to go to Israel. I need a permit to go there, which I applied for twice, but I got a refusal both times, being told something along the lines of “you should have a good reason to go to Israel.”\nReally? A good reason? I was born here. I don’t need to have a good reason to go to Israel. I should have the right to move freely without waiting for a permit. I don’t want to go and live in Israel, and I’m not a dangerous person. I just want to look around, to visit the mosque and the church, and to see the beach. I have never been to a beach before.\nHebron is my birthplace, but I can’t see myself living in it when I get older. I would rather go to a city like Ramallah or Bethlehem, where I can live more freely. It would be nice if I could get the chance to go abroad to study or to work for a couple of years and then come back, because I love Palestine, and when I have kids I want them to be raised here. It would be nice to teach them how to love their country.\nThe author is a student from Hebron.\n ", "external_links": [], "published": "2015-10-11T05:34:00.000+03:00", "crawled": "2015-10-10T22:36:19.159+03:00", "highlightTitle": ""}