{"organizations": [], "uuid": "4810d6d08268ad66d140e60731688dbe9e3259a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/fn2/video/0/0/102315_rs_herridge.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/10/23/justice-department-no-criminal-charges-for-ex-irs-official-lerner/", "country": "US", "title": "Justice Department: No criminal charges for Lerner, others in IRS scandal", "performance_score": 10, "site": "foxnews.com", "participants_count": 1, "title_full": "Justice Department: No criminal charges for Lerner, others in IRS scandal | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "4810d6d08268ad66d140e60731688dbe9e3259a2"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/politics/2015/10/23/justice-department-no-criminal-charges-for-ex-irs-official-lerner/", "ord_in_thread": 0, "title": "Justice Department: No criminal charges for Lerner, others in IRS scandal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published October 23, Email Print\nThe Justice Department announced Friday afternoon that it will not bring criminal charges against Lois Lerner or any other IRS official involved in the targeting of Tea Party groups.\nIn a letter to leaders of the House Judiciary Committee, the department said the investigation into the controversy will be closed -- and while they found \"mismanagement, poor judgment and institutional inertia,\" they found \"no evidence that would support a criminal prosecution.\"\n\"What occurred is disquieting and may necessitate corrective action -- but it does not warrant criminal prosecution,\" Assistant Attorney General Peter J. Kadzik wrote.\nA firestorm erupted more than two years ago with an inspector general's audit that said IRS agents had improperly singled out Tea Party and other conservative groups for extra scrutiny when they applied for tax-exempt status during the 2010 and 2012 elections.\nThe disclosure set off investigations by the Justice Department and multiple congressional committees, who focused in large part on former official Lerner's role.\nThe House voted to hold Lerner in contempt of Congress last year after she refused to answer questions at two House Oversight hearings. She has since retired.\nThe investigations into Lerner featured many unusual twists and turns, including a controversy over an apparent hard drive crash that sent investigators scrambling to recover messages and the release of emails that showed Lerner making disparaging comments about Republicans.\nThe DOJ letter sent Friday said Lerner used \"poor judgment\" in using her IRS email account to send personal messages voicing \"political views,\" but said they found no evidence that she exercised her official authority at the IRS in a \"partisan manner generally\" or that political views influenced her actions with regard to the tax-exempt applications.\nThe letter further said they found \"no evidence\" that any IRS official acted based on political or other motives that would support criminal prosecution.\nRather, the DOJ said they found a \"disconnect\" between employees at the Cincinnati office, where IRS workers vetted the applications, and those in Washington, D.C. The letter said \"no one person\" was responsible, pinning the blame for the \"ill-advised\" and \"burdensome\" process instead on \"discrete mistakes by line-level revenue agents\" and others -- whose mistakes, according to the DOJ, who \"exacerbated\" by leadership lapses in D.C.\nThe Associated Press contributed to this report.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T23:02:39.723+03:00", "highlightTitle": ""}