{"organizations": ["ABC", "CBS Evening News", "Texas Air National Guard", "NBC", "Sony", "CBS Network", "Redford Film Unflattering", "Sony Pictures Classics", "Newser Editors and Wire Services", "CBS"], "uuid": "83e83ba77583ab78abc295dac6a17d109eba3a6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newser.com", "main_image": "http://img2-azcdn.newser.com/image/1040975-0-20151016114409.jpeg", "site_section": "http://rss.newser.com/rss/section/4.rss", "section_title": "Politics from Newser", "url": "http://www.newser.com/story/214558/cbs-wont-run-ads-for-redford-film-unflattering-to-cbs.html", "country": "US", "title": "CBS Won't Run Ads for Redford Film Unflattering to CBS", "performance_score": 0, "site": "newser.com", "participants_count": 0, "title_full": "CBS Won't Run Ads for Redford Film Unflattering to CBS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:44:00.000+03:00", "replies_count": 0, "uuid": "83e83ba77583ab78abc295dac6a17d109eba3a6e"}, "author": "", "url": "http://www.newser.com/story/214558/cbs-wont-run-ads-for-redford-film-unflattering-to-cbs.html", "ord_in_thread": 0, "title": "CBS Won't Run Ads for Redford Film Unflattering to CBS", "locations": ["Vietnam"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lisa Tomasetti", "Dan Rather", "Stephen Colbert", "Bush", "Robert Redford", "Blanchett", "George W. Bush", "Cate Blanchett", "Mapes", "Mary Mapes", "Fox"], "text": "CBS Won't Run Ads for Redford Film Unflattering to CBS Network won't be accepting advertising for movie based on Dan Rather debacle By Newser Editors and Wire Services Posted Oct 16, 2015 11:44 AM CDT COMMENTS (34) (Newser) – CBS has refused to run advertising for Truth , the film starring Cate Blanchett and Robert Redford that revisits a painful episode in the network's past involving a discredited 2004 news story on former President George W. Bush's military service record. CBS has denounced the movie, which opens Friday, as a disservice to the public and journalists. Redford plays Dan Rather in the film, with Blanchett as producer Mary Mapes. Together, the journalists were behind a 60 Minutes II story that questioned Bush's Vietnam War-era commitment to service in the Texas Air National Guard. But CBS apologized for the story after documents used were called into question and couldn't be verified. Mapes and three news executives were fired. The film is told from the points of view of Mapes and Rather, who left CBS News on bitter terms in 2006. Sony Pictures Classics sought a multimillion dollar ad buy to promote the film on Stephen Colbert's Late Show , the CBS Evening News , CBS This Morning , and 60 Minutes , but it was turned down, says the head of the company that places ads for Sony. Instead, Sony is advertising on ABC, NBC, Fox, and several cable networks. CBS confirmed the rejection, and a spokesman says, \"It's astounding how little truth there is in Truth . There are, in fact, too many distortions, evasions, and baseless conspiracy theories to enumerate them all. The film tries to turn gross errors of journalism and judgment into acts of heroism and martyrdom.\" One of the film's producers expressed surprise about CBS' public denunciation. \"I don't think anyone expected them to send flowers,\" he says. \"To get an official statement from them that is negative was not surprising to anyone involved in the film. I think the one thing that surprised everyone was the tone and the emotional nature.\" Robert Redford shown playing Dan Rather in a scene from \"Truth.\" (Lisa Tomasetti) ADVERTISEMENT", "external_links": [], "published": "2015-10-16T19:44:00.000+03:00", "crawled": "2015-10-16T22:10:06.579+03:00", "highlightTitle": ""}