{"organizations": [], "uuid": "56200faf94ccde7ef3e388e05f6c28aeab0e5dad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.vice.com", "main_image": "https://news-images.vice.com/images/articles/meta/2015/10/06/canadas-prime-minister-considers-more-expansive-niqab-ban-1444168896.jpg?crop=0.66666666666667xw:1xh;center,top", "site_section": "https://news.vice.com/topic/politics/page/0", "section_title": "Politics | VICE News", "url": "https://news.vice.com/article/canadas-prime-minister-considers-more-expansive-niqab-ban", "country": "US", "title": "Canada’s Prime Minister Considers More Expansive Niqab Ban", "performance_score": 0, "site": "vice.com", "participants_count": 1, "title_full": "Canada’s Prime Minister Considers More Expansive Niqab Ban | VICE News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "56200faf94ccde7ef3e388e05f6c28aeab0e5dad"}, "author": "Justin Ling", "url": "https://news.vice.com/article/canadas-prime-minister-considers-more-expansive-niqab-ban", "ord_in_thread": 0, "title": "Canada’s Prime Minister Considers More Expansive Niqab Ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With two weeks to go before a federal election, the leader of the governing Conservative Party is promising to look at an outright ban on face-coverings in government buildings, but contends that the debate around his proposals have nothing to do with a handful of assaults against Muslim women in recent days.\nIn an interview with CBC on Tuesday evening , Harper said his re-elected government would consider forbidding the the religious garb in government departments.\n\"That's a matter we're going to examine,\" Harper told CBC. \"Quebec, as you know, has legislation on this. We're looking at that legislation.\"\nThe legislation that Harper is referring to is Quebec's Bill 62 , which contains measures that would forbid both public employees and Canadians from wearing the niqab in offices run by that province's government.\nThe bill is not yet law, but was introduced by the Quebec Liberal Party — which holds a majority government in that province — and will likely be adopted by the fall. It is a significantly weaker version of legislation introduced by the previous government of Quebec, which proposed banning all religious symbols in government offices.\nHarper's commitment echos a commitment from his multiculturalism minister, Tim Uppal, to look over Quebec's plan and possibly adopt measures from it.\nYet the policy would be in direct contradiction with what one of the Conservatives' own ministers promised the public sector.\nTony Clement, President of the Treasury Board and the minister responsible for the bureaucracy, said in a March interview with iPolitics that \"if you are in your place of work or privately in your home or in your private life, what you wear is of no concern to the state.\"\nHarper's comments will undoubtedly add fuel to an already intense debate over his government's ban on the niqab at citizenship ceremonies — which was struck down by the courts, but which Harper promises to replace if he gets re-elected . It has led one of his main political rivals to accuse him of stoking racism and Islamophobia.\nOn the campaign trail, Harper's Conservatives have also announced a tip line for Canadians to report 'barbaric cultural practises' they spot being employed by their neighbors , ostensibly to combat female genital mutilation and forced marriages.\nIn the last few weeks, more than one Muslim woman has been attacked for wearing head-coverings. Liberal leader Justin Trudeau, who has vigorously opposed any kind of ban on the niqab, drew a direct line between the Conservative position and the attacks.\n\"Stop this before someone truly gets hurt,\" Trudeau told CBC Radio. \"We've had women attacked in the streets for wearing hijabs and niqabs. This is not Canada.\"\nCBC host Rosemary Barton asked Harper about those attacks.\n\"What do you say to these people who are doing this to these women, or who may be interpreting falsely, perhaps, what is happening during the election campaign as some sort of anti-muslim feeling that is out there?\" Barton asked.\n\"I don't think you can use that kind of thing to discredit some kind of legitimate political debate,\" Harper answered. \"Violence against women is unacceptable which is why our government has brought forward laws to crack down on such violence.\"\nNDP leader Thomas Mulcair, also vying to replace Harper, has had an uncomfortable time dealing with the issue — telling voters that he is \"uncomfortable\" with the niqab, but that he would not try to institute a new ban on it.\nFollow Justin Ling on Twitter: @justin_ling", "external_links": ["http://www.cbc.ca/news/politics/canada-election-2015-barbaric-cultural-practices-law-1.3254118", "http://www.cbc.ca/news/politics/stephen-harper-niqab-ban-public-servants-1.3258943", "https://twitter.com/justin_ling", "http://ipolitics.ca/2015/03/11/niqab-welcome-in-federal-public-service-clement-thompson/", "http://www.theglobeandmail.com/news/national/muslim-convert-attacked-while-wearing-niqab-in-toronto/article26646425/", "http://www.cbc.ca/news/canada/montreal/quebec-tables-new-religious-neutrality-bill-banning-face-coverings-1.3107827"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-07T01:48:51.456+03:00", "highlightTitle": ""}