{"organizations": ["Facebook Disturbing", "KHOU", "Facebook Email Twitter Google"], "uuid": "c2dca21f8a3d49bde4241b06d4012c4766193d51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.khou.com", "main_image": "http://cdn.tegna-tv.com/-mm-/e2a62e279b08edc40e3ff364b384684560472d01/c=4-0-1916-1080&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/13/KHOU/KHOU/635803613784485096-ad.JPG", "site_section": "http://rssfeeds.khou.com/_/20/102981178/khou/politics", "section_title": "KHOU - Politics", "url": "http://www.khou.com/story/news/politics/2015/10/13/disturbing-political-ad-shows-predator-womens-bathroom/73895610/", "country": "US", "title": "Disturbing political ad shows predator in women’s bathroom", "performance_score": 0, "site": "khou.com", "participants_count": 0, "title_full": "Disturbing political ad shows predator in women’s bathroom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T02:36:00.000+03:00", "replies_count": 0, "uuid": "c2dca21f8a3d49bde4241b06d4012c4766193d51"}, "author": "", "url": "http://www.khou.com/story/news/politics/2015/10/13/disturbing-political-ad-shows-predator-womens-bathroom/73895610/", "ord_in_thread": 0, "title": "Disturbing political ad shows predator in women’s bathroom", "locations": ["Houston"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Doug Miller"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Disturbing political ad shows predator in women’s bathroom Opponents of Houston’s equal rights ordinance, which appears on the ballot in the upcoming city elections, have branded it “the bathroom ordinance.” Post to Facebook Disturbing political ad shows predator in women’s bathroom Opponents of Houston’s equal rights ordinance, which appears on the ballot in the upcoming city elections, have branded it “the bathroom ordinance.” Check out this story on KHOU.com: http://on.khou.com/1Lt77tn Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. Join the Conversation To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Disturbing political ad shows predator in women’s bathroom Election seasons bring out some harsh political ads, but nothing is as harsh as and ad from proponents of Houston's equal rights ordinance. Doug Miller, KHOU 11 News 6:36 p.m. CDT October 13, 2015 Opponents of Houston’s equal rights ordinance, which appears on the ballot in the upcoming city elections, have branded it “the bathroom ordinance.” (Photo: Screenshot) CONNECT 7 TWEET LINKEDIN COMMENT EMAIL MORE \nIf Alfred Hitchcock had ever made a negative campaign ad, it might have looked like the newest political commercial to hit Houston airwaves. \nOpponents of Houston’s equal rights ordinance, which appears on the ballot in the upcoming city elections, have branded it “the bathroom ordinance” to hammer on the argument that it would allow men dressing as women to walk into ladies restrooms and commit sexual assaults. Now they’ve all but depicted that idea in a disturbing advertisement. \nShot in black-and-white and accompanied by menacing music, it shows a man walking into a women’s restroom. Seconds later, after a little girl walks into a bathroom stall, the man steps out of an adjacent stall and confronts the child, then slams the door behind him. \n“Even registered sex offenders could follow girls or young women into the bathroom,” the narrator says. \nThe commercial is clearly intended to frighten Houstonians into voting against the ordinance. One shot even shows water going down a drain in an image seemingly borrowed from the movie “Psycho.” \n“Well, there’s a very scary truth behind this ordinance,” said Jared Woodfill, a leader of Campaign for Houston, the group behind the commercial. “The reality is it allows biological males, it allows registered sex offenders to get into female restrooms, locker rooms and bathrooms.” \nThat argument exasperates supporters of the ordinance, who point out the word “bathroom” appears nowhere in its language. The sweeping measure does, however, forbid discrimination in “public accommodations” based on “sex, race, color, ethnicity, national origin, age, familial status, marital status, military status, religion, disability, sexual orientation, genetic information, gender identity or pregnancy.” \nMore: Read the full text of Houston's equal rights ordinance \nThe phrase “gender identity” covers transgendered people. Before the ordinance had even passed through city council, opponents zeroed in on that point. Demonstrators organized largely by socially conservative clergymen rallied in front of City Hall carrying signs protesting the idea of men using women’s bathrooms. \n“I don’t know about you, but I don’t want my wife, I don’t want my daughter, I don’t want my kids being in a restroom, in a female restroom, with a biological male,” Woodfill said. “That’s just wrong.” \nBut supporters of the ordinance say it echoes similar measures adopted in cities and states across the country. They argue that none of those cities have seen any problems with sexual predators exploiting the ordinance by cross-dressing and entering ladies rooms. \n“The ad implies that, you know, somebody could just one day decide that they were going to be a woman for that day,” said Cheryl Newcomb with Houston Unites, a group leading the fight to pass the ordinance. “And that’s just not how it works.” Equal rights ordinance winning - barely - in new poll \nOther cities have explicitly exempted bathrooms from their versions of the ordinance, said Gerald Treece, the dean of the South Texas College of Law. The fact that Houston’s doesn’t explicitly say anything about restrooms leaves it open for interpretation, he said. \nHowever, Treece points out that what’s depicted in the commercial is already illegal and still would be illegal if the ordinance is upheld at the polls. \n“I think the advertising is a bit misleading,” Treece said. “And the reason is because it is a crime, has always been a crime and always will be to attack a person – a child, a man or a woman – in a restroom.” \nTreece literally laughs at the notion that sexual predators would see the ordinance as an opportunity to attack women in bathrooms. \n“The premise is wrong, the premise that somehow a predator is going to go, ‘Oh boy, this is my big chance,’” he said. “These are sick people who are doing terrible things regardless of this ordinance.” \nMeanwhile, supporters of the ordinance have launched their own advertisement featuring Ed Gonzalez, a Houston city council member who used to be a police officer, debunking some of the critics’ arguments against it. \nBoth commercials were released exactly three weeks before Election Day and six days before the first ballots are cast in early voting. Read or Share this story: http://on.khou.com/1Lt77tn TOP VIDEOS", "external_links": [], "published": "2015-10-14T02:36:00.000+03:00", "crawled": "2015-10-15T17:35:47.985+03:00", "highlightTitle": ""}