{"organizations": [], "uuid": "ae1486a81e8a1d9e2b323731cad7336897b3e5d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "http://d1u4oo4rb13yy8.cloudfront.net/facebook-ibispihzoa-1444450730.jpg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/761252/supreme-court-rejects-death-penalty-for-nitish-katara-killers", "country": "SG", "title": "Cow slaughter rumours lead to violence in UP's Mainpuri", "performance_score": 0, "site": "scroll.in", "participants_count": 1, "title_full": "Cow slaughter rumours lead to violence in UP's Mainpuri", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T12:00:00.000+03:00", "replies_count": 0, "uuid": "ae1486a81e8a1d9e2b323731cad7336897b3e5d6"}, "author": "Scroll Staff", "url": "http://Scroll.in/article/761252/supreme-court-rejects-death-penalty-for-nitish-katara-killers", "ord_in_thread": 0, "title": "Cow slaughter rumours lead to violence in UP's Mainpuri", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cow slaughter rumours lead to violence in UP's Mainpuri Today's major developments. Total Views Two arrested after mob violence Two people were arrested and dozens injured after a mob clashed with the police in Uttar Pradesh's Mainpuri district on Friday following rumours of cow slaughter. The cops said that villagers of the Karhal area attacked them, set police jeeps on fire and damaged several other vehicles after hearing rumours that a cow was killed and being skinned. The mob nearly lynched four men who they believed had skinned the cow, before the police intervened, which led to the violence, according to the Times of India . Two of the four men who were attacked had to be admitted to a hospital and are in a critical condition. Neelam Katara argues that it was an honour killing The Supreme Court on Friday declined a plea by Neelam Katara to award the death sentence to the three men convicted of murdering her son and business executive Nitish Katara in 2002. The convicts — Uttar Pradesh politician DP Yadav’s son Vikas and nephew Vishal, and their henchman Sukhdev Pahelwan — were previously sentenced to a 30-year jail term without remission by the Delhi High Court. Ruling that the murder can neither be classified as an honour killing nor is it the rarest of rare crimes, the SC bench said that it does not warrant the death penalty. Katara's lawyers argued that it was indeed an honour killing as Nitish was picked up from a party where he was seen with Vikas's sister Bharti and was killed since the family did not approve of the relationship. India demands justice over 'brutal' chopping of woman’s hand in Saudi India termed the incident where an Indian woman's hand was chopped off by her employer in Saudi Arabia as \"unacceptable\". External Affairs minister Sushma Swaraj said, \"We are very much disturbed over the brutal manner in which [the] Indian lady has been treated in Saudi Arabia.\" The family of Kashturi Munirathinam, 55, who was employed as a domestic worker in Saudi Arabia, alleged that her right hand was cut off by her employer when she tried to escape harassment and torture. India has demanded that a case of attempted murder be lodged against the culprit. Shashi Deshpande resigns from Sahitya Akademi Award-winning novelist Shashi Deshpande on Friday offered her resignation from the Sahitya Akademi’s General Council, saying she was “deeply distressed by the silence” of the organisation on the murder of Professor MM Kalburgi. “I do this with regret, and with the hope that the Akademi will go beyond organising programmes, and giving prizes, to being involved with crucial issues that affect Indian writers’ freedom to speak and write,\" wrote Deshpande in her letter of resignation. Earlier this week, writer Nayantara Sahgal and poet Ashok Vajpeyi had returned their Sahitya Akademi Awards to protest the \"assault on right to freedom of both life and expression\". PepsiCo, BCCI trying to work out 'amicable' solution The Board of Control for Cricket in India on Friday tried to downplay PepsiCo’s decision to terminate its title sponsorship contract for the Indian Premier League. The beverage giant served a termination notice nearly three months after IPL franchises Chennai Super Kings and Rajasthan Royals were suspended for two years over spot-fixing and corruption allegations. PepsiCo accused the BCCI of breaching the contract by failing to keep the sport clean. On Friday, the BCCI and PepsiCo said in a joint statement that they were engaged in “amicable discussions” and “working towards solutions in the interests of the league”. We welcome your comments at letters@scroll.in", "external_links": [], "published": "2015-10-10T12:00:00.000+03:00", "crawled": "2015-10-11T02:39:32.705+03:00", "highlightTitle": ""}