{"organizations": [], "uuid": "c92ac0d245f0d3effa68ad2d5246d8d8cf6f20fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "bostonherald.com", "main_image": "http://www.bostonherald.com/sites/default/files/media/2015/10/21/10212015obama1.jpg", "site_section": "http://bostonherald.com/news/us_politics", "section_title": "U.S. Politics | Boston Herald", "url": "http://bostonherald.com/news/us_politics/2015/10/president_obama_joins_fight_as_opioid_deaths_soar", "country": "US", "title": "President Obama joins fight as opioid deaths soar", "performance_score": 0, "site": "bostonherald.com", "participants_count": 8, "title_full": "President Obama joins fight as opioid deaths soar | Boston Herald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:00:00.000+03:00", "replies_count": 9, "uuid": "c92ac0d245f0d3effa68ad2d5246d8d8cf6f20fe"}, "author": "Matt Stout", "url": "http://bostonherald.com/news/us_politics/2015/10/president_obama_joins_fight_as_opioid_deaths_soar", "ord_in_thread": 0, "title": "President Obama joins fight as opioid deaths soar", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama joins fight as opioid deaths soar Matt Stout Thursday, October 22, 2015 DEADLY SERIOUS: President Obama hosts a discussion in Charleston, W.Va. on the prescription drug abuse and heroin epidemic. comments Tweet The state’s opioid death toll has continued to soar at a faster­ rate than even in 2014 — the state’s deadliest year on record — according to new data released even as President Obama unveiled new federal efforts to attack the nationwide scourge.\nMore than 680 people died of overdoses during the first six months of this year in Massachusetts, a 7 percent increase over the 641 deaths in the same time period last year, when the state saw more fatal overdoses than ever before, state officials said yesterday.\nThe new figures — which are preliminary and include estimated overdoses — highlight the vise grip the opiate crisis still has on the state. Of the 684 people who fatally overdosed, 150 died in January, and 95 in both April and May. Deaths dipped to 80 in June.\nObama, in West Virginia, vowed action. Among his initiatives is an order to federal agencies that employ health care providers to offer training on prescribing painkillers. He also directed them to review their health insurance plans and address policies that might prevent patients from re­ceiving medication as part of their treatment.\nOther White House initiatives, however — including a proposed $133 million for new treatment programs — remain locked up in the congres­sional budget stale­mate.\nU.S. Rep. Stephen F. Lynch (D-South Boston) said he spoke with White House drug czar Michael Botticelli Tuesday about the issue. Any plan has to span various agencies, communities and demographics, Lynch said.\n“His call to me — we’ve met several times and he knows we’re working on this issue in Massachusetts — was, ‘We hear you, we understand the approach you want to use and we’re on board,’” Lynch said in a Boston Herald Radio interview in which he specifically flagged the over-prescribing of medications. “A very small number of doctors are prescribing huge numbers of opioid prescriptions.”\nThe state health department has confirmed that 1,089 people died of opioid overdoses in 2014, and state officials expect an additional 136 to 199 cases to eventually be confirmed and added to last year’s death count.\nThe 1,089 deaths already represent a 63 percent spike over 2012 and a 20 percent jump from 2013.\nGov. Charlie Baker proposed sweeping legislation last week that seeks to limit first-time opiate prescriptions to a 72-hour supply. The bill also would give medical professionals the authority to involuntarily commit people for treatment for 72 hours if they are deemed to pose an immediate danger.\nThe proposals, however, received a cool response from some doctors, as well as Senate President Stanley C. Rosenberg and House Speaker Robert A. DeLeo.\nHerald wire services contributed to this report.", "external_links": ["https://twitter.com/share?text=President+Obama+joins+fight+as+opioid+deaths+soar+"], "published": "2015-10-22T12:00:00.000+03:00", "crawled": "2015-10-25T12:28:58.259+02:00", "highlightTitle": ""}