{"organizations": [], "uuid": "138db4b50b80d834f779f4c1c478a1fa6e0502ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30174497/the-bothwell-law-group-announces-3-million-fca-hospice-settlement", "country": "US", "title": "The Bothwell Law Group Announces $3 million FCA Hospice Settlement", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Bothwell Law Group Announces $3 million FCA Hospice Settlement - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "138db4b50b80d834f779f4c1c478a1fa6e0502ee"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30174497/the-bothwell-law-group-announces-3-million-fca-hospice-settlement", "ord_in_thread": 0, "title": "The Bothwell Law Group Announces $3 million FCA Hospice Settlement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Bothwell Law Group, P.C.\nATLANTA , Oct. 2, 2015 /PRNewswire/ -- The Bothwell Law Group, P.C. announces the conclusion of its clients' four-year long civil False Claims Act case against national hospice providers Guardian Hospice of Georgia , LLC; and Guardian Hospice, Inc. The qui tam complaint was jointly filed in January 2012 by Rose Betts and Jennifer Williams and later amended in 2015. Defendants will pay more than $3 million to resolve allegations that they admitted and billed Medicaid for non-terminal patients which were ineligible to receive Government-funded healthcare.\nRelators observed these practices firsthand, routinely witnessing non-terminal patients being treated, Relators were told that it was necessary to keep the hospice's \"census\" up, no matter what it took to keep Medicare/Medicaid paying for their care, including fabricating diagnoses and falsifying supporting documentation.\nBetts and Williams were represented by nationally-recognized whistleblower attorney, Mike Bothwell of The Bothwell Law Group, P.C. Relators welcomed today's announcement, which marks the end of four years of litigation.\nRemarking on the significance of this settlement , whistleblower attorney Mike Bothwell stated that, \"When patients are put on hospice, but they don't really qualify for hospice care, they are forced to forego regular medical care that could help cure their illness. Therefore, it is doubly cruel for hospice companies to deprive their own patients from the care they need and deserve in order to defraud the government.\"\nFederal and State False Claims Acts allow private citizens with insider knowledge of fraud, waste, and abuse to bring an action on behalf of the governments and to participate in the recovery of the stolen funds. These statutes allow governments to recover three times the amount they were defrauded, in addition to civil penalties of $5,500 to $11,000 per false claim. Successful whistleblowers can receive between 15 and 30 percent of the governments' recovery.\nThe settlement was achieved through the coordinated efforts of a team of attorneys from the U.S. Department of Justice, and the U.S. Attorney's Office for the Northern District of Georgia . The team was led by Jessica Weber from the Department of Justice, and at the USAO by Assistant U.S. Attorneys Lena Amanti .\nThe case is U.S. ex rel. Rose Betts and Jennifer Williams v. Texas Home Health of America, L.P. et al. , Civ. No. 1:12-CV-0412 (N.D. GA).\nThe Complaint can be found at:\nhttp://www.whistleblowerlaw.com/wp-content/uploads/2015/10/First-Amended-Complaint-090415.pdf\nThe Settlement Agreement can be found at:\nhttp://www.whistleblowerlaw.com/wp-content/uploads/2015/10/Guardian-Settlement-Agreement-Fully-Executed.pdf\nAbout The Bothwell Law Group, P.C.:\nSince 1996, The Bothwell Law Group, P.C. has earned a national reputation for successful representation of whistleblowers in federal and state courts across the United States , and is one of only a handful of firms exclusively representing whistleblowers. The Bothwell Law Group, P.C.'s cases have resulted in settlements of more than $500 million for the United States Government and in the payment of millions of dollars in whistleblower rewards. Inquiries may be directed to Mike Bothwell at (770) 643-1606, email Mike@whistleblowerlaw.com .\nFor more information about the firm's attorneys, FCA settlements and FCA experience, see www.whistleblowerlaw.com .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/the-bothwell-law-group-announces-3-million-fca-hospice-settlement-300153595.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/the-bothwell-law-group-announces-3-million-fca-hospice-settlement-300153595.html", "http://www.xmlnews.org/ns/", "http://www.whistleblowerlaw.com/wp-content/uploads/2015/10/First-Amended-Complaint-090415.pdf", "http://www.whistleblowerlaw.com/", "http://www.whistleblowerlaw.com/wp-content/uploads/2015/10/Guardian-Settlement-Agreement-Fully-Executed.pdf", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL18939&Transmission_Id=201510021643PR_NEWS_USPR_____CL18939&DateId=20151002"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T02:53:07.205+03:00", "highlightTitle": ""}