{"organizations": [], "uuid": "152f441b0746dffa192f291575ad46d2de40616c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03473/sturgeon-1_3473207k.jpg", "site_section": "http://www.telegraph.co.uk/news/politics/", "section_title": "Politics News - UK Politics - Telegraph", "url": "http://www.telegraph.co.uk/news/politics/11932722/SNP-conference-as-it-happened-Nicola-Sturgeon-to-woo-No-voters.html", "country": "GB", "title": "SNP conference as it happened: Nicola Sturgeon to woo 'No' voters", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "SNP conference as it happened: Nicola Sturgeon to woo 'No' voters - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:00:00.000+03:00", "replies_count": 0, "uuid": "152f441b0746dffa192f291575ad46d2de40616c"}, "author": "Laura Hughes , Political Correspondent ,", "url": "http://www.telegraph.co.uk/news/politics/11932722/SNP-conference-as-it-happened-Nicola-Sturgeon-to-woo-No-voters.html", "ord_in_thread": 0, "title": "SNP conference as it happened: Nicola Sturgeon to woo 'No' voters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "• First Minister wants to lead Scotland for the next decade • Top priority: Winning \"historic\" third term in office in May 2016 • Sturgeon: 'Only one vote next year' for independence supporters • BBC staff worried about abuse at SNP conference Key developments On the possibility of a second referendum Nicola Sturgeon warned the Prime Minister that taking Scotland out of the EU would see the demand for a second independence referendum become \"unstoppable.\" She said: \"If you try to take Scotland out of the EU against our democratic wishes, you will be breaching the terms of last year’s vote. \"And, in those circumstances, you may well find that the demand for a second independence referendum is unstoppable.\" First Minister Nicola Sturgeon delivers a welcome address to the 81st Annual SNP conference at the Aberdeen Exhibition and Conference centre Photo: Jeff J Mitchell/Getty Images She said the SNP will not propose another referendum in the next parliament without \"strong evidence\" that a significant number of those who voted No have changed their minds. The First Minister said to do otherwise \"would be wrong and we won't do it.\" She said: \"It would not be respecting the decision that people made.\" Miss Sturgeon insisted the SNP is \"also a party with another mission\" and that winning an \"historic\" third term in office for the nationalists is her number one priority for May. An In/Out vote on Britain's EU membership will be held before the end of 2017 Photo: Alamy On Labour Nicola Sturgeon said she had hoped the SNP and Jeremy Corbyn could work together, but that it is becoming clearer by the day that Labour is \"unreliable, unelectable and unable to stand up to the Tories.\" She also attacked the appointment of Lord Falconer as shadow justice secretary: \"You will never find a peer in our cabinet. Friends, we want to abolish the House of Lords.\" Speaking on last night's fiscal charter vote, she said: \"Labour initially planned to vote for George Osborne's austerity charter. \"It was only SNP pressure that changed their minds. \"Or, at least, it changed some of their minds. In the vote last night, Labour divisions were laid bare.\" Jeremy Corbyn won the Labour leadership with almost 60 per cent of the vote Photo: Reuters Nicola Sturgeon wants to lead Scotland for the next decade Speaking to the political magazine Holyrood, the SNP leader said she wanted to contest the next two Scottish Parliament elections in 2016 and 2021. The decision means Ms Sturgeon hopes to remain Scotland's First Minister until around 2025 - an indication she may be planning to call a second independence referendum later than expected. \"I have been First Minister for less than a year, and I am about to face an election which for the first time I will look the Scottish people in the eye and say, ‘vote for me as First Minister,\" she said in the pre-conference interview. “I think it would be rather strange if I was already deciding when I would stand down, but let’s put it this way, if I win the next election, and I take nothing for granted, then it will be my plan to also fight the election after that as leader as well, all being well and unforeseen circumstances aside.” 11:45 From our political correspondent Ben Riley- Smith : Nicola Sturgeon has been greeted with rock-star status by hundreds of SNP delegates on the first morning of the party's annual conference in Aberdeen. There were huge cheers for the Scottish First Minister's claim that support for independence could be \"unstoppable\" if Britain votes to leave the European Union. Speaking in a vast hangar in front of a billowing Saltire, there were also repeated attacks on Jeremy Corbyn as Ms Sturgeon attempted to portray the SNP as to the Left of Labour. \"Labour is unreliable, unelectable and unable to stand up to the Tories,\" she said - to whoops from the crowd. The one to watch during the next few days is whether any SNP MPs or leading figures speak out of turn over the chances of a second independence refererendum. Ms Sturgeon is attempting a delicate tight-rope act between offering her independence-keen activists the promise of another referendum while keeping on side Scots who, polls suggest, are overwhelmingly against holding another vote any time soon. Best T-shirt of #snpconf so far. pic.twitter.com/w0N29Vy6uX — Ben Riley-Smith (@benrileysmith) October 15, 2015 11:30 The public in danger of an 'attack of ‘referendumitis’ Gordon Wilson, former SNP leader, has commented on Nicola Sturgeon's decision to park a referendum unless the UK leaves the EU. Mr Wilson said: “I support Nicola Sturgeon’s decision to stop the debate over the timing of the next referendum. \"Given the lack of a clear-cut majority for independence, it is a waste of time talking about when there will be a second effort. On current support, we would lose it! Not only that, but there will be confusion with the European Referendum. \"The public will be in danger of an attack of ‘referendumitis’.\" Photo: Alamy 11:00 Nicola Sturgeon has finished speaking now. She put Scottish Independence at the centre of her message, saying that demand for a second vote will become 'unstoppable' if Britain leaves the European Union. She also set a clear tone for her election campaign, attacking Labour's disunity under Jeremy Corbyn and saying her party is the only one that can stand up to Tory austerity. Vast hangar with thousands of seats is centre of SNP conference. Nicola Sturgeon up imminently. pic.twitter.com/rsFeptGbqb — Ben Riley-Smith (@benrileysmith) October 15, 2015 10:57 Nicola Sturgeon says she has an 'iron determination' to win a third term for the SNP. 'Let us get on with our conference, let us get on with the job'. 10:57 Nicola Sturgeon says that if Britain votes to leave the EU demand for a second independence referendum will become 'unstoppable'. A vote to leave EU would be \"breaching the terms\" of 2014 ref on independence, says Sturgeon. — Ben Riley-Smith (@benrileysmith) October 15, 2015 10:54 Nicola Sturgeon: 'I believe with all my heart that Scotland should be an independent country.' She says that support for independence will rise over the next few years. She says that if there is 'strong, consistent' evidence that people have changed their minds then 'we have no right to rule out a referendum'. 'We have to change more minds, we have to build the case and make it even stronger. Independence is the best future for our country'. 10:52 Nicola Sturgeon says that the Conservatives are trying to shift the centre ground of British politics 'sharply to the right'. She says that next May the SNP is 'determined' to win an historic third term in government. 10:50 Nicola Sturgeon says it has become 'glaringly obvious' that Jeremy Corbyn has become unable to unite his party. She attacks the appointment of Lord Falconer as shadow justice secretary: 'You will never find a peer in our cabinet. Friends, we want to abolish the House of Lords.' 'Labour is unreliable, unelectable and unable to stand up to the Tories,' she says 10:45 Nicola Sturgeon is adressing conference She reveals the SNP membership is now 114,000 Sturgeon reveals SNP membership is now 114k -- more than four times bigger than before #indyref . Remarkable. — Ben Riley-Smith (@benrileysmith) October 15, 2015 Vast hangar with thousands of seats is centre of SNP conference. Nicola Sturgeon up imminently. pic.twitter.com/rsFeptGbqb — Ben Riley-Smith (@benrileysmith) October 15, 2015 Was kicked off with a speech from Callum McCaig #SNP15 underway with @callum_mccaig addressing delegates pic.twitter.com/8VDHcCVWSO — Catriona Webster (@cat_webster) October 15, 2015 10:25 Kirsty Blackman was due to open this year's conference, but she has missed her flight to Aberdeen DISASTER, didn't clear security in time so won't make conference opening speech! :( :( — Kirsty Blackman (@KirstySNP) October 15, 2015 You'll just all have to imagine it was brilliant ;) — Kirsty Blackman (@KirstySNP) October 15, 2015 10:10 Labour lost because the 'Scottish Labour dog wagged the English tail' Frank Field, the Labour veteran, says Scottish Labour pressured the Party into signing up to George Osborne's fiscal charter. This morning he said: \"Two issues are at stake here. Labour lost heavily in 2015 because it appeared fiscally irresponsible. Signing up to the Charter matters little one way or the other. But it does signify a change in heart by Labour to move towards a balanced budget. Frank Field goes on the offensive after abstention. Attacks Corbyn/McDonnell for caving to SNP pressure pic.twitter.com/32PtWNuCNK — Paul Waugh (@paulwaugh) October 15, 2015 \"That was John McDonnell’s original position and he was right. He has, however, given in to pressure from the Scottish Labour Party that unless Labour in Westminster made a token stand against the Charter, Labour’s hopes in Scotland would be further dashed. But here comes the other crucial finding from the election. \"Labour lost heavily because it appeared that the Scottish Labour dog wagged the English tail. Let the Scottish Labour Party fight its own battles. We need an English Labour Party to fend off further erosions of our electoral base south of the border.\" Frank Field MP Photo: DAVID ROSE FOR THE TELEGRAPH 09:55 Artist Kaya Mar has brought up some unusual Sturgeon and Salmond paintings to conference I've arrived at #snp15 . What a start pic.twitter.com/pf7Br1QflA — Graeme Demianyk (@GraemeDemianyk) October 15, 2015 I think this one speaks for itself pic.twitter.com/YsVfpX90kN — Graeme Demianyk (@GraemeDemianyk) October 15, 2015 This one's hot off the press. Exit door, England discarded etc. #SNP15 pic.twitter.com/t7BDhY0Fpp — Graeme Demianyk (@GraemeDemianyk) October 15, 2015 09:44 Second referendum could still happen Derek Mackay, the SNP's chairman, has suggested a second referendum is still a possibilty. Mr Mackay said it was now \"very much in the hands of the people to decide if the time is right. \"No politician gets to decide that a country can't decide its own future.\" 09:26 David Cameron can't \"have it all his own way over the next five years” Speaking to Ben Riley-Smith before the SNP's annual conference, Stewart Hosie told The Telegraph his Party is panning on killing off the Snoopers’ Charter and Tory tax credit changes. Mr Hosie revealed the SNP are on a mission to form alliances with Conservative rebels and like minded Labour MPs. “Issues like the Snoopers' Charter, there’s always been a strand of opinion in the Tory Party which doesn’t like that kind of thing,” he said. “We know that there are Tories who don’t want to spend the money on Trident. We know there’s resistance to some of the tax credit changes within the Conservative Party. He warned: “I don’t think David Cameron can assume he can have it all his own way over the next five years.” He also said he believes Mhairi Black could be future leader of the SNP: “She’s contributed hugely and she’s carried herself incredibly well. I mean the demands on her time have been phenomenal.\" Stewart Hosie, one of the SNP's longest serving MPs Photo: Getty Images 09:15 BBC worried about abuse at SNP conference Simon Johnson, our Scottish Political Editor, has been told by senior BBC insiders that they are concerned their new exhibition stand will be targeted by SNP members still fuming at the supposedly biased coverage of the independence referendum. A number of SNP members blame the BBC for their defeat in last year’s referendum and Alex Salmond has claimed that Nick Robinson, the BBC’s former political editor, should be “embarrassed and ashamed” by his coverage. The sources said BBC reporters continue to be the subject of abuse on social media and they are aware that some members will “want to make their views known”. 09:05 A second referendum relies on evidence that people have changed their minds John Swinney, the deputy SNP leader and deputy Scottish First Minister, has told the Today Programme there needs to be serious evidence that a large number of people have changed their minds on independence. He said: \"That's an approach which is consistent with the respecting of the democratic mandate that took place in September 2014 and acknowledges the fact that the decision about the future of Scotland lies very firmly in the hands of the people who choose to live in this country and to work in this country and to decide its constitutional future.\" The first minister is expected to tell delegates: “For those who want Scotland to be independent, there is only one vote next year that makes sense – and that is a vote for the SNP. But I don’t just want to win the votes of independence supporters. “I want to inspire people who voted no last year to vote SNP too. I want them to vote SNP because they know we are the best party, with the best ideas and the best people to lead Scotland forward.” Deputy SNP leader, John Swinney Photo: PA 08:55 Nicola Sturgeon to address SNP conference This morning is the start of the SNP's largest ever party conference in Aberdeen, where Nicola Sturgeon is expected to address the possibility of a second independence referendum just after 10am. But she is also expected to insist the SNP is \"also a party with another mission\" and that winning an \"historic\" third term in office for the nationalists is her number one priority for May. Heading to the granite city for @theSNP biggest ever conference #SNP15 #strongerforscotland — Nicola Sturgeon (@NicolaSturgeon) October 14, 2015 The SNP leader has said she will spell out the conditions for what would trigger another referendum in her party’s 2016 Holyrood election manifesto . The First Minister will insist her SNP is the \"best party\" to govern Scotland and call on those who rejected independence to back them in next year's Holyrood elections. Fine start to @theSNP conference in Aberdeen with new @YouGov poll: SNP 51%, Lab 21%, Con 19%, LD 5% #SNP15 #SP16 #BothVotesSNP — Angus Robertson (@AngusRobertson) October 15, 2015 There are around 3,500 delegates and almost 1,000 observers, exhibitors and journalists expected to attend the “biggest ever gathering in the history of the SNP.” Miss Sturgeon will tell the conference: \"There will, understandably, be significant interest in what our manifesto will say about independence,\" \"But let me make this clear: What matters just as much to me and to people across the country will be what it says about jobs and the economy, the safety of our communities, our hospitals and health centres, our schools, colleges and universities and our plans to use new powers to tackle poverty and inequality. \"On all of these issues and many, many more, our manifesto will set out radical, ambitious and progressive policies to make this country even stronger.\" telepolitics Follow @telegraph", "external_links": [], "published": "2015-10-15T20:00:00.000+03:00", "crawled": "2015-10-15T15:47:17.563+03:00", "highlightTitle": ""}