{"organizations": [], "uuid": "4b38efcae58d5cc3f2136e4c45513cadfd4a9943", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4276359/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://www.heraldscotland.com/politics/political_news/13790700.Hyslop__T_in_the_Park_bosses_were_given_state_aid_to_stop_festival_moving_out_of_Scotland/?ref=rss", "country": "", "title": "Hyslop: T in the Park bosses were given state aid to stop festival moving out of Scotland", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Hyslop: T in the Park bosses were given state aid to stop festival moving out of Scotland", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T14:11:00.000+03:00", "replies_count": 0, "uuid": "4b38efcae58d5cc3f2136e4c45513cadfd4a9943"}, "author": "", "url": "http://www.heraldscotland.com/politics/political_news/13790700.Hyslop__T_in_the_Park_bosses_were_given_state_aid_to_stop_festival_moving_out_of_Scotland/?ref=rss", "ord_in_thread": 0, "title": "Hyslop: T in the Park bosses were given state aid to stop festival moving out of Scotland", "locations": ["Scotland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "114 comments \nT in the Park organisers were provided with £150,000 of state aid in a bid to prevent them from pulling the plug on the profitable festival, the Culture Secretary has claimed in a fraught exchange with MSPs. \nFiona Hyslop was faced with suggestions that the application for funding was “fraudulent” and that it had been signed off due to promoter DF Concert’s links with the SNP, in an appearance before Holyrood’s education and culture committee. \nThe application for state aid for the festival was approved after a meeting was brokered by Jennifer Dempsie, a former special advisor to Alex Salmond and the partner of SNP Westminster leader Angus Robertson, sparking allegations of cronyism. Ms Dempsie, who until recently was vying to stand as an SNP candidate for Holyrood next May, was working for DF Concerts at the time. \nLoading article content \nThe Culture Secretary said that she had been unaware that a request for the meeting had come from Ms Dempsie, and that despite her serving as a high-profile special advisor to the First Minister as recently as six years ago, there was “no reason” that anyone in her office would have been aware of her background. \nLiam McArthur, the LibDem MSP, said he found it “incredible” to claim that senior civil servants would not have known who Ms Dempsie was. \nMs Hyslop, who it has emerged discussed T in the Park’s planning application with Ms Dempsie at the SNP conference in March, said the funding had been approved to protect the long term viability of T in the Park, due to “unexpected challenges” of moving the event from Balado to Strathallan, which left a seven-figure bill. She suggested that festival organisers, under pressure from shareholders, had been ready to move T in the Park out of Scotland or that it may have taken place as single-day events in cities rather than as a traditional festival. Promoted stories \nThe claim was rejected by SNP backbencher Chic Brodie, who said: \"What business case was presented up front? Because of the economic nature I disavow the notion that T in the Park, which is co-joined with Scotland, that they would move.\" \nMSPs also pointed out that DF Concerts and its parent company had made multi-million pound profits in recent years, and questioned why it was necessary to provide a public bail-out. \nMary Scanlon, the Tory backbencher, accused the Scottish Government of displaying contempt for the Holyrood committee by released more than 600 pages of documents related to the decision, many of them heavily redacted, last night despite a request going in last week. \nOn the funding decision, Ms Scanlon pointed out that the original request had been made by DF Concerts for infrastructure, before it was found that this would be against the rules. Later, officials said the cash could only be used for costs related to the planning application and venue hire. \nThe Conservative MSP added: “Can I put it to the cabinet secretary that this was a done deal, given the applicant's close connections with the SNP. The £150,000 to a company with multi-million pound profits... you decided to allocate the money, then you scurried round to find which budget it might fit in to.” \nMr McArthur questioned whether principal sponsor Tennants had been approached to plug the gap in funding, rather than relying on public funds. He said: “There wasn’t any mention of any attempt to ascertain the willingness of the sponsor to step in and provide additional support to this transition. Just because we have the powers and the budget, it shouldn’t necessarily mean that the public steps in to the shoes when the lead sponsor, Tennants, an exceptionally profitable company, could reasonably be expected to shoulder up to maintain an event from which it received enormous benefit.” \nMs Hyslop, who claimed to have received only two letters from members of the public over the state aid deal, responded by saying “that’s a matter for DF Concerts.” When challenged over whether the Scottish Government was satisfied all potential sources of funding were exhausted before state aid was granted, she replied: “Did we interfere with the relations DF Concerts has with other sources of funding? No we didn’t. \n“Sometimes in Government you have to make decisions, sometimes there’s a tight period of time, but if it’s legal, within budget and compliant with state aid rules, it’s a decision that I was prepared to take. Some people might not have wanted us to do that, and they’re entitled to their view… there was a risk to the viability going forward to a multi-day, multi-stage festival in rural Perthshire. My decision was that we had to do something about it, rather than ignore it.” \nFollowing the meeting, Scottish Conservative culture spokeswoman Liz Smith said Ms Hyslop had raised more questions over the funding deal. \nShe added: “T in the Park is a major cultural event, but this was public money and, to date, despite repeated requests, we have not received details of what was supposed to be a cast iron business case behind £150,000 being awarded to DF Concerts nor do we know exactly what it was spent on. Indeed, all we seem to get instead of clarity is lots of redacted statements. This is simply not an acceptable outcome to today's evidence session. \n“It has also just increased suspicions that the grant was a done deal because of Ms Dempsie’s close connections to the SNP. The public will quite rightly be furious. T in the Park is a commercially viable festival supported by one of our largest breweries; the Scottish Government put on record today that it did not examine other possible funding sources in detail so this just increases the pressure on the cabinet secretary to explain why £150,000 of public money was required. It’s now time for the First Minister to step in and give us some straight answers.” Share article \nThe most recent accounts filed at Companies House show that DF Concerts made a pre-tax profit of £5.2 million in 2011, £4.7 million in 2012 and £4.5 million in 2013. For the year ending December 2013, it paid out £3.35 million in dividends.", "external_links": [], "published": "2015-09-29T14:11:00.000+03:00", "crawled": "2015-10-01T14:44:27.360+03:00", "highlightTitle": ""}