{"organizations": [], "uuid": "a6d9f4f984d30f63c9372371b07154d14803d3ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "politicaloutcast.com", "main_image": "http://cdn1.politicaloutcast.com/wp-content/uploads/2015/07/planned-parenthood.jpg", "site_section": "https://politicaloutcast.disqus.com/latest.rss", "section_title": "Political Outcast - Latest Comments", "url": "http://politicaloutcast.com/2015/08/planned-parenthoods-three-percent-lie/", "country": "US", "title": "Re: Planned Parenthood’s Three Percent Lie", "performance_score": 0, "site": "politicaloutcast.com", "participants_count": 1, "title_full": "Re: Planned Parenthood’s Three Percent Lie", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T19:22:00.000+03:00", "replies_count": 0, "uuid": "a6d9f4f984d30f63c9372371b07154d14803d3ab"}, "author": "Hillary for Prison 2016", "url": "http://politicaloutcast.com/2015/08/planned-parenthoods-three-percent-lie/", "ord_in_thread": 0, "title": "Re: Planned Parenthood’s Three Percent Lie", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Planned Parenthood’s Three Percent Lie Posted on by Mack Stetson filed under Abortion \nPlanned Parenthood does silly math to claim that only three percent of what they do is abortion. \nIn the Bible, in the letter of James, he writes about the problem of the human tongue: For we all stumble in many ways. And if anyone does not stumble in what he says, he is a perfect man, able also to bridle his whole body. If we put bits into the mouths of horses so that they obey us, we guide their whole bodies as well. Look at the ships also: though they are so large and are driven by strong winds, they are guided by a very small rudder wherever the will of the pilot directs. So also the tongue is a small member , yet it boasts of great things. How great a forest is set ablaze by such a small fire! And the tongue is a fire, a world of unrighteousness. The tongue is set among our members, staining the whole body, setting on fire the entire course of life, and set on fire by hell. For every kind of beast and bird, of reptile and sea creature, can be tamed and has been tamed by mankind, but no human being can tame the tongue. It is a restless evil, full of deadly poison. With it we bless our Lord and Father, and with it we curse people who are made in the likeness of God. From the same mouth come blessing and cursing. My brothers, these things ought not to be so. (James 3:2-10 ESV) \nWould it be intelligent to respond to these claims by saying, “But James, the tongue is less than three percent of a human’s body mass. It can’t possibly be that significant. A person shouldn’t be evaluated just because he does bad things with his tongue.” \nJames has already answered that simple line of reasoning. The sides of a horse’s mouth are a tiny fraction of his body, and yet a bridle directs him. A rudder is a tiny part of a ship, and yet it is used to determine the ship’s direction. \nSo Planned Parenthood’s claim that they shouldn’t be defunded because abortions are only three percent of what they do, is ludicrous. \nIn the first place, we have testimony from Abby Johnson that organ harvesting brought in $120,000 a month in revenue . That would be above and beyond the money they make from the people paying for the abortions (which are not free). In fact, according to Johnson in her interview with Steven Crowder, if they found the baby was more developed than expected, they actually demanded more money from the women right there and then as she was on the bed in position to get the abortion. \nThe other fascinating thing about this video is that Johnson describes how they did things to promote new abortion customers… Like get women on birth control. A sexually active woman relying on birth control to avoid pregnancy is probably going to end up pregnant at some point. So by “helping” women become sexually active Planned Parenthood is actually helping their abortion business. They might claim that introducing women to birth control is part of the 97 percent of things they do that are not abortions, but that is deceptive. They are cultivating abortion customers. \nRich Lowry writes in the New York Post, By Planned Parenthood’s math, a woman who gets an abortion but also a pregnancy test, an STD test and some contraceptives has received four services, and only 25 percent of them are abortion. This is a little like performing an abortion and giving a woman an aspirin, and saying only half of what you do is abortion. Such cracked reasoning could be used to obscure the purpose of any organization. The sponsors of the New York City Marathon could count each small cup of water they hand out (some 2 million cups, compared with 45,000 runners) and say they are mainly in the hydration business. Or Major League Baseball teams could say that they sell about 20 million hot dogs and play 2,430 games in a season, so baseball is only .012 percent of what they do. Supporters of Planned Parenthood want to use its health services as leverage to preserve its abortions, as if you can’t get one without the other. Of course, this is nonsense. \nLowry also points out that all the other services are provided by other groups both inside and outside the government. There is no reason to give Federal funds to an organization that is responsible for about 30 percent of abortions in this country for the sake of other services they provide for women. \nPlanned Parenthood should be defunded.", "external_links": [], "published": "2015-10-18T19:22:00.000+03:00", "crawled": "2015-10-18T23:25:15.101+03:00", "highlightTitle": ""}