{"organizations": [], "uuid": "dea2f79700101d72765fd53af10309d2c5a83a74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://www.yallpolitics.com/index.php/yp/atom", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/sen._chris_mcdaniel_and_ucfund_team_up_on_fundraising_email_for_sojourner/", "country": "US", "title": "Sen. Chris McDaniel and @UCFund team up on fundraising email for Sen. Melanie Sojourner", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Sen. Chris McDaniel and @UCFund team up on fundraising email for Sen. Melanie Sojourner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T21:43:00.000+03:00", "replies_count": 0, "uuid": "dea2f79700101d72765fd53af10309d2c5a83a74"}, "author": "Staff of Y'all Politics", "url": "http://yallpolitics.com/index.php/yp/post/sen._chris_mcdaniel_and_ucfund_team_up_on_fundraising_email_for_sojourner/", "ord_in_thread": 0, "title": "Sen. Chris McDaniel and @UCFund team up on fundraising email for Sen. Melanie Sojourner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dear Conservative, Thanks to committed conservatives like you, we are building a movement that is making big changes nationally and in the State of Mississippi. One of the issues we have taken head on is the repeal of Common Core in Mississippi. You and I know how important it is to permanently rid Mississippi of the \"Obamacare of the public education system.\" We need your help to keep up the fight. But here's one thing you may not know: one of our biggest champions in the legislature – State Senator Melanie Sojourner – is under heavy fire from a Democrat who previously served in the Legislature for more than three decades. During that time he amassed a record that supported big government policies of tax increases and irresponsible spending. It's hard to believe, but her Democrat opponent is accusing her of being TOO CONSERVATIVE, and the political establishment is against her because of her strong opposition to Common Core and willingness to fight for conservative causes. She is a Republican who holds others accountable, including those in her own party. Please help us: we have to help Melanie Sojourner keep her seat in the senate if we are going to be successful in repealing Common Core in Mississippi. She has a built a great conservative record during her short tenure in the legislature. She has been a strong supporter of gun rights and religious liberty, and a fierce opponent of higher taxes and more spending. Most of all, she was a driving force behind the veto of a bill that would have made it much harder to repeal Common Core during next year's legislative session. The fact is the most important thing you could do to get rid of Common Core for good is to make a contribution to Melanie's campaign right now. If you need one more reason to help her, you should know this. Her big government Democratic opponent was defeated in 2011 because of his opposition to legislation that would have limited the government's ability to seize private property using the power of Eminent Domain. You heard that right: Mississippi's strongest anti-Common Core champion is under attack from a career politician who fought against private property rights. Melanie Sojourner has a lifetime record of fighting for private property rights. Will you help Melanie win one for the good guys? Thanks for your support. Please help out Melanie if you can. Sincerely, Paid for by The Friends of Melanie Sojourner United Conservatives Fund, P.O. Box 4164, Laurel, MI 39441, United States Unsubscribe Posted October 1, 2015 - 12:31 pm YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-01T21:43:00.000+03:00", "crawled": "2015-10-03T04:12:26.105+03:00", "highlightTitle": ""}