{"organizations": [], "uuid": "447a1b0825eef4de4ea79b6fb2418b71f49b62c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30350690/victims-attorneys-john-manly-and-vince-finaldi-blast-lausd-for-asking-supreme-court-to-reduce-protections-for-child-victims-of-sexual-abuse", "country": "US", "title": "Victim's Attorneys John Manly And Vince Finaldi Blast LAUSD For Asking Supreme Court To Reduce Protections For Child Victims Of Sexual Abuse", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Victim's Attorneys John Manly And Vince Finaldi Blast LAUSD For Asking Supreme Court To Reduce Protections For Child Victims Of Sexual Abuse - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "447a1b0825eef4de4ea79b6fb2418b71f49b62c1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30350690/victims-attorneys-john-manly-and-vince-finaldi-blast-lausd-for-asking-supreme-court-to-reduce-protections-for-child-victims-of-sexual-abuse", "ord_in_thread": 0, "title": "Victim's Attorneys John Manly And Vince Finaldi Blast LAUSD For Asking Supreme Court To Reduce Protections For Child Victims Of Sexual Abuse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Manly, Stewart & Finaldi\nNEWPORT BEACH, Calif. , Oct. 26, 2015 /PRNewswire/ -- Attorneys representing child abuse victims of the Los Angeles Unified School District condemned a decision by the Los Angeles Board of Education to file an appeal with the California Supreme Court today to reduce the protections given to child victims of sexual predators in California .\nAccording to a report on Friday, October 23 in the Los Angeles Times by Teresa Watanabe , LAUSD attorneys plan to file an appeal today asking the California Supreme Court to overturn the recent California Court of Appeals of decision in Sinai M. v. Los Angeles Unified School District, Case No. B253983, 2015 CalApp. LEXIS 814.\nThis highly publicized case condemned and overturned a trial court decision that allowed LAUSD to escape liability by blaming a thirteen-year-old girl for having sex with her 28-year-old math teacher. The LAUSD attorneys introduced the girl's sexual history into the trial as part of their \"blame the victim strategy.\" They portrayed the thirteen-year-old victim as a willing partner in her own abuse.\nThe Court of Appeals stated, \"The district's position is as outrageous as it is wrong.\"\nOn Friday, The Roman Catholic Archdiocese of Los Angeles officially withdrew its support for LAUSD's position following criticism by Manly Stewart and Finaldi and attorneys representing the victim in the Sinai case.\nAttorney John Manly , a leading advocate for child sex abuse victims, reacted angrily to the LAUSD appeal, \"It is very disturbing that LAUSD plans to continue its strategy of blaming the victims of sexual predators in our schools and wants to make children more vulnerable to sexual assault thought California . Archbishop Gomez deserves credit for recognizing and accepting the higher standard of protection for child sex abuse victims established by the court of appeals in the Sinai case and LAUSD should do no less,\" said Manly.\nThe Sinai case sparked national attention when W. Keith Wyatt , an LAUSD attorney who argued in court that the victim should be held partially responsible for her abuse, said in a radio interview on KPCC that it was a more dangerous decision for a 14 year old to cross the street in traffic than to have sex with her teacher.\nLAUSD publicly fired Wyatt following his remarks, then quietly rehired him at the urging of its General Counsel David Holmquist .\n\" David Holmquist is the architect of LAUSD's morally repugnant strategy of blaming child victims in sex abuse cases,\" said victim's attorney Vince Finaldi . \"Under his direction, the district actually employed a psychologist to argue in court that a 9-year-old girl with a low IQ wouldn't need long-term therapy after being sexually assaulted by a boy at school because low intelligence acts as a \"protective factor\" that can mitigate the depression associated with trauma. Parents should demand that the School Board replace Mr. Holmquist with someone who will aggressively remove predators from our schools rather than blaming the children they victimize.\"\nManly, Stewart and Finaldi is California's leading law firm representing child victims of sexual abuse. The firm has represented more than 150 victims of clergy sexual abuse in California and hundreds of others throughout the United States . The firm also represented plaintiffs in the $140,000,000 settlement against LAUSD in the Miramonte case, the largest sex abuse settlement against a School District in the US.\n releases/victims-attorneys-john-manly-and-vince-finaldi-blast-lausd-for-asking-supreme-court-to-reduce-protections-for-child-victims-of-sexual-abuse-300166052.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/victims-attorneys-john-manly-and-vince-finaldi-blast-lausd-for-asking-supreme-court-to-reduce-protections-for-child-victims-of-sexual-abuse-300166052.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA38220&Transmission_Id=201510261237PR_NEWS_USPR_____LA38220&DateId=20151026"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T19:48:09.296+02:00", "highlightTitle": ""}