{"organizations": [], "uuid": "76da186b23cc51c43fc3de72067fafaa20a7a126", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30185414/verizon-wireless-gcadv-encourage-georgians-to-donate-used-phones-get-involved-to-help-victims-of-domestic-violence", "country": "US", "title": "Verizon Wireless, GCADV encourage Georgians to donate used phones, get involved to help victims of domestic violence", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Verizon Wireless, GCADV encourage Georgians to donate used phones, get involved to help victims of domestic violence - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "76da186b23cc51c43fc3de72067fafaa20a7a126"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30185414/verizon-wireless-gcadv-encourage-georgians-to-donate-used-phones-get-involved-to-help-victims-of-domestic-violence", "ord_in_thread": 0, "title": "Verizon Wireless, GCADV encourage Georgians to donate used phones, get involved to help victims of domestic violence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Verizon Wireless\nALPHARETTA, Ga. , Oct. 5, 2015 /PRNewswire/ -- Georgia ranks ninth in the nation for men killing women, according to the most recent Violence Policy Center study. October is national Domestic Violence Awareness Month (DVAM) and, hoping to lower that ranking, Verizon Wireless , in partnership with the Georgia Coalition Against Domestic Violence ( GCADV ), is encouraging all Georgians to get involved with local organizations dedicated to helping victims of domestic abuse. One easy life-saving act is to donate old phones to the HopeLine ® from Verizon program to support victims and local domestic violence organizations in the Peach State.\nHopeLine from Verizon puts the nation's most reliable wireless network to work in the community by turning no-longer-used wireless phones into support for victims of domestic violence. Victims of domestic violence need help and the simple donation of a no-longer-used phone can be that lifeline. Proceeds from the HopeLine program are used to provide wireless phones and airtime to victims of domestic violence and cash grants to local shelters and non-profit organizations that focus on domestic violence prevention, awareness and advocacy. Consumers can donate their phones at Verizon Wireless Communications Stores or by mail using the postage-paid mailing label available at www.verizonwireless.com/hopeline .\n\"Domestic violence is not just a problem between two people. It is a problem that impacts the entire family, the workplace, and communities. It is important for all of us to be a part of the solution. We all have the ability to make a significant impact on this issue in small ways. Some of these include talking to our local media, reaching out to legislators, donating phones to the HopeLine program, donating supplies to a local shelter and spreading the word on social media,\" says Jan Christiansen , executive director, GCADV.\n\"Verizon has a longstanding commitment to raising awareness of domestic violence, working with many organizations to help domestic violence victims across the state,\" said Jonathan LeCompte , president – Georgia /Alabama Region, Verizon Wireless. \"During DVAM this year, we encourage all Georgians to join us in helping our neighbors live free from violence. Call your local domestic violence shelter or organization and ask how you can help. At the very least Georgians can dig through drawers, find no-longer-used phones and donate them to HopeLine.\"\nSince the launch of the HopeLine phone recycling program in 2001, HopeLine from Verizon has collected given out more than $29 million in cash grants and distributed more than 190,000 phones for use by domestic violence survivors.\nFor more information about HopeLine from Verizon and to learn how to organize a HopeLine drive during DVAM, go to www.verizonwireless.com/hopeline .\nVerizon Communications Inc. (NYSE, Nasdaq: VZ), headquartered in New York , employs a diverse workforce of 178,500 and generated more than $127 billion in 2014 revenues. Verizon Wireless operates America's most reliable wireless network, with 109.5 million retail connections nationwide. Verizon also provides converged communications, information and entertainment services over America's most advanced fiber-optic network, and delivers integrated business solutions to customers worldwide. For more information, visit www.verizon.com/news/ .\nVERIZON'S ONLINE NEWS CENTER: Verizon news releases, executive speeches and biographies, media contacts and other information are available at Verizon's online News Center at www.verizon.com/news /. The news releases are available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds /.\n releases/verizon-wireless-gcadv-encourage-georgians-to-donate-used-phones-get-involved-to-help-victims-of-domestic-violence-300153611.html\n ", "external_links": ["http://gcadv.org/get-involved/", "http://www.verizon.com/news/", "http://www.verizon.com/about/responsibility/hopeline", "http://www.gcadv.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL18559&Transmission_Id=201510050800PR_NEWS_USPR_____CL18559&DateId=20151005", "http://www.verizonwireless.com/", "http://www.verizon.com/about/rss-feeds", "http://www.xmlnews.org/ns/", "http://www.verizonwireless.com/b2c/storelocator/index.jsp", "http://gcadv.org/general-resources/domestic-violence-centers/", "http://www.prnewswire.com/news-releases/verizon-wireless-gcadv-encourage-georgians-to-donate-used-phones-get-involved-to-help-victims-of-domestic-violence-300153611.html", "http://www.verizon.com/news", "http://www.verizonwireless.com/hopeline", "http://www.vpc.org/press/vpc-releases-annual-report-on-women-murdered-by-men-to-mark-landmark-anniversary-of-violence-against-women-act/"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T16:49:33.886+03:00", "highlightTitle": ""}