{"organizations": [], "uuid": "5809d6ca670e1cd6bc9887029ce28570dcbd6ea8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "", "site_section": "https://feeds.feedblitz.com/detroit/politics#", "section_title": "Detroit News - Politics", "url": "http://www.detroitnews.com/story/news/politics/2015/10/22/paul-aides-indicted/74398308/", "country": "US", "title": "Ex-Ron Paul campaign aide convicted, another acquitted", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Ex-Ron Paul campaign aide convicted, another acquitted", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:28:00.000+03:00", "replies_count": 0, "uuid": "5809d6ca670e1cd6bc9887029ce28570dcbd6ea8"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/news/politics/2015/10/22/paul-aides-indicted/74398308/", "ord_in_thread": 0, "title": "Ex-Ron Paul campaign aide convicted, another acquitted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Des Moines, Iowa — Jurors returned a split verdict Thursday in the federal trial of two aides to Ron Paul’s 2012 presidential campaign who prosecutors alleged secretly paid an influential legislator for his endorsement, charges the former candidate argued were timed to undermine his son Rand Paul’s current bid for the White House.\nThe federal jury found Dimitri Kesari guilty of causing the campaign to file false records concerning the payments to former Iowa state Sen. Kent Sorenson. He swung his support from Michele Bachmann to the Texas congressman just days before Iowa’s 2012 Republican caucuses, in which Paul finished third. Sorenson is awaiting sentencing for his role in the alleged scheme.\nKesari, Ron Paul’s deputy campaign manager, was acquitted of an obstruction of justice charge, and jurors said they could not reach a verdict on counts alleging conspiracy, causing false campaign expenditure reports and a scheme to falsify statements. Those charges required the government to prove Kesari knew he was breaking federal law by hiding the payments.\nHe faces a maximum prison sentence of 20 years, and Judge John Jarvey gave prosecutors 10 days to decide whether to pursue the three counts on which the jury deadlocked.\nCo-defendant Jesse Benton, Ron Paul’s former campaign manager, was acquitted of making false statements to the FBI, the only charge against him that wasn’t dismissed before the trial.\nUntil his indictment, Benton had been leading a super PAC dedicated to helping Kentucky Sen. Rand Paul win the 2016 Republican presidential nomination. His work with that group appeared to resume this week. America’s Liberty paid Benton’s political firm, Titan Strategies, about $80,000 on Tuesday for direct mailings to voters in Iowa and New Hampshire, filings with federal regulators show.\n“I am happy that justice has been served,” Rand Paul said in a statement Thursday.\nThe defendants were accused of hiding the payments to Sorenson, which totaled $73,000 over several months, through invoices for production services from a film company, according to emails presented by attorneys for the Justice Department.\nLawyers for both men challenged the authenticity of the emails and questioned the credibility of Sorenson, who entered a plea deal last year with the government on charges of obstruction of justice and causing a campaign to falsely report expenditures. Sorenson testified earlier in the trial.\nJesse Binnall, an attorney representing Kesari, said his client worked on the political side of the campaign and had nothing to do with federal election filings. He insisted Kesari did not know he was doing anything wrong.\n“Ignorance of the law is an absolute excuse,” he said during his closing arguments. Benton, who is married to Ron Paul’s granddaughter and Rand Paul’s niece, planned to return home Thursday to the Washington area, his attorney Roscoe Howard said.\nFormer Federal Elections Commission Chairman David Mason testified that federal law is unclear whether campaigns must report payments to sub-vendors who perform work for campaign functions including advertising services. The campaign officials have said Sorenson was paid for his work on the campaign and that it was not illegal to pay him as a sub-vendor and record the payments under film production category without disclosing his name.\nBenton originally faced more charges in the case, but they were dismissed before the trial after defense attorneys argued that they stemmed from FBI interviews last year that could not be used. John Tate, a third Paul aide originally accused of wrongdoing in the alleged cover-up, had his charges dismissed over the same argument. The government may refile the dismissed charges separately in the future.\nA spokesman for the U.S. attorney’s office said the prosecution team had no immediate comment.\nProsecutors argued that concealing payments to an elected official undermines the electoral system and it’s important to uphold laws that ensure integrity and transparency of the federal election process.\nRon Paul, testified, however that he believes the prosecutors were targeting his aides for their ideology. He said he didn’t think it was coincidental that the indictments were filed just days before his son was scheduled to appear in a debate with the other Republican presidential candidates.\nHoward said the case will not change the way campaigns operate and suggested prosecutors may have overreached on the charges.\n“It’s a matter of the Department of Justice taking a look at what’s going on and treating it for what it is and not over-treating it,” he said.", "external_links": [], "published": "2015-10-22T16:28:00.000+03:00", "crawled": "2015-10-23T01:50:43.062+03:00", "highlightTitle": ""}