{"organizations": [], "uuid": "2e1ffe84b02f6c8179474ca4a3efefb868c4eef7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jpupdates.com", "main_image": "", "site_section": "http://jpupdates.com/feed/", "section_title": "JP Updates | Breaking News NYC, Jewish Political News & Updates", "url": "http://jpupdates.com/2015/10/16/nyc-rallies-to-support-israel-amid-deadly-attacks/", "country": "US", "title": "NYC Rallies to Support Israel Amid Deadly Attacks", "performance_score": 0, "site": "jpupdates.com", "participants_count": 1, "title_full": "NYC Rallies to Support Israel Amid Deadly Attacks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:45:00.000+03:00", "replies_count": 0, "uuid": "2e1ffe84b02f6c8179474ca4a3efefb868c4eef7"}, "author": "Ryan Haas", "url": "http://jpupdates.com/2015/10/16/nyc-rallies-to-support-israel-amid-deadly-attacks/", "ord_in_thread": 0, "title": "NYC Rallies to Support Israel Amid Deadly Attacks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Photo credit: Reuters | Mike Segar \nIn light of violent, deadly attacks in Israel, roughly 200 people gathered in New York City on Thursday to show support for Israel. \nThe rally was held across the street from Consulate General of Israel in New York, where large crowds chanted, “We stand with Israel.” Israeli flags were also waved, along with signs reading “Israel we are with you.” \nRabbi Avi Weiss, who organized the rally on behalf of the Coalition for Jewish Concerns-AMCHA, told The Jerusalem Post that Jews were being murdered just because they are Jews in Israel. \n“And this is the time to cry out and say enough is enough is enough,” he said. “And those who are silent like our own government that is much too silent, the governments of the world, silence is complicity.” \n“For me it’s about showing solidarity with Israel and the people who are under terrorist attacks, to show solidarity,” said Talia Friedman, a supporter at the rally. “Especially in New York where we understand what it’s like to be a victim of terror. We are here to say we are sorry for what you are going through and we hope there is a peaceful resolution.” \nViolent attacks over the past two weeks have resulted in more than 30 Palestinian and seven Israeli deaths. The Palestinian dead include 10 knife-wielding assailants, police said, as well as children and protesters shot in violent acts. \nSome attendees of the rally dismissed the biased reporting about the violence in Israel. \n“A terrorist is a terrorist, whether it’s a terrorist who is flying a plane into the World Trade Center or whether it’s somebody walking up to somebody else and putting a screwdriver into them, or a knife, or some other instrument, really just because of who they are,” Joshua Feldman said. “That’s terrorism and that needs to be reported exactly the same way. Here in the US, if we were to report on the current activities going on in Israel the way we did back on September 11, the way it would look would be a bunch of terrorists were hurt flying into the Trade Center.” \nU.S. higher-ups suggested Israel may have used excessive force to combat Palestinian stabbings. \nPrime Minister Benjamin Netanyahu, instead, reiterated that using legitimate force was necessary, and that any other country would do the same to deal with “people wielding knives, meat cleavers, axes, trying to kill people on the streets.” \nDefense Minister Moshe Yaalon accused Washington of “misreading” the Israeli-Palestinian conflict, suggesting the shooting of knife-wielding Palestinians was merely for self-defense purposes. Even Public Security Minister Gilad Erdan called the U.S. remarks “foolish.” \nRabbi Weiss went on to explain what he would like to see from his president regarding the outpour of violence in Israel. \n“I would like to see the president himself speak out much more often and with much more force about the horror of American citizens,” he said. “Rabbi Henkin, who was murdered, he was driving in his car with his wife, he is an American citizen. I don’t feel, I don’t feel that sense of pain coming from the White House. And I don’t feel it from a block away, from the United Nations. The world is silent.” \nThe recent violence was triggered in part by Palestinians’ anger over what they see as increased Jewish \nThe violence has been triggered in part by Palestinians’ anger over what they see as increased Jewish intrusion on Jerusalem’s al-Aqsa mosque site, Islam’s holiest spot outside Saudi Arabia, and is also reverred by Jews as the location of two destroyed biblical Jewish temples. Print Friendly 10/16/2015 10:45 AM by Ryan Haas", "external_links": [], "published": "2015-10-16T17:45:00.000+03:00", "crawled": "2015-10-16T17:46:49.183+03:00", "highlightTitle": ""}