{"organizations": [], "uuid": "95a4dcf89d7edc47d2cbbafa5c161e1a7d46633f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-243232dd952f8484cde03df830914b20.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/trump-builds-team-of-rivals-former-backers/article/2573814?custom_click=rss", "country": "US", "title": "Trump builds team of rivals' former backers", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Trump builds team of rivals' former backers | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:52:00.000+03:00", "replies_count": 0, "uuid": "95a4dcf89d7edc47d2cbbafa5c161e1a7d46633f"}, "author": "Gabby Morrongiello", "url": "http://www.washingtonexaminer.com/trump-builds-team-of-rivals-former-backers/article/2573814?custom_click=rss", "ord_in_thread": 0, "title": "Trump builds team of rivals' former backers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For all his criticism of the Bush family, Arizona Sen. John McCain and other GOP foes, Donald Trump sure has an affinity for the individuals who once supported them.\nThe Republican presidential front-runner, still leading the pack in the Washington Examiner Power Rankings, has been beefing up his ground game in early voting states since mid-September. Just this month, his campaign appointed five new state directors from Southern states to the Midwest.\n\"We will continue to build out a substantial campaign team that allows us to take our message across the country and continue to share my vision to Make America Great Again,\" Trump said Friday, in a statement announcing the addition of state directors in Alabama and Illinois.\nAmong Trump's newest campaign aides, several have one thing in common.\n  NY Times hails Hillary's honed debate skills Report recounts how Clinton showed early in life as a \"dutiful student\" her supposed skill for debate.\nBy Becket Adams • 10/09/15 3:40 PM From Florida State Director Karen Giorno to the self-employed attorney running Trump's campaign in Illinois, most of the billionaire's latest hires have worked for the targets of his antagonism.\nOne of the leading victims of Trump's attacks has been former Florida Gov. Jeb Bush and his father and brother, Presidents George H.W. Bush and George W. Bush. The outspoken billionaire has blasted George W. Bush on Twitter and was booed at the second Republican debate when he criticized the former Texas governor.\n\"Your brother and your brother's administration gave us Barack Obama, because it was such a disaster, those last three months, that Abraham Lincoln couldn't have been elected,\" he said to Jeb during the debate.\nA handful of Trump's newest state directors, however, once supported or served the 43rd President.\nCorbin Casteel, who now leads Trump's campaign operation in Texas, previously led a Southern field team for the Republican National Committee during Bush's re-election campaign in 2004; South Carolina state Rep. Jim Merrill, head of Trump's campaign in the Palmetto State, contributed $2,000 to Bush's re-election committee in 2004, according to Federal Election Commission records; and Kent Gray, the latest Trump appointee to oversee the candidate's ground game in Illinois, periodically joined Bush on the campaign trail throughout his bid for the White House in 2000, and later accompanied Bush on several international trips during his presidency.\nAlso from the Washington Examiner Chaffetz as speaker could revive Internet tax Americans for Tax Reform president Grover Norquist sent a letter to lawmakers singling Chaffetz.\nBy Rudy Takala • 10/09/15 4:29 PM According to his company website , Gray also worked for McCain for a brief period of time in 2007 before joining former Alaska Gov. Sarah Palin's team for the RNC, Vice Presidential Debate and Election Night in 2008. Trump set off a wave of controversy earlier this summer for comments he made about McCain's war hero status.\n\"He's all talk and he's no action,\" Trump later said of the Arizona senator.\nOther current or former presidential candidates previously served by Trump campaign staffers include former libertarian firebrand and former Texas Congressman Ron Paul and former Pennsylvania Sen. Rick Santorum.\n\"Few people take Ron Paul seriously and many of his views and presentation make him a clown-like candidate,\" Trump reportedly said of Paul after he skipped a presidential forum hosted by the billionaire in 2011. That same year, Trump was met with a mixture of applause and boos upon suggesting Paul \"cannot get elected\" during a speech at the annual Conservative Political Action Conference.\nThis election cycle, the New York businessman has made Paul's son, Kentucky Sen. Rand Paul, a frequent target of his criticism. He's called him a \"loser\" and claimed on Twitter that the fellow GOP contender reminds him of \"a spoiled brat without a properly functioning brain.\"\nAlso from the Washington Examiner Ryan leaning yes? 'I think he feels a responsibility to do it.' The job of House speaker takes Ryan out of his comfort zone of numbers and charts.\nBy Susan Ferrechio • 10/09/15 2:58 PM Though Trump's New Hampshire state director, Matt Ciepielowski, is not affiliated with the Kentucky senator's presidential campaign, the Quinnipiac University graduate once worked as a field organizer in Louisiana for Ron Paul's 2012 bid for the White House.\n\"The Paul campaign kind of made me start thinking about politics differently,\" Ciepielowski said during a radio interview in 2011.\nUnlike his incessant bickering with Paul and Bush, Trump has, for the most part, left Santorum alone — presumably because of the appreciation Santorum's shown Trump for his help in elevating the issue of illegal immigration.\n\"I think Donald points to a very important thing, which is we have a serious problem of illegal immigration in this country that is undermining American workers: by flattening out wages and lowering the standard of living for those in the U.S. legally,\" the Pennsylvania senator during an appearance on CBS News in July.\nChuck Laudner, who managed Santorum's campaign in Iowa in 2012, is now at the helm of Trump's operation in the Hawkeye State.\nOne of Trump's latest hires, Karen Giorno, who served as director of external affairs for Florida Gov. Rick Scott from 2011-2012, was appointed by Trump's camp in early October to lead his organization in Florida. Trump, who prides himself on his business experience and \"tough guy\" demeanor, has previously blasted Scott for lacking sufficient negotiating skills.\n\"Wow, looks like [Scott] wants to hand over the State of Florida to Seminole Indians [with] the terrible gaming deal in talks,\" the GOP front-runner tweeted in 2014.\n\"Thought [Scott] was a better negotiator–the Seminole Indian gaming deal is a disaster for Florida,\" he added. \nTrump currently has staff on the ground in 11 states, including the early primary and caucus states of Iowa, New Hampshire and South Carolina. His campaign says that number will continue to expand throughout the primary season.\nA spokeswoman for Trump's campaign did not return the Washington Examiner's request for comment.\nTop Story Book: Valerie Jarrett got Joe Biden 'psychiatric help' for 2016 Ed Klein's book claims   hard for Biden to enter the race.\nBy Eddie Scarry • 10/09/15 1:43 PM", "external_links": [], "published": "2015-10-09T19:52:00.000+03:00", "crawled": "2015-10-10T01:02:35.109+03:00", "highlightTitle": ""}