{"organizations": [], "uuid": "79435c12c798d9fc497aafc14112fdd4234efd9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "politicsinminnesota.com", "main_image": "http://politicsinminnesota.com/files/2015/10/WisCourt-Bradley-and-Walker-AP-WEB-200x200.jpg", "site_section": "http://politicsinminnesota.com/feed/", "section_title": "Politics in Minnesota", "url": "http://politicsinminnesota.com/2015/10/walker-taps-conservative-bradley-for-wisconsin-supreme-court/", "country": "US", "title": "Walker taps conservative Bradley for Wisconsin Supreme Court", "performance_score": 0, "site": "politicsinminnesota.com", "participants_count": 1, "title_full": "Walker taps conservative Bradley for Wisconsin Supreme Court", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T19:14:00.000+03:00", "replies_count": 0, "uuid": "79435c12c798d9fc497aafc14112fdd4234efd9a"}, "author": "The Associated Press", "url": "http://politicsinminnesota.com/2015/10/walker-taps-conservative-bradley-for-wisconsin-supreme-court/", "ord_in_thread": 0, "title": "Walker taps conservative Bradley for Wisconsin Supreme Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / News Nation & World / Walker taps conservative Bradley for Wisconsin Supreme Court Judge Rebecca Bradley speaks to journalists Friday after Gov. Scott Walker, right, announced her appointment to the Wisconsin Supreme Court. (AP photo: Wisconsin State Journal, John Hart) Walker taps conservative Bradley for Wisconsin Supreme Court By: The Associated Press October 9, 2015 0 \nMADISON, Wis. — Gov. Scott Walker appointed conservative-backed appellate judge Rebecca Bradley to the Wisconsin Supreme Court on Friday, giving her the advantage of incumbency heading into the spring election. \nWalker introduced Bradley at a news conference Friday, formalizing a widely expected move first reported by The Associated Press earlier in the day. It’s the third time Walker has appointed Bradley to a judicial opening in three years. \nShe will complete the nine months remaining in the term of Justice Patrick Crooks, who died last month. Crooks, 77, had not been seeking a third term, and it is his seat that is coming up for a full 10-year term next spring. \nBoth Bradley and Walker said the appointment should not affect her run for the full term. Neither of the two others running against Bradley next spring — 4th District Appeals Court Judge JoAnne Kloppenburg and Milwaukee Circuit Judge Joe Donald — applied for the vacancy. \n“I think when the voters are evaluating judicial candidates they look less at who’s appointed them and they look at their record on the bench, how they conducted their campaigns and what their qualifications and experiences are,” Bradley said at the news conference announcing her appointment. “I don’t think they look at who has appointed that judge or justice.” \nWalker, whose approval rating in a Marquette University Law school poll released last month hit a record low of 37 percent, said voters will evaluate Bradley based on how she does as a Supreme Court justice between now and the April 5 election. \n“Whether you like me, dislike me, or are somewhere in between, even for those people who are ardent supporters of mine, they shouldn’t be looking at the appointment,” Walker said. “What they should be looking at is is this the best person qualified to be on the Wisconsin Supreme Court.” \nThe Supreme Court election is expected to turn into a referendum on Walker, given that he’s now appointed Bradley to the bench three times. Kloppenburg hit that note in her statement reacting to the appointment. \n“The choice in this campaign could not now be clearer: Governor Walker’s choice or the people’s choice,” she said. “I am running to be the people’s choice for Supreme Court.” \nDonald’s spokesman Garren Randolph called Bradley an ideologue, a “loyal ally” of Walker and a “purely partisan” appointee. \n“Judge Rebecca Bradley’s unprecedented rise isn’t about her qualifications or experience,” Randolph said. \nKloppenburg, whose campaign is backed by liberals, previously ran for the Supreme Court in 2011 and lost to Justice David Prosser. Donald argued that he would be the most nonpartisan choice for the high court. \nDemocrats also criticized Walker’s pick. \n“This power grab sets a terrible precedent and doesn’t pass the smell test,” said Sen. Jen Shilling, the Democratic minority leader. \nRep. Peter Barca, Democratic minority leader in the Assembly, said, “I question why a judicial candidate would want to be so closely linked to a governor with a 37 percent approval rating.” \nWalker said he chose Bradley over two other applicants because he felt she was the best person possible for the opening. Dane County Circuit Judge Jim Troupis, appointed to the post by Walker in May, and Madison attorney Claude Covelli also applied for the appointment. \nWalker first appointed Bradley, 44, to the Milwaukee County Circuit Court in 2012. She won election in 2013. In May, Walker named her to the state appeals court. Bradley is a native of Milwaukee and currently lives in Wauwatosa. She graduated from Marquette University and obtained her law degree from the University of Wisconsin Law School. \nWalker said she the exact timing of when she would be sworn into office and begin working on the Supreme Court, which is scheduled to hear oral arguments in cases Monday, was still being worked out. Share this:", "external_links": [], "published": "2015-10-09T19:14:00.000+03:00", "crawled": "2015-10-09T22:06:21.129+03:00", "highlightTitle": ""}