{"organizations": ["GOP"], "uuid": "543107d971a1b4193a86951e1c5c158e39b50b0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151023122618-jeb-bush-october-21-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/24/politics/jeb-bush-campaign-donald-trump/index.html?eref=rss_politics", "country": "US", "title": "No talk of campaign troubles as Bush tears into Trump", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "No talk of campaign troubles as Bush tears into Trump", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T21:13:00.000+03:00", "replies_count": 0, "uuid": "543107d971a1b4193a86951e1c5c158e39b50b0d"}, "author": "", "url": "http://edition.cnn.com/2015/10/24/politics/jeb-bush-campaign-donald-trump/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "No talk of campaign troubles as Bush tears into Trump", "locations": ["Washington", "South Carolina", "Syria", "Iowa", "Florida", "Daniel Island"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Carson", "Jeb Bush", "Trump", "Donald Trump", "Bush", "Jeb", "Tim Scott", "Ben Carson", "Rudy Giuliani", "Scott", "Trey Gowdy"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> In shadow of campaign shakeup, Bush tears into Trump Updated 2000 GMT (0300 HKT) October 24, 2015 JUST WATCHED Jeb Bush and Donald Trump spar over 9/11 02:20 Story highlights Bush got an enthusiastic reception and delivered one of his strongest campaign performances to date Less than 24 hours before, Bush's campaign announced a major reshuffling of its resources Daniel Island, South Carolina (CNN) If Jeb Bush's campaign is struggling to stay afloat, he didn't show it on Saturday. A day after slashing salaries and cutting campaign staff, the former Florida governor got an enthusiastic reception and delivered one of his strongest campaign performances to date. He tore into Donald Trump repeatedly and roused some in the crowd to their feet on answers about the military and foreign policy. Bush took part in a town hall series hosted by South Carolina Sen. Tim Scott, drawing an audience of more than 500 people, about twice the number Bush normally attracts on the campaign trail. Rep. Trey Gowdy, who led the daylong Benghazi hearing on Thursday, also headlined the event and joined Scott on stage to help ask questions. Bush got one of his biggest responses from the crowd when he lamented the state of politics in Washington and argued that Trump is not the kind of leader that could break through the gridlock. Read More \"If this election is about how we're going to fight to get nothing done, then ... I don't want any part of it. I don't want to be elected president to sit around and see gridlock just become so dominant that people literally are in decline in their lives. That is not my motivation,\" he said. \"I've got a lot of really cool things I could do other than sit around, being miserable, listening to people demonize me and me feeling compelled to demonize them. That is a joke. Elect Trump if you want that,\" Bush added. Less than 24 hours before, Bush's campaign announced a major reshuffling of its resources, saying it was cutting some salaries by 40% and letting go of some people in order to shift more focus on the campaign's ground game in the early voting states. It was a big move by Bush's campaign as he's fighting to regain the lead after rivals Trump and Ben Carson have held onto the top spots in the polls for weeks. Speaking to reporters before the event, Bush assessed the changes as normal adjustments that campaigns need to make, citing the \"new phenomenon\" of \"the rise of candidates that have had no practical experience in politics\" as a reason for his decision. \"In business, when you anticipate how things are going to be, you anticipate them, you don't wait for them,\" he said. As for the whisper campaign that he's falling apart, Bush was more frank. \"Blah blah blah, Blah,\" he said. \"That's my answer.\" He went on to point to other candidates like Rudy Giuliani and Hillary Clinton in 2008, who were expected to take their parties' nominations but failed in the end. Pressed with questions about Trump, especially the real estate mogul's recent slipping in the polls in Iowa to Carson, Bush grew tired of talking about his rival. \"I'm past Donald Trump,\" he said. But that certainly wasn't true in the town hall a few minutes later, when Bush repeatedly needled Trump, gaining applause and laugh lines for going after the candidate who's currently dominating the GOP field in South Carolina. According to a recent CNN/ORC poll , Trump came in first at 36%. Bush had 6%. \"There's a lot of big personalities on the stage. A lot of them. One in particular,\" he said, before throwing his arms up to mock one of Trump's favorite words. \"Huge, huge, huge!\" On a more serious note, he blasted Trump for saying that he would send refugees back to Syria if he becomes president. \"If we don't stand for people that will die because of their faith, wow, we have really lost our way. I think Donald Trump is dead wrong on this, and I am right,\" Bush said, before adding that he's anticipating a Twitter attack from Trump now that he's said that. It was Bush's second trip to South Carolina this month, a state that he has already predicted he'll win.\"You can take it to the bank,\" he said during a stop here last month. He opened up his third office in the state recently and has eight paid staffers on the ground, with plans to add more. It's a state that was good to his brother's run for president in 2000 and shares a border with the state that Bush governed for eight years. The audience often broke out into cheers, whistling and occasionally some people stood up while applauding Bush's answers. When he first stepped on stage, a woman from the crowd yelled out: \"We love you, Jeb!\" She was followed by a man across the room: \"And your brother!\" \"And my mother,\" Bush added. As he was shaking hands afterward, he was swarmed by voters, with many of them telling him to hang in there. \"Don't give up,\" one voter pleaded with Bush. \"We are for you. Don't give up.\" Another told Bush that his weight loss -- he's dropped more than 40 pounds in the past year due to his the paleo diet -- was looking good on him. \"I'm svelte,\" Bush replied, with a stride in his step. \"I'm a fighting machine.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-10-24T21:13:00.000+03:00", "crawled": "2015-10-24T22:02:33.123+03:00", "highlightTitle": ""}