{"organizations": [], "uuid": "ab19a310cb85f1427a9edc4f93a22f267459c441", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/b7/9f/0bcdda764f9cafbf653ef5bd7a2a/151004-john-kasich-gty-629jpg.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/john-kasich-beltway-republicans-214365", "country": "US", "title": "Slumping Kasich seeks Beltway boost", "performance_score": 1, "site": "politico.com", "participants_count": 1, "title_full": "Slumping Kasich seeks Beltway boost - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:11:00.000+03:00", "replies_count": 0, "uuid": "ab19a310cb85f1427a9edc4f93a22f267459c441"}, "author": "Anna Palmer", "url": "http://www.politico.com/story/2015/10/john-kasich-beltway-republicans-214365", "ord_in_thread": 0, "title": "Slumping Kasich seeks Beltway boost", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "John Kasich is turning to his Washington roots for a badly needed campaign boost.\nFacing disappointing poll numbers and the hard slog of raising money in a crowded field, the Ohio Republican is tapping the relationships he built over nearly two decades in Congress to help raise the tens of millions of dollars he'll need to remain in the 2016 presidential race. For all his talk of turning around the Buckeye State on the campaign trail, Kasich is a creature of Washington and has drawn a slew of former colleagues and K Streeters who have signed onto his steering committee to give him a financial lift.\nKasich is returning to the D.C. area Monday for a two-day fundraising tour de force, holding a money event in Virginia followed by a young professionals fundraiser and reception and dinner Tuesday for max-out supporters. Kasich also plans to attend private meetings with GOP senior aides and lawmakers on Capitol Hill and to headline a town hall in Richmond, Va.\nPoll: Trump keeps lead in Iowa and N.H., but it shrinks By Elena Schneider\nThe Washington swing, just days after the third quarter fundraising deadline, comes as Kasich is facing questions about his long-term viability in the GOP primary. After a strong first debate performance and subsequent surge, he's been hobbled lately by falling poll numbers, which has made raising cash even harder.\nKasich's Beltway strategy could backfire with the widespread anti-establishment sentiment that has fueled breakthrough Republican candidates like Donald Trump and Ben Carson.\nStill, the importance of raising enough money — even if it comes from Washington — was underscored just weeks ago when Wisconsin Gov. Scott Walker and Texas Gov. Rick Perry dropped out of the GOP race. Both failed to raise enough to keep their official campaign operations running.\n\"He hasn't been at it as long so he hasn't raised as much money,\" said Ohio Republican Rep. Pat Tiberi, co-chair of Kasich's steering committee. \"That obviously is a challenge, but he has strengths, too, that are natural. Nobody is a better retail politician that I have ever seen in my life.\"\nKasich's campaign did not respond to a request for comment.\nThe former House Budget Committee chairman's early fundraising chops will be on display in mid-October when the latest campaign finance reports are made public.\nNew Day for America — the super PAC supporting Kasich — raised more than $11 million before he officially announced his bid. The group doesn't have to report its next haul until January. New Day for America spokeswoman Connie Wehrkamp said the group's \"fundraising continues to be steady.\"\nChristie touts his 'outsider' status By Elena Schneider\nNew Day for America has already aired an ad touting Kasich's experience in New Hampshire, a vitally important primary for the Ohio governor. The group plans to double its buy in October, bringing the total amount spent by New Day for America and New Day Independent Media Committee to $6.5 million from July through the end of October, according to a source familiar with the effort. The super PAC is building out its grassroots infrastructure with a staff in New Hampshire and has also had volunteer call operations in Ohio making contacts with voters in the Granite State since mid-August.\nKasich, who is in fourth place in the ClearPolitics Granite State poll with 9 percent, was endorsed Friday by former Sen. Gordon J. Humphrey of New Hampshire.\n“Right now we’re focusing on raising money in the campaign fund and we think we are doing a good job,” said Bob Rusbuldt, co-chair of Kasich's steering committee. “The governor is in this for the long haul and we’re going to have the resources to do that.”\nKasich could use a cash influx to drop ads in key states and ensure he’s on the main stage at the next debate. He needs to be above 2.5 percent in designated national polls to qualify for CNBC's primetime debate on Oct 28; he's currently at 4 percent, according to a POLITICO analysis. The Ohio Republican has been spending an increasing amount of time in Iowa, hoping to draw fiscal conservatives into his camp.\nRusbuldt, CEO of the Independent Insurance Agents & Brokers of America, and Tiberi, a former Kasich staffer, are leading the Ohio Republican's roughly 50-person steering panel. It is filled with a retinue of Washington politicos, including former Reps. Bob Walker (R-Pa.), Pete Hoekstra (R-Pa.), Dan Burton (R-Ind.), Spencer Bachus (R-Ala.), Jim Walsh (R-N.Y.) and Chris Shays (R-Conn.).\n\"It's been literally almost like having a fire hose to the mouth because there are so many people interested in helping out,\" Rusbuldt said.\nThe operation has been tasked with everything from fundraising, to recruiting current and former lawmakers to endorse Kasich, to grassroots support and surrogate speaking. The steering panel has had face-to-face meetings with Kasich, holds conference calls and communicates regularly through email.\nWhile Kasich hasn't yet received an endorsement from Sen. Rob Portman (R-Ohio), he has support from several former Ohio Republican lawmakers including Mike Oxley, Deborah Pryce and Dave Hobson.\n\"I was amazed by some of the people, the southern folks that we've recruited,\" said Rep. Steve Stivers (R-Ohio), who added he has been working to recruit more southern lawmakers in the House Republican Conference. \"His appeal as a fiscal hawk is bigger and stronger than I would have thought it would be because people understand our No. 1 problem in this country is we are spending money that we don't have.\"\nFormer Rep. Tom Davis (R-Va.), one of Kasich's former colleagues in Congress, is planning to help out during the Ohio governor’s D.C. swing. Davis, who is expected to attend the Virginia fundraiser, said he thinks Kasich's appeal comes from his deep experience as a governor and member of Congress.\nThere are a number of K Streeters and other former members co-hosting Kasich's large-dollar fundraiser Tuesday at Capitol Hill favorite Acqua al 2. Aric Newhouse of the National Association of Manufacturers, Sue Andrew of Union Pacific, Adam Francis of Ernst and Young and John Downs Jr., head of the National Confectioners Association, are among those listed on the invite.\n\"I think he's got a lot of appeal now,\" Stivers said. \"It's a long way between now and the convention.\"\n<div", "external_links": ["https://youtu.be/762wogDccxg"], "published": "2015-10-05T13:11:00.000+03:00", "crawled": "2015-10-05T13:15:04.789+03:00", "highlightTitle": ""}