{"organizations": [], "uuid": "113ea80790a85ce0537dcca5b90b9895a8278e76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/58/38/49a8ed244ad5aa5308a6b1530108/151006-hillary-clinton-book-gty-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/hillary-clinton-gag-gift-memoir-214491", "country": "US", "title": "Hillary Clinton gag gifts her GOP rivals with copies of her memoir", "performance_score": 1, "site": "politico.com", "participants_count": 5, "title_full": "Hillary Clinton gag gifts her GOP rivals with copies of her memoir - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T15:01:00.000+03:00", "replies_count": 5, "uuid": "5bc4fa7ea4605c10b69875cecae9df35820e650f"}, "author": "Eliza Collins", "url": "http://www.politico.com/story/2015/10/hillary-clinton-gag-gift-memoir-214491#post-0", "ord_in_thread": 0, "title": "Hillary Clinton gag gifts her GOP rivals with copies of her memoir", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hillary Clinton got fed up with her Republican rivals criticizing her record as secretary of state, so she had a solution — send each of them copies of her book. “I’m trying to be a good fellow candidate and give them some help,” the Democratic front-runner said, during a rally in Iowa. Apparently each GOP candidate (except for Jim Gilmore) not only got their own copy of \"Hard Choices,\" her 2014 memoir, they also got a personalized letter.\nClinton, on a bit of a joke spree after her appearance on \"Saturday Night Live\" last weekend, got in another jab in Iowa, deadpanning that there are so many candidates on the other side, “they could have a book club.”\nThe letter soon made the rounds on Twitter. It read. \"I understand that you and your fellow Republican candidates for president were questioning my record of accomplishments at your last debate, so I thought you might enjoy reading my book, Hard Choices.\"\nThe note continued, \"From working to restore America's standing in the world to bringing crippling sanctions to Iran to negotiating a ceasefire in Gaza, please enjoy all 596 pages of my time as secretary of state.\"\nShe signed the letter, \"With best wishes, I am Sincerely yours, Hillary Rodham Clinton.\"\nGOP candidates got in on the game, too.\nTed Cruz responded to a tweet about Clinton's prank. \"We’ll gladly return the favor and send @HillaryClinton ’s campaign #ATimeForTruth because, well...\"he tweeted .\nBobby Jindal used it to play up his support for defunding Planned Parenthood. \"I'll make a deal with you @HillaryClinton , if you watch these videos centerformedicalprogress.org/cmp/investigat… , I'll read your book. -Bobby\" he tweeted .\nClinton’s gag gifts aren’t the only ones of the season.\nOn Monday, Donald Trump sent a case of bottled water and towels to Sen. Marco Rubio’s Washington office as part of an ongoing feud between the two candidates.\nTrump — who has frequently insulted Rubio’s sweating during the second GOP debate — sent him the case with the note, \"Since you’re always sweating, we thought you could use some water. Enjoy!”\nRubio infamously grabbed for a bottle of water and took a big gulp midway through his Republican rebuttal to the 2013 State of the Union address.\n<div", "external_links": ["https://twitter.com/search?q=%23ATimeForTruth", "https://twitter.com/HillaryClinton/", "https://twitter.com/tedcruz/status/651527725245710336", "https://twitter.com/BobbyJindal/status/651528201772994560", "http://t.co/TBLx9EOy8N", "http://www.centerformedicalprogress.org/cmp/investigative-footage/"], "published": "2015-10-06T15:01:00.000+03:00", "crawled": "2015-10-07T03:34:32.803+03:00", "highlightTitle": ""}