{"organizations": [], "uuid": "50dcbb28cd176a67624b3cd8256fbea458dad863", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2392150!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/maniscalco12e-1-web.jpg", "site_section": "http://www.nydailynews.com/news/politics/index.html", "section_title": "New York, U.S. Politics, Columnists &amp; Political Cartoons - NY Daily News", "url": "http://www.nydailynews.com/opinion/anthony-maniscalco-don-times-square-square-article-1.2392151", "country": "US", "title": "Anthony Maniscalco: Don’t make Times Square square", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Anthony Maniscalco: Don’t make Times Square square - NY Daily News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "50dcbb28cd176a67624b3cd8256fbea458dad863"}, "author": "NEW YORK DAILY NEWS", "url": "http://www.nydailynews.com/opinion/anthony-maniscalco-don-times-square-square-article-1.2392151", "ord_in_thread": 0, "title": "Anthony Maniscalco: Don’t make Times Square square", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Courtesy of Times Square Alliance A whole lot of zones for one little square What Michael Bloomberg hath wrought, could Elmo, Spiderman and a bunch of desnudas put asunder?\nIt was our former mayor who looked over the chaos of Times Square — where cars and pedestrians messily clashed — and transformed it into one of the city’s great public spaces for hanging out, rather than speeding through, a blocks-long pedestrian-friendly plaza made of tables and chairs.\nDespite loud protests by the taxi industry, car owners, delivery trucks and some local businesses fearing the unknown, Bloomberg and his transportation commissioner, Janette Sadik-Khan, dug in and succeeded in creating the plaza, which has since been replicated in Herald Square and other parts of the city.\nBut now the plaza is at the heart of another intense controversy, a victim of its own success amid complaints that costumed (and uncostumed) performers too aggressively panhandle for “tips.”\nLet’s not blame the victim. Order matters, yes. But so do the strange and unexpected encounters of a “city invincible” once celebrated by Walt Whitman in his poems about New York.\nWith Mayor de Blasio intent to contain what is now broadly perceived as a quality-of-life problem, City Hall now proposes to transform the crossroads into “Times Square Commons,” designating special “activity zones” for panhandling by costumed characters, not to mention the topless women who pose for pictures with curiously willing tourists. Those zones will be segmented from “civic zones” (for pre-authorized public programming somehow considered less irksome) and “flow zones” (for orderly pedestrian movement).\nThe arrangement has some real merits. But we diminish the publicness of urban space when we zone it too much, and that may be too big a price to pay for commercial success in Times Square.\nLet me confess my misgivings about the rampant commercialization of New York City’s open spaces. Converting publicly-owned pedestrian plazas into privately-stocked food courts, where too few people can afford lobster rolls and designer tacos, is hardly a tour de force for free expression under the First Amendment.\nAnd I think we ought to commend the efforts of stakeholders who pushed back after NYPD Commissioner Bill Bratton quipped that the Times Square plaza be “dug up” and returned to cars — and are instead working to preserve some semblance of a public square there.\nThe urbanist Marshall Berman wrote that public space is “sloppy”; that sometimes, we just have to let it be. Because it is the frenetic mix of uses and cacophony of public space that makes sharing it so special. Public space is about being authentic. It's about spontaneity and the negotiation of surprising relationships between diverse people in a society that stubbornly clings to a democratic way of life.\nSure, the activity zones are likely to pass constitutional muster under a legal doctrine that gives the authorities broad power to regulate the “time, place and manner” of speech, though not its content.\nMy bigger fear is that the proposed zones will inhibit mixed uses inside one of the city’s most important public spaces, no less among people of different stripes and persuasions, who are united by their desires to be outside and seen and heard by fellow New Yorkers and visitors.\nMaybe the Times Square Commons plan will result in fewer annoyed tourists and passersby. More dubious to me, however, is the political impact of imposing suburban-style use zones on a publicly owned plaza.\nWe have seen what single-use zones have resulted in outside of the city. The only truly shared public spaces are shopping malls, which have been rendered sterile and uninviting by bad business decisions and legal precedents that choked off speech inside.\nSuburbanites now increasingly stay home and click their way to consumption. In search of authenticity and opportunities to “mix it up,” they’ve also started to re-urbanize and move back to the city, their civic nerve center.\nSadly, too much of that nerve center now requires paid admission. The bonus plaza program that has produced a wealth of privately owned public spaces in return for generous air rights has also led to attempts to stifle free expression and engagement by citizens who want to share space without having to pay for it all the time.\nAs the city moves forward on Times Square Commons, let’s hope it shows trust in people’s choices and abilities to use their public spaces as they see fit — to bargain and share in freedom.\nThis is an important caution, rather than a counter-proposal. At least when it comes to the desnudas, winter may take care of the rest.\nManiscalco, an adjunct associate professor at CUNY, is the author of the upcoming “Public Spaces, Marketplaces and the Constitution.”", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-11T12:36:30.353+03:00", "highlightTitle": ""}