{"organizations": [], "uuid": "eead1e7aaa65f8bf7f834636d3200ef6dbdee0b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/10/22/lginsider22-art-g8d13q00q-1government-insider.jpg", "site_section": "http://www.dispatch.com/content/syndication/news_ohio_politics.xml", "section_title": "Political News - Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/22/government-insider-columbus-council-candidate-on-trail-after-pause-to-give-birth.html", "country": "US", "title": "Local Government Insider: Columbus council candidate on trail after pause to give birth", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Local Government Insider: Columbus council candidate on trail after pause to give birth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:42:00.000+03:00", "replies_count": 0, "uuid": "eead1e7aaa65f8bf7f834636d3200ef6dbdee0b6"}, "author": "Lori Kurtzman", "url": "http://www.dispatch.com/content/stories/local/2015/10/22/government-insider-columbus-council-candidate-on-trail-after-pause-to-give-birth.html", "ord_in_thread": 0, "title": "Local Government Insider: Columbus council candidate on trail after pause to give birth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Dispatch public affairs team talks politics and tackles state and federal government issues in the Buckeye Forum podcast. Your Right to Know By Lori Kurtzman & Holly Zachariah The Columbus Dispatch • Thursday October 22, 2015 5:42 AM \nThings have been moving at warp speed for Columbus City Council candidate Elizabeth Brown. \nIn the past three months, the Democrat and daughter of U.S. Sen. Sherrod Brown has quit her job to run for public office, moved into a new house, and — on Saturday — gave birth to her first child. \nBaby Carolyn and the 31-year-old Brown are doing fine, City Hall Reporter Lucas Sullivan reports. \nChildbirth didn’t really slow her down, though: She attended a city-council candidates forum on Tuesday, just three days later. \nBrown is one of a dozen candidates running for five council seats who showed up for the event at the Bosco Center. She was there for about an hour and answered all the questions anyone had for her about her campaign. Then Carolyn got hungry, and that was that. \n“Last night, I knew that a happy baby, healthy mom and supportive husband meant I could take an hour to be present at the forum,” Brown told Sullivan in a text message on Wednesday. \nBrown left her job in Columbus’ development department in August after agreeing to replace former council member Michelle M. Mills on the Nov. 3 ballot. \nMills stepped off the ballot and away from her council seat after her records were subpoenaed by the U.S. Department of Justice. The Dispatch reported at the time of her resignation that Mills was facing questions about whether she accepted free dinners or gifts. • • • \nIf Ahilan Kaniah were the suspicious type, he might think that Grandview Heights’ new smoking ban was aimed at him. \nAfter all, his is one of only a few places in the suburb that sell cigarettes, Reporter Earl Rinehart points out. It’s not as if it’s a giant gas station at Grandview Avenue and Dublin Road. It’s Alexander Drive Thru at W. 1st Avenue and Copeland Road. \nYou can pick up groceries and beer there, along with cigarettes and the like. \n“It’s a bad idea,” Kaniah said of the new ordinance that prohibits the sale of tobacco-related products to anyone younger than 21. The city council passed the ordinance on Monday . \nKaniah, who has owned the market since 2009, said his 19- and 20-year-old customers tell him they’ll just cross over the line to Columbus to buy their smokes. \n“They say, ‘It’s just hurting you,’  ” Kaniah said. “They’re right.” \nHow big a bite, he won’t know for a couple of months. The ban doesn’t take effect for 30 days. \nBesides cigarettes, cigars and tobacco products such as rolling papers, the ordinance bans the sale of e-cigarettes and liquid nicotine to under-21 customers. \n“I think they’re doing that in case the marijuana passes,” Kaniah said. \nState Issue 3 on next month’s ballot would legalize the sale and use of marijuana grown at 10 sites in Ohio.", "external_links": [], "published": "2015-10-22T12:42:00.000+03:00", "crawled": "2015-10-22T14:57:26.784+03:00", "highlightTitle": ""}