{"organizations": [], "uuid": "5e90ba9da5cfb116d1d6c21346a903d48d3dcaf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00211/rotorua-new-zealand-hosts-tppa-information-event.htm", "country": "US", "title": "Rotorua (New Zealand) hosts TPPA information event", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Rotorua (New Zealand) hosts TPPA information event", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T04:03:00.000+03:00", "replies_count": 0, "uuid": "5e90ba9da5cfb116d1d6c21346a903d48d3dcaf4"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00211/rotorua-new-zealand-hosts-tppa-information-event.htm", "ord_in_thread": 0, "title": "Rotorua (New Zealand) hosts TPPA information event", "locations": ["Rotorua", "New Zealand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rotorua (New Zealand) hosts TPPA information event Tuesday, 13 October 2015, 2:03 pm \nMedia release: 13 October 2015Issued by: Rotorua/Te Arawa TPPA Action Group \nRotorua (New Zealand) hosts TPPA information event on October 18 \nOn Sunday October 18, the Rotorua/Te Arawa TPPA Action Group is hosting a panel of speakers from all over the country to speak out about what they know about the Trans Pacific Partnership Agreement. \nSpeakers are; Professor Jane Kelsey (via Video Feed), Dr Benjamin Pittman, Edward Miller, Fletcher Tabuteau, Catherine Delahunty, Te Ururoa Flavell, Marama Davidson, Annette Sykes, Anjum Rahman and will be hosted by Tihini Grant. \nNga Pukenga Koeke o Te Arawa. (Kaumatua-Maori Elders) will be physically supporting this event on the day and will make their presence known. They may also make a statement. \nMarama Meikle, spokesperson for the Rotorua event said that there was huge concern on how the deal would impact on New Zealander’s and their futures. With any trade agreement their comes a cost and history has indicated and shown us that free trade agreements do not work in our favour because corporates only consider their profit margins and will remove their trade of origin from countries to cheaper places. \nDo we want fair trade or free trade? Free trade is trading freely between nations and fair trade is trading fairly between nations. The TPPA is neither free trade or fair trade because tariffs are still in place in certain countries being Canada, Japan, USA and Mexico. \nI support trade but trade that works in the best interests of all involved and not the interests of a select few and the important thing to note here is the TPPA is corporate driven. \nThe theme of the event is TPPA – Talk Away \"What we DO know”. \nThe Rotorua event follows on from the National Week of TPPA Action held in August lead by It’s our Future, where twenty three cities across New Zealand took part in various forms of action against the TPPA. Rotorua’s TPPA Talk Away event will be live streamed so all New Zealanders, both at home and overseas, will have the opportunity to learn from the knowledge shared. \nTrade minsters of TPPA countries met in Atlanta on 26 September 2015, the agreement was signed in principal on 6 October 2015 by all nations involved in the negotiations. We will still have to wait a few more weeks yet until a public version of the TPPA text is released. \nOnce the text is released it will be ratified by the government unless we do something about it. Once our legislation has been changed to accommodate the requirements of the TPPA then we will have those apparent recourse for redress which means we will have no ability to change it after it’s been signed. Now is the time to take action, we must demand our rights whether it be through physical protest, civil disobedience or boycotts by supporting New Zealand owned, operated and made products and services. \nWhat: Panel Q & A on the TPPA When: 2pm – 5:30pm, 18 October 2015 Where: Tangatarua Marae, Waiariki Institute of Technology, Mokoia Drive, Tihiotonga, Rotorua, New Zealand. \n< Livestream LINK > https://livestream.com/TPPAwalkaway/TPPAtalkaway \nEnds. \nNote: More information on the event and about the speakers can be found on our Facebook event page https://www.facebook.com/events/1682254808659268/", "external_links": [], "published": "2015-10-13T04:03:00.000+03:00", "crawled": "2015-10-13T13:04:58.658+03:00", "highlightTitle": ""}