{"organizations": [], "uuid": "09eb5dbb41a78e50cd4b6f3573218eb59573d0ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww4.hdnux.com/photos/41/60/17/8848367/3/rawImage.jpg", "site_section": "http://www.seattlepi.com/national/us/", "section_title": "U.S.: Politics, Crime, Weather and More - seattlepi.com", "url": "http://www.seattlepi.com/news/us/articleGallery/Iraq-Afghanistan-conflict-heroes-honored-by-6589294.php", "country": "US", "title": "Iraq, Afghanistan conflict heroes honored by namesake ships", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Iraq, Afghanistan conflict heroes honored by namesake ships - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "09eb5dbb41a78e50cd4b6f3573218eb59573d0ba"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/us/articleGallery/Iraq-Afghanistan-conflict-heroes-honored-by-6589294.php", "ord_in_thread": 0, "title": "Iraq, Afghanistan conflict heroes honored by namesake ships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BATH, Maine (AP) — Heroes forged in Afghanistan and Iraq are having their names bestowed on a new generation of warships, joining those whose exploits in World Wars and battles domestic and abroad earned them the distinction of having U.S. Navy vessels christened in their honor.\nMore than a decade after U.S. boots hit the ground in the Middle East, two new destroyers bearing the names of Americans who died there are already in service.\nA third, the future USS Rafael Peralta, named for a Marine killed nearly 11 years ago in Iraq, will be christened Saturday at Bath Iron Works . Peralta was posthumously awarded the Navy Cross for heroism after he covered an insurgent's grenade with his body to protect his fellow Marines.\n\"His legacy will carry on,\" said Ricardo Peralta , who was inspired by his older brother to join the Marines and served in Afghanistan. \"I feel like the USS Peralta holds the spirit of what my brother stood for, and that was for God, for his country, the United States, and for the Marine Corps.\"\nThe Peralta is one of four destroyers named for a serviceman who died in Iraq or Afghanistan.\nThe USS Jason Dunham , named for a Marine killed in 2004 in Iraq, and the USS Michael Murphy , named for a Navy SEAL killed in 2005 in Afghanistan, are already on duty. The future USS Michael Monsoor, named for a Navy SEAL killed in 2006 in Iraq, is also being built at Bath Iron Works.\nBorn in Mexico City, Rafael Peralta came to the United States with his family, attended high school in San Diego and enlisted in the Marines on the same day he received his green card.\nThe guided-missile destroyer bearing his name is one of a handful of U.S. Navy warships to be named for Mexican-Americans, and it's believed by naval historians to be the first to be named for someone actually born in Mexico, according to the Scot Christenson of the U.S. Naval Institute.\nPeralta became one of the most celebrated Marines from the Iraq war for heroism shown in close-quarters combat against insurgents in Fallujah. The sergeant was nominated for the Medal of Honor — the nation's highest military honor — after Marines said he threw himself on a grenade after being shot and wounded on Nov. 15, 2004.\nBut three defense secretaries rejected his nomination after questions about the incident arose, including the possibility of friendly fire, Marines embellishing their account or whether Peralta was conscious at the time. Fellow Marines insisted they saw the mortally wounded Peralta reach for the grenade to protect his comrades.\nPeralta's family is certain he died a hero. Ricardo Rafael has spoken to Marines who told him exactly what they witnessed.\n\"They're still alive today because of my brother,\" he said. \"I could care less about what any politician has to say.\"\nBecoming the namesake for a 510-foot destroyer has eased any lingering family bitterness. His mother, Rosa Peralta, will crash a bottle of Champagne on the ship's bow at the christening. She also plans to present his Navy Cross to the ship's skipper to be kept on board.\nCmdr. Brian Ribota said the ship's crew of 300 will strive to honor the legacy of a Marine who loved his country so much that he had only three things on his bedroom wall: The U.S. Constitution, the Bill of Rights, and his Marine boot camp certificate.\n\"He's the true American story of immigrating to the United States and loving this place so much that he sacrificed his life for all,\" Ribota said.\nThe Peralta is the first Arleigh Burke -class destroyer to be built at Bath Iron Works under a restart of a program the Navy once sought to end. The destroyers use powerful computer and phased-array radar equipment, called the Aegis Combat System , to simultaneously wage war with aircraft, missiles, submarines and surface warships.\nThe family feels the destroyer is a fitting tribute. Peralta's sister, Icela Peralta Donald , who will serve as the ship's matron of honor while her sister is its maid of honor, said she's made her peace with all that has transpired.\nDonald thinks her brother is at peace, too.\nAfter he died, the family received his personal items including a camera that contained the image of Peralta being baptized, battlefield-style, in a hole dug in the desert and surrounded by sandbags.\nDonald says her brother's soul will be at the heart of the ship\n\"It's going to be strong,\" she said. \"I feel like it's going to carry his spirit.\"\n___\nFollow David Sharp on Twitter at https://twitter.com/David_Sharp_AP\n___\nThis story has been corrected to show Peralta died Nov. 15, 2004, not Nov. 14.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "https://twitter.com/David_Sharp_AP", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T00:23:35.211+02:00", "highlightTitle": ""}