{"organizations": [], "uuid": "155386a2e7c98fffae9fd70a46d08cbac7aeb868", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/cc/0a/WHIO_Facebook_Icon.png", "site_section": "http://www.whio.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.whio.com/ap/ap/top-news/gop-in-tumult-after-mccarthys-withdrawal-from-spea/nnyWr/", "country": "US", "title": "GOP in tumult after McCarthy's withdrawal from speaker race", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "GOP in tumult after McCarthy's withdrawal from speaker race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T10:41:00.000+03:00", "replies_count": 0, "uuid": "155386a2e7c98fffae9fd70a46d08cbac7aeb868"}, "author": "", "url": "http://www.whio.com/ap/ap/top-news/gop-in-tumult-after-mccarthys-withdrawal-from-spea/nnyWr/", "ord_in_thread": 0, "title": "GOP in tumult after McCarthy's withdrawal from speaker race", "locations": ["WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["McCarthy"], "text": "Updated: 3:42 a.m. Friday, Oct. 9, 2015 | Posted: 3:41 a.m. Friday, Oct. 9, 2015 GOP in tumult after McCarthy's withdrawal from speaker race Sponsored Links The Associated Press WASHINGTON — \nJolted by political lighting for the second time in two weeks, House Republicans are staring at turmoil and uncertainty after Majority Leader Kevin McCarthy's astonishing decision to abandon his campaign to become the chamber's next speaker. \nGOP lawmakers, who lately have acted more like feuding relatives than a unified party, were meeting Friday to discuss their next move. On Thursday, Republicans munching barbecue at a closed-door meeting where they seemed ready to coronate McCarthy as their candidate for speaker were aghast when the Californian rose and told them he wouldn't seek the job. \nFacing opposition from a band of hard-right conservatives, some McCarthy supporters said he concluded he would have fallen short of the 218 votes needed when the full House formally elects the speaker. Others said he could have won but GOP lawmakers backing him would have infuriated conservative constituents back home, jeopardizing their own careers. \n\"It was only going to get worse,\" McCarthy said in an interview published Thursday night by The Wall Street Journal. He added, \"This was for the good of the team.\" \nMcCarthy's announcement leaves the race to succeed the departing Speaker John Boehner wide open. The Ohio Republican delivered his own shocker on Sept. 25 when he said he would retire from Congress Oct. 30. \n\"Two people now have taken themselves out of the running,\" said Rep. Ileana Ros-Lehtinen, R-Fla. \"And I hope we will have candidate who can lift up our party.\" \nBoehner said he would remain in his job until a new speaker was installed, an ironic consequence considering conservatives' desire to shove him out the door. That election was set for Oct. 29, but its date is now uncertain. \nAttempting to calm the waters, 19 Republicans including several committee chairs wrote GOP lawmakers that they shouldn't pick a speaker until agreeing on \"a shared set of goals and governing vision that benefits the nation and our constituents.\" \nMcCarthy had two rivals for the post, Reps. Jason Chaffetz, R-Utah, and Daniel Webster, R-Fla. Neither had broad backing among the House's 247 Republicans. \nSeveral other potential candidates surfaced. Chief among them was Rep. Paul Ryan , R-Wis., the GOP's 2012 vice presidential pick. Boehner and McCarthy were pressing him to seek the job. \nAt midday, Ryan, who chairs the House Ways and Means Committee, said he was uninterested in the top post. With pressure mounting, he later declined to flatly rule out a run. \n\"I think our conference will come together and unify. We'll find a way to do it,\" he told reporters. \nThe tumult was escalating as the GOP-run Congress hurtled toward showdowns with President Barack Obama over spending and borrowing. If not resolved, those face-offs could result in a partial government shutdown or an unprecedented federal default. \nBoehner and Senate Majority Leader Mitch McConnell, R-Ky., believe either scenario would severely wound GOP prospects in next year's presidential and congressional elections. Some conservatives seem eager to use the confrontations to dare Obama to veto GOP priorities like cutting government spending and halting federal payments to Planned Parenthood. \nAfter McCarthy revealed his decision to his colleagues — lawmakers said he did so standing beside his wife, Judy — the five-term lawmaker told reporters, \"If we are going to be strong, we've got to be 100 percent united.\" \nMcCarthy had been strongly opposed by a band of 30 to 40 conservatives called the House Freedom Caucus. They consider him too close to Boehner, whose leadership team had punished some conservatives by removing them from committees. \nUnderscoring the distrust buffeting the GOP, conservative Rep. Thomas Massie, R-Ky., said he believed the leaders postponed the speaker vote because McCarthy couldn't win. \n\"The question in my mind is, are these free and fair elections?\" Massie said. \"If they don't have the votes next time, will they postpone it again?\" \nOther Republicans fired back. Moderate Rep. Charlie Dent, R-Pa., a McCarthy supporter, said he'd predicted that Republicans who forced Boehner's departure \"will try to frag the next guy. That's what we just saw happen.\" \nSpotlighting the turbulence, Rep. Reid Ribble, R-Wis., became the second lawmaker in a month to leave the Freedom Caucus. A McCarthy supporter, he said he has \"a clear idea of the qualities a leader will need\" to unite Republicans. Rep. Tom McClintock, R-Calif., quit in September, complaining that the caucus' tactics were hurting the GOP. \nSpeaking to reporters, McCarthy dismissed a suggestion that his decision was related to a letter by conservative Rep. Walter Jones, R-N.C. It said leadership candidates should withdraw \"if there are any misdeeds he has committed since joining Congress\" that would be embarrassing. \nJones said his letter was based on problems of past lawmakers including former Rep. Bob Livingston, R-La., who abandoned a bid to become speaker after admitting to extramarital affairs. \n\"I have no idea what anybody does up here after 5 o'clock,\" Jones told a reporter. \n___ \nAssociated Press writers Erica Werner, Andrew Taylor, Mary Clare Jalonick and Matt Daly contributed to this report. Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-09T10:41:00.000+03:00", "crawled": "2015-10-09T11:02:23.568+03:00", "highlightTitle": ""}