{"organizations": [], "uuid": "a45ccaf46a0a109e7b929345525a9e9c38d9ec6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/3835955/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13846723.STUC__SNP_have_strengthend_union_bond_with_historic_first_speech/", "country": "GB", "title": "STUC: SNP have strengthend union bond with historic first speech", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 2, "title_full": "STUC: SNP have strengthend union bond with historic first speech (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:07:00.000+03:00", "replies_count": 1, "uuid": "a45ccaf46a0a109e7b929345525a9e9c38d9ec6b"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/politics/13846723.STUC__SNP_have_strengthend_union_bond_with_historic_first_speech/", "ord_in_thread": 0, "title": "STUC: SNP have strengthend union bond with historic first speech", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The SNP has strengthened its bonds with Scotland's trade union movement with an \"historic\" first speech at the nationalist party conference by a prominent union leader.\nScottish Trades Union Congress (STUC) leader Grahame Smith will appear at the SNP Conference in Aberdeen on Saturday.\nSNP business convener Derek Mackay said his appearance was \"a welcome and historic development\" for the SNP, and a chance \"to strengthen the bonds of solidarity between the party and Scotland's trade unions\".\nThe STUC represents over 620,000 trade unionists, the members of 39 affiliated trade unions and 20 Trades Union Councils.\nIt is not aligned to any political party but represents unions that are affiliated to Labour and those that backed a Yes vote in the independence referendum.\nFollowing Labour's heavy defeat in the general election, Mr Smith warned that \"Labour is in real danger of becoming irrelevant in Scottish politics\" as he signed a memorandum of understanding with SNP leader Nicola Sturgeon to oppose Tory austerity and demand further powers for Scotland.\nSpeaking ahead of his visit to conference, Mr Smith said: \"I am absolutely delighted to have this historic opportunity to speak at SNP conference.\nPromoted stories \"It has never happened before and demonstrates the very constructive relationship with both the Scottish Government and the SNP as a political party.\n\"The fact that I am speaking on the debate on the Trade Union Bill demonstrates that a key aspect of that relationship is the Scottish Government's work to take forward the Fair Work agenda, champion good workplace relations and support the role of trade unions.\n\"This is in stark contrast to the approach of the UK government.\"\nMr Mackay said: \"That the STUC will address SNP conference for the first time is a welcome and historic development.\n\"This highlights the strong partnership between the SNP and the trade union movement in Scotland as we fight against the regressive actions of the UK government.\n\"A positive relationship between the SNP and Scotland's trade unions will be crucial in leading the real opposition to this out of touch Tory government, and the opportunity for the STUC to address SNP conference this week is a further chance to strengthen the bonds of solidarity between the party and Scotland's trade unions.\nShare article \"With Scotland's party of government and our trade union movement united in common cause against the Tories' Victorian attitude towards trade unions, the strength of feeling in Scotland against the UK government's transparent attack on our unions could not be clearer.\n\"By acting together, the SNP and the trade union movement in Scotland can ensure that the voices of working people are heard more loudly and more clearly than ever before, and it's about time David Cameron and George Osborne sat up and took notice and abandoned their regressive plans.\"", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-14T21:07:00.000+03:00", "crawled": "2015-10-14T16:24:20.896+03:00", "highlightTitle": ""}