{"organizations": [], "uuid": "0cac6da79ca6d27a184a0fc17c2f3f1b10695945", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/digital/images/FBSharingIcons_dispatch.png", "site_section": "http://www.dispatch.com/content/syndication/news_ohio_politics.xml", "section_title": "Political News - Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/08/New_poll_shows_Senate_race_too_close_to_callx_Ohioans_want_legalize_pot.html", "country": "US", "title": "Ohioans back pot legalization, give Kasich highest approval rating yet in new poll", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Ohioans back pot legalization, give Kasich highest approval rating yet in new poll | The Columbus Dispatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T14:31:00.000+03:00", "replies_count": 0, "uuid": "0cac6da79ca6d27a184a0fc17c2f3f1b10695945"}, "author": "The Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/08/New_poll_shows_Senate_race_too_close_to_callx_Ohioans_want_legalize_pot.html", "ord_in_thread": 0, "title": "Ohioans back pot legalization, give Kasich highest approval rating yet in new poll", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "According to a new poll out this morning, Ohioans slightly favor former Ohio Gov. Ted Strickland over Sen. Rob Portman, support legalizing marijuana and give Gov. John Kasich his highest approval rating yet.\nHere’s a look at how each issue played out in the Quinnipiac poll :\nSenate 2016\nWhile half of Ohio voters approve of the job Portman, a Republican, is doing, more said they would vote for Strickland, a Democrat.\nStrickland has 46 percent while Portman is at 43 - that’s the same three-point gap as a couple months ago. In August, Strickland was beating Portman 44 to 41 percent and in April, Strickland was up 9 points on Portman.\nWith the margin or error, Quinnipiac deemed the race too close to call.\n\"Conventional wisdom says Sen. Rob Portman's 50 - 27 percent job approval rating should make him a safe bet for reelection. But a second term is far from a sure thing,\" said Peter A. Brown, assistant director of the Quinnipiac University Poll.\nPortman does lead Democrat and Cincinnati City Councilman P.G. Sittenfeld 49-27 percent. Of those polled, 86 percent said they didn’t know enough about Sittenfeld to form an opinion.\nMarijuana\nWhile the poll did not address marijuana legalization Issue 3 specifically, it did show Ohioans support legalizing marijuana for personal use 53-44 percent, with 70 percent of the 18-34 crowd in favor.\nAnd voters overwhelmingly support legalizing medical marijuana, 90-9 percent. Still the poll showed 65 percent said they would \"definitely not\" use marijuana even it became legal.\nIn April, Ohioans supported medical marijuana 84 to 15 percent while 52 to 44 percent supported recreational use.\nOhioans will vote Nov. 3 on Issue 3, ResponsibleOhio’s constitutional amendement to legalize marijuana - both recreational and medicinal - in the state.\nResponsibleOhio’s plan has been criticized for being a “monopoly” because it limits marijuana growth to 10 investment groups.\nBut ResponsibleOhio claims legalizing marijuana will lower crime and create jobs in the state.\nKasich approval\nAnd as Kasich criss-crosses the country campaigning for the GOP presidential nomination, back home his approval rating is at an all-time high of 62 percent. In August, Kasich’s approval rating was 61 percent.\nA Quinnipiac poll released yesterday showed for the first time Kasich slipping among GOP presidential candidates in Ohio. The governor came in third place behind billionaire Ben Carson and retired neurosurgeon Ben Carson.\nQuinnipiac’s telephone poll (land lines and cellphones) from Sept. 25 through October 5 included of 1,180 registered Ohio voters has a margin of sampling error of plus or minus 2.9 percentage points.", "external_links": ["http://www.quinnipiac.edu/news-and-events/quinnipiac-university-poll/2016-presidential-swing-state-polls/release-detail?ReleaseID=2288"], "published": "2015-10-08T14:31:00.000+03:00", "crawled": "2015-10-08T13:48:16.856+03:00", "highlightTitle": ""}