{"organizations": ["Labour"], "uuid": "bfcef1c591d0bd3b041f27d0324dda85e38ab83a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "martini.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4344008/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://martini.heraldscotland.com/politics/political_news/13876009.Labour_seize_on_TV_plea_to_claim_Tories_out_of_touch_on_tax_credit_cuts/?ref=rss", "country": "", "title": "Labour seize on TV plea to claim Tories out of touch on tax credit cuts", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Labour seize on TV plea to claim Tories out of touch on tax credit cuts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T02:08:00.000+03:00", "replies_count": 0, "uuid": "bfcef1c591d0bd3b041f27d0324dda85e38ab83a"}, "author": "", "url": "http://martini.heraldscotland.com/politics/political_news/13876009.Labour_seize_on_TV_plea_to_claim_Tories_out_of_touch_on_tax_credit_cuts/?ref=rss", "ord_in_thread": 0, "title": "Labour seize on TV plea to claim Tories out of touch on tax credit cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Labour seize on TV plea to claim Tories out of touch on tax credit cuts Labour seize on TV plea to claim Tories out of touch on tax credit cuts 15 comments \nLABOUR has seized on an emotional plea from a Conservative voter, seen by millions of TV viewers, urging the UK Government to back down on its controversial plan to cut tax credits. \nDuring BBC’s Question Time, Michelle Dorrell, a 35-year-old mother-of-four from Folkestone, confronted Amber Rudd, the Energy Secretary, for supporting a move that will see millions of working families lose up to £1300 a year. \n\"I can hardly afford the rent I've got to pay, I can hardly afford the bills I've got to do, and you're going to take more from me,” declared Ms Dorrell before shouting: “Shame on you.” \nLoading article content \nJon Ashworth, the Shadow Minister without Portfolio, claimed the incident illustrated the Tory Government’s lack of understanding on the issue, stressing how the “common ground in British politics is not to penalise those on tax credits”. \nHe added: “Osborne's insistence on this policy and Amber Rudd's response on Question Time to the heartfelt plea to abandon the cuts shows how out of touch they are.” \nThe Institute for Fiscal Studies has estimated that low-income households stand to lose on average £1300 a year as a result of the £4.5 billion welfare cut. Promoted stories \nDavid Gauke, the Financial Secretary to the Treasury, has conceded \"some families\" will be worse off when the welfare changes come into effect from April but the UK Government believes that, overall, when policies like introducing the National Living Wage, extending free childcare and increases in the tax-free personal allowance are taken into account, people will be better off. \nThe Tory administration argues it is also better to move from a high welfare, high tax economy to a low welfare, low tax one. \nDefending the Government’s decision, David Cameron’s spokesman said: “The point the Prime Minister and Government is trying to get across is that it’s important you see that the changes we are making in tax credits are part of an overall package of changes designed to ensure we push wages up.” Share article \nNoting how spending on tax credits had risen inexorably over the years, he said: “If we’re going to tackle the overall welfare budget and try to move us away from being a high welfare country to a low welfare country, then this is something we have to look at.” \nAsked if Mr Cameron would seek to meet Ms Dorrell to explain his policy to her, the spokesman replied: “The PM meets with people from all different walks of life all the time.” Promoted Stories", "external_links": [], "published": "2015-10-17T02:08:00.000+03:00", "crawled": "2015-10-23T07:06:07.938+03:00", "highlightTitle": ""}