{"organizations": [], "uuid": "0fd410887d1d29f0bf88faa43ccfef7ac07804e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://feeds.feedburner.com/~ff/HawaiiReporterNews?d=yIl2AUoC8zA", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/politics/2015/10/the-first-filipino-ww-ii-medal-of-honor-cpt-jose-cabalfin-calugas-u-s-army-1907-1998-2751918.html", "country": "US", "title": "The First Filipino WW II Medal of Honor, Cpt. Jose Cabalfin Calugas, U.S. Army (1907-1998) | Politics", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "The First Filipino WW II Medal of Honor, Cpt. Jose Cabalfin Calugas, U.S. Army (1907-1998) | Politics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T00:01:00.000+03:00", "replies_count": 0, "uuid": "0fd410887d1d29f0bf88faa43ccfef7ac07804e3"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/politics/2015/10/the-first-filipino-ww-ii-medal-of-honor-cpt-jose-cabalfin-calugas-u-s-army-1907-1998-2751918.html", "ord_in_thread": 0, "title": "The First Filipino WW II Medal of Honor, Cpt. Jose Cabalfin Calugas, U.S. Army (1907-1998) | Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nTOP INVESTIGATIVE REPORTING AND ONLINE JOURNALISM AWARDS BEST BUSINESS AND GOVERNMENT REPORTING\nBY DUANE ALLEN VACHON, PH.D. – Captain Jose Cabalfin Calugas, Sr. was the first Filipino Soldier to have received the Medal of Honor during WW II.\nCalugas was born on December 29, 1907 in Barangay Tagsing, Leon, Iloilo Philippines. He had three siblings of which he was the oldest. His mother died when he was 12 so he had the extra responsibility of helping his father raise his siblings.\nBarangay Tagsing was populated primarily by farmers. It was also one of the primary areas for the resistance movement during the Japanese occupation.\nHaving heard from some of his friends and relatives in the town of Leon who had joined the Philippine Scouts that it was a top notch unit, Calugas enlisted on March 12, 1930. After his basic training he was assigned to company “C” 24th Artillery at Fort Stotsenburg, Pampanga.\nFrom the time he joined until 1940, the Philippine Scouts trained vigorously. They were excellent marksmen and each spring teams of their most outstanding experts were sent by each regiment to Camp Perry, New York, where they competed effectively against the best in the U.S. Army.\nIncreasing Japanese successes in China in late 1930’s followed by their movement in Indo-China in the summer of 1940, finally energized the U.S. War Department. General George Grunert asked the War Department for re-enforcement of troops and supplies. For the Philippine Scouts, doubling their strength to 12,000 men took effect in 1941.\nThe 88th Field Artillery Battalion, Calugas’ unit, was constituted into the Regular Army on 1 October 1933 and was activated on the 19 April 1941 in the Philippines.\nThe Scouts were awakened on the morning of 8 December 1941, to learn that they were now in the war for which they had been trained.\nThe First Battalion, 88th Field Artillery Philippine initially was deployed from Fort Stotsenberg in December 1941 in the barrios of Mexico and Lagaban, Bataan. On December 30, 1941, the Battalion moved to Hermosa.\nIn early January, 1942, the Battalion joined the 23rd Field Artillery Battalion Philippine Scouts in support of the 31st Infantry (U.S.) in defending position at Layac Junction. The 1st Battalion, 88th Field Artillery Philippine Scouts was in more protected position than the 23rd and, therefore, did not suffer as heavily as did the 23rd.\nMajor Howard, one of the commanding officers from the 1st Battalion 88th Field Artillery Philippine Scouts reported in his notes that they had 1st Battalion, lost one gun during the withdrawal from Layac Junction line.\nOn the 6 January, the 1st Battalion Field Artillery was supporting the defensive line behind the Culo River held by the 26th Cavalry Philippine Scouts, the 31st Infantry (U.S.) and the Philippine Army units.\nWhen one gun was put out of commission by the enemy fire, Sgt. Jose Calugas of the 88th Field Artillery voluntarily ran 1,000 yards across a shell swept area, put the gun back into action and fired effectively against the enemy although his position was under constant heavy enemy fire.\nSgt. Calugas manned the 75-mm cannon by himself and fired effectively, destroying about sixty advancing vehicles and their occupants. For his action beyond and above the call of duty, he was awarded the Medal of Honor.\nThe President of the United States\nin the name of The Congress\ntakes pleasure in presenting the\nMedal of Honor\nto\nCALUGAS, JOSE\nRank and organization: Sergeant, U.S. Army, Battery B, 88th Field Artillery, Philippine Scouts. Place and date: At Culis, Bataan Province, Philippine Islands, 16 January 1942. Entered service at: Fort Stotsenburg, Philippine Islands. Born: 29 December 1907, Barrio Tagsing, Leon, Iloilo, Philippine Islands. G.O. No.: 10, 24 February 1942.\nCitation:\nThe action for which the award was made took place near Culis, Bataan Province, Philippine Islands, on 16 January 1942. A battery gun position was bombed and shelled by the enemy until 1 gun was put out of commission and all the cannoneers were killed or wounded. Sgt. Calugas, a mess sergeant of another battery, voluntarily and without orders ran 1,000 yards across the shell-swept area to the gun position. There he organized a volunteer squad which placed the gun back in commission and fired effectively against the enemy, although the position remained under constant and heavy Japanese artillery fire.\nI did not feel comfortable writing this article without also sharing some information on how we have treated our Filipino Veterans.\nBROKEN PROMISE\n“I, __[Name]__, do solemnly swear…that I will bear true faith and allegiance…to the United States of America…that I will serve them honestly and faithfully…against all their enemies whomsoever…and I will obey the orders…of the President of the United States…And the orders of the officers appointed over me…according to the rules and Articles of War.”\nWith this pledge, approximately 250,000 Filipino men joined the U.S. Armed Forces in the months before and the days just after the Japanese attack on Pearl Harbor. For the next several years, they would share the fate of their American counterparts on the battlefield, in prisoner of war camps, and throughout the countryside as part of the guerrilla resistance.\nWashington promised them the same health and pension benefits as their American brothers. Even after the war, in October of 1945, Gen. Omar Bradley, then Administrator of the Veterans Administration, reaffirmed that they were to be treated like any other American veterans.\nBut on February 18, 1946, the Congress passed and President Truman signed Public Law 70-301, known as the Rescission Act of 1946. It said that the service of Filipinos “shall not be deemed to be or to have been service in the military or national forces of the United States or any component thereof or any law of the United States conferring rights, privileges or benefits.”\nFor over 60 years, Filipino veterans and community advocates have fought to obtain compensation for those who served with American soldiers during World War II. Congress in 2009 authorized one-time payments to Filipinos who served as soldiers, guerrillas and scouts alongside U.S. forces fighting the Japanese. Close to 43,000 claims were filed but only 18,900 were found eligible, according to the Department of Veterans Affairs. The program authorized $15,000 to eligible Filipino veterans who are now U.S. citizens and $9,000 for those living in the Philippines. That is not what they were promised.\nThese men didn’t wait when the United States asked for help. They stepped forward and volunteered to serve. Why are we making them wait over 60 years?\nTo further add insult to injury, Japanese citizens do not require a visa to visit America, Philippine citizens do. America has paid the Japanese for war damages (Hiroshima bombing), why can’t they fulfill their promise to people who helped make our present world what it is now? Don’t they deserve it???\nUse Facebook to Comment on this Post", "external_links": ["http://feeds.feedburner.com/~ff/HawaiiReporterNews?d=qj6IDK7rITs", "http://feeds.feedburner.com/~ff/HawaiiReporterNews?i=bHKVBT9rpoo:OedNN4PgfAo:gIN9vFwOqvQ", "http://feeds.feedburner.com/~ff/HawaiiReporterNews?d=yIl2AUoC8zA", "http://feeds.feedburner.com/~ff/HawaiiReporterNews?a=bHKVBT9rpoo:OedNN4PgfAo:F7zBnMyn0Lo", "http://feeds.feedburner.com/~ff/HawaiiReporterNews?a=bHKVBT9rpoo:OedNN4PgfAo:gIN9vFwOqvQ", "http://feeds.feedburner.com/~ff/HawaiiReporterNews?a=bHKVBT9rpoo:OedNN4PgfAo:yIl2AUoC8zA", "http://feeds.feedburner.com/~ff/HawaiiReporterNews?i=bHKVBT9rpoo:OedNN4PgfAo:F7zBnMyn0Lo", "http://www.hawaiireporter.com/feed/atom", "http://feeds.feedburner.com/~r/HawaiiReporterNews/~4/bHKVBT9rpoo", "http://feeds.feedburner.com/~ff/HawaiiReporterNews?a=bHKVBT9rpoo:OedNN4PgfAo:qj6IDK7rITs"], "published": "2015-10-25T00:01:00.000+03:00", "crawled": "2015-10-25T01:36:43.608+02:00", "highlightTitle": ""}