{"organizations": [], "uuid": "d8a52764f8529571ef8f9e34f1b452471444d340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30259029/media-accreditation-open-for-orbital-atk-mission-to-resupply-space-station", "country": "US", "title": "Media Accreditation Open for Orbital ATK Mission to Resupply Space Station - CBS", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Media Accreditation Open for Orbital ATK Mission to Resupply Space Station - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8a52764f8529571ef8f9e34f1b452471444d340"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30259029/media-accreditation-open-for-orbital-atk-mission-to-resupply-space-station", "ord_in_thread": 0, "title": "Media Accreditation Open for Orbital ATK Mission to Resupply Space Station - CBS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " NASA\nWASHINGTON , Oct. 14, 2015 /PRNewswire-USNewswire/ -- NASA has opened media accreditation for the fourth commercial resupply services launch of an Orbital ATK Cygnus spacecraft filled with cargo for the International Space Station. The launch is currently targeted for Thursday, Dec. 3 during a 30-minute window that opens at approximately 6 p.m. EST .\nThe Cygnus will lift off aboard a United Launch Alliance Atlas V rocket from Space Launch Complex 41 at Cape Canaveral Air Force Station (CCAFS), Florida . The mission will be the first flight of the enhanced variant of Orbital ATK's Cygnus advanced maneuvering spacecraft, capable of delivering more than 7,700 pounds of essential crew supplies, equipment and scientific experiments to the station.\nScience payloads include a new life science facility that will support studies on cell cultures, bacteria, and other micro-organisms; a microsatellite deployer and the first microsatellite to be deployed from the space station; experiments that will study the behavior of gases and liquids and clarify the thermo-physical properties of molten steel; and evaluations of flame-resistant textiles.\nMedia prelaunch and launch activities will take place at CCAFS and NASA's Kennedy Space Center in Florida. International media without U.S. citizenship must apply for accreditation by Nov. 2 for access to both Kennedy and CCAFS or by Nov. 11 for access only at Kennedy. The deadline for U.S. media to apply for credentials to both Kennedy and CCAFS is Nov. 16 , and Nov. 23 for access only to Kennedy.\nAll media accreditation requests should be submitted online at:\nhttps://media.ksc.nasa.gov\nInternational media also are required to upload a scanned copy of their visa and passport or their green card with their accreditation request.\nAll media representatives must present two forms of unexpired legal, government identification to access Kennedy. One form must include a photo, such as a passport or driver's license. Questions about accreditation should be directed to Jennifer Horner at jennifer.p.horner@nasa.gov or 321-867-6598. For other questions or additional information, contact the Kennedy news room at 321-867-2468.\nFor more information about the Orbital ATK resupply mission, visit:\nhttp://www.nasa.gov/orbital\nFor more information about the International Space Station, its crew and research, visit:\nhttp://www.nasa.gov/station\nLogo - http://photos.prnewswire.com/prnh/20081007/38461LOGO\n releases/media-accreditation-open-for-orbital-atk-mission-to-resupply-space-station-300159554.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.nasa.gov/station", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC27982&Transmission_Id=201510141027PR_NEWS_USPR_____DC27982&DateId=20151014", "http://photos.prnewswire.com/prnvar/20081007/38461LOGO", "https://media.ksc.nasa.gov/", "http://www.prnewswire.com/news-releases/media-accreditation-open-for-orbital-atk-mission-to-resupply-space-station-300159554.html", "http://www.nasa.gov/orbital", "http://photos.prnewswire.com/prnh/20081007/38461LOGO"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T19:49:27.440+03:00", "highlightTitle": ""}