{"organizations": [], "uuid": "93551e897c3298f3706ac2a00aada058d5438265", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8971238_G.jpg", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30212910/people-pack-meeting-of-panel-eyeing-expansion-of-whale-tanks", "country": "US", "title": "People pack meeting of panel eyeing expansion of whale tanks", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "People pack meeting of panel eyeing expansion of whale tanks - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "93551e897c3298f3706ac2a00aada058d5438265"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30212910/people-pack-meeting-of-panel-eyeing-expansion-of-whale-tanks", "ord_in_thread": 0, "title": "People pack meeting of panel eyeing expansion of whale tanks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MICHAEL R. BLOOD\nAssociated Press LONG BEACH, Calif. (AP) - Protesters and supporters filled a meeting room Thursday where a California commission was considering a vast expansion to the tanks that SeaWorld uses to hold killer whales in San Diego.\nThe commission that regulates land and water use along the California coast took up the issue of the $100 million expansion, which animal rights activists fear would pave the way for breeding more of the animals in captivity - something they say is cruel no matter the size of the tanks.\nThe 500 people who packed the meeting room included SeaWorld supporters wearing blue and white shirts and holding signs saying, \"Educate, Inspire, Conserve,\" and critics waving signs saying \"Vote no on SeaWorld Tanks\" and \"SeaWorld hurts Orcas.\"\nSome groaned or snickered as staff testimony began.\nOutside, hundreds of people who couldn't get into the meeting room stood behind rope lines and watched the session on oversized screens.\nSeaWorld San Diego President John Reilly told commission members they would hear numerous inaccurate statements from critics but asserted the project would provide a better living environment for the whales and open new windows for researchers.\nNo one is more passionate about caring for killer whales than SeaWorld, he said.\nMatt Bruce of People for the Ethical Treatment of Animals said the renovations would do nothing to improve conditions for the killer whales.\n\"We feel these newer tanks will just be more prisons for these orcas,\" Bruce said. \"These orcas are robbed of everything that is natural to them.\"\nThe staff of the commission has recommended approving the expansion under nine conditions that include forbidding SeaWorld from housing recently captured orcas in San Diego.\nSeaWorld says it has not collected any orcas in the wild in more than three decades, its animals are well treated and park shows help generate support for conservation.\nUnder the proposal, SeaWorld would demolish portions of a 1995 facility that included a 1.7-million gallon pool and replace it with a 5.2-million gallon tank and 450,000-gallon pool.\nThe Orlando, Florida-based company has said the orca population at the San Diego facility - which currently numbers 11 - would not significantly increase due to the \"Blue World\" project it wants to open in 2018, even though the capacity of the tanks would jump.\nThe panel said it had received some 200,000 emails and 50,000 postcards weighing in on the project.\nAttendance at the California park has declined since the release of the population documentary \"Blackfish\" in 2013, which suggests SeaWorld's treatment of captive orcas provokes violent behavior. The company's stock price also has dropped over the past two years.\nSeaWorld says negative media attention is partly to blame and there is also increased competition among Florida theme parks and other factors.\nAnimal rights activists fear SeaWorld will use the expanded tanks to breed orcas in San Diego and send them to other marine theme parks. They say captivity has cut the life spans of the highly intelligent animals that should be transferred to ocean sanctuaries on the coast.\nSeaWorld says its animals have normal breeding interactions in the healthy environment provided by the park, and not allowing its killer whales to breed would be inhumane.\n ", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T22:39:14.693+03:00", "highlightTitle": ""}