{"organizations": [], "uuid": "6e2e2afe88cb370bd3319e3fbc0f73ff8432d976", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/8f/20/1b1035a045e284f33a99bac16fda/151007edunewschool-submitted.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/education/best-colleges/the-short-list-college/articles/2015/10/13/10-national-universities-with-small-classes", "country": "US", "title": "10 National Universities With Small Classes", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "10 National Universities With Small Classes - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "6e2e2afe88cb370bd3319e3fbc0f73ff8432d976"}, "author": "USNews", "url": "http://www.usnews.com/education/best-colleges/the-short-list-college/articles/2015/10/13/10-national-universities-with-small-classes", "ord_in_thread": 0, "title": "10 National Universities With Small Classes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "10 National Universities With Small Classes Most classes at these schools have fewer than 20 students, according to U.S. News data. At the New School in New York, 90 percent of classes had fewer than 20 students during fall 2014.\nBy Delece Smith-Barrow Oct. 13, 2015 | 9:00 a.m. EDT + More The U.S. News Short List, separate from our overall rankings, is a regular series that magnifies individual data points in hopes of providing students and parents a way to find which undergraduate or graduate programs excel or have room to grow in specific areas. Be sure to explore The Short List: College , The Short List: Grad School and The Short List: Online Programs to find data that matter to you in your college or graduate school search.\nSome prospective college students may worry that they'll feel lost in large lecture halls once they get to campus.\nBut at dozens of schools, it's the norm for classes to enroll fewer than 20 students, according to U.S. News data. Some research has shown that small class sizes can be beneficial for students. For example, an analysis by IDEA, a nonprofit organization focused on improving higher education, found smaller classes can lead to higher student achievement and help students better develop oral and written communication skills.\n[Find out which universities have the highest undergraduate enrollment. ]\nAbout 90 percent of classes at the New School in New York had fewer than 20 students during fall of 2014. It had the highest percentage of classes with fewer than 20 students out of 266 ranked institutions in the National Universities category that submitted data to U.S. News in an annual survey.\nNational Universities offer a range of undergraduate, master's and doctoral programs and are committed to groundbreaking research.\nThe New School also had the highest percentage of small classes in fall of 2013, when 88.8 percent of its classes had fewer than 20 students.\nCardinal Stritch University in Wisconsin, which didn't appear on the top 10 list for fall 2013, came in third on the most recent list of schools with the highest percentage of small classes. During fall 2014, 82.7 percent of its classes had fewer than 20 students. Its student body was also smaller than most of the schools on the list: 2,308 undergrads.\nAmong the top 10 schools, the average undergraduate enrollment was 5,020.\n[Learn how to narrow down the list for your college search. ]\nGeorgia State University and the University of Texas—San Antonio had the lowest percentage of small classes among all National Universities that submitted data. Just 16.7 percent of classes at both universities had fewer than 20 students during fall of 2014, but they are fairly large institutions. More than 24,000 undergrads were enrolled at each school during fall 2014.\nBelow are the 10 universities with highest percentage of classes with fewer than 20 students during fall 2014. Unranked schools, which did not meet certain criteria required by U.S. News to be numerically ranked, were not considered for this report.\nSchool name (state) Fall 2014 undergraduate enrollment Percentage of fall 2014 classes with fewer than 20 students U.S. News rank New School (NY) 6,695 90%​ 127 (tie) Immaculata University (PA) 2,138 82.8% 161 (tie) Cardinal Stritch University (WI) 2,308 82.7% RNP* Columbia University (NY) 6,170 82.4% 4 (tie) Edgewood College (WI) 1,935 78.9% 175 (tie) Nova Southeastern University (FL) 4,699 78.4% RNP University of Chicago 5,681 77.1% 4 (tie) Northwestern University (IL) 8,405 76.3% 12 (tie) Yale University (CT) 5,477 74.6% 3 Harvard University (MA) 6,694 74% 2 * RNP schools fall in the bottom one-fourth of their ranking category. U.S. News calculates numerical ranks for these schools, but does not publish them.\nDon't see your school in the top 10? Access the U.S. News College Compass to find class size data, complete rankings and much more. School officials can access historical data and rankings, including of peer institutions, via U.S. News Academic Insights .\nU.S. News surveyed nearly 1,800 colleges and universities for our 2015 survey of undergraduate programs. Schools self-reported myriad data regarding their academic programs and the makeup of their student body, among other areas, making U.S. News' data the most accurate and detailed collection of college facts and figures of its kind. While U.S. News uses much of this survey data to rank schools for our annual Best Colleges rankings, the data can also be useful when examined on a smaller scale. U.S. News will now produce lists of data, separate from the overall rankings, meant to provide students and parents a means to find which schools excel, or have room to grow, in specific areas that are important to them. While the data come from the schools themselves, these lists are not related to, and have no influence over, U.S. News' rankings of Best Colleges , Best Graduate Schools or Best Online Programs . The class size data above are correct as of Oct. 13, 2015.\nTAGS: education colleges students Harvard University Yale University", "external_links": ["http://colleges.usnews.rankingsandreviews.com/best-colleges/university-of-chicago-1774", "http://colleges.usnews.rankingsandreviews.com/best-colleges/utsa-10115", "http://ideaedu.org/does-class-size-matter/", "http://colleges.usnews.rankingsandreviews.com/best-colleges/harvard-university-2155", "http://colleges.usnews.rankingsandreviews.com/best-colleges/northwestern-1739", "http://colleges.usnews.rankingsandreviews.com/best-colleges/columbia-university-2707", "http://colleges.usnews.rankingsandreviews.com/best-colleges/edgewood-college-3848", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdzaqk%3Fsrc=usn_fb", "http://colleges.usnews.rankingsandreviews.com/best-colleges/rankings/national-universities", "http://colleges.usnews.rankingsandreviews.com/best-colleges/georgia-state-1574", "http://colleges.usnews.rankingsandreviews.com/best-colleges/nova-1509", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdzaqk%3Fsrc=usn_rd&title=10%20National%20Universities%20With%20Small%20Classes", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdzaqk%3Fsrc=usn_gp", "http://colleges.usnews.rankingsandreviews.com/best-colleges/yale-university-1426", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdzaqk%3Fsrc=usn_tw&via=usnews&text=10%20National%20Universities%20With%20Small%20Classes", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdzaqk%3Fsrc=usn_li&title=10%20National%20Universities%20With%20Small%20Classes&summary=Most%20classes%20at%20these%20schools%20have%20fewer%20than%2020%20students%2C%20according%20to%20U.S.%20News%20data.&source=U.%20S.%20News", "http://colleges.usnews.rankingsandreviews.com/best-colleges", "http://colleges.usnews.rankingsandreviews.com/best-colleges/immaculata-university-3276", "http://colleges.usnews.rankingsandreviews.com/best-colleges/cardinal-stritch-university-3837", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdzaqk%3Fsrc=usn_su", "http://colleges.usnews.rankingsandreviews.com/best-colleges/new-school-20662", "http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T16:14:12.528+03:00", "highlightTitle": ""}