{"organizations": [], "uuid": "f1d86ac477bfa641cc5d59f30aa20f4e9b31dfbd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arktimes.com", "main_image": "http://media1.fdncms.com/arktimes/imager/u/slideshow/4103745/lrff_1_.jpg", "site_section": "http://www.arktimes.com/arkansas/Rss.xml?id=ArkansasTimesTwitterFeeds", "section_title": "Arkansas news, politics, opinion, restaurants, music, movies and art, Arkansas Times", "url": "http://www.arktimes.com/RockCandy/archives/2015/10/01/what-happened-to-the-little-rock-film-festival", "country": "US", "title": "What happened to the Little Rock Film Festival?", "performance_score": 0, "site": "arktimes.com", "participants_count": 1, "title_full": "What happened to the Little Rock Film Festival?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T00:02:00.000+03:00", "replies_count": 0, "uuid": "f1d86ac477bfa641cc5d59f30aa20f4e9b31dfbd"}, "author": "Will Stephenson", "url": "http://www.arktimes.com/RockCandy/archives/2015/10/01/what-happened-to-the-little-rock-film-festival", "ord_in_thread": 0, "title": "What happened to the Little Rock Film Festival?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Film What happened to the Little Rock Film Festival? Posted By Will Stephenson on Thu, Oct 1, 2015 at 4:02 PM click to enlarge LRFF CO-FOUNDERS: Craig Renaud (left) and Brent Renaud. In a short note posted on their website Wednesday morning , the Little Rock Film Festival announced that it would be closing down. The development took many by surprise — World Shorts curator Justin Nickels told the Times he had learned of the decision 12 hours earlier. Today, the Times spoke to festival founders Brent and Craig Renaud , who explained the move had been under consideration for at least a year and was the result of new projects and time commitments that would prevent both filmmakers from giving the festival the attention it required. \"The festival is healthier than it's ever been in terms of staff and funding,\" Brent Renaud said. \"We've probably increased sponsorship every year, increased the number of films every year — and we would have done the exact same thing this year. There's nothing that happened, we have no debt, we don't have any major issues. What we do have is a core staff of people getting older, getting married, careers taking off, and increasingly we saw more people each year with less time to volunteer. Because it wasn't a paid staff and we put all the money earned back into the festival experience — which included flying filmmakers in from all over the world. The staff was on board with that from the beginning. That was increasingly difficult. The politics with studios and agents, the fundraising — as much as we brought on more staff, even paid staff, all that stuff still ended up being on Craig and I. And we just thought that wasn't sustainable long-term.\" Asked whether or not the two had considered hiring a new staff person or pursued institutional backing to take over these responsibilities, Brent said, \"That requires us raising all the funds to pay that particular person. It's just not something we could do. We've been having meetings with the city, the state film board, trying to find ways to hire people who could do that. But who knows whether we could find the right people? We haven't found the right partner yet, but we're open to finding the right partner. It's still an open question and we're still talking to people. But as the festival is getting closer, we felt it was time to start right now — and we couldn't start right now. It was not going to happen this year.\" Furthermore, Central Arkansas Library System spokesperson Susan Gelé told the Times this morning that CALS — which provided the festival offices space and owns the festival's flagship venue, Ron Robinson Theater — had severed its relationship with the LRFF the day before the official announcement, and that the festival was asked to vacate its office space within 90 days. In a letter shared with the Times and dated Sept. 29, CALS director Bobby Roberts writes: Now that we have had some experience with the Little Rock Film Festival, I have decided to exercise section seven of the attached agreement and dissolve our memo of understanding. I have decided to end this relationship because I find that there is no real benefit to CALS. That dissolution will take place ninety days from the date on this letter. You may remain in the space in the River Maket Building ... during that ninety day period, but no longer. Please vacate the premises no later than ninety days from the date on this letter. I am sorry that this venture did not work to our mutual benefit. LRFF Letter \"There were different things that were difficult on both sides,\" Gelé said. \"It just came to the point where we needed to separate from that group. \"There's been a lot of focus on the fact that there's not a paid executive director, and that was a real concern. There were sometimes organizational challenges that may have been able to have been handled by a paid staff person better than a group of volunteers who were coordinating a project. That absolutely went into the decision to dissolve the agreement.\" Asked whether this development had affected their decision to close, Craig Renaud said, \"That had nothing to do with our decision. It hasn't been a smooth relationship [with CALS] from the very beginning. We'd already been moved out of one office to another one, now they were asking us to move out of this one. They said they didn't see any value in the relationship. We had already decided to stop the festival, though, so it was beside the point — it had nothing to do with it.\" The Arkansas Democrat-Gazette reported this morning that the festival's 501(c)(3) status had been revoked, due the LRFF's failure to file a Form 990. Both Brent and Craig Renaud stressed that this was not a factor in the LRFF's closure, however. \"The decision was mine, and I didn't know about it,\" Brent said, \"so it didn't factor into my decision at all. We did fail to send in a form, but our accountant says that everything would have been fine if we had sent it in at any point. The form was sent to a previous address. It was a nonissue.\" Craig added, \"We got a notice after this year's festival saying there was an issue with the IRS. I handed it off to our accountants, they felt confident it could be resolved. But that wasn't part of the decision.\" Asked whether they were open to the festival continuing under new leadership, Brent Renaud said, \"We would fully support anyone coming in and doing anything under their own name. In terms of anyone else using the Little Rock Film Festival name, I'd want it to be done at the same level. That name is associated with us, especially outside of Arkansas. We would want to make sure that it was going to be done in a way that kept the filmmaker experience — the idea of it being a filmmaker festival — at the forefront of the mission.\" Craig Renaud stressed this point as well: \"A lot of filmmakers who come to the festival are coming based on their relationships with us through our film work,\" he said, \"so it's not as simple as us handing it off to someone else and saying, 'OK, give it a shot.' I would love to see it live on, but we can't commit to it anymore.\" Brent added that they've already heard from interested parties: \"We've had a lot of calls from different groups in the last few days, people who want to take it on. And we're going to listen to them and see who is serious. But I'm not sure people realize how big it was and how complicated it was, and how difficult it is to establish the critical reputation it had outside of Little Rock. The programming is extremely difficult — it required going to many different festivals, watching hundreds of films. We didn't think it was going to happen. We weren't able to find people so far that we felt were ready to take that on.\"", "external_links": [], "published": "2015-10-02T00:02:00.000+03:00", "crawled": "2015-10-02T01:15:28.189+03:00", "highlightTitle": ""}