{"organizations": [], "uuid": "ae993df383c612a901c091017d8c6ed63e4fba52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/politics/feed", "section_title": "Politics on Huffington Post", "url": "http://www.huffingtonpost.com/francine-lefrak/if-you-see-something-say-_1_b_8331274.html", "country": "US", "title": "Francine LeFrak: If You See Something, Say Something: A Simple Nudge to End School Shootings", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Francine LeFrak: If You See Something, Say Something: A Simple Nudge to End School Shootings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:15:00.000+03:00", "replies_count": 0, "uuid": "ae993df383c612a901c091017d8c6ed63e4fba52"}, "author": "Francine LeFrak", "url": "http://www.huffingtonpost.com/francine-lefrak/if-you-see-something-say-_1_b_8331274.html", "ord_in_thread": 0, "title": "Francine LeFrak: If You See Something, Say Something: A Simple Nudge to End School Shootings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "stumble \nPost-9/11 in New York City gave birth to an era of hyper-awareness and proactive responsibility. An unattended bag on the 6 train resulted in 20 calls to the NYPD. A loiterer covertly taking photos of the Holland Tunnel was reported by a dozen passersby. After 9/11, the NYPD came to the public and said we can't do this alone; we need everyone's help. The mantra of the time, and the words to live by, became, \"If You See Something, Say Something.\" And that was only the beginning. \nWhen the Statue of Liberty reopened in August 2004, every monitor had a scrolling message: \"If You See Something, Say Something.\" 16 months after MTA adopted the slogan, reports of suspicious packages skyrocketed--these reports were the number one cause of delays in the entire system. And now, in D.C., you can even see the slogan on your coffee sleeve. \nWhichever form the slogan takes, it is incredibly effective. As New Yorkers, we now take a collective and proactive responsibility for the safety of our city. This proactivity has foiled several terrorist attacks, proving what we are capable of when we are a more mindful society. \nNow it is time to refocus our efforts. There is a horrific form of terrorism that has swept our society: from 2001 to 2013, 406,496 people died from gun attacks on U.S. soil. Just this year there have been 52 school shootings, with 30 people killed and 53 injured. \nWe cannot become numb to this issue. We must find a way to give society and, in particular, to give schools the tools to be vigilant and speak up. In his important book, Vigilance: My Life Serving America and Protecting Its Empire City , former NYPD Police Commissioner Ray Kelly explained how useful it was to instill \"If You See Something, Say Something\" in the heads of New Yorkers. Every school in the U.S. can adopt this mindset. \nImage : Wall Street Journal \nSome schools, like Oregon State University in Corvalis, have already put it into effect. We can also look to Summerville Union High School as a model. In this northern California high school, 120 miles east of San Francisco, a group of students collectively stopped 4 boys who had detailed plans to come to their campus and kill as many people as possible. In fact, the boys' plot had almost come to fruition: they had crafted a list of would-be victims, including the exact locations and methods of their attack. \nIt has become an all-too-familiar story. But the potential attack is not the point; the point is there was no attack. Students spoke up and, despite the risk, they told a teacher. We can all learn a lot from these students who recognized that something was wrong, and reacted to their responsibility to speak up. \nThe media and our government officials will continue to quarrel on gun control--which has resulted in nothing but heated contention and bipartisan gridlock. But I'd like to point out that gun control is just one element of the conversation. What seems to be entirely left out of the conversation is our responsibility as a society to be more mindful. We need to refocus our efforts; it's about empathy, it's about responsibility, and it's about being proactive. \nIf we are struggling to adopt this model, we can look to the nudge theory to help incentivize young students. As human behavior theorist Cass Sunstein, former Administrator of the White House Office of Information and Regulatory Affairs, said, we must \"nudge\" Americans to change our perception of gun control. \nThis nudge theory has been implemented in both American and British governments, on the basis of a phenomenon called 'choice architecture.' The idea is that by presenting choices that push you in the direction of a more beneficial lifestyle, people will make wiser decisions without losing their freedom of choice. Why not implement this proactive nudge philosophy in all schools? \nIn this time of national crisis, when tragedy dominates the airspace, let's nudge others to highlight the success stories. This positive energy can transform our world in more ways than we know. \nFollow Francine LeFrak on Twitter: www.twitter.com/FrancineLeFrak More:", "external_links": [], "published": "2015-10-20T15:15:00.000+03:00", "crawled": "2015-10-20T19:43:05.564+03:00", "highlightTitle": ""}