{"organizations": [], "uuid": "ba98d8e2b70b859a94be0e9d51b70ac0d7b68e72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailypress.com", "main_image": "http://www.trbimg.com/img-561f0387/turbine/dp-trump-targets-sanders-in-metro-richmond-visit-20151014", "site_section": "http://DailyPress.feedsportal.com/c/34257/f/623185/index.rss", "section_title": "Politics - Daily Press", "url": "http://www.dailypress.com/news/politics/dp-trump-targets-sanders-in-metro-richmond-visit-20151014-story.html", "country": "US", "title": "Trump targets Sanders in metro Richmond visit", "performance_score": 0, "site": "dailypress.com", "participants_count": 1, "title_full": "Trump targets Sanders in metro Richmond visit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T04:32:00.000+03:00", "replies_count": 0, "uuid": "ba98d8e2b70b859a94be0e9d51b70ac0d7b68e72"}, "author": "Alanna Durkin and Jill Colvin", "url": "http://www.dailypress.com/news/politics/dp-trump-targets-sanders-in-metro-richmond-visit-20151014-story.html", "ord_in_thread": 0, "title": "Trump targets Sanders in metro Richmond visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump targets Sanders in metro Richmond visit Donald Trump Steve Helber / AP Republican presidential hopeful Donald Trump greets supporters after a speech at a rally in Richmond, Va., Wednesday, Oct. 14, 2015. (AP Photo/Steve Helber) Republican presidential hopeful Donald Trump greets supporters after a speech at a rally in Richmond, Va., Wednesday, Oct. 14, 2015. (AP Photo/Steve Helber) (Steve Helber / AP) Alanna Durkin and Jill Colvin Associated Press \nRICHMOND, Virginia (AP) — Republican presidential front-runner Donald Trump had a new target for his barbs Wednesday night in Henrico County: Democratic contender Bernie Sanders. \nSpeaking in front of about 5,000 people at a rally at the Richmond International Raceway in VirginiaWednesday evening, Trump went after the independent senator from Vermont, who, like Trump, has defied political convention with his strong grassroots support and massive crowds. \nThe billionaire businessman said the self-described \"democratic socialist\" should instead be called a \"socialist-slash-communist\" and blamed him for pushing Hillary Rodham Clinton further to the left in her policy positions during Tuesday night's first Democratic debate. \n\"She's got to give everything away 'cause this maniac that was standing on her right is giving everything away, so she's following,\" he said, adding: \"We have to be careful.\" \nThe appearance marked Trump's first campaign appearance in the Virginia, which has an especially high bar for candidates to appear on the ballot, and his first since the debate between the Democratic contenders Tuesday evening. He planned a trip to Virginia Beach earlier this month, but cancelled it due to expected severe weather and flooding. \nTrump, who provided live commentary of the Democratic debate via Twitter, marveled at how different the gathering of five Democrats had been from the first two Republican showdowns, which were marked by frequent clashes. \n\"There was no attack!\" he said of Clinton's treatment, describing the last Republican face-off as \"like a reality television show.\" \nTrump's hourlong speech was also interrupted at one point by a group of about a dozen rowdy protesters who began jumping up and down, screaming \"Stop Trump!\" They were quickly pushed to the back of the crowd by angry Trump supporters and escorted out of the building by Trump security officials and police officers. \nEarlier on Wednesday, Trump's campaign released on an online ad also targeted Sanders, portraying the Vermont senator as too weak to lead. After a series of scary-looking images including Islamic State militants, an announcer declares, \"The world is a dangerous place. We need a tough, strong leader.\" \nIt then cuts to video of Sanders being interrupted by Black Lives Matter protesters at an event, accompanied by circus music, as the announcer says, \"And it's not this guy.\" \nWhile the two stand at very different sides of the ideological spectrum, their positions, including denouncing certain free trade deals and railing against the influence of money in politics, sometimes overlap.", "external_links": [], "published": "2015-10-15T04:32:00.000+03:00", "crawled": "2015-10-15T17:13:11.762+03:00", "highlightTitle": ""}