{"organizations": [], "uuid": "27642846d3c7810de6187974978269b74353c972", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1007/20151007__booth~p1.jpg", "site_section": "http://www.denverpost.com/localpolitics", "section_title": "Local Politics - The Denver Post", "url": "http://www.denverpost.com/adamsco/ci_28930030/city-council-seats-up-grabs-adams-county-this", "country": "US", "title": "City council seats up for grabs in Adams County this November", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "City council seats up for grabs in Adams County this November - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T20:01:00.000+03:00", "replies_count": 0, "uuid": "27642846d3c7810de6187974978269b74353c972"}, "author": "Megan Mitchell", "url": "http://www.denverpost.com/adamsco/ci_28930030/city-council-seats-up-grabs-adams-county-this", "ord_in_thread": 0, "title": "City council seats up for grabs in Adams County this November", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mayoral and ward seats throughout five metro cities in Adams County are going to the voters this fall, and the outcomes of those races may affect the direction of the cities themselves.\n\"The mayor and the council set the policy direction for how a particular community is going to move forward,\" said Sam Mamet, executive director of the Colorado Municipal League. \"And the citizens have a direct role in that. Their voice is extremely important to help guide the elected officials and the city staff.\"\nThe mayors of Thornton and Commerce City are running for reelection this year. Thornton Mayor Heidi Williams is running against Val Vigil, who is the current City Council member for Ward 2 and the mayor pro tem.\nIn Commerce City, incumbent Mayor Sean Ford has two opponents: residents Jim Riddell and Gordon Hamby, who is a life coach and motivational speaker. An election forum for Commerce City contenders will be held from 6:30 to 8:30 p.m., Oct. 8 at 7887 E. 60th Avenue. Residents can attend or watch it online at c3gov.com/video or Comcast Channel 8.\nIn Federal Heights, Mayor Joyce Thomas is term-limited, but four candidates are lined up, vying for her vacated seat at the end of the year. The current Ward 1 and 2 City Council members, Daniel Dick and Harold Thomas, are candidates, as are residents Angel Ferns, an educator, and Mark Stickel, who has been the mayor of Federal Heights in the past.\nAdvertisement Federal Heights held a candidate forum last month. The video recordings are on the city's website.\nThere are ward seats freeing up in all five metro cities in Adams County.\nThe city of Brighton Councilman for Ward 1, Kirby Wallin, is running unopposed, as is Lynn Baca of Ward 3. Ward 2 Councilwoman Mary Ellen Pollack is running against D. R. Dill, and Ward 4 Councilman J.W. Edwards has two opponents: Michele Romero-Lussier and Archie Demarest.\nAll four wards in Northglenn have seats that are going to voters this year. Jordan Sauers is running against Wayne Dodge in Ward 1; Becky Brown and Gaye Monroe are running for the Ward 2 seat to be vacated by Leslie Carrico; incumbent Marci Whitman is running unopposed in Ward 3. And Antonio Esquibel, Rosie Garner and Jenny Willford are all running for the Ward 4 seat vacated by Gene Wieneke.\nIn Thornton, Ward 1 Councilwoman Jenice \"JJ\" Dove is running against Jacque Phillips, Sandra Wolfe and Mary E. Payne. Ward 3 Councilman SomXai Vue is running for reelection against Cynthia M. Sarmiento, Michele Haedrich and Josh Zygielbaum. The city's Ward 3 council representative, Eric Tade, will not run for his seat again, but residents Adam Matkowsky, Alan Thurber and Craig Luckey are candidates. Ward 2 Councilman Eric Montoya is running unopposed.\nTwo Federal Heights City Council incumbents are being challenged for their seats this year. Current Councilman John Hamlin of Ward 1 will run against Sharon Richardson, and Councilman Ken Murphy of Ward 3 is running against Shari De Vries. A new Ward 2 candidate, Kevin Murphy, is running unopposed.\nAnd in Commerce City, Ward 2 Councilman Rick Teeter is running unopposed. Ward 4 Councilman Jim Benson is vacating his seat, and three residents, Michael Scanlon, Paolo Diaz and Ellen Haug are all competing for it. There are also two at-large seats open, with five candidates: Maria Gonzalez, Gene Leffel, Steven Douglas, Crystal Elliot and Anthony Stellato.\n\"Municipal officials do one thing more than anything else: They get problems presented to them and they solve them,\" Mamet said. \"And when the voters speak on an issue or they speak about a particular candidate, that's one way that those problems get solved.\"\nMegan Mitchell: 303-954-2650, mmitchell@denverpost.com or @Mmitchelldp\nAdams county voter service and polling\nWhen: Oct. 26 to Nov. 3, excluding Sundays\n• 8 a.m. to 5 p.m. Monday through Friday\n• 9 a.m to 2 p.m. on Saturdays\n• 7 a.m. to 7 p.m. on Election Day\nWhere:\n• Adams County Economic Development at 12200 N. Pecos St.,Westminster\n• Adams County Government Center /West Conference Center at 4430 S. Adams County Parkway, Brighton\n• Adams County Human Services at 7190 Colorado Blvd., Commerce City\n• Aurora Workforce Center at 3155 N. Chambers Rd Unit C., Aurora\n• Bennett Community Center at 1100 W. Colfax Ave., Bennett\n• Westminster Motor Vehicle at 8452 N. Federal Blvd., Westminster", "external_links": ["http://c3gov.com/video"], "published": "2015-10-08T20:01:00.000+03:00", "crawled": "2015-10-08T10:54:33.971+03:00", "highlightTitle": ""}