{"organizations": [], "uuid": "b701f86205bb7a5f1cca65596139f57958a376fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westernmorningnews.co.uk", "main_image": "http://www.westernmorningnews.co.uk/images/localworld/ugc-images/276272/Article/images/28012231/11191156.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "Western Morning News Politics RSS feed", "url": "http://www.westernmorningnews.co.uk/Shadow-Defra-Secretary-committed-vegan-address/story-28012231-detail/story.html", "country": "US", "title": "Shadow Defra Secretary and committed vegan to address major...", "performance_score": 0, "site": "westernmorningnews.co.uk", "participants_count": 1, "title_full": "Shadow Defra Secretary and committed vegan to address major...", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T16:12:00.000+03:00", "replies_count": 0, "uuid": "b701f86205bb7a5f1cca65596139f57958a376fb"}, "author": "WMNPBowern", "url": "http://www.westernmorningnews.co.uk/Shadow-Defra-Secretary-committed-vegan-address/story-28012231-detail/story.html", "ord_in_thread": 0, "title": "Shadow Defra Secretary and committed vegan to address major...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shadow Defra Secretary and committed vegan to address major farming conference By WMNPBowern | Posted: October 19, 2015 Kerry McCarthy, shadow Defra Secretary is to address the Oxford Farming Conference Shadow Defra Secretary and committed vegan to address major farming conference X \nCopy link to paste in your message / Comments (0) \nShadow Defra Secretary Kerry McCarthy, a committed vegan who has said in the past she wants to see livestock farming outlawed, is to speak to an audience of farmers and food producers at next year's Oxford Farming Conference. \nMs McCarthy, Labour MP for Bristol East, will join Owen Paterson, the former Defra Secretary who launched the four year pilot badger culls and the current Secretary of State Liz Truss as speakers at the conference in January. \nThe Oxford Farming conference is the annual forum for political, scientific and consumer debate about the farming and food industry. It attracts an audience of high profile delegates and speakers every year. \nMr Paterson, a noted Eurosceptic, will be taking part in a debate on the EU referendum with Ireland's Phil Hogan, the EU Agriculture Commissioner, on whether UK farming would be better off in our out of the EU. \nFour speakers with different perspectives will debate whether food as the new ‘medicine’ can create more opportunities for the sector. \nSusan Jebb, Professor of Diet and Population Health at the University of Oxford; Judith Batchelar of Sainsbury; Dr Pearse Lyons, Founder and President of Alltech, and James Withers, the CEO of Scotland Food & Drink will share the platform. \nThere will also be contributions from scientists including David Fischhoff, Chief Scientist at The Climate Corporation, the company acquired by Monsanto in 2013 for US$930 million; and Haven Baker of Idaho-based Simplot, a plant sciences business responsible for developing the ‘super-trait’ Innate potato variety. \nAlso speaking in this session will be Neil Perkins, an innovative sheep farmer from Wales and Julian Marks, MD of the pioneering Barfoots of Botley business. \nThis year's Frank Parkinson Lecture will be from Dr Bram Govearts from CIMMYT in Mexico. He is a Belgian, still in his 30s, described by conference organisers as someone who is challenging the status quo on how science can address the issue of farming’s sustainability, with his ‘Take it to the Farmer’ approach to R&D.", "external_links": [], "published": "2015-10-19T16:12:00.000+03:00", "crawled": "2015-10-19T17:06:22.996+03:00", "highlightTitle": ""}