{"organizations": [], "uuid": "46c14dd5c8bfd48b589e17d4b01baba22645781f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/akron/photo/jeffrey-conrad-24ced424bb1a0efb.png", "site_section": "http://www.cleveland.com/open/", "section_title": "Ohio Politics &amp; Election News | cleveland.com ", "url": "http://www.cleveland.com/akron/index.ssf/2015/10/jury_to_resume_deliberations_m.html", "country": "US", "title": "Jury to resume deliberations Monday in Cuyahoga Falls murder trial", "performance_score": 0, "site": "cleveland.com", "participants_count": 2, "title_full": "Jury to resume deliberations Monday in Cuyahoga Falls murder trial | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T02:04:00.000+03:00", "replies_count": 1, "uuid": "46c14dd5c8bfd48b589e17d4b01baba22645781f"}, "author": "Adam Ferrise, Northeast Ohio Media Group", "url": "http://www.cleveland.com/akron/index.ssf/2015/10/jury_to_resume_deliberations_m.html", "ord_in_thread": 0, "title": "Jury to resume deliberations Monday in Cuyahoga Falls murder trial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeffrey Conrad Summit County Jail AKRON, Ohio — The jury will resume deliberations Monday in the trial of a man accused of killing a 40-year-old Cuyahoga Falls mother.\nThe jury impaneled to hear Jeffrey Conrad's aggravated murder case deliberated for about one hour on Friday before leaving for the day.\nConrad, is charged in connection with the Aug. 28, 2014 death of Amanda Russell, was not present during the testimony phase of trial, nor was there a defense attorney to rebut the testimony presented Thursday and Friday by prosecutors.\nConrad acted as his own defense attorney throughout the pretrial portion of the case. He gave an opening statement Tuesday alongside appointed stand-by defense attorney Don Hicks.\nWhen the trial resumed Thursday morning , Conrad asked Summit County Common Pleas Judge Paul Gallagher to remove Hicks from the courtroom and waived his right to have a defense attorney. Conrad then waived his right to be present at the trial.\nGallagher explained the rights Conrad waived and told him it would result in a substantially higher probability that Conrad would be convicted.\nVeteran defense attorneys and legal experts say that scenario — that an aggravated murder trial goes forward with no defense attorney or defendant — is rare. No one could recall a similar case in recent Summit County history.\nExperts also said Ohio law allows for the trial to go forward without a defense if the defendant waives his rights and the judge makes a clear record of the waiver. Experts also said it could be difficult for Conrad to appeal if he's convicted.\nConrad will not be forced to be present at the reading of the verdict, but he will be present at sentencing.\nProsecutors on Friday presented evidence from the Summit County Medical Examiner, the Bureau of Criminal Investigation and Cuyahoga Falls police detectives who investigated the crime.\nProsecutors gave a final argument to the jury, and deliberations began about 3:30 p.m.\nConrad is accused of stabbing Russell to death at her home in the 3200 block of 8th Street. The two had previously dated and lived together. Russell ended the relationship after Conrad attacked her.\nConrad found out where Russell and her daughter moved and attacked Russell in the backyard. He stabbed her more than 50 times, according to prosecutors.\nRussell's daughter, who was 14 at the time of her mother's death, testified to finding her mother dead in the backyard after walking home from Cuyahoga Falls High School.\nDetectives later learned that Conrad bought a 10-inch hunting knife at Walmart three days prior to the killing. Cleveland Metroparks rangers arrested Conrad in Lake Erie. They found the hunting knife.\nInvestigators said the DNA tested positive for Russell's DNA. They also found Russell's blood on Conrad's clothing.\nConrad was interviewed by police and confessed to the murder three times, court record say.\nAfter the trial concludes, Conrad will face charges in Cuyahoga County Common Pleas Court in connection with a 2006 a cold-case rape of a Cleveland woman.\nHe will also face attempted aggravated murder charges stemming from an incident in the Summit County Jail, in which he is accused of stabbing a fellow inmate in the head with a shank he fashioned from a toilet plunger.", "external_links": [], "published": "2015-10-24T02:04:00.000+03:00", "crawled": "2015-10-24T01:45:06.274+03:00", "highlightTitle": ""}