{"organizations": [], "uuid": "5b1742ca3ae09f7943da7f89e0dc9879db7ea985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://yallpolitics.com/index.php/yp/atom/", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/cochran_nominee_to_represent/", "country": "US", "title": "Cochran nominee to represent Mississippi at the 2015 “Angels in Adoption” program", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Cochran nominee to represent Mississippi at the 2015 “Angels in Adoption” program", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T14:10:00.000+03:00", "replies_count": 0, "uuid": "5b1742ca3ae09f7943da7f89e0dc9879db7ea985"}, "author": "Frank Corder", "url": "http://yallpolitics.com/index.php/yp/post/cochran_nominee_to_represent/", "ord_in_thread": 0, "title": "Cochran nominee to represent Mississippi at the 2015 “Angels in Adoption” program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COCHRAN TO MEET MISSISSIPPI \"ANGEL IN ADOPTION\" WEDNESDAY Jerri Strickland of Jackson to be honored in Washington for Providing Foster Care, Adoption Services WASHINGTON, D.C. - U.S. Senator Thad Cochran (R-Miss.) is scheduled to meet Jerri Strickland of Jackson Wednesday as part of an annual national celebration of advocates for children and family involved in adoption and foster care programs. Cochran nominated Strickland to represent Mississippi at the 2015 \"Angels in Adoption\" program, which is sponsored by the nonprofit Congressional Coalition on Adoption Institute (CCAI). Strickland, the adoption director at the Mississippi Children's Home Services, has a 33-year career as a social worker dedicated to working with adopted children, birth families and adoptive families. The Senator is scheduled to host Strickland at his Washington office Wednesday afternoon. \"Jerri Strickland's career has been a demonstration of commitment to children and families, and I am pleased that her work to find safe and loving homes for children is being recognized by the Congressional Coalition on Adoption Institute,\" Cochran said. \"I appreciate her work to help shape the lives of hundreds of families in our state, and her focus on training new adoption advocates and specialists throughout Mississippi.\" As part of Mississippi Children's Home Services, Strickland has counseled foster and adopted children and their families through its private mental health clinic and therapeutic foster care program. Strickland is a National Council for Adoption master trainer, as well as a certified Training for Adoption Competency trainer through the Center for Adoption Support and Education. While in Washington this week, Strickland and other advocates from across the country are being honored for their work and meeting with elected officials to advocate adoptive and foster care policies. The nonprofit, nonpartisan CCAI advocates for increased awareness about children in need of a stable home environment, and supports eliminating barriers to adoption. CCAI, which does not receive government funding, was established in 2001 as an outgrowth of the Congressional Coalition on Adoption. Cochran and U.S. Senator Roger Wicker (R-Miss.) are members of the Congressional Coalition on Adoption for the 114th Congress. 10/6/15 Posted October 7, 2015 - 5:09 am YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-07T14:10:00.000+03:00", "crawled": "2015-10-09T11:51:21.354+03:00", "highlightTitle": ""}