{"organizations": [], "uuid": "d483926dbffa87b4c5207ee8700b304714d1b13c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/vasundhara%20raje_1_0_0_1_0_0_0_0.jpg", "site_section": "http://www.deccanchronicle.com/nation/politics", "section_title": "Politics | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151018/nation-politics/article/congress-demands-sacking-vasundhara-raje-over-mining-scam", "country": "US", "title": "Congress demands sacking of Vasundhara Raje over mining scam | Deccan Chronicle", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Congress demands sacking of Vasundhara Raje over mining scam | Deccan Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T02:16:00.000+03:00", "replies_count": 0, "uuid": "d483926dbffa87b4c5207ee8700b304714d1b13c"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151018/nation-politics/article/congress-demands-sacking-vasundhara-raje-over-mining-scam", "ord_in_thread": 0, "title": "Congress demands sacking of Vasundhara Raje over mining scam | Deccan Chronicle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 18, 2015, 20.12 Rajasthan Chief Minister Vasundhara Raje (Photo: PTI/File) New Delhi: Claiming that the Rajasthan government stands \"throughly exposed with mud on its face\" due to alleged irregularities in allotment of mines in the state, the Congress on Sunday demanded immediate sacking of Rajasthan Chief Minister Vasundhara Raje and a court-monitored CBI or SIT probe into the matter.\nThe reaction comes in the wake her suddenly cancelling allotments of 601 out of 653 mines in Rajasthan, an issue that had led to allegations of a Rs 45,000-crore scam.\nDemanding a Supreme Court-monitored CBI probe or SIT probe into the matter, Congress' chief spokesman Randeep Surjewala told reporters that the action was a \"panic reaction\" by Raje and \"admission and acceptance\" of a scam.\nShe must therefore immediately step down in the interest of a fair probe.\nThe Rajasthan chief minister has been facing Congress demands for resignation in the Lalit Modi episode too.\nHe alleged that the mines with an area of 22,085 hectares were allocated in \"contravention\" of the orders of the Supreme Court, Government of India as also the MMDR Act (Mines and Minerals (Development and Regulation) Act).\nIt was a \"wrongful\" allotment of state resources, he said, noting the Congress has already approached the CAG and CVC in the matter.\nWondering as to who got illegal gratification in the case, he said, the \"needle of suspicion stops at the door of the Chief Minister\".\nHe also sought immediate action from Prime Minister Narendra Modi against the Chief Minister, as the \"responsibility squarely lies with her\".\nSurjewala said while the Congress party's protests had forced the state government to cancel 601 Letters of Intent and mining permission letters, he sought to know why no action had been taken regarding 52 mines.\nOn Saturday, Rajasthan Governor Kalyan Singh had ordered a Lokayukta probe into alleged irregularities in allotment of mines following a recommendation by the chief minister.\nState Congress chief Sachin Pilot said the state government was forced to cancel the allotment at midnight and order an enquiry due to the massive pressure from the opposition.\n\"The action to cancel the allotment of mines shows they were wrongly allotted in the first place. BJP government in Rajasthan today stands thoroughly exposed with mud on its face as facts reveal that mines were allotted arbitrarily. The Chief Minister must step down so that a fair probe can be conducted into the over Rs 45,000 crore scam,\" Pilot said.\nThe former Union minister said the state's BJP government was in a \"tearing hurry\" to allot the mines.\nAlleging favouritism and corruption, Pilot said some of the mines had been allotted on a first-come-first-serve basis at \"lightening speed\" with approvals from several departments being secured in a matter of hours.\n\"The deep-rooted corruption at the highest levels of Rajasthan Government is there now for all to see,\" the Congress leader said.\n Congress corruption Vasundhara Raje Mining scam Also Read Congress not likely to join Hazare's agitation against Land Acquisition AAP says it has received Rs 20 crore in donations Congress, TDP to stall House on defections Congress chants 'poor, poor' only during elections, says Narendra Modi", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://twitter.com/share?url=http://www.deccanchronicle.com/151018/nation-politics/article/congress-demands-sacking-vasundhara-raje-over-mining-scam", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/vasundhara%20raje_1_0_0_1_0_0_0_0_0_0_0.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/vasundhara%20raje_1_0_0_1_0_0_0_0_0_0_0.jpg", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif"], "published": "2015-10-21T02:16:00.000+03:00", "crawled": "2015-10-20T15:46:57.822+03:00", "highlightTitle": ""}