{"organizations": [], "uuid": "2bde5013042db10838c41ca9d898a66ecd38af94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/f5/43/eaf0c1f54092a16ff620c714bb5c/bernie-sanders-gty-629.jpg", "site_section": "http://www.politico.com/politics", "section_title": "Politics News, Latest Headlines, Analysis &amp; Opinion - POLITICO", "url": "http://www.politico.com/story/2015/10/bernie-sanders-hillary-clinton-attacks-2016-215167", "country": "US", "title": "Sanders campaign: Clinton started it", "performance_score": 0, "site": "politico.com", "participants_count": 10, "title_full": "Sanders campaign: Clinton started it - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T11:02:00.000+02:00", "replies_count": 11, "uuid": "2bde5013042db10838c41ca9d898a66ecd38af94"}, "author": "Annie Karni", "url": "http://www.politico.com/story/2015/10/bernie-sanders-hillary-clinton-attacks-2016-215167", "ord_in_thread": 0, "title": "Sanders campaign: Clinton started it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bernie Sanders went negative on Hillary Clinton Saturday night — but only because she started it. That's what the Vermont senator's chief strategist told POLITICO on Monday after the high-stakes Jefferson-Jackson dinner in Iowa where Sanders, without explicitly naming Clinton, launched into an extended attack on her record and character. There, he reached as far back as her 2002 Iraq War vote to paint the front-runner as a politician often late to the game on key Democratic issues and one who changes position with the political winds.\n“What people saw from Bernie on Saturday night is his willingness to engage in a dialogue about these differences,” Tad Devine said, doubling down on the new attack strategy that included calling out her positions on the Trans-Pacific Partnership trade deal and the Keystone XL pipeline. “It’s been decided that we’re going to talk about differences between the candidates. But [Clinton] did so aggressively on the gun issue and by implying that somehow Bernie is engaging in implicit sexism.”\nSince the first debate, Clinton, also without naming Sanders, has pushed back on his assertion there that “all the shouting in the world” would not fix the country’s problem with gun violence.\n“I’ve been told to stop shouting about guns,” Clinton said at a rally in Virginia on Friday, a line she repeated Saturday during her remarks at the J-J dinner. “Actually I haven’t been shouting, but sometimes when a woman talks, some people think it’s shouting.”\nClinton team rushes to cash in on her strength By Gabriel Debenedetti\nSanders' team bristled at the suggestion that the self-described democratic socialist’s comment in the debate was inherently sexist and implied it served as the motivation for Saturday night's attacks.\n“We’d be very happy to have a straight-out debate on issues that matter to people and confine it to that,” Devine said. “But if they’re going to have a campaign that attacks Bernie on gun safety and implies he engages in sexism, that’s unacceptable. We’re not going to stand for that. We’re not going to sit here and let her attack him. We’re going to have to talk about other things if they do that. If they’re going to engage in this kind of attack, they need to understand we’re not going to stand there and take it.”\nThe Sanders camp for weeks has been aggressively pushing back on Clinton’s attempt to highlight gun control as an issue where she can run to the left of Sanders. At the debate, Clinton said Sanders' positions on gun control don't go far enough. “For someone from a rural state, it's fair to say Bernie Sanders has one of the best records on guns,\" Devine said, comparing his record with that of Virginia Sen. Mark Warner, who has an A rating from the NRA. Sanders, in contrast, has a D- grade from the pro-gun rights group.\nDevine seemed to issue a threat to camp Clinton about the tone of the debate in Iowa next month. “I hope they understand this can be an elevating debate for the Democratic Party,” Devine added.\nAttacking Clinton on her 2002 vote to support the Iraq War — one that she has admitted was wrong and apologized for — is “a very legitimate issue,” Devine said. “But [the campaign] doesn’t have to dwell on that. It can be about tomorrow. Sanders would prefer that election. But we will not accept what they’ve been doing for weeks now, which is trying to get to the left of Bernie Sanders” on the issue of guns. “That is not acceptable,” he said.\nWhen asked whether Sanders would continue on offense against Clinton, Devine said: “What Bernie’s going to do is continue to deliver a message — that the economy is rigged right now. That’s what he’s going to talk about. We would like a debate about that.”\nBill Clinton rallies Iowa crowd with talk of emails By Annie Karni and Glenn Thrush\nThe new tone of the race on the Democratic side is notable, especially for a candidate like Sanders, who has long prided himself for staying relentlessly on message and never having run a negative campaign ad in his life. “I believe in serious debates on serious issues,” he said in a CNN interview last May. “I’ve known Hillary Clinton for 25 years. Maybe I shouldn’t say this. I like Hillary Clinton. I respect Hillary Clinton.”\nIn an interview Sunday with ABC's George Stephanopoulos, Clinton campaign chairman John Podesta said Sanders' new tactic of painting Clinton as calculating — one that worked for Barack Obama — would backfire. \"Hillary has been consistent in the fight she has fought her entire career,\" Podesta said. \"She's out listening to people, talking to them about the problems that keep them up at night and she's providing affirmative solutions. She's looking to the future.\" When asked if Sanders had peaked, he said: \"Sanders seemed to have a course correction in the J-J dinner, from one in which he said he wasn't going to go negative to — to obviously focusing his fire on her.\"\nThe Clinton campaign added that Sanders’ new tack last weekend was an unfortunate turn.\n“Hillary Clinton has spent this campaign talking about who she'll fight for and what she'll do as president to move America forward,” said spokeswoman Christina Reynolds. “You saw this clearly on Saturday night, when Hillary offered a positive vision on how to help American families get ahead. In contrast, Sen. Sanders spent much of his speech looking to the past and attacking her. That's surprising and disappointing from a candidate who has said he was running a different kind of campaign and wouldn't go negative.\"\n<div", "external_links": [], "published": "2015-10-26T11:02:00.000+02:00", "crawled": "2015-10-26T22:35:53.620+02:00", "highlightTitle": ""}