{"organizations": [], "uuid": "8f8adfc38634b28b95f1f95a106aabc2a46a5b89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "snn.bz", "main_image": "http://i2.wp.com/snn.bz/wp-content/uploads/2015/10/Bill-and-Hillary-Clinton700.jpg?resize=700%2C391", "site_section": "http://SyndicatedNews.NET/feed/", "section_title": "Syndicated News - Live News Entertainment Political Music News", "url": "http://snn.bz/hillary-vs-evita/", "country": "US", "title": "HILLARY VS EVITA?", "performance_score": 0, "site": "snn.bz", "participants_count": 1, "title_full": "HILLARY VS EVITA?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:55:00.000+03:00", "replies_count": 0, "uuid": "8f8adfc38634b28b95f1f95a106aabc2a46a5b89"}, "author": "SyndicatedNews", "url": "http://snn.bz/hillary-vs-evita/", "ord_in_thread": 0, "title": "HILLARY VS EVITA?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWS , POLITICS \nNew posters featuring Hillary Clinton seem to be trying to make her “ high flying, adored ” with voters. What the American public does not realize is that to the majority of Central and Southern American historians, Evita was a prostitute before she became first lady. \nMadonna driving around 12th Avenue area of Manhattan after clubbing as she trolled for boys in her stretch seemed routine for the lie \nThe new images appeared at a campaign stop in San Antonio, Texas, where Clinton wooed Latino voters on Thursday. But according to NPR’s Tamara Keith, the campaign says they don’t know where the likeness came from. Banners were plastered all over the venue along with smaller signs and T-shirts. \nThe image of the black-clad Clinton profile may seem familiar to those who love either Argentinian history or musical theater — specifically Andrew Lloyd Webber’s Evita. \nThe 1978 musical told the story of Eva Peron, the actress turned first lady of Argentina. Seen as ruthless and cunning, she and her husband drew support from the descamisados, or the poor and the working class, to climb to power. She eyed her own political success as well, campaigning for vice president before she died from cancer at age 33. The musical was briefly revived on Broadway in 2012. \nThe story of “Evita,” as her admirers called her, found broader success in 1996 when the musical was adapted for the big screen, starring Madonna in the title role. \nThe new posters — which say “I’m with you” — seem to evoke images from both the musEva Peron, known as Evita, the second wife of Argentine President Juan Peron, was a radio and screen actress before her marriage in 1945. She became a powerful political influence and a mainstay of the Peron government. ical and the movie. \nBut even from that comparison, there could be some controversy. Peronism — the political movement and party she and her husband, Juan Peron, spurred — was seen as a socialist movement, with populist influences that championed labor. \nThe poster also seems to evoke the iconic image of President Obama created by artist Shepard Fairey during the 2008 campaign. \nThe iconic collage from Obama’s 2008 campaign, created by Shepard Fairey, was later installed in the National Portrait Gallery.", "external_links": [], "published": "2015-10-16T17:55:00.000+03:00", "crawled": "2015-10-17T05:16:24.059+03:00", "highlightTitle": ""}