{"organizations": [], "uuid": "93619bbb83af59b45438c75ef5ac0880b8197de0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03455/_John_McDonnell_3455201k.jpg", "site_section": "http://www.telegraph.co.uk/news/politics/rss", "section_title": "Politics News - UK Politics", "url": "http://www.telegraph.co.uk/news/politics/labour/11927538/Labour-backtracks-on-support-for-George-Osbornes-law-to-ensure-governments-balance-the-books.html", "country": "CH", "title": "Labour backtracks on support for George Osborne's law to ensure governments balance the books", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Labour backtracks on support for George Osborne's law to ensure governments balance the books", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T10:26:00.000+03:00", "replies_count": 0, "uuid": "93619bbb83af59b45438c75ef5ac0880b8197de0"}, "author": "Ben Riley-Smith", "url": "http://www.telegraph.co.uk/news/politics/labour/11927538/Labour-backtracks-on-support-for-George-Osbornes-law-to-ensure-governments-balance-the-books.html", "ord_in_thread": 0, "title": "Labour backtracks on support for George Osborne's law to ensure governments balance the books", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Labour Labour backtracks on support for George Osborne's law to ensure governments balance the books John McDonnell, the shadow chancellor, tells Labour MPs to vote against fiscal charter – just weeks after saying he would support the move Shadow Chancellor John McDonnell at the Labour Party Conference in Brighton Photo: Heathcliff O'Malley/The Telegraph By Ben Riley-Smith , and Laura Hughes 8:26AM BST 13 Oct 2015 Follow \nLabour will no longer back a legal commitment to balance the nation’s books after a major policy reversal by John McDonnell, the shadow chancellor. \nIn a move that George Osborne , the Chancellor, said showed Labour’s economic policy has “lurched from chaos to incredibility”, Mr McDonnell backtracked on a promise to support a measure ensuring a surplus is run in “normal” times. \nThe change in position comes just weeks after Mr McDonnell pledged to support the so-called fiscal charter to prove that he and Jeremy Corbyn, the new Labour leader, were not “deficit deniers”. \nAngus Robertson, the SNP’s Westminster leader, welcomed Labour's new opposition but said the reversal showed the party was in “chaos”, adding that its “credibility will be in ruins”. \nLabour MPs were left furious that the party had backtracked on a key economic policy just a fortnight after setting out its position on the eve of the party’s annual conference. \nOne Labour MP said a heated meeting between MPs on Monday night in which Mr McDonnell explained the change to colleagues was a “total shambles”. \nChris Leslie, the former Shadow Chancellor and Chief Secretary to the Treasury, criticised Mr McDonnell by saying he \"can't explain\" why he would support Mr Osborne's stance only to later reject it. \nMr Leslie told BBC Radio 4's Today programme that the party needed to be \"clear and consistent\" with its message, arguing that it should abstain on a vote on the issue before proposing its own motion. \nJeremy Corbyn at the Labour Party Annual Conference in Brighton Photo: Rex \nIt comes with Mr Osborne proposing a fiscal charter that would force the government to run a budget surplus within three years during “normal times” when there is no economic crisis. \n• McDonnell praised women who spat in employers tea over strike \nMr McDonnell told the Guardian last month that he would vote for the charter to prove that he and Mr Corbyn were serious about tackling the deficit. \n“We accept we are going to have to live within our means and we always will do – full stop. We are not deficit deniers,” he said at the time. \n“We will support the charter. We will support the charter on the basis we are going to want to balance the books, we do want to live within our means and we will tackle the deficit.” \n\nHowever on Monday it emerged that Mr McDonnell has now told Labour MPs to block the move in an attempt to back up the party’s “anti-austerity” credentials. \n\"As the nature and scale of the cuts Osborne is planning are emerging there is a growing reaction not just in our communities but even within the Conservative Party,\" Mr McDonnell said. \n\"The divisions over the cuts in tax credits to working families are just the first example of what we can expect as the cuts in other departments are exposed and the failure to find additional resources to bridge the growing expenditure gap in service areas like the NHS is revealed. \n“We will underline our position as an anti-austerity party by voting against the charter on Wednesday. And Labour will set out our plan for tackling the deficit not through punishing the most vulnerable and decimating our public services but by ending the unfair tax cuts to the wealthy, tackling tax evasion and investing for growth.” \nThe move was praised by some Left-wing commentators who said it showed the party was ready to tackle head-on the cuts being implemented by the Tories. \nHowever rival political parties said the reversal showed Labour under Mr Corbyn and Mr McDonnell could not decide a coherent, credible economic policy. \nMr Osborne said: \"Labour's economic policy has lurched from chaos to incredibility. \n\"Two weeks ago ‎they said they were going to vote for a surplus – now we know they want to keep on borrowing forever. That would be a grave threat to the economic security of working people‎. ‎\" \nThe SNP’s Mr Robertson said: “This is promising news, but it's disgraceful there has had to be any doubt that the Labour party would oppose Tory cuts, and it is astonishing that they were ever considering voting for the charter. \nHe added: “Once again it shows that Labour is a party in chaos, and is deeply divided on the issue of austerity as with so much else.\"", "external_links": [], "published": "2015-10-13T10:26:00.000+03:00", "crawled": "2015-10-13T11:32:16.741+03:00", "highlightTitle": ""}