{"organizations": [], "uuid": "fb0b8174da6200eb4363f9a34f0947842743ebb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-38cb4ad4a807c663dbfb7035343760e9.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/mcconnell-vows-to-repeal-climate-rules/article/2574793?custom_click=rss", "country": "US", "title": "McConnell vows to repeal climate rules", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "McConnell vows to repeal climate rules | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:31:00.000+03:00", "replies_count": 0, "uuid": "fb0b8174da6200eb4363f9a34f0947842743ebb9"}, "author": "John Siciliano", "url": "http://www.washingtonexaminer.com/mcconnell-vows-to-repeal-climate-rules/article/2574793?custom_click=rss", "ord_in_thread": 0, "title": "McConnell vows to repeal climate rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama's climate change agenda is a \"crusade for ideological purity,\" with little regard for the livelihoods of working Americans, said Senate Majority Leader Mitch McConnell Friday, vowing to repeal the president's far-reaching climate rules.\n\"Here's what is lost in this administration's crusade for ideological purity: the livelihoods of our coal miners and their families,\" McConnell said. \"Folks who haven't done anything to deserve a 'war' being declared upon them. These are Kentuckians who just want to work, provide for their families, and deliver the type of low-cost energy that attracts more jobs to Kentucky,\" he said.\nHis comments followed the publication of the administration's landmark climate rules, the Clean Power Plan, in Friday's Federal Register. Twenty-four states filed a lawsuit aimed to kill the overreaching regulation as soon as it was published.\nThe rules from the Environmental Protection Agency require states to cut one-third of their carbon emissions by 2030. Many scientists blame emissions from burning fossil fuels, such as coal, for driving manmade climate change.\n  Clinton wins endorsement from major public-sector union AFSCME A union for state and local government workers says she has the best chance among labor-friendly candidates.\nBy Sean Higgins • 10/23/15 1:41 PM McConnell comes from coal country, and the administration's far-reaching emission rules place coal-fired power plants directly in the crosshairs, according to the Republican leader. McConnell said he will be joining with Democratic Sen. Joe Manchin of West Virginia in introducing a resolution soon that would repeal the climate rules for new power plants.\n\"I have vowed to do all I can to fight back against this administration on behalf of the thousands of Kentucky coal miners and their families, and this [resolution] is another tool in that battle,\" McConnell said. Sens. Shelley Moore Capito, R-W.Va., and Heidi Heitkamp, D-N.D., introduced a resolution of disapproval earlier Friday to repeal the Clean Power Plan for existing power plants. Both resolutions apply the authority of the Congressional Review Act, which gives Congress the ability to repeal a regulation.\n\"The [resolutions] that we will file will allow Congress the ability to fight these anti-coal regulations,\" McConnell said.\n\nAlso from the Washington Examiner Romney admits: 'Without Romneycare, I don't think we would have Obamacare' Romney explained that his signature achievement helped pave the way for the Affordable Care Act's passage\nBy Al Weaver • 10/23/15 2:01 PM Top Story House Republicans vote to repeal key pieces of Obama's health law House GOP   Obamacare.\n  11:59 AM", "external_links": [], "published": "2015-10-23T15:31:00.000+03:00", "crawled": "2015-10-23T21:42:06.192+03:00", "highlightTitle": ""}