{"organizations": [], "uuid": "5660caa106c1ef802a95d2a7c45980552ec9aff6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://v.politico.com/images/1155968404/201510/2196/1155968404_4557572723001_151014-megynkelly-Still001.jpg?pubId=1155968404", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/ivanka-trump-on-donald-trumps-2016-presidential-run-214783", "country": "US", "title": "Ivanka Trump on how she feels about her dad's run: It's complicated", "performance_score": 0, "site": "politico.com", "participants_count": 9, "title_full": "Ivanka Trump on how she feels about her dad's run: It's complicated - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:40:00.000+03:00", "replies_count": 13, "uuid": "5660caa106c1ef802a95d2a7c45980552ec9aff6"}, "author": "Eliza Collins", "url": "http://www.politico.com/story/2015/10/ivanka-trump-on-donald-trumps-2016-presidential-run-214783", "ord_in_thread": 0, "title": "Ivanka Trump on how she feels about her dad's run: It's complicated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ivanka Trump believes the word “happy” is a complicated one to use regarding her feelings about her father running for president. Trump, who was speaking at the Fortune Most Powerful Women summit in Washington on Wednesday, was asked whether she is happy her father is running for president.\n“I’m incredibly proud of him, it’s an incredibly difficult thing to do,” Trump said about her billionaire businessman father who has been leading Republican polls. “As a citizen, I love what he’s doing. As a daughter, it’s obviously more complicated.”\nTrump said that the level of scrutiny regarding her father's candidacy is beyond what she expected.\nDonald Trump has ruffled feathers with his off-the-cuff style and controversial remarks about immigrants, women and his presidential rivals. Yet his daughter doesn’t see that as necessarily a bad thing.\n“Whether you disagree or you agree, I think people appreciate the candor of his dialogue,” she said. Based on his poll numbers, Ivanka said, “clearly a lot of people do” agree with him.\n“It’s sort of regardless of where you fall on the political spectrum. I think everybody can appreciate the fact that he’s creating dialogue,” she said.\nWhat a win looks like By Gabriel Debenedetti\nIvanka Trump — who is executive vice president of development and acquisitions at The Trump Organization — dismissed the feud between her father and Fox News host Megyn Kelly.\n“That was very sensationalized,” she said about what followed the first GOP debate where the real estate mogul felt he was unfairly questioned by Kelly, especially about past negative remarks about women. “It didn’t interest me that much.”\nShe pointed to her position as a female executive at the highest level of his company. “I would not be there if I wasn’t able to excel in that environment,” she said, adding that her father's \"deep belief\" in women made her who she is today.\n<div", "external_links": [], "published": "2015-10-14T18:40:00.000+03:00", "crawled": "2015-10-14T18:53:32.334+03:00", "highlightTitle": ""}