{"organizations": ["Democratic National Committee", "State", "Congress", "CNN", "Democratic", "Democratic Party"], "uuid": "a4192dd6257e21e83179fa44ebb17f3ff890430d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151008025719-being-moody-matin-omalley-election-2016-ar-origwx-00010604-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/09/politics/martin-omalley-2016-being-moody/index.html?eref=rss_politics", "country": "US", "title": "Fear and Loathing with Martin O'Malley", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Fear and Loathing with Martin O'Malley", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:24:00.000+03:00", "replies_count": 0, "uuid": "a4192dd6257e21e83179fa44ebb17f3ff890430d"}, "author": "", "url": "http://edition.cnn.com/2015/10/09/politics/martin-omalley-2016-being-moody/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Fear and Loathing with Martin O'Malley", "locations": ["Las Vegas", "Mexico", "Washington", "Washington State", "Maryland", "Colorado", "Vermont"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Hillary Clinton", "Lincoln Chaffee", "Martin O'Malley CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Fear", "Joe Biden", "Bernie Sanders", "Hunter S. Thompson", "O'Malley", "Jim Webb", "Martin O'Malley", "Sanders"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Fear and Loathing with Martin O'Malley Updated 1204 GMT (1904 HKT) October 9, 2015 JUST WATCHED Fear and Loathing with Martin O'Malley 03:38 Somewhere around Las Vegas on the edge of the desert (CNN) The first thing Martin O'Malley did after he climbed into CNN's red convertible headed for Las Vegas was turn down our offer of beer and a hit of ether to sustain him for the ride. The offer was an empty one anyway — we had neither — but the desert makes people do strange things. Such as, in the case of Democratic presidential candidate O'Malley, agreeing to be picked up in the desert in a car driven by a journalist just days just before the Democratic presidential debate. Our conversation turned to drug policy, and how O'Malley would respond as president if more states followed the lead of Colorado and Washington in legalizing marijuana. \"I think we need to have an open mind about that,\" said O'Malley, who signed a law while he was the governor of Maryland that legalized the drug for medicinal use. \"I think there's a lot we can learn from Colorado and Washington State. They seem to be keeping very good records. They understand they are the first in the nation, and I think we should be guided by what they are doing in Colorado increases harm or reduces harm.\" O'Malley added that he himself had never tried marijuana. Read More \"When I was in high school, it was considered very uncool,\" he said. O'Malley would face off Tuesday against Democratic rivals Hillary Clinton, Bernie Sanders, Jim Webb and Lincoln Chaffee in the first of six party-sanctioned presidential debates. So far, Clinton, a former Secretary of State, and Sanders, a Democratic socialist senator from Vermont, have received most of the attention from media and people who participate in public opinion polls. The latest CNN/ORC poll, conducted in September, showed O'Malley struggling to break out beyond a single percentage point. But as history has shown, nationally televised debates can be breakout opportunities for overshadowed candidates struggling to make their voices heard. Which may be why, O'Malley suggests, the Democratic National Committee has restricted the number of debates to six. Meanwhile, Republicans will hold twice as many before the primaries are finished next year. The late journalist Hunter S. Thompson wrote of \"fear and loathing\" on the campaign trail when he covered the presidential race in 1972, a theme of campaigning that still holds true in partisan politics today. \"It would appear to me that they are circling the wagons around what would appear to be this year's inevitable front-runner. There's always a tendency of parties to do that, but I think it shows a lot of fear about the future,\" O'Malley said, lamenting that the party waited until the second week of October to hold the first debate. \"I'll be the one candidate on that stage with 15 years of executive experience working on the frontlines of some pretty difficult issues like race, law enforcement, drug addiction as well as moving our state out of the recession.\" One can't help but wonder what it would be like for O'Malley had he launched his candidacy at another moment in history. On paper, he appears the man fit for a Democratic Party looking leftward for leadership: As Maryland governor, he ushered in a number of progressive reforms, like legalizing same-sex marriage in the state, ushering in tax increases on the wealthy, providing in-state tuition to children of undocumented immigrants and signing a gun-control bill banning dozens of weapons. As a presidential candidate, his platform is heavily geared to please the party's most liberal voters. Over the weekend, he outlined a plan for nationwide gun reform, and told CNN he would support a change in policy that allows victims of gun violence and their families to sue weapon manufacturers and sellers whose products are used for harm. He has put forth a college affordability plan that aims to make higher education \"debt-free,\" although he disagrees with Sanders' plan for free, universal public college. And on immigration, he says that if Congress fails to enact a plan to offer legal status to millions of undocumented immigrants living in the country, he plans to circumvent them. \"I intend as president to extend executive action to as many people as I possibly can,\" he told CNN, and dismissed that there was a need to tighten the border with Mexico. \"We have done more by way of securing the border and deportations as a nation than we have in a long, long time. If deportations and securing the border and running for-profit prisons and interning women and children behind fences were going to bring Republican lawmakers to compromise, that would have happened long ago.\" And yet, despite his record and campaign promises, O'Malley has been drowned out by Clinton's establishment credibility, Sanders' appeal to the party's most hardcore and intrigue around whether Vice President Joe Biden will enter the race. For now, O'Malley is resting his hope on time and the debates. \"I believe this campaign is heading into another phase now,\" he said. \"One of the rules of thumb in these presidential contests is that whatever candidate is surging in September is not the candidate who is surging in January.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-10-09T13:24:00.000+03:00", "crawled": "2015-10-09T14:07:42.779+03:00", "highlightTitle": ""}