{"organizations": [], "uuid": "9984569a7984b1031502ff377dc4c2e2ead4cd52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/26/us/27bar1/27bar1-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Politics.xml", "section_title": "NYT &gt; Politics", "url": "http://www.nytimes.com/2015/10/27/us/politics/its-illinois-v-illinois-in-a-duel-for-justices-attention.html", "country": "US", "title": "It’s Illinois v. Illinois in a Duel for Justices’ Attention", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "It’s Illinois v. Illinois in a Duel for Justices’ Attention - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:10:00.000+02:00", "replies_count": 0, "uuid": "9984569a7984b1031502ff377dc4c2e2ead4cd52"}, "author": "Adam Liptak", "url": "http://www.nytimes.com/2015/10/27/us/politics/its-illinois-v-illinois-in-a-duel-for-justices-attention.html", "ord_in_thread": 0, "title": "It’s Illinois v. Illinois in a Duel for Justices’ Attention", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " WASHINGTON — An extraordinary letter landed at the Supreme Court last month. In it, Illinois’s attorney general accused its governor of violating the law — by filing a brief at the court.\nThe accusation was but one salvo in the white-hot war over the fate of public unions, which hangs in the balance in a case to be argued early next year. It gave the court a taste of Illinois’s bruising politics and a sense of how closely the state’s officials, workers and unions are watching the case.\nThe contested brief , from Gov. Bruce Rauner, a Republican, said his state’s public unions “have negotiated wages and benefits that have unrealistically kept going up while the state economy has kept going down.”\nThe state’s attorney general, Lisa Madigan, a Democrat, was not happy to see the governor’s brief. Her top appellate lawyer wrote to the justices to alert them to “an unauthorized filing, purportedly on behalf of Bruce Rauner, governor of Illinois.”\n Related Coverage One State’s Struggle to Make Ends Meet: Why Illinois Is Without a Budget OCT. 26, 2015 “Neither the governor nor his attorneys have the authority, as a matter of state law, to represent the state or its officials in any court or to determine the state’s litigation positions,” the lawyer, Solicitor General Carolyn Shapiro, wrote.\nPhoto Lisa Madigan, the Illinois attorney general, last year. Ms. Madigan argues that Mr. Rauner is not authorized to represent the state in any court or to determine the state’s litigation positions. Credit M. Spencer Green/Associated Press As a purely legal matter, she seemed to have a point. The Illinois Supreme Court has said the state attorney general “is the chief legal officer of the state and the state government’s only legal representative in the courts.”\nThe governor’s general counsel, Jason Barclay, did not really contest the point in his own letter in response. The governor had not meant to speak for the state, Mr. Barclay wrote. Indeed, he said, the brief “makes very clear that it is filed only in his individual capacity.”\nIf there is support for that assertion in the brief, it is hard to find. The phrase “individual capacity,” for instance, does not appear in it.\nThe assertion in any event presented its own problems, Ms. Shapiro wrote in a third letter . “It would be unlawful,” she wrote, for “state employees paid from public revenues to represent Mr. Rauner in his individual capacity in any matter.”\nSidebar Coverage and consideration of developments in the world of law. A.C.L.U.’s Own Arguments May Work Against It in Voting Rights Case OCT 12 Chief Justice John Roberts Amasses a Conservative Record, and Wrath From the Right SEP 28 Virginia Has Solitary Confinement Case, if Justices Want It SEP 14 Supreme Court’s End-of-Summer Conference: Where Appeals ‘Go to Die’ AUG 31 Crystals Galore and a Devotion to Harley AUG 21", "external_links": ["http://caselaw.findlaw.com/il-supreme-court/1114190.html", "http://static01.nyt.com/images/2015/10/26/us/27illinois/27illinois-thumbStandard.jpg", "https://www.documentcloud.org/documents/2483673-madigan-2.html", "http://static01.nyt.com/images/2015/10/26/us/27bar2/27bar2-master315.jpg", "https://www.documentcloud.org/documents/2483672-rauner.html", "https://www.documentcloud.org/documents/2483671-madigan-1.html", "http://static01.nyt.com/images/2015/10/26/us/27bar2/27bar2-superJumbo.jpg", "http://www.scotusblog.com/wp-content/uploads/2015/09/00532542_1_14-915tsacBruceRauner_GovernorofIllinoisetal..pdf"], "published": "2015-10-26T17:10:00.000+02:00", "crawled": "2015-10-26T18:04:02.520+02:00", "highlightTitle": ""}