{"organizations": [], "uuid": "0ebd1724d0b621282e731da554da9b84563b9915", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcwashington.com", "main_image": "http://media.nbcwashington.com/images/1200*675/AP_597656294333.jpg", "site_section": "http://www.nbcwashington.com/news/politics/?rss=y&embedThumb=y&summary=y", "section_title": "NBC4 Washington - Politics", "url": "http://www.nbcwashington.com/news/politics/Ben-Carson-armed-Jews-would-have-diminished-Holocaust--331567202.html", "country": "US", "title": "Carson Defends Linking Gun Control to Holocaust", "performance_score": 0, "site": "nbcwashington.com", "participants_count": 1, "title_full": "Carson Defends Linking Gun Control to Holocaust", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:15:00.000+03:00", "replies_count": 0, "uuid": "0ebd1724d0b621282e731da554da9b84563b9915"}, "author": "DANIELLE ABREU and CATHY RAINONE", "url": "http://www.nbcwashington.com/news/politics/Ben-Carson-armed-Jews-would-have-diminished-Holocaust--331567202.html", "ord_in_thread": 0, "title": "Carson Defends Linking Gun Control to Holocaust", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Privacy Policy | More Newsletters AP Republican presidential candidate Dr. Ben Carson speaks during a news conference about healthcare issues, Friday, Oct. 2, 2015, in Ankeny, Iowa. Republican presidential candidate Ben Carson defended his controversial statement in which he suggested that the Holocaust would have been \"greatly diminished\" if German Jews had been armed with guns. “It is well known that in many places where tyranny has taken over, they first disarmed the people,” Carson said in an interview with George Stephanopoulos on ABC’s \"Good Morning America.”“There’s a reason that they disarm people. They don’t just do it arbitrarily.” Interactive 2016 N.H. Primary Candidate Tracker Carson was asked Thursday by CNN's Wolf Blitzer about an excerpt from his book \"A More Perfect Union,\" in which the retired neurosurgeon links the disarming on German citizens with the killing of 6 million Jews by Adolf Hitler's Nazi regime. In his book, Carson says \"the likelihood of Hitler being able to accomplish his goals would have been greatly diminished if the people had been armed.\" Meet the Candidates: Who's Running in 2016 The Anti-Defamation League condemned Carson's comments, noting the \"small number of personal firearms available to Germany's Jews in 1938 could in no way have stopped the totalitarian power of the Nazi German state.\" \"Ben Carson has a right to his views on gun control, but the notion that Hitler’s gun-control policy contributed to the Holocaust is historically inaccurate,\" National Director of the Anti-Defamation League Jonathan A. Greenblatt said in a statement. \"When they had weapons, Jews could symbolically resist, as they did in the 1943 Warsaw Ghetto Uprising and elsewhere, but they could not stop the Nazi genocide machine. Dorm to Table: College Student Opens Restaurant in His Room Greenblatt added that \"Nazism and anti-Semitism,\" not gun control, caused the Holocaust. Carson called the response by the Anti-Defamation League \"total foolishness,\" adding that he'd be happy to discuss it \"in depth\" with anybody. Top News Photos of the Week Earlier this week, Carson drew criticism by calling for potential victims of mass shootings to rush the attacker. In an interview on Wednesday, Carson also offered a shaky explanation of his opposition to raising the debt ceiling, appearing to confuse the borrowing limit with the federal budget. Updated Tunisian Democracy Group Wins Nobel Peace Prize \"Let me put it this way: if I were the president, I would not sign an increased budget. Absolutely would not do it. They would have to find a place to cut,\" Carson said in a radio interview on \"Marketplace.\" In a statement to NBC News, Carson later said, “critics have blown this way out of proportion” but does make clear that he understands \"raising the debt ceiling is about paying for obligations the federal government has incurred.” The Associated Press contributed to this report.", "external_links": [], "published": "2015-10-09T18:15:00.000+03:00", "crawled": "2015-10-09T18:58:15.588+03:00", "highlightTitle": ""}