{"organizations": [], "uuid": "63ae65b3e70c6a85f6e3927ecf21a852e52bd674", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/2a/7eeae0ece8ed20ac860f8d49b9c9c7/media:b4a14cb58967408c9f7c4f60f52da9e3USPopeFrancis.JPEG", "site_section": "http://www.usnews.com/opinion", "section_title": "Political Blogs, Opinions, Commentaries and Forums on Current Issues - US News Opinion - US News", "url": "http://www.usnews.com/opinion/articles/2015/09/30/pundits-react-to-pope-francis-meeting-with-kim-davis", "country": "US", "title": "Pundits React to Pope Francis Meeting With Kim Davis - US News", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Pundits React to Pope Francis Meeting With Kim Davis - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "63ae65b3e70c6a85f6e3927ecf21a852e52bd674"}, "author": "USNews", "url": "http://www.usnews.com/opinion/articles/2015/09/30/pundits-react-to-pope-francis-meeting-with-kim-davis", "ord_in_thread": 0, "title": "Pundits React to Pope Francis Meeting With Kim Davis - US News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Views You Can Use: When the Pope Met Kim Davis What everyone's saying about Pope Francis' secret meeting with the Kentucky county clerk. No neat narratives for Francis.\nBy Rachel Brody Sept. 30, 2015 | 3:00 p.m. EDT + More It seems the rumor mills have whirred and sputtered their way to truth: Last week in Washington, Pope Francis met privately with Kim Davis, the Kentucky county clerk who was jailed, and released, after refusing to issue marriage licenses to same-sex couples.\nVatican spokesman Rev. Federico Lombardi confirmed Wednesday that the meeting took place, The New York Times reports, but would not elaborate. In an interview with ABC News, Davis spoke openly about the meeting. \"I put my hand out and he reached and he grabbed it, and I hugged him and he hugged me,\" Davis recounted. \"And he said, 'Thank you for your courage.'\" Inside the Vatican first reported on Tuesday that the two had met, and Davis' lawyers affirmed the account in a statement later that day.\n[ RELATED: Pope Francis, Kim Davis and Faith in Politics ]\nTelling the former clerk to \"stay strong\" and handing her a rosary isn't \"a blanket endorsement of everything Davis has said or done,\" argues John L. Allen Jr. at the Crux, but it certainly means something. First, Francis is affirming his support for religious freedom, he writes, and giving voice to those in the U.S. who defend it. Second, he's likely assuaged conservative fears about the Church \"going soft on same-sex marriage,\" and third, he's made clear his alignment with American bishops, which some have doubted. \"Francis is a figure who utterly defies the usual left/right divides,\" writes Allen, \"equally capable of meeting Kim Davis and embracing poor immigrant children at a Harlem school – seeing both as part of a continuum of concern for human dignity.\"\nBut Noah Feldman at Bloomberg View accuses the pope of \"sending the wrong message\" by meeting with Davis. Francis is implying, he writes, \"that there's something sympathetic or even legitimate about public official refusing to do his or her job when religious teaching goes the other way.\" Davis was \"sworn to uphold the law,\" he writes, and that's what she should have done, regardless of her religious views.\nJim Geraghty says the story is \"delightful\" for essentially pulling the rug out from under liberal media coverage of Francis thus far. \"Francis's meeting with Davis is rather spectacular disruption to the narrative of the progressives' perfect pope,\" he writes. \"It is hard to interpret his meeting with her as anything less than moral support and/or an endorsement, and a rebuke to everyone who considered her a moral evil, a theocratic fascist, an evil intolerant bigot, and so on.\"\n[ READ: Kim Davis Met Privately With Pope Francis ]\nElizabeth Bruenig also calls the pope's meeting a \"delectable story,\" but for disrupting both liberal and conservative narratives. It exposes, she argues, America's struggle to fit Francis into our \"political binary.\" Those who support the pope were skeptical it ever happened (and incredulous that it did). But \"[f]or the fervent Davis supporter and Francis hater,\" she writes, \"the meeting must be dismissed by going after the pontiff for allegedly carrying out the tete-a-tete in private – proof that he's a coward who covets liberals' esteem.\"\nThis typecasting, writes Bruenig, is exactly what the pope was likely hoping to avoid. \"Whoever you are, Kim Davis is either your beset champion or your bête noire,\" she writes, but the pope is more nuanced: supportive of conscientious objectors and encouraging of openness to the gay community. To be pigeonholed in one category or the other, she argues, is \"a fate that compromises his entire project – Popes are meant to be transcendent, after all.\"\nTAGS: religion Pope Francis LGBT rights", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdrkws%3Fsrc=usn_tw&via=usnews&text=Pundits%20React%20to%20Pope%20Francis%20Meeting%20With%20Kim%20Davis", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdrkws%3Fsrc=usn_gp", "http://www.nationalreview.com/corner/424835/why-pope-francis-meeting-kim-davis-matters-jim-geraghty", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdrkws%3Fsrc=usn_rd&title=Pundits%20React%20to%20Pope%20Francis%20Meeting%20With%20Kim%20Davis", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdrkws%3Fsrc=usn_fb", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdrkws%3Fsrc=usn_su", "http://www.bloombergview.com/articles/2015-09-30/pope-francis-sends-wrong-message-to-kim-davis", "http://www.nytimes.com/2015/09/30/us/county-clerk-kim-davis-who-denied-gay-couples-visited-pope.html", "http://www.newrepublic.com/article/122973/pope-francis-met-kim-davis-confounding-culture-warriors-again", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdrkws%3Fsrc=usn_li&title=Pundits%20React%20to%20Pope%20Francis%20Meeting%20With%20Kim%20Davis&summary=What%20everyone%27s%20saying%20about%20Pope%20Francis%27%20secret%20meeting%20with%20the%20Kentucky%20county%20clerk.&source=U.%20S.%20News", "http://www.cruxnow.com/papal-visit/2015/09/30/what-it-means-that-pope-francis-met-kim-davis/", "http://abcnews.go.com/US/exclusive-kim-davis-recounts-secret-meeting-pope-francis/story?id=34143874"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T02:17:28.211+03:00", "highlightTitle": ""}