{"organizations": [], "uuid": "29889d1d3f1be37cceca65ad47dc1688087408c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/rnc-2016/photo/2015/10/02/18883754-standard.jpg", "site_section": "http://www.cleveland.com/open/", "section_title": "Ohio Politics &amp; Election News | cleveland.com ", "url": "http://www.cleveland.com/rnc-2016/index.ssf/2015/10/jeb_vs_marco_this_time_with_spirit_marco_rubio_in_the_news.html", "country": "US", "title": "Jeb vs. Marco, this time with spirit: Marco Rubio in the news", "performance_score": 0, "site": "cleveland.com", "participants_count": 4, "title_full": "Jeb vs. Marco, this time with spirit: Marco Rubio in the news | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:56:00.000+03:00", "replies_count": 3, "uuid": "c38e3749c420c4af0f7593994bc1f2c2c478e391"}, "author": "Stephen Koff, Northeast Ohio Media Group Washington Bureau Chief", "url": "http://www.cleveland.com/rnc-2016/index.ssf/2015/10/jeb_vs_marco_this_time_with_spirit_marco_rubio_in_the_news.html#post-0", "ord_in_thread": 0, "title": "Jeb vs. Marco, this time with spirit: Marco Rubio in the news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today's Marco Rubio news: Two candidates from the same state, competing to be president -- it's a narrative that keeps giving, especially since conventional wisdom once held that one candidate (Jeb Bush) would dominate the race as top dog and the other (Rubio) would lag.\nThat's no longer true based on current national polling . And so it's \"Jeb vs. Marco,\" yet again, courtesy of Jeb Bush's remarks Thursday on MSNBC's \"Morning Joe\" program and Wednesday on CNN .\n\"Jeb Bush took a dig at his longtime friend, and now rival, Marco Rubio on Thursday, suggesting that the senator from Florida does not have the leadership skills to be president. Mr. Bush, the former governor of Florida, emphasized that he was the one calling the shots when they were both lawmakers in the state and said that the election of President Obama showed how risky it was voting for someone based on their leadership potential\": New York Times .\nSalon had some fun with this headline: \"Jeb Bush vs. Marco Rubio gets ugly: Florida man attacks friend during job interview.\"\n\"The reason Jeb is still in this race is because establishment Republicans and moderate GOP voters haven't yet found someone other than him to coalesce around. Scott Walker was a threat to Bush on this front until he revealed himself to be an inept and thoroughly unprepared presidential candidate. But ever since Walker's exit from the race, Rubio's numbers have been rising and he's even surpassed Jeb in the polling averages. Right now Bush has to worry that donors, influential party figures and voters are going to decide that the young, charismatic Latino fellow is a stronger pony than the patrician gaffe machine with the politically radioactive surname\": Salon .\nJeb, it seems, \"is showing fresh signs of nervousness about his Florida neighbor and one-time protégé,\" says Politico.\n\"For months, the two have studiously avoided criticizing each other, rarely— if ever— mentioning the other by name.\" But that changed this week, starting with an interview Bush gave Wednesday to CNN's Dana Bash.\n\" In a television interview , Bush framed himself as a leader, and Rubio as a follower. He also backhanded Rubio with the worst possible diss a GOP candidate could make— Bush compared him to President Barack Obama\": Politico .\nThe Tampa Bay Times adds some historical perspective. It notes that the former Florida governor once thought so highly of Rubio that he pushed his name as a potential vice presidential candidate. Bush's words:\n\"Look, he has more experience than Barack Obama had when he ran, more practical experience. And certainly got the intellectual acumen and the fortitude to be a good president. And I have a special place in my heart for him, it's hard to describe the pride I feel for his incredible success, and how well he has moved into the job of being United State Senator with humility, not trying to be an arrogant guy, to learn the trade if you will. He's got great people in Washington, I really admire him.\"\nThat was in 2012: Tampa Bay Times .", "external_links": ["http://www.cnn.com/2015/09/30/politics/jeb-bush-marco-rubio-donald-trump/index.html", "http://www.tampabay.com/blogs/the-buzz-florida-politics/jeb-bush-didnt-always-question-marco-rubios-experience/2247908", "http://www.realclearpolitics.com/epolls/2016/president/us/2016_republican_presidential_nomination-3823.html", "http://www.nytimes.com/politics/first-draft/2015/10/01/jeb-bush-questions-marco-rubios-leadership-acumen/", "https://www.youtube.com/embed/kVLew43CwJA", "http://www.politico.com/story/2015/10/jeb-bush-marco-rubio-game-on-214326", "http://elections.huffingtonpost.com/pollster/2016-national-gop-primary#!selected=Bush,Rubio", "http://www.salon.com/2015/10/02/jeb_bush_vs_marco_rubio_gets_ugly_florida_man_attacks_friend_during_job_interview/"], "published": "2015-10-02T17:56:00.000+03:00", "crawled": "2015-10-02T18:55:17.464+03:00", "highlightTitle": ""}