{"organizations": ["AMP People’s Choice", "AMP People’s Choice Scholarship Humanitarian"], "uuid": "729faa6cf669993288b35c13a5b700028698e8df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00415/humanitarian-receives-amp-peoples-choice-scholarship.htm", "country": "US", "title": "Humanitarian receives AMP People’s Choice Scholarship", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Humanitarian receives AMP People’s Choice Scholarship", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T06:29:00.000+03:00", "replies_count": 0, "uuid": "729faa6cf669993288b35c13a5b700028698e8df"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00415/humanitarian-receives-amp-peoples-choice-scholarship.htm", "ord_in_thread": 0, "title": "Humanitarian receives AMP People’s Choice Scholarship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Humanitarian receives AMP People’s Choice Scholarship Friday, 23 October 2015, 4:29 pm \nFor immediate release \nDedicated humanitarian receives AMP People’s Choice Regional Scholarship \nYoung, driven Southlander and humanitarian, Paige Kirk (25), is the recipient of the 2015 AMP People’s Choice Scholarship, receiving $10,000 to help her on her journey to achieving her dream of giving vulnerable children a chance in life through her organisation, Happy2Help. \nPaige Kirk says: “My passion is helping others, so I started Happy2Help so that I could make clothing packs and school lunches for children in need. But this is not enough! I am determined to complete my counselling qualifications which will allow me to support the children we are failing as a country.” \n“These children need not just physical help, but emotional support as well I know I have the skills to provide an entire service to my local community and this really drives me!” \nHappy2Help has provided more than 70 clothing packs in 6 months and now works with 12 local schools providing lunches. \n“We also provide for lots of desperate one-off situations, for example foster families needing baby gear, house fires etc. I devote my life and voice to children and it's my dream to change the lives of those who need support the most,” continues Paige. \n“My next step is to be able to provide for all 25 schools in our region and give all of Southland access to our clothing packs. By providing clothing, sports gear, lunches and emotional support to vulnerable children, we are improving the future of our community by allowing children to have the best chance at life.” \nThis year, all National and Study Start Scholarship applicants were automatically eligible to apply for an AMP People’s Choice Scholarship. \nJeff Ruscoe, Chief Customer Officer at AMP says: “This year there were certainly many deserving applicants, but Paige Kirk was a clear favourite in the People’s Choice vote.” \n“As well as helping people own their tomorrow and achieve their dreams and passions in life, the AMP People’s Choice Scholarship is about giving the public the opportunity to have a say on where they want the funds to go.” \n“We encourage applicants to tell their friends, family and colleagues how passionate they are about their ‘thing’ and generate further support and connections by asking their networks to vote through the People’s Choice voting site.” \n“Many of the applicants’ ‘thing’ benefits others in the wider community, so what better opportunity to get them involved as well!” \nThis year the People’s Choice category attracted an impressive 42,000 votes from the general public, showing just how much support there is out there in the local community for inspirational Kiwis who are doing amazing things. Paige was up against other 1,400 applicants and collected an impressive 1,100 votes from the general public for her ‘thing’. \nPaige continues: “I’m so thrilled to be awarded an AMP People’s Choice Scholarship. The money received will change my life and the lives of the children I support. It will allow me to continue to grow Happy2Help and complete my studies.” \n“Once qualified, I will open counselling to children and families. This will allow the children to be warm, fed and supported emotionally. I would like to thank AMP for providing me with this amazing opportunity.” \nPaige received $10,000 in the AMP People’s Choice Scholarship by receiving the most votes on Facebook – nearly 40,000 votes were recorded across New Zealand for all People’s Choice applicants. \nFor more information, visit doyourthing.co.nz . \nENDS \nNotes to Editor: \nAbout AMP Scholarships \n• In total, there are 12 National Scholarships available – each consists of one payment of up to a maximum amount of $10,000.• There are nine Regional People’s Choice Scholarships and one National People’s Choice Scholarship available – each Regional People’s Choice Scholarship consists of one payment of up to a maximum amount of $5,000 and the National People’s Choice Scholarship consists of one payment up to a maximum amount of $10,000.• Full terms & conditions can be found on www.doyourthing.co.nz", "external_links": [], "published": "2015-10-23T06:29:00.000+03:00", "crawled": "2015-10-23T08:48:14.912+03:00", "highlightTitle": ""}