{"organizations": [], "uuid": "714f8320187e848c86d4654ee6c806b565244111", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-2bb78ec6e10ccefbcb61cb49cc0f0686.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/ryan-agrees-to-conditional-run-for-house-speaker/article/2574550?custom_click=rss", "country": "US", "title": "Ryan agrees to conditional run for House speaker", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Ryan agrees to conditional run for House speaker | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T23:27:00.000+03:00", "replies_count": 0, "uuid": "714f8320187e848c86d4654ee6c806b565244111"}, "author": "Susan Ferrechio", "url": "http://www.washingtonexaminer.com/ryan-agrees-to-conditional-run-for-house-speaker/article/2574550?custom_click=rss", "ord_in_thread": 0, "title": "Ryan agrees to conditional run for House speaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rep. Paul Ryan told his colleagues he would run to be the next House speaker, but only if the major House Republican factions unite behind his candidacy and agree to a set of conditions he outlined Tuesday night.\n\"Basically I made a few requests for what I think is necessary and I asked to hear back from my colleagues by the end of the week,\" the Wisconsin Republican said following a closed-door meeting with the House GOP. \"If I can truly be a unifying leader, I will gladly serve.\"\nRyan made the announcement following days of speculation about whether he would run after he repeatedly declined requests from lawmakers, including House Speaker John Boehner, that he seek the gavel. Ryan said Tuesday night he reconsidered the decision \"with reluctance,\" citing concerns about the impact on his young family.\nRyan met privately with House Republicans to discuss the conditions they must agree to in order for him to run to succeed Boehner, who is planning to step down Oct. 30. Ryan said he'd give lawmakers until Friday to think over his offer. Then, he is expected to assess where the caucuses stand, and make his decision.\nMore from the Washington Examiner Trump's first 100 days ... of dominating the polls According to a new poll, Trump continues to maintain a healthy lead with 32% support among Republicans.\nBy Al Weaver • 10/21/15 8:36 AM If he can't get support from the major GOP groups in the House, including the moderate Republican Study Committee and the conservative Republican Study Group and House Freedom Caucus, Ryan said he would stay on as chairman of the House Ways & Means Committee.\n\"It's in their hands,\" Ryan told reporters after the meeting. \"I'll leave it up to my colleagues to decide if I am that unifying person.\"\nRyan told the members he is open to rules changes, which have been under discussion in recent weeks. But he said the changes must be decided by everyone, signaling he won't necessarily agree to the demands of the House Freedom Caucus, a group of about 40 conservative and libertarian lawmakers who are seeking to end the traditional \"top down\" style of GOP House management.\nRyan also said he would seek to eliminate a House rule allowing any member to file a motion to \"vacate the chair,\" which is a vote for the removal of the speaker. Such a motion was introduced last summer by Freedom Caucus member Mark Meadows, R-N.C., in a bid to try to oust Boehner.\nBut he extended a potential olive branch to the disgruntled conservatives.\nAlso from the Washington Examiner Reagan biographer: Trump a 'natural step forward' for GOP Craig Shirley, author of three books on Reagan, said Trump win the Republican nomination next year.\nBy Eddie Scarry • 10/21/15 8:29 AM \"We need to update our House rules so everyone can be a more effective representative,\" Ryan said, adding that he wanted to avoid \"constant leadership crisis\" that have plagued the GOP majority in recent years stemming from infighting.\nRyan forewarned the GOP conference that, if elected speaker, he won't spend much time on the road fundraising, which is typically a major responsibility that comes with the job and is key to ensuring there are enough funds to elect a Republican majority.\nRyan cited his family, including three young children, \"who are in the formative, foundational years of their lives,\" as his reason for avoiding travel.\nInstead, Ryan said he would \"spend more time communicating our message.\"\nRyan said if he becomes speaker, he wants to change the job and the House vision, which he said has not resonated with the public who take an increasingly dim view of Congress.\nAlso from the Washington Examiner Tea Party Caucus chair: Ryan's conditions 'entirely unreasonable' \nPaul Ryan's   fell flat with at least one key conservative Tuesday night, who said his choice is still Rep. Daniel Webster, a member who is pledging to end the \"top down\" leadership approach.\nRep. Tim Huelskamp, R-Kan., head of the House Tea Party Caucus, called Ryan's conditions for becoming the next speaker \"entirely unreasonable.\" Those conditions include a request that the House eliminate a rule that allows a member to seek a vote to oust the speaker. That provision is part of the original rules of the House, authored by Thomas Jefferson.\n\"No other speaker I know of would ever have as much power as Paul Ryan asked for himself,\" Huelskamp said following a meeting among Republican lawmakers.\nBy Susan Ferrechio • 10/20/15 10:18 PM \"The people we serve, they do not feel we are delivering on the job they hired us to do,\" Ryan said. \"We have become the problem. If my colleagues entrust me to become speaker, I want us to become the solution.\"\nRyan said he spent the congressional recess at home in Janesville, Wis., deliberating about whether to seek speaker's gavel and fearing the impact it might have on his kids.\n\"I am genuinely concerned with the consequences my decision will have on them,\" he said.\nBut he added, \"My greatest worry is the consequence of not stepping up, of my own kids asking, when the stakes were so high, why didn't you do all you could do?\"\nI am out and supporting @RepPaulRyan for Speaker. Right person at the right time.— Jason Chaffetz (@jasoninthehouse) October 20, 2015 \nTop Story Tea Party Caucus chair: Ryan's conditions 'entirely unreasonable' Paul Ryan's   fell flat with at least one key conservative Tuesday night.\nBy Susan Ferrechio • 10/20/15 10:18 PM", "external_links": [], "published": "2015-10-20T23:27:00.000+03:00", "crawled": "2015-10-21T16:30:58.205+03:00", "highlightTitle": ""}