{"organizations": [], "uuid": "67e6f3e4ed13b9ab504ca04f09a552189a415b96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://yallpolitics.com/index.php/yp/atom/", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/sheriff_group_endorses_mike_hurst_for_attorney_general/", "country": "US", "title": "Sheriff group endorses Mike Hurst for Attorney General", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Sheriff group endorses Mike Hurst for Attorney General", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T00:02:00.000+03:00", "replies_count": 0, "uuid": "67e6f3e4ed13b9ab504ca04f09a552189a415b96"}, "author": "Staff of Y'all Politics", "url": "http://yallpolitics.com/index.php/yp/post/sheriff_group_endorses_mike_hurst_for_attorney_general/", "ord_in_thread": 0, "title": "Sheriff group endorses Mike Hurst for Attorney General", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sheriff group endorses Mike Hurst for Attorney General COAST SHERIFFS ENDORSE HURST Republican Attorney General nominee Mike Hurst worked with local law enforcement as federal prosecutor, pledges continued joint effort to clean up Mississippi At a press conference in front of the U.S. Courthouse in Gulfport today, Republican Attorney General candidate Mike Hurst thanked Hancock County Sheriff Ricky Adam, Harrison County Sheriff Melvin Brisolara, Jackson County Sheriff Mike Ezell for their endorsements and support of his campaign. Flanked by Adam, Brisolara and Ezell, Hurst said he was thankful for their support and thankful for the work they do every day to keep their communities safe. Hurst said Mississippi needs a full time prosecutor as Attorney General, not a career politician. Hurst continued, “Mississippians need to know when local law enforcement calls for backup in the Attorney General’s Office, I will be there. I will be a full-time, present, on-the-job Attorney General.” “As a federal prosecutor, I did a lot of public corruption cases in this building behind me. And in those cases we worked with local law enforcement such as these gentlemen to bring down the corrupt officials who had taken advantage of Mississippi citizens. I want to be your Attorney General to make that office work again for you, to work with local law enforcement, to work with the U.S. Attorney’s Office and the FBI,” said Hurst. Harrison County Sheriff-Elect Troy Peterson also endorsed Hurst but could not attend the press conference. He said in a statement, “As Sheriff Elect of Harrison County and a law enforcement veteran, I want an Attorney General I can call personally, tell him we have a problem and know that when I hang up the phone, the case is being handled professionally and promptly. Mike Hurst will be that Attorney General. Mike is serious about crime but more importantly, convicting those who commit those crimes. I am certain that Mike will respond to law enforcement, assist with our criminal investigations and be the positive advocate we need in Mississippi by helping law enforcement across this state to protect the citizens were are all sworn to serve. I am convinced Mike Hurst will put Mississippi priorities first, protect the people of this great state and uphold the Office of Attorney General with integrity and transparency.” Mike Hurst Press Release Posted September 30, 2015 - 3:01 pm YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-01T00:02:00.000+03:00", "crawled": "2015-10-01T08:11:55.772+03:00", "highlightTitle": ""}