{"organizations": [], "uuid": "f3b20bebdcba90fb966d96d1fae1a1129a0653c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellinghamherald.com", "main_image": "http://www.bellinghamherald.com/news/local/bqejlc/picture38192781/ALTERNATES/LANDSCAPE_1140/pot_plants", "site_section": "http://www.bellinghamherald.com/news/politics-government/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Politics & Government News | BellinghamHerald.com &", "url": "http://www.bellinghamherald.com/news/politics-government/marijuana/article38192784.html", "country": "US", "title": "Are there pesticides in your pot? New Washington rules make it easier to find out", "performance_score": 0, "site": "bellinghamherald.com", "participants_count": 1, "title_full": "Are there pesticides in your pot? New Washington rules make it easier to find out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:29:00.000+03:00", "replies_count": 0, "uuid": "f3b20bebdcba90fb966d96d1fae1a1129a0653c0"}, "author": "Bob Young \nThe Seattle Times", "url": "http://www.bellinghamherald.com/news/politics-government/marijuana/article38192784.html", "ord_in_thread": 0, "title": "Are there pesticides in your pot? New Washington rules make it easier to find out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 8, 2015 Are there pesticides in your pot? New Washington rules make it easier to find out Under new state rules, cannabis growers and processors will have an incentive to avoid pesticides and improve product labeling. Steve Bloom Staff photographer i Order Reprint of this Story \nWashington state announced new rules for pesticide testing in pot as the first product liability lawsuit was filed against the pot industry in Colorado over pesticide use. \nNew emergency rules , which took effect this week in Washington, do not make testing for pesticides mandatory. Instead, they create a system that aims to give legal pot merchants and consumers who want it some assurance that their pot does not contain residue of unapproved pesticides. \nUnder the rules, growers and processors can elect to get an “enhanced seal of approval,” according to a state Department of Health (DOH) official, if they comply with new standards for labeling, safe handling, employee training and pesticide screening. Their products could then carry a logo saying as much. \n“I know patients are concerned, so this is a way of trying to put some fears at rest and say here is a product that’s been tested for pesticides,” said Kristi Weeks, DOH policy counsel. \nThe state’s recreational-pot rules require testing for mold, microbes and other foreign matter. But they do not mandate pesticide testing because it can be expensive and complex, and none of the state’s certified labs has that capacity. \nBut state regulators believe more labs will invest the $300,000 to $500,000 in equipment to test for specific pesticides. \nWashington’s pot industry has largely policed itself when it comes to pesticides, although the state Liquor and Cannabis Board (LCB) has fined growers for using unauthorized pesticides, fertilizers and “other crop production aids” that have been found through inspections, some based on complaints. \nA few growers and processors have noted the pesticides they use on their product labels, but most do not. \nThe new rules flow from state law that will bring medical marijuana into legal pot shops next July. \nWith interest rising about pesticides in pot, public-health officials in King County distributed a guide Monday titled “What Marijuana Users Should Know” about pesticides. \nPesticides are used routinely in agriculture and aren’t necessarily harmful, the guide explained. “There have been no cases of human illness identified due to pesticides in marijuana,” the guide explained. \nBut there’s concern among pot users, particularly medical-marijuana patients, that research on pesticides has focused on oral ingestion of food rather than inhalation of pot. Marijuana-specific research is lacking because of the federal ban on all pot. \nThe lawsuit in Colorado was filed by two consumers who do not allege they’ve been sickened, but say they would not have inhaled pot they bought from the state’s largest grower, LivWell, had they known it was treated with a potentially dangerous pesticide, Eagle 20. \nEagle 20 is not on Colorado’s use of approved pesticides, nor is it on Washington’s 25-page list of approved pesticides . \nAccording to The Denver Post, the lawsuit filed in Denver District Court alleges the fungicide myclobutanil in Eagle 20 turns to cyanide when heated and consumers ingest the gas when smoking pot treated with the pesticide. \nTesting done by The Oregonian newspaper revealed that some medical-marijuana products in Oregon were laced with pesticide residue. \nIt was just coincidence, Weeks said, that Washington’s emergency rules took effect the same day the Colorado suit was filed. \nThe logo designating enhanced compliance, including pesticide screening, will be developed later this month, Weeks said. Growers and processors can attain that status as soon as they and state-certified labs are ready, she said. \nWeeks said labs can’t test for all unapproved pesticides, so they’ll be initially asked to look for unapproved pesticides that are most likely to be abused, she said. Over time, the state will expand the list of chemicals. Related content", "external_links": [], "published": "2015-10-08T17:29:00.000+03:00", "crawled": "2015-10-09T01:23:02.581+03:00", "highlightTitle": ""}