{"organizations": [], "uuid": "3a7c4fc81ee02b331649f5eab791c7a1151ba7f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/68/4a/d923d4ca461aa23de6733adb4486/151005-king-editorial.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/05/5-things-to-know-about-the-new-education-secretary-john-king", "country": "US", "title": "5 Things to Know About the New Education Secretary John King", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "5 Things to Know About the New Education Secretary John King - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a7c4fc81ee02b331649f5eab791c7a1151ba7f5"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/05/5-things-to-know-about-the-new-education-secretary-john-king", "ord_in_thread": 0, "title": "5 Things to Know About the New Education Secretary John King", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5 Things to Know About the New Education Secretary Arne Duncan's replacement has gone to battle with teachers unions, and they're not happy about his promotion. Deputy Education Secretary John King delivers remarks after being nominated by President Obama to be the next head of the Education Department in the White House on Friday.\nBy Lauren Camera Oct. 5, 2015 | 10:31 a.m. EDT + More Last week, U.S. Secretary of Education Arne Duncan shocked the education world and announced he'll be resigning in December. Riding out the rest of the Obama administration as acting secretary will be John King, who is currently the No. 2 at the department. Here's what you need to know about him:\n1. King was most recently the commissioner of New York state public schools . In this role, King oversaw New York's schools during a period of tumultuous change driven largely by the state's winning of a federal Race to the Top grant. He supervised the implementation of the Common Core State Standards , new teacher evaluations based in part on student test scores and the expansion of charter schools, among many other significant policy changes.\n2. King says he owes his life to public school teachers : \"Education can be the difference between life and death,\" King said last week during a press conference at the White House where President Barack Obama introduced him as the new acting education secretary. \"I know that's true because it was for me. New York City public schools teachers are the reason I am alive. They are the reason I became a teacher and the reason I'm standing here today.\" King had a difficult childhood. By the age of 12, both of his parents, who were public school teachers, had died. After that, he lived with his half-brother, who had alcohol problems, and later his aunt and uncle. School, he said, was his sanctuary.\nRELATED\nArne Duncan to Step Down as Education Secretary 3. King has gone to battle with teachers unions: Like his predecessor Duncan, King had to stand up to teachers unions while commissioner of New York's public schools, a stance that hasn't historically been the norm for Democrats. In 2014, the state teachers union called for his resignation, and he's not exactly being welcomed into his new role with open union arms, either. \"We are disappointed to hear that Deputy Secretary of Education John King Jr. will be appointed as the acting secretary,\" Randi Weingarten, American Federation of Teachers, said last week in a statement. \"No one doubts John's commitment to children, but his tenure as New York state's education commissioner created so much polarization in the state with parents and educators alike that even Gov. Andrew Cuomo is finally doing a mea culpa over the obsession with testing. We can only hope that King has learned a thing or two since his tenure in New York.\"\n4. King is big on charter schools: In 1999, King founded a charter school just outside Boston – the Roxbury Preparatory Charter School – that became the highest-performing urban middle school in Massachusetts. He helped open several others in New York City as the managing director of Uncommon Schools, a nonprofit charter management organization that focuses on closing achievement gaps and preparing low-income students for college. The organization oversees 24 schools throughout the city, as well as in upstate New York, Newark, New Jersey, and Boston.\n5. King hasn't been OK'd by Congress for his current position and probably won't be the permanent secretary: When King first came on board at the Education Department, he was a \"senior adviser\" who was delegated the duties of the deputy secretary, even though he'd been tapped to replace Jim Shelton, who at the time was second-in-command at the department. His adviser title allowed him to shirk congressional approval, a laborious and increasingly political process. When Duncan says his final goodbye to the department in December, King's new position will be acting secretary, which once again will allow him to serve during the remaining year of the Obama administration without getting the OK from Congress.\nTAGS: education policy Duncan, Arne Department of Education", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdwppr%3Fsrc=usn_gp", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdwppr%3Fsrc=usn_rd&title=5%20Things%20to%20Know%20About%20the%20New%20Education%20Secretary%20John%20King", "http://www.huffingtonpost.com/john-king/education-the-difference_b_148855.html", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdwppr%3Fsrc=usn_tw&via=usnews&text=5%20Things%20to%20Know%20About%20the%20New%20Education%20Secretary%20John%20King", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdwppr%3Fsrc=usn_su", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdwppr%3Fsrc=usn_li&title=5%20Things%20to%20Know%20About%20the%20New%20Education%20Secretary%20John%20King&summary=Arne%20Duncan%27s%20replacement%20has%20gone%20to%20battle%20with%20teachers%20unions%2C%20and%20they%27re%20not%20happy%20about%20his%20promotion.&source=U.%20S.%20News", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdwppr%3Fsrc=usn_fb"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T17:47:51.602+03:00", "highlightTitle": ""}