{"organizations": [], "uuid": "bfec4c2175dc7cc2b8bb8cdd02ddeb4fce23dd2f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/137/632_288x265_157425780_288x265.png", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/One-Year-Later-Hundreds-of-Tor-Challen-1", "country": "IE", "title": "One Year Later, Hundreds of Tor Challenge Relays Still Active", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "One Year Later, Hundreds of Tor Challenge Relays Still Active - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:47:00.000+03:00", "replies_count": 0, "uuid": "bfec4c2175dc7cc2b8bb8cdd02ddeb4fce23dd2f"}, "author": "Content Admin", "url": "https://www.oximity.com/article/One-Year-Later-Hundreds-of-Tor-Challen-1", "ord_in_thread": 0, "title": "One Year Later, Hundreds of Tor Challenge Relays Still Active", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As of this month, 567 relays from our 2014 Tor Challenge are still up and running—more than were established during the entire inaugural Tor Challenge back in 2011. To put that number in perspective, these nodes represent more than 8.5% of the roughly 6,500 public relays currently active on the entire Tor network, a system that supports more than 2-million directly connecting clients worldwide.\nTor is a tool that protects privacy on the Internet by routing web traffic through a series of nodes, or “relays,” creating a network of servers that act as way stations on data’s journey from point A to point B. By providing an indirect, randomized path for Web traffic, the Tor network divorces the user’s IP address (and therefore their location) from the content they are viewing. Picture a kid passing notes in class through a random series of students, as opposed to a letter sent straight to its destination: traffic routed through Tor isn’t stamped with a return address and is difficult to trace back to its sender if it’s intercepted.\nThe more relays present in the Tor network, the better traffic will be disguised as it travels through that network. This service has helped to ensure anonymity for whistleblowers and journalists handling sensitive information, domestic abuse survivors whose safety might be compromised by revealing their whereabouts, citizens of countries that actively censor the Internet, and others who don’t want to be tracked or traced online.\nThe 2014 Tor Challenge campaigned to strengthen the Tor network by encouraging people to set up new Tor nodes. We joined forces with the Free Software Foundation , Freedom of the Press Foundation, and the Tor Project, ultimately inspiring the creation of more than 1,600 new relays over a period of three months.\nWe extend our thanks and congratulations to the individuals behind the 567 relays still active more than a year after the Tor Challenge’s conclusion.\nAs promised, we’re celebrating these privacy guardians with limited-edition t-shirts and stickers. If you see someone sporting one of these, you can thank them for helping to protect privacy on the Internet:\nAnd here are the stickers that folks who still have Tor nodes up will be receiving:\nInspired to use the Tor network? You can download and install the Tor Browser Bundle, which includes the Tor browser itself and the software needed to run it, through our handy Surveillance Self-Defense guide. The guide also has plenty of other useful information on protecting your data, secure deletion, safely attending protests, and more. Even if you’re not worried about anonymizing your own online activity, you can still set up your own Tor relay to make everyone on the network—including some of the Internet’s most vulnerable users—a little safer.", "external_links": ["https://metrics.torproject.org/networksize.html", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/137/634_1000x667_518727613_555x370.jpg", "https://www.eff.org/deeplinks/2011/07/eff-campaign-increases-number-tor-relays-13-4", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/137/633_800x500_342669182_555x346.png", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/137/632_288x265_157425780_288x265.png", "https://www.torproject.org/docs/tor-doc-relay.html.en", "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/001/137/635_650x433_641268799_555x369.jpg", "https://ssd.eff.org/en/module/how-use-tor-mac-os-x"], "published": "2015-10-13T03:47:00.000+03:00", "crawled": "2015-10-13T07:32:32.742+03:00", "highlightTitle": ""}