{"organizations": [], "uuid": "5a53cf76d2c5115f2869af19d43521b10a708f7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "article.wn.com", "main_image": "http://i.ytimg.com/vi/QTf2wwr7PwE/0.jpg", "site_section": "http://rss.wn.com/English/keyword/politics", "section_title": "WN.com - Politics News", "url": "http://article.wn.com/view/2015/10/08/Recycling_still_on_the_up_in_Wales_Welsh_Government/", "country": "GB", "title": "Recycling still on the up in Wales (Welsh Government)", "performance_score": 0, "site": "wn.com", "participants_count": 1, "title_full": "Recycling still on the up in Wales (Welsh Government) - Worldnews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5a53cf76d2c5115f2869af19d43521b10a708f7a"}, "author": "wn.com", "url": "http://article.wn.com/view/2015/10/08/Recycling_still_on_the_up_in_Wales_Welsh_Government/", "ord_in_thread": 0, "title": "Recycling still on the up in Wales (Welsh Government)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Source: Welsh Government) The 2014/15 recycling figures show that Welsh local authorities collectively met the 52% target, achieving 56.2%, an increase of 1.9% compared to the previous year. The new figures continue the year on year improvement in the numbers recycling waste in Wales, which has seen an 8-fold increase in recycling rates since the 7% rate achieved in 2000/01. The 2014/15 Landfill Allowances Scheme (LAS) report (external link), which was also published today, shows that local authorities are also continuing to significantly reduce the amount of biodegradable municipal waste they send to landfill. Authorities sent 256,162 tonnes of biodegradable waste to landfill in 2014/15 compared to 345,022 tonnes in 2013/14, a reduction of 26%. Since the scheme started in 2004, Welsh local authorities have achieved a 70% reduction in the amount of biodegradable waste they landfill. Welcoming the new figures Natural Resources Minister Carl Sargeant said: 'I congratulate householders and local authorities of Wales for this fantastic achievement, and I thank them for their commitment to recycling more and sending less waste to landfill than ever, maintaining our position as the best recyclers in the UK. This has been made possible by the strong partnership between the Welsh Government and local authorities across Wales.' distributed by This content was issued by Welsh Government on the 2015-10-08 and was initially posted on wales.gov.uk. It was distributed, unedited and unaltered, by noodls on 2015-10-08 10:59:04 UTC. The original issuer is solely responsible for the accuracy of the information contained therein. (noodl: 30236437)", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:51:35.908+03:00", "highlightTitle": ""}