{"organizations": [], "uuid": "3b8cfb6e06fa8754951922a54a33ecdff5bb019c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/libertarian/2015/10/can-400-ppm-co2-provide-the-heating-required-by-the-agw-hypothesis-2621304.html", "country": "US", "title": "Can 400 ppm CO2 Provide the Heating Required by the AGW Hypothesis? | Libertarian", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Can 400 ppm CO2 Provide the Heating Required by the AGW Hypothesis? | Libertarian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T06:23:00.000+03:00", "replies_count": 0, "uuid": "3b8cfb6e06fa8754951922a54a33ecdff5bb019c"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/libertarian/2015/10/can-400-ppm-co2-provide-the-heating-required-by-the-agw-hypothesis-2621304.html", "ord_in_thread": 0, "title": "Can 400 ppm CO2 Provide the Heating Required by the AGW Hypothesis? | Libertarian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nThis is a thought experiment. The idea is to make a simple test of the plausibility or even possibility of the claim of the catastrophic man-made or anthropogenic global warming (AGW) hypothesis that the increase from about 300 ppm (parts per million) of carbon dioxide in the atmosphere over the last 120 years or so has caused a surface temperature increase of 1°C or 1K. Now I know that this is a concept very much ignored by the advocates of catastrophic man-made global warming, but I am going to assume that the Law of Conservation of Energy, which they have not explicitly refuted, still holds. I have a high level of confidence in this law of physics. Let us start out with the simplifying assumption that every air molecule has the same heat capacity at constant pressure. This means that the same amount of heat is required to raise the temperature of each kind of molecule by 1K. We will discuss the correction for this below. If the addition of 100 molecules of CO 2 to the prior 300 molecules/ 1 million air molecules has caused all air molecules near the surface of the Earth to have a 1K temperature increase, then given Conservation of Energy, each of the CO 2 molecules has to gain an additional temperature of T a given by: 1,000,000 (1K) = 400 T a T a = 2500 K, because of the proportional relationship of heat, a form of energy, to the temperature of the gas molecules. Now let us allow for the fact that the heat capacities per mole at constant pressure of the molecules in air are not equal. We want the values per mole because that gives them for equal numbers of molecules, while the per gram values of heat capacity do not. We have for each gas heat capacity values of: N 2 , 29.12 J/K mol. O 2 , 29.38 J/K mol. Ar, 20.79 J/K mol. H 2 O, 28.03 J/K mol. CO 2 , 36.94 J/K mol. Air Average, 29.07 J/K mol. We discover now that a 1 K increase in the temperature of a molecule of CO 2 gives it more additional energy than the average air molecule needs to raise its temperature by 1K. So, the temperature per CO 2 molecule that we calculated above will not need to be quite so large. The required temperature T a will only be: T a = (2500 K) / (36.94 / 29.07) T a = 1967 K Now, recall that this is only the additional temperature of each CO 2 molecule required to cause a 1K temperature increase spread evenly over every air molecule in equilibrium at the Earth’s surface. The same infra-red absorbing properties claimed to give CO 2 molecules this amazing power, would also be acting in an atmosphere with a mere 100 ppm of CO 2 . That effect would require each of those molecules to heat up to at least as high a temperature per molecule. In fact, each additional 100 ppm of CO2 has a diminishing effect on heating other gases according to the proposed mechanism for such heating. The mean free path length for each infra-red absorption event by a molecule of CO 2 becomes shorter and shorter as more CO 2 molecules are added. The size of the effect for additional molecules becomes less and less. Consequently, the temperature per CO 2 molecule if the CO 2 concentration were 100 ppm would be greater than 1967K. The further increase in the temperature upon going from 100 ppm to 200 ppm would also be greater than that for going from 300 ppm to 400 ppm, as would be the temperature increase on going from 200 ppm to 300 ppm. Each concentration increase of 100 ppm would cause a smaller temperature increase than the previous one did. Consequently, the temperature required per CO 2 molecule to be transferred to all air molecules by collisions to establish an equilibrium temperature would be substantially greater than 4 times 1967 K. This required temperature per CO 2 molecule is then substantially greater than 7868 K or 7595°C. The sun is the source of this energy and its surface temperature is only 5778K or 5505°C. A cooler body cannot heat another body to a temperature greater than its own temperature. The highest temperature anything could be raised to on Earth by solar radiation is further diminished by the distance of the Earth from the sun and the fact that radiation emitted by the Earth is mostly directed at temperatures in space of about 4K. So, we have performed a simple thought experiment based on what we are told is the central fact of the catastrophic man-made global warming hypothesis and found that the hypothesis requires an impossible effect. The U.S. government and many state governments have spent many tens of billions of taxpayer dollars on research into the catastrophic man-made global warming effects and have not discovered its failure as a scientific hypothesis. How is this possible? Is it really bad and ignorant management or is it that they do not really care about the physics? Yet, the advocates of catastrophic AGW have claimed the carbon dioxide molecule a pollutant, despite it being a necessity for plant and animal life on Earth. They are fully prepared to destroy many people’s jobs, raise the cost of energy use, and make energy sources much less reliable in all developed countries in the name of this insane AGW hypothesis. They are only too happy to slow down or even prevent the people of less developed countries from ever having as high a standard of living as today’s developed countries have. They would do these horribly evil acts based on a nonsense hypothesis that violates the most established and central laws of physics. This is only possible if one is very, very ignorant of physics, or one hates mankind, or one has a most unethical power-lust.", "external_links": [], "published": "2015-10-17T06:23:00.000+03:00", "crawled": "2015-10-17T09:43:00.694+03:00", "highlightTitle": ""}