{"organizations": ["Alaska Federation of Natives", "AP"], "uuid": "b864a66609aa3dfbb79ec9f6435d8bd2d7fa1ec2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmbfnews.com", "main_image": "http://images.worldnow.com/AP/images/9052723_G.jpg", "site_section": "http://www.wmbfnews.com/Global/category.asp?C=146173&clienttype=rss", "section_title": "WMBF - News - Politics", "url": "http://www.wmbfnews.com/story/30300464/activist-hopes-convention-suicide-leads-to-more-awareness", "country": "US", "title": "Activist hopes convention suicide leads to more awareness", "performance_score": 0, "site": "wmbfnews.com", "participants_count": 0, "title_full": "Activist hopes convention suicide leads to more awareness", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:27:00.000+03:00", "replies_count": 0, "uuid": "b864a66609aa3dfbb79ec9f6435d8bd2d7fa1ec2"}, "author": "", "url": "http://www.wmbfnews.com/story/30300464/activist-hopes-convention-suicide-leads-to-more-awareness", "ord_in_thread": 0, "title": "Activist hopes convention suicide leads to more awareness", "locations": ["Anchorage", "Alaska"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Baker", "RACHEL D'OROAssociated Press", "Bill", "Bill Walker"], "text": "Shop 84300 Activist hopes convention suicide leads to more awareness (AP Photo/Mark Thiessen). John Baker, the 2011 winner of the Iditarod Trail Sled Dog Race, speaks to the crowd gathered Friday, Oct. 16, 2015, at the Alaska Federation of Natives conference in Anchorage, Alaska. The Inupiat Eskimo musher and Gov. Bill ... (AP Photo/Mark Thiessen). John Baker, the 2011 winner of the Iditarod Trail Sled Dog Race, speaks Friday, Oct. 16, 2015, at the Alaska Federation of Natives conference in Anchorage, Alaska. The Inupiat Eskimo musher and Gov. Bill Walker announced the ... (AP Photo/Mark Thiessen). Emergency vehicles line up outside the Deni'ina Convention Center in downtown Anchorage, Alaska, Saturday, Oct. 17, 2015. Police responded after a person died after falling or jumping from the top-level concourse at the three-... By RACHEL D'OROAssociated Press \nANCHORAGE, Alaska (AP) - An Alaska suicide-prevention activist is hoping a man's very public suicide at an Alaska Native conference will propel people across the state to reach out to others who may be hurting, she said Monday. \nBarbara Franks said it may never be known what led a man to jump three floors to his death Saturday inside the Dena'ina Convention Center at the close of the Alaska Federation of Natives conference in Anchorage. Franks wonders how long he was suffering to come to that point. \n\"How many times was he trying to talk to someone?\" she said. Suicide is personal to Franks, a Tlingit woman who has worked to help others since her 23-year-old son took his own life nearly 18 years ago. \nSaturday's death of a 49-year-old man at Alaska's largest yearly gathering of indigenous people comes as Alaska Natives grapple with disproportionately high rates of suicide, including the recent back-to-back suicides of four young adults in the western Alaska village of Hooper Bay. Regarding the Anchorage convention death, police spokeswoman Anita Shell said there was no indication a suicide note was left by the man, whose body was sent to the state medical examiner's office for an autopsy. \nAFN officials are still trying to comprehend what happened and working through their shock, according to spokesman Ben Mallott. Officials will determine the next steps to take within a week, he said. \nDuring last week's convention, the Hooper Bay deaths were noted by speakers, including Gov. Bill Walker, who said nothing causes him greater concern than these suicides among young Alaskans. On Friday, Walker also joined 2011 Iditarod champion John Baker on stage to announce a new statewide initiative calling for individuals to volunteer as ambassadors in their own communities to promote healing from suicides, abuse and neglect. \nFranks said she supports the initiative, which is called \"Alaskans Changing Together\" and run by Baker's fiancee, Katherine Keith. Franks believes the involvement of community members can go a long way to helping vulnerable individuals. Ambassadors could work as a sort of neighborhood watch for suicide prevention -with locals also acting as surrogate family members for those who need them, according to Franks, who said she is glad to see that effort backed by Baker, an Inupiat Eskimo. \n\"Right now we need a hero,\" she said. \nAbout 30 people from six communities, including Anchorage, have signed up to be ambassadors so far, Keith said. She expects to see increasing traffic on the initiative website. \n\"We want to really focus on growing the positives in people's lives,\" she said. \"We can't necessarily change what happened, but we can change things in our own lives, and we can take action in our lives and in the lives of those around us.\" \nWalker's office declined to comment Monday on Saturday's death. \n\"It's always unfortunate when an Alaskan's life is cut short,\" Walker spokeswoman Katie Marquette wrote in an email. \"However until we have more information about what happened on Saturday afternoon, it is inappropriate for the Governor's office to comment.\" \nIn response to the recent rash of suicides, state officials plan to meet this week with tribal and social service partners to review existing suicide prevention resources, statewide suicide-prevention coordinator James Gallanos said. \n___", "external_links": [], "published": "2015-10-20T02:27:00.000+03:00", "crawled": "2015-10-20T02:34:15.868+03:00", "highlightTitle": ""}