{"organizations": [], "uuid": "b402c29ae93dd9b217e68da6c6cfdaf5d4f22db6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8927555_G.jpg", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30169385/russia-confounds-us-with-syria-military-moves", "country": "US", "title": "Russia confounds US with Syria military moves", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Russia confounds US with Syria military moves - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "b402c29ae93dd9b217e68da6c6cfdaf5d4f22db6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30169385/russia-confounds-us-with-syria-military-moves", "ord_in_thread": 0, "title": "Russia confounds US with Syria military moves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MATTHEW LEE\nAP Diplomatic Writer NEW YORK (AP) - More than 1,500 days ago, the Obama administration first declared that Syrian President Bashar Assad's \"days are numbered.\"\nHe's still there, though, and a convergence of Western trepidation and Russian resolve could strengthen his position further. But it also could set the stage for a long-sought political transition leading to the end of the Assad family's 45-year rule.\nIn either case, Assad's Russian and Iranian backers could arguably claim victory.\nBut there's also a painful third possibility. Russia's decision to intervene with airstrikes this week could just prolong and exacerbate an already brutal conflict that has spawned the largest refugee crisis since World War II and helped the rise of the radical Islamic State group that, Russian Foreign Minister Sergey Lavrov says, aims to establish a caliphate from \"Portugal to Pakistan.\"\nThe Obama administration has been criticized, first for a hesitating response to the civil war over the past four years and now for its hesitance to take a firm position on Russia's moves.\nAdministration officials have alternately welcomed a Russian role, provided it is limited to fighting the Islamic State and al-Qaida affiliates, and denounced it as a tool to rescue Assad or a cynical attempt to boost Moscow's own military presence in the Mediterranean. U.S. officials acknowledge they really don't know what Russia's intentions are. But what is clear is that the Russians have inserted themselves into a conflict the U.S. would have preferred they stay out of.\nAfter accusing Russia of direct military intervention in the Ukraine crisis, something Moscow adamantly denies, the administration is confronted with an overt show of Russian force in the Middle East, a region where Washington has traditionally seen itself as the main outside power.\nFormulating a decisive response has been slow. As of Thursday, a meeting between Presidents Barack Obama and Vladimir Putin and three meetings between Lavrov and Secretary of State John Kerry at the U.N. General Assembly in New York had yielded only the beginning of military-to-military talks to avoid having each other's fighter jets bump into each other, and an as-yet undetermined new effort to promote a political transition.\nBroader issues remain unresolved, much as they have since Obama first called on Aug. 18, 2011, for Assad to resign.\nAssad has had remarkable staying power for a man whose departure has been demanded by the United States, Europe and many of his neighbors for more than four years. Widely condemned for horrific rights abuses and battlefield atrocities, Assad has clung stubbornly to power, defying numerous predictions of his imminent demise.\nDespite Moscow's denials that its airstrikes are aimed at propping up Assad, the entry of its forces into the fray has given the Syrian leader a boost at the expense of the U.S.-led coalition fighting the Islamic State. The already weak U.S.-backed opposition to Assad has been undercut and will face further setbacks if its positions are hit, intentionally or unintentionally, by Russia's strikes.\nSome analysts worry that moderate Assad foes will begin to disappear.\n\"Such strikes have the potential to further alienate the remaining so-called moderate or nationalist elements of the Syrian anti-government forces, potentially driving them towards more hardline, Islamist militant groups,\" said Matthew Henman, the head of Jane's Terrorism and Insurgency Center in London.\nThe Russian intervention has come at a critical time for Assad and his embattled troops. The Syrian army's loss of the northern province of Idlib opened the way for rebels to come dangerously close to the coastal Alawite heartland, leaving his soldiers there vulnerable and dejected. Assad has tried to make up for his losses by launching offensives elsewhere, but even with the help of thousands of Iranian-backed Hezbollah fighters from Lebanon, the Syrian army has struggled to achieve results.\nThe Syrian army and Hezbollah have been bogged down in a months-long costly fight to regain control of the town of Zabadani near the Lebanon border, for instance, promising impending victory several times without being able to achieve it.\nAnd, while Russia's military presence at Assad's request demonstrates the weakness of the Syrian government and its complete, almost embarrassing, dependence on its allies, it provides a much-needed psychological boost to Assad's supporters, if nothing else.\n\"It's very clear that a fundamental goal of the Russian gambit is to strengthen the Syrian government, and put to rest speculation on Assad's fate,\" said Cliff Kupchan, Eurasia Group's Washington-based chairman.\n\"Assad just got a big second wind - Russian fighter jets, SAMs, and troops. In my view, the US-led West is unlikely to change the core of the view that 'Assad must go' in the near future,\" he said. \"Ironically, the best hope here is that Russia gets bogged down in this venture, the U.S. moves to allow Assad more time in a transition - and there's a meeting of minds. But we're not there.\"\n___\nAssociated Press writer Zeina Karam contributed from New York.\n ", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T12:09:05.667+03:00", "highlightTitle": ""}