{"organizations": [], "uuid": "f82cc36e67fe040f5db50d0195565aebcc17594f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/i/3/2/5/image.related.socialLead.620x349.gkhubu.png/1445855415906.jpg", "site_section": "http://www.canberratimes.com.au/federal-politics", "section_title": "Federal Politics", "url": "http://www.canberratimes.com.au/federal-politics/political-news/meet-bridget-mckenzie-the-turnbull-government-senator-out-to-change-your-mind-about-guns-20151025-gkhubu.html", "country": "AU", "title": "Meet Bridget McKenzie, the Turnbull government senator out to change your mind about guns", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Meet Bridget McKenzie, the Turnbull government senator out to change your mind about guns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:30:00.000+02:00", "replies_count": 0, "uuid": "f82cc36e67fe040f5db50d0195565aebcc17594f"}, "author": "", "url": "http://www.canberratimes.com.au/federal-politics/political-news/meet-bridget-mckenzie-the-turnbull-government-senator-out-to-change-your-mind-about-guns-20151025-gkhubu.html", "ord_in_thread": 0, "title": "Meet Bridget McKenzie, the Turnbull government senator out to change your mind about guns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nationals Senator Bridget McKenzie is on a mission to change attitudes towards Australian gun owners. Photo: Alex Ellinghausen\nWhen Nationals Senator Bridget McKenzie turned 40 she bought herself a gift – a shotgun.\nAs a girl growing up in the Victorian High Country, her father refused to allow guns in the household. But late at night she would go out with her best friend to shoot rabbits and foxes.\nThere's a lot of snobbery and elitism that I find offensive and I really want to challenge it\n\"As girls we weren't allowed to have the guns, we just got to carry the rabbits,\" she said. \"The dads and the older brothers did the shooting. When I got older I got to have a go at pig shooting. It's something I always wanted to do.\"\nJournalists, including, Matthew Knott (second from left), during clay target shooting in Canberra. Photo: Alex Ellinghausen\nLife, however, got in the way: a career as a school teacher and university lecturer, marriage, four children, a divorce. Two decades passed without firing a gun. Now she has embraced the cause with all the fervour of the born again.\nAdvertisement McKenzie believes Australian gun owners are too often treated like \"terrorists\" and \"rednecks\" by those in the big cities who have never taken an interest in their way of life.\n\"There's a lot of snobbery and elitism that I find offensive and I really want to challenge it.\"\nLiberal MP Ian Goodenough and Senator McKenzie at the Canberra International Clay Target Club. Photo: Alex Ellinghausen\nOnce described in Parliament by Nationals colleague Barnaby Joyce as a \"flash bit of kit\", McKenzie is tall, blonde and usually sports pearl earrings. Airport staff, she says, often have a \"physical reaction\" when she checks in her Beretta Silver Pigeon shotgun.\nMcKenzie has shot pheasants in New Zealand and woodcocks in the Scottish Isles. She is planning to go deer hunting with Motoring Enthusiast Party senator Ricky Muir.\nEarlier this year she went duck shooting near Gippsland – an activity banned in NSW, Western Australia and Queensland. The RSPCA, which says the sport inflicts especially cruel suffering on injured animals, wants it made illegal nation-wide.\nSenator McKenzie pictured following her election in 2010. Photo: Justin McManus\n\"It was quite a moving experience,\" McKenzie recalls.\n\"We sat in the dark, up to our hips in water, as the sun rose and the ducks came out.\n\"Afterwards we plucked them as a group and now there are five in my freezer to cook for my friends.\n\"I know it will sound incongruous to people but hunting is about connecting with nature and the outdoors. You have to understand nature to reap the bounty of it.\"\nLast week she organised a field trip for journalists to a Queanbeyan target shooting range so they could learn more about the sport.\nMcKenzie says she supports the tough gun control laws introduced after the 1996 Port Arthur massacre, even though they are \"not perfect\". What worries her is the cultural divide that has opened up between the shooting community and the rest of the country.\n\"A whole group of Australians felt they were being put in the same basket as crazy people who had used firearms illegally and were murdering people,\" she says. \"They were offended by that.\"\nIn July, as part of a response to the Sydney siege, the government announced a temporary ban on imports of the Adler A110 – a controversial rapid-fire shotgun. The decision was blasted by McKenzie and other pro-gun politicians, who said it was little different to legal firearms. In August, just a month after it was announced, the ban was lifted.\nMcKenzie is gregarious and energetic by nature, but also private. A faithful Protestant, she believes in the traditional definition of marriage as a man and a woman. Her opposition to same-sex marriage drew her into an upsetting public dispute this year with her younger brother Alastair, who is gay.\n\"Growing up in the country can be tough and isolating, growing up gay in the country in the 1990s was horrific,\" he wrote in a letter to the Bendigo Advertiser .\n\"Given her own story and connection, I had hoped to see a more courageous and compassionate response.\"\n\"I think he thought I was going to change my mind,\" McKenzie says. \"I was disappointed he chose to put our family issues into the public arena. I thought it was sad my brother chose to do that, but it's his right.\"\n(When photos were published of McKenzie later partying at a gay bar in St Kilda, her brother noted: \"She doesn't have any kind of hatred or animosity towards the gay community.\")\nMcKenzie had previously had to combat a whispering campaign about her private life when running for Senate preselection in 2010. A single mother in a conservative, male-dominated organisation, she was up against four men, including a party state director and future president of the Victorian Farmers Federation. Only one woman had been elected to federal or state Parliament for the Victorian Nationals. Yet she won the contest.\n\"I think the membership saw their daughters in me,\" she says. \"Educated, strong.\"\nSince being elected, McKenzie has championed improved access for regional students to higher eduction, a cause close to her. After dropping out of a science degree at the University of Melbourne because of the long commute, she returned to study later in life as a heavily-pregnant mother-of-three. She completed the double degree by driving two hours back and forth from home to classes.\nNow she is chair of the Senate education and employment committee, whose hearings can run all day until almost midnight. At times, as the days stretch on, her thoughts drift to being out in nature, a gun in her hand.\n\"If you have a gun or a bow and arrow, you don't need urban society to provide for you,\" she says. \"There's something quite empowering, quite freeing about that.\"\nFollow us on Twitter", "external_links": ["https://twitter.com/PoliticsFairfax", "http://www.smh.com.au/federal-politics/political-news/letter-from-alastair-mckenzie-on-his-sister-nationals-senator-bridget-mckenzies-samesex-marriage-stance-20150612-ghn3kj.html"], "published": "2015-10-26T17:30:00.000+02:00", "crawled": "2015-10-26T21:37:54.993+02:00", "highlightTitle": ""}