{"organizations": [], "uuid": "629b5c46f54576dafd9c64497aa32b4208d240cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/02/381677-indrani-mukerjea-2.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/india/report-indrani-mukerjea-s-condition-serious-after-she-consumed-pills-jj-hospital-dean-2131078", "country": "SG", "title": "Indrani Mukerjea hospitalised after consuming pills, Maharashtra Home Dept orders inquiry", "performance_score": 0, "site": "dnaindia.com", "participants_count": 5, "title_full": "Indrani Mukerjea hospitalised after consuming pills, Maharashtra Home Dept orders inquiry | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:25:00.000+03:00", "replies_count": 4, "uuid": "5efd02927c43a0edb3705a7a00b9f70d8c96caa5"}, "author": "dna webdesk", "url": "http://www.dnaindia.com/india/report-indrani-mukerjea-s-condition-serious-after-she-consumed-pills-jj-hospital-dean-2131078#post-0", "ord_in_thread": 0, "title": "Indrani Mukerjea hospitalised after consuming pills, Maharashtra Home Dept orders inquiry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Courtesy: Facebook Prime accused in Sheena Bora murder case, Indrani Mukerjea has been unconscious since 2pm when she was rushed to JJ Hospital in Mumbai on Friday. After Indrani complained of chest pains, she was taken to the hospital on Friday afternoon. Maharashtra Home Department had ordered inquiry into drug overdose.\nSpeaking to PTI, a senior official from Chief Minister's office said, \"The inquiry will cover all angles, including how Indrani managed to get hold of the tablets.\"\nSpeaking to ANI, JJ Hospital Dean TP Lahane said that Indrani had consumed some tablets and her condition is serious.\n\"Indrani Mukerjea was brought here at 2pm. She has been unconscious since the time she was brought here. We think that she has consumed some tablets, we are treating her on that basis. Whatever toxic has been there, if it has been gone out of the body, then I think, it should be clear to us within the next 24 hours to check the response. It will be take at least 24 hours. Her condition is serious,\" Lahane said.\n\"We have taken her gastric lavage and sent it to the forensic for investigation. There is respiratory repression. We are giving her oxygen and she is admitted in CCU,\" he added.\n\"We suspect that she got her epilepsy medicine and probably consumed all of it,\" he said.\nThere was speculation that Indrani was under depression and had attempted suicide by consuming some pills. Jail authorities said she has been on anti-epileptic pills since September 11 after she started suffering convulsions. Prison officials, who were tasked to monitor her medication, have been asked to explain how Indrani got hold of tablets more than her dosage. Anti-epileptic drugs are given to control seizures and an overdose can put the person in a comatose state, a senior doctor said.\nIndrani's mother Durga Rani Bora passed away on Thursday evening in Guwahati due to old age related ailments. Bora, who was bed-ridden for long, and her husband were taken care of by their grandson Mikhail Bora at their residence in Sundarpur area of Guwahati. (Read: Sheena Bora's grandmother passes away in Guwahati )\nIndrani, wife of TV honcho Peter Mukerjea, is the prime accused in the murder case of her daughter Sheena Bora. Indrani's ex-husband Sanjeev Khanna and driver Shyam Rai are also named accused in the case. The case was transferred to CBI last week.\nOn September 30, the CBI had registered a case against Indrani, Sanjeev and the driver.\nAlso read: Close friend's hubby tipped off Mumbai cops", "external_links": ["https://apis.google.com/js/platform.js"], "published": "2015-10-02T19:25:00.000+03:00", "crawled": "2015-10-03T04:32:01.284+03:00", "highlightTitle": ""}