{"organizations": [], "uuid": "260392a48611dce38187c531cb261b4b7d22fb8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nola.com", "main_image": "http://imgick.nola.com/home/nola-media/width620/img/politics/photo/18520833-standard.jpg", "site_section": "http://www.nola.com/elections/index.ssf/2015/10/", "section_title": "Louisiana Politics, Elections and State Legislature News - NOLA.com ", "url": "http://www.nola.com/politics/index.ssf/2015/10/gubernatorial_debate_five_thin.html", "country": "US", "title": "Louisiana gubernatorial debate: 5 things we learned", "performance_score": 0, "site": "nola.com", "participants_count": 1, "title_full": "Louisiana gubernatorial debate: 5 things we learned | NOLA.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:40:00.000+03:00", "replies_count": 0, "uuid": "260392a48611dce38187c531cb261b4b7d22fb8e"}, "author": "Kevin Litten, NOLA.com | The Times-Picayune", "url": "http://www.nola.com/politics/index.ssf/2015/10/gubernatorial_debate_five_thin.html", "ord_in_thread": 0, "title": "Louisiana gubernatorial debate: 5 things we learned", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The second Louisiana gubernatorial debate to be broadcast statewide was remarkable in several different ways for the three candidates who showed up Wednesday night (Oct. 7.)\nThe candidates who participated were Republicans Scott Angelle , a Public Service Commission member, and Lt. Gov. Jay Dardenne , as well as Democratic state Rep. John Bel Edwards . U.S. Sen. David Vitter was not able to attend the debate because of business in Washington.\nHere's a look at five takeaways from the debate, which WVLA-TV and Fox44 hosted at the Dunham School in Baton Rouge.\nWithout Vitter in the room, everyone on stage seemed more relaxed.\nVitter is known as an aggressive campaigner. And as we saw during the WDSU-TV debate Oct. 1, he doesn't hold back during debates, either. He was the first to launch into an attack during that debate, and nobody got out of there without Vitter firing a shot at them.\nSo without Vitter in the room, it appeared as though the three candidates were worrying less about where the next attack was going to come from and more about giving well thought out responses. In some ways, there was even a camaraderie among the three men, who seem to have grown to like each other so much, they don't like attacking their opponents unless Vitter is in the room.\nNearly all resisted the urge to go on the attack. Edwards was an exception, because he turned to an oft-repeated line in his closing about being the only guy who gives Gov. Bobby Jindal a failing grade. But that was hardly noticeable given the warm words all three candidates had for each other when they were asked a question about what they admired about their competitors.\nThe debate format was strong, and the three moderators asked thoughtful questions and provided insightful feedback from viewers.\nThe biggest takeaway here is that a well-structured debate with well-planned questions suits these three candidates extremely well, and viewers at home were rewarded with responses that gave a much clearer picture about what they would do as governor.\nSure, there were moments where someone following the race closely started to hear candidates go into reruns from the campaign trail stump speeches. But many of the responses appeared off the cuff, and every candidate had moments where viewers were able to get a sense of the man behind the image.\nAnchors Fred Hickman of WVLA, NBC 6 Shreveport's Jacque Jovic and Fred Childers at Fox44 were clearly determined not to repeat the mistakes of the heavily criticized WDSU debate, and shaped nearly every question around the weightiest of issues facing the state. Where the WDSU debate focused on social issues driven by hot-button news stories of the day, these three anchors were all about the research and seemed to have crafted questions with an eye toward getting clear answers out of the candidates.\nThe candidates still lack the specifics many voters would like to see.\nIt's a truism in nearly every big political campaign that the candidates probably have a much better sense of what they would do once elected than they're letting on. After all, nobody wants to say anything that will make them unelectable.\nBut there was still a frustrating lack of specifics on certain questions, particularly around the state budget. When asked questions about which tax breaks they would eliminate or how they intend to raise revenue, all three candidates weren't able to point to enough examples of what they'd actually do to close the state's perpetual budget deficits.\nTwo of the candidates acknowledged as much when they said cutting exemptions on horizontal drilling wasn't going to save a ton of money.\nAngelle at one point, when asked what spending he'd cut, could only cite a single $10 million budget line for capital technology improvements. Edwards wouldn't rule out raising the gas tax for road improvements, but he made it conditional on the idea that Baton Rouge needs to be cleaned up first -- but what exactly needs to be cleaned up?\nIn what Dardenne seemed to realize was a remarkable moment of candor, he was the only one to raise his hand to say he would consider raising income taxes. But then he dialed that back and said it would only be something he'd consider -- not something he would do.\nIf you detected an anti-Vitter sentiment from the audience, there was a reason for it.\nThere were several references to Vitter during the debate, both direct and indirect, but this debate was actually one of the milder events when it came to going after the guy long seen as the race's front-runner (until recent polling showed Edwards ahead). But whenever Vitter was attacked, there was a strong reaction from the crowd -- making one wonder whether Baton Rouge has suddenly turned strongly anti-Vitter.\nThere was a reason for this: Each candidate was provided with 100 tickets into the debate, making it safe to conclude the crowd gathered on Wednesday wasn't casting any votes for the senator when early voting opens on Saturday. So if the crowd reaction was as loud on TV as it was in the theater, take it with a grain of salt.\nWhile the candidates found much to agree on, they all gave different answers on immigration.\nQuestions about immigration have not come up much on the campaign trail, so it was interesting to see that the anchors chose to ask the candidates whether they thought private businesses should be required to use E-Verify. The federal system is supposed to prevent employers from being able to hire illegal immigrants.\nAngelle said at first he supported the program's implementation in Louisiana without conditions. But when a questioner pointed out to him the farm lobby opposes E-Verify, he then said he would support it with conditions.\nDardenne used much of his time to correct a Vitter ad that has been running about Dardenne's support of a bill involving immigration. In the end, he gave a non-answer: that he would look at E-Verify \"carefully.\"\nEdwards was the only to say he would support the program being used for all private employers.\n. . . . . . Kevin Litten is a state politics reporter based in Baton Rouge. Reach him at klitten@nola.com or 225-436-2207. Follow him on Twitter ( @kevinlitten ).", "external_links": ["https://twitter.com/kevinlitten"], "published": "2015-10-08T05:40:00.000+03:00", "crawled": "2015-10-08T13:52:46.065+03:00", "highlightTitle": ""}