{"organizations": ["'Redskins"], "uuid": "31cfa309f95c2314627ea5972cf4d1bf7b518a47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcra.com", "main_image": "http://www.kcra.com/image/view/-/35782970/highRes/1/-/maxh/630/maxw/1200/-/xfvu0c/-/Jerry-Brown-jpg-jpg.jpg", "site_section": "http://www.kcra.com/11798346?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.kcra.com/news/brown-approves-law-barring-schools-from-using-redskins/35782712", "country": "US", "title": "Brown approves law barring schools from using 'Redskins'", "performance_score": 0, "site": "kcra.com", "participants_count": 0, "title_full": "Brown approves law barring schools from using 'Redskins'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:35:00.000+03:00", "replies_count": 0, "uuid": "31cfa309f95c2314627ea5972cf4d1bf7b518a47"}, "author": "", "url": "http://www.kcra.com/news/brown-approves-law-barring-schools-from-using-redskins/35782712", "ord_in_thread": 0, "title": "Brown approves law barring schools from using 'Redskins'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Brown"], "text": "Brown approves law barring schools from using 'Redskins' Brown approves mandatory day care worker vaccines, 'Redskins' mascot ban UPDATED 6:35 PM PDT Oct 11, 2015 A Large Text Photos \nGov. Jerry Brown barred public schools from using the Redskins name, strengthened the state's vaccine rules by requiring mandatory vaccination for day care workers and handed a win to the business community by vetoing two bills on the Chamber of Commerce list of so-called \"job killers\" as he took action on dozens of pieces of legislation Sunday. Related Davis chancellor condemns vehicle... \nBrown rejected lawmakers' efforts to expand the state's unpaid family leave policy, vetoing legislation by Sen. Hannah-Beth Jackson, D-Santa Barbara, that would have expanded the pool of workers who can take up to 12 weeks off to care for grandparents, grandchildren, siblings and parents-in-law. He agreed with CalChamber's argument that SB406 conflicts with federal law and could require employers to provide up to 24 weeks of family leave in a year. \nBucking labor unions, the Democratic governor also vetoed legislation that sought to bar mandatory employment arbitration agreements, which CalChamber warned would \"significantly drive up litigation costs\" and lawsuits for employers. Brown called AB465 by Assemblyman Roger Hernandez, D-West Covina, \"a far-reaching approach that has been consistently struck down in other states\" for conflicts with federal law. \nThe California Labor Federation, AFL-CIO, which sponsored the bill, said the proposal would have put employees and employers on equal footing in negotiating employment contracts, and called the veto \"a slap in the face of working Californians.\" \nThe legislation was among bills targeted by the business community and one of 18 Brown vetoed Sunday. \nHe also rejected a so-called \"right to try\" law that would have allowed terminally ill patients to petition drug companies for access to experimental treatments that have not yet been approved for use by the Food and Drug Administration but have already cleared the first phase of testing. That decision came just days after the Democratic governor signed a law allowing terminally ill patients to end their own lives with a physician's help. \nHe said the FDA's rules should be given a chance to work. \nIn the wake of California's adoption of one of the strictest school vaccination laws in the country, Brown moved to further tighten the rules, signing SB792, legislation requiring day care centers and homes to maintain immunization records proving their workers and volunteers have been vaccinated for the flu, pertussis and the measles. They already are screened for tuberculosis. \n\"If this new law can prevent the loss of even one child due to a communicable disease, then it will be considered a success,\" said the bill's author, Sen. Tony Mendoza, D-Artesia. \nThe issue of mandatory vaccinations was among the most heated at the capital this year, following an outbreak of measles at Disneyland. Opponents of the new school law last week failed in their efforts to collect enough signatures to place a referendum on it on the ballot. \nBrown also took action on the following bills Sunday: \n— Wage theft: Brown signed SB588 by Senate President Pro Tem Kevin de Leon, D-Los Angeles, making it easier for the state labor commissioner to collect unpaid wages on behalf of workers. \n— Ridesharing: He signed AB229 by Assemblywoman Ling-Ling Chang, R-Diamond Bar, to allow state employees to use ride-sharing services such as Uber and Lyft and use short-term rentals such as Airbnb. Taxi driver and hotel employee unions opposed the legislation. \n— Smokeless tobacco: He signed AB768 by Assemblyman Tony Thurmond, D-Richmond, to prohibit using or possessing smokeless tobacco products on the playing field at professional baseball parks; he also signed AB216 by Assemblywoman Cristina Garcia, D-Bell Gardens, which prohibits the sale of vapor products to anyone under age 18, even if they don't contain nicotine. \n— Franchisee rights: Brown signed AB525 by Assemblyman Chris Holden, D-Pasadena, giving franchise owners greater rights to challenge mandates from corporate owners. \n— Confederate names: Brown rejected SB539 by Sen. Steve Glazer, D-Orinda, which would have banned naming schools, parks, buildings and other public property after Confederate leaders, saying it's an issue \"quintessentially for local decision makers.\" Glazer said local governments have had decades to remove Confederate names and haven't done so. \n— HIV testing: Brown vetoed AB521 by Adrin Nazarian, D-Sherman Oaks, which would have required hospitals to offer testing for HIV to consenting patients who have their blood drawn at an emergency room. Brown said it was not the best approach to identifying those who are undiagnosed with HIV. \n— Campus sexual assaults: He rejected AB967 by Sen. Connie Leyva, D-Chino, which would have set minimum penalties for sex assaults and required additional reporting on the outcome of assault investigations. He says the state shouldn't bar professionals from using their best judgment. Tweet \nCopyright 2015 by The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-12T04:35:00.000+03:00", "crawled": "2015-10-12T05:04:16.162+03:00", "highlightTitle": ""}