{"organizations": [], "uuid": "0ff9dbb02e9a7272837b5ad0bbfec647745dd42f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-f743cc0c4a3b731b0547810c015b34dd.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/bush-jebcare-better-than-special-interest-obamacare/article/2573963?custom_click=rss", "country": "US", "title": "Bush: JebCare better than 'special interest' Obamacare", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Bush: JebCare better than 'special interest' Obamacare | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:23:00.000+03:00", "replies_count": 0, "uuid": "0ff9dbb02e9a7272837b5ad0bbfec647745dd42f"}, "author": "Ryan Lovelace", "url": "http://www.washingtonexaminer.com/bush-jebcare-better-than-special-interest-obamacare/article/2573963?custom_click=rss", "ord_in_thread": 0, "title": "Bush: JebCare better than 'special interest' Obamacare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Florida Gov. Jeb Bush unveiled his plan to repeal and replace Obamacare on the campaign trail in New Hampshire. The governor touted that his plan would promote innovation, lower costs and shift power back to the states. His campaign calls it \"Jeb's Conservative Plan for 21st Century Health.\"\n\"The one thing I know is this: We can't stick with the status quo,\" Bush said. \"We can't leave this up to the lobbyists and the politicians in Washington, D.C., because the system we have today, Obamacare in its most current form, was written by the special interests for the special interests.\"\nBush's plan would repeal Obamacare and offer tax credits for purchasing health insurance coverage to individuals that do not receive health insurance from an employer, as the Washington Examiner 's Philip Klein noted . Bush's plan also calls for increased funding for the National Institutes of Health and to \"modernize\" regulations from the Food and Drug Administration.\nHe follows two other governors turned presidential candidates — Louisiana Gov. Bobby Jindal and Wisconsin Gov. Scott Walker — to propose alternatives to President Obama's signature healthcare legislation. Walker has since exited the race and Jindal has suffered from low poll numbers nationwide for months.\n  U.S. military: Russia's 'reckless' strikes actually helping ISIS Russian airstrikes in Syria have opened the door for the Islamic State to expand its foothold.\nBy Jacqueline Klimas • 10/13/15 12:41 PM Bush has not emerged as the front-runner in the GOP race and some top donors have begun to look elsewhere, including billionaire T. Boone Pickens, who may defect from Bush to Ben Carson. The former governor's decision to focus on healthcare policy comes at a time when he trails the retired neurosurgeon in a series of recent polls, but the doctor has not put forward a detailed plan about how to eliminate Obamacare.\nBush, however, set his sights not on his Republican rivals, but on Democrats who support the president's healthcare policies.\n\"When you consider the wreckage [caused by Obamacare] it makes you wonder who could, how could anybody support this now?\" Bush asked. \"Well Hillary Clinton supports it and so does Bernie Sanders and other Democrats and the debate tonight in Las Vegas will probably prove that they will be strongly supportive of this top-down driven, highly bureaucratic insurance plan that is stifling our ability to rise up. Because for Democrats this is what they want. This is how they roll.\"\nBush's media blitz lambasting Obamacare and defending his plan on Tuesday also included an op-ed in the New Hampshire Union Leader where Bush asserts that \"central planners have been impeding value and access in America's healthcare system for decades.\" The former governor's decision to role out the plan in New Hampshire comes amid dropping poll numbers in a state he led in June. Bush, who ranks fifth in the Washington Examiner 's most recent power rankings , now finishes fifth in RealClearPolitics' average of Granite State polling .\nAlso from the Washington Examiner Will black lives 'matter' at the first Dem debate? The movement has been working to confront candidates, participate in protests and interrupt rallies.\nBy Kelly Cohen • 10/13/15 12:22 PM Top Story Planned Parenthood to stop accepting cash for fetal tissue \nPlanned Parenthood will no longer accept payments  \nBy Paige Winfield Cunningham • 10/13/15 10:32 AM", "external_links": [], "published": "2015-10-13T14:23:00.000+03:00", "crawled": "2015-10-13T20:06:47.700+03:00", "highlightTitle": ""}