{"organizations": ["Army", "NGO", "United Nations", "Google"], "uuid": "faae9e5243290b536d6089860368cac03217086b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "page2rss.com", "main_image": "", "site_section": "http://page2rss.com/rss/d46d20558883d5336f81c655cc400733", "section_title": "Politics To Parenting And Everything In Between By Littlebytesnews.Com", "url": "http://page2rss.com/d46d20558883d5336f81c655cc400733/7766662_7766928/biden-and-clinton-court-major-lgbt-group", "country": "US", "title": "Biden and Clinton court major LGBT group", "performance_score": 0, "site": "page2rss.com", "participants_count": 0, "title_full": "Biden and Clinton court major LGBT group", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:28:00.000+03:00", "replies_count": 0, "uuid": "faae9e5243290b536d6089860368cac03217086b"}, "author": "", "url": "http://page2rss.com/d46d20558883d5336f81c655cc400733/7766662_7766928/biden-and-clinton-court-major-lgbt-group", "ord_in_thread": 0, "title": "Biden and Clinton court major LGBT group", "locations": ["RAJASTHAN", "JAIPUR", "Bicol", "LEGAZPI CITY", "ISLAMABAD", "LUDHIANA", "Bicol Region", "PATNA", "India", "Albay"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Melissa Harris-Perry", "Clinton", "Taranjit Singh Nimana", "Katon Dawson", "Warren", "Bush", "Perry Bacon Jr.", "Christina Greer", "David Cay Johnston", "Elizabeth Warren", "Bhai Ghanaiya", "Biden"], "text": "all 3 news articles >> A healthy environment is a human right 10/4/2015 FOR all its flaws, the United Nations remains the only plausible forum for engaging broad global challenges like sustainable development. The most important environmental achievements of the past 40 years Water shortage hounds several Bicol towns Interaksyon 10/4/2015 InterAksyon.com The online news portal of TV5 LEGAZPI CITY -- Several towns in the Bicol Region, specifically in Albay province, are feeling the effects of climate change and experiencing water shortage. 10/4/2015: SPORT/METRO: NGO wins accolades for blood donation Hindustan Times 10/4/2015 LUDHIANA: A non-government organisation (NGO), Bhai Ghanaiya Ji Sewa Mission, has been lauded by the state government for its contribution in blood donation. Taranjit Singh Nimana, president, Bhai Ghanaiya The problem with Army's new breastfeeding policy How Bush, Warren addressed equal opportunity MSNBC | MSNBC Layout selectors Melissa Harris-Perry 10/03/15 David Cay Johnston, Perry Bacon Jr., Christina Greer and Katon Dawson compare and contrast how Sen. Elizabeth Warren and fmr. Is Army breastfeeding policy useful? CNN Story highlights Army becomes last military branch to issue formal breastfeeding policy Breastfeeding advocates say policy too vague to be useful The two-page policy , which applies to active, Guard Youtube Kids will be safer with parenting control update US.NewsHub.org 10/4/2015 Google is going to update their Youtube Kids service adding more parenting control, after some complaints about the app featuring adult content. The app was released February this year. “We always 10/4/2015: RAJASTHAN: Safe motherhood day drive in state Hindustan Times 10/4/2015 JAIPUR: Safe motherhood day will be organised on each Friday at community health centres (CHCs) to bring down the maternal and infant mortality rate under the national health mission (NHM). Health minister School children hold parleys on global issues HT Syndication 10/4/2015 The article below represents a preview only and is not meant for reuse or republishing. PATNA, Oct. 4 -- Wide ranging discussions on 100 smart cities in India, Ebola and a number of other topics were ‘Do you know what your child is doing online?’ DAWN Group 10/4/2015 ISLAMABAD: The Children’s Literature Festival featured at least five different sessions on digital security and cyber-safety, aimed both at children and their accompanying parents. Federal Investigation", "external_links": [], "published": "2015-10-05T06:28:00.000+03:00", "crawled": "2015-10-05T07:34:04.470+03:00", "highlightTitle": ""}