{"organizations": [], "uuid": "ae0dd587a2398e139b1fcf49a7c757207e3c3169", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/f79cacf4-30a9-4485-9aac-e1619d78ff3c.img", "site_section": "http://www.ft.com/rss/world/mideast/politics", "section_title": "Middle East & North Africa Politics and Society News - FT.com", "url": "http://www.ft.com/cms/s/0/76ad076e-6e75-11e5-8171-ba1968cf791a.html?ftcamp=published_links%2Frss%2Fworld_mideast_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "US scraps Syrian rebel training programme", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "US scraps Syrian rebel training programme", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:20:00.000+03:00", "replies_count": 0, "uuid": "ae0dd587a2398e139b1fcf49a7c757207e3c3169"}, "author": "", "url": "http://www.ft.com/cms/s/0/76ad076e-6e75-11e5-8171-ba1968cf791a.html?ftcamp=published_links%2Frss%2Fworld_mideast_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "US scraps Syrian rebel training programme", "locations": ["US", "Washington", "Aleppo", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Jones", "Demetri Sevastopulo"], "text": "US scraps Syrian rebel training programme Demetri Sevastopulo in Washington and Sam Jones in London ©AP An image posted on Facebook purports to show Isis militants preparing to fire a mortar at government positions in Aleppo \nThe US is halting a controversial $500m programme to create a rebel force in Syria after concluding that it was having practically no impact in the battle against Isis fighters in the war-torn country. \nInstead of trying to build up a new force of fighters — training them outside Syria and then sending them back in equipped — the Pentagon will now focus on arming and training a smaller number of leaders of Arab and Kurdish groups in Syria that have had some success fighting Islamic State of Iraq and the Levant (Isis). More \nSyria explainer: the allies and the enemies \nThe FT maps out the regional and global actors in the conflict, and their interrelationships \nRead more \nThe change of tack underscores the difficulty the US is facing in combating Isis. It also comes as the Obama administration is trying to come up with a more effective strategy at a time when Russia has dramatically stepped up its military intervention in Syria in an effort to shore up the Assad regime. \nWith Russian forces currently fighting the kind of groups the US proposes to arm, the move could also dramatically escalate the risk of the conflict developing into a full-blown proxy war. Isis fighters have made territorial gains in northern Syria in recent days, taking advantage of a week of Russian airstrikes that have largely targeted mainstream rebels. \nAshton Carter, US defence secretary, said during a visit to London that he “wasn’t happy with the early efforts” of the programme. General Lloyd Austin, head of US Central Command, said last month that only “four or five” of the first batch of 54 US-trained opposition fighters were fighting Isis. \nThe programme, which originally planned to train more than 5,000 fighters, suffered an embarrassing setback when it emerged recently that some of the US-trained fighters had given their equipment to extremists. A bipartisan group of US senators recently called on the Obama administration to end the programme because it was “aiding the very forces we aim to defeat”. \nAn overly cautious vetting process, and an almost complete lack of interest from many Syrians in subscribing to the programme, meant it was hobbled from the outset. Many resented the US stipulation that the force was only to fight Isis, and not the Assad regime. For many of those currently embroiled in the Syrian civil war, Damascus is still the real enemy. \nCritics of Moscow’s intervention said the Russian air campaign had helped the terrorist jihadi group wrest control of the new territory in the strategically vital north of Syria. \nUnder the new approach, the US will provide weapons and vehicles to a “select group of vetted leaders and their units” to help them take areas controlled by Isis. Mr Carter said the new effort would “over time increase the combat power of counter-Isil forces in Syria”. \nThe new strategy marks a big shift for the White House, which for years has resisted calls, particularly from allies in the Gulf, to widen military co-operation among rebel groups that are operating inside Syria. Many of the most successful anti-Assad forces have dubious political and sectarian agendas. That has, at least until now, ruled them out of any post-Assad political settlement, as far as Washington has been concerned. \nThe US has, for example, shunned Ahrar al-Sham, a Salafist faction that dominates fighting against regime forces in Idlib, a province in north-west Syria near Turkey. While the organisation has occasionally co-ordinated its efforts with the US-backed Free Syrian Army, it has also frequently mounted operations in conjunction with al-Qaeda affiliate Jabhat al-Nusra. \nThe pattern of shifting local allegiances means arming groups is a policy fraught with difficulties. Many are sceptical that efforts to vet groups before giving them munitions will amount to much. The existing rebel-training programme has already suffered several embarrassing failures with approved-individuals defecting to jihadi groups soon after their deployment. \nTo try and mitigate such problems, any policy to expand the number of organisations that the US is now prepared to deal with will require some kind of plan to isolate Jabhat al-Nusra if it is to succeed, said one European intelligence official. Doing so would nevertheless be especially difficult since the group has been at pains for the duration of the Syrian conflict to deeply embed itself among Syrian communities and to play-down its jihadi agenda. In depth", "external_links": [], "published": "2015-10-09T18:20:00.000+03:00", "crawled": "2015-10-09T22:45:40.945+03:00", "highlightTitle": ""}