{"organizations": [], "uuid": "8b2cde2360c9d1d8cd52fac69d11eae7041d4a41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz/taxonomy/term/3/all/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/wellington-council-appoints-resilience-officer/5/235100", "country": "US", "title": "Wellington Council appoints 'resilience officer'", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Wellington Council appoints 'resilience officer'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T23:20:00.000+03:00", "replies_count": 0, "uuid": "8b2cde2360c9d1d8cd52fac69d11eae7041d4a41"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/wellington-council-appoints-resilience-officer/5/235100", "ord_in_thread": 0, "title": "Wellington Council appoints 'resilience officer'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Thursday, 22 October, 2015 - 08:20 \nWellington City Council has appointed a new resilience officer to shape a city strategy to strengthen natural, social and economic resilience, Wellington Mayor Celia Wade-Brown announced today. \nThe appointment is Mike Mendonca, Director of Operations with the Ministry for the Environment, who will start in his new role early next month. \nMendonca is a former Wellington City Council manager responsible for running key city infrastructure and was local controller for Civil Defence Emergency Management. \n\"I am delighted to welcome Mike back to the council in this important new role,\" she says. \nWellington is one of 67 cities around the world that make up the 100 Resilient Cities organisation (100RC) initiated by the Rockefeller Foundation to build urban resilience in cities around the world. \n\"The city is very grateful to the Rockefeller Foundation for their funding of the new resilience officer role, their organisational framework, and international connections. \n\"Mike has wide experience and will be able to tap into an international body of knowledge and liaise with resilience officers in Christchurch, Sydney, and around the world, in developing plans and strategies to make Wellington a resilient city,\" says Mayor Wade-Brown. \nThe greater Wellington region will also benefit from the strategic planning to be undertaken by the resilience officer who will report directly to the Mayor. \n\"Resilience of our city from acute shocks and chronic stresses is a top priority for the city. \n\"I look forward to working with Mike and the people of Wellington in developing a world class resilience strategy,\" she says. \n ", "external_links": [], "published": "2015-10-21T23:20:00.000+03:00", "crawled": "2015-10-22T00:40:11.235+03:00", "highlightTitle": ""}