{"organizations": [], "uuid": "4e464e953da0f861390ce84f195b7ddacb7a99d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.radio.cz", "main_image": "", "site_section": "http://radio.cz//feeds/rss/en/themes/politics.xml", "section_title": "Radio Prague - Topic «Politics»", "url": "http://www.radio.cz/en/section/curraffrs/police-charge-governor-of-olomouc-region-and-high-ranking-police-officers-in-latest-corruption-scandal", "country": "", "title": "Police charge governor of Olomouc region and high-ranking police officers in latest corruption scandal", "performance_score": 0, "site": "radio.cz", "participants_count": 0, "title_full": "Police charge governor of Olomouc region and high-ranking police officers in latest corruption scandal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T16:06:00.000+03:00", "replies_count": 0, "uuid": "4e464e953da0f861390ce84f195b7ddacb7a99d1"}, "author": "", "url": "http://www.radio.cz/en/section/curraffrs/police-charge-governor-of-olomouc-region-and-high-ranking-police-officers-in-latest-corruption-scandal", "ord_in_thread": 0, "title": "Police charge governor of Olomouc region and high-ranking police officers in latest corruption scandal", "locations": ["Olomouc"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jiří Rozbořil"], "text": "Subscribe to RSS Forty-eight hours after the country’s anti-organized crime squad conducted raids in several parts of the country detectives have filed charges against four people, the Social Democrat governor of the Olomouc region Jiří Rozbořil, two high-ranking police officers and an influential businessman. All are believed to have been part of a powerful local corruption ring. Download: MP3 \nIvan Langer, photo: CTK Following months of investigations, the anti-organized crime squad cracked down on what detectives believe to be a powerful corruption ring involving former politicians, public officials and high-ranking members of the regional police force. The ring, allegedly centered in Moravia’s Olomouc region, is suspected of having manipulated public tenders, influenced the selection of candidates for key posts in public administration and marred police investigations. \nAmong the big fish caught in the net of this extensive police operation are former interior minister Ivan Langer, the governor of the Olomouc region Jiří Rozbořil and the deputy head of the Olomouc regional police force Karel Kadlec. Although the detention of former interior minister Langer dominated earlier reports of the scandal, he has not been charged and it is his close friend Jiri Rozbořil, the governor of Olomouc, who has now emerged as a central figure in the web of corruption being unraveled. Unlike Ivan Langer, who was released without being charged, Rozboril has been charged with soliciting bribes. At a press briefing in Olomouc on Thursday he told journalists he had never abused his office or in any way assisted the operation of an alleged corruption ring in the region. \nJiří Rozbořil, photo: CTK “I have never requested any information from anyone other than that linked to my office and I have never, ever, solicited a bribe. In my position I meet with a great many people and, as I see it, I was in the wrong place at the wrong time. My role in this is insignificant. I am not a key player in this affair.” \nAccording to the news site Neovlivni.cz, which cites police sources, Rozbořil tried to stop a police investigation into two regional construction projects which the Finance Ministry suspected of subsidy-fraud. During a meeting at an Olomouc restaurant, which the police was monitoring at the time, Rozbořil reportedly attempted to bribe the deputy head of the Olomouc regional police force Karel Kadlec, asking him to shelve the investigation. \nKadlec now faces charges of corruption as does the head of the region’s police department for economic crime Radek Petruj. The fourth person against whom the police is pressing charges is Ivan Kyselý one of the most influential businessmen in the region active in the real estate and construction business and a close friend of both Langer and Rozbořil. The governor alone has been released, the others are being investigated in custody. \nIvan Kyselý, photo: CTK Meanwhile, the Supreme State Attorney’s Office which is overseeing the case, has indicated that more people may be charged in the coming days, since police are still in the process of assessing the vast amount of materials confiscated during Tuesday’s early morning raids. The question who triggered the investigation against this influential corruption ring was answered by Police President Tomas Tuhý who told journalists the impulse had come from inside the police force. Tools", "external_links": [], "published": "2015-10-15T16:06:00.000+03:00", "crawled": "2015-10-15T21:36:41.500+03:00", "highlightTitle": ""}