{"organizations": [], "uuid": "4ba45c3bb85929d9aeacc6930d10243d8901a61f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newser.com", "main_image": "http://img1-azcdn.newser.com/image/1042774-0-20151022131644.jpeg", "site_section": "http://rss.newser.com/rss/section/4.rss", "section_title": "Politics from Newser", "url": "http://www.newser.com/story/214886/clinton-ive-lost-more-sleep-than-all-of-you.html", "country": "US", "title": "Clinton: 'I've Lost More Sleep Than All of You'", "performance_score": 0, "site": "newser.com", "participants_count": 1, "title_full": "Clinton: 'I've Lost More Sleep Than All of You'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T21:14:00.000+03:00", "replies_count": 0, "uuid": "4ba45c3bb85929d9aeacc6930d10243d8901a61f"}, "author": "Newser Editors", "url": "http://www.newser.com/story/214886/clinton-ive-lost-more-sleep-than-all-of-you.html", "ord_in_thread": 0, "title": "Clinton: 'I've Lost More Sleep Than All of You'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Clinton: 'I've Lost More Sleep Than All of You' She refutes accusations about misleading the public By Newser Editors , Newser Staff Posted Oct 22, 2015 1:14 PM CDT COMMENTS (172) (Newser) – Hillary Clinton is in the midst of a tense, daylong hearing on the Benghazi attack, and Republicans weren't holding back. At one point, Rep. Jim Jordan accused Clinton's State Department of misleading the public in the aftermath, reports the Washington Post . \"Americans can live with the fact that good people sometimes give their lives for this country,\" he said. \"What they can’t live with is when their government is not square with them.\" Jordan was referring to the department's first public explanation that the attack was spontaneous and not planned. Clinton countered that Jordan does a \"great disservice to the hard work that people in the State Department who made\" tough calls \"during some very difficult and confusing days.\" At another point she said: \"It’s a very personally painful accusation. … I’ve thought more about what happened than all of you put together. I’ve lost more sleep than all of you put together. I have been racking my brain about what more could have been done or should have been done.\" Other developments: Opening statements: Panel chief Trey Gowdy presented an \"aggressive\" opening statement in which he accused Clinton of failing in her duty to protect American lives, reports the New York Times . \"Why were there so many requests for security equipment and personnel and why were those requests denied in Washington?\" The Times describes Clinton's opening statement as a \"measured defense of diplomacy\" in which she urged the panel to \"reach for statesmanship.\" Clinton's full text is here , and Gowdy's is here . No computer? In addressing criticism about the lack of emails to or from her about Libya in 2012, particularly after a bombing at the US compound in Benghazi months before the larger attack, Clinton said: \"I did not conduct most of the business that I did on behalf of our country on email. ... If you were to be in my office in the State Department, I did not have a computer.\" The Hill suspects this might make for a \"sound bite that is likely to carry over to her campaign for the presidency in 2016.\" The full exchange with Republican Susan Brooks is at Real Clear Politics . Hillary Clinton testifies on Capitol Hill Thursday. (AP Photo/Carolyn Kaster) ADVERTISEMENT", "external_links": [], "published": "2015-10-22T21:14:00.000+03:00", "crawled": "2015-10-23T00:18:14.520+03:00", "highlightTitle": ""}