{"organizations": [], "uuid": "aa88c90bed1ff1514742840b5dfd8539bdfce0cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/33/d7d376487c417255bd229ea985c306/media:6f828bd7a2f941938c668a192cca9d27SouthernCaliforniaRain.JPEG", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/us/articles/2015/10/15/southern-california-storm-causes-flash-flooding", "country": "US", "title": "Southern California storm causes flash flooding", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Southern California storm causes flash flooding - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "aa88c90bed1ff1514742840b5dfd8539bdfce0cc"}, "author": "USNews", "url": "http://www.usnews.com/news/us/articles/2015/10/15/southern-california-storm-causes-flash-flooding", "ord_in_thread": 0, "title": "Southern California storm causes flash flooding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Southern California storm brings flash floods and mud flows; vehicles stranded, roads closed In this photo provided by Caltrans, vehicles are stopped in mud on California's Interstate-5 after flooding Thursday, Oct. 15, 2015. (Caltrans via AP)\nAssociated Press Oct. 16, 2015 | 12:07 a.m. EDT + More By CHRISTINE ARMARIO and AMANDA LEE MYERS, Associated Press\nLOS ANGELES (AP) — Flash flooding sent water, mud and rocks rushing across Interstate 5 north of Los Angeles Thursday, stranding hundreds of vehicles and closing the major north-south thoroughfare.\nThe flooding at Fort Tejon, about 75 miles north of downtown Los Angeles, was part of a storm system that brought downpours across a wide swath of northern Los Angeles County. A number of secondary roads were left impassable from mud and some residents were trapped in their homes.\nThere were no immediate reports of deaths or injuries from the flooding that began just before the afternoon commute.\nPhotos of Interstate 5 posted on social media showed the freeway in disarray, with semi-trucks and cars sitting askew, stuck in mud that in some cases surpassed their wheels. Not an inch of asphalt was visible.\nOne of the worst-hit areas was Lake Hughes. Robert Rocha, a 37-year-old resident, said he was driving home from work when the storm arrived.\n\"It was getting pretty hairy out there,\" he said. \"I've never seen it rain that hard in such a short period of time, the hail and wind — it was coming down hard,\" he said. \"The debris was just intense — chunks of wood and rock flowing everywhere.\"\nLos Angeles County Fire Department Capt. Keith Mora said the agency rescued four people and two dogs from atop one car. Many more were able to walk to safety after waiting out the flood on top of their own vehicles, he said.\n\"They were able to use their vehicles as a security blanket, to stand on top of and stay higher than the flood water,\" Mora said.\nThe storm was instigated by a low pressure system absorbing moisture from the south and sparked severe weather and flash flood warnings across southwestern California. As much as 1.45 inches of rain fell in a quick span of time near where the most intense flooding occurred.\nThe system was expected to shift slowly eastward through Friday, National Weather Service meteorologist Joe Sirard said.\nOn Interstate 5, up to 5 feet of mud covered the northbound lanes, which were expected to take up to a day to clear, California Department of Transportation spokeswoman Lauren Wonder said. The southbound lanes had less mud and were expected to reopen more quickly.\nThousands of cars and trucks were backed up for miles on the inland route that runs the length of California.\nBack in Lake Hughes, Jennifer Stewart said she had just picked up her 17-year-old daughter from school when the storm hit.\n\"The hail was so bad I thought it was going to crack my windshield,\" she said.\nStewart said she was among about 30 motorists who were left stranded on a local road. Everyone was calm, she said.\n\"It's kind of like a tailgate party without the party,\" she said. \"Everyone's just quietly sitting in their cars talking among themselves.\"\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe8oa0%3Fsrc=usn_fb", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe8oa0%3Fsrc=usn_rd&title=Southern%20California%20storm%20causes%20flash%20flooding", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe8oa0%3Fsrc=usn_su", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe8oa0%3Fsrc=usn_gp", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe8oa0%3Fsrc=usn_tw&via=usnews&text=Southern%20California%20storm%20causes%20flash%20flooding", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe8oa0%3Fsrc=usn_li&title=Southern%20California%20storm%20causes%20flash%20flooding&summary=&source=U.%20S.%20News"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T07:43:48.653+03:00", "highlightTitle": ""}