{"organizations": [], "uuid": "5d622e7f518cbb7d5847c1f2fadfaa8b1d05c34d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mirror.co.uk", "main_image": "http://i3.mirror.co.uk/incoming/article6526508.ece/ALTERNATES/s1200/unnamed-3.jpg", "site_section": "http://www.mirror.co.uk/all-about/politics", "section_title": "Politics - News, views, gossip, pictures, video - Mirror Online", "url": "http://www.mirror.co.uk/news/uk-news/labour-urged-kick-nasty-tories-6547364", "country": "US", "title": "Labour urged to \"kick the nasty Tories out\" in barnstorming speech by Tom Watson", "performance_score": 0, "site": "mirror.co.uk", "participants_count": 1, "title_full": "Labour urged to \"kick the nasty Tories out\" in barnstorming speech by Tom Watson - Mirror Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:24:00.000+03:00", "replies_count": 0, "uuid": "5d622e7f518cbb7d5847c1f2fadfaa8b1d05c34d"}, "author": "Ben Glaze", "url": "http://www.mirror.co.uk/news/uk-news/labour-urged-kick-nasty-tories-6547364", "ord_in_thread": 0, "title": "Labour urged to \"kick the nasty Tories out\" in barnstorming speech by Tom Watson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Labour big beast Tom Watson has closed the party's annual conference with a rousing battle cry, urging activists to “kick these nasty Tories down the road where they belong”.\nThe Deputy Leader rallied delegates after a mixed five-day get-together in Brighton, which ended with the traditional Red Flag socialist anthem and Jerusalem.\nMore than 2,200 new members joined the party yesterday following Jeremy Corbyn 's debut conference speech as leader, Mr Watson revealed.\nHe told activists: “We’ve had our summer of introspection, let’s get back out into the country and start talking to people.\n“Let’s get out onto every street in every suburb of Britain and start listening to people. Then let’s harness the power of the great movement we’ve always been.”\nThe seaside conference was the party's first since Labour's bruising general election defeat which forced Ed Miliband to quit as leader.\nVideo loading Watch next Watch this video again Watch Next\nIn a barnstorming address aimed at kickstarting a revival, Mr Watson hailed a “great gathering of the Labour clan” - and brushed off bust-ups over Trident and planned RAF air strikes on Syria.\n“Every fringe meeting, every debate, every discussion this week has fizzed with the opportunity for change,” he said.\n“From unity comes strength. That’s why we’re stronger now, as we prepare to leave Brighton, than we were when we arrived.\n“We speak with one voice. We are 'One Labour'.”\nTurning his guns on the Conservatives, he fumed that austerity had “wreaked havoc on ordinary people”.\nHe added: “Over three million working people are worse off.\n“This winter they’ll have to choose between keeping their children warm or keeping them fed - in one of the richest countries in the world.\n“That’s what austerity means. It’s disgusting.\n“For the first time since the war, people now in their twenties and thirties are worse off than their parents’ generation.\n“And unless something changes, they always will be – and the only change there can be is Labour.”\nDaily Mirror Leading the way: Tom Watson praised new leader Jeremy Corbyn\nAdmitting he “hates the powerlessness of opposition”, Mr Corbyn's number two attacked the “nasty” Tories, saying: “After this conference no one can be in any doubt they’ll have a choice at the next general election.\n“The difference between us and the Tories is that we see the great British spirit of enterprise as the engine of our Welfare State.\n“To the Tories, the market’s an end it itself. They’re completely fixated on money, but they don’t understand what it’s for. That’s the Tory tragedy.\n“We want to build a prosperous Britain.\n“But we also want a kinder, fairer Britain, in which everybody has a chance for a decent life - and we’re still a long way off.”\n ", "external_links": ["https://www.facebook.com/DailyMirror", "https://www.facebook.com/Mirrorpolitics", "https://twitter.com/benglaze", "http://brightcove.vo.llnwd.net/v1/unsecured/media/4221396001/201509/1763/4221396001_4520741355001_4520654759001-vs.jpg?pubId=4221396001", "https://plus.google.com/u/0/+Mirror/posts", "https://twitter.com/Mirrorpolitics", "http://www.dailyrecord.co.uk/incoming/video/video-labour-conference-jeremy-corbyns-6544929&quot;,&quot;thumbnailUrl&quot;:&quot;http://brightcove.vo.llnwd.net/v1/unsecured/media/4221396001/201509/1010/4221396001_4518290077001_Ideo1443544061891I-1520-1-480x360.jpg?pubId=4221396001&quot;},{&quot;duration&quot;:97,&quot;id&quot;:6544999,&quot;title&quot;:&quot;This"], "published": "2015-09-30T23:24:00.000+03:00", "crawled": "2015-10-01T00:29:44.165+03:00", "highlightTitle": ""}