{"organizations": [], "uuid": "9967e60c8d6cfc8008723342a1ea9939ee65ae16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/15/Editorial-Opinion/Images/GOP_2016_Kasich-07454.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/washington-is-obsolete/2015/10/15/cb3bbf8c-7109-11e5-8248-98e0f5a2e830_story.html", "country": "US", "title": "John Kasich: Washington is obsolete", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "John Kasich: Washington is obsolete - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "9967e60c8d6cfc8008723342a1ea9939ee65ae16"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/washington-is-obsolete/2015/10/15/cb3bbf8c-7109-11e5-8248-98e0f5a2e830_story.html", "ord_in_thread": 0, "title": "John Kasich: Washington is obsolete", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ohio Gov. John Kasich. (Steve Helber/AP) By John Kasich October 15 at 9:27 AM John Kasich is governor of Ohio and a Republican candidate for president.\nThe biggest problem with America’s economy is called Washington. The anemic growth we have today isn’t because the federal government failed to do enough but because it succeeded in doing too much.\nTake the so-called stimulus package designed to pull us out of the Great Recession. Its gift was underwhelming growth, stratospheric deficits and an $18 trillion debt. If our long, slow recovery stalls or turns south, is more government “help” the answer? No. It would deepen our problem, further balloon Washington and leave less economic oxygen available for Americans and businesses.\nIf we want to get serious about economic growth, we need less government and more “us.” We need to take our money, power and influence from Washington and bring it back to the states and communities where we live. That is the federalism the Founding Fathers intended for us, and in the first 100 days of my administration, I will seek votes in Congress to restore it.\nIt starts with restraining spending and balancing the budget in eight years, cutting personal and corporate taxes to spark growth, and re-engineering the entitlement programs that are bankrupting us and failing those who need them. It also means reining in regulations so we can, among other things, produce more energy from all sources and become energy-independent. But at the center of this renewal is transferring major pieces of Washington’s responsibilities back to the states to reduce costs, improve efficiency and increase innovation.\nLet’s start with infrastructure. The interstate system is longfinished, and states already oversee their own highway design and construction. Americans don’t need a costly federal highway bureaucracy. I will return the federal gas taxes to the states, leaving only a sliver with the federal government for truly national needs. Then, I will downsize the Transportation Department and reassign it a smaller role, supporting states with research and safety standards. Federal spending would go down, resources available for highways and transit could go up, and states could work faster.\nThe Education Department will receive a similar approach. Washington isn’t America’s principal or its teacher. Education is a local issue, and decisions should be made by parents, our communities and our local educators. We need high standards, but they are not Washington’s business. I will bundle the department’s funds and send them back to the states with fewer strings attached. The department will be a research center and a local school booster, not a micromanager.\nThe same goes for the dozens of jobtraining programs Washington runs. With little room for state innovations or real business input, workers basically can’t get help until after they’ve lost their jobs. I will let states align training with the skills that employers want and help workers with jobs upgrade their skills so their employers can stay in business and compete.\nAnd nowhere has Washington’s one-size-fits-all approach done more harm to innovation and those it should be serving than with Medicaid. In Ohio we reined in Medicaid costs and are improving health outcomes by using private-sector health insurance and coordinated chronic-disease care and by paying for health-care value instead of just volume. If Washington eased its grip, there would be even more innovation to improve quality and constrain Medicaid’s unsustainable costs.\nThere may have been a time when our nation’s size and complexity required a strong, centralized government, but today’s technology gives states access to the same ideas and capabilities as Washington — and they can execute faster and more efficiently. Downsizing Washington and pulling back our money effectively leverage those advantages to drive higher productivity and rates of growth.\nLike our founders, I have never trusted big, centralized power. It is hard to hold in check, abuses are inevitable, and over time it becomes wasteful, insular and arrogant. I enjoy taking it on and beating it, however, as when I chaired the House Budget Committee and led the effort to balance the federal budget, or in Ohio, where we’ve turned an $8 billion projected shortfall to a $2 billion surplus.\nReclaiming federalism will take the same guts, because those who live off Washington’s bloat won’t go quietly. If we want results now, however, it’s worth the fight — to revive our economy and restore the intended hierarchy of power in our nation: first our communities and states and then the federal government.\nNo solution to our economic paralysis — or Washington’s gridlock — better reflects our founders’ vision than federalism. It will be hard, but with the courage to put our country and each other first, we can attain the security and opportunity we want, for those we care about and for the future. They’re within our reach.\nRead more:\nGeorge F. Will: Education is the business of the states\nCharles Krauthammer: Raise the gas tax. A lot.\nJennifer Rubin: What happened to federalism?", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T22:19:38.604+03:00", "highlightTitle": ""}