{"organizations": [], "uuid": "0453f68899696ee70a34a7dd5ea96c3b8ba9f1ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.debatepolitics.com", "main_image": "", "site_section": "http://www.debatepolitics.com/external.php?type=RSS2", "section_title": "Debate Politics Forums", "url": "http://www.debatepolitics.com/art-and-entertainment/237792-bitch-eye-hopeless-guy.html", "country": "US", "title": "Bitch Eye for the Hopeless Guy", "performance_score": 0, "site": "debatepolitics.com", "participants_count": 1, "title_full": "Bitch Eye for the Hopeless Guy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T14:04:00.000+03:00", "replies_count": 0, "uuid": "0453f68899696ee70a34a7dd5ea96c3b8ba9f1ce"}, "author": "spangledbanner", "url": "http://www.debatepolitics.com/art-and-entertainment/237792-bitch-eye-hopeless-guy.html", "ord_in_thread": 0, "title": "Bitch Eye for the Hopeless Guy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "818 Bitch Eye for the Hopeless Guy Like many of you I have seen a few episodes of Queer Eye for the Straight Guy. And Im not afraid to tell you that the theme song did get stuck in my head a few times. After watching the show a few times I decided that the best thing a man could do would be the exact opposite to what the gay men were telling straight men to do to improve themselves. So thanks to Queer Eye for the Straight Guy I now know never to just shave under the jaw line. And some other stuff. I really do not think that straight men should be getting make overs from gay men. But it was a positive show and I kind of liked it. I like those gay guys on the show. They are all seem to be very nice people. Anyway - I was watching tv today and I saw a show that uses the same formula as Queer Eye for the Straight guy but instead of a group of gay men giving life advice to someone this show has a really hot woman - Olivia Lee - and she is a real bitch and what she does is she goes to some down and out hopeless miserable loser type guy and she emasculates him and makes him accept that it is not the world that is wrong - it is just that he is a hopeless loser - and then she gives him a ridiculous make over that does nothing and then sets up a date with a slightly above average looking female ( that is nowhere near as good looking as total bitch Olivia Lee ) that takes place at a decent looking apartment that the loser guy doesnt own because he probably lives with his parents or at a place that you wouldnt want to take a date home to. What I would have called the show is - Bitch Eye for the Hopeless Guy. Believe it or not, there are still some men who give matte-look hair wax, sidling over to girls with a raised eyebrow, and owning their own home a swerve. You know, losers. Each week in Man Up (Wednesday, 10pm, FOX) Olivia Lee hopes to explore the nuances of masculinity in the accelerated pace of a shifting culture by nagging one of these chumps. And then giving them a makeover. Over the course of this series, themes of unemployment, poor grooming and sloth emerge, all of which are qualities found in our first loser, Kris. Christ in a dole queue, Kris: no job in this rotten workhouse of a fiscal climate? MAN UP. Floundering to find meaning in a sick society built on vanity and greed? MAN UP. Council did your haircut? You know what to do, MAN… oh I give UP. Man Up: here to end Britain's masculinity crisis | Television & radio | The Guardian It seems that I am not the only one that has notices that Olivia Lee is a heartless and sadistic bitch. The main problem with this show is that the types of guys that they have on the show probably should be depressed ( I have only seen one episode but I get the idea ). If we are going to be serious. The only thing that is going to cheer these guys up is saying the Serenity Prayer maybe. I really dont think that Olivia Lee is helping or cares at all. These depressed and miserable guys are just being exploited for entertainment. Maybe people like this kind of thing but to me it seemed kind of sick. The problem with lifestyle makeover shows is that the \"belittle 'em till they're fragments on the carpet then build 'em up again\" approach seems sadistic when the subjects are already broken. And Olivia Lee – who has the presenting style of a bossy girlfriend you'd flay a bag of kittens to be rid of – is not the woman to rebuild them. I have doubts about how effectively she could rebuild a pile of Lego without reducing the inanimate bricks to twitching misogynists harbouring plans to do a McVeigh on a branch of Topshop. Before Kris makes his ultimate return to his sister's spare bedroom, he must face his final punishment, the Climax Challenge. Luckily, he's been given a manover – ie a shave and some Joe 90 glasses – so his date should at least be able to keep her dinner down. The lucky lady, it turns out, is the least uncomfortable massage victim, Alba. And she's a gift from the heavens: warm, funny, and effortlessly chatting him down from his towering awkwardness.", "external_links": [], "published": "2015-10-24T14:04:00.000+03:00", "crawled": "2015-10-24T15:41:12.935+03:00", "highlightTitle": ""}