{"organizations": [], "uuid": "d3b841829b588d642334e437855b61c4334d13c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jpupdates.com", "main_image": "", "site_section": "http://jpupdates.com/feed/", "section_title": "JP Updates | Breaking News NYC, Jewish Political News & Updates", "url": "http://jpupdates.com/2015/10/17/four-killed-in-anti-israeli-knife-attacks/", "country": "US", "title": "Four killed in anti-Israeli knife attacks", "performance_score": 0, "site": "jpupdates.com", "participants_count": 1, "title_full": "Four killed in anti-Israeli knife attacks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T02:40:00.000+03:00", "replies_count": 0, "uuid": "d3b841829b588d642334e437855b61c4334d13c1"}, "author": "jpupdates", "url": "http://jpupdates.com/2015/10/17/four-killed-in-anti-israeli-knife-attacks/", "ord_in_thread": 0, "title": "Four killed in anti-Israeli knife attacks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Israeli medics carry away the body of a Palestinian man who was shot dead after he attempted to stab an Israeli soldier in east Jerusalem, on October 17, 2015 \n(AFP) Four Palestinians were shot dead and a fifth wounded in attacks on Israelis in east Jerusalem and the West Bank Saturday, as violence that has fuelled concerns of an uprising showed no let-up. \nThe violence that has raged for more than two weeks prompted a “very concerned” US President Barack Obama to call for calm. \nIncluding alleged assailants, 41 Palestinians have been killed since the violence erupted on October 1. Seven Israelis have lost their lives. \nThe mounting death toll has prompted fears of a new Palestinian intifada, or uprising, like those of 1987-1993 and 2000-2005, when thousands were killed in near-daily violence. \nThree of Saturday’s attacks took place in the flashpoint West Bank city of Hebron, where some 500 Jewish settlers live in a heavily guarded enclave in the city centre surrounded by nearly 200,000 Palestinians. \nA fourth was at a checkpoint in a Jewish settlement neighbourhood of Israeli-annexed east Jerusalem, and a fifth at another checkpoint. \nIn the first Hebron incident, a Palestinian tried to stab a settler before his intended victim, who was unharmed, shot him dead, the army said. \nPalestinian security sources identified the assailant as 18-year-old Fadel al-Kawatsmi. \nVideo circulated by Palestinian activists showed a young man wearing a kippa brandishing a pistol as shots rang out before Israeli soldiers moved in to pull him away from a body lying on the ground. \nIn the second attack, a Palestinian girl attempted to stab a female Israeli soldier outside a border guard base before being shot dead by her would-be victim, Israeli police said. \nThe soldier suffered minor injuries to her hand, police spokeswoman Luba Samri said. \nPalestinian media said her assailant was aged 16. \nAnd a Palestinian was shot after stabbing and moderately wounding a soldier, the army reported, without saying whether the attacker was killed. \nTroops also opened fire at stone-throwing Palestinian youths in several sectors of Hebron, wounding 11 with rubber bullets and one with a live round, Palestinian medics said. \nIn east Jerusalem, a Palestinian tried to stab a soldier at a checkpoint in East Talpiot but was shot dead by other soldiers. \nPolice said the assailant was a 16-year-old from nearby Jabel Mukaber, the same neighbourhood that was home to three Palestinians who carried out attacks earlier this week. \nAnd a border guard killed a 24-year-old Palestinian who tried to knife him at the Qalandiya checkpoint between Jerusalem and the West Bank, police said. \nMeanwhile, in the Gaza Strip, army gunfire on the border wounded at least four civilians, according to the enclave’s health minister Ashraf al-Qudra. \nIsraeli security forces have deployed massively in Jerusalem to try to halt the attacks and, on Wednesday, began setting up checkpoints in parts of east Jerusalem, including Jabel Mukaber. \nBut that has failed to stop the violence. \nLate Saturday, some 2,000 pro-peace demonstrators answered a call by Israeli leftist groups and gathered in the centre of Jerusalem under the banner “Jews and Arabs refuse to be enemies”, an AFP reporter at the scene saw. \n‘Inflammatory rhetoric’ \nThe United States, which tried but failed last year to broker peace talks between Israel and the Palestinians, urged leaders on both sides to help rein in the unrest. \n“We are very concerned about the outbreak of violence,” Obama said in Washington Friday. \nViolence in the West Bank \n“It’s important for both (Israeli) Prime Minister (Benjamin) Netanyahu… and (Palestinian) president (Mahmud) Abbas and other people in positions of power, to try to tamp down rhetoric that may feed violence or anger or misunderstanding,” he said. \nUS Secretary of State John Kerry, who could travel to the region soon, has spoken separately to Abbas and Netanyahu to ask them to restore calm. \nAbbas has been under pressure over recent comments that some have labelled incitement and has called for peaceful protests without explicitly condemning the violence. \nBut on Friday he condemned an arson attack the previous night on Joseph’s Tomb, a West Bank site which is holy to Jews. \nThe same day, four Palestinians were killed, one after posing as a news photographer to stab and wound a soldier outside a Jewish settlement. \nAs hundreds of Palestinians joined the funeral of Ayad Awawdeh in the West Bank village of Dura on Saturday, his mother told AFP her son had “watched the news on television the whole time and exploded with anger at seeing so many horrors”. \nSuch funerals may soon be a thing of the past — Israel has warned that it may not hand over the bodies of those responsible for attacks to their families for burial. \nThe violence began on October 1, when a suspected cell of the Islamist movement Hamas murdered a Jewish settler couple in the West Bank in front of their children. \nBut subsequent attacks are believed to have been “lone wolf” operations. \nThe violence came after repeated clashes in September between Israeli forces and Palestinian youths at east Jerusalem’s flashpoint Al-Aqsa mosque compound.", "external_links": [], "published": "2015-10-18T02:40:00.000+03:00", "crawled": "2015-10-18T03:38:20.294+03:00", "highlightTitle": ""}