{"organizations": [], "uuid": "31a3e929baaef7b64451297525f73bc243b8e8f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lgbtweekly.com", "main_image": "http://lgbtweekly.com/wp-content/uploads/2015/10/wpid-184_5259_7783-291x300.jpg", "site_section": "http://lgbtweekly.com/category/commentary/poiticallyaware/feed/", "section_title": "LGBT Weekly » Politically Aware", "url": "http://lgbtweekly.com/2015/10/15/grading-the-democratic-presidential-candidates-debate-performances-2/", "country": "US", "title": "Grading the Democratic presidential candidates’ debate performances", "performance_score": 0, "site": "lgbtweekly.com", "participants_count": 1, "title_full": "Grading the Democratic presidential candidates’ debate performances", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T22:00:00.000+03:00", "replies_count": 0, "uuid": "31a3e929baaef7b64451297525f73bc243b8e8f3"}, "author": "LGBT Weekly", "url": "http://lgbtweekly.com/2015/10/15/grading-the-democratic-presidential-candidates-debate-performances-2/", "ord_in_thread": 0, "title": "Grading the Democratic presidential candidates’ debate performances", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » Latest Issue , Politically Aware » Grading the Democratic presidential candidates’ debate performances Grading the Democratic presidential candidates’ debate performances Posted by LGBT Weekly Latest Issue , Politically Aware Thursday, October 15th, 2015 Commentary: Politically Aware by Joel Trambley Hillary Clinton \nTuesday night, the Democratic presidential candidates gathered in Las Vegas for their first debate, hosted by CNN and Facebook. Not much time was spent on education beyond free college, but that won’t stop everyone, including Politically Aware, from grading the performances. \nCNN – D. The intro sequence sounded more like the opening to The Jerry Springer Show than a debate, and the Vegas gambling reference was corny. Anderson Cooper started a few awkward feet from his podium, the first signal he was off his game. He seemed to favor Clinton, letting her speak at length over his “time’s up” entreaties, instead of reminding her that she had agreed to the rules as he did with Sen. Webb. Cooper also seemed to insert himself, and new questions, just when exchanges were getting good. Keeping Don Lemon off camera until it was time for a Black Lives Matter question was awful. \nFacebook gets an “Incomplete.” Facebook was used for few questions overall, and CNN seemed to consider them a nearly invisible partner, as evidenced by the relative number of logos visible throughout. \nHillary Clinton – A++. Clinton’s campaign no doubt gave her a list of things to get done. It’s hard to imagine a box she didn’t check. Presidential? Can you say Situation Room? Judgement? Yes, I voted for the Iraq war, and President Obama still picked me for secretary of state. Funny? It takes me a little longer in the bathroom. General election strategy? I’m sick of Republicans saying government isn’t the answer for anything but attacking a woman’s reproductive rights. Bonus points for getting her opponent to take the email issue off the table. \nClinton’s low points were on questions about health care and college tuition for undocumented immigrants and recreational marijuana. Her dodgy answers were painfully reminiscent of the driver’s license debacle of 2008, but wrapping her view in a state’s rights argument offers some insulation from Republican attacks. Her constant nodding at opponents and C-shape hand gestures were optically odd, but she had every right to walk off the stage, strike a Pitch Perfect pose, and yell, “Crushed it!” \nBernie Sanders – C. Like Clinton, Sanders checked most of the boxes on his to-do list. He got his message of a rigged system and income inequality out there, and clearly added items he hoped would broaden his appeal to people of color. Opponents landed a few punches about his gun control record, but nothing too damaging. He sounded like the fake Steinbrenner on Seinfeld, but that’s not his fault. \nWhat he didn’t do was hit, much less take out, Clinton. Instead, he helped her multiple times. Sanders says he won’t run a negative campaign, and that the “revolution” and voter turnout will elect him and a governing coalition. Howard Dean and Ron Paul waited for that revolution. Unless he changes strategy or Clinton implodes, Sanders will do just what they did – energize the base and gift wrap it for the eventual nominee. \nMartin O’Malley – A for Effort, B overall. Unlike Sanders, O’Malley did everything he could to change the dynamic of the race. He sounded intelligent and looked like the only leader from the next generation while seeming sufficiently presidential. He frequently took on Clinton and Sanders, using the exchanges to accrue the third most speaking time. O’Malley won the discussion of rights and services for undocumented immigrants, and his closing statement was the most uplifting set piece delivered all night. There was a certain Jimmy Stewart-esque aspect to his presence that was mostly endearing but occasionally off-putting. His biggest gaffe, that Assad invaded Syria (he is Syria’s President), went largely unnoticed. \nUnfortunately for O’Malley, Clinton was too good and Sanders wasn’t too bad. O’Malley’s poll numbers will go up and he will be included in the next debate, but he’s a long way from beating Clinton or becoming her main competition. \nJim Webb – D-. As a veteran with administrative experience under President Reagan and elected experience as a Democratic Senator, Webb brings a unique perspective. His views on many issues are outside the Democratic mainstream, so he could have forced interesting and important discussions. Instead, he spent too much of the time he did have whining about the time he didn’t have or the “10 minutes” he had been waiting to speak. \nIf Webb somehow makes another debate, he needs to be less stilted, more gracious, and use whatever time he has to pound on national security issues, where is clearly the most comfortable and passionate. It’s unlikely Webb will get the opportunity. It’s hard to imagine the electorate that sent Gov. Rick Perry packing for blanking on the third agency he wanted to eliminate doing less to a candidate who stumbled over his daughters’ names. \nLincoln Chafee – F. Chafee started the debate as a non-presence and ended it that way or worse. His main talking point was that he wasn’t attached to any scandals, which was an obvious and ineffective shot at Clinton and an open invitation for journalists nationwide to find something. There are many reasonable ways to deal a votes you may regret, but “I was new to the Senate and didn’t know better” (paraphrase) isn’t one of them. Sadly, that wasn’t even Chafee’s low point, which came when Clinton was asked if she wanted to respond to one of his comments. Seeming to speak for the entire debate hall, Clinton simply said “No” to considerable applause. The sixteenth President deserves better in a namesake. Related Posts", "external_links": [], "published": "2015-10-15T22:00:00.000+03:00", "crawled": "2015-10-16T03:26:26.831+03:00", "highlightTitle": ""}