{"organizations": ["Congress"], "uuid": "323a923b01341e0b14648d1054db9cfd61f616dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ocregister.com", "main_image": "http://www.ocregister.com/images/ocregister_facebooksharer.png", "site_section": "http://ocregister.com//common/rss/rss.php?catID=18805", "section_title": "The Orange County Register - News Headlines : Politics and government", "url": "http://www.ocregister.com/articles/grove-687355-garden-nguyen.html", "country": "US", "title": "Garden Grove mayor announces run for Congress", "performance_score": 0, "site": "ocregister.com", "participants_count": 0, "title_full": "Garden Grove mayor announces run for Congress - The Orange County Register", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "323a923b01341e0b14648d1054db9cfd61f616dc"}, "author": "", "url": "http://www.ocregister.com/articles/grove-687355-garden-nguyen.html", "ord_in_thread": 0, "title": "Garden Grove mayor announces run for Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bao Nguyen"], "text": "For the last several weeks, it looked increasingly likely – and now it’s official: Garden Grove Mayor Bao Nguyen wants a promotion.\nThe 35-year-old first-term mayor announced earlier this week on the steps of the Santa Ana Veterans Hall that he is running for U.S. Congress. \nNguyen was elected Garden Grove mayor less than a year ago and over the last several weeks, as it became increasingly clear he was going to run for the 46th district, received heat from some Garden Grove residents for what they viewed as him using the City Council as a stepping stone.\nHe’s come under fire for trying to pass a symbolic resolution supporting a presidential executive order that would have prevented undocumented workers with American-born children from being deported.\nOn Tuesday, Nguyen said that his run would not hurt his ability to work with the council.\n“I’m confident my colleagues on the council have the best interest of the city at heart, as do I,” Nguyen said, “and we will continue to work to help the city.”\nNguyen said that since he became mayor, City Hall has achieved for Garden Grove many things he advocated for, particularly open and transparent government. \nHe cited the city working with the transparency website OpenGov, which Stanton has also begun working with, to put financial data online in an easy-to-use manner; and allowing people to make public records requests online.\nHe did come under fire when an audio recording surfaced of a conversation he had in June with the president of the Garden Grove Police Association, during which he mused about a run for Congress and used an expletive to describe a council colleague. \nHe didn’t initially want the tape released, but ultimately acquiesced. \nNguyen said he wants to reform Washington, make it more transparent and do more to help his fellow residents.\n“Garden Grove will always be my home,” he said. “What I could do (as a congressman) for Garden Grove is greater.”\nBut he wouldn’t be representing only Garden Grove. In fact, if he elected, he will only represent a portion of the city he grew up in. He is running for the the 46th district, which covers Santa Ana, Anaheim and parts of Garden Grove and Orange. The seat is open because Rep. Loretta Sanchez, D-Orange, is running for U.S. Senate.\nNguyen, one of five Democrats in the race, announced his candidacy with a typical liberal platform advocating immigration reform, protections for women’s healthcare services and creating jobs for lower- and middle-income workers.\nContact the writer: 714-704-3707 or chaire@ocregister.com", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T11:19:42.724+03:00", "highlightTitle": ""}