{"organizations": [], "uuid": "db4f1830e8c2b366b0f2bee838ea0f2739416ee9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/09/Editorial-Opinion/Images/GOP_2016-08f0c-1635.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/ted-cruz-calculates-a-path-to-the-nomination/2015/10/09/a5d6d3a6-6dff-11e5-b31c-d80d62b53e28_story.html", "country": "US", "title": "Ted Cruz’s audacious plan to win the GOP nomination", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Ted Cruz’s audacious plan to win the GOP nomination - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "db4f1830e8c2b366b0f2bee838ea0f2739416ee9"}, "author": "George F. Will", "url": "http://www.washingtonpost.com/opinions/ted-cruz-calculates-a-path-to-the-nomination/2015/10/09/a5d6d3a6-6dff-11e5-b31c-d80d62b53e28_story.html", "ord_in_thread": 0, "title": "Ted Cruz’s audacious plan to win the GOP nomination", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Presidential candidate Ted Cruz speaks in Hooksett, N.H. (Cheryl Senter/Associated Press) By George F. Will Opinion writer October 9 at 7:34 PM Follow @georgewill DALLAS\nIf America’s 58th presidential election validates Ted Cruz’s audacious “base plus” strategy, he will have refuted assumptions about the importance of independent “swing” voters and the inertia of many missing voters. Critics say his plan for pursuing the Republican nomination precludes winning the presidency. Jason Johnson, Cruz’s chief strategist, responds: “I’m working backward from Election Day,” because Cruz’s plan for winning the necessary 1,236 convention delegates is an extrapolation from his strategy for winning 270 electoral votes.\nGeorge F. Will writes a twice-weekly column on politics and domestic and foreign affairs. He began his column with The Post in 1974, and he received the Pulitzer Prize for Commentary in 1977. He is also a contributor to FOX News’ daytime and primetime programming. View Archive Facebook RSS All presidential campaigns aspire to favorably change the composition of the electorate. Cruz aims to substantially reconfigure the electorate as it has recently been.\nBetween George W. Bush’s 2000 election and his 2004 reelection, the turnout of non-Hispanic whites increased by an astonishing 10 million. Barack Obama produced a surge of what Johnson calls “two-election voters.” In 2008, the African American voting rate increased from 2004 while white voting declined slightly; in 2012, African Americans voted at a higher rate than whites.\nIn Florida in 2012, turnout of non-Hispanic whites declined from 2008 even though the eligible voting-age population increased by 864,000. Nationally, the Census Bureau’s Thom File writes: “The number of non-Hispanic white voters decreased by about 2 million between 2008 and 2012.” In the past five elections (1996-2012), their share of eligible voters declined from 79.2 percent to 71.1 percent and their share of the turnout declined from 82.5 percent to 73.7 percent, while the Hispanic and black shares of votes cast increased about four and three percentage points, respectively.\nNonvoting whites, especially those without college experience, are among Cruz’s principal targets. His geniality toward Donald Trump reflects the Cruz campaign’s estimate that perhaps one-third of the Trumpkins have not voted in recent elections. If so, Trump is doing downfield blocking for Cruz , beginning the expansion of the 2016 electorate by energizing people whose alienation from politics has made them nonvoters.\nCycle after cycle, says Johnson, the percentage of true swing voters shrinks. Therefore, so does the persuadable portion of the electorate. Cruz aims to leaven the electorate with people who, disappointed by economic stagnation and discouraging cultural trends for which Republican nominees seemed to have no answers, have been dormant during recent cycles.\nConsider Pennsylvania, which has voted Democratic in six consecutive elections and which James Carville described as Pittsburgh in the west, Philadelphia in the east and Alabama in between . Cruz’s aim, says Johnson, will be “to improve on Romney at the margins in the Philadelphia suburbs,” do three points better than Romney (5.5 percent) among African Americans (with many “two election” voters staying home with Obama gone) and to locate and motivate many previous nonvoters in Pennsylvania’s “Alabama.” In 2012, Obama became the first Democrat since George McGovern in 1972 to lose the Pittsburgh metropolitan area .\nWhites without college experience include disproportionate numbers of nonvoters whose abstention in 2012, according to the Market Research Foundation, produced Obama’s Electoral College victory. The Cruz campaign’s substantial investment in data scientists serves what Johnson calls “behavioral micro-targeting,” changing behavior as well as gathering opinions. If a person drives a Ford F-150 and subscribes to Guns & Ammo, he probably is conservative. The challenge is to make him a voter by directing to him a package of three- or four-issue appeals tailored to him.\nCruz has county chairs organizing in all 172 counties in Iowa, New Hampshire, South Carolina and Nevada. National Review’s Eliana Johnson reports that through the second quarter, Cruz had", "external_links": ["https://www.facebook.com/georgewill", "https://twitter.com/@georgewill", "https://www.census.gov/prod/2013pubs/p20-568.pdf", "http://www.census.gov/newsroom/press-releases/2013/cb13-84.html", "http://thefederalist.com/2015/06/17/how-the-gop-could-win-pennsylvania/", "https://en.wikiquote.org/wiki/James_Carville"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T02:55:47.589+03:00", "highlightTitle": ""}