{"organizations": [], "uuid": "4223c8674ee20aaf4f308548873ffed0b54f9b05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/65/e0/17d2fe764aad8d767dc64924bd39/151005-mitch-mcconnell-gty-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/senate-mcconnell-no-partner-214575", "country": "US", "title": "House Leadership: Without a speaker, McConnell's lonely on the fiscal dance floor", "performance_score": 1, "site": "politico.com", "participants_count": 1, "title_full": "House Leadership: Without a speaker, McConnell's lonely on the fiscal dance floor - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:11:00.000+03:00", "replies_count": 0, "uuid": "4223c8674ee20aaf4f308548873ffed0b54f9b05"}, "author": "Seung Min Kim", "url": "http://www.politico.com/story/2015/10/senate-mcconnell-no-partner-214575", "ord_in_thread": 0, "title": "House Leadership: Without a speaker, McConnell's lonely on the fiscal dance floor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mitch McConnell has no dance partner in the House. That's bad news for Mitch McConnell. The Senate majority leader has made no secret of his strategy to keep control of the Senate next year and win the White House — by demonstrating Republicans can govern responsibly and avoid self-inflicted wounds.\nBut the House GOP is in disarray, with no clear replacement for retiring Speaker John Boehner. And lawmakers have only a few weeks to navigate a series of fiscal land mines that includes the threat of a catastrophic debt default, another potential government shutdown showdown and a looming highway bill deadline — big lifts in the best of times in the House, let alone a period of major internal strife.\nIn a series of interviews, GOP senators said McConnell’s steady grip over his conference is going to be even more important in the coming weeks as the House grapples with its leadership void. But, they added, there’s only so much McConnell can do without a reliable partner in the House.\n“Mitch is gonna … figure very prominently into what happens in the end here because of some of the uncertainty in the House,” said South Dakota Sen. John Thune, the third-ranking Senate Republican. “He’ll be very much in the mix.”\n“It obviously makes it extremely difficult to strategize for Mitch,” added Sen. John McCain (R-Ariz.). “Until they have a leader it’s pretty hard for there to be coordination between the Senate and the House.”\nReid starts new gun-control push, calls Republicans 'puppets' of NRA By Seung Min Kim and Burgess Everett\nThough Boehner will stay on until the House can settle on a replacement, few in the Capitol believe a speaker with a foot out the door can move the big, bipartisan budget deal that leaders in both parties want. Such a deal would clear the decks through the presidential election. A transportation agreement between the House and the Senate looks less and less likely, and Republican leaders still have no idea how to deal with the debt ceiling, which the Treasury Department says must be raised by Nov. 5.\nMcConnell has a blueprint to handle all of this, according to GOP senators: Negotiate with the White House and congressional Democrats to avoid shutdown threats or flirtations with a catastrophic credit default. But without an idea of who his long-term — or even interim — partner across the Capitol will be, it’s impossible for him and his lieutenants to know what the raucous House will accept when it comes to raising the debt ceiling, deficit reduction and keeping the government running past Dec. 11 — not to mention updating No Child Left Behind and improving the country’s infrastructure.\nAll of those plans remain, for now, in the deep freeze.\n“There’s so many important things that need to be done, it’s tough to plan,” said Sen. James Lankford (R-Okla.), a McConnell confidant who served in the House leadership. “As far as actually getting conference reports on things like that highway deal, education, budget … you’ve got to know who you are dealing with long term on leadership to get anything done.”\nUtah Sen. Orrin Hatch, the most senior Republican in the chamber, said lawmakers \"need to rely more on McConnell. He’s ‘Cool Hand Luke.’”\nAs is his modus operandi, McConnell ignored questions from a reporter on Kevin McCarthy’s decision to drop out of the race. A spokesman said McConnell will not issue a statement on the news.\nDespite the hits to their long-term plans and the increasing pressure on the leader, Republican senators were breathing a sigh of relief on Thursday that their leadership team is so stable when compared with the bedlam that brought down Boehner and his presumed successor, McCarthy (R-Calif.), the House majority leader.\nThough McConnell often faces the same type of conservative outrage that helped topple Boehner, the Kentucky Republican has essentially complete job security. He’s used the Senate’s arcane rules to isolate bomb throwers, he’s got strong support from the chamber’s rank and file, and he doesn't face the same House rules that Boehner's opponents used to threaten the speaker.\nAt a party lunch on Thursday, former House members now in the Senate told their colleagues they are thrilled that they didn’t have to answer questions about this week’s epic display of House dysfunction, attendees said. And Sen. Dean Heller (R-Nev.), who previously served in the House, said he was flooded with texts from former House colleagues congratulating him for being in the Senate — and thus avoiding the chaos consuming the lower chamber.\nBut senators are well aware of the anti-Washington sentiment that is swirling in the Republican base — a phenomenon that’s best encapsulated by the roller-coaster-like GOP presidential race but has also rippled throughout the GOP-led Capitol.\n“The reason the American people are so frustrated with Washington — and with Republican leadership in particular — is that leadership has not been honoring the promise we made to get elected,” said Texas Sen. Ted Cruz, a GOP presidential candidate, about McCarthy’s decision Thursday. “There is no higher obligation an elected representative has than telling the truth, and keeping your word.”\nKentucky Sen. Rand Paul, who like Cruz is running for the GOP presidential nomination, also signaled a need for a change, saying the House needs “somebody young and fresh and new” as speaker. He declined to name names.\nAnd the relative calm in the Senate has its limits.\nWhen Republicans look at the calendar there is no certainty or clarity on their agenda. With Congress set to head home for a 10-day recess, the deadlines come quick when they return: A highway bill needs to be extended Oct. 29, the debt ceiling a few days later on Nov. 5 and then the government needs to be funded by Dec. 11.\nMcConnell, Boehner, and Congress’ top two Democrats Senate Minority Leader Harry Reid (D-Nev.) and House Minority Leader Nancy Pelosi (D-Calif.) — have launched budget talks with the White House in hopes of striking a two-year deal by December. But those remain strictly at the staff level.\nAnd those negotiations were already complicated by Boehner’s lame-duck status. The current vacuum at the top of the House GOP ranks throws even more uncertainty into the mix.\n“Could make it harder, could make it easier,” said New York Sen. Chuck Schumer, the Senate Democratic leader-in-waiting, said of McConnell’s road ahead. “Maybe there will be such disarray that the mainstream conservatives in the House will just forget about the hard-right people. I don’t know. But signs point to trouble.”\nPrivately, Republicans in the Senate fear the next speaker will either be toothless or be singularly focused on getting a mandate to continue leading that McCarthy feared he would never have. Neither scenario is good for the Senate’s hopes of government stability.\nConservatives claim second victory as McCarthy quits race By Daniel Strauss and Katie Glueck\n“The next 15 months are going to be very difficult because whoever becomes speaker either will take it as a [short-] term obligation or be seen as a potentially [short-] term person holding it, or will be totally focused on how they become the long-term guy holding it,” said one GOP senator. “It puts even a greater obligation on Leader McConnell.”\nAnd as long as there is a leadership void in the House, senior Republicans said there’s little chance of coming up with significant progress on any of those areas.\n“I don’t know what to think,” said Senate Majority Whip John Cornyn (R-Texas). “We can’t do it without them, without the House.”\nStill, other Senate Republicans said they hoped Boehner’s longer presence at the Capitol would actually help lawmakers clear the decks on all the must-pass legislation later this year.\n“I guess the upside to all this is that Boehner is still speaker,” said Heller, who counts McCarthy among his close pals (soon after the news broke, Heller said he texted McCarthy telling him that he is still his friend). “If he stays through the end of the year, maybe we can get something done.”\n<div", "external_links": [], "published": "2015-10-09T13:11:00.000+03:00", "crawled": "2015-10-09T13:17:38.763+03:00", "highlightTitle": ""}