{"organizations": [], "uuid": "9beeb62369bcd13fe50456ff473db6f04fa0d10e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://beforeitsnews.com/mediadrop/uploads/2015/42/e1dcbeec3d492ef19e83e2b9ec294e090dc8923f.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/dinner-with-the-republican-party-3066014.html", "country": "US", "title": "Dinner with the Republican Party | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Dinner with the Republican Party | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T05:58:00.000+03:00", "replies_count": 0, "uuid": "9beeb62369bcd13fe50456ff473db6f04fa0d10e"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/dinner-with-the-republican-party-3066014.html", "ord_in_thread": 0, "title": "Dinner with the Republican Party | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nBy Douglas V. Gibbs\nOn Thursday Night I had the opportunity to attend the Riverside Republican Party Liberty Dinner at Casino Morongo in Cabazon, California. I was able to secure a VIP ticket thanks to knowing the folks organizing the event, which means my wife and I got to mingle with some of the heavy hitters early in the evening. The 360 Room was full of candidates, officer holders, and former members of the legislature. We all had drinks in our hands, and the discussions were all about the same thing: 2016.\nGeorge P. Bush, the son of Jeb, nephew of Dubya, and the grandson of George Herbert Walker Bush, was the keynote speaker. Originally, the dinner was scheduled for October 3. It was changed to the 15th. I am figuring it was changed to accommodate George P. Bush, since he drove up from another event in San Diego. Of course he recommended that everyone consider voting for his dad. Less than half of the room was cool with that. The conservative-leaning crowd in Riverside County was not in agreement with who their favorite was, but most of them agreed that they are not in favor of having a third Bush in the White House. Of course, if it came down to Jeb Bush versus Hillary Clinton, or Bernie Sanders, or Joe Biden, or whoever the socialist democrats decide to send to the party, I have a feeling that most of those folks would still be willing to vote for Jeb. . . despite his amnesty leaning immigration ideas, or his support for the education destroying Common Core curriculum.\nI also had the opportunity to have a table with my books for sale. The gentleman manning the table for me laughed because of how many people who knew me.\nHere's the books I had for sale:\n– 25 Myths of the United States Constitution : If the United States Constitution is the Owner's Manual for America, 25 Myths is its Repair Manual. A hostility against the United States Constitution exists in America. Myths have emerged to desconstruct the original intent of the Document. 25 Myths of the United States Constitution exposes these myths by presenting a defense based on the original intent of the Founding Fathers as revealed by the debates during the Constitutional Convention, and the writings of the men of that era. – The Basic Constitution: An Examination of the Principles and Philosophies of the United States Constitution : The Basic Constitution takes a detailed journey through the text of the document that created the American System of Government, revealing that the United States Constitution is the context of conservatism. During the Summer of 1787, a brilliant assembly of American Patriots created the Constitution of the United States. After a tumultuous start, the elder statesman, Benjamin Franklin, reminded the delegates in attendance of the need to seek a firm reliance on divine Providence. The stormy convention birthed dramatic debate, unexpected compromises, and incredible changes of minds. Ideas clashed, and tempers flared. And during it all, James Madison took painstaking notes as the conciliatory Benjamin Franklin added his wisdom here and there, and George Washington often sat silent while James Wilson argued that liberty can only survive if the government of the United States is limited in its scope and power. Despite the heat and the political clashes, what emerged was a masterpiece – the greatest document ever conceived in history, save for the Holy Bible. They created a working government that would be a powerful lion to external issues, yet caged and restrained regarding the internal issues… creating a federal government given the task of promoting, preserving, and protecting the union of States, and the autonomous sovereignty of the individual States. The Basic Constitution is written like a textbook, but in a manner that is comprehensible to every person who journeys through its pages. The book includes a glossary of terms, index, bibliography listing the resources used, The Declaration of Independence, and The Constitution of the United States. – Silenced Screams: Abortion in a Virtuous Society : In 1967 a young woman, alone in a small motel room, clung to life because of the sweet baby boy in her life. In a rocky relationship, a woman turned her back on her husband so that she could abort their child. . . losing him forever. Lying in a clinic, watching an ultrasound of her unborn baby, a young woman decided to change her mind about aborting her baby. An old man, haunted by the roar of a train barreling down the tracks, remembers the horror of genocide. Our rights are natural, God-given; so is it possible for abortion to be a right? George Washington sat in silence as the framers of the United States Constitution debated life, liberty, and the pursuit of happiness – concepts that could only survive if the government of the United States was limited in its scope and power. Douglas V. Gibbs, Constitutionalist, Christian, and Political Advocate, provides arguments in “Silenced Screams” that reveal the truth behind the numbers, the lies behind the veil, and the reality of the culture of death that will make even the most ardent supporter of abortion stop for a moment, and seriously reconsider their position on the issue. The book, “Silenced Screams: Abortion in a Virtuous Society,” is a Pro-Life examination of the issue of abortion, seeking understanding of the age old issue by examining history, the United States Constitution, Christianity, and our sacred humanity. Satan's greatest trick has been to convince an entire civilization that he doesn't exist. His second greatest trick has been to convince civilization that killing their own children is not evil.\n– Political Pistachio Conservative News and Commentary", "external_links": ["http://www.politicalpistachio.com/", "http://politicalpistachio.blogspot.com//feeds/posts/https://www.createspace.com/4997606", "http://politicalpistachio.blogspot.com//feeds/posts/https://www.createspace.com/5266404", "http://politicalpistachio.blogspot.com//feeds/posts/https://www.createspace.com/4600548"], "published": "2015-10-18T05:58:00.000+03:00", "crawled": "2015-10-18T11:56:04.376+03:00", "highlightTitle": ""}