{"organizations": [], "uuid": "d03545760d3eeb2fb7734bf758011722b1b6048c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/tea-party/2015/10/gop-candidates-trump-huckabee-paul-bush-push-for-conservative-house-speaker-2560792.html", "country": "US", "title": "Gop Candidates Trump, Huckabee, Paul, Bush Push For Conservative House Speaker | Tea Party", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Gop Candidates Trump, Huckabee, Paul, Bush Push For Conservative House Speaker | Tea Party", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:53:00.000+03:00", "replies_count": 0, "uuid": "d03545760d3eeb2fb7734bf758011722b1b6048c"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/tea-party/2015/10/gop-candidates-trump-huckabee-paul-bush-push-for-conservative-house-speaker-2560792.html", "ord_in_thread": 0, "title": "Gop Candidates Trump, Huckabee, Paul, Bush Push For Conservative House Speaker | Tea Party", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nGOP presidential candidates Donald Trump, Gov. Mike Huckabee,\nSen. Rand Paul (R-KY), and Gov. Jeb Bush made several statements following Rep. Kevin McCarthy (R-CA) dropping out of the race for Speaker of the House, suggesting a tough, conservative choice for the people. GOP frontrunner Donald Trump posted on Twitter, “Great, Kevin McCarthy drops out of SPEAKER race. We need a really smart and really tough person to take over this very important job!”\nTrump previously had said he didn’t think McCarthy was tough enough to be a good Speaker of the House.\n“I would like to see someone that’s very tough and that can negotiate with the Democrats, and I don’t know that he’s that person,” Trump previously stated . “We need somebody that’s a very, very tough, smart, cunning person. I don’t know that that’s him, and obviously this statement hurt him pretty badly in the eyes of some, unfortunately.”\nHuckabee responded to the news that McCarthy dropped out of the race by suggesting Congress needs to listen to the conservatives that elected them. Huckabee said:\nThe race for Speaker of the House is not about Kevin McCarthy, it’s about burning the corrupt Washington political machine to the ground and rebuilding our country so America can win again. We all fought hard to elect conservatives to Congress, but the campaign promises made weren’t kept – because they’re beholden to Wall Street, K-Street and the donor class. It’s time to elect a speaker who will lead Congress and do what we conservatives sent them there to accomplish.\nSen. Rand Paul (R-KY) joined Fox News after the news broke about McCarthy dropping out, saying, “Conservatives across the country are unhappy with Congress” and about the Republican-controlled House and Senate not doing enough to push back against President Obama.\nEven during a campaign event, former Florida Gov. Jeb Bush took time to weigh in on the Speaker race, speaking highly of\nRep. Daniel Webster (R-FL) – the candidate for Speaker chosen by the House Freedom Caucus – a group of 30 to 40 conservative members. Dan Webster is one of my closest friends inside the political process. He is a principle, centered guy. You will never meet someone with the integrity of Dan Webster. He served as Speaker of the House – the Florida House – and was in the state senate. I worked with him, he’s an incredible guy.\nBush suggested that others might now step forward, but that he hopes Washington focuses on solving problems for the people.\nSource; by ALEX SWOYER@Breitbart.com\nThe post GOP CANDIDATES TRUMP, HUCKABEE, PAUL, BUSH PUSH FOR CONSERVATIVE HOUSE SPEAKER appeared first on Tea Party Tribune .", "external_links": ["http://www.youtube.com/watch?v=uouGg8stPX4", "http://www.breitbart.com/big-government/2015/10/08/gop-candidates-trump-huckabee-paul-bush-push-conservative-house-speaker/", "http://www.teapartytribune.com/2015/10/09/gop-candidates-trump-huckabee-paul-bush-push-for-conservative-house-speaker/", "http://www.breitbart.com/big-government/2015/10/02/donald-trump-kevin-mccarthy-need-someone-tougher-speaker/"], "published": "2015-10-09T23:53:00.000+03:00", "crawled": "2015-10-10T02:05:55.109+03:00", "highlightTitle": ""}