{"organizations": [], "uuid": "5912afb302e1d6b34f277b9b43582de57e3a38a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wnd.com", "main_image": "http://www.wnd.com/files/2015/03/netanyahu.jpg", "site_section": "http://www.wnd.com/category/front-page/politics/feed/#", "section_title": "WND » Politics", "url": "http://www.wnd.com/2015/10/new-wave-of-terror-continues-in-holy-land/", "country": "US", "title": "New 'wave of terror' continues in Holy Land", "performance_score": 0, "site": "wnd.com", "participants_count": 1, "title_full": "New 'wave of terror' continues in Holy Land", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:24:00.000+03:00", "replies_count": 0, "uuid": "5912afb302e1d6b34f277b9b43582de57e3a38a3"}, "author": "Aaron Klein", "url": "http://www.wnd.com/2015/10/new-wave-of-terror-continues-in-holy-land/", "ord_in_thread": 0, "title": "New 'wave of terror' continues in Holy Land", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Text bigger Israeli Prime Minister Benjamin Netanyahu \nTEL AVIV – The so-called Palestinian wave of terror continued Wednesday, with a terrorist stabbing a woman approximately 60 years of age near Jerusalem’s Central Bus Station as she was boarding a bus from an adjacent street. \nThe Israeli bus driver made sure the woman, who was moderately to severely injured, could board the bus before he quickly shut the doors to lock out the terrorist. \nThe assailant, identified as Ahmed Shaaban, a 23-year-old resident of the Ras el-Amud neighborhood in Jerusalem, was shot and neutralized by a special forces police officer who was near the scene and noticed the knife-wielding young man. \nShaaban was released from prison earlier this month after serving a three-year sentence for terrorism-related activities. \nIn a report this week, WND compiled a massive list of attacks on Israelis on just five separate days to illustrate the magnitude of the new wave. \nEarlier Wednesday, there was a second terrorist incident in Jerusalem when a Palestinian sought to stab people near the Damascus Gate, a main entrance to Jerusalem’s Old City. A Border Police unit approached the youth, who looked suspicious, and he drew out his knife to attack the police officers, who in turn drew their weapons and shot the suspect dead. \nThe attempted stabber was later identified as Bassel Sader, 19, a resident of Hebron in the West Bank. \nAnother attack was thwarted by Border Police officers today who reportedly detained a 24-year-old Palestinian man carrying a baby while hiding a knife under the seat of a minivan he was traveling in from an eastern Jerusalem neighborhood to a central part of the city. \nIn response to the continued Palestinian terrorism, Prime Minister Benjamin Netanyahu’s security cabinet ordered stepped-up security measures yesterday, including a major deployment of Israel Defense Forces soldiers in Israeli city centers. \nThe cabinet also passed a measure that has resulted in the erection of new checkpoints throughout the West Bank and surrounding Arab neighborhoods in eastern Jerusalem. \nAt a special Knesset session, Netanyahu vowed to use “all means” necessary to thwart Palestinian terrorism, and he promised “to bring quiet back to the citizens of Israel.” \n“Israel will settle its accounts with the murderers, with those who try murder and with those all those who assist them. Not only will we revoke rights from them; we will exact the full price,” he told the Knesset. \nNetanyahu called on PA President Mahmoud Abbas to stop what the Israeli leader referred to as incitement, pointing specifically to the case of a 13-year-old Palestinian boy who attacked and gravely wounded an Israeli boy and then ran toward a candy store wielding a bloody knife when the Palestinian boy was shot by nearby police officers. \nAbbas today claimed the terrorist boy was “executed” by Israel. Palestinian media broadcast footage of the boy in a pool of blood and claimed the boy was an innocent “martyr” who was killed for no reason by Israeli forces. \nIt turns out, however, the 13-year-old boy, who was taken down after stabbing another youth and while attempting to carry out a second attack, was not “executed” or killed at all. He is alive and is being treated in an Israeli hospital. \nNetanyahu’s office released a statement slamming Abbas’s “incitement and lies.” \n“The teenager he’s referring to is alive and hospitalized at Hadassah after he stabbed an Israeli child who was riding his bicycle,” the statement said. “While Israel is maintaining the status quo on the Temple Mount, Abu Mazen [Abbas], with his inciting remarks, is cynically using religion and thus causing acts of terror.” Text smaller", "external_links": [], "published": "2015-10-15T03:24:00.000+03:00", "crawled": "2015-10-15T04:43:47.988+03:00", "highlightTitle": ""}