{"organizations": [], "uuid": "1aad8c0d052cbeb5d0529e922ce31c55a56498fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8945278_G.jpg", "site_section": "http://www.cbs8.com/category/154657/politics", "section_title": "Politics - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30183971/us-chile-to-announce-new-marine-sanctuaries-at-conference", "country": "US", "title": "US, Chile to announce new marine sanctuaries at conference", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "US, Chile to announce new marine sanctuaries at conference - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "1aad8c0d052cbeb5d0529e922ce31c55a56498fd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30183971/us-chile-to-announce-new-marine-sanctuaries-at-conference", "ord_in_thread": 0, "title": "US, Chile to announce new marine sanctuaries at conference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By BRADLEY KLAPPER\nAssociated Press VALPARAISO, Chile (AP) - President Barack Obama will declare new marine sanctuaries in the tidal waters of Maryland and Wisconsin's Lake Michigan Monday, while Chile is expected to block off a more than 200,000 square miles of sea from commercial fishing and oil and gas exploration in an area of the Pacific Ocean near the world-famous Easter Island.\nThe announcements were to be made when top officials, including U.S. Secretary of State John Kerry, attend an international conference on marine protection in the Chilean port city of Valparaiso on Monday. There, several nations also will outline plans for tracing seafood imports to combat overfishing and stem increased pollution in the ocean.\nThe new protected waters in the United States are the first to be designated as such in 15 years, the White House said in a statement.\nThe 875-square mile area of Lake Michigan extends from Port Washington to Two Rivers, containing a collection of 39 known shipwrecks. Fifteen are listed on the National Register of Historic Places.\nThe Mallows Bay-Potomac River in Maryland encompasses a 14-square mile area of the tidal Potomac River next to Charles County. Nearly 200 vessels, some dating back to the Revolutionary War, are found in the largely undeveloped area that provides habitat for endangered species of wildlife and fish.\nThe actions are the latest in a series of environmental steps by Obama, who last year set aside some 400,000 square miles of the central Pacific Ocean from commercial fishing, deep sea mining and other forms of resource extraction. The Pacific Remote Islands Marine National Monument is now the largest marine reserve in the world.\nChile was set to make a similarly ambitious declaration, cordoning off a large area of the South Pacific Ocean.\nA coalition of local politicians and environmental groups has urged Chilean authorities to designate Easter Island, celebrated for its hundreds of human statues carved out of volcanic rock, and the surrounding waters as a protected marine reserve. President Michelle Bachelet vowed last week that such action would come \"soon,\" and campaigners said the announcement Monday would create the third-largest protected zone worldwide.\nBritain, Gabon, Kiribati, New Zealand and Palau have taken steps as well to protect sections of the sea in recent months.\nThe \"Our Ocean\" conference also seeks to combat marine pollution resulting from discarded plastics and increasing levels of ocean acidification, which damages coral reefs and shellfish populations. Such concerns are shared by the U.S., which imports 90 percent of the fish it consumes, and Chile, whose coastline of almost 2,500 miles is vital to the economy.\nTo combat overfishing, the Obama administration said it would launch a global initiative it dubbed \"Sea Scout\" to identify unregulated and unreported activity, and help prosecute illegal fishing organizations. The National Oceanic and Atmospheric Administration is expanding a program for detecting boats that use lights to attract fishery catch at night and will implement it in Indonesia, the Philippines and three other countries next year.\nThe so-called \"traceability\" initiative is supposed to start for the most commonly exported fish species like tuna, cod, shrimp and crabmeat in September 2016. It would apply to all fish a year later and is designed to provide a full accounting of where exporters are getting their catch and whether they are operating in a sustainable manner. Anyone who wants to export fish to the United States would have to adhere to the conditions. The program still needs final approval from the Senate and several additional countries before entering into force.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T09:34:39.899+03:00", "highlightTitle": ""}