{"organizations": [], "uuid": "ead0580618d287536a93b642e772081a2b29e7f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.11012901.1445894114!/httpImage/image.jpg_gen/derivatives/display_600/image.jpg", "site_section": "http://www.newsday.com/long-island/politics", "section_title": "Political News &amp; Opinion from Newsday.com | Newsday", "url": "http://www.newsday.com/long-island/nassau/two-year-old-pay-raises-for-north-hempstead-officials-return-as-a-campaign-issue-1.11012829", "country": "US", "title": "Two year old pay raises for North Hempstead officials return as a campaign issue", "performance_score": 0, "site": "newsday.com", "participants_count": 1, "title_full": "Two year old pay raises for North Hempstead officials return as a campaign issue | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-10-27T00:15:00.000+02:00", "replies_count": 0, "uuid": "ead0580618d287536a93b642e772081a2b29e7f5"}, "author": "SCOTT EIDLER", "url": "http://www.newsday.com/long-island/nassau/two-year-old-pay-raises-for-north-hempstead-officials-return-as-a-campaign-issue-1.11012829", "ord_in_thread": 0, "title": "Two year old pay raises for North Hempstead officials return as a campaign issue", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pay raises given to elected officials in North Hempstead, approved in 2013 weeks after the budget had passed and while a lame-duck interim supervisor finished out his term, has emerged as a campaign issue this fall.\nThe town board's Democratic majority in December 2013 approved $9,000 in annual raises for councilmembers bringing their salary to $49,000. The 4-2 vote, split along party lines, drew heated conversation during public hearings.\nMost Popular Cops: Pedestrian killed on Southern State Parkway Forecast: Temps to hit high-50s on LI Records: At least 295 shot in village since '07 Cops: Pair found with drugs, gun at traffic stop LIRR: On or close to schedule with some delays The plan was unveiled in November 2013 -- less than two weeks after Judi Bosworth was elected the new supervisor and several councilmembers won re-election. The vote took place a month before Bosworth took office, and the board's two Republicans argued that the pay raises should be considered after Bosworth, then a Nassau County legislator, was to take office on Jan. 1.\nThe original plan, unveiled in November of 2013, was to increase the town board members' salaries $15,000 to $55,000, but the board, at the December meeting, voted to drop the hike to $9,000.\nThe town supervisor, receiver of taxes, and three council seats are up for election next month.\nNassau Raises for N. Hempstead officials \"I can tell you unequivocally that any time my colleagues on the board want to roll back that pay raise, I'm 100 percent with them,\" Dina De Giorgio, a Republican councilwoman, said during a recent debate moderated by the League of Women Voters of Port Washington-Manhasset.\nHer opponent, Democrat Emily Beys of Sands Point, said \"I don't even know what the pay is, so I can't even say if I would take it or not,\" Beys said. \"This is something I see as a service to the community.\"\nIn 2013, the Receiver of Taxes post saw a 27.8 percent raise, bringing the salary to $115,000 a year, and the town clerk's salary was brought to $105,000, an increase of 25 percent. The clerk also receives a $10,000 stipend for serving as the town's registrar of vital statistics, which was not changed.\nBosworth, as supervisor-elect, sent a letter that December to acting supervisor John Riordan, a Democrat who succeeded Jon Kaiman after his September resignation. Bosworth urged him to cancel the proposed $5,000 increase for the town supervisor salary, which was not included among the raises.\nBosworth said Monday through a spokeswoman: \"The Supervisor has stated that this budget contains no raises for elected officials and there will be no raises proposed in 2015 or 2016.\"\nLong Island 2013 North Hempstead payrolls ", "external_links": [], "published": "2015-10-27T00:15:00.000+02:00", "crawled": "2015-10-26T23:21:37.175+02:00", "highlightTitle": ""}