{"organizations": [], "uuid": "69cb00e1867e1903b9ffe8e9791423843b24c6c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2014/12/02/102233137-1762245.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000113/device/rss/rss.html", "section_title": "Politics", "url": "http://www.cnbc.com/2015/10/05/when-did-republicans-become-obsessed-with-reagan.html", "country": "US", "title": "When did GOP become obsessed with Reagan?", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "When did GOP become obsessed with Reagan?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:09:00.000+03:00", "replies_count": 0, "uuid": "69cb00e1867e1903b9ffe8e9791423843b24c6c5"}, "author": "", "url": "http://www.cnbc.com/2015/10/05/when-did-republicans-become-obsessed-with-reagan.html", "ord_in_thread": 0, "title": "When did GOP become obsessed with Reagan?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Total Votes: \nNot a Scientific Survey. Results may not total 100% due to rounding. \n\"He will never again be the same Ronald Reagan he was before he blew it,\" said conservative Rep. Newt Gingrich in 1987 after the Iran-Contra scandal, which revealed that the administration was exchanging arms for hostages in Iran and using the proceeds to fund Nicaraguan rebels, all prohibited by Congress. \"He is not going to regain our trust and our faith easily.\" \nBut Gingrich, it seems, was wrong. He would later talk up his Reagan connections with the best of them. While surveys of presidential scholars and historians by Siena College from 1982 to 2010 consistently characterized Reagan as a middling president, nearly 20 percent of Americans now think Reagan was the nation's greatest president — beating out Abraham Lincoln, Clinton, JFK and George Washington. Reagan was mythologized while he was still alive. \nIt's not unusual for presidents to be more popular after they leave, but Reagan's jump is still impressive. Out of nine presidents compared by Gallup , Reagan's average approval jumped the most after leaving office — 11 percentage points — aside from Kennedy (13 after being killed in office) and Ford (13). Looking at only the most recent polls, Reagan has now gained 21 points — far more than any other president measured. \nWhy do Americans remember Reagan so much more kindly than history suggests they should? One reason may be that Reagan was diagnosed with Alzheimer's disease after leaving office, so politicians and journalists who had once been critical of his legacy were less likely to point out his flaws. \n\"Reagan's unprecedented condition created an environment when sharp criticism of things that went wrong in the White House during the 1980s was now rendered, in the new terminology, politically incorrect,\" political reporter Will Bunch wrote in his book about the mythologized Reagan. The new Reagans \nReagan's disappearance from public life nearly six years after he left office also made it easy for conservatives of all stripes to claim his mantle. As late-night host Stephen Colbert recently pointed out to candidate Ted Cruz , Reagan's record as president deviates significantly from both his own rhetoric and the policy positions attributed to him by modern candidates. \nThat's why today you hear about the Reagan who instituted a massive tax cut in 1981, not the Reagan who, when revenue from supply-side economic theories failed to materialize, reversed course to sign the largest peacetime tax increase in history in 1982, and then to raise taxes again in 1983 and 1984. \nCandidates will talk about the Reagan who cut government regulation, but not the one who increased the size of the federal government and the national debt. We hear about the Reagan who demanded that Mikhail Gorbachev \"tear down this wall\" and called Soviet Russia an \"evil empire,\" but not the Reagan who later met diplomatically with Soviet leaders to form the foundation of nuclear disarmament. \nPerhaps the main reason that Reagan is mentioned so frequently may simply be because, as Bill Whalen of the Hoover Institution wrote before September's debate, while Democrats had Clinton and Barack Obama to fill the void after Kennedy, Republicans have had no recent candidates who can match Reagan's charm. \nBut pretending to be an imaginary version of Reagan does the candidates no services — no one really believes that Romney or Donald Trump are Reagan reincarnated, and many voters are too young to be nostalgic about Reagan anyway. According to data shared with CNBC by consumer data company Resonate , 7 percent of people who said that they vote Republican weren't even alive when Reagan left office, and more than a third of Republican voters weren't of voting age. \nWhalen's advice to the debating candidates: \"Like Reagan and his political journey from Trumanite to Thatcherite, dare to show evolved thought. Be bold enough to take the GOP in directions beyond its present conservative straightjacket.\" <p>The reality of Trump&#039;s presidential politics</p> <p>CNBC&#039;s John Harwood sits down with Republican candidate Donald Trump to talks about the core issues of his campaign.</p>", "external_links": [], "published": "2015-10-05T14:09:00.000+03:00", "crawled": "2015-10-05T16:07:21.154+03:00", "highlightTitle": ""}