{"organizations": [], "uuid": "0f6e58d7077b93ed54553dc49507131e9faee1dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30333134/world-polio-day-fewer-children-than-ever-with-polio", "country": "US", "title": "World Polio Day: Fewer children than ever with polio", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "World Polio Day: Fewer children than ever with polio - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "0f6e58d7077b93ed54553dc49507131e9faee1dd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30333134/world-polio-day-fewer-children-than-ever-with-polio", "ord_in_thread": 0, "title": "World Polio Day: Fewer children than ever with polio", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " UNICEF Canada\nNEW YORK and GENEVA , Oct. 23, 2015 /CNW/ - Never before in the history of polio have so few children in so few countries contracted the crippling virus – but we cannot rest until the number of cases is zero, UNICEF said on the eve of World Polio Day.\n\"Progress to end polio is real and dramatic, with now just two countries in the world where the wild poliovirus has never been interrupted: Afghanistan and Pakistan ,\" said Peter Crowley , head of the Polio Unit at UNICEF. \"But – and it's a big but – until all children everywhere are consistently and routinely immunized against polio, the threat remains. We cannot let down our guard; we have to keep going until there is not a single child anywhere who remains unvaccinated.\"\nJust three years ago, Nigeria was the reservoir of more than half of all polio cases in the world. This year, for the first time in history, Nigeria has succeeded in interrupting transmission of wild poliovirus, and last month it was removed from the list of polio endemic countries. Nigeria's remarkable achievement has brought the country and the African region closer than ever to being certified polio-free. In India , where thousands of children once suffered from polio-induced paralysis each year, there have been no cases in four years. Globally there have been just 51 cases of wild polio virus since the beginning of 2015, compared with 242 wild polio cases for 2014.\nThese successes are a result of political will and government leadership in affected countries; the strong mobilization and engagement of communities; the courage and commitment of front-line workers; and the combined, coordinated efforts of the partners of the Global Polio Eradication Initiative – the Centers for Disease Control and Prevention, the World Health Organization, Rotary International, the Bill and Melinda Gates Foundation and UNICEF.\nAs part of its contribution to this Initiative, UNICEF delivered 1.7 billion doses of vaccine in 2014 and supported the training of tens of thousands of front-line workers in communities from Karachi in Pakistan to Kano state in Nigeria , helping to build trust in the vaccine among parents and communities. Other success factors have been the integration of additional life-saving interventions for children such as routine immunization, nutrition, handwashing with soap, and breastfeeding, into polio campaigns, particularly in the most under-served and high-risk areas.\nDespite this progress, recent vaccine-derived poliovirus outbreaks in countries like Lao-PDR, Ukraine , Guinea and Madagascar have underscored the risks that many countries continue to face due to low routine immunization coverage. These outbreaks serve as a reminder of the vital need for intensified efforts to strengthen routine immunization systems and address disparities in children's access to basic health services. In Ukraine , for example, fewer than 14 per cent of children are immunized against polio.\n\"We aim to bring a global halt to polio transmission by this time next year, but the only way to do this is for countries with low vaccination dates to re-double their efforts to reach every child, wherever they are and no matter how hard this may be,\" said Peter Crowley .\nAbout UNICEF\nUNICEF has saved more children's lives than any other humanitarian organization. We work tirelessly to help children and their families, doing whatever it takes to ensure children survive. We provide children with healthcare and immunization, clean water, nutrition and food security, education, emergency relief and more.\nUNICEF is supported entirely by voluntary donations and helps children regardless of race, religion or politics. As part of the UN, we are active in over 190 countries - more than any other organization. Our determination and our reach are unparalleled. Because nowhere is too far to go to help a child survive. For more information about UNICEF, please visit www.unicef.ca .\n ", "external_links": ["http://www.unicef.ca/", "http://rt.prnewswire.com/rt.gif?NewsItemId=C5806&Transmission_Id=201510230700CANADANWWEB______C5806&DateId=20151023", "http://www.xmlnews.org/ns/"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T15:07:06.022+03:00", "highlightTitle": ""}