{"organizations": [], "uuid": "fc5afc482f8a40044e8ce638d6b00cacc8ce4325", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/brightcove01/width620/img/6/275353188001/201510/1855/275353188001_4547020044001_IMG-0227.jpg?pubId=275353188001", "site_section": "http://www.cleveland.com/open/", "section_title": "Ohio Politics &amp; Election News | cleveland.com ", "url": "http://www.cleveland.com/metro/index.ssf/2015/10/million_man_march_20th_anniver.html", "country": "US", "title": "Million Man March 20th anniversary inspires bus trip from Cleveland (live updates)", "performance_score": 0, "site": "cleveland.com", "participants_count": 5, "title_full": "Million Man March 20th anniversary inspires bus trip from Cleveland (live updates) | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:03:00.000+03:00", "replies_count": 4, "uuid": "90952d33371cd5509ac6734661af941464fbadcb"}, "author": "Branson Wright, The Plain Dealer", "url": "http://www.cleveland.com/metro/index.ssf/2015/10/million_man_march_20th_anniver.html#post-0", "ord_in_thread": 0, "title": "Million Man March 20th anniversary inspires bus trip from Cleveland (live updates)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Ohio - Robert Harris was not sure what all of the fuss was about with the clusters of men inside the television on Oct. 16, 1995.\nHe vaguely remembers the speeches and the interviews, and his grandmother's attempts to explain the Million Man March to a 5-year-old.\n\"I didn't know what was really going on, but I did know it was a big deal, because it was a big deal to everyone [in my family] around me,\" said Harris, now 25. \"I figured it was something important.\"\nMany issues from the past remain important enough today for a 20th anniversary gathering of the Million Man March on Saturday in Washington, D.C. A community organization, the Cleveland Renaissance Movement , chartered a bus to Washington that left Cleveland on Friday afternoon.\n#CleMM15 Tweets The bus trip gives Harris, who was not able to grasp the impact of the events that took place 20 years ago, a chance for the experience.\n\"I'm going now because how necessary it was then, it remains necessary now,\" Harris said. \"A lot of the injustices and issues that were addressed then, are not completely solved now.\"\nAccording to some estimates , a million black men gathered in and near the National Mall 20 years ago in an event generated by Nation of Islam leader Louis Farrakhan.\nIt was a day of Atonement in '95. Thousands of black men promised to work toward a better future for themselves, families and communities. Despite critics and predictions of doom, it was a peaceful and uplifting assembly.\n\"I didn't know what to expect 20 years ago,\" said Anthony Jones, owner of DigitalJetStream. \"There were so many brothers together with no issues at all; no fights, no arguments, no problems. We were there for one cause that banded us all together. Farrakhan brought home that we're all in this together, regardless of religion or economic status.\"\n\"Justice or Else\" is Saturday's theme, which organizers say is to bring attention for justice when it comes to the overwhelming number of black men shot by police.\nIn a recent interview, Minister Farrakhan said Saturday's event is not a march, \"rather a gathering of those who are serious about placing a demand on the United States government and putting power behind that demand to force the government to give us what we deserve.\"\nFarrakhan, one of the scheduled speakers at the event, will also address black-on-black crime and call for greater responsibility in black communities to address this issue, and request federal and state government intervention in police investigations.\nOrganizers don't expect the attendance generated in '95 and Saturday's event will not just cover issues within the black community, but also Native Americans, Latinos, women, and soldiers.\nJames Babb, 32, missed the march two decades ago. He was ready for the bus ride on Friday afternoon. He hopes to garner inspiration from this trip to help deal with the current gun violence in Cleveland.\n\"My father wasn't around to take me 20 years ago, and my mom was a single mother,\" said Babb, of South Euclid. \"I have to go. This is a great opportunity. I hope to gain [some knowledge] to take back home and to help inspire young men to do something better.\"\nJones, 52, will return to D.C. on Saturday with an expectation he did not have when he made this same trip in the past.\n\"Now I look to recapture that same feeling I had then,\" Jones said. \"I hope this trip gives me another 20 years of possibility thinking -- for us to get together and do what we need to do to improve our communities and lives.\"", "external_links": ["https://twitter.com/hashtag/CleMM15", "https://instagram.com/cleveland_renaissance_movement/?hl=en", "http://www.heraldsun.com/news/million-man-march-to-be-revisited-saturday-in-d-c/article_d8a00076-6e1a-11e5-9362-87b6213595b2.html", "https://www.justiceorelse.com/vision", "http://www.youtube.com/watch?v=U8UB-shmJfQ", "http://www.usnews.com/news/us/articles/2015/10/09/ap-was-there-20-years-ago-million-man-march-drew-many-to-dc"], "published": "2015-10-10T03:03:00.000+03:00", "crawled": "2015-10-10T03:44:00.781+03:00", "highlightTitle": ""}