{"organizations": [], "uuid": "87da2ff1ef9313da8d5787b341bc1289b5458966", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30349685/the-international-papillomavirus-society-endorses-human-papillomavirus-vaccines", "country": "US", "title": "The International Papillomavirus Society Endorses Human Papillomavirus Vaccines", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The International Papillomavirus Society Endorses Human Papillomavirus Vaccines - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "87da2ff1ef9313da8d5787b341bc1289b5458966"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30349685/the-international-papillomavirus-society-endorses-human-papillomavirus-vaccines", "ord_in_thread": 0, "title": "The International Papillomavirus Society Endorses Human Papillomavirus Vaccines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The International Papillomavirus Society (IPVS)\nMost cervical cancers worldwide could be prevented through vaccination\nGENEVA , October 26, 2015 /PRNewswire/ --\nApproximately 250,000 women die each year of cervical cancers caused by human papillomavirus (HPV) despite the currently available preventative vaccines. These vaccines have been administered to millions of girls and women and have been shown to be efficacious and safe.\nThousands of men and women also die each year of other HPV-associated cancers, including cancers of the anus, vulva, vagina, penis and oropharynx. Yet there are now HPV vaccines currently approved for the prevention of cancers of the cervix, anus, vulva and vagina and their precursor lesions.\nTo date, no deaths have been directly attributed to HPV vaccination.\nBased on our review of the scientific data, IPVS strongly endorses HPV vaccination of all girls and women as specified by the relevant national regulatory authorities.\nIPVS also strongly endorses HPV vaccination of boys and men wherever relevant national regulatory authorities approve it.\n\" HPV vaccines have been in the market for almost 10 years . T he impact in the vaccinated cohorts is expected to be hi gh and much of the HPV related disease will be reduced. T he IPVS encourages Public Health and other stakeholders to promote HPV vaccination as a paradigm in cancer prevention. \"\nSilvia de Sanjosé, IPVS President and Head of the Cancer Epidemiology Research Programme, Institut Català d'Oncologia, Spain\n\" Every day more than 2 , 000 people worldwide are diagnosed with HPV caused cancers, the available HPV vaccines can prevent most of these .\"\nMargaret Stanley , IPVS Vice-President and Honorary Fellow of the Royal College of Obstetricians, UK\n\" Every day thousand s of people in the world are diagnosed or die of an HPV-related cancer: yet we have safe, effective preventative tools in the form of HPV vaccines. IPVS encourages all governments to endorse and use these tools to prevent infection and disease in their young girls and boys. \"\nSuzanne Garland , IPVS Board Member and Director of Microbiological Research and Head of Clinical Microbiology and Infectious Diseases, Royal Women's Hospital, Australia\nThe International Papillomavirus Society (IPVS) is the world's leading professional society devoted to the study of papillomaviruses and the diseases that they cause. IPVS is comprised of basic scientists, clinical scientists, clinicians, public health experts, epidemiologists, and community advocates.\nFor more information, v isit http://www.ipvsoc.org or contact us at ipvsoffice@kenes.com +41-22-906-9160\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510263835&Transmission_Id=201510261100PR_NEWS_USPR_____enUK201510263835&DateId=20151026", "http://www.xmlnews.org/ns/"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T18:54:31.960+02:00", "highlightTitle": ""}