{"organizations": ["Dover House", "Scotland Office", "Scots"], "uuid": "29bf6a9fa9548d7952c4aaa68851f81863f1c980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4360004/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://www.heraldscotland.com/politics/political_news/13890829.UK_Government_department_rebranded_amid_fears_Scots_don___t_understand_what_it_does/?ref=rss", "country": "", "title": "UK Government department rebranded amid fears Scots don’t understand what it does", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "UK Government department rebranded amid fears Scots don’t understand what it does", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T02:10:00.000+03:00", "replies_count": 0, "uuid": "29bf6a9fa9548d7952c4aaa68851f81863f1c980"}, "author": "", "url": "http://www.heraldscotland.com/politics/political_news/13890829.UK_Government_department_rebranded_amid_fears_Scots_don___t_understand_what_it_does/?ref=rss", "ord_in_thread": 0, "title": "UK Government department rebranded amid fears Scots don’t understand what it does", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UK Government department rebranded amid fears Scots don’t understand what it does Dover House, Scotland Office HQ 2 comments \nThe Scotland Office has undergone a mini-rebrand amid fears too many Scots don’t know what it does. \nIt is now known as the “UK Government for Scotland” on its Facebook page and part of its Twitter handle. \nThe main Twitter name is still the Scotland Office and sources insisted there were no plans to drop the name. \nLoading article content \n“It is still the Scotland Office, we are not going to change that at all,” one said. \n“But it was felt that there was too little understanding of what areas were devolved and what areas were reserved, of what it is that the UK Government does and what it is that the Scottish Government does.\" \nHe added: “We are keen to emphasise that Scotland has two governments.” \nThe lack of awareness was highlighted as part of the cross-party Smith negotiations, set up in the wake of last year’s independence referendum. \nLast month research also showed that most Scottish taxpayers are unaware of the new Scottish Rate of Income Tax (SRIT), due to be launched within months. \nScottish ministers will have the power to set the rate by next April. \nBut a focus group set up by HM Revenue & Customs (HMRC) found just one person in 85 had heard of the changes. \nScotland Office sources said that ministers were keen to emphasise the Whitehall department’s role in Scotland. \nThey added that no further reforms were planned and that the changes had been made in-house and not through discussions with a branding agency. \nUK Government department's have undergone similar rebranding exercises before. Share article \nIn 2011 the Department for International Development (DfID) renamed its operations in the developing world \"UKAid\" to make clear where the contributions came from. \nThe Conservative Government has just one MP in Scotland, Scottish Secretary David Mundell. Promoted Stories", "external_links": [], "published": "2015-10-23T02:10:00.000+03:00", "crawled": "2015-10-23T04:07:17.034+03:00", "highlightTitle": ""}