{"organizations": [], "uuid": "3e5bff41ca95794f5edbf8056e488f4beaf6afb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "https://d1u4oo4rb13yy8.cloudfront.net/b11730f8-1cd8-4d69-99f6-cadc444b340e.jpg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/764559/indian-super-league-northeast-ride-velezs-goal-against-kolkata-to-clinch-second-consecutive-win", "country": "SG", "title": "Indian Super League: NorthEast ride Velez's goal against Kolkata to clinch second consecutive win", "performance_score": 0, "site": "scroll.in", "participants_count": 1, "title_full": "Indian Super League: NorthEast ride Velez's goal against Kolkata to clinch second consecutive win", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T18:00:00.000+03:00", "replies_count": 0, "uuid": "3e5bff41ca95794f5edbf8056e488f4beaf6afb2"}, "author": "Bedbyas Datta", "url": "http://Scroll.in/article/764559/indian-super-league-northeast-ride-velezs-goal-against-kolkata-to-clinch-second-consecutive-win", "ord_in_thread": 0, "title": "Indian Super League: NorthEast ride Velez's goal against Kolkata to clinch second consecutive win", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ISL 2015 Indian Super League: NorthEast ride Velez's goal against Kolkata to clinch second consecutive win For several minutes during the second half, two NorthEast players waited on the sidelines, waiting exasperatedly for the fourth official to fix the substitution board. Bedbyas Datta · Today · 03:00 pm After an indifferent start, the Highlanders won their second game on the trot against the defending champions Atletico de Kolkata, amidst comical scenes at the Indira Gandhi Athletic Stadium in Guwahati.Football cannot avoid confusion. The most common instances of confusion on the pitch are in the form of goal line scrambles from free kicks and corners. Players from each side do their best to impede each other, grabbing hold of each other often. There are very few occasions when a player can get space amidst this plethora of people to score. Often such a finish like this is scruffy, an example being Olivier Giroud's tumbling elbow-glancing-leg goal against Bayern Munich recently.Confusion need not be relegated to the penalty box though. It need not even be restricted within the margins of the pitch either. Around the 60th minute of the match, two NorthEast players waited on the sidelines hoping to come on as substitutes. In the next seven minutes, numerous corners and goal kicks and throw ins took place giving them multiple opportunities to take the field. But they could not. Malfunctioning substitute board The primary reason for the delay of the substitutions was the malfunctioning of the number board that the fourth official uses. Instead of the jersey numbers of the players involved in the substitutions being displayed, viewers were treated to the hilarious sight of the fourth official struggling to adjust the board as four zeroes flashed on it. For the next couple of minutes, viewer attention was directed not just towards the happenings on field but also towards the touchline waiting to see when the substitutions would happen. Just when the number board seemed to finally work, a NorthEast player who was not supposed to be replaced , got injured. Thus there was a further delay as the home team decided to change personnel again.The goal itself took place late in the match. Both teams had their opportunities. Iain Hume the English forward fought a good fight for the Kolkata strike force but he was often on his own. Amrinder Singh, the Atletico goalkeeper made numerous impressive saves but unfortunately failed to hold onto one more shot at him and ended up fisting the ball into his net. Nicolas Velez, one of the substitutes, was the scorer of the goal. For Velez, who did not shirk from showing his irritation at his increasingly belated introduction on the field, it turned out to be a good night after all, as well as for his team.The substitution incident should not be reduced to a matter of the sidelines though. Indian football might look on at the Indian Super League as a bearer of much needed sponsorship money and a harbinger of centres for discovering and polishing new indigenous talent. There is however a basic lacuna in footballing infrastructure in the country that is still neglected. State of the playing surfaces The most visible form of that shortcoming is in the state of stadiums that act as venues for the ISL.The grounds often look desiccated and do not enable for a fast flowing game to take place. There is a correlation between the state of the pitch and the state of play and thus people see players, Indian or foreign, young or old, repeatedly shoot at goal from distance in vain. Commentators often mention frustration as a factor behind such attempts. Players probably lack the ability to think too much after efforts to run in a pitch where the grass is decidedly not green. Then comes the case of number boards which do not work because of administrative indifference with regard to such small matters. These minor affairs often end up causing major embarrassment especially when India attempts to lure foreign talent here.Indian football might very well get enough money to attract the best foreign players one day. But one wonders how worthwhile that financial power will be if the basics are not sorted. Those basics for good or bad include functional number boards and decent pitches.  ", "external_links": [], "published": "2015-10-24T18:00:00.000+03:00", "crawled": "2015-10-24T12:49:23.131+03:00", "highlightTitle": ""}