{"organizations": [], "uuid": "c3e3df6fbfddaf56657b2f3857b5fba83b48bce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jpupdates.com", "main_image": "", "site_section": "http://jpupdates.com/feed/", "section_title": "JP Updates | Breaking News NYC, Jewish Political News & Updates", "url": "http://jpupdates.com/2015/10/16/obama-oversteps-boundaries-into-fbi-investigation-of-clintons-emails/", "country": "US", "title": "Obama Oversteps Boundaries into FBI Investigation Over Clinton Emails", "performance_score": 0, "site": "jpupdates.com", "participants_count": 1, "title_full": "Obama Oversteps Boundaries into FBI Investigation Over Clinton Emails", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T23:50:00.000+03:00", "replies_count": 0, "uuid": "c3e3df6fbfddaf56657b2f3857b5fba83b48bce2"}, "author": "Ryan Haas", "url": "http://jpupdates.com/2015/10/16/obama-oversteps-boundaries-into-fbi-investigation-of-clintons-emails/", "ord_in_thread": 0, "title": "Obama Oversteps Boundaries into FBI Investigation Over Clinton Emails", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Photo credit: Reuters | Jonathan Ernst \nFederal agents were in the midst of filtering through classified information from Democrat Hillary Clinton’s personal email server last week, when President Barack Obama played down the matter on national television. \n“I don’t think it posed a national security problem,” Obama said Sunday on CBS’s 60 Minutes. \nAccording to a New York Times article, the president went to say that Clinton’s use of a private email account was a “mistake,” but concluded that “this is not a situation in which America’s national security was endangered.” \nThe statements collided with FBI agents who have been endlessly working to determine whether Clinton’s email setup had put any national secrets in jeopardy, according to current and former law enforcement officials. \nLaw enforcement claims investigators have not yet reached any conclusions about whether the information on the server had been compromised or whether to recommend charges. \nBut investigators appeared uneasy following Obama’s claims, as if he had already decided the answers to their questions and cleared anyone of any investigation or wrongdoing. \nThe White House promptly acknowledged that Obama wasn’t trying to influence any investigation. \nA spokesman for the FBI declined to comment. But former senior FBI member Ron Hosko –who retired in 2014 and is now the president of the Law Enforcement Legal Defense Fund, said it was inappropriate for the president to “suggest what side of the investigation he is on” when the FBI is still investigating. \n“Injecting politics into what is supposed to be a fact-finding inquiry leaves a foul taste in the FBI’s mouth and makes them fear that no matter what they find, the Justice Department will take the president’s signal and not bring a case,” Hosko, who remains close with current agents even after retiring. \nThe White House released statements Thursday reiterating that Obama wasn’t commenting on the merits of the investigation, but rather was offering his opinion on why Clinton’s emails were overblown. Officials said the president was just noting the emails public release hasn’t jeopardized national security. \n“There’s a debate among national security experts, as part of their ongoing, independent review, about how or even whether to classify sections of those emails,” White House Press Secretary Josh Earnest said. “But, as the president said, there is no evidence to indicate that the information in those emails endangered our national security.”", "external_links": [], "published": "2015-10-16T23:50:00.000+03:00", "crawled": "2015-10-17T00:34:05.193+03:00", "highlightTitle": ""}