{"organizations": [], "uuid": "6277095c8b805d8110ab939e73af9fe14386a24c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/national/us/", "section_title": "U.S.: Politics, Crime, Weather and More - seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Rand-Paul-not-bothered-by-comment-on-presidential-6546110.php", "country": "US", "title": "Rand Paul: I'm not bothered by presidential race comment", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Rand Paul: I'm not bothered by presidential race comment - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "6277095c8b805d8110ab939e73af9fe14386a24c"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Rand-Paul-not-bothered-by-comment-on-presidential-6546110.php", "ord_in_thread": 0, "title": "Rand Paul: I'm not bothered by presidential race comment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOUISVILLE, Ky. (AP) — U.S. Sen. Rand Paul sounded unfazed Friday by a surprising snub from his home state's Republican gubernatorial nominee, who indicated during a radio debate that he would vote for one of Paul's rivals in the 2016 GOP presidential race.\nPaul said in a phone interview that he wholeheartedly supports Matt Bevin , who is trying to win back the governor's seat for Republicans in Kentucky. During a debate with Democratic opponent Jack Conway this week on a popular sports talk radio show, Bevin said he would vote for Ben Carson for president. Bevin made that choice shortly after his campaign announced that Paul would campaign with him on Saturday.\n\"It doesn't really bother me,\" Paul said Friday. \"My concern is about trying to elect a Republican governor, and that's what I want to get done.\"\nWeighing in on the presidential race during the debate, Bevin said: \"I think the world of Rand. He's a friend of mine. But in terms of who I would select right now for the next president, (Paul) would not be the first choice I would make.\"\nAfterward, Bevin clarified his statement on Twitter: \"To be clear ... I like Ben Carson, but am not endorsing him or anyone for (president).\" Bevin said if he ever did endorse someone, he would endorse Paul, a first-term senator from Kentucky.\nDemocrats pounced on Bevin's pro-Carson remark in hopes of dividing Republican ranks ahead of the Nov. 3 election in Kentucky. \"Senator Paul learned what too many Kentuckians already know: You can't trust Matt Bevin,\" said Democratic Governors Association spokesman Jared Leopold .\nThe race to succeed two-term Democratic Gov. Steve Beshear appears close. Bevin is a businessman and Conway is the state's attorney general.\nPaul said Friday he understands that with such a crowded field of GOP presidential candidates, not every Kentucky Republican will support him.\n\"It's really more about me supporting him (Bevin) than me asking him to support me,\" Paul said.\nPaul said his presidential hopes wouldn't be undermined by Bevin's pro-Carson comment during the debate.\n\"I think it will be reported once or twice and probably forgotten,\" he said.\nMeanwhile, Paul insisted that his campaign has ample money to wage a national campaign.\nPaul raised $2.5 million for his presidential bid during the three-month period ending Sept. 30. His campaign said he has $2 million in the bank after paying expenses. Paul's $2.5 million haul represents a decline from the $6.9 million he raised over the first three months of his campaign.\n\"We believe we have enough money to compete in all 50 states,\" Paul said in the interview Friday.\nOn Friday, Paul toured a business in a mostly minority section of Louisville, Kentucky, to promote criminal-justice reforms and tax breaks to stimulate job growth in struggling neighborhoods. Paul is running dual candidacies in 2016: for the White House and for re-election to his Senate seat.\nPaul criticized disparities in arrest rates resulting in higher percentages of blacks going to prison for drug offenses. He said it's not the fault of police, but a result of a focus on inner cities in combating illegal drug use.\n\"What I've become more and more convinced is that there are a lot of people who had youthful mistakes and deserve a second chance,\" Paul said while visiting America's Finest Filters, a business in western Louisville. \"We have wasted so much money putting these people in prison for way too long.\"\nPaul has regularly visited minority sections of Louisville as part of his efforts to switch more blacks into supporting Republicans.\nHis proposals to revamp the criminal-justice system have included downgrading some felonies to misdemeanors, giving judges more sentencing flexibility, restoring voting rights to some non-violent felons and making it easier for people to expunge their criminal records.\nThe company's president and CEO, Michael White , said nearly half his 19 employees were previously convicted of felonies.\n\"I believe in allowing people a second chance,\" he said.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-03T05:23:57.540+03:00", "highlightTitle": ""}