{"organizations": ["White House"], "uuid": "096bf78453f6d1336b1c02259729847164cd5ca9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.desmoinesregister.com", "main_image": "http://www.gannett-cdn.com/-mm-/daa84d8edb328298858132e680271d868d47ebd6/c=0-341-2998-2035&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/21/USATODAY/USATODAY/635810273230249078-AFP-545578440.jpg", "site_section": "http://rssfeeds.desmoinesregister.com/desmoines/politics", "section_title": "Des Moines - Politics", "url": "http://www.desmoinesregister.com/story/news/elections/presidential/caucus/2015/10/21/joe-biden-not-run-president/73844912/", "country": "US", "title": "Joe Biden says no to 2016 presidential race", "performance_score": 0, "site": "desmoinesregister.com", "participants_count": 0, "title_full": "Joe Biden says no to 2016 presidential race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:10:00.000+03:00", "replies_count": 0, "uuid": "096bf78453f6d1336b1c02259729847164cd5ca9"}, "author": "", "url": "http://www.desmoinesregister.com/story/news/elections/presidential/caucus/2015/10/21/joe-biden-not-run-president/73844912/", "ord_in_thread": 0, "title": "Joe Biden says no to 2016 presidential race", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Clinton", "Nicole Gaudiano", "Joe Biden", "Jim Watson", "Biden", "Jill", "Obama"], "text": "Joe Biden says no to 2016 presidential race Vice President Biden announced he will not run for president, ending months of speculation. Post to Facebook Joe Biden says no to 2016 presidential race Vice President Biden announced he will not run for president, ending months of speculation. Check out this story on USATODAY.com: http://usat.ly/1RWl97X Cancel Send A link has been sent to your friend's email address. Posted! A link has been posted to your Facebook feed. 293 To find out more about Facebook commenting please read the Conversation Guidelines and FAQs Joe Biden says no to 2016 presidential race Nicole Gaudiano , USA TODAY 5:53 p.m. EDT October 21, 2015 Vice President Joe Biden will not go head to head with Hillary Clinton to seek the 2016 democratic nomination for president. He said too many logistical challenges remain just months before votes are cast. Vice President Biden, flanked by President Obama and his wife, Jill, speaks in the Rose Garden at the White House on Oct. 21, 2015. (Photo: Jim Watson, AFP/Getty Images) 3263 CONNECT 233 TWEET 3 LINKEDIN 293 COMMENT EMAIL MORE \nWASHINGTON — Ending months of speculation about his political future, Vice President Biden announced Wednesday he won't run for president, saying the window for entering the race has closed. \n\"Unfortunately, I believe we're out of time, the time necessary to mount a winning campaign for the nomination,\" said Biden, who sought the Democratic presidential nomination in 1988 and 2008. \"But while I will not be a candidate, I will not be silent. I intend to speak out clearly and forcefully, to influence as much as I can where we stand as a party and where we need to go as a nation.” \nBiden, 72, a former U.S. senator, has been grieving and weighing family needs since his 46-year-old son Beau, Delaware’s former attorney general, died of brain cancer on May 30. Reports that Beau, in his final days, urged his father to run for president stoked national speculation again about a possible bid. \nBiden said Wednesday the grieving process \"doesn't respect or much care about things like filing deadlines or debates and primaries and caucuses.\" He said he and his family have reached the point where thinking of Beau \"brings a smile\" before tears. \n\"Beau is our inspiration,\" he said. Six things to know about Joe Biden \nBiden spoke from the Rose Garden as his wife, Jill, and President Obama looked on. He urged Democrats to build on the successes of the Obama administration in the coming presidential campaign. \n“This party, our nation, will be making a tragic mistake if we walk away or attempt to undo the Obama legacy,” he said. “Democrats should not only defend this record and protect this record, they should run on the record.” \nBiden listed priorities that include \"giving the middle class a fighting chance,\" reforming immigration policies and campaign finance laws, and rooting out institutional racism. \n\"We need, as the president has proposed, to triple the child care tax credit,\" he said. \nBiden also said the country needs “a moonshot” to cure cancer and vowed to spend his next 15 months in office fighting for increased funding for research and development. \n“If I could be anything, I would have wanted to be the president that ended cancer, because it’s possible,” he said, calling the issue \"personal.\" \nTo the delight of progressives, Biden joined the call for debt-free college, saying “we need to commit to 16 years of free public education for all of our children.” \n\"We can pay for all of this with one simple step, by limiting the deductions in the tax code to 28 percent of income,\" he said. \nHe also called for an end to “divisive partisan politics,” repeating a statement he made Tuesday that could be perceived as a dig at Democratic presidential front-runner Hillary Clinton. During the first Democratic debate on Oct. 13, Clinton listed Republicans among the enemies she’s most proud of making. \n“I don’t think we should look at Republicans as our enemies,” Biden said Wednesday. “And for the sake of the country, we have to work together.” \nReince Priebus, Republican National Committee chairman, called Biden’s decision a “major blow” for Democrats, saying Biden was “the most formidable general election candidate the Democrat Party could have fielded, and his decision not to challenge Hillary Clinton greatly improves our chances of taking back the White House.” \nGOP presidential candidate Donald Trump tweeted, \"I think Joe Biden made correct decision for him & his family. Personally, I would rather run against Hillary because her record is so bad.\" \nRumors had swirled about what Biden would do. Supporters said before Wednesday it would be understandable if he decided to sit out the 2016 race. \n“No one would blame him if he said, ‘You know, look, it’s just too much,’” supporter Dick Harpootlian, former chairman of South Carolina’s Democratic Party, said in June. \nSen. Tom Carper, D-Del., said Oct. 6 that only within the previous week or so had Biden \"gotten to a place where he can actually talk about his son without crying. It's still tender.\" On Wednesday, Carper said he had encouraged Biden during the past several weeks to listen to his family as they continued to grieve. \n\"I know he heard from people across the country who urged him to run and offered to help, but the most important influences on his decision were his wife, Jill, their children and grandchildren, and God,\" Carper said in a statement. End of presidential ambitions ties Biden's legacy forever to Obama \nFormer Sen. Ted Kaufman of Delaware, Biden’s former chief of staff in the Senate, said Biden and his wife told advisers Tuesday night to prepare for an announcement Wednesday that he wouldn't be running. \n\"We had the financial commitments, we had the top people for our organization but it was clear that we didn’t have the time and that the window had closed,\" Kaufman said. \nBiden’s announcement came a day before Clinton is scheduled to testify before a special House committee on her role as secretary of state during the 2012 terrorist attacks on a U.S. diplomatic compound in Benghazi, Libya. \nFormer Obama strategist David Axelrod told CNN he believes Biden timed his announcement so it wouldn’t appear to be a reaction to Clinton’s performance at the high-profile hearing. Biden also likely wanted to make his intentions clear before Iowa’s largest gathering of Democrats on Saturday at the annual Jefferson-Jackson Dinner. \n\"His time was earlier in the campaign, not now,\" Axelrod said. \nBiden represented Delaware in the Senate for 36 years, beginning in 1973. He took his first oath of office next to Beau Biden’s hospital bed about a month after a car accident that killed his first wife, Neilia, and their 13-month-old daughter. The accident injured Beau Biden and his brother, Hunter. \n“He's the luckiest person I've known, and the unluckiest person I've known,\" Kaufman said after Beau’s death. \"He says it all the time, 'There are people who have had worse experiences than I have.' But I don't know any of them.\" \nThe Draft Biden super PAC, launched by former Biden staffers and campaign veterans, had hired staff in early voting states and raised funds for independent expenditures in support of his possible candidacy. The group recently released its first national TV ad, focused on his ability to overcome personal tragedy, to media outlets. But they decided not to air it after a report that Biden did not want the emotional video to run. Vice President Biden speaks in the Rose Garden at the White House on Oct. 21, 2015, to announce he is not running for president. Scroll through for a look at Biden over the years. Jim Watson, AFP/Getty Images Biden is pictured at age 10. AP Biden is pictured in his official Senate portrait from the mid-1970s. AP Biden is photographed with his sons Hunter, left, and Beau around 1972. AP Biden waves from his train on June 9, 1987, as he leaves Wilmington, Del., after announcing his candidacy for president. George Widman, AP Biden stands on stage with his wife, Jill, and sons Hunter, left, and Beau, along with his father, Joe Biden Sr., during a campaign event in 1988. AP In this Aug. 1, 1987, file photo, 6-year-old Ashley Biden gets a taste of campaigning with her dad, in Des Moines, Iowa. AP Then-senator Biden attends a baseball antirust hearing on Feb. 21, 1995, in Washington. Tim Dillon, USA TODAY Biden holds up a government booklet on drug and crime issues while questioning Attorney General Janet Reno during a hearing before the Senate Judiciary Committee to discuss Justice Department operations on April 30, 1997, on Capitol Hill. Joe Marquette, AP Fullscreen Biden introduces America Online CEO Steve Case to media and children at the Eastern Boys & Girls Club in Southeast Washington, D.C., on Feb. 10, 2000. Biden announced his plan to put new computers with Internet access in Boys & Girls Clubs across the country. Heather Martin Morrissey, GNS Biden, left, holds up a bottle of Andro Fuel, a type of steroid, during a news conference at the Department of Health and Human Services in Washington on March 11, 2004. Standing with Biden is Sen. Orrin Hatch, R-Utah. Susan Walsh, AP Then-senators Obama and Biden confer during a Foreign Relations Committee hearing on Capitol Hill on April 11, 2005, on John Bolton's nomination to be ambassador to the United Nations. DENNIS COOK, AP Biden speaks to law students at Drake University in Des Moines, Iowa, on April 3, 2007. KEVIN SANDERS, AP Biden talks with then-senator Barack Obama before the start of the first Democratic presidential primary debate on April 26, 2007, at South Carolina State University in Orangeburg. J. Scott Applewhite, AP Biden rests his head on the shoulder of his wife, Jill, as they wait in a hallway for his introduction at a Jan. 3, 2008, rally at the United Auto Workers' Hall in Dubuque, Iowa. Mark Hirsch, AP Biden speaks during a news conference about the agenda and priorities of the Senate Foreign Relations Committee at the U.S. Capitol on Jan. 24, 2008. MICHAEL SCHWARTZ, GNS Biden holds up a 1972 \"Life\" magazine with his picture in it after speaking to the Nashua Rotary Club in Nashua, N.H., on Aug. 13, 2008. Cheryl Senter, AP Biden addresses the Democratic National Convention on Aug. 27, 2008, at the Pepsi Center in Denver, Colo. Rob Curtis, USA TODAY Biden and his son, Beau, at the Democratic National Convention in Denver on Aug. 27, 2008. Matthew Cavanaugh, European Pressphoto Agency Biden and Sarah Palin participate in an Oct. 2, 2008, vice presidential debate at Washington University in St. Louis, Mo. Pool photo by Rick Wilking Biden and his wife, Jill, dance on Jan. 20, 2009, at the Commander in Chief's Ball on inauguration night in Washington. Gerald Herbert, AP Biden greets spectators at the men's ski jumping competition on Feb. 13, 2010, at Whistler Olympic Park in Whistler, B.C. Christopher Gannon, USA TODAY The vice president serves up a cone at Kopp's Frozen Custard on June 25, 2010, in Milwaukee. Biden was in Milwaukee for a fund raiser for Sen. Russ Feingold, D-Wis. Morry Gash, AP Biden delivers his acceptance speech at the Democratic National Convention on Sept. 6, 2012, in Charlotte, N.C. H. Darr Beiser, USA TODAY Biden visits with patrons during lunch at Cruisers Diner on Sept. 9, 2012, in Seaman, Ohio. Carolyn Kaster, AP Biden, left, and Republican vice presidential nominee Rep. Paul Ryan, R-Wis., gesture after the Oct. 11, 2012, vice presidential debate at Centre College in Danville, Ky. Pool photo by Michael Reynolds Biden and his wife, Jill, dance at the Inaugural Ball on Jan. 21, 2013, at the Washington Convention Center. Carolyn Kaster, AP Biden waves on April 21, 2014, after landing at the airport in Boryspil, Ukraine. Yuriy Maskimov, European Pressphoto Agency Biden enjoys an ice cream cone after an Oct. 8, 2014, campaign rally for Oregon Sen. Jeff Merkley in Portland. Don Ryan, AP Biden poses for a selfie with a member of the audience during a campaign event for Democrat Seth Moulton, a candidate for the U.S. House of Representatives, on Oct. 29, 2014, in Lynn, Mass. Steven Senne, AP Biden speaks to the Saban Forum on Dec. 6, 2014, in Washington. Jose Luis Magana, AP Sen. Jeanne Shaheen's grandson, A.J. Bellabona, takes a selfie with Biden in the Old Senate Chamber at the Capitol on Jan. 6, 2015, after Sen. Shaheen participated in her ceremonial swearing-in with other members of Congress. Eileen Blass, USA TODAY Biden tours the headquarters of PECO energy company in Philadelphia on April 21, 2015. Matt Rourke, AP A U.S. Naval Academy Midshipmen 1st Class celebrates after receiving his diploma from Biden during graduation ceremonies at the U.S. Naval Academy on May 22, 2015, in Annapolis, Md. Biden gave the commencement speech to this year's graduating class. Mark Wilson, Getty Images Fullscreen Biden embraces his grandson Hunter before funeral services his son Beau Biden on June 6, 2015, at St. Anthony of Padua Roman Catholic Church in Wilmington, Del. The eldest son of the vice president, died of brain cancer May 30 at age 46. Patrick Semansky, AP Obama hugs Biden after delivering the eulogy in honor of Biden's son, former Delaware Attorney General Beau Biden, on June 6, 2015, at St. Anthony of Padua Church in Wilmington, Del. Pablo Martinez Monsivais, AP Biden walks with House Minority Leader Nancy Pelosi, D-Calif., after attending a House Democratic Caucus meeting in the Capitol on July 15, 2015. He briefed Democrats on the Iran nuclear deal and participated in a lengthy question-and-answer session. Shawn Thew, European Pressphoto Agency Biden speaks at Generation Progress' 10th Annual Make Progress National Summit in Washington on July 16, 2015. Molly Riley, AP Biden talks with U.S. Ambassador to the United Nations Samantha Power in the Oval Office on Aug. 4, 2015. Jim Watson, AFP/Getty Images Biden attends the Sussex County Democratic Party's annual Jamboree at Cape Henlopen State Park in Delaware on Aug. 29, 2015. Jason Minto, The News Journal Biden walks in the annual Allegheny County Labor Day Parade on Sept. 7, 2015, in Pittsburgh. Jeff Swensen, Getty Images Biden speaks during an \"It's On Us\" event on the Ohio State University campus in Columbus on Sept. 17, 2015. The vice president addressed the importance of preventing sexual assault on college campuses. Paul Vernon, AP In this image released by CBS, host Stephen Colbert shakes hands with Biden during a taping of \"The Late Show with Stephen Colbert\" on Sept. 10, 2015 in New York. John Paul Filo, AP Biden and Speaker John Boehner listen as Pope Francis addresses a joint session of Congress on Sept. 24, 2014. Vincenzo Pinto, AFP/Getty Images Biden jokes with Obama during an event to mark the 25th anniversary of the White House Initiative on Educational Excellence for Hispanics in the East Room of the White House on Oct. 15, 2015. Brendan Smialowski, AFP/Getty Images Vice President Joe Biden gestures toward former Vice President Walter Mondale as they participate in a forum honoring Mondaleís legacy, Tuesday, Oct. 20, 2015, at George Washington University in Washington. (AP Photo/Molly Riley) ORG XMIT: OTK Molly Riley, AP Like this topic? You may also like these photo galleries: Replay", "external_links": [], "published": "2015-10-22T01:10:00.000+03:00", "crawled": "2015-10-22T17:46:52.941+03:00", "highlightTitle": ""}