{"organizations": [], "uuid": "165bd935b821b3b7a93b6c5798d16d1088328fa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_144375427855423.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/politics/index.rss2", "section_title": "Politics", "url": "http://www.startribune.com/immigrant-professionals-outraged-over-government-reversal/330355301/", "country": "US", "title": "Immigrant professionals outraged over feds' reversal on green cards", "performance_score": 1, "site": "startribune.com", "participants_count": 3, "title_full": "Immigrant professionals outraged over feds' reversal on green cards - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:24:00.000+03:00", "replies_count": 2, "uuid": "6d0be30c2e370c27f60b32eea05fd1fe78ddb9fc"}, "author": "Mila Koumpilova", "url": "http://www.startribune.com/immigrant-professionals-outraged-over-government-reversal/330355301/#post-0", "ord_in_thread": 0, "title": "Immigrant professionals outraged over feds' reversal on green cards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Minneapolis engineer Haifeng Xiao scrambled this month to prepare an application for a green card, which would grant her permanent residency in the United States a decade after arriving from China.\nBut she found out this week that it might be another two years before she can apply.\nSkilled professionals such as Xiao caught in employment-based green card backlogs got two surprises in recent weeks. The government announced in early September that some immigrants who had waited for years would be able to file their applications in October, in keeping with a 2014 initiative by President Obama to address long waits. But last Friday, the government revised its timeline, pushing back application dates by as long as five years for some immigrants.\n“We were so excited, and to have the rug pulled out from under us two weeks later is just flabbergasting,” said Mark Schneider, the University of Minnesota’s associate director of employment-based visas.\nEarlier this week, Xiao and other applicants sued the government over the reversal. The Minnesota chapter of the American Immigration Lawyers Association reached out to U.S. Sens. Al Franken and Amy Klobuchar to protest the change.\nThis year, after input from some of the state’s largest employers, Klobuchar sponsored a bipartisan bill that would boost the availability of green cards for foreign professionals; supporters say they help fill worker shortages in high-tech and other fields.\nBut the proposal met with stiff opposition in Congress amid charges some employers bypass American workers in favor of cheaper, more pliable foreign-born labor. Moves to bring in employees on work visas following recent layoffs at Disney and other companies have given critics fresh ammunition.\nBacklogs since mid-2000s\nSince the mid-2000s, applicants have faced long backlogs for the annual quota of 140,000 employment-based green cards, which put immigrants on a path to citizenship. The waits can stretch to a decade or longer for those from India, China and the Philippines because of per-country quotas. While they wait, immigrants cannot switch jobs or accept certain promotions; international travel is a hassle.\nLast November, Obama announced his administration would start allowing these immigrants to file their applications sooner, giving them more employment flexibility while they wait. This September, the government said it would implement this change in October, and thousands of immigrants sprang to action.\nXiao says she paid $950 for an immigration attorney this month, on top of fees her employer had already incurred; she also spent about $1,000 to obtain needed documents and get a required medical exam. Meanwhile, Xiao started making plans for a long-delayed trip to China to visit her father, who has cancer.\nThen, over the weekend, she found out about the government’s about-face.\n“I feel the administration cannot do this to legal immigrants,” said Xiao, who has a doctorate from the New Jersey Institute of Technology. “How can they just change their mind?”\nGood news, bad news\nLocal immigration attorneys acknowledge that, thanks to the changes earlier in September, the timelines look better for most applicants even after last week’s setback. Take Indian natives with advanced degrees: In September, the government accepted final applications from those who started the process back in 2006. Now, those who’ve waited since 2009 will be able to apply this month. Still, says Edina attorney Robert Webber, the reversal gave some immigrants good-news-bad-news whiplash: “It’s like telling your daughter you’re giving her a pony, and then you give her a stuffed pony.”\nWebber says the government gave only a vague reason, saying it made the change “to better reflect a time frame justifying immediate action in the application process.”\nThe U.S. Citizenship and Immigration Services and the Department of State declined to comment, citing the pending lawsuit.\nImmigration Voice, an advocacy group for high-skilled workers, launched a push to send flower bouquets to the Department of Homeland Security offices in Washington, D.C. — a repeat of a Bollywood-inspired campaign in 2007, when the government eventually backtracked on a similar about-face.\nAttorneys involved in Xiao’s lawsuit estimate between 20,000 and 30,000 immigrants are affected nationally. It’s not clear how many of them are in Minnesota, where the Minnesota Chamber of Commerce is part of a coalition lobbying for legal immigration changes.\nAt the U, Schneider says he knows of five tenure-track faculty who were affected, but there are likely more working with private attorneys.\nImmigrant advocates have charged some employers take advantage of workers stuck in green card backlogs, who are tied to their company until they can file their applications. But Schneider said the U is hurt by the long waits as well: Before they obtain green cards, faculty and researchers cannot apply for all-important federal research grants.\nIn a statement, Klobuchar called the timeline switch “concerning,” adding: “We need a reasonable, workable solution that reduces our backlogged visa system.”\nSrikanth Peddireddy, a Hennepin County Medical Center manager from India, says he is still hopeful the government might change its mind yet again and agree to honor its original September timeline. His employer first set out to sponsor him for a green card in 2010.\n“The waiting game has been really hard,” he said. “It leaves a large amount of uncertainty in how we want to build our lives.”", "external_links": [], "published": "2015-10-02T07:24:00.000+03:00", "crawled": "2015-10-02T12:18:15.780+03:00", "highlightTitle": ""}