{"organizations": [], "uuid": "a5748d41ca8777f0c2605cd3580c2c46105c4760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dcinno.streetwise.co", "main_image": "http://wp.streetwise.co/wp-content/blogs.dir/2/files/2015/10/shutterstock_155863808-630x504.jpg", "site_section": "http://inthecapital.streetwise.co//feed/", "section_title": "DC Inno | Washington DC Tech, City and Political News", "url": "http://dcinno.streetwise.co/2015/10/05/baltimore-edtech-laureate-education-ipo-price-clinton-relation/", "country": "US", "title": "The Clinton Family's Favorite Edtech Company Just Filed a $100M IPO", "performance_score": 0, "site": "streetwise.co", "participants_count": 1, "title_full": "The Clinton Family's Favorite Edtech Company Just Filed a $100M IPO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T00:06:00.000+03:00", "replies_count": 0, "uuid": "a5748d41ca8777f0c2605cd3580c2c46105c4760"}, "author": "Chris Bing", "url": "http://dcinno.streetwise.co/2015/10/05/baltimore-edtech-laureate-education-ipo-price-clinton-relation/", "ord_in_thread": 0, "title": "The Clinton Family's Favorite Edtech Company Just Filed a $100M IPO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "share CGI Event, former president Bill Clinton speaks / Credit: Shutterstock.com \nOver the last several years, Baltimore has quietly positioned itself as a hub for both education technology companies and the talent necessary to lift them off the ground. And that industrial growth is more evident than ever after a top software company has filed paperwork with the U.S. Securities and Exchange Commission (SEC) to be publicly traded . Related How To Spot The Next DC Tech IPO \nOn Friday, Charm City’s burgeoning edtech scene claimed another emphatic win when Laureate Education announced it was filing for a $100 million initial public offering (IPO). \nThe for-profit Baltimore-based company is the developer of a large network of campus-based and online universities that offer undergraduate and postgraduate degree programs. These courses are offered in a variety of languages, in different formats, and at higher education campuses across the globe. In addition, under its subsidiary Laureate International Universities, the company owns/manages several institutions. \nLaureate Education is essentially a two corporation, split between software product development and as overseer of more than a dozens universities, internationally. \nThe company had been previously publicly traded but was turned private in 2007 via a $3.8 billion acquisition orchestrated by private equity investment behemoth Kohlberg Kravis Roberts & Co. (KKR). The acquisition also introduced prominent backers like Citigroup Private Equity, Sterling Capital and SPG Partners as investors. These larger players, led by KKR and CEO Douglas Becker, will likely become the greatest benefactors of Laureate Education’s decision to go public. Charm City’s burgeoning edtech scene claims another emphatic win \nUnlike most of its metropolitan peers, Laureate Education is a giant, with seemingly unparalleled international influence; it is a multi-billion dollars company that, until recently, employed former president Bill Clinton in the role of “honorary chancellor.” \nLaureate Education has consistently partnered with the Clinton Global Initiative (CGI) on a number of initiatives since 2008. Clinton joined the payroll in 2010, according to Bloomberg Business , and was subsequently paid $16.5 million for his services. \nClinton’s role in the company through Laureate International Universities consisted of visiting international campuses that were using Laureate Education products, among other things. The position dematerialized earlier this year though, when spouse Hillary Clinton launched her bid for the presidency. Clinton was paid $16.5 million for his services \nAt the moment, Laureate International Universities owns 88 higher-ed institutions in 28 countries, primarily outside the U.S. Accompanying the announcement on Friday, Laureate said that it was “converting” from a traditional corporation to a “public benefit corporation.” It’s unclear how the classification will influence the structure of the business. \nLaureate Education plans to trade under the ticker symbol ($LAUR). Importantly, the company has yet to determine the number of shares it will offer, the price per share and/or which stock exchange it plans to list under. With that being said, even the $100 million IPO raise figure is likely to change in the coming weeks. \nAccording to the aforementioned preliminary SEC paperwork, Laureate Education carried a $169M net loss on revenue of $2.16B for the first half of 2015—on pace to eclipse $4 billion in revenue for the year. For reference, Baltimore’s other corporate darling, UnderArmour, posted a revenue of $3.1 billion for the entirety of 2014. \nWith a proximity to lawmakers and the influences of K Street less than 40 miles away, the port city is well positioned to become home for a quickly changing industry (edtech) that is typically influenced by larger policy trends/decisions. Related The Big One: This VC Firm Is Investing $15M Into Baltimore Startups All the tech news in D.C. you need to know.", "external_links": [], "published": "2015-10-06T00:06:00.000+03:00", "crawled": "2015-10-06T01:00:31.500+03:00", "highlightTitle": ""}