{"organizations": [], "uuid": "52a9c9d61079985090e77af9961e00c07eb43b8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "english.ahram.org.eg", "main_image": "", "site_section": "http://english.ahram.org.eg/Category/1/64/Egypt/Politics-.aspx", "section_title": "Politics - Egypt - Ahram Online ", "url": "http://english.ahram.org.eg/NewsContent/1/64/151747/Egypt/Politics-/Egypts-Pope-Tawadros-II-calls-on-Copts-to-part-way.aspx", "country": "EG", "title": "Egypt's Pope Tawadros II calls on Copts to part ways with religious parties", "performance_score": 0, "site": "ahram.org.eg", "participants_count": 1, "title_full": "Egypt's Pope Tawadros II calls on Copts to part ways with religious parties - Politics - Egypt - Ahram Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "52a9c9d61079985090e77af9961e00c07eb43b8c"}, "author": "english.ahram.org.eg", "url": "http://english.ahram.org.eg/NewsContent/1/64/151747/Egypt/Politics-/Egypts-Pope-Tawadros-II-calls-on-Copts-to-part-way.aspx", "ord_in_thread": 0, "title": "Egypt's Pope Tawadros II calls on Copts to part ways with religious parties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Related Nour Party, Egypt's political Islam sole survivor, left with dim election hopes Egypt's Coptic Pope Tawadros II on Tuesday called on Christian members of religious parties to \"reconsider their position,\" a statement that media reports conjectured was specifically directed to Copts who are members of the Salafist Nour Party.\nPoised to run for parliamentary elections as the only Islamist party, Nour's legitimacy has already been questioned over recent months ahead of polls set to get underway in October.\nCritics argue the Nour Party includes Coptic members only to prove it is not an Islamist party, which is the basis of arguments saying it contravenes the constitution that prevents political parties from discriminating among citizens on religious and sectarian grounds.\nAlso, Article 5 of the House of Representatives Law states that each party list must include Christians.\n\"Sometimes religion is directed, like under [Muslim] Brotherhood rule, and all Egyptians do not accept rule in the name of religion, and religion is precious,\" Tawadros II told CTV, the Coptic Orthodox Church's channel.\nEx-president Mohamed Morsi, who hails from the Brotherhood, was toppled in July 2013 after exactly one year in office following mass nationwide protests against his rule.\nMorsi's ouster was followed by an unprecedented and sustained security crackdown on political Islam and its figures. However, the Nour Party remained unscathed thanks to its support for what most Islamist forces have described as the July 2013 \"coup.\"\nClose scrutiny\nBut despite having supported the ouster of Morsi, with the heat increasing on already outcast Islamists, the Nour Party has not escaped close scrutiny.\nTwo months ahead of elections, a campaign named \"No to Religious Parties\" was triggered to call for the dismantling of political parties based on a religious outlook, deemed unconstitutional and discriminatory.\nBacked by the Ministry of Religious Endowments, the campaign was launched by Tamarod (Rebel), a signature drive initiative that played a leading role in ousting Morsi, and political activist Hamdi Al-Fakharani. It has largely targeted the Nour Party, who kept arguing no one can prove it a religious party.\nOn 12 September, a court in the administrative circuit of the State Council accepted a lawsuit from lawyer Essam El-Islamboly, who supported the No to Religious Parties campaign, to oblige Egypt's Parties Committee to dissolve 11 Islamist political parties, including Nour. The committee is yet to announce its decision.\nTawadros II did not explicitly mention Nour during the interview. When asked how he sees Copts who joined religious parties only to prove that these parties are not religiously founded, he asked them to \"reconsider their position.\"\nThe statements of Tawadros II came following recent criticisms from Copts against their peers who are members of Nour Party, including from Coptic lawyer Mamdouh Ramzy who usually supports the Church's stances.\n\"It (the Salafist party) collaborated with the Muslim Brotherhood after the 2011 revolution and since the revolution of 30 June [2013] began it has changed its suit and aligned itself with the new regime under President Abdel-Fattah El-Sisi,\" Ramzy was Quote: d by Al-Ahram Hebdo as saying in Wednesday's issue.\n\"There is no surprise that the members from Coptic 38 present themselves on Nour's [electoral] lists. The Church is not satisfied with what is happening, but its role is symbolic only and it cannot take action against them.\"\nCoptic Christian group Coptic 38 was established in 2011 initially to campaign for changes to the Church's divorce laws. Founder of the group, Nader El-Seirafy, says that he has always been \"convinced by the programme of the [Nour] Party.\" \"It has played an important role in the success of the 30 June Revolution,\" he said.\nProtests against Morsi started on 30 June 2013, paving the way for the implementation of the political roadmap that saw the Islamist president ousted and detained incommunicado, dismantled the Brotherhood-dominated Shura Council (parliament's upper house and the only house operating at the time) and froze the 2012 Constitution (drafted mainly by Islamist figures).\nNour's decision to support the nationwide demonstrations was deemed staggering — especially among the Brotherhood and Islamists — considering the common grounds they ostensibly share with the Nour Party: visions to impose Islamic Sharia law, complete rejection of secularism, and a political scene that brought Islamists from obscurity to ubiquity.\nAfter decades of suppression under former president Hosni Mubarak, the 2011 uprising that toppled him enabled for the first time in Egypt Islamist groups to be politically represented through official parties. While the Brotherhood launched the Freedom and Justice Party (FJP), the Salafist Call — Egypt's largest Salafist organisation — established the Nour Party.\nThe 2011-2012 parliamentary elections indicated the respective weight of participating political players, with the FJP and the Nour Party seizing the largest two blocs (around 46 and 24 percent of seats respectively) in the People's Assembly, the more significant parliamentary house. Political Islam thrived for a few years afterwards until Morsi was ousted.\nThis year, Nour Party significantly reduced its electoral target compared to under Morsi by announcing it is running for only two party-based electoral lists in the upcoming parliamentary elections.\nIt will run for 45 seats in the Cairo and East and South Delta (six governorates) district, and for 15 seats in the West Delta (three governorates) district.\nThe party reasoned that its decision to run for two party based districts only, instead of four, was to \"establish the principle of real partnership between all national forces, especially in the critical time that the country is in.\"\nEgypt's new parliament will comprise 596 MPs, with 448 independents and 120 party-based deputies. Twenty-eight MPs will be appointed by President Abdel-Fattah El-Sisi.", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T16:43:55.003+03:00", "highlightTitle": ""}