{"organizations": [], "uuid": "7e5f93ccb63d09a7bb793d1c9209ba406b55a3b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/e6/6a0b601d1c3bcb665eb4260ee9e553/media:7b54cbd7f7e744f6878f69c6e5912371EastCoastRainstormSharedTrauma.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/us/articles/2015/10/10/south-carolina-floods-leave-a-shared-sense-of-memories-lost", "country": "US", "title": "South Carolina floods leave a shared sense of memories lost", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "South Carolina floods leave a shared sense of memories lost - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e5f93ccb63d09a7bb793d1c9209ba406b55a3b5"}, "author": "USNews", "url": "http://www.usnews.com/news/us/articles/2015/10/10/south-carolina-floods-leave-a-shared-sense-of-memories-lost", "ord_in_thread": 0, "title": "South Carolina floods leave a shared sense of memories lost", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JAY REEVES and JULIET LINDERMAN, Associated Press\nCOLUMBIA, S.C. (AP) — Gills Creek flows past the Columbia Ballet School, and, a few miles downstream, a shop where people can pawn car titles to pay monthly bills. It fills lakes ringed with stately, white-columned homes worth nearly $1 million and snakes by a working-class apartment complex where locals say it's best to leave before dark.\nOver the past week, as the water rose after days of unrelenting rain in the heart of South Carolina, the creek spilled misery and pain on rich and poor alike, robbing both of the things most precious to them.\nThe once-a-millennium storm and mammoth flood that rolled in on a Sunday have further tested a state that has endured a year filled with more than its fair share of trauma: Back in April, a day before Easter, a white police officer fatally shot an unarmed black man in the back in North Charleston. In June, police said, a white man gunned down nine black church members in Charleston. The state was roiled for 23 more days before lawmakers removed the Confederate flag that had flown for 50 years outside the Statehouse.\nThen, just as things calmed down, rains of biblical proportion began to fall.\nGills Creek spans 70 miles across Richland County and connects a network of lakes like a string of pearls. It is the main artery of a watershed that includes more than 45,000 acres and 100 ponds and lakes on the eastern side of Columbia. Many of the area's 140,000 residents live in spacious, ranch-style homes that surround more than a dozen of the largest lakes, all of them created by modest dams.\n\"We have no natural lakes in South Carolina. Every single one is made-made,\" said Derrec Becker, spokesman for the Emergency Management Division. \"And when the water rises, it has to go somewhere.\"\nAt least 17 dams failed or were breached, and dozens more are still being monitored. Those breaches and failures, on lakes that feed into each other and into Gills Creek, caused a chain reaction downstream.\nA 20-foot boat that had been used to whisk neighbors to safety had washed up, overturned, on Beverly Steinhaus's lawn, and sat Thursday beside stacks of mattresses, couches, ripped-out sheet rock, bedframes and bags of clothing and toys that had been pulled out of the house, whose backyard is separated from the creek by only a line of tall azalea bushes.\nThe house — two stories and five bedrooms — is elevated, but even so it received 5 feet of water by 8 a.m. Sunday that went from ankle- to waist-deep in minutes as it rushed through the floor vents, she said. Steinhaus, her husband and 6-year-old son were rescued through their front window, 6 feet off the ground, and swam through a current that toppled cars and sent appliances crashing through the neighborhood.\nThe normally placid creek, which snakes behind the homes on Burwell Lane, is a part of life for many neighbors who regularly fish on its banks. On the rare occasions it snows, Steinhaus said, her son and other children throw snowballs into its icy waters.\nWhen she returned to her house Monday she had to break down the door, which had swollen shut.\n\"The first thing I noticed, there was furniture piled on top of each other. It was mayhem. Part of the walls had been knocked out from furniture sloshing around,\" she said, before getting to the most startling part for many who made their way back: \"There were fish. Hundreds of fish from the creek, and they were dead, all over my house. I just remember trying not to step on the fish. It was horrifying.\"\nOn Thursday, looking out at her belongings scattered on the grass, Steinhaus began to cry.\n\"You see the pile on our front lawn and it's our memories,\" she said. \"It's the toys my son played with. It's his bed. It's everything.\"\nStephen Marshall was swept away by the floodwaters Sunday morning while trying to reach his 85-year-old neighbor — later rescued by her son-in-law — and clung to a tree until a firefighter scooped him up.", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T19:46:53.480+03:00", "highlightTitle": ""}