{"organizations": [], "uuid": "6fdfe67b662da73d71aed50e792723acb4b62e1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tehelka.com", "main_image": "http://www.tehelka.com/wp-content/plugins/all-in-one-seo-pack/images/default-user-image.png", "site_section": "http://www.tehelka.com/?feed=custom_feed", "section_title": "Tehelka - Investigations, Latest News, Politics, Analysis, Blogs, Culture, Photos, Videos, Podcasts", "url": "http://www.tehelka.com/2015/10/where-life-ebbs-away/", "country": "IN", "title": "Where Life Ebbs Away", "performance_score": 0, "site": "tehelka.com", "participants_count": 1, "title_full": "Where Life Ebbs Away", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:09:00.000+03:00", "replies_count": 0, "uuid": "6fdfe67b662da73d71aed50e792723acb4b62e1a"}, "author": "Deepa Philip", "url": "http://www.tehelka.com/2015/10/where-life-ebbs-away/", "ord_in_thread": 0, "title": "Where Life Ebbs Away", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comment Photographs by Paromita Chatterjee \n“When the ice on the mountains melt, the sea water rises and rushes across the shores,” says Firoz. For this 12-year-old boy from Ghoramara island in the Bay of Bengal, climate change is not a lesson in geography. In his world, climate change is as real as it gets. Something visible in how everyday life is lived as well as in the frequent semicolons of crises that punctuate it. “One night my mother woke me up saying that our house was crumbling,” he recollects with a toothy grin. \nFiroz’s is an innocence untouched by misery. Or so it seems, even in the midst of the tragedies wrought by the impact of ‘development’ elsewhere, mostly in far off lands, and transmitted mercilessly into their habitat via global changes in climate. \nOnce sprawling across 8.51 sq km, Ghoramara, part of Hooghly river’s estuary, has now been reduced to 4.45 sq km. “Relentless rise in sea level due to climate change has been wreaking havoc in the estuary causing the island to erode away,” notes Tuhin Ghosh, who teaches at the School of Oceanography Studies in Jadavpur University, West Bengal. “And that is unlikely to change anytime soon.” \nGhosh is to be taken seriously when he talks about the Sundarbans. Since 1993, he has been studying the effects of climate change on this vast mangrove delta shared by India and Bangladesh. \nRise in sea level due to climate change is seen as a major threat to low-lying areas such as Ghoramara, one of the 54 islands of the Sundarbans. Ghoramara has lost 75 percent of its land to the waters over just 31 years (1968-99). While the land continues to recede, villagers like Firoz and his family have no choice but to move further inland and rebuild their homes. Displaced by climate change and forced to start their lives afresh after losing much of what they had. Not once, but again and again. \nIn conversations among themselves, the villagers float various theories on why they are losing their land to the waters. “The [West Bengal] government extended the Haldia port and that is why the water is forced to move towards our island,” says Vishnu Poda Das, a local schoolteacher. In the 1970s, the state government had drawn up the project despite warnings that it would increase the frequency and intensity of cyclones and tidal floods. Seven guidewalls were proposed to minimise ecological damage to the surrounding areas but they were never constructed. The port’s extension diverts the flow of the water towards Ghoramara 12 km away. \n“The high flow of water hits the island, takes away the top layer of the soil and loosens what lies beneath. As a result, the land slowly gives way to the sea,” says Vishnu Poda Routh, a native, pointing toward the latest prey of climate change — a road leading to his village. The soil, wet and clayey, clings to his bare feet as his eyes recollect the moment when the brick road was lapped up by the waters. A gaping hole in the landscape with bits of red brick strewn all around is all that remains of it. Remains of the day Vishnu Poda Routh and his wife salvage what they can from their collapsed ancestral house. \nThe island is closing in on its inhabitants. And they have nowhere to go. Villagers lose their ancestral land, houses, cattle and even their loved ones to the waters. Take Shaumoresh Das, for instance, who owned 30 acres of ancestral land and now has barely one left. A few kilometres away from Das’s property, Routh is joined by his wife and adolescent son for a herculean task: their ancestral mud house that weathered the elements for over 100 years has succumbed to the waters. \n“The storm last night was the last straw, as the water made the front wall cave in,” says his wife. “Thankfully my mother-in-law was not inside.” The mud house that contained the family’s possessions lies decimated. Its roof made of coconut fronds, greying under the blazing sun, has collapsed like a pack of cards. Old memories die a slow death as Routh and his family sift through rotting wood, to pick up anything of worth. \n“We have seen our neighbours drowning in the water when their house and livestock were washed away,” recollects Feroza Bibi, mother of Firoz. The water creeps up stealthily, leaving them hapless. So what do they do when drowning is inevitable? “We grab whatever food items we can and run towards higher ground,” she says. \nFor the villagers fleeing the inundated swathes of land, houses of relatives or the local school turn into makeshift shelters. “We stay at our grandfather or uncle’s place until the new house is built,” says Firoz. His new house, the fifth, is also precariously perched behind a mud wall that the villagers also use as a road. Click to zoom \nGhoramara’s inhabitants are “environmental refugees” but that has so far been little more than a label mentioned in various studies. This acknowledgement has moved neither the state government nor the Centre to come to their rescue. \nWhile researching for his 2006 documentary Mean Sea Level , Pradip Saha, director of New Delhibased organisation Damage Control, was shocked by his encounters with State apathy towards the Ghoramara “refugees”. “To bring attention to the plight of the island, I held the global premiere in Ghoramara,” says Saha. “But the government has left the islanders who are losing land to fend for themselves. There is simply no sarkari mechanism is place, which is very odd! Nothing will move until the government officially declare this as a ‘disaster’.” */", "external_links": [], "published": "2015-10-15T13:09:00.000+03:00", "crawled": "2015-10-15T13:13:33.889+03:00", "highlightTitle": ""}