{"organizations": [], "uuid": "19198ece241ac60449ca54faa82f564430d1eb89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-1296fd489dafa4b03c460da1fe445b7d.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/u.s.-russia-close-to-agreement-on-syrian-war-rules/article/2574133?custom_click=rss", "country": "US", "title": "U.S., Russia close to agreement on Syrian war rules", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "U.S., Russia close to agreement on Syrian war rules | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:14:00.000+03:00", "replies_count": 0, "uuid": "19198ece241ac60449ca54faa82f564430d1eb89"}, "author": "Jacqueline Klimas", "url": "http://www.washingtonexaminer.com/u.s.-russia-close-to-agreement-on-syrian-war-rules/article/2574133?custom_click=rss", "ord_in_thread": 0, "title": "U.S., Russia close to agreement on Syrian war rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The U.S. is nearing completion of a memorandum of understanding with Russia governing flight safety over Syria, a defense official said Wednesday.\nDefense Department representatives spoke with their Russian counterparts for the third time in a video teleconference on Wednesday. Details of the talks were not made available, but a defense official said an agreement could be signed and implemented in the coming days.\nInformation on what type of deconfliction or communication would be required in the final memo was not immediately available.\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ A statement from the Russian Defense Ministry said the talks were \"constructive\" and professional.\n  Roger Stone: Only Trump and Cruz have the guts to challenge Clinton \"It's really not hard to take points that came out of ... focus groups and go out and spit them out.\"\nBy Ryan Lovelace • 10/15/15 12:01 AM \"The parties converged in key provisions of the document and agreed in future steps,\" the statement said.\nThe Russians have conducted about 80 strikes in Syria since beginning to fly there two weeks ago, Col. Steve Warren, a spokesman for Operation Inherent Resolve, said Tuesday.\nExcept for the Russians informing U.S. officials that the strikes would begin, there has been no coordination to ensure the aircraft don't collide.\nWarren said there have been \"several\" incidents where Russian and U.S. air assets were close to each other. The most recent on Saturday saw planes from the two countries about 10 to 20 miles apart. In that incident, pilots from both countries behaved appropriately and neither had to alter their course, he said.\nAlso from the Washington Examiner Clinton's rivals strike out looking At the debate her fellow candidates demonstrated that they do not have the instinct or toughness to win.\nBy Washington Examiner • 10/15/15 12:01 AM Top Story Iran ayatollah's new missile: Lawmakers demanding action \"This   action,\" Rep. Ed Royce, R-Calif. wrote to the president.\nBy Charles Hoskinson • 10/14/15 7:10 PM", "external_links": [], "published": "2015-10-14T19:14:00.000+03:00", "crawled": "2015-10-15T07:35:07.475+03:00", "highlightTitle": ""}