{"organizations": [], "uuid": "e3e96c77e9e1e2f847daba59c5e5b98766c5ae5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "politicaloutcast.com", "main_image": "http://cdn2.politicaloutcast.com/wp-content/uploads/2014/08/mexico.jpg", "site_section": "http://feeds.feedburner.com/PoliticalOutcast", "section_title": "Political Outcast", "url": "http://politicaloutcast.com/2015/10/university-apologizes-for-mexican-food-due-to-a-few-complainers/", "country": "US", "title": "University Apologizes for Mexican Food Due to a Few Complainers", "performance_score": 0, "site": "politicaloutcast.com", "participants_count": 1, "title_full": "University Apologizes for Mexican Food Due to a Few Complainers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:06:00.000+03:00", "replies_count": 0, "uuid": "e3e96c77e9e1e2f847daba59c5e5b98766c5ae5c"}, "author": "Mack Stetson", "url": "http://politicaloutcast.com/2015/10/university-apologizes-for-mexican-food-due-to-a-few-complainers/", "ord_in_thread": 0, "title": "University Apologizes for Mexican Food Due to a Few Complainers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "University Apologizes for Mexican Food Due to a Few Complainers Posted \nIs Mexican food racist? \nCampus Reform reports , “ Clemson University apologizes for serving Mexican food .” Clemson Dining’s \"Maximum Mexican\" night, has become a student favorite over the last several years, and this year was no different, at first. […] Everything was going great. Students were loving the food and festivities. Except for two students, who took to Twitter to voice their displeasure with the school's decision to host such a \"#CUlturallyInsensitive\" event. […] While a few on Twitter were offended, the overwhelming preponderance of students registered absolutely no reaction at all. The one student who did respond to the Twitter complaints wrote, \"I'm offended that you're offended. #CUfiestafiasco.\" \nThis was, of course, ridiculous. Clemson University should have ignored the stupid complaints. \nBut they didn’t. \nInstead, they empowered the complainers and marginalized all the students who enjoyed the Mexican food. Dr. Doug Hallenbeck, Clemson University’s Senior Associate Vice President of Student Affairs apologized for the event’s “flattened cultural view of Mexican culture.” “It is the mission of University Housing & Dining to create supportive and challenging environments that enrich and nourish lives. We failed to live out our mission yesterday, and we sincerely apologize,” Hallenbeck said. Dr. Hallenbeck went on to promise that the university “will continue to work closely with [its] food service provider to create dining programs that align with Clemson University’s core values.” The university posted similar apologies through the Clemson Dining Services Facebook and Twitter pages. The apologies came after students complained that the Mexican-themed event was offensive. \nDon’t mistake the University’s “apology” as some sort of act of humility. It wasn’t. It was actually a way of joining with the complainers and attacking all the normal people who see no problem with enjoying Mexican food. One student tweeted a picture of cafeteria workers wearing sombreros with the caption “Our culture isn't a costume and we will not be mocked!” \nGive me a break. Baseball is culture. So is Football and Basketball. If someone dressed up as an athlete for Halloween would that be some kind of cultural sin. The pirates of the sixteen- and seventeen-hundreds were a culture. Is Talk Like a Pirate Day guilty of a “flattened view” of pirate life and culture? If someone dresses like a White CEO or a lawyer is that a racist insult. \n[ See also, \" White Poet Has to Pass as Asian to Get Published: Where is White Privilege? \" ] \nNotice that the University has no problem manufacturing accusations against normal people (including the majority of Hispanics) who like to have fun and eat tasty food. No humor is allowed. No, we are all supposed to “enrich and nourish lives” so we must all remain serious. \nI doubt there is any way to even describe or refer to any ethnic culture that isn’t in some way going to be open to the accusation of being a “flattened view” of that culture. So basically any speech about Mexican cuisine, no matter what the motive, will be vulnerable to new complaints. \nAgain, don’t think of this as the University “backing down.” They weren’t hurt by the complaints. On the contrary, the complainers gave the powers that be an opportunity to level more accusations against everyone who thinks such complaints are stupid", "external_links": [], "published": "2015-10-10T08:06:00.000+03:00", "crawled": "2015-10-10T08:36:11.623+03:00", "highlightTitle": ""}