{"organizations": [], "uuid": "37b79e0e784ed2d544ffb11779ba0456160a438f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "http://d1u4oo4rb13yy8.cloudfront.net/facebook-ikorcfntay-1445242613.jpeg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/763434/shiv-sena-should-change-its-name-to-omland-security-twitter-roasts-the-protest-against-bcci", "country": "SG", "title": "'Shiv Sena should change its name to Omland security': Twitter roasts the protest against BCCI", "performance_score": 0, "site": "scroll.in", "participants_count": 1, "title_full": "'Shiv Sena should change its name to Omland security': Twitter roasts the protest against BCCI", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T17:48:00.000+03:00", "replies_count": 0, "uuid": "37b79e0e784ed2d544ffb11779ba0456160a438f"}, "author": "Scroll Staff", "url": "http://Scroll.in/article/763434/shiv-sena-should-change-its-name-to-omland-security-twitter-roasts-the-protest-against-bcci", "ord_in_thread": 0, "title": "'Shiv Sena should change its name to Omland security': Twitter roasts the protest against BCCI", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Social Media Buzz 'Shiv Sena should change its name to Omland security': Twitter roasts the protest against BCCI If it was a Ghulam Ali concert or a discussion on a book by a former Pakistan foreign minister KM Kasuri earlier, the party now disrupts a BCCI meeting to discuss a series with Pakistan. Scroll Staff · Today · 02:48 pm Shiv Sena is back to its favourite past time. On Monday morning, anti-Pakistan slogans were heard around the headquarters of the Board of Control for Cricket in Mumbai as hundreds of activists from the party stormed in and protested against a potential cricket series between India and Pakistan. The activists were demonstrating against BCCI President Shashank Manohar’s scheduled meeting with his Pakistan counterpart Shahryar Khan. Shiv Sena workers storm BCCI office in Mumbai, chant slogans against PCB Chief Shahryar Khan. pic.twitter.com/RAfgkPbUaP — ANI (@ANI_news) October 19, 2015 Only recently, Sena had prevented Pakistani ghazal singer Ghulam Ali from performing in Mumbai. Soon thereafter, last week, after threatening to hold a \"Sena-style protest\" against a discussion planned in Mumbai around a book written by former Pakistani foreign minister KM Kasuri, party activists smeared black ink on the face of Sudheendra Kulkarni, chairman of the Observer Research Foundation, which had organised the event.The Sena reaction was therefore in keeping with its anti-Pakistan stance as it objected to the proposed meeting between Manohar and Khan to discuss the possibility of a bilateral series in December, claiming that Pakistan is sponsoring terrorism against India.Senior BCCI official Rajiv Shukla, however, insisted that the BCCI would not cave in and the talks will be rescheduled to take place in Delhi on Tuesday. \"In no way will the dialogue be stopped. BCCI has never compromised with national interests,” Shukla said.Reports emerged soon, however, claiming that the talks were indeed cancelled .The ruling Bharatiya Janata Party which shares power with the Sena in the state also rushed in to condemn the act. In any democracy, there is no place for hooliganism-that cant be used to express one's opinions: MA Naqvi on #ShivSena 's protest", "external_links": [], "published": "2015-10-19T17:48:00.000+03:00", "crawled": "2015-10-19T13:34:52.206+03:00", "highlightTitle": ""}