{"organizations": [], "uuid": "80e465fd33bb193d07e99c98ccd045d045b5a157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30305253/a-look-at-grand-juries-1-to-consider-police-shooting-of-boy", "country": "US", "title": "A look at grand juries; 1 to consider police shooting of boy", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "A look at grand juries; 1 to consider police shooting of boy - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "80e465fd33bb193d07e99c98ccd045d045b5a157"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30305253/a-look-at-grand-juries-1-to-consider-police-shooting-of-boy", "ord_in_thread": 0, "title": "A look at grand juries; 1 to consider police shooting of boy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARK GILLISPIE\nAssociated Press CLEVELAND (AP) - Grand juries, panels of residents that decide if someone should be charged with a crime, have been part of the American legal system since the country was founded. Defense attorneys, bar associations and, increasingly, activists say grand juries have outlived their usefulness, especially after panels in Missouri and New York voted not to indict police officers in fatal encounters with black men. Many states no longer use them and make prosecutors decide whether someone should be charged criminally.\nGrand juries are required in Ohio, where one will decide if two white Cleveland police officers should be charged in the fatal shooting of Tamir Rice, a black 12-year-old boy carrying a pellet gun.\nSome questions and answers about grand juries:\n___\nWHAT IS A GRAND JURY?\nThe panel listens to evidence presented by prosecutors, asks questions if they choose and determines if criminal charges are warranted and what those charges should be. To obtain an indictment, prosecutors must convince grand jurors that it's likely someone has committed a crime. That threshold, known as probable cause, is less than what's required for a conviction, which is proof beyond a reasonable doubt.\n___\nHOW DO THEY WORK IN OHIO?\nIn Ohio, a grand jury is comprised of nine jurors and as many as five alternates selected from county voting rolls. Seven of the nine jurors must vote to indict. Cuyahoga County, the state's busiest Common Pleas jurisdiction with 12,000 new criminal cases filed last year, typically has two or three grand juries meeting simultaneously twice a week for eight hours. A grand jury in a small county might only meet once a week for a few hours.\n___\nWHAT DO JURORS SEE AND HEAR?\nProsecutors control what evidence grand juries see and who testifies before them. In Cuyahoga County, that evidence in most cases consists of a police officer reading from a report. Witnesses are sometimes questioned in more complicated cases. Prosecutors aren't required to present any evidence that might be favorable to a suspect. Last year, Cuyahoga County grand juries indicted more than 11,000 people while voting not to charge people 326 times.\n___\nWHY ARE THEY SECRET?\nGrand jury secrecy is rooted in English common law dating back centuries, though England stopped using grand juries in the 1930s. The panels are supposed to be secret to protect the identities of grand jurors and allow them to vote their conscience. It also protects witnesses who might otherwise be reluctant to testify and suspects whose reputations could be sullied even if a grand jury votes not to indict them. Grand jury transcripts are sealed and are made public only in the rarest of circumstances. Grand jurors are not allowed to discuss evidence or say how they've voted on a particular case.\n___\nWHY ARE THEY CONTROVERSIAL?\nCritics say they are \"rubber stamps,\" which has led to the oft-repeated criticism that a grand jury could indict a ham sandwich. The American Bar Association maintains that grand juries, especially at the federal level, no longer provide a safeguard against government overreach. Skeptics also say the secrecy saps public confidence. The common practice is for prosecutors to recommend charges after explaining the law to grand jurors.\n___\nWHAT WILL HAPPEN IN THE TAMIR RICE CASE?\nCuyahoga County Prosecutor Tim McGinty has vowed that the grand jury will see all the evidence his office has collected. The question remains whether McGinty or one of his assistants makes a recommendation on whether to indict Timothy Loehmann, the rookie officer who shot Tamir Rice within two seconds of a cruiser stopping within feet of the boy, or Frank Garmback, who drove the cruiser on Nov. 22, 2014. Rice family attorneys contend that McGinty has tipped his hand by releasing two expert reports that said the shooting was constitutional. McGinty says his office has reached no conclusions on whether charges should be filed.\n ", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T17:01:28.921+03:00", "highlightTitle": ""}