{"organizations": [], "uuid": "3cb60a5f5780dd6832185b44fe67ba74ee29cafe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/62/aa/442dc8474f0da8c46d0f89971167/151026-donald-trump-ap3-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/donald-trump-ford-mexico-215157", "country": "US", "title": "Donald Trump gets it wrong on Ford plants in Mexico", "performance_score": 0, "site": "politico.com", "participants_count": 14, "title_full": "Donald Trump gets it wrong on Ford plants in Mexico - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:16:00.000+02:00", "replies_count": 24, "uuid": "3cb60a5f5780dd6832185b44fe67ba74ee29cafe"}, "author": "Nick Gass", "url": "http://www.politico.com/story/2015/10/donald-trump-ford-mexico-215157", "ord_in_thread": 0, "title": "Donald Trump gets it wrong on Ford plants in Mexico", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump took credit Sunday for Ford Motor Company deciding not to build new plants in Mexico. The only issue with that: Ford is going ahead with its plans to build south of the border. \"Word is that Ford Motor, because of my constant badgering at packed events, is going to cancel their deal to go to Mexico and stay in U.S.,\" Trump tweeted Sunday, following up with another : \"Do you think I will get credit for keeping Ford in U.S. Who cares, my supporters know the truth. Think what can be done as president!\"\nTrump prefaced those tweets by sharing a link to an article on Prntly with the headline, \"Trump successfully pressures Ford to move Mexican plant to Ohio.\" The website, which bills itself as a \"is a full service print company with facilities throughout the United States\" with \"clients ... from a variety of backgrounds, parties, and industries,\" also features a blog section with articles on politics, business and show business.\n\"FORD LISTENED TO ME, GREAT!\" Trump tweeted.\nOther headlines on the site Monday included: \"Troy, NY man’s 'local' pumpkin filled with toxic Tropical spiders,\" \"PRNTLY read by Donald Trump, Carl Icahn, most popular Oct 2015,\" and \"Carson, JBush, Rubio ranked most “left wing” on Immigration of GOP.\"\nThe article referenced by Trump in his retweet cites a CNNMoney report (with no link) that the company is relocating its facility from Mexico to Youngstown, Ohio. A spokeswoman for the company told The Washington Post that the company does not have any plants in Youngstown.\nAs Northeast Ohio Media Group reported Monday, the GOP presidential candidate appears to have confused the automobile manufacturer's expansion plan south of the border with the company's decision to start production of medium-duty pickups that had previously been manufactured in Mexico. Production began four years after Ohio Gov. John Kasich, another presidential candidate, pushed tax incentives that included breaks for Ford's plant in Avon Lake, Ohio, about 90 miles from Youngstown.\nKasich fired back at Trump taking credit for the decision on Sunday night, releasing a statement in which he declared that his state brought back production jobs \"working as a TEAM.\"\n\"Our country needs real leadership and not empty, false rhetoric. Working as a TEAM, we brought Ford production jobs back from Mexico to Ohio years ago. That's how things really get done. Hard work and teamwork brings results for the people,\" Kasich said. \"Our nation needs a leader with a record of actually delivering for all of us, that's why I'm running for President.\"\nA spokeswoman for his campaign did not immediately respond to a request for comment from POLITICO.\nIn a statement from Ford tweeted by the Detroit News' David Shepardson, the company made clear that it had not spoken with Trump.\n\"We decided to move the F-650 and F-750 medium-duty trucks to Ohio Assembly in 2011, long before any candidates announced their intention to run for U.S. president,\" it said, noting $10.2 billion in investment in its American plants and nearly 25,000 American workers hired in the past four years.\nFull @ford statement on @realDonaldTrump pic.twitter.com/lDTb8AWNUT\n— David Shepardson (@davidshepardson) October 26, 2015\n<div", "external_links": ["https://twitter.com/realDonaldTrump/status/658381595049611265", "https://twitter.com/realDonaldTrump/status/658382301324251136", "http://www.cleveland.com/open/index.ssf/2015/10/donald_trump_erroneously_takes.html", "https://twitter.com/Ford", "https://twitter.com/realDonaldTrump", "https://twitter.com/realDonaldTrump/status/658380323080806400", "https://twitter.com/davidshepardson/status/658646550994952192", "https://t.co/lDTb8AWNUT"], "published": "2015-10-26T17:16:00.000+02:00", "crawled": "2015-10-26T18:06:43.763+02:00", "highlightTitle": ""}