{"organizations": [], "uuid": "681a4b5dc8cb02f4d8401c0f0780c5a9106765ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/national/us/", "section_title": "U.S.: Politics, Crime, Weather and More - seattlepi.com", "url": "http://www.seattlepi.com/news/us/article/Police-Man-who-taped-in-crashed-car-tried-to-6589434.php", "country": "US", "title": "Police: Man who taped in crashed car tried to bribe driver", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Police: Man who taped in crashed car tried to bribe driver - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "681a4b5dc8cb02f4d8401c0f0780c5a9106765ca"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/us/article/Police-Man-who-taped-in-crashed-car-tried-to-6589434.php", "ord_in_thread": 0, "title": "Police: Man who taped in crashed car tried to bribe driver", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LORAIN, Ohio (AP) — Police say an Ohio man charged with trespassing after opening the door of a crashed car to record cellphone video of the grisly scene inside tried to bribe the teenage driver in the fatal crash.\nLorain police in northeast Ohio said they will pursue a felony bribery charge against Paul Pelton , 41, of Lorain. Pelton's attorney didn't immediately return a phone message Sunday.\nPelton earlier pleaded not guilty to a misdemeanor vehicle trespass charge stemming from the July 13 single-car crash. A 17-year-old passenger suffered fatal injuries after the car went airborne at a railroad crossing.\nPolice said the driver's mother notified them last week that Pelton came to their home. Pelton allegedly offered to claim that police caused additional injuries to the driver's friend if the driver would tell police he had permission to enter the car and record the crash scene.\nThe crash remains under investigation and the juvenile driver, who was badly injured, could still face charges.\nDetective Buddy Sivert said an officer was trying to save the injured youth from the burning car. He said the officer acted in good faith.\nPolice said Pelton contacted the driver through social media and said he had \"important information\" about the case. Police said the teen told them that Pelton was at his house for 20 to 30 minutes and challenged news media accounts of his actions.\nPolice have said he tried unsuccessfully to sell the video to several news organizations. They said it was posted to Facebook, but later removed.\n\"Why he would think it is a good idea to confront a 17-year-old kid who is going through all this turmoil in his life — losing his best friend, being severely injured and potentially facing charges — and have this juvenile lie to benefit his misdemeanor case, is beyond belief,\" Sivert told The Morning Journal of Lorain.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T00:42:44.990+02:00", "highlightTitle": ""}