{"organizations": [], "uuid": "81bc80bd74ee9cba28a434377990c9c76f8c7008", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30224066/chicago-extends-warm-welcome-to-the-national-society-of-hispanic-mbas-at-the-2015-nshmba-conference-career-expo", "country": "US", "title": "Chicago Extends Warm Welcome to the National Society of Hispanic MBAs at the 2015 NSHMBA Conference & Career Expo", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Chicago Extends Warm Welcome to the National Society of Hispanic MBAs at the 2015 NSHMBA Conference & Career Expo - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "81bc80bd74ee9cba28a434377990c9c76f8c7008"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30224066/chicago-extends-warm-welcome-to-the-national-society-of-hispanic-mbas-at-the-2015-nshmba-conference-career-expo", "ord_in_thread": 0, "title": "Chicago Extends Warm Welcome to the National Society of Hispanic MBAs at the 2015 NSHMBA Conference & Career Expo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " National Society of Hispanic MBAs - National Office\nCHICAGO , Oct. 9, 2015 /PRNewswire-USNewswire/ -- Today the National Society of Hispanic MBAs (NSHMBA) continutes hosting their 2015 NSHMBA Conference & Career Expo at the McCormick Place in Chicago , the city that embraced its kick-off event 25 years ago.\n\"Welcoming us from the airport to the very street of the NSHMBA event, it is evident the City of Chicago wants NSHMBA to feel at home,\" said NSHMBA Interim CEO Thomas Savino . \"We are so fortunate to have the support of an amazing host chapter who has served as an extension of the national office, supporting the event as well as the NSHMBA mission.\"\nThursday, October 8 th , was the first full day of the event and offered attendees the chance to attend over 12 hours of Professional Developments and ample opportunity to network with sponsors at the Corporate Networking Reception and other events.\nNortheastern Illinois University (NEIU) is nestled in Chicago's north side, a federally designated Hispanic-Serving Institution and has partnered with NSHMBA as Academic Co-Lead. President Sharon Hahs of NEIU said, \"As the number of Hispanic business leaders grows, participation in conferences such as this one becomes all the more critical--fostering cultural understanding, pursuing professional development and taking pride in your heritage.\"\nAlso on Thursday, the four finalist teams in the NSHMBA Case Competition competed for first place. Congratulations to the Bubbly Solutions team from the University of South Carolina Darla School of Business for winning the 2015 NSHMBA Case Competition sponsored by PepsiCo.\n\"The NSHMBA conference continues through Saturday with many more programs and highly anticipated speakers,\" said NSHMBA Interim CEO Thomas Savino . \"NSHBMA is excited to be hosting some amazing and sought-after speakers for today's marquee events.\"\nSpecial Guest Speakers for Friday, October 9 th include Award-Winning Star of Ugly Betty Tony Plana to speak at 8:30am and CEO of Johnson & Johnson Alex Gorsky to speak at noon.\nFollowing the Friday Breakfast will be the Ribbon Cutting Ceremony taking place at the entrance of the Exhibit Hall A1-South at 9:45 a.m. This is the official opening of the Expo floor where more than 5,000 attendees will gather to meet with over 140 exhibitors to meet with future employers, future graduate programs and build life-changing relationships.\nClosing the NSHMBA Conference Saturday evening, October 10 th , is the NSHMBA Gala and Brillante Awards, one of the premier highlights of the entire event. This event is a celebration of the NSHMBA's history, showcasing milestones, rewarding achievements, and recognizing leaders who have contributed to the Hispanic Community. This reception will begin at 6:30pm followed by dancing and entertainment at 10pm .\nMore information about the 2015 NSHMBA Conference & Career Expo in Chicago - including how to register for this event - can be found at www.nshmbaconference.org . For more information on sponsoring or exhibiting contact Corporate Relations at corporaterelations@nshmba.org .\nAbout the 2015 NSHMBA Conference & Career Expo\nThe NSHMBA Conference and Career Expo is a 3-day event that brings thousands of recruiters and hiring managers from Fortune 500 companies together for the purpose of building and fortifying connections within the Hispanic community through a variety of recruiting opportunities. This year we are excited to be sponsored by Nationwide, the Lincoln Motor Company, Northeastern Illinois University (NEIU) and GMAC. MBA students, graduates and professionals will be able to explore top-choice job opportunities and can even get hired on the spot. Attendees will also be able to benefit from professional development, on-site career management services, and many networking events. For more information on the 2015 NSHMBA Conference & Career Expo, visit www.nshbmaconference.org .\nAbout the National Society of Hispanic MBAs\nNational Society of Hispanic MBAs (NSHMBA): formed in 1988, as a non-profit organization aiming to empower Hispanics to achieve their fullest educational, social, and earning potential. NSHMBA serves the Hispanic community and its constituents through a national network of 40 chapters and hundreds of community partners across the United States and Puerto Rico covering 100 percent of the Hispanic community. NSHMBA is dedicated to building and advancing Hispanic leadership, advocating the pursuit of higher education and providing its members with world-class professional development and career management programs. For more information on NSHMBA, visit www.nshmba.org .\nConnect with NSHMBA National on Twitter and Facebook and LinkedIn.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/chicago-extends-warm-welcome-to-the-national-society-of-hispanic-mbas-at-the-2015-nshmba-conference--career-expo-300157235.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DC24529&Transmission_Id=201510090812PR_NEWS_USPR_____DC24529&DateId=20151009", "http://www.xmlnews.org/ns/", "http://nshmbaconference.org/", "http://www.prnewswire.com/news-releases/chicago-extends-warm-welcome-to-the-national-society-of-hispanic-mbas-at-the-2015-nshmba-conference--career-expo-300157235.html", "http://www.nshmba.org/", "http://www.nshbmaconference.org/"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T16:42:07.179+03:00", "highlightTitle": ""}