{"organizations": [], "uuid": "d14b31cdea2209c2727239d786843cbb3be211f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30270848/minnesota-dental-association-appoints-new-executive-editor-to-northwest-dentistry-journal", "country": "US", "title": "Minnesota Dental Association Appoints New Executive Editor To Northwest Dentistry Journal", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Minnesota Dental Association Appoints New Executive Editor To Northwest Dentistry Journal - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "d14b31cdea2209c2727239d786843cbb3be211f2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30270848/minnesota-dental-association-appoints-new-executive-editor-to-northwest-dentistry-journal", "ord_in_thread": 0, "title": "Minnesota Dental Association Appoints New Executive Editor To Northwest Dentistry Journal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Minnesota Dental Association\nMINNEAPOLIS , Oct. 15, 2015 /PRNewswire-USNewswire/ -- The Minnesota Dental Association recently appointed Dr. John Lueth as its new executive editor for the Northwest Dentistry Journal. Northwest Dentistry is the association's peer-reviewed professional journal, featuring scientific and clinical research articles, as well as practice management and regulatory issues guidance. It is published bi-monthly and distributed to MDA member dentists and other dental community subscribers.\nDr. Lueth will assume his new position on January 1, 2016 , succeeding Dr. William Stein , who is retiring in December. Dr. Stein served as an editor with Northwest Dentistry for 30 years, first as its district news editor from 1985 to 1999 and then its executive editor from 1999 to 2015. Under his direction, the journal won numerous publication awards over the years for its quality journalism, creative presentation, and depth of clinical research reporting.\nDr. Lueth practices general dentistry in Bemidji, Minnesota , and has been affiliated with Northwest Dentistry for many years, having served as an associate editor for his Northwestern District Dental Society with regular contributions to the journal. He has also served as a trustee to the MDA Board of Trustees for the past five years and, in that capacity, as a Board liaison to the journal's Editorial Advisory Board. \"Dr. Lueth is an experienced dental practitioner, an active leader in our association, and a thoughtful and creative writer, making him an excellent choice to lead our journal in the future,\" stated Dr. Peter Cannon , MDA president. \"We look forward to working with him to continue the tradition of excellence in dental journalism that Northwest Dentistry has always stood for.\"\nThe Minnesota Dental Association is the voice of dentistry in Minnesota , representing over 70% of practicing dentists. It is committed to the highest standards of oral health and access to care for all Minnesotans.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/minnesota-dental-association-appoints-new-executive-editor-to-northwest-dentistry-journal-300160630.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC29735&Transmission_Id=201510151401PR_NEWS_USPR_____DC29735&DateId=20151015", "http://www.prnewswire.com/news-releases/minnesota-dental-association-appoints-new-executive-editor-to-northwest-dentistry-journal-300160630.html", "https://www.mndental.org/dentist_home/"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T02:33:18.624+03:00", "highlightTitle": ""}