{"organizations": [], "uuid": "7cb2a06081ac0633e285a814527b3841698fa866", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.houstonpress.com", "main_image": "http://images1.houstonpress.com/imager/u/original/7865618/kprcscreenshot.jpg", "site_section": "http://www.houstonpress.com/news/best-of", "section_title": "Houston, Texas News: Politics, Crime, Sports, Marijuana and Education Journalism | Houston Press", "url": "http://www.houstonpress.com/news/defense-victim-should-have-known-shed-been-drugged-and-sexually-assaulted-7865616", "country": "US", "title": "Defense: Victim Should Have Known She'd Been Drugged and Sexually Assaulted", "performance_score": 0, "site": "houstonpress.com", "participants_count": 1, "title_full": "Defense: Victim Should Have Known She'd Been Drugged and Sexually Assaulted | Houston Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:00:00.000+03:00", "replies_count": 0, "uuid": "7cb2a06081ac0633e285a814527b3841698fa866"}, "author": "Michael Barajas", "url": "http://www.houstonpress.com/news/defense-victim-should-have-known-shed-been-drugged-and-sexually-assaulted-7865616", "ord_in_thread": 0, "title": "Defense: Victim Should Have Known She'd Been Drugged and Sexually Assaulted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "screenshot, KPRC FBI agents were waiting for Henri Morris when he got to Bush Intercontinental on February 27, 2012. By that time, agents had learned about the software company CEO's out of town trips with younger female employees. They'd heard how Morris insisted on pouring the women drinks that tasted unusually, bitterly strong. They'd been told how women who traveled with Morris kept blacking out.\nWhen agents searched Morris's luggage that day, they found what prosecutors would later call his “special little rape kit”: a label-less prescription pill bottle containing commonly-used date-rape drugs (Ambien, Oxazepam and Benedryl), two small Jack Daniel's bottles filled with clear sugar-water (to dissolve the pills and cut the bitter taste, prosecutors suspected), and two different types of erectile dysfunction pills.\nInvestigators told A.F., as she's known in federal court records, about their discovery not long after she quit her short-lived marketing job with Edible Software, a Houston tech company Morris founded. She left Edible, however, when a business trip Morris had invited her on took a strange, dark turn. The memory lapses, waking up naked on her hotel bed, feeling sore in her “female regions,\" it all started to make sense when agents contacted her to say they'd discovered a \"rape kit\" and nude, sexually explicit photos of her in Morris's possession—she is clearly passed out in the photos, prosecutors say.\nIn December 2013, A.F. filed her lawsuit against Morris and Edible Software in a local civil court, arguing both Morris and the company were liable for the assault and invasion of her privacy. And in their fight to avoid paying A.F., or to at least limit the damage, Morris's legal team appears to have channeled the confusion and emotional damage that plagues victims of drug-facilitated sexual assault as a defense tactic.\nFirst, they cited a two-year statute of limitations for such lawsuits, hoping to toss A.F.'s case on the grounds that she must have known she was drugged and sexually assaulted before the FBI presented her evidence of it. In a ploy to limit the damages Morris's company might have to pay out, Morris, through his attorney, has attempted to classify what happened to A.F. (and, according to prosecutors, many other victims) as an instance of workplace sexual harassment, which would limit the amount his company might have to pay.\nRelated Stories Prosecutors Call Former Software Company Executive a \"Calculated, Choreographed Sexual Predator\" UPDATE How Will Henri Morris Defend Himself Against Claims He Drugged and Molested an Employee He's Already Admitted to Drugging and Molesting? And this month, Morris's attorney filed a motion to force his victim to submit to an “independent mental examination” by a psychologist of his choosing, claiming the woman's “mental condition is in controversy.” Morris's civil attorney, Gregg Rosenberg, says the mental exam would help him determine, as he put it, how much of the victim's emotional damage is to blame on what Morris did to her. He also says he wants to determine whether she really didn't know Morris drugged and assaulted her before law enforcement told her they had evidence she'd been drugged and assaulted.\n“Not all of her stress is 100 percent attributable to what happened to her with Henri Morris,” he told the Houston Press this week. And, secondly, “she brought the case way too late.”\nRosenberg says this is all just ordinary legal wrangling, which it very well might be. But Morris's case is far from ordinary, considering he's already admitted to drugging and assaulting the plaintiff in federal criminal court. Twice.\nIt was last December that Morris sat slumped over in his chair at the defense table inside the federal courthouse downtown, visibly shaking as his attorney quietly walked him through the plea deal that had been arranged with federal prosecutors. It wasn't that much different from the 22-page agreement he'd signed just the year before, admitting to drugging and molesting employees on business trips to New York, Pennsylvania, New Jersey and New Orleans over the course of two years. (The judge ultimately rejected that first plea, which stipulated that Morris serve no more than a year behind bars, after three victims testified during a sentencing hearing about being assaulted by Morris).\nAny remorse Morris might harbor for his actions has been overshadowed by the self-interest on display both in court and in legal filings. Before he signed the agreement with prosecutors, admitting to transporting A.F. between Texas and New Jersey “with intent to engage in sexual activity,” he grimaced in court, heaved and appeared on the verge of vomiting, and audibly, repeatedly muttered at the defense table “ten years,” the maximum sentence that could be imposed against him.\nDuring his sentencing hearing in April, Morris's criminal defense attorney Dan Cogdell (who, coincidentally, was just hired to defend Attorney General Ken Paxton against allegations of securities fraud) argued, among other things, that Morris did not necessarily admit to “a sexual act.” Federal prosecutor Sherri Zack was incensed.\n“I think it's fantastical to suggest that somehow this woman who was drugged by the Defendant took off her own clothes, put her hands inside her own vagina and, conveniently, Mr. Morris was there snapping pictures of it,” Zack told the judge. “I mean, that's not what the facts support. I don't think that there's any other conclusion to draw, nor do I think that a jury would have drawn any other conclusion other than Mr. Morris removed her clothes, put her hands on her vagina specifically to expose her genitalia and took these pictures for his own sexual gratification. It doesn't make sense that she would do this to herself in that state. I mean, she couldn't resist what he was doing to her.” (Judge Melinda Harmon sentenced Morris to the maximum of 10 years in prison, according to court records.)\nIn the pending civil case (which was set for trial next month but has since been postponed, again), Morris's legal team has attempted to use A.F.'s jumbled memory of that night—a consequence of the date-rape drugs Morris has already admitted to giving her—against her. It's a legal strategy that seems to highlight the very reason drug-facilitated sexual assault cases are often difficult, if not impossible, to prosecute—except for when you catch a suspect with a “rape kit” and photos of nude, incapacitated women on his hard drives, that is.\nIn depositions, Rosenberg has questioned whether A.F. is even in “a position to tell us whether or not what happened between you and Henri that night was consensual … since you don't remember what you consented to and what you didn't consent to.”\nLast week a judge dismissed without prejudice Rosenberg's motion to compel Morris's victim to take a mental health exam. Which means Rosenberg can still file a more detailed request with the court, which, from the sound, he's planning on doing. Ultimately, Rosenberg pointed to what he calls inconsistent and confused statements from the victim about what exactly happened to her, what she remembers from the night she woke up naked in her hotel room, and when exactly it dawned on her that her boss might have drugged and assaulted\nJeff Todd, A.F.'s attorney, wouldn't talk to us about the case while trial is pending, but in legal filings he points to a simple explanation for his client's hazy memory and confusion: Morris drugged her before he assaulted her.\nIt's something Morris has already admitted to in criminal court, twice. Whether that drug-induced confusion will help Morris and his company avoid paying his victim in civil court remains to be seen.\nContact: Michael Barajas Follow: Houston Press Houston Press", "external_links": ["http://www.click2houston.com/news/ceo-accused-of-raping-women-on-business-trips/25097340", "https://www.facebook.com/HairBallsNews", "http://www.twitter.com/houstonnews_"], "published": "2015-10-22T16:00:00.000+03:00", "crawled": "2015-10-22T16:19:49.704+03:00", "highlightTitle": ""}