{"organizations": [], "uuid": "57c51d8d1d1ffaf89262fb8c1295ae2b3e4dc226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "varnished.dailyecho.co.uk", "main_image": "http://www.dailyecho.co.uk/resources/images/4315594/", "site_section": "http://varnished.dailyecho.co.uk//news/politics/rss/", "section_title": "Daily Echo | Politics", "url": "http://varnished.dailyecho.co.uk/news/politics/13842346.Is_this_the_end_of_council_housing_in_Southampton_/?ref=rss", "country": "GB", "title": "Is this the end of council housing in Southampton?", "performance_score": 0, "site": "dailyecho.co.uk", "participants_count": 0, "title_full": "Is this the end of council housing in Southampton?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T06:00:00.000+03:00", "replies_count": 0, "uuid": "57c51d8d1d1ffaf89262fb8c1295ae2b3e4dc226"}, "author": "", "url": "http://varnished.dailyecho.co.uk/news/politics/13842346.Is_this_the_end_of_council_housing_in_Southampton_/?ref=rss", "ord_in_thread": 0, "title": "Is this the end of council housing in Southampton?", "locations": ["Southampton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "45 comments \nIT IS the multi-million-pound project supposed to breathe new life into a Southampton community. \nThe Townhill Park regeneration scheme was designed to transform the run-down 1960s estate in the east of the city into homes fit for the 21st century. \nCivic bosses started moving people out of the homes three years ago in preparation for work to begin. \nYet it is only now that a formal planning application has been handed in and today Labour council chiefs admitted that it is unlikely they will be able to build even a single council house as part of the project. \nThey have also warned that ambitious plans to completely overhaul all the city’s dilapidated estates will have to be scaled back. \nAngry opposition Conservatives have rounded on Labour accusing them of delaying too long because of “political dogma” and misleading tenants. \nLabour is blaming its climbdown on social housing rent cuts announced by Chancellor George Osborne. \nThey say it will leave the city’s housing budget £493million worse off over the next 30 years. \nHowever the Tories say Labour’s figures are “wildly inaccurate” and they are trying to hide behind the policies for their failures in getting projects off the ground. Promoted stories \nEarlier this year Mr Osborne announced that social housing rents would be cut by one per cent each year until 2021, saying the move would reduce the housing benefit bill and end “ever higher housing benefit chasing up ever higher rents in the social housing sector”. \nSince then work has been ongoing at the city council to work out how much the move and other changes to benefits and the right to buy scheme will cost the authority. \nLabour housing boss Cllr Warwick Payne, pictured below, says the council’s housing budget will be £33million worse off over the next four years - and £493m over the next 30 years. \nIt comes after the planning application for the regeneration of Townhill Park was handed in, which could see 675 new homes built if it is approved. \nThe scheme has been at the centre of a fierce battle between Labour and the Conservatives, who have called for Cllr Payne to resign over claims he has “chopped and changed” its funding, wasting millions of pounds. \nCllr Payne rejected the claims and says he is committed to completing the project, but has admitted there will now have to be changes to the way it is delivered. \nOriginally the plan was to replace the 380 council homes on the site with 675 properties, of which 450 would be new council properties. \nThe planning application contains a detailed bid to build the first 276 homes on the site in buildings of up to seven storeys, with the rest of the homes and a retail store requiring further permission. \nIt is hoped demolition work will start later this year so building work can begin next year. \nHowever Cllr Payne says the Government changes mean there is a chance that there will not be a single council home on the estate, with 236 affordable homes offered through shared ownership or as discounted first-time buyer homes. \nHe says the funding model for Townhill Park will be through a new development company set up by the council which will allow it to borrow at cheaper rates. \nHe said: “It’s not the case that estate regeneration is at risk. The bottom line is that Townhill Park will be rebuilt, we wouldn’t be seeking planning permission if that was the case. What the Government has ensured is that it will be certainly impossible to replace council homes. \n“We want to build as soon as possible but we are having to redraw some of our figures because we were looking to build new council homes and the Government has just made that more difficult.” \nMillbrook and Maybush is the next estate lined up for regeneration and Cllr Payne said earlier this year that there was an aspiration to overhaul Weston , Thornhill and Northam too. \nBut he said those plans will also have to change, saying: “The Labour administration is still committed to estate regeneration. There is money set aside for Millbrook and Maybush. \n“But while we were looking at large schemes to knock down old shopping parades and replace them with homes, what we are now looking to see if improving on existing homes and infilling, that is using vacant sites which are very poorly used. \n“It would be fair to say that nobody will hold out hope of every estate in Southampton being completely revamped - those hopes died at the hands of George Osborne. \n“There are 10,000 Sotonians who need a house and the Chancellor has made it extremely difficult to help them, which makes me feel very sad.” \nTory opposition leader Jeremy Moulton, pictured below, described the figures as “wildly inaccurate”, saying they assumed inflation of 2.5 per cent when it was currently at zero. \nHe added: “This it total nonsense and it’s another excuse on top of other excuses for not progressing the estate regeneration programme. \n“It is true to say there will be a squeeze on council housing and housing association rents but that by no means should affect plans for estate regeneration.” \nHe said Labour had failed to set aside targets to save money in the housing revenue account, adding: “The other side of this is that people will have to pay less in their rents. \n“Townhill Park’s existing funding model didn’t stack up so it’s no surprise there might not be council homes there, we have said for three years that you need to work with partners and if you try to own everything you won’t have enough money. \n“I think they are just hiding behind this because they don’t have a funding model that stacks up.” \nThe warning that council houses may not be re-built in Townhill Park comes three years after the Conservatives first introduced the idea of renovating the area. \nBut their plan was to work with housing authorities to share the cost and build more council houses as opposed to Labour, who came into power and reintroduced the plans but wanted to use council funding. \nRoyston Smith , MP for Southampton Itchen , pictured below, added: “I’m really quite angry about it, they should be ashamed. It’s disgusting they kicked these people out of their homes nearly three years ago and haven’t been working on the area and now they have realised they can’t offer council housing. \n“What they are choosing to do is something we actually suggested during debates about how the council could fund the project. We told them they could never do it when they drew up our plans, we said they wouldn’t have enough money. \n“The only way to regenerate a council estate in Southampton is to work in partnership with the private sector to create a diverse mix of tenure. In the time since they threw people out of their homes the prices for everything down to materials and construction have gone through the roof. \n“We begged them not to go down this route at the beginning but it was political dogma, they wanted to build and own 450 council houses but that just doesn’t work without the help of the private sector. \n“All those council tenants who were promised a chance to return to their property won’t be able to either, they have misled these people and it’s a disgrace, all to make a political point which they failed to make anyway.” \nCouncil leader Simon Letts, pictured below, said: “The Government has made their position very black and white in regards to affordable housing in saying they would be investing in delivering houses that are reduced costs and not in council accommodation. We are now investigating and it is not certain that we won’t be able to build council houses but that seems to be the direction it is heading. \n“Housing associations are in as bad a position as us in terms of affordable housing. The Conservative plans wanted to build the homes and give them to housing associations to run but we wanted to keep it in the public sector, with all the money going back into the public. \n“The Conservative figures for the plans did not stack up either. They were relying on the housing associations, which are also struggling with their business plans. Share article \n“We were completely shocked by the Government’s decision and I believe it was a panicked attempt to deliver the £12billion of benefit cuts which they said they would during the election but didn’t think they would have to fulfill. \n“All the residents who lived in the flats have been relocated to other council properties so it should not affect them.” Promoted Stories Is this the end of council housing in Southampton? Sorry, an error occurred. Please sign in or register to leave a comment Remember that you are personally responsible for what you post on this site and must abide by our site terms . Do not post anything that is false, abusive or malicious. If you wish to complain, please use the 'Report' link underneath the comment. Post comment Sign in or Register to get comment alerts. Juanhater 5:23am Tue 13 Oct 15 \nUnfortunately most of the tenants wont be fit for the 21st century, same old same old, within 10 years another ghetto. Unfortunately most of the tenants wont be fit for the 21st century, same old same old, within 10 years another ghetto. Juanhater \nUnfortunately most of the tenants wont be fit for the 21st century, same old same old, within 10 years another ghetto. Report Score: 13 bigfella777 5:51am Tue 13 Oct 15 \nIn that case pull all the boards off the flats that are already there give them a lick of paint and get them rented out , how much money have they lost by mothballing them? In that case pull all the boards off the flats that are already there give them a lick of paint and get them rented out , how much money have they lost by mothballing them? bigfella777 \nIn that case pull all the boards off the flats that are already there give them a lick of paint and get them rented out , how much money have they lost by mothballing them? Report", "external_links": [], "published": "2015-10-13T06:00:00.000+03:00", "crawled": "2015-10-14T14:56:15.901+03:00", "highlightTitle": ""}