{"organizations": [], "uuid": "9cc1633df3ba834f2b614e11f7dfd015371db50e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9043386_G.jpg", "site_section": "http://www.cbs8.com/category/169585/ap-political-news-video", "section_title": "AP Political Video - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30288205/police-suicide-at-end-of-conference-of-alaska-natives", "country": "US", "title": "Police: Suicide at end of conference of Alaska Natives - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Police: Suicide at end of conference of Alaska Natives - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "9cc1633df3ba834f2b614e11f7dfd015371db50e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30288205/police-suicide-at-end-of-conference-of-alaska-natives", "ord_in_thread": 0, "title": "Police: Suicide at end of conference of Alaska Natives - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANCHORAGE, Alaska (AP) - Alaska Natives rocked by a recent rash of suicides in a rural village were shattered Saturday when a man jumped three floors to his death at the state's largest gathering of ingenious people in the state.\nPolice have released few details, but a spokesman confirmed the death was a suicide just as the closing session was about to start at the Dena'ina Convention Center in downtown Anchorage. The death marred the Alaska Federation of Natives conference, and organizers canceled the closing banquet Saturday night.\nAnchorage Police Department spokeswoman Renee Oistad said the person jumped about 3:30 p.m. from the third floor of the open-air concourse inside the cavernous building in downtown Anchorage. Oistad told the Alaska Dispatch News that the death was a suicide, but she gave few other details.\nThe high-profile death comes as Alaska leaders struggle with a high rate of suicides in the nation's northernmost state, including a cluster of recent suicides of four residents in their 20s in the western Alaska village of Hooper Bay.\nThe weeklong Alaska Federation of Natives conference draws Eskimo, Aleut and Indian leaders from across the nation's largest state to focus on indigenous issues. The annual gathering attracts the shakers and movers in Alaska, and includes speeches by Alaska's governor and members of its congressional delegation.\nThe death happened shortly before the last agenda items in the weeklong conference, which starts with the traditional gathering of Alaska Native elders and youth.\nOn Thursday, speakers at the conference lamented the disproportional high rate of suicides among Alaska natives.\nKippy Lanz of Anchorage said that she saw the incident happen.\n\"He jumped,\" Lanz told the Dispatch News. \"He went right over the railing and went down ... headfirst. It happened so fast.\"\nLaura Avellaneda-Cruz said she also witnessed the fall. She told the newspaper that she was standing on the west side of the third floor when the scene began to unfold.\n\"I saw him climb over and in that quarter of a second hoped it was a reckless joke and that he'd climb back onto the floor, but then I saw him let go and fall, then the sound, then the screams,\" Avellaneda-Cruz said. \"My memory of it, though it is vague, is that there were two other people sort of near him trying to stop him, but they couldn't get to him in time to physically stop him.\"\nShortly before 4 p.m., firefighters and police officers surrounded the body with black curtains. Security also put panels around the edge of the balcony. Police and security evacuated people from the first floor of the convention center and weren't letting people back inside.\nAnchorage police Sean Keating told the Dispatch News that the person who died Saturday \"looks older than 25. Appears to be a Native male adult with gray in his hair. He had a satchel and he had glasses. Several people said they saw him get on the edge and go over. No one was around him.\"\nWhen asked about the person's identity, Keating said: \"We're waiting for the medical examiner to come. We cannot manipulate the body to look for ID until the medical examiner comes. It's sounding like a suicide. He was not pushed or injured. He just went up to it and jumped. I won't say it's a suicide, but at the same time, there's not a lot of other signs saying it was something else.\"\nKeating added that the incident was probably captured on video and police will examine it.\nDelegates in the concourse outside the main assembly room rushed to look over the clear glass railing. Some cried and hugged each other.\nA banquet that the group planned to hold at the convention center Saturday evening was cancelled.\nCo-chairwoman Ana Hoffman of Bethel announced the death to delegates. She asked for a moment of silence before leading a prayer.\nHoffman said a similar death has occurred before at the three-story convention center, which hosted President Barack Obama for a global warming conference in August.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T11:15:11.355+03:00", "highlightTitle": ""}