{"organizations": [], "uuid": "e7141bbeb0c061030ea8816beb9b999da4e8d3fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theatlantic.com", "main_image": "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/AP_628562667612/facebook.jpg?1445444587", "site_section": "http://www.theatlantic.com/writers/", "section_title": "The Atlantic — News and analysis on politics, business, culture, technology, national, international, and life – TheAtlantic.com", "url": "http://www.theatlantic.com/politics/archive/2015/10/biden-bows-out/411721/", "country": "US", "title": "Joe Biden Will Not Run for President", "performance_score": 1, "site": "theatlantic.com", "participants_count": 6, "title_full": "Joe Biden Will Not Run for President - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T20:24:00.000+03:00", "replies_count": 6, "uuid": "e7141bbeb0c061030ea8816beb9b999da4e8d3fc"}, "author": "Russell Berman", "url": "http://www.theatlantic.com/politics/archive/2015/10/biden-bows-out/411721/", "ord_in_thread": 0, "title": "Joe Biden Will Not Run for President", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vice President Joseph Biden on Wednesday said he would not run for president in 2016, ending months of speculation about whether he would challenge former Secretary of State Hillary Clinton for the Democratic nomination.\nBiden made his long-awaited announcement in the White House Rose Garden with President Obama standing by his side. Speculation about his decision had reached an almost comical pitch in recent days, as his camp repeatedly left allies and reporters alike with the impression that he would make a dramatic entrance into the race.\nAs recently as Tuesday, the vice president delivered a speech seen as a none-too-subtle dig at Clinton, the Democratic frontrunner and his former colleague in the Obama Cabinet and before that, in the Senate. He challenged Clinton’s account of the recommendations that the two of them made to Obama before the president ordered the raid that killed Osama bin Laden in 2011, and he implicitly criticized her remark during the first Democratic debate that Republicans were her “enemies.”\nBiden considered running just months after the tragic loss of his eldest son, Beau, who succumbed to brain cancer in the spring and reportedly urged him to make a third and final bid for the presidency. But all along, the vice president acknowledged that with his family grieving, he might not be able to make a decision in time for the 2016 race.\nUltimately, Biden determined that the window had closed for him.\n“Unfortunately, I believe we’re out of time, the time necessary to mount a winning campaign for the nomination and the presidency,” he said on Wednesday.", "external_links": [], "published": "2015-10-21T20:24:00.000+03:00", "crawled": "2015-10-21T19:33:28.915+03:00", "highlightTitle": ""}