{"organizations": [], "uuid": "a6e1b35641f1db442169f42de76b71f8db6a75d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz/taxonomy/term/3/all/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/nation-lisa-owen-interviews-labour-leader-andrew-little/5/235346", "country": "US", "title": "On The Nation: Lisa Owen interviews Labour leader Andrew Little", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "On The Nation: Lisa Owen interviews Labour leader Andrew Little", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:05:00.000+03:00", "replies_count": 0, "uuid": "a6e1b35641f1db442169f42de76b71f8db6a75d9"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/nation-lisa-owen-interviews-labour-leader-andrew-little/5/235346", "ord_in_thread": 0, "title": "On The Nation: Lisa Owen interviews Labour leader Andrew Little", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saturday, 24 October, 2015 - 12:50 \nOn The Nation: \nLisa Owen interviews Labour leader Andrew Little in Beijing \nLittle says a decision on whether deputy leader Annette King will stay beyond the 2017 election \"hasn’t been the subject of any discussion between us\" \nSays it’s a matter for King to decide but \"long-serving MPs do get to a point eventually where, I guess, it’s time for them to go\" \nLittle says Chinese Vice President Li Yuanchao raised land sales issue and seemed to understand importance of NZ controlling its own farmland. \nSays talked about foreign investment that \"we do welcome\" like Chinese investment in dairy processing but Li understood \"sensitivities\" around house sales to overseas buyers \nLisa Owen: Labour leader Andrew Little is visiting China, where he’s meeting New Zealand business people and government officials. He’s just met with Chinese vice-president Li Yuanchao in Beijing, where it’s very early in the morning. Thanks for joining us, Mr Little. \nAndrew Little: Very nice to be here. \nI just want to ask what did you talk about in this meeting with the vice president? \nWell, it was quite an extended meeting. It went way over time, but we talked about the importance of the relationship between the two countries, talked about the relationship between the Labour Party and the Communist Party, talked about the free-trade agreement because we’ve got the upgrade being talked about there at the moment. We talked about a couple of sensitive issues. I raised the issue about land sales, both house sales and farm sales and how New Zealanders are feeling increasingly sensitive about that, and also the issue about human rights, and I raised that with Vice President Li in the same way that I raised it with President Xi Jinping at the end of last year in New Zealand and just say that New Zealand’s expectation of countries they are getting closer to is that we see that their people are treated fairly and properly and good judicial systems. And I made a comment about it was interesting seeing a human rights award being given to Robert Mugabe, because most New Zealanders would not see Robert Mugabe as a champion of human rights but quite the opposite. But it was a good discussion, very warm and friendly, and I was very pleased to have the time I had with Vice President Li. \nWell, in terms of the land sales, then, on The Nation we interviewed recently a very high-up Chinese diplomat, Madam Fu Ying, and she said that she would hate to see Chinese buyers being turned into a political target? Did you get that same impression from the vice president? \nWe actually had- once the formalities were over and we were just having a general chat, and he raised the land sales issue himself then, and we talked about land. He talked about in China that there’s so little arable and why land is so valuable and important to the Chinese. And we both agreed that, you know, people have a very emotional attachment to land as well and it’s no different for New Zealand and New Zealanders, and, you know, in New Zealand we want to be able to, you know, given the importance particularly of our farmland to the contribution to our national wealth, that we want to be able to control that and hold on to that. And certainly the sense I had was that he understood that. \nDid he express any-? \nWhen it came to house sales- \nDid he express any concern about the prospect of a ban, though? \nNo concern was expressed at all, because I think they have restrictions on land sales here in China to non-resident foreigners and plenty of other countries in the world do as well, and it wasn’t actually about that. I talked about the investment from China that we do welcome. I look at, you know, companies like Yashili and Yili, who are investing in dairy processing, because that’s generating jobs in New Zealand and generating wealth in New Zealand as well as benefiting the Chinese owners. And we talked about that through a foreign direct investment as something that’s very welcome, but there are sensitivities about land, especially when house sales to a non-resident foreigners is one contributing factor to pushing up house prices in Auckland, and he understood that. \nBut the thing is with the TPP, if you cannot ban foreign buyers, would Labour then look at bringing in a stamp duty or some other kind of tax that would make it prohibitive for foreign buyers? \nWell, that’s the suggestion that’s been made as some sort of side wind as to get around that particular provision. In the end, what it comes down to is the right of a people through their parliament and their elected representatives to determine what they do in their best interests, and when it comes to land sales and wanting to restrict sales to non-resident foreigners, then that’s a decision that the political system has to make. \nBut do you like that idea, Mr Little? Do you like that idea? \nWell, there are plenty of countries that have pretty… there are plenty of countries that have pretty hefty stamp duties. That hasn’t stopped house prices rocketing up, and with the contribution of non-resident foreign buyers, so I’m not sure that’s necessarily an answer to that particular issue. \nOK, well, you raised the topic of human rights. Obviously, the Chinese president has been in the UK. It’s come up there as well, and he has conceded that there is room for improvement when it comes to China’s record on human rights. You raised it; what response did you get? \nWell, it was a similar response. I raised it in my meeting with Xi Jinping at the end of last year, and he responded in similar terms. Yes, he understands that, understands the West’s expectations and that there is room for improvement. And I got a similar response with Vice President Li yesterday in my conversation with him. I mean, they understand, I think… he understood there are issues, and, you know, large country, a lot of issues with a rapid growth and trying to develop a modern judicial system. There are issues still ongoing. But I certainly got a very respectful response, having raised the issue. \nAll right, I want to talk about back home now - the deputy leadership. So, Annette King is staying in that position, but is she sticking with Labour beyond the next election? \nWell, that’s, uh… I’m not quite sure what you mean beyond the next election. Is she going to be standing in the next election? What she does after that, like any… \nWell, is she going to stand? \nWell, that certainly hasn’t been the subject of any discussion between us, and that’s a matter for her to decide. Long-serving MPs do get to a point eventually where, I guess, it’s time for them to go. She’s not expressing that at the moment, and we haven’t had that discussion. No doubt, at some point, she’ll be thinking about that. \nBut why not? Because, obviously, the question is she’ll be, what, about 70 by the time we get to the next election, and she’s had 30-odd years in Parliament. Is that the new face of Labour? \nWell, it’s not polite to ask women their age, but I do know she’s been in Parliament for a long time, and we talk about that, and we are… we have been for some time on the process of refresh and renewal. We have a huge opportunity in terms of new talent we’ll be recruiting in for 2017, so I’m confident we’ll have a good combination of sound seniority and experience and a lot of fresh new talent, a lot of which is there now, and some of which to come in ready for 2017. \nSo, just to be clear, she may not stand in 2017? \nI’m not quite sure how you get to that conclusion. No, I expect she will stand in 2017. \nWell, you can’t say that she will. You can’t say that she will. \nWell, what happens with, you know, people who are standing in seats and on the list is a decision between them and the party. The party selection process for that hasn’t started yet. We want next year to lock down as many of our candidates for 2017 as we can. Right now my focus has been on the caucus and organising a caucus ready for developing a shadow cabinet that will take us through beyond 2017. \nAll right, we’ve got to go. Thanks so much for joining us, Labour leader Andrew Little from Beijing. \nTranscript provided by Able. www.able.co.nz \nThe Nation on TV3, 9.30am Saturdays and 10am Sundays. Proudly brought to you by New Zealand on Air’s Platinum Fund. \n ", "external_links": [], "published": "2015-10-24T03:05:00.000+03:00", "crawled": "2015-10-24T06:30:51.167+03:00", "highlightTitle": ""}