{"organizations": [], "uuid": "5c752c6f21822e165d2d41e403690e6f6d94947e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "https://d1u4oo4rb13yy8.cloudfront.net/740e3ef2-d445-47c3-826b-ca42d4a04b3f.jpg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/763611/modi-builds-a-fantasy-world-but-does-nothing-to-make-it-come-true-writer-mridula-garg", "country": "SG", "title": "Modi builds a fantasy world but does nothing to make it come true: Writer Mridula Garg", "performance_score": 2, "site": "scroll.in", "participants_count": 1, "title_full": "Modi builds a fantasy world but does nothing to make it come true: Writer Mridula Garg", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:30:00.000+03:00", "replies_count": 0, "uuid": "5c752c6f21822e165d2d41e403690e6f6d94947e"}, "author": "Mridula Garg", "url": "http://Scroll.in/article/763611/modi-builds-a-fantasy-world-but-does-nothing-to-make-it-come-true-writer-mridula-garg", "ord_in_thread": 0, "title": "Modi builds a fantasy world but does nothing to make it come true: Writer Mridula Garg", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Modi builds a fantasy world but does nothing to make it come true: Writer Mridula Garg 'If one religion decides what everyone eats, why call ourselves a secular state?' · Today · 12:30 pm Photo Credit: Mridula Garg via Facebook Prime Minister Narendra Modi has finally broken his silence on the events in Dadri. The question is, has it helped improve the atmosphere of intolerance? Not at all. After all, what did he say apart from first making the statement that Hindus and Muslims should fight poverty and not each other, then declaring the lynching of Mohammed Akhlak unfortunate. As if it was a natural calamity.Modi did not promise severe action against any of his MPs and ministers for making inflammatory speeches and redefining culture. One small step has been taken by the Bharatiya Janata Party president Amit Shah meeting the rabble-rousers. But the damage has already been done. That's the problem with rabble rousing. You can't diffuse it at will.The prime minister said Lalu Yadav had insulted Hindus by saying that they also eat beef. If one interpretation of one religion decides what everyone eats then why call ourselves a secular state. True secularism We need to replace “secular” by a more meaningful word. By definition, all state power is secular, not spiritual. So secular is a redundant word when applied to the state. What we ought to say or mean is a “non-religion oriented state”. But that is exactly what we are not. Instead of keeping out of all religious functions (by definition in the private or individual domain), our government emissaries turn up at all of them to show how secular they are, with loud fanfare, destroying any spirituality left after a crass display of money power. There is irony for you.Meanwhile violence with cow slaughter as an excuse is escalating. Is it not time for the government to take strong action?What about law and order? Does the government abdicate its responsibility in that matter also? Catchy slogans For how long will the onus for everything be put on the people, while they are given catchy but meaningless slogans. One example is Beti Bachao, beti padao! A good slogan! But may one ask, how? Where are the schools where actual education is given with non-absentee teachers. Where are the employment opportunities which can empower the parents to send their daughters to proper schools, not run by an indifferent government?Prime Minister Modi is a voluble speaker. He even broadcasts a nationwide Mann ki Baat or Words from the Heart. But mann has larger and deeper connotations in Hindi. It can also mean wishful thinking; something we spin stories about but are unable to practice. He builds a fantasy world for us in his Mann ki Baat and then does nothing to make it come true. If that is all he has to say and he is not ready to take action against his ministers and members of Parliament responsible for bashing citizens and intellectuals in the name of so-called culture, then I prefer him silent. We welcome your comments at letters@scroll.in", "external_links": [], "published": "2015-10-20T15:30:00.000+03:00", "crawled": "2015-10-20T10:04:26.062+03:00", "highlightTitle": ""}