{"organizations": [], "uuid": "fe8471517d1667e2b6c6d93009c6c4a972001763", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "health.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/de/c9/18e8419b4b20bb3e0eca8106082a/140721-sportsinjury-stock.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://health.usnews.com/health-news/patient-advice/articles/2015/10/05/implanting-lab-grown-cartilage-to-fix-damaged-knees", "country": "US", "title": "Implanting Lab-Grown Cartilage to Fix Damaged Knees", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Implanting Lab-Grown Cartilage to Fix Damaged Knees - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe8471517d1667e2b6c6d93009c6c4a972001763"}, "author": "USNews", "url": "http://health.usnews.com/health-news/patient-advice/articles/2015/10/05/implanting-lab-grown-cartilage-to-fix-damaged-knees", "ord_in_thread": 0, "title": "Implanting Lab-Grown Cartilage to Fix Damaged Knees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Implanting Lab-Grown Cartilage to Fix Damaged Knees New treatment options are desperately needed – here's an inside look at one.\nThe number of surgeries for knee cartilage damage shot up nearly 40 percent in the last decade to almost a quarter of a million surgeries a year.\nBy David C. Flanigan, M.D. Oct. 5, 2015 | 7:00 a.m. EDT + More One of the challenges of treating patients with knee injuries is that once knee cartilage is damaged, it's damaged for good. This cartilage, which is crucial to smooth and painless mobility in the knee, is avascular and, without blood flow, has limited capacity to heal or grow back after injury. Over time, knee cartilage erosion can lead to osteoarthritis .\nTreatment options to fix problems caused by damaged knee cartilage are limited. Most surgeries entail simply shaving off damaged areas of cartilage that protrude from the joint and cause pain.\nIf too much of the cartilage is destroyed, doctors can perform microfracture surgery. Considered the current standard of care for the most severe cases of cartilage injury, the process involves surgically creating tiny fractures in the underlying bone. The fractures create blood clots, which attract naturally occurring stem cells and growth factors. Eventually, fibrocartilage is formed, which helps fills in the holes created by damaged cartilage.\nMicrofracture surgery is a quick, common and fairly simple procedure . However, while symptoms may subside initially, the therapy isn't ideal and is not always permanent. As opposed to the smooth, flexible articular cartilage you're born with, fibrocartilage is rough, dense and doesn't form the tissue required to withstand normal forces of movement over time. Patients are often left searching for alternative therapies due to incomplete recovery or limited duration of effect.\nThis problem isn't going away. In fact, the number of surgeries for knee cartilage damage shot up nearly 40 percent in the last decade to almost a quarter of a million surgeries a year .\nNew treatment options are desperately needed, and we may be on the verge of finding a new solution using a patient's own cells. My colleagues and I at The Ohio State University Wexner Medical Center are currently taking part in a randomized trial testing a novel approach that could be the future of knee cartilage repair.\nHere's how it works: We extract a small sample of healthy cartilage from the non-weight-bearing area of a patient's knee through a minimally-invasive scope. The tissue sample, which is usually about the size of a Tic Tac candy, is then sent to a specialized laboratory where cell lines are replicated over and over and over again.\nWithin six weeks, the cartilage grows into a quarter-sized piece of living tissue. Once it's large enough, it's sent back to us for re-implantation.\nAs opposed to microfracture, in which fibrocartilage is formed to help seal the holes in damaged cartilage, the tissue that is created in the lab is hyaline cartilage. It's the same type of smooth, lubricated cartilage that grows naturally in our joints.\nIn the operating room , we measure the hole in the patient's damaged cartilage, then cut the new tissue to match it. Using a special adhesive, we essentially glue the new piece of tissue into the damaged area like a puzzle piece.\nUsing the same articular tissue native to the knee, and cutting it to a more precise fit, we anticipate the patient's own lab-grown cartilage will assimilate fully into existing cartilage and heal the wound more completely.\nOhio State is one of only about 30 sites nationwide chosen for this Food and Drug Administration-approved randomized trial comparing this type of cartilage tissue regrowth and repair to the current standard-of-care for patients with articular cartilage defects of the knee . If this approach can help people with knee injuries function better, it could revolutionize how we address cartilage problems in the future for our patients. Like similar knee surgeries, recovery time for the patient is expected to be six to eight weeks. But unlike other surgeries, we're hoping the results of this procedure will be permanent.\nDr. David C. Flanigan is the Director of Cartilage Restoration Program and Orthopedic Surgeon at The Ohio State University Wexner Medical Center.\nTAGS: health patients patient advice For Better knee replacement", "external_links": ["http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3445147/", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdpg6r%3Fsrc=usn_gp", "http://www.ncbi.nlm.nih.gov/pubmed/24485115", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdpg6r%3Fsrc=usn_tw&via=usnews&text=Implanting%20Lab-Grown%20Cartilage%20to%20Fix%20Damaged%20Knees", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdpg6r%3Fsrc=usn_rd&title=Implanting%20Lab-Grown%20Cartilage%20to%20Fix%20Damaged%20Knees", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdpg6r%3Fsrc=usn_fb", "http://wexnermedical.osu.edu/", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdpg6r%3Fsrc=usn_su", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdpg6r%3Fsrc=usn_li&title=Implanting%20Lab-Grown%20Cartilage%20to%20Fix%20Damaged%20Knees&summary=New%20treatment%20options%20are%20desperately%20needed%20%E2%80%93%20here%27s%20an%20inside%20look%20at%20one.%3Cbr%20%2F%3E&source=U.%20S.%20News", "http://www.arthritis.org/living-with-arthritis/treatments/joint-surgery/candidates/cartilage-restoration.php", "http://osuwmc.multimedianewsroom.tv/story.php?id=1043&enter="], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T14:51:06.623+03:00", "highlightTitle": ""}