{"organizations": [], "uuid": "283f1ed9564175b39b419ed714fcecf8dc22cbd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3536692/images/o-GEORGE-OSBORNE-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/uk-politics/news.xml", "section_title": "UK Politics News on The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/18/tax-credits-cuts-could-be_n_8326878.html", "country": "US", "title": "Tax Credits Cuts Could Be 'Killed Off' By Last-Ditch House Of Lords Move, HuffPostUK Learns", "performance_score": 2, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "Tax Credits Cuts Could Be 'Killed Off' By Last-Ditch House Of Lords Move, HuffPostUK Learns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:01:00.000+03:00", "replies_count": 0, "uuid": "283f1ed9564175b39b419ed714fcecf8dc22cbd1"}, "author": "Paul Waugh", "url": "http://www.huffingtonpost.co.uk/2015/10/18/tax-credits-cuts-could-be_n_8326878.html", "ord_in_thread": 0, "title": "Tax Credits Cuts Could Be 'Killed Off' By Last-Ditch House Of Lords Move, HuffPostUK Learns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tax Credits Cuts Could Be 'Killed Off' By Last-Ditch House Of Lords Move, HuffPostUK Learns The Huffington Post UK | By Paul Waugh reddit \nThe Tory government’s tax credit cuts could be stopped in their tracks under a last-ditch plan being plotted by cross-party campaigners, The Huffington Post UK has learned. \nA rarely-used ‘fatal motion’ is set to be tabled in the House of Lords this week, followed by a vote next week, with the specific intention of preventing George Osborne from putting his controversial £4bn proposals into law. \nA crossbench peer is being lined up to table the motion in a bid to garner as much support as possible and use the in-built anti-Tory majority in the Lords to stop the Chancellor from going ahead. \nAlthough the Conservatives have a narrow overall Commons majority, they are outnumbered in the Lords, with 246 peers compared with 209 for Labour and 106 for the Liberal Democrats. \nA further 175 peers are crossbenchers not aligned to any party and 25 are bishops. It is understood that bishops may also take the rare step of voting against the Government. \nOpposition parties believe that any move to kill the legislation would be constitutional because the tax credits cuts were not in the Tory manifesto in May, and David Cameron even told TV viewers in the election campaign that rates would not be cut. \n‘Fatal’ motions are extremely rare, with only a handful successfully passed since the 1960s, as peers are wary of overreaching their usual delaying powers with such a ‘nuclear option’. \nBut crossbench, Labour and Liberal Democrat peers point out that the fact that the tax credit cuts were not in the Conservative manifesto means they are not bound by the usual Salisbury convention that bars the Lords from blocking election promises. \nShadow Chancellor John McDonnell today v owed his party would reverse the tax credits cuts once it came into power. \nDespite huge pressure from some Tory MPs in marginal seats, the Prime Minister and Mr Osborne have so far stood firm against warnings that the tax credits cuts will leave large numbers of the ‘working poor’ hundreds of pounds worse off. \nLast week, one former Tory voter Michelle Dorrell made an emotional plea on BBC1’s Question Time for the Treasury to think again about the plans, declaring she and her children were set to suffer. \nThe tax credit cuts are due to come into force in April, but the statutory instrument needed to make them law is due to be voted on in the Lords on October 26 - and that’s when critics see their last chance to pounce. \nThe so-called Tax Credits (Income Thresholds and Determination of Rates) (Amendment) Regulations 2015 are in the name of Treasury minister and former Goldman Sachs banker Lord O’Neill of Gatley. \nThe Lib Dems have tabled a ‘regret’ motion that can only delay the move, but HuffPost UK has learned that a senior crossbencher will be asked to this week table a much more drastic ‘fatal’ motion to kill the secondary legislation. \nAmong the crossbench names mentioned by campaigners are former social work specialist Baroness Meacher, who has led previous Government defeats on welfare. \nLabour MP Frank Field, who has been leading efforts to stop the tax credit changes, will on Tuesday seek a backbench debate and vote on his own alternative plan, which he says is ‘cost-neutral’ but could spare the worst impacts on the poorest. \nLabour also has its own Opposition day debate on Tuesday, which although lacking any binding vote will be used to gauge how many Conservative MPs are worried about the plans. \nUnder the plan, the Lords will kill the Tory cuts plan and Mr Field’s backbench motion will seek the following week to implement his own plan. \nIt is understood that ministers are this week calling in Tory MPs to reassure waverers, as well as piling pressure onto crossbench peers. \nMr Field told HuffPost UK: “This [Lords motion] will be one of those amendments which are rarely tabled but which will kill the measure. \n“As time goes on, more of Osborne’s backbenchers are now understanding that far from protecting strivers as the Chancellor promised, he is aiming the biggest cut ever in welfare on this group, who he courted during the election. \n“It smashes his 2020 election campaign which would have been all about the strivers. Tory MPs have taken seriously, as the leadership haven’t, that they wish to represent strivers.” \nFormer Cabinet minister Andrew Mitchell told the BBC’s Sunday Politics that ministers could ‘tweak’ the cuts and claimed Mr Osborne was \"keeping an open mind\" and could make changes in next month's Comprehensive Spending Review. \nThe Commons voted last month, with a majority of 35, to go ahead with the cuts, although Tory rebels included former Shadow Home Secretary David Davis. \nThe tax credit cuts were not included in the Finance Bill, which normally enacts a Budget, and campaigners have used the opportunity to seize on the fact that a Statutory Instrument can be killed off by a single Lords vote. Watch: Tory voter's emotional speech slating Govt for cutting her tax credits. To Amber Rudd \"Shame on you!\" #bbcqt pic.twitter.com/leUo9SdmUZ \n— Paul Waugh (@paulwaugh) October 15, 2015 \nLast week, Ms Dorrell berated Cabinet minister Amber Rudd over the tax credits issue, declaring: “I voted for Conservatives originally because I thought you were going to be the better chance for me and my children. You’re about to cut tax credits after promising you wouldn’t. \n“I work bloody hard for my money, to provide for my children, to give them everything they’ve got, and you’re going to take it away from me and them. I can hardly afford the rent I have to pay, I can hardly afford the bills, and you’re going to take more from me. Shame on you.” Most Popular Videos", "external_links": [], "published": "2015-10-19T00:01:00.000+03:00", "crawled": "2015-10-19T01:13:19.441+03:00", "highlightTitle": ""}