{"organizations": [], "uuid": "5a0e8f9dab32b5afcd2cfc0deec8a7469e7f41b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/icons/t_logo_291_black.png", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Politics.xml", "section_title": "NYT > Politics", "url": "http://www.nytimes.com/2015/10/23/us/politics/obama-in-call-for-reform-defends-the-black-lives-matter-movement.html?partner=rss&emc=rss", "country": "US", "title": "Obama, in Call for Reform, Defends the Black Lives Matter Movement", "performance_score": 2, "site": "nytimes.com", "participants_count": 1, "title_full": "Obama, in Call for Reform, Defends the Black Lives Matter Movement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T04:06:00.000+03:00", "replies_count": 0, "uuid": "5a0e8f9dab32b5afcd2cfc0deec8a7469e7f41b6"}, "author": "GARDINER HARRIS", "url": "http://www.nytimes.com/2015/10/23/us/politics/obama-in-call-for-reform-defends-the-black-lives-matter-movement.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "Obama, in Call for Reform, Defends the Black Lives Matter Movement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUG. 19, 2014 Early in his tenure, Mr. Obama was often reluctant to wade into racially charged issues. After the death of Michael Brown last year in Ferguson, Mo., Mr. Obama was widely seen as distant , leaving the passion and action to his attorney general at the time, Eric H. Holder Jr. But as his presidency nears its end, Mr. Obama is shedding much of his reserve and has begun, often in starkly personal terms, to speak about race, drugs and crime. On Wednesday, speaking in West Virginia to people affected by drug abuse, he mentioned his own use of illegal drugs as a young man and promised “to be a little controversial.” “But I’m in my last term, I only got a year left, and it’s not like my poll numbers are that high,” he said to laughter. “I figure I can go ahead and say it.” Criminal justice reform, with its sometimes racial overtones, has become one of the most important issues of Mr. Obama’s remaining months in office. In July, he addressed it in a speech at a meeting of the N.A.A.C.P., and he became the first sitting president to visit a federal prison. On Thursday, he spoke about the subject for nearly an hour. Next week, he will travel to Chicago to speak on the issue at the annual conclave of the International Association of Chiefs of Police. And on Friday, the F.B.I. director, James B. Comey, is scheduled to deliver the second of his widely anticipated addresses on race in police work. In each of his speeches, Mr. Obama has been careful to emphasize the heroism and difficult work of most police officers, and he said on Thursday that the Black Lives Matter movement was not anti-police. “Everybody wants strong, effective law enforcement,” he said during a session moderated by Bill Keller, the editor in chief of The Marshall Project, a nonprofit criminal justice news organization, and a former executive editor of The New York Times. “Everybody wants their kids to be safe when they’re walking to school.” Mr. Obama is part of a growing and bipartisan consensus in Washington that something must be done to reduce the sentences of nonviolent offenders. The Senate Judiciary Committee voted, 15 to 5, on Thursday to send to the full Senate legislation that would significantly reduce mandatory minimum sentences for nonviolent crimes, institute a new system for determining which offenders would be eligible for early release, and create programs to better prepare them to return to their communities. \nAdvertisement", "external_links": [], "published": "2015-10-23T04:06:00.000+03:00", "crawled": "2015-10-23T04:22:51.118+03:00", "highlightTitle": ""}