{"organizations": [], "uuid": "70978face09ccecb4dfae88b9b5b9c9b0b646b2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4059308/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13801305.Union__200_000_families_across_Scotland_to_be_hit_by_tax_credits_cut/", "country": "GB", "title": "Union: 200,000 families across Scotland to be hit by tax credits cut", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 24, "title_full": "Union: 200,000 families across Scotland to be hit by tax credits cut (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T07:10:00.000+03:00", "replies_count": 41, "uuid": "70978face09ccecb4dfae88b9b5b9c9b0b646b2a"}, "author": "Ian Marland", "url": "http://www.heraldscotland.com/politics/13801305.Union__200_000_families_across_Scotland_to_be_hit_by_tax_credits_cut/", "ord_in_thread": 0, "title": "Union: 200,000 families across Scotland to be hit by tax credits cut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nearly 200,000 households across Scotland - and almost 30,000 in Glasgow alone– will lose out under the Conservative Government’s planned tax credit cuts.\nThe changes will leave many low-to middle-income working families significantly worse off, according to new research by the union Unison.\nIt estimates that around two in five of all working families with dependent children could lose as much as £3,000 a year when the reforms come into place next April.\nThe changes were announced in George Osborne’s post-election Budget in July.\nMinisters say that they are needed to cut the UK’s ballooning social security bill and that tax credits, introduced by Gordon Brown when he was Chancellor, were never designed to help so many families.\nThe government also argues that the effect of the cuts will be offset by the planned National Living Wage.\nBut economists have pointed out that overall the reforms will see many workers lose more than they gain.\nDavid Cameron is under increasing pressure from some Conservative MPs, fearful of the response from constituents, over the issue.\nFrank Field, the Labour MP and chairman of the Commons Work and Pensions Committee, has written to Mr Osborne urging him to halt the planned cuts for the lowest paid, those earning less than £13,100.\nPromoted stories A worker putting in 35 hours per week on the National Living Wage would earn £13,100 per year.\nMr Field said: “Just before Christmas 3.2 million low paid workers will receive a letter from the Chancellor telling them he intends to cut their wage packets on average by £1,350 a year. Tory MPs will then be under siege from their constituents.\n“My letter to the Chancellor offers him a way out by protecting the lowest earners and their children.”\nOverall, Unison said that the announced changes to the tax credit taper and threshold will see £4.4bn a year taken out of the income of low-to-middle income families across the UK.\nIn some cases, it warns, workers stand to see their take-home pay fall by more than 10 per cent.\nIn Glasgow alone, 27,000 families will be hit.\nUnison General Secretary Dave Prentis said: “Many of the millions of families who will be the victims of the Chancellor’s cruel tax credits snatch and grab still have no idea that they are going to lose out next year.\nShare article “Tax credits are a lifeline for these families – quite simply they are the difference between them keeping their heads above water and going under.\n“The government is full of praise for people who go out to work to try and provide better lives for their children. Yet these are the very people these punitive changes will hurt. It’s time for the Chancellor to admit that he’s got this one very wrong, and back down before it’s too late.”", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-03T07:10:00.000+03:00", "crawled": "2015-10-03T15:51:51.209+03:00", "highlightTitle": ""}