{"organizations": [], "uuid": "f37ef96ab36dcfbab23fb640dbf553791c34382c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/videos/2015/10/22/ad-watch-busted-by-friends-of-zach-scott--thumb-30000.jpg", "site_section": "http://dispatch.com//content/syndication/news_ohio_politics.xml", "section_title": "Political News - Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/22/ad-watch-zach-scott-busted.html", "country": "US", "title": "Campaign Ad Watch: Friends of Zach Scott, ‘Busted’", "performance_score": 0, "site": "dispatch.com", "participants_count": 1, "title_full": "Campaign Ad Watch: Friends of Zach Scott, ‘Busted’ | The Columbus Dispatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:04:00.000+03:00", "replies_count": 0, "uuid": "f37ef96ab36dcfbab23fb640dbf553791c34382c"}, "author": "The Columbus Dispatch", "url": "http://www.dispatch.com/content/stories/local/2015/10/22/ad-watch-zach-scott-busted.html", "ord_in_thread": 0, "title": "Campaign Ad Watch: Friends of Zach Scott, ‘Busted’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“Busted,” a 30-second TV ad\nProducer : Friends of Zach Scott\nWhere to see it : On local television or at www.facebook.com/ZachScottOH\nVideo : Traffic noise is laid over a sign picturing a stop light with the text below “photo enforced.” Below that sign is another red sign that reads “Red Light Violation $370 fine.” Darkened images show a car approaching. As it gets closer, it appears Columbus City Council President Andrew J. Ginther is behind the wheel. Images from Ohio State football games appear and then a darkened picture of lobbyist John Raphael as the narrator talks about ethics investigations and criminal investigations.\nScript: Narrator : “Andy Ginther: Busted again, caught up in the red-light bribery scandal. Ginther is already under investigation for his trip to an OSU football game with convicted felon John Raphael.\n“Now we learn the FBI investigation gets bigger as another red-light camera executive pleads guilty to bribing Columbus officials. Ginther admits asking him for the money.\n“Redflex got the contracts, Raphael got paid, and Ginther’s campaign got $20,000.\n“We can’t trust Andy Ginther.”\nAnalysis : This is Scott’s third TV ad since the May primary. Similar to the other ads, the entire piece is a political attack on Ginther and Ginther’s involvement in federal investigations, an Ohio Ethics Commission investigation and his association with lobbyist John Raphael.\nScott’s name appears only in the “paid for” line at the end.\nThe sign warning of a $370 fine for a red-light violation is wrong. No such signs were posted in Columbus, where the fine for being caught on camera running a red light was $95. The image of Ginther behind the wheel of a car is altered and fake.\nScott’s campaign said the ad uses stock images.\nAnd while Ginther has been subpoenaed, questioned and turned over records in the bribery investigation, he has not been “busted” with any charges of wrongdoing.\nThere is an ongoing FBI investigation into the city’s red-light-camera contract. Two former Redflex officials have pleaded guilty to bribing Columbus officials to get some of those contracts.\nThose two Redflex officials said they used Raphael as a lobbyist and conduit to funnel the bribes to elected officials.\nGinther has said he never was bribed or solicited bribes.\nThe narrator also says Ginther is already under investigation for a trip to the Big Ten championship game he and three current and former council members took with Raphael last December.\nThat investigation is being conducted by the Ohio Ethics Commission, and Ginther said he has turned over records to the commission. Ginther also has not been charged in that investigation.\nGinther said he paid $250 toward the trip, using campaign funds. Experts that book these kinds of trips say the face value of a seat in a luxury box, a bus trip, food and drink was about $750.\nThe closing section of Scott’s ad that states “Redflex got the contracts, Raphael got paid, and Ginther’s campaign got $20,000” is mostly accurate, according to federal court records.\nBut it needs some airing out.\nGinther was not on the city council when the city approved the initial contract with Redflex in 2005. But he was the chairman of the council’s safety committee in 2010 and voted to approve expanding the city’s Redflex contract. In 2011, he became council president.\nFederal court records said a Columbus elected official requested $20,000 from Redflex executive Aaron Rosenberg in Sept. 2011. Ginther said in June, days after the federal investigation became public, that he asked Rosenberg for a $20,000 campaign contribution around that time. And sources have confirmed to The Dispatch that the official listed in the court document in the 2011 incident is Ginther.\nCourt records state the official received $21,000 from the Ohio Democratic Party in October 2011. Court records state $20,000 of that was Redflex money funneled through Raphael and the party to Ginther’s campaign.\nGinther has said he does not know whether the money came from Redflex, and he said he has cooperated with the federal investigation.\nGinther’s campaign chalked the ad up to a baseless attack and said Ginther “helped federal officials bring people to justice in the Redflex case.”\nlsullivan@dispatch.com \n@DispatchSully", "external_links": [], "published": "2015-10-22T16:04:00.000+03:00", "crawled": "2015-10-22T22:28:34.911+03:00", "highlightTitle": ""}