{"organizations": [], "uuid": "18670143eac367ecc8c38d11e937659b8c3539a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-b82446c71898509069f2c13cc46a0c37.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/company-offers-1-alternative-to-750-drug/article/2574708?custom_click=rss", "country": "US", "title": "Company offers $1 alternative to $750 drug", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Company offers $1 alternative to $750 drug | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:29:00.000+03:00", "replies_count": 0, "uuid": "18670143eac367ecc8c38d11e937659b8c3539a9"}, "author": "Robert King", "url": "http://www.washingtonexaminer.com/company-offers-1-alternative-to-750-drug/article/2574708?custom_click=rss", "ord_in_thread": 0, "title": "Company offers $1 alternative to $750 drug", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A drug maker has stepped in to offer a $1 pill alternative to the pricey $750 anti-parasite treatment that sparked public outrage last month.\nImprimis Pharmaceuticals said Thursday that it would make a formulation that is similar to Daraprim, whose price Turing Pharmaceuticals jacked up almost overnight from $13.50 to $750 a pill.\nThe 5,000-percent price hike started a wave of public attacks on the small drug maker's 32-year-old CEO Martin Shkreli. Democratic presidential candidate Hillary Clinton repeatedly accused Shkreli of price gouging, and her competitor Bernie Sanders refused a donation from the former hedge fund manager.\nNow Imprimis is stepping in to offer what it calls a cheaper alternative to Daraprim. It would start offering the formulation as low as $99 for a 100-count bottle, the company said Thursday.\n  Obama defends DOD veto as a move against 'gimmicks' \"I'm going to be sending it back to Congress; and my message to them is very simple: Let's do this right.\"\nBy Nicole Duran • 10/22/15 5:47 PM Daraprim is a generic version of a drug that has been on the market for decades. A big reason why Shkreli could raise the price so much is that there is no generic competition since the drug serves a limited population.\nThis isn't a generic drug, which must be approved by the Food and Drug Administration. It is instead a customizable compounded formulation that requires a doctor's prescription to prepare and dole out.\nImprimis' CEO hinted that this isn't the first time the price of a generic drug has increased suddenly.\n\"While we respect Turing's right to charge patients and insurance companies whatever it believes is appropriate, there may be more cost-effective compounded options for medications, such as Daraprim,\" said CEO Mark Baum.\nShkreli has said that the profits from the drug will go toward creating a new treatment for toxoplasmosis, the parasite treated by Daraprim. However, several doctors have said a new treatment isn't needed.\nAlso from the Washington Examiner Clinton: Here's why I didn't fire anyone over Benghazi debacle Rep. Mike Pompeo, R-Kan., was the first to ask why no one has been fired yet.\nBy Pete Kasperowicz • 10/22/15 1:26 PM Turing representatives did not immediately return a request for comment.\nTop Story Gowdy scolds Benghazi Dems for focus on 'money,' not 'heroism' Gowdy tore into Democrats at the Benghazi hearing for complaining about the $5 million price tag Thursday.\nBy Al Weaver • 10/22/15 4:34 PM", "external_links": [], "published": "2015-10-22T17:29:00.000+03:00", "crawled": "2015-10-23T01:00:59.279+03:00", "highlightTitle": ""}