{"organizations": [], "uuid": "3ea54717e75522e6a2bc5cc85eaba74a89abe27d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/current-events/50985-china-seeks-code-conduct-internet.html", "country": "US", "title": "China Seeks \"Code of Conduct\" on The Internet", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "China Seeks \"Code of Conduct\" on The Internet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T05:01:00.000+03:00", "replies_count": 0, "uuid": "3ea54717e75522e6a2bc5cc85eaba74a89abe27d"}, "author": "excalibur", "url": "http://defendingthetruth.com/current-events/50985-china-seeks-code-conduct-internet.html", "ord_in_thread": 0, "title": "China Seeks \"Code of Conduct\" on The Internet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China Seeks \"Code of Conduct\" on The Internet Obama wants to turn the internet over to others. Here we go. China asks world to impose 'code of conduct' on Internet | Washington Examiner Quote: \"It is highly necessary and pressing for the international community to jointly bring about an international code of conduct on cyberspace at an early date,\" said Wang Qun, director-general of the Arms Control Department of the Chinese Foreign Ministry, in comments to the U.N. General Assembly. Wang's comments were reported by China's main state-owned press outlet, the Xinhua News Agency.\"China, for its part, will continue to commit itself to establishing a peaceful, secure, open and cooperative cyberspace and pushing for an early international code of conduct acceptable to all,\" Wang added. The U.N. will be considering norms related to cyberspace security this month. A committee comprised of 20 nations published a proposal over the summer for the General Assembly to consider. The U.N. advisory board has called for \"effective cooperation among States to reduce risks to international peace and security\" and says that state actors \"should not conduct or knowingly support\" cyber crime. In the wake of high profile hacks into the U.S. State Department, Department of Defense, and the Office of Personnel Management by China and Russia over the last year, officials have expressed a desire to establish norms on the matter. However, at the same time, President Obama has been moving forward with a plan to transfer control of Internet domain name functions to a multi-stakeholder body. Along with Russia, China has been the most vocal in urging a quick conclusion to that process, and for a management structure that ensures governments retain power over private stakeholders. As a result, observers will be watching to see what China's conception of a \"code of conduct\" entails.  Last edited by imaginethat; October 10th, 2015 at 06:37 PM . Reason: china, not \"chins\"", "external_links": [], "published": "2015-10-11T05:01:00.000+03:00", "crawled": "2015-10-11T13:36:31.006+03:00", "highlightTitle": ""}