{"organizations": [], "uuid": "c9995be53a20dde835de371cb16042d90b120869", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonblade.com", "main_image": "http://www.washingtonblade.com/content/files/2015/10/Keith_Thirion_460x470.jpg", "site_section": "http://www.washingtonblade.com/category/news/local-news/feed", "section_title": "Washington Blade: Gay News, Politics, LGBT Rights » Local", "url": "http://www.washingtonblade.com/2015/10/07/thirion-leaving-equality-maryland/", "country": "US", "title": "Thirion leaving Equality Maryland", "performance_score": 0, "site": "washingtonblade.com", "participants_count": 1, "title_full": "Thirion leaving Equality Maryland", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T19:43:00.000+03:00", "replies_count": 0, "uuid": "c9995be53a20dde835de371cb16042d90b120869"}, "author": "Steve Charing", "url": "http://www.washingtonblade.com/2015/10/07/thirion-leaving-equality-maryland/", "ord_in_thread": 0, "title": "Thirion leaving Equality Maryland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  7, 2015 at 12:43 pm EDT | by Steve Charing Thirion leaving Equality Maryland Keith Thirion Keith Thirion, acting director of Equality Maryland, is departing the organization to take a position at a D.C.-based non-profit. Thirion joined Equality Maryland’s staff in January 2014 as director of advocacy and programs before assuming the role of acting director in June 2015 when the previous director, Carrie Evans, was laid off as a result of the organization’s financial difficulties. Rabbi Stephanie Bernstein, chair of the Equality Maryland Foundation Board, said in the statement, “Keith Thirion has worked tirelessly, effectively, and passionately on behalf of the LGBT community in Maryland during his time with Equality Maryland. In conducting training sessions for police officers and educators on LGBT issues, Keith has had an enormous impact on public servants who interact with the LGBT community. Keith has worked effectively with other social justice organizations in Maryland, and with the General Assembly and the Maryland Attorney General’s Office, to advance equality for Maryland’s LGBT community.” “The organization’s work is incredibly important, as members of our community continue to face discrimination, violence and harassment in daily life,” said Thirion. “There will continue to be a need for advocacy and education until every Marylander including our most vulnerable youth, transgender people and communities of color, are free to live their full lives.” Thirion’s last day will be Oct. 14. The boards will launch a search for a new director for the organization. The job description is available at equalitymaryland.org/director-search .", "external_links": [], "published": "2015-10-07T19:43:00.000+03:00", "crawled": "2015-10-10T02:54:25.909+03:00", "highlightTitle": ""}