{"organizations": [], "uuid": "2b5c845fb7dfa1b88a11c7098c668fda86f3d28c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-d7dabd9adfa61b26cabbfbfa30454d80.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/pro-kasich-super-pac-hillary-supporters-stole-our-slogan/article/2574621?custom_click=rss", "country": "US", "title": "Pro-Kasich super PAC: Hillary supporters stole our slogan!", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Pro-Kasich super PAC: Hillary supporters stole our slogan! | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T18:53:00.000+03:00", "replies_count": 0, "uuid": "2b5c845fb7dfa1b88a11c7098c668fda86f3d28c"}, "author": "Ryan Lovelace", "url": "http://www.washingtonexaminer.com/pro-kasich-super-pac-hillary-supporters-stole-our-slogan/article/2574621?custom_click=rss", "ord_in_thread": 0, "title": "Pro-Kasich super PAC: Hillary supporters stole our slogan!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A super PAC supporting John Kasich's presidential campaign claims another super PAC affiliated with Hillary Clinton stole their lines.\nNew Day for America claims that Priorities USA took the slogan \" John Kasich's For Us \" and repurposed it for their own political gain in a new ad that ends with text reading, \"Hillary Clinton. Strong. For Us .\"\n\"It's really flattering that they're stealing our material but considering all the money they've taken from liberal special interest groups, you'd think Hillary Clinton's super PAC could afford to pay someone to come up with some lines of their own,\" said Matt Carle, executive director of New Day for America, in a statement. \"I guess, just like the candidate they support, they've got no new ideas and have resorted to simply trying to make Hillary out to be someone she's not — a candidate who won't relish in dividing America.\"\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ Priorities USA communications director Justin Barasky responded to the allegation with the following statement:\n  Border agent: Illegals 'know that they will be released' \"What we have right now is essentially a catch-and-release policy.\"\nBy Pete Kasperowicz • 10/21/15 1:30 PM \"Wait, who's John Kasich?\"\nWhile it appears the Kasich and Clinton groups have gotten off on the wrong foot, some on the left would like to see the two groups work together in the long run. MSNBC's Chris Matthews has said he hopes Clinton chooses Kasich as her running mate.\n\"I'd like Hillary Clinton, I'd like to see her up about five or 10 points after her convention, or going into her convention, which is the second convention, and picking John Kasich and blowing everybody's mind,\" Matthews said in May. \"That would just blow everybody's mind. McCain talked about doing it, picking Joe Lieberman.\"\nKasich, who ranks seventh in the Washington Examiner 's most recent power rankings , does not want to be anyone's running mate and labeled Clinton disgraceful for calling Republicans her \"enemies\" during the first Democratic presidential debate. It appears unlikely that Kasich and Clinton can reconcile their differences and band together atop the Democratic ticket anytime soon.\nAlso from the Washington Examiner Treasury, IRS lay out tax rules for same-sex couples following court ruling With the rules, a marriage of two people of the same sex will also be recognized for federal tax purposes.\nBy Joseph Lawler • 10/21/15 5:22 PM Top Story GOP lawmakers: Has EPA fired anyone for toxic mine spill? Lawmakers pressed the agency on whether anyone has been held accountable for the 3-million-gallon spill.\nBy John Siciliano • 10/21/15 1:59 PM", "external_links": [], "published": "2015-10-21T18:53:00.000+03:00", "crawled": "2015-10-22T01:02:00.370+03:00", "highlightTitle": ""}