{"organizations": ["EU"], "uuid": "ff165ebe319845ef75273230d08ea3bd5a0a1e2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/049db445-0e0c-4a18-84de-12b15717c588.img", "site_section": "http://www.ft.com/rss/world/uk/politics", "section_title": "Politics & Policy - latest UK politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/88625b62-728f-11e5-bdb1-e6e4767162cc.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Cameron plans big push ahead of EU summit", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Cameron plans big push ahead of EU summit", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:46:00.000+03:00", "replies_count": 0, "uuid": "ff165ebe319845ef75273230d08ea3bd5a0a1e2d"}, "author": "", "url": "http://www.ft.com/cms/s/0/88625b62-728f-11e5-bdb1-e6e4767162cc.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Cameron plans big push ahead of EU summit", "locations": ["EU"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David Cameron", "George Parker", "Jean-Claude Juncker", "Cameron"], "text": "Cameron plans strong push ahead of December EU summit George Parker, Political Editor ©AFP Jean-Claude Juncker, left, with David Cameron \nDavid Cameron will on Thursday try to inject energy into his sluggish EU renegotiation after Jean-Claude Juncker, European Commission president, said: “I can’t say that huge progress has been achieved.” \nThe prime minister arrives in Brussels for an EU summit knowing that his plan to secure a better British deal has been pushed to the sidelines as Europe grapples with the refugee crisis. More Labour MPs urged to back budget surplus \nMr Cameron is planning a political push ahead of another summit in December, but his colleagues admit that talks are likely to drag into 2016. \nSome British officials predict that Mr Cameron will use the December meeting to stage a row with his European partners — notably France — to prove to his eurosceptic critics that he is driving a hard bargain. \n“There’s usually a big row , then everything is settled at another meeting a few months later,” said one. That chronology would point towards Mr Cameron trying to secure a final deal next spring. \nAndrew Lansley, a former health minister, told a business meeting this year that Mr Cameron would have “a big row with the French”, although everything would be “choreographed” to avoid diplomatic damage. \nMr Cameron launched his renegotiation in June, accompanied by a diplomatic tour of Europe. But many leaders are growing impatient and want to see in writing exactly what the prime minister wants. \nIn the meantime, British diplomats and senior EU officials have been holding technical talks in Brussels to explore what treaty changes, legal instruments and other fixes can be used to deliver a deal. I can’t say that huge progress has been achieved, I can’t say that nothing has been achieved, but to tango it takes two \n- Jean-Claude Juncker, European Commission president \n“Our negotiation teams are in close contact for weeks now,” Mr Juncker said on Wednesday in Brussels. “I can’t say that huge progress has been achieved, I can’t say that nothing has been achieved, but to tango it takes two. \n“I am 150 per cent in favour of having Britain as a constructive member state of the European Union; we need Britain,” he said. “Personally, I do think Britain needs the European Union, but that’s a matter of conviction. \n“Others may have a different feeling on that; they will have the same feeling if ever Britain would leave the European Union, but that’s not the assumption under which I am working.” \nMr Juncker reiterated a readiness to be flexible, provided Britain does not challenge EU principles, such as the free movement of workers. “I want, we want, the commission wants a fair deal with Britain and we are working in that direction,” he said. \nMr Cameron will meet Mr Juncker in Brussels on Thursday and will also meet Martin Schulz, European parliament president. The prime minister has yet to decide whether to accept Mr Schulz’s invitation to set out his demands to MEPs. \nMr Cameron does not want to set out his demands in writing, knowing that some Tory MPs would condemn his apparent lack of ambition. If he failed to secure his wishlist his problem would be compounded. \nPhilip Hammond, foreign secretary, admitted last month there were no quick deals in sight. \nHe said hopes that negotiations could be completed by December were now “unrealistic” and that negotiations would not begin in earnest until early next year, paving the way for a referendum “as quickly as possible” thereafter. \n“Realistically, the December European Council is going to represent the start of the serious and multilateral negotiations around the British package,” Mr Hammond said. \nAs the talks continue, rival campaigns have been formed this month to contest Mr Cameron’s promised in-out referendum, which will take place by the end of 2017 at the latest. Related Topics", "external_links": [], "published": "2015-10-14T21:46:00.000+03:00", "crawled": "2015-10-14T22:48:31.545+03:00", "highlightTitle": ""}