{"organizations": [], "uuid": "80cdfeb3cf59347f23d1f56a6075ef1ac4e9c5dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30156128/the-neurocritical-care-society-announces-trial-results-at-2015-annual-conference", "country": "US", "title": "The Neurocritical Care Society Announces Trial Results at 2015 Annual Conference", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Neurocritical Care Society Announces Trial Results at 2015 Annual Conference - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "80cdfeb3cf59347f23d1f56a6075ef1ac4e9c5dd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30156128/the-neurocritical-care-society-announces-trial-results-at-2015-annual-conference", "ord_in_thread": 0, "title": "The Neurocritical Care Society Announces Trial Results at 2015 Annual Conference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Neurocritical Care Society\nSCOTTSDALE, Ariz. , Sept. 30, 2015 /PRNewswire-USNewswire/ -- The Neurocritical Care Society (NCS) (Headquartered in Minneapolis, Minnesota , USA) is pleased to announce its upcoming 13 th annual conference this year in Scottsdale Arizona from October 6 th through October 10 th in the Westin Kierland Resort. This year's meeting involves gathering of the world's best minds in Neurocritical care. Neurocritical care is the medical science concerned with management of patients with catastrophic brain, spine and nerve diseases in the Intensive care unit (ICU). Over 950 attendees from different medical professions including physicians, nurses, pharmacists, scientists, researchers and medical students from 56 different countries will participate.\nThe keynote speaker for the meeting this year is a world renowned neurosurgeon Alfredo Quinones from The Johns Hopkins University Hospital, Baltimore, Maryland . Dr. Quinones will present his life journey starting from being a Mexican immigrant farmer to being one of the few world recognized brain surgeons battling brain cancer.\nThis year's meeting will announce of results of four very important medical trials that could change the way we understand and treat catastrophic neurological illness. This might lead to a change of the outcomes of patients of such disease conditions and would impact the families and society. The trials resulting at the NCS annual meeting include:\nCLEAR IVH trial: management of intraventricular hemorrhage (bleeding inside brain fluid chambers). Dr. Dan Hanley from Johns Hopkins University will present the results of this international multicenter trial that was funded by the NIH (National Institute of Health, USA ).\nEUROTHERM trial: Dr. Peter Andrews from University of Edinburgh , UK will deliver the results of the Eurotherm trial, a study evaluating the role of hypothermia (cooling down the body), in treating high brain pressures in patients with traumatic brain injury.\nGAMES trial: Dr. Kevin Sheth from Yale University will present the outcomes of a study evaluating the role of a continuous infusion of glyburide (normally a medication to control high blood sugar) in decreasing brain swelling after a large ischemic stroke.\nPRINCE trial: Dr. Jose Suarez from Baylor College of Medicine will present the outcomes of the PRINCE trial, a role delineation study of neurointensivists across the globe.\nFor more information on the NCS annual meeting or to schedule an interview with the principal investigators of any of the trials outlined above, please contact the NCS (see below).\nAbout NCS\nThe Neurocritical Care Society is an international not-for-profit organization composed of multiprofessional healthcare providers that are dedicated to improve the care and outcomes of patients with life-threatening neurological illnesses by promoting quality patient care, professional collaboration, research, training and advocacy. For additional information or to join, visit www.neurocriticalcare.org .\nCONTACT: Neurocritical Care Society Executive Office, (952) 646-2023, info@neurocriticalcare.org\n releases/the-neurocritical-care-society-announces-trial-results-at-2015-annual-conference-300152036.html\n ", "external_links": ["http://www.neurocriticalcare.org/", "http://www.prnewswire.com/news-releases/the-neurocritical-care-society-announces-trial-results-at-2015-annual-conference-300152036.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC16713&Transmission_Id=201509301708PR_NEWS_USPR_____DC16713&DateId=20150930"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T02:35:35.469+03:00", "highlightTitle": ""}