{"organizations": [], "uuid": "d7ae8b32f99783fc45f0a0482a5bf62ecda11e94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30305523/more-than-35-leading-us-health-organizations-launch-campaign-to-improve-obesity-care", "country": "US", "title": "More than 35 Leading U.S. Health Organizations Launch Campaign to Improve Obesity Care", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "More than 35 Leading U.S. Health Organizations Launch Campaign to Improve Obesity Care - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7ae8b32f99783fc45f0a0482a5bf62ecda11e94"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30305523/more-than-35-leading-us-health-organizations-launch-campaign-to-improve-obesity-care", "ord_in_thread": 0, "title": "More than 35 Leading U.S. Health Organizations Launch Campaign to Improve Obesity Care", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Obesity Society\nNational Obesity Care Week calls for comprehensive, compassionate and patient-focused approach to treat the disease of obesity\nWASHINGTON , Oct. 20, 2015 /PRNewswire/ -- More than 35 leading U.S. healthcare organizations have joined together to form National Obesity Care Week (NOCW), an annual campaign to advance a comprehensive, compassionate and personalized approach to treating obesity as a disease. Scheduled for November 1-7, 2015 , the inaugural event calls upon healthcare professionals, patients and policymakers to \"Change the Way We Care \" for obesity for the benefit of those individuals living with obesity.\n\"No one organization is capable of reaching all the individuals affected by obesity and single-handedly transforming care in America,\" said Francesca Dea , CAE, Executive Director of The Obesity Society (TOS). \"It takes a collective effort to achieve significant change and we are thrilled with the overwhelming level of support for our inaugural initiative. By working together, our collective voice is stronger and we can achieve great things.\"\nWhile obesity has been in the national spotlight in recent years, research shows that conversations about how to address the disease are not happening where it matters most – with healthcare professionals. i Nearly half of people affected by obesity say they have not been advised by a physician about maintaining a healthy weight, according to the Associated Press-NORC Center for Public Affairs Research. i National Obesity Care Week seeks to remedy this problem with a multi-tiered approach, including broad public awareness, healthcare professional education and influencer engagement.\nSpecifically, the campaign will focus on improving healthcare professionals' understanding of obesity as a disease and knowledge of the full spectrum of evidence-based medical strategies. \"In recent years, medical research and clinical studies have advanced our understanding of the physiological and psychological complexities of obesity and how it affects the body. The scientific community has been successful at furthering our insight of the complexity of obesity and its impact on the body,\" says Peter D. Vash , MD, MPH, from UCLA Medical Center. \"In today's environment, healthcare professionals not only need enlightened access to the latest science, treatments and guidelines but also, tools to assist them in engaging patients in productive, compassionate and insightful conversations that inspire change. This campaign does both.\"\nA national public awareness initiative that both educates on the value of comprehensive care and stresses the importance of conversation could make a significant difference among patients as well. As many as 65 percent of American adults are recommended for weight-loss treatment based on the 2013 guideline for the management of overweight and obesity in adults , published by The Obesity Society, the American Heart Association and the American College of Cardiology. ii But according to patient advocate Michelle Vicari , \"Many individuals living with obesity may avoid seeking medical care because they feel alienated and uncomfortable. Finding a doctor who is engaging, compassionate and committed to working with patients to develop a comprehensive weight-loss plan can be life-changing.\"\nLed by founding partners, The Obesity Society (TOS), the Obesity Action Coalition (OAC), Strategies to Overcome and Prevent (STOP) Obesity Alliance and the American Society for Metabolic and Bariatric Surgery (ASMBS), NOCW will coincide with ObesityWeek SM 2015 , the premier, international conference focused on the science and treatment of obesity.\nSupporters of the campaign include the Academy of Nutrition and Dietetics; American Academy of PAs; American Association of Clinical Endocrinologists; American Association of Nurse Practitioners; American College of Physicians; American College of Preventive Medicine ; the American Congress of Obstetricians and Gynecologists; American Institute for Cancer Research; American Medical Group Association; American Medical Women's Association; American Osteopathic Association; American Society for Nutrition; Asian & Pacific Islander American Health Forum; Asian Pacific Community in Action; American Telemedicine Association; California Podiatric Medical Association; the Endocrine Society; Global Obesity Prevention Center at Johns Hopkins University ; Healthcare Leadership Council; Institute for Medicaid Innovation; Medicaid Health Plans of America; National Association of Chronic Disease Directors; National Community Pharmacists Association; National Council of Asian Pacific Islander Physicians; Novo Nordisk, Inc.; Obesity Medicine Association; OWL - The Voice of Women 40+; Pennington Biomedical Research Center at Louisiana State University ; Takeda Pharmaceuticals U.S.A. , Inc.; The COSHAR Foundation, Inc.; UConn Rudd Center for Food Policy & Obesity; and the World Obesity Federation. Media supporters of the campaign include Medical News, Inc.; and Physicians Weekly.\nAbout Obesity\nObesity was designated as a disease by the American Medical Association in 2013. iii Classified as a body mass index (BMI) of 30 or greater, obesity is associated with having an excess of body fat, defined by genetic and environmental factors that are difficult to control when dieting. iv,v,vi In the United States , 35 percent of adults are affected by obesity, yet only half have been advised by a physician about maintaining a healthy weight. i,vii People affected by obesity are more likely to suffer from additional medical conditions, including heart disease, type 2 diabetes, hypertension, obstructive sleep apnea, and certain types of cancer. viii,ix Obesity-related healthcare costs were estimated at $316 billion in 2010. x\nAbout National Obesity Care Week\nNational Obesity Care Week is a public education initiative led by a coalition of like-minded partners in the public and private sectors who seek to encourage comprehensive obesity care and treatment. Visit www.obesitycareweek.org to learn more about improving obesity disease management. Join the conversation on Twitter , Facebook and LinkedIn .\nAbout The Obesity Society\nThe Obesity Society (TOS) is the leading professional society dedicated to better understanding, preventing and treating obesity. Through research, education and advocacy, TOS is committed to improving the lives of those affected by the disease. For more information visit: www.Obesity.org . Connect with us on social media: Facebook , Twitter and LinkedIn . Find TOS disclosures here .\nAbout the Obesity Action Coalition\nThe Obesity Action Coalition (OAC), a more than 50,000 member-strong National non-profit organization, is dedicated to improving the lives of individuals affected by the disease of obesity through education, advocacy and support.\nAbout the STOP Obesity Alliance\nThe Strategies to Overcome and Prevent (STOP) Obesity Alliance is a collaboration of consumer, provider, government, business, health insurer and quality-of-care organizations working to drive innovative and practical strategies that combat obesity. The STOP Obesity Alliance is based at the Milken Institute School of Public Health at the George Washington University . For more information, visit http://www.stopobesityalliance.org/ and follow the Alliance on Facebook and Twitter .\nAbout the American Society for Metabolic and Bariatric Surgery\nThe ASMBS is the largest organization for bariatric surgeons in the nation. It is a non-profit organization that works to advance the art and science of bariatric surgery and is committed to educating medical professionals and the lay public about bariatric surgery as an option for the treatment of morbid obesity, as well as the associated risks and benefits. It encourages its members to investigate and discover new advances in obesity, while maintaining a steady exchange of experiences and ideas that may lead to improved outcomes for morbidly obese patients. For more information, visit www.asmbs.org .\nContact:\nAndy Sousa\n202-828-5069\na.sousa@togorun.com\nReferences\n[i] Tompson T, et al. US Center for Public Affairs Research 2012 Report. Available at: http://www.apnorc.org/PDFs/Obesity/AP-NORC-Obesity-Research-Highlights.pdf . Accessed October 1, 2015 .\n[ii] Jensen MD, Ryan DH, Apovian CM, et al. American College of Cardiology/American Heart Association Task Force on Practice Guidelines; Obesity Society. 2013 AHA/ACC/TOS guideline for the management of overweight and obesity in adults: a report of the American College of Cardiology/American Heart Association Task Force on Practice Guidelines and The Obesity Society. J Am Coll Cardiol . 2014;63(25 pt B):2985-3023.\n[iii] American Medical Association. Business of the American Medical Association House of Delegates 2013 Annual Meeting annotated reference committee reports: reference committee D. Available at: http://www.ama-assn.org/assets/meeting/2013a/a13-addendum-refcomm-d.pdf . Approved June 8, 2014 . Accessed October 14, 2015 .\n[iv] Obesityaction.org. What is Obesity? Obesity Action Coalition : 2015. Available at: http://www.obesityaction.org/understanding-obesity/obesity . Accessed October 1, 2015 .\n[v] Wright SM, Aronne LJ. Causes of obesity. Abdom Imaging . 2012;37(5):730-732.\n[vi] Williams G, Frühbeck G, eds. Obesity: science to practice. West Sussex, United Kingdom : John Wiley & Sons, Ltd; 2009.\n[vii] US Department of Health and Human Services, Centers for Disease Control and Prevention, National Center for Health Statistics. Prevalence of overweight, obesity, and extreme obesity among adults: United States , trends 1960-1962 through 2007-2008. http://www.cdc.gov/nchs/data/hestat/obesity_adult_07_08/obesity_adult_07_08.pdf . Published June 2010 . Accessed October 14, 2015 .\n[viii] Must A, Spadano J, Coakley EH, Field AE, Colditz G, Dietz WH. The disease burden associated with overweight and obesity. JAMA. 1999;282(16):1523-1529.\n[ix] Gami AS, Caples SM, Somers VK. Obesity and obstructive sleep apnea. Endocrinol Metab Clin North Am. 2003;32(4):869-894.\n[x] Ogden C, Carroll M, Kit B, Flegal K. Prevalence of Childhood and Adult Obesity in the United States , 2011-2012. JAMA . 2014;311(8):806. doi:10.1001/jama.2014.732.\nLogo - http://photos.prnewswire.com/prnh/20151019/278534LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/more-than-35-leading-us-health-organizations-launch-campaign-to-improve-obesity-care-300162842.html\n ", "external_links": ["http://www.cdc.gov/nchs/data/hestat/obesity_adult_07_08/obesity_adult_07_08.pdf", "https://twitter.com/STOPObesity", "http://www.apnorc.org/PDFs/Obesity/AP-NORC-Obesity-Research-Highlights.pdf", "https://www.linkedin.com/company/10233415", "http://www.obesityaction.org/understanding-obesity/obesity", "https://www.facebook.com/STOPObesityAlliance", "https://photos.prnewswire.com/prnvar/20151019/278534LOGO", "http://photos.prnewswire.com/prnh/20151019/278534LOGO", "http://www.obesity.org/", "http://www.obesityweek.com/", "http://www.ama-assn.org/assets/meeting/2013a/a13-addendum-refcomm-d.pdf", "https://twitter.com/ObesityCareWeek/", "http://www.linkedin.com/groups?gid=3723206", "http://www.obesity.org/about-us/financial-relationships.htm", "http://www.obesitycareweek.org/", "http://www.stopobesityalliance.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY32804&Transmission_Id=201510201000PR_NEWS_USPR_____NY32804&DateId=20151020", "http://www.xmlnews.org/ns/", "https://www.facebook.com/ObesityCareWeek", "http://www.asmbs.org/", "http://www.prnewswire.com/news-releases/more-than-35-leading-us-health-organizations-launch-campaign-to-improve-obesity-care-300162842.html", "http://onlinelibrary.wiley.com/doi/10.1002/oby.v22.S2/issuetoc", "http://www.facebook.com/TheObesitySociety", "http://twitter.com/ObesitySociety"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T18:19:21.974+03:00", "highlightTitle": ""}