{"organizations": [], "uuid": "d00c82fba9095118db575e89c11a30b384921a2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/f14eff94a6643905fa71efe1ed871b46ad8b6196/c=0-81-1556-956&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/21/DetroitNews/B99316280Z.1_20151021234953_000_G9KKCEFU.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/politics#", "section_title": "Detroit News - Politics", "url": "http://www.detroitnews.com/story/news/politics/2015/10/21/insider-snyder/74371492/", "country": "US", "title": "Snyder becomes tied-up as a Spartan", "performance_score": 0, "site": "detroitnews.com", "participants_count": 1, "title_full": "Snyder becomes tied-up as a Spartan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T02:49:00.000+03:00", "replies_count": 0, "uuid": "d00c82fba9095118db575e89c11a30b384921a2b"}, "author": "detroitnews.com", "url": "http://www.detroitnews.com/story/news/politics/2015/10/21/insider-snyder/74371492/", "ord_in_thread": 0, "title": "Snyder becomes tied-up as a Spartan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gov. Rick Snyder honored his bet with Lt. Gov. Brian Calley by wearing a Spartan tie after the Wolverines’ Saturday loss. (Photo: Office of Gov. Rick Snyder) \nCONNECT TWEET LINKEDIN COMMENT EMAIL MORE University of Michigan graduate Rick Snyder , who also is governor of Michigan, made good on his big game bet with Michigan State University grad Brian Calley , his lieutenant governor.\nThe governor honored the Spartans’ last-second 27-24 football win last Saturday in Ann Arbor by posing this week in a snappy green-and-white regimental-stripe tie graced with MSU’s distinctive helmeted warrior symbol. Had the Wolverines won, Calley was prepared to wear a maize-and-blue tie.\nSnyder watched the showdown in his hometown as a guest of University of Michigan President Mark Schlissel. The madcap ending, in which Spartan Jalen Watts-Jackson scooped up and scored on a botched snap to Michigan punter B lake O’Neill , now is ranked among the most surprising college football finishes of all time.\nState Rep. Pscholka \ngoes to bat for puppies \nIn what looks like a perfect pairing of man and dog, Rep. Al Pscholka was photographed this month on the Capitol lawn with a boxer-mix pooch named Bryndle .\nBut the pictured dog actually belongs to state employee Anna Heaton, who adopted her four years ago from a shelter. Heaton is an adviser to Gov. Rick Snyder. The Pscholka family dog, an apparent spaniel mix named Murphy , also used to be a rescue dog.\nThe photo promotes an anti-puppy mill bill that this week was passed out of the House Appropriations Committee that the Stevensville Republican chairs. Its sponsor is Rep. Mike McCready , R-Birmingham.\nPuppy mill is a term used for businesses where dogs are bred under intensive conditions to create puppies for sale. The legislation tightens regulations on breeding operations to prevent inhumane conditions.\nPscholka said he’s “proud to vote on behalf of these animals.” To get the bill through the Legislature, he said, he might seek help from Canadian sing-songwriter Sarah McLachlan , who’s featured in widely televised commercials against animal cruelty.\n“Puppy mills get their reputation for the callous disregard they show to innocent creatures,” Pscholka said. “It’s abuse, plain and simple. What’s worse, it’s abuse for the sake of profit. Michigan won’t stand for that.”\nWebb pulls out with $4.8K in the bag from Michigan \nFormer U.S. Sen. Jim Webb of Virginia pulled out of the race for the Democratic presidential nomination this week and left little impact on Michigan.\nThe senator, who fancies himself a centrist who is willing to take on liberal orthodoxies like affirmative action, never visited the state after announcing his candidacy in early July.\nBut he managed to persuade eight Michiganians to donate a total of $4,800 to his campaign. It left him behind former Secretary of State Hillary Clinton , U.S. Sen. Bernie Sanders of Vermont and former Maryland Gov. Martin O’Malley and ahead of former U.S. Sen. Lincoln Chafee of Rhode Island — who hasn’t raised any money in the state but is still in the race.\nWhat made Webb’s withdrawal announcement Tuesday slightly strange is that it occurred as his campaign was running a Jim Webb ’16 online advertisement on the front page of Detroitnews.com. It said Webb excuded “leadership you can trust” and “experience you can count on” as it asked for donations.\nContributors: Melissa Nann Burke, Chad Livengood, Gary Heinlein", "external_links": [], "published": "2015-10-22T02:49:00.000+03:00", "crawled": "2015-10-22T11:44:06.415+03:00", "highlightTitle": ""}