{"organizations": [], "uuid": "20b5a4e2496538b44d68a735ed5d39084446b30d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30246722/nyc-taxi-and-limousine-commission-honors-luxury-one-at-vision-zero-safety-honor-roll-event", "country": "US", "title": "NYC Taxi and Limousine Commission Honors Luxury One at Vision Zero Safety Honor Roll Event", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "NYC Taxi and Limousine Commission Honors Luxury One at Vision Zero Safety Honor Roll Event - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "20b5a4e2496538b44d68a735ed5d39084446b30d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30246722/nyc-taxi-and-limousine-commission-honors-luxury-one-at-vision-zero-safety-honor-roll-event", "ord_in_thread": 0, "title": "NYC Taxi and Limousine Commission Honors Luxury One at Vision Zero Safety Honor Roll Event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Luxury One Corp\nLuxury One Corp, a provider of vehicle safety technology, was among recipients honored at New York City Taxi and Limousine Commission's Vision Zero Safety Honor Roll Event held on September 10, 2015.\nNEW YORK , Oct. 13, 2015 /PRNewswire/ -- Luxury One Corp, a leader of safety technology never seen before, was among recipients honored at New York City Taxi and Limousine Commission's (TLC) Vision Zero Safety Honor Roll Event held on September 10, 2015 . The event, held at the Borough of Manhattan Community College's TriBeCa Performing Arts Center, honored the achievement of 256 of New York City's safest TLC-licensed drivers and recognized the crucial safety role played by the businesses that dispatch taxis, for-hire vehicles and commuter vans with superior safety records.\nBoth Luxury One Corp and Manhattan Checker Corp, a Luxury One Corp client utilizing the vehicle safety technology, were recipients on the Safety Honor Roll. The event was held in support of Mayor de Blasio's 2014 Vision Zero Action Plan, which outlines actions the TLC, Department of Transportation, New York Police Department, other agencies, the public, and the private sector can take to end traffic-related deaths in New York City by 2020.\nOwned by Tomer Zur , Luxury One Corp is pleased to help support the Mayor's vision. The company offers a range of vehicles including being a leader in limos and black car industry leasing, and is a North American distributor of the new Mobileye technology, which brings a greater focus on safety for the company's customers.\nLuxury One is a technological leader in the area of software algorithms, system-on-chips and customer applications that are based on processing visual information for the market of driver assistance systems. This technology is also part of the ongoing initiative by the TLC to equip taxis and limos with this new 'black box' technology to monitor driving as well as providing data analytics to promote safer driving. The new devices will track speed, acceleration, hard braking and abrupt turns with the goal of making driving safer for both the driver and passengers and ultimately save lives.\n\"We are honored to have received recognition during the Safety Honor Roll Event and play such a significant role in supporting the Mayor's vision for safer driving,\" says Boaz Bagbag, vice president of Luxury One Corp. \"The technology we install acts by teaching safety lessons, giving warnings before a crash, and as a result drivers are learning not to make the same mistakes over and over again.\"\nBoaz Bagbag is also an expert on safety issues and Vision Zero for cars. Bagbag has been able to utilize the new technology himself and can attest to its safety features that prevent crashes and ultimately saves lives. Continuing their support of the Mayor's vision, Luxury One Corp's facility provides this new safety technology on any vehicle for individuals, businesses and government agencies.\nFurthermore, Bagbag is scheduled to speak at the Vision Zero Fleet Safety Forum happening on Thursday, November 5, 2015 from 8:30am to 1:30pm . The event is organized by the New York City Fleet and will address the emerging technologies such as driver alerts systems, telematics and fleet data to monitor training and driver input.\nABOUT LUXURY ONE CORP\nLuxury One Corp offers innovative solutions to suit a variety of applications. From fleet fuel management to safety technology, the company is committed to providing its clients the latest advancements in technology for the vehicular and transportation industry. For more information, visit Luxury One Corp .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/nyc-taxi-and-limousine-commission-honors-luxury-one-at-vision-zero-safety-honor-roll-event-300157214.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY24210&Transmission_Id=201510130733PR_NEWS_USPR_____NY24210&DateId=20151013", "http://www.luxuryoneleasing.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/nyc-taxi-and-limousine-commission-honors-luxury-one-at-vision-zero-safety-honor-roll-event-300157214.html"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T15:25:35.502+03:00", "highlightTitle": ""}