{"organizations": [], "uuid": "80f2bab4c47e9661bed1da87f3257a923674c48a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30170649/tufts-medical-center-receives-five-stars-in-uhcs-quality-and-accountability-study", "country": "US", "title": "Tufts Medical Center receives five stars in UHC's Quality and Accountability Study", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Tufts Medical Center receives five stars in UHC's Quality and Accountability Study - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "80f2bab4c47e9661bed1da87f3257a923674c48a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30170649/tufts-medical-center-receives-five-stars-in-uhcs-quality-and-accountability-study", "ord_in_thread": 0, "title": "Tufts Medical Center receives five stars in UHC's Quality and Accountability Study", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Tufts Medical Center\nTufts MC is the only medical center in New England to receive prestigious designation\nBOSTON , Oct. 2, 2015 /PRNewswire-USNewswire/ -- Tufts Medical Center has received the Bernard A. Birnbaum, MD, Quality Leadership Award from the University HealthSystem Consortium (UHC). The award is given to top-performing academic medical centers in UHC's rigorous annual review of quality, efficiency and patient-safety data.\nThe award is based on an in-depth study of an academic medical center's performance, including mortality, effectiveness, safety, equity, patient centeredness and efficiency. One hundred and two academic medical centers across the nation participated in UHC's 2015 study and only 13 received the five-star ranking and Quality Leadership Award. The other honorees are listed below.\n\"This award is incredibly meaningful for our clinicians and for our patients, because it tells us that our quality ranks among the best of our peer academic medical center institutions,\" said Michael Wagner , MD, President and CEO of Tufts Medical Center. \"We are honored by the award, and I salute the effort and innovation of our physicians, nurses and entire staff who work tirelessly every day to deliver outstanding care to our patients.\"\nUHC's annual Quality and Accountability study is designed to help academic medical centers adapt their processes to ensure high performance in quality and safety in all the ways they care for patients. UHC member hospitals and health systems submit their data in an effort to benchmark their quality efforts and learn from each other.\n\"It is important that patients today have timely access to information about how their hospitals perform. UHC uses objective, risk-adjusted quality, patient-satisfaction and efficiency data to provide a picture of what it's like to receive care inside our hospital. This is different than rankings that rely on reputation or brand awareness rather than care at the bedside,\" said Saul Weingart , MD, Chief Medical Officer of Tufts Medical Center. \"We are gratified by our results this year, and grateful to UHC for the opportunities we have as members to learn and improve.\"\n\"This year's winners epitomize the persistence and commitment of academic medical centers to instill a culture of accountability and adaptability in a time of unprecedented change in the health care industry,\" said Julie Cerese , senior vice president, Performance Improvement at UHC. \"We have seen many innovations in the use of performance improvement tools and strategies since the Quality and Accountability Study was introduced a decade ago, but what has not changed during that time is the core characteristics of top-performing organizations that were identified in the seminal 2005 study. Those characteristics-shared sense of purpose, successful leadership style, accountability mechanisms, focus on results, and collaboration-were once again hallmarks of this year's winning organizations.\"\n\"Our nurses and all patient-care staff are laser-focused on patients' experience, and we have a proud tradition of research and innovation around quality,\" said Therese Hudson-Jinks, RN , MSN Chief Nursing Officer and Senior Vice President of Patient Care Services. \"That is why we are so pleased that UHC is recognizing our quality using its data-based approach.\"\nIn addition to Tufts MC, the five-star honorees include:\nNYU Langone Medical Center Rush University Medical Center Mayo Clinic Hospital – Rochester Emory University Hospital Froedtert & the Medical College of Wisconsin Froedtert Hospital University of Colorado Hospital (UCHealth) University of Utah Health Care Houston Methodist Hospital The Ohio State University Wexner Medical Center Memorial Hermann-Texas Medical Center Beaumont Hospital – Royal Oak The University of Kansas Hospital Authority As of April 1 , VHA, the national health care network of not-for-profit hospitals, and UHC, the alliance of the nation's leading academic medical centers, combined into a single organization. The new entity is the largest member-owned health care company in the country and is dedicated to leading health care innovation, creating knowledge and fostering collaboration. The company serves more than 5,200 health system members and affiliates as well as 118,000 non-acute health care customers. Members range from independent, community-based health care organizations to large, integrated systems and academic medical centers.\nAbout Tufts Medical Center and Floating Hospital for Children\nTufts Medical Center is an exceptional, not-for-profit, 415-bed academic medical center that serves adults and children. Located in downtown Boston , the Medical Center is a regional referral center for complex and high-risk care, and the principal teaching hospital for Tufts University School of Medicine . Floating Hospital for Children is the full-service children's hospital of Tufts Medical Center and the principal pediatric teaching hospital of Tufts University School of Medicine . Tufts Medical Center is affiliated with the New England Quality Care Alliance (NEQCA), a network of nearly 1,800 physicians throughout Eastern Massachusetts . Together with NEQCA and Lowell General Hospital, Tufts MC is part of Wellforce, a health system focused on innovations in care integration, population health management, access and operational excellence. For more information, please visit www.tuftsmedicalcenter.org .\nTo releases/tufts-medical-center-receives-five-stars-in-uhcs-quality-and-accountability-study-300153053.html\n ", "external_links": ["http://www.tuftsmedicalcenter.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC18188&Transmission_Id=201510020800PR_NEWS_USPR_____DC18188&DateId=20151002", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/tufts-medical-center-receives-five-stars-in-uhcs-quality-and-accountability-study-300153053.html"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T22:43:44.390+03:00", "highlightTitle": ""}