{"organizations": [], "uuid": "40c6262835440d036818896364220383a9dabc4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/obama/2015/10/remarks-by-the-president-in-arm-chair-discussion-on-criminal-justice-with-law-enforcement-leaders-2474836.html", "country": "US", "title": "Remarks by the President in Arm Chair Discussion on Criminal Justice with Law Enforcement Leaders | Obama", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Remarks by the President in Arm Chair Discussion on Criminal Justice with Law Enforcement Leaders | Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:31:00.000+03:00", "replies_count": 0, "uuid": "40c6262835440d036818896364220383a9dabc4f"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/obama/2015/10/remarks-by-the-president-in-arm-chair-discussion-on-criminal-justice-with-law-enforcement-leaders-2474836.html", "ord_in_thread": 0, "title": "Remarks by the President in Arm Chair Discussion on Criminal Justice with Law Enforcement Leaders | Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nSouth Court Auditorium\n2:36 P.M. EDT\nTHE PRESIDENT: Well, first of all, Bill, thanks for moderating this. Thank you to the Marshall Project. I am particularly grateful to folks in law enforcement, some members of Congress who are here, people in prosecutors’ offices — all of whom have taken a great interest in this.\nAnd as I said backstage before we came out, I do think that we’re in a unique moment in which, on a bipartisan basis, across the political spectrum, people are asking hard questions about our criminal justice system and how can we make it both smart, effective, just, fair.\nYou’re right, Bill, that reform encompasses a whole bunch of stuff, and not everybody is going to have the same views on every issue. But I do think there are certain principles that my administration — our esteemed Attorney General Loretta Lynch and her deputy and others — are pursuing. And there I do think that there’s some rough agreement.\nNumber one, I think there’s a recognition that our criminal justice system should treat people fairly regardless of race, wealth, station; that there has to be a consistency in the application of the law. I think that’s an area where people agree.\nAnd so when I came into office, and we saw a huge variance in how crack cocaine was being treated versus powder cocaine, people immediately asked the question, why is that — particularly given that there might be differences in demographics in terms of who uses it, and that would be an example of an area where we had to reform it. And we still haven’t gotten it where it probably needs to be, but we made a change. So, one is fairness.\nNumber two, proportionality. I think one of the things that has come up again and again in the discussions of reform is, in any criminal justice system we want to make sure that the punishment fits the crime. And if we know, for example, that someone engaged in a non-violent drug crime should be punished but that their sentence should not probably be longer than a rapist or a murderer, and yet that’s not what our sentencing guidelines reflect, then that’s a problem. So, proportionality is the second issue that I’m concerned about.\nNumber three is a recognition that incarceration is just one tool in how we think about reducing crime and violence and making our communities safe. And if that’s the only tool — if we think we only have a hammer, then everything becomes a nail — then we’re missing opportunities for us to create safer communities through drug diversion and treatment, for example, or through more effective re-entry programs, or getting to high school kids or middle school or elementary school kids earlier so that they don’t get in trouble in the first place, and how are we resourcing that. So that’s a third area.\nConnected to that is where are we spending our money? We know we’re spending $80 billion a year incarcerating folks. If, in fact, we had smarter sentencing, we thought about how we’re dealing with drug offenses more intelligently, we are working on evidence-based approaches to rehabilitation and reducing recidivism, and that leads us to save money that then, in turn, we can put on the streets to have a greater police presence, to cultivate better community-police relations, to focus prosecutors’ attention or police officers’ attention on the truly dangerous criminals, then aren’t we better off and isn’t that what we should be pursuing?\nSo those are the kinds of areas where I think there is actually rough agreement. Now, obviously, the devil is always in the details here, and there are going to be some disagreements on how successful is drug diversion, and can we, in fact, significantly reduce the prison population if we’re only focusing on non-violent offenses where part of the reason that in some countries — in Europe, for example — they have a lower incarceration rate because they also don’t sentence violent offenders for such long periods of time.\nThose are all legitimate debates. And I think that part of what our administration is trying to do is look at the data, figure out what we know works, what we don’t.\nAnd the final point I’ll make — and I’ve said this before with respect to criminal justice reform — we can’t put the entire onus of the problem on law enforcement. I think there’s been a healthy debate around police-community relations and some of the episodes that we’ve seen around the country, but we, as a society, if we are not investing in opportunity for poor kids, and then we expect just the police and prosecutors to keep them out of sight and out of mind, that's a failed strategy. That's a failure on our part, as a whole.\nAnd so part of what we’ve also been trying to do — and this goes to the prevention issue — is think about where are the communities that are most vulnerable. I was in West Virginia yesterday, talking about the opioid epidemic. Heartbreaking stories that you’d hear from parents about their children first getting OxyContin or Vicodin maybe from a medicine cabinet, and suddenly they are hooked. They move on to heroin. And there was a consensus we need to spend more of our time on treatment and not just on incarceration as a strategy.\nAnd I pointed out to them that part of what makes this an area where maybe those of us who are better off or middle class are more sympathetic is because it seems more like our kids are vulnerable, as well. But, of course, that's illusory. If kids in the inner city are not getting treatment and opportunity, that's as much of a problem as if it’s happening to our kids. And we’ve got to think of all our children in that same way.\nAnd I’m encouraged by the fact, in particular, that law enforcement is making this point over and over again — because they have the credibility because of the courage and the hard work and they're on the frontlines.\nSo, with that, I should probably make sure that the Chief actually gets a word in. (Applause.)\nMR. KELLER: There’s a lot in there that we — I’d like to pick up on as we go through the allotted time. And I think I’ll start with the question of sentencing, these Draconian sentences that we apply to so many crimes, in part because that's the subject matter of the legislation that just today passed out of the Senate Judiciary Committee.\nA few decades ago, when crime rates were higher and when the only way to get elected to office was to be tougher on crime than your opponent, Congress began restricting the license the judges had in making their sentences. They established mandatory minimum sentences for a number of crimes. They tightened up the safety valve. And that seems to now be recognized as the pendulum having swung too far in one direction. So it’s beginning to swing back a little bit in the other direction.\nThe bill that passed out of the Senate Judiciary Committee today does some modest reductions in mandatory minimums. And — sorry, having a senior moment on my thought — but prosecutors love mandatory minimums, as a rule. So this is really a question for you, John. Prosecutors love mandatory minimums because they can use them as leverage to drive plea bargains, because they can use them to turn low-level offenders and get them to rat out their bosses. How far can you go in eliminating or reducing mandatory minimums, do you think? Why not just eliminate them altogether?\nMR. WALSH: Well, let me first start out by thanking the President and also the Attorney General for their incredible leadership in this area. Part of the reason we have a moment where all of law enforcement and the entire political spectrum are supporting changes to the sentencing regime is the leadership that you have shown and the people in this room have shown, including Chief Beck.\nMandatory minimums are an important part of how the federal system is set up, but since 2013, when the Smart on Crime policy was announced by then-Attorney General Holder, federal prosecutors have been instructed not to use mandatory minimums except in cases that really merit their attention — in other words, aggravated felons; leaders of drug organizations; violent people. And what’s that’s meant is that our use of mandatory minimums has probably dropped by about 25 percent in that time. But so far, we have not seen a corresponding drop in the willingness of lower-level conspirators to cooperate with us.\nIn other words, what we’re seeing in the Smart on Crime policy is a direct ability to reduce mandatory sentences while still protecting the public. So the bottom line is — you ask the question, should we eliminate mandatory minimums entirely, and I think the answer to that is no. But we have to reserve their use for the most severe, dangerous and violent offenders who are out there.\nMR. KELLER: Why not eliminate them, though? Why not just have sentencing guidelines the way we have now and have had it in the past, and leave it to the discretion of judges?\nMR. WALSH: Well, I certainly think that — part of what prosecutors do is advocate to judges. That’s our job. We’re used to it and I think we’re confident about the results we can get. Having said that, there’s something to be said for those most aggravated, top-level criminals knowing that they’re going to get hit if they get caught with a very severe penalty. But that’s different than saying we’re going to use mandatory minimums to drive what has turned out to be mass incarceration of relatively low-level offenders in the federal system.\nSimilarly, I think on the state side — and I would turn this over to Chief Beck — some of the laws that were enacted on the state side in the 1980s and early ‘90s also had very heavy penalties. Whether those are necessary in every instance to accomplish the goals of public safety — that’s a question that we could debate.\nBut the bottom line is, I think that from a federal prosecutor’s point of view, keeping mandatory minimums for the most serious offenders still makes sense. But using them very sparingly for less serious offenders also makes sense. That’s part of what Smart on Crime is about.\nMR. KELLER: Chief, do you want to pick up on that?\nCHIEF BECK: Well, just very briefly, if you view the criminal justice system as a response to a sickness in America, if you view it through the medical aspect, then you have to look at sentencing as a dosage. And I think that we are now experiencing a time in the United States where crime is at a level where we require a different dosage. And we have to recognize that all crimes do not carry the same weight.\nAnd some crimes involve addiction and mental illness and have other pathways that can be more effective than incarceration. And in states across the nation, some of our prisons and jails are schools for criminality. And to put young people — and it’s mainly young people — into those schools for criminality based on minor offenses doesn’t make any sense.\nSo I think we need to stop wasting money and start investing money. And when I talk about investing money — I’m remiss, I should say that I’m privileged to speak for so many chiefs, so many great chiefs in the audience here — over 50 of them — and we all believe in the same thing, that we need to invest in our future, not continue to use money to lock the future of the United States up. We need to invest in that so that we can move to a place where many of these offenses are looked upon as the illnesses that they are.\nMR. KELLER: Your state has been sort of a laboratory in this regard. You’re now in the fifth year of a court order to reduce prison populations. Last year, California passed Prop. 47, which reduced a lot of felonies to misdemeanors. How has that played out? What lessons are there for the rest of the states in your experience?\nCHIEF BECK: So I think there’s some really, really good lessons to be learned. And California often leads the way and sometimes we get things absolutely right and sometimes things need adjustment. And I think it’s important to recognize that what California did in 47 is take several hundred felonies, largely drug-related, and move them to misdemeanors. And a couple of things probably should have been included in that. We also took away progressive prosecutions, so, in other words, you can be arrested and re-arrested and re-arrested again for the same crime. And even though it’s a misdemeanor at this point, there’s no enhanced sentencing or enhanced ability to get folks into treatment.\nAnd the other piece is, is there needs to be a stronger lever for the courts to encourage folks to go into treatment. We’re realizing that we’re dealing largely with addicts here and they don’t have self-determination enough to do it, so there needs to be a way to help do that. And then, thirdly, and most importantly, there needs to be adequate programs for people to be diverted into. And it does no good in my estimation to arrest for these offenses over and over and over again with no place for them to go but back onto the street to continue that cycle.\nAnd so one of the things that I would love to see in this discussion is that we all acknowledge the fact that this is not a cost-saving measure. I don’t believe that reducing incarceration should be looked at as a way to save money for the state or for the federal government. I think that should be looked at as a way to develop money to reinvest into the futures of young people, and then that will, in turn, eventually save money. But in the short term, you’ve got to have another pathway.\nMR. KELLER: In your first answer, Mr. President, you touched on the two — what I think of as the two biggest myths about criminal justice reform. One of them Chief Beck has just addressed, which is the idea that in the end, you can save a lot of money by letting people out of prisons without reinvesting that money. The other is that you can significantly reduce the populations of prisons by letting out low-level drug offenders.\nIt’s true at the federal level, nearly half of the people who are incarcerated are there for drug crimes. But at the state level, where most people are incarcerated, it’s more like 17 percent. Are Americans willing to consider rolling back the sentencing for people who are violent criminals?\nTHE PRESIDENT: Well, first of all, I think it’s important to look at the evidence — and there’s some conflicting data, but here’s what we know — that we increased our prison population fourfold from 1980. And the best social science seems to indicate that, initially, locking up folks who were violent for more certain, longer stretches reduced violence on the streets, but that there was a diminishing return at a certain point and it kind of flattened out. But we just kept on locking folks up without, at that point, it being the main driver of violent crime reductions.\nAnd we have seen incredible, historic reductions in crime over the last 20 years. I know that there’s been some talk in the press about spikes that are happening this year relative to last year, and I’ve asked my team to look very carefully at it — Attorney General Lynch has pulled together a task force — and it does look like there are a handful of cities where we’re seeing higher-than-normal spikes. Across the 93 or 95 top cities, it’s very hard to distinguish anything statistically meaningful.\nNow, that doesn’t mean that we don’t take seriously what’s happening in those cities. But the bottom line is, is that I think there’s a strong consensus in the United States of America that you shouldn’t be hit over the head when you’re walking down the street, that you don’t want somebody breaking into your house and threatening your family, that somebody who commits violence, we don’t have a lot of tolerance for.\nI would distinguish between those situations and whether or not giving somebody who’s 25 years old a 40-year sentence versus a 15-year sentences is the smart thing to do, particularly because we know that young people do stupid stuff and as they get older, they get a little less stupid. I speak from experience. (Laughter.) That at least was my experience. And now I’m watching my teenage girls, and they’re a lot smarter than me, but there are still some gaps in judgment. (Laughter.)\nSo here’s the bottom line. I think it’s smart for us to start the debate around non-violent drug offenders. You are right that that’s not going to suddenly half our incarceration rate, but if we get that — if we do that right, and we are reinvesting in treatment, and we are reinvesting resources in police departments having more guys and gals on the street who are engaging in community policing and that’s improving community relations, then that becomes the foundation upon which the public has confidence in potentially taking a future step and looking at sentencing changes down the road.\nSo I don’t think there’s anything wrong with us saying, you know what, violent crime we want to keep down. We are going to be a little more hesitant initially in how we think about sentencing on violent crime than we are on non-violent crime. If we can reduce the prison population by 5 percent in an initial stretch — and by the way, that’s not a goal I’m setting, I’m just — that was off the top of my head — but 5 percent, when you’ve got 2 million prisoners, that’s a lot of people and that’s a lot of resources that could be going into other areas.\nSo I think that this is a staged process. We will lose the public if we try to do everything at once without having data and evidence, and suddenly you see big spikes in crime again and then suddenly we’re back into the politics of lock them up.\nIf, on the other hand, we do it systematically, methodically, we see what works, we see what doesn’t — the Chief’s point and John’s point about reinvesting I think is absolutely critical. If we do those things well and we can duplicate what happened last year, which was the first time in 40 years that both the prison population and the crime rate went down at the same time — we start seeing the same kinds of patterns as we’re seeing in some of these other states, and the experience we’re seeing in the U.S. Attorney’s Office where we’re not telling prosecutors you’re going to be promoted based on how many maximum sentences you get, but rather based on how wise your use of prosecutorial discretion — if all those things prove that we’re still doing a good job controlling crime, then I think we’ve got something to build on.\nMR. KELLER: One other drug question. John, you work in a state that was one of the first two to legalize recreational use of marijuana. Should Congress take marijuana off the Schedule I list of illegal drugs?\nMR. WALSH: So I’ve learned that I always get a marijuana question. (Laughter.)\nMR. KELLER: Sorry to be so predictable.\nMR. WALSH: I want to reiterate something that I think that the President and the administration has made clear, is that the administration is not in favor of the legalization of marijuana. And the decision to move marijuana from Schedule I to a different schedule is really — there’s a process behind that — it has to do with the medically accepted uses for the drug.\nI will make this comment about the situation in Colorado. One of the things that’s been a tremendous, positive development in Colorado is that the state regulatory system has become clearer so that the local law enforcement has a good sense of where its lines are and what enforcement action it can take. And that’s made our ability to partner with local law enforcement in federal enforcement of marijuana very much clearer. So we see an evolving situation where I think, again, as in so many things, the key is a federal-state law enforcement cooperative effort to make sure the system works.\nMR. KELLER: I’d like to ask both Chief Beck and John Walsh, are there things that the leader of the free world could be doing on his own without the permission of Congress over the next year and change of his administration that would make this problem better? Less of a problem?\nTHE PRESIDENT: Let me just amend that question — (laughter) — because I’ve got some outstanding members of Congress here and I want to work with them to get stuff done. (Applause.) I get into enough trouble with Congress without Bill trying to stir things up. (Laughter.)\nMR. KELLER: That’s why I asked the other guys.\nCHIEF BECK: First I have to say that I’m amazed by the depths of the President’s understanding of this issue. I mean, the first answer that you gave covered so many of the points that John and I have talked about in private, and it’s obvious that you understand the way that the chiefs in this room and the prosecutors in this room feel about this issue. So that’s a huge start, in my opinion.\nBut I think that one of the things that we need to look at is remember that this system is made up of three parts, this criminal justice system. It’s a federal level, which we’re talking about directly here, but most folks are affected by state-level prosecutions, state-level incarceration, or even local — even on the local level.\nAnd so when we talk about having treatment available, when we talk about diversionary systems that we can use to get less people in the jail system, it needs to apply to all three. It can’t just be for the use for the federal system. It has to go down to the state system — because many of the states and all the municipalities now struggle economically, and putting money into community-based organizations or to some of the things that the states and the counties run is very difficult. And so if we could get some federal help with systems that are off-ramps for people that are addicted, and off-ramps for people that are arrested for low-level crimes — because the arrests aren’t stopping. I mean, the chiefs in here represent tens and tens of thousands of low-level drug offense arrests, my organization included. But we’ve got to have somewhere for them to go. And it can’t just be 48 hours in the local lockup and then right back on the street corner where they came from. It just can’t be that.\nMR. KELLER: John, have you got any requests of the President?\nMR. WALSH: The one thing that I would really emphasize — so much of law enforcement really depends on local law enforcement, and our partners in police departments and sheriff’s offices all over the country on the federal side we value tremendously. We can’t get our federal work done without the partnership between federal law enforcement and state law enforcement.\nOne area where over the years we’ve seen a decrease in federal assistance to state and local law enforcement is in the COPS area, the community policing grants. We have fewer officers on the street with federal money than we used to have. And that's an area that I think would go a long way to enabling the police departments and sheriffs’ offices to engage in that community-oriented policing that really will help prevent crime, so that we're not confronted with the situation of trying to decide how much of a sentence to give a violent offender because maybe we prevented some young person from going down that road in the first place.\nCHIEF BECK: And just not to ignore the opportunity, I have to say that the kinds of programs that I know the President wants, I know the police chiefs out here want, the kind of programs that have maximum community interaction where people know the officer on the street, where officers are not there just to enforce the law but they're there to build community, those are the most resource-intensive programs that we have.\nAnd I know the President is familiar with a couple of programs we have in Los Angeles, and I thank him for bringing the Tingirides family out here for his State of Union speech. But those kind of things are exactly the kind of programs that we could expand on with a little help.\nMR. WALSH: And, Bill, there’s one other thing that I think is very important — kind of an amazing number that I only relatively recently became aware of is that we release every year from state and federal prison 600,000 people. So that's 600,000 prisoners coming back into society every year. Do we have 600,000 people’s worth of re-entry programs? I don't think so. We have a lot of work to do in that.\nState and local efforts are great. Many of the U.S. attorneys who are present here in this room have been working on developing great re-entry programs all over the country. But that's another area where taking some of these savings and putting it into that kind of programming is going to reduce the re-offending rate and really make a big difference.\nMR. KELLER: Let’s take a little time to talk about the need to repair the mistrust between police forces and the communities that they serve and protect.\nI notice we’ve solicited questions and thoughts from our readers through social media. And one thing that recurred was a fairly high level of cynicism about the promises that we're all going to do better at policing, that we’ve taken the Black Lives Matter movement to heart. People say the people who are now prescribing a return to community policing are the same people who gave us stop and frisk, and broken windows, and these other strategies that as they were applied in practice tended to result in over-aggressive policing. And I guess the kind of cynical question from the masses would be why should we trust you to get it right this time?\nTHE PRESIDENT: I’m actually going to — Chief, I’m going to interject before –\nCHIEF BECK: Thank you, sir.\nTHE PRESIDENT: – before you have to answer this. (Laughter.) No, no, no — well, and the reason I say this is because it goes to something I said earlier, and that is when you look at, for example, racial bias in the criminal justice system, the criminal justice system and our law enforcement systems are reflections of us. And so if we, as a society, are willing to tolerate very poor neighborhoods with no opportunity, a lot of violence, a lot of substandard education, and then we're surprised that the police, in interacting with a community that hasn’t been cared for, is going to have tougher interactions, then we're passing the buck.\nNow, I take very seriously, as I said before, the need for fairness in our criminal justice system. And Bill — we did a little interview before I came out here, and Bill asked, what had been your experiences. And I fessed up. I have — as a young man, there have been times where I was driving and I got stopped and I didn't know why. But I want to make sure that when we approach this issue we recognize that it’s not all on the police and everybody else can just sit back and opine. The community and the society and the city and the state and the nation have to be partners with the police so that we're not giving them impossible jobs — because they have the right to come home, too, to their families.\nI will say this, that where I’ve seen really smart community policing that rebuilds trust there is a commitment not only to train police more effectively and make sure that there is accountability if there is misconduct, and that there is data being collected around who is being targeted, and there are independent investigations when excessive force may have been used, but there’s also a commitment typically to the kinds of treatment programs, the kinds of partnerships with the schools, with businesses getting involved, opportunities being provided to young people. And as a consequence everybody is taking responsibility for this. And the police become part of a team to eliminate bias in a system.\nThe problem of racial justice or injustice in the society has been a running theme in this country’s history for a very long time. And so we just have to make sure that all of us own it.\nNow, with that, I do want all the chiefs to look at the task force recommendations we’ve put forward post-Ferguson because there are specific things that police departments and police officers can do to rebuild trust. And I don’t want to let them off the hook, because there are some real problems in certain jurisdictions that we’ve seen, and I don’t think the Chief or any of the chiefs here would deny that.\nCHIEF BECK: No, we certainly wouldn’t. And I think it’s important to recognize that the chiefs that are in this room, many of whom are — if not all — of whom I know have been talking about community trust for a decade. I’ve been the chief for a mere six years, but when I came into the organization’s Major City Chiefs, IACP, this was a common theme of our discussion. This is not a new topic to us.\nThe President is exactly right — we are a reflection of a much larger issue in America. There is racial disparity in housing, in employment, in the entire economic system. It is not just in incarceration and in policing. And we have to look at these things in the totality and address them as a nation. And we will do our part.\nAnd I thank the President for the task force. I was lucky enough to be a part of it. I think that there’s some very solid recommendations that we all take to heart are being made. We know we can do better. But we have to recognize that we have a country where things are not always equal. And we can fix that. We can work on that. But we’ve all got to work on it. It’s not just the cops — it’s everybody.\nAnd, Mr. President, I’ve been stopped several times too — I always knew why. (Laughter.)\nTHE PRESIDENT: There are a number of times where I knew why also. (Laughter.) I don’t want to suggest that every stop was uncalled for. (Laughter.) There were times where I checked my odometer and I just took that ticket.\nMR. KELLER: Mr. President, you referred to this earlier as a moment, an opportunity. And it’s clearly true that people are paying more attention to it; we now have bipartisan sort of cross-ideological arguments in favor of reforming the system. How durable is that moment? Do you worry at all that we might find ourselves a year down the road — there’s a spike in crime, there’s a Willie Horton-style horror story? Or people don’t just want to spend the money that it would take to fix the system, and we declare that what passed the Senate Judiciary Committee today was victory, mission accomplished, and we move onto something else?\nTHE PRESIDENT: I think those are all real dangers, and we have to guard against those dangers — which is why I said that rather than think that we’re going to all solve this overnight and then when it doesn’t get all solved overnight, we’re disappointed, I’m much more interested in a sustained, steady process where we’re bringing people together, we’re listening to everybody. And we’re trying to maybe start with some low-hanging fruit and then we get deeper into it and we figure out more of what works and what doesn’t. We’re balancing that against the public’s primary interest, which is making sure that they’re safe. And, by the way, that’s in poor communities and black communities as much as anybody.\nI mean, historically, when you look at it, one of the ironies here is, is that when you look at racial bias in the law enforcement and criminal justice system, historically it was under-policing in African American communities. The attitude was let them do whatever they want as long as they’re not coming into our neighborhoods.\nAnd there are hardworking, wonderful families and kids who — they want to be safe. They want to be in partnership with the police. They just want to make sure that a police officer is properly trained so that just because a kid has a hoodie, they have — partly because they know the community, they don’t automatically assume, well, that must be somebody I should arrest or frisk, and I can distinguish between kids the same way we — in their own neighborhood they can distinguish between kids who are really causing trouble and kids who are just being kids. So I think the moment is here, but we’ve got to build on it and we’ve got to be systematic about it.\nCouple things that haven’t been said that I want to emphasize. Collecting data I think is something that’s going to be very important in guiding us forward. And John was talking about federal, state, and local cooperation — we don’t really do a good job right now in collecting national data on a real-time basis, but we now have the tools and the technology to do it better.\nAnd the better our data, the better we can target where is real crime going on, where are we seeing maybe some problems in police-community interactions that we can catch ahead of time — it’s transparent so the community then has trust because they’re seeing, all right, here’s what’s been happening, and so we’re initiating both internally at the federal level, but also reaching out to departments to figure out how do we get a national database that’s more effective. That’s point number one.\nPoint number two — we’ve got the outstanding Chief of Camden, who I had a chance to visit — a great example of community policing and data driving down crime, and regaining trust from the community. I mean, the Chief here has got sort of a war room that has cameras on some of the hotspots around the city, but it’s not considered Big Brother because they’ve set up software where the community can direct the cameras so that they don’t feel like they’re being spied on from the outside, but rather it’s a tool for the community to monitor what’s happening. They’re then sending that in, and the Chief has trained — retrained his entire department.\nFirst thing they did when they brought in new recruits, they just put them in the neighborhoods where they’re going to be serving, and they had to walk basically for 24 hours, right? And if they needed to go to the restroom, they needed to get to know some people. (Laughter.) And so they started meeting local businesses. Creative work, like, for example, where they know there were hotspots and some gang shootings related to drugs, the Chief takes some forfeiture money, I think it was, and — this was one of my favorite stories, because it’s smart, it shows us thinking — purchases two ice cream trucks, has police officers drive the ice cream trucks, park them where the drug dealing has been going on, giving out free ice cream from the police — suddenly families are out on the streets, and now it’s creating a space in which it’s a lot harder for you to just be dealing drugs.\nAnd the Chief talks about sometimes we know who the drug dealers are, and instead of arresting them — where they’re just going to be released — he’s going to have an officer stand right next to them and talking to them, and asking them why are you doing this.\nSo the point is, is that the use of technology or the use of data, combine with smart community policing, really can have an impact, really can make a difference. But my hope coming out of all these efforts, including the legislation, is that we put an emphasis on what works. And we’re not blinded by ideology and we’re not blinded by fear. All this talk that’s getting hyped about this huge spike in violent crime, this is where you have to step back and say, all right, let’s understand statistics. 2014 was a historic low in violent crime.\nSo if there’s a spike in some cities, that’s something we have to take seriously and pay attention to, but that doesn’t automatically suddenly translate into this notion that a crime wave is coming because it’s still lower this year than it was for every year between 1995 and 2013. It’s just it may be that last year was the anomaly. And that’s an example of us having to make sure that we’re not being driven by fear or bias in how we approach this problem. But we’re looking at facts and trying to figure out what works and what doesn’t.\nMR. KELLER: Our timekeeper, Carly, has just held up a sign that says “stop.” (Laughter.) Actually, she held up about two-thirds of the way through your last answer, but I figured –\nTHE PRESIDENT: It’s okay.\nMR. KELLER: – I didn’t want to put her job at risk by trying shutting you off.\nTHE PRESIDENT: This is my house. (Laughter and applause.) I can go over time, generally. But maybe we can hear from the Chief and John, and maybe get some closing thoughts.\nCHIEF BECK: I just think this is a tremendous opportunity for law enforcement and the justice system in America. Out of crisis comes opportunity, and right now we do have a crisis of confidence. And there’s a tremendous opportunity for us to do better at putting out our message, at about making sure that people are treated fairly, and at making sure that we’re effective law enforcement. And this will be looked at in history as a door that was open, and hopefully we will walk through it together.\nMR. WALSH: I just want to echo a comment that the Chief made a moment ago, which is I’m just amazed by the command of this area that the President has got among the million other things that he does.\nI would say, to go back to your first question, Bill — what is success — in the end, we have an opportunity. This is a moment in time, and I think we’re taking advantage of it collectively to both reduce the rates of incarceration and make our communities safer by taking the savings and investing it in prevention, in effective community-oriented enforcement, and in reentry programs. I think we can do that. And with the leadership of the President, the Attorney General, and all the people here, both in Congress and in federal law enforcement, we’re well down that road.\nTHE PRESIDENT: And because it’s my house, I’m going to take one last — I want to drive home one point, and that is the relationship between race and the criminal justice system, because this is where sometimes politics intrudes.\n“Black Lives Matter” is a social media movement that had tried to gel around Ferguson and the Eric Gardner case and some other cases that came up. And very rapidly, it was posited as being in opposition to the police. And sometimes, like any of these loose organizations, some people pop off and say dumb things. And on the other hand, though, it started being lifted up as these folks are opposed to police and they’re opposed to cops, and all lives matter. So the notion was somehow saying black lives matter was reverse racism, or suggesting that other people’s lives didn’t matter, police officers’ lives didn’t matter.\nAnd whenever we get bogged down in that kind of discussion, we know where that goes. That’s just down the old track. So let me just suggest this. I think everybody understands all lives matter. Everybody wants strong, effective law enforcement. Everybody wants their kids to be safe when they’re walking to school. Nobody wants to see police officers, who are doing their job fairly, hurt. Everybody understands it’s a dangerous job.\nI think the reason that the organizers used the phrase “Black lives matter” was not because they said they were suggesting nobody else’s lives matter; rather, what they were suggesting was there is a specific problem that is happening in the African American community that’s not happening in other communities. And that is a legitimate issue that we’ve got to address.\nI forget which French writer said there was a law that was passed that really was equal because both rich and poor were forbidden from stealing loaves of bread and sleeping under the bridge. That’s not a good definition of equality.\nThere is a specific concern as to whether African Americans are sometimes not treated in particular jurisdictions fairly or subject to excessive force more frequently. I think it’s important for those who are concerned about that to back it up with data, not anecdote; to not paint with a broad brush; to understand the overwhelming majority of law enforcement is doing the right thing and wants to do the right thing; to recognize that police officers have a really tough job and we’re sending them into really tough neighborhoods that sometimes are really dangerous, and they’ve got to make split-second decisions. And so we shouldn’t be too sanctimonious about situations that sometimes can be ambiguous.\nBut having said all that, we as a society, particularly given our history, have to take this seriously. And one of the ways of avoiding the politics of this and losing the moment is everybody just stepping back for a second and understanding that the African American community is not just making this up, and it’s not just something being politicized; it’s real and there’s a history behind it. And we have to take it seriously. And it’s incumbent then on the activist to also take seriously the tough job that police have. And that’s one of the things that the post-Ferguson task force did. We had activists who were marching in Ferguson with police chiefs and law enforcement, sitting down and figuring this stuff out.\nAnd just assuming good faith in other people — going to the issue of people being cynical — I think is important. I’ve rarely gotten much accomplished assuming the worst in other people. Usually it works better if I assume the best. So I just wanted to make that point.\nMR. KELLER: Thank you. I guess I’m here as the representative of the cynical profession.\nTHE PRESIDENT: Yes, you are. Absolutely. (Laughter.)\nMR. KELLER: But I would just like to say there are a few issues I feel less cynical about. I do worry — I share the worry you have that this evaporates because of short attention spans. And I guess it’s on us in the news media in part to make to make sure that that doesn’t happen.\nTHE PRESIDENT: Well, thank you for hosting this. And thanks to everybody here in attendance and the chiefs for the good work you’re doing. (Applause.)\nEND\n3:24 P.M. EDT", "external_links": [], "published": "2015-10-23T15:31:00.000+03:00", "crawled": "2015-10-23T17:59:31.239+03:00", "highlightTitle": ""}