{"organizations": [], "uuid": "b02424a84831b6989d5ac787a38e8fd6b19202a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "axisoflogic.com", "main_image": "", "site_section": "http://axisoflogic.com/artman/publish/Satire.shtml", "section_title": "Axisoflogic.com | Comments and analysis on Political Satire ", "url": "http://axisoflogic.com/artman/publish/Article_71902.shtml", "country": "US", "title": "US and Allies 'Oatmeal Heads' over Syria: Putin | World News", "performance_score": 0, "site": "axisoflogic.com", "participants_count": 1, "title_full": "US and Allies 'Oatmeal Heads' over Syria: Putin | World News |Axisoflogic.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "b02424a84831b6989d5ac787a38e8fd6b19202a3"}, "author": "Zero Hedge", "url": "http://axisoflogic.com/artman/publish/Article_71902.shtml", "ord_in_thread": 0, "title": "US and Allies 'Oatmeal Heads' over Syria: Putin | World News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "To be sure, there are a lot of absurd things about what Washington has done and is currently doing in Syria.\nThere’s the support for Turkey’s Recep Tayyip Erdogan, for instance, who has used ISIS as an excuse to wage war on his own people. Then there are the various efforts to arm and train a hodgepodge of different anti-regime rebel groups (with more embarrassing results each and every time). And just yesterday we learned that the best idea the Pentagon can come up with now is to literally paradrop “50 tons” of ammo on pallets into the middle of the desert and hope the “right” people pick it up.\nOf course when it comes to absurd outcomes in Syria, it’s difficult to top the fact that at some point - and you don’t have to go full-conspiracy theory to believe this anymore - either the West or else Qatar and Saudi Arabia provided some type of assistance to ISIS, which then proceeded to metamorphose into white basketball shoe-wearing, black flag-waving, sword-wielding desert bandits hell bent on establishing a medieval caliphate.\nHaving said all of that, things took an even more surreal turn late last month when, after Russia stormed in via Latakia and started bombing anti-regime targets, Washington was forced to claim that somehow, Moscow’s efforts would be detrimental to the war on terror.\nTo be sure, there really wasn’t much else the US could say. After all, you can’t simply come out and say “well, we need to keep ISIS around actually and we’d much rather them then Putin and Assad, so no, we’re not going to help the Russians fight terror.” The only possible spin to avoid blowing the whole charade up was to claim that somehow, The Kremlin is helping terrorists by killing them (and not in the whole 72 virgins kind of way).\nNow as we’ve said before, Putin is there (along with Iran) to shore up Assad. There’s no question about that and Moscow hasn’t been shy about saying it. But at the end of the day, when you are trying to wipe out your friend’s enemies and some of those enemies are terrorists, well then, you are fighting a war on terror by default and that’s not good for terrorists by definition. By denying this, the US is effectively arguing against a tautology which is never a good idea, and we’re running out of ways to describe the ridiculousness of it.\nFortunately, Vladimir Putin is not running out of colorful descriptors.\nHere’s Bloomberg with some amusing excerpts from a speech he gave at an annual conference organized by VTB Capital in Moscow on Tuesday:\nSome of Russia’s international partners have “oatmeal in their heads” because they don’t understand clearly that its military campaign in Syria seeks to help the fight against terrorism, President Vladimir Putin said.\nRussia notified the U.S. and the European Union in advance “out of respect” that it intended to begin airstrikes against Islamic State and other militants in Syria, Putin said at an annual conference organized by VTB Capital in Moscow on Tuesday. This showed Russia’s ready to cooperate on Syria, while nobody ever warned the authorities in Moscow about their operations, he said.\nPutin’s colorful phrase, normally used to describe someone as confused, to characterize relations with the U.S. and its allies on Syria comes amid deep tensions over the Russian bombing campaign and cruise-missile strikes that began Sept. 30. The EU demanded on Monday that Russia stop targeting moderate groups opposed to Syrian President Bashar al-Assad. U.S. Defense Secretary Ashton Carter warned that Russia’s actions “will have consequences” and the bombing “will only inflame” Syria’s four-year civil war.\nRussia “received no answer” when it asked its international partners to provide information on terrorist targets in Syria, or to say at least where its planes shouldn’t bomb, Putin said. “It’s not a joke, I’m not making any of this up,” he said.\nPutin makes a more logical argument. Namely that when one drops 50 tons of ammo from the sky into the most dangerous place on earth, there’s absolutely no way to know for sure where it will ultimately end up:\nU.S. air drops of weapons and ammunition intended for the Syrian Free Army, which is fighting Assad’s regime, could end up in the hands of Islamic State instead, Putin said.\nYes, they might “end up in the hands of Islamic State” which we’re sure wasn’t what Washington had in mind. Oh ... wait...\nSource URL", "external_links": ["http://www.blacklistednews.com/Putin_Calls_US%2C_Allies_%22Oatmeal_Heads%22_On_Syria/46656/0/38/38/Y/M.html"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T16:21:03.471+03:00", "highlightTitle": ""}