{"organizations": [], "uuid": "b1e55773764f605d5ec9a0f5c4ca212272d944aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30330903/nasa-calls-for-american-industry-ideas-on-arm-spacecraft-development", "country": "US", "title": "NASA Calls for American Industry Ideas on ARM Spacecraft Development", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "NASA Calls for American Industry Ideas on ARM Spacecraft Development - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "b1e55773764f605d5ec9a0f5c4ca212272d944aa"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30330903/nasa-calls-for-american-industry-ideas-on-arm-spacecraft-development", "ord_in_thread": 0, "title": "NASA Calls for American Industry Ideas on ARM Spacecraft Development", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " NASA\nWASHINGTON , Oct. 22, 2015 /PRNewswire-USNewswire/ -- NASA, through its Jet Propulsion Laboratory (JPL) in Pasadena, California , has issued a call to American industry for innovative ideas on how the agency could obtain a core advanced solar electric propulsion-based spacecraft to support the Asteroid Redirect Robotic Mission (ARRM).\nPart of NASA's overall Asteroid Redirect Mission (ARM), this mission will use a number of important technologies to prepare for an early human exploration mission in deep space -- specifically, the area around the moon known as cislunar space. The robotic mission also will provide the first large-scale asteroid samples on which to conduct research and analysis for better understanding of the composition and nature of these primordial planetary bodies, leading to future use of in-situ resources from asteroids. The mission both uses and expands NASA's ability to detect, characterize and mitigate the threat these space rocks pose to our home planet. The highest priority of ARM is to affordably demonstrate and prove new capabilities needed for future human missions to Mars.\n\"We're eager to hear from American companies on their ideas for a spacecraft design that could accommodate our advanced solar electric propulsion requirements and robotic technologies,\" said NASA Associate Administrator Robert Lightfoot . \"We're also interested in what sorts of innovative commercial, international and academic partnerships opportunities might be practical and help reduce overall mission costs while still demonstrating the technologies we need for our journey to Mars.\"\nNASA's ARRM is being formulated to perform a number of technology demonstrations needed for the agency's journey to Mars , including the use of a 20-fold improvement in state-of-the-art deep space solar electric propulsion capability to move and maneuver multi-ton objects. The objective of the robotic segment of ARM is to acquire a multi-ton boulder from a large asteroid and redirect it to a crew-accessible orbit around our moon, setting the stage for future integrated crewed and robotic vehicle operations in deep space.\nNASA's ARRM spacecraft will need to be able to demonstrate support of high power solar electric propulsion, with initial solar array power of approximately 50 kilowatts. The robotics capture system planned aboard the pioneering vehicle will be capable of acquiring a 20 ton (or larger) boulder of up to about 19 feet (six meters) in width from an asteroid's surface and then returning it to an astronaut-accessible orbit near our moon. The spacecraft is being formulated to fit atop a variety of launch vehicles -- NASA's Space Launch System or a commercially provided rocket. The spacecraft will need to be ready for launch by the end of 2020.\nWhile at a large asteroid, the spacecraft will demonstrate a \"slow-push\" planetary defense asteroid deflection technique during the mission. This uses the spacecraft and boulder's combined gravitational pull to attempt to change the course of an asteroid.\nARM brings together the best of NASA's science, technology and human exploration efforts to accomplish several important objectives that are critical elements during our journey to Mars.\nRedirecting and \"parking\" a large asteroid boulder within reach of human and robotic explorers also will provide American commercial enterprises their first opportunities to investigate the viability of mining asteroids for precious metals and other resources.\nNASA's Asteroid Redirect Mission and the robotic component of the overall mission will be the topic of an online Adobe Connect community update on Friday, Oct. 23 from 10 a.m. to 1 p.m. EDT . During the update, NASA leaders will share recent developments for the Asteroid Redirect Mission, including the recent spacecraft design study solicitation and the selection of the mission's Formulation Assessment and Support Team members. The Adobe Connect meeting is open to the public. Access to the online session will be available a few minutes before the start of the update at:\nhttps://ac.arc.nasa.gov/arrm\nMore information about NASA's Asteroid Redirect Mission and the agency's Asteroid Initiative is available online at:\nhttp://www.nasa.gov/asteroidinitiative\n releases/nasa-calls-for-american-industry-ideas-on-arm-spacecraft-development-300165252.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DC36592&Transmission_Id=201510222011PR_NEWS_USPR_____DC36592&DateId=20151022", "http://www.xmlnews.org/ns/", "https://ac.arc.nasa.gov/arrm", "http://www.nasa.gov/content/what-is-nasa-s-asteroid-redirect-mission", "http://www.prnewswire.com/news-releases/nasa-calls-for-american-industry-ideas-on-arm-spacecraft-development-300165252.html", "http://photos.prnewswire.com/prnvar/20081007/38461LOGO", "http://www.nasa.gov/asteroidinitiative", "http://www.nasa.gov/journeytomars", "https://www.fbo.gov/index?s=opportunity&mode=form&id=1f2abc476fe15dd49954dc197c472fd7&tab=core&_cview=0"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T08:45:00.075+03:00", "highlightTitle": ""}