{"organizations": [], "uuid": "76e57ea6cfa02f19d9cda59495d777968a06a6c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/ae/f4/d2ac63854616929298246a95ac29/141205-wholegrains-stock.jpg", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/opinion/articles/2015/10/05/why-the-science-behind-the-dietary-guidelines-matters", "country": "US", "title": "Why the Science behind the Dietary Guidelines Matters", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Why the Science behind the Dietary Guidelines Matters - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "76e57ea6cfa02f19d9cda59495d777968a06a6c1"}, "author": "USNews", "url": "http://www.usnews.com/opinion/articles/2015/10/05/why-the-science-behind-the-dietary-guidelines-matters", "ord_in_thread": 0, "title": "Why the Science behind the Dietary Guidelines Matters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Science in our Diet The 2015 dietary guidelines report strays from fact-based nutrition advice – and that's a problem.\nDietary guidelines must be based on science.\nBy Mike Conaway Oct. 5, 2015 | 8:00 a.m. EDT + More As chairman of the House Committee on Agriculture, a consumer and a father, it is important that guidance that comes out of the 2015 Dietary Guidelines for Americans report is based on sound, consistent, irrefutable science. This government document is not only a recommendation for the American people to guide healthy food purchasing decisions for a healthy lifestyle – it also forms the basis of federal nutrition policy, education, outreach and food assistance programs used by consumers, industry, nutrition educators and health professionals.\nThis is why I am particularly concerned that the 2015 Dietary Guidelines Advisory Committee's report strays from strictly nutritional evidence and ventures into areas like sustainability and tax policy. At a time when consumers are already subjected to conflicting and often contradictory nutrition and health information, providing the public with science-based, realistic and achievable directives is more likely to contribute to improved public health outcomes.\nThe scope of these nutritional recommendations affects the lives of all Americans – often in ways they may not even recognize. Under the Health and Human Services Department, the Food and Drug Administration considers aspects of the dietary guidelines for food and labeling initiatives. Likewise, the Food and Nutrition Service within the Department of Agriculture uses the guidelines to adjust food benefits for the Supplemental Nutrition Assistance Program (commonly known as food stamps) and the Special Supplemental Nutrition Program for Women, Infants and Children. Other agencies that utilize the information include the Centers for Disease Control and Prevention, National Institutes of Health, the Food Safety and Inspection Service, the Center for Nutrition Policy and Promotion and more.\n[ SEE: Political Cartoons on Congress ]\nThe Dietary Guidelines report is congressionally mandated under the National Nutrition Monitoring and Related Research Act of 1990. The law instructs that the report shall contain nutritional and dietary information and guidelines for the general public, be \"based on the preponderance of the scientific and medical knowledge which is current at the time the report is prepared\" and \"be promoted by each Federal agency in carrying out any Federal food, nutrition, or health program.\"\nIn February 2015, the Dietary Guidelines Advisory Committee, which is the key advisory committee selected by HHS and USDA, released its record-setting 571-page report outlining its recommendations. Yet according to the underlying statute, the committee greatly exceeded its scope by straying from traditional nutritional recommendations and advising on wider policy issues like sustainability and tax policy, areas with which members of the committee had neither expertise, evidence nor charter.\nNot only did the committee exceed its scope when developing its recommendations, but the 2015 report raises concerns that studies were selected or excluded in order to support predetermined conclusions. It is crucial for HHS and the USDA to recognize the need for flexibility in the American diet to reflect the diverse population of this country. Inaccurate and conflicting dietary guidance messages are detrimental to consumer understanding of nutrition and their ability to build healthy diets.\n[ READ: Farm Follies ]\nWe have already seen how misguided recommendations have ill effects not only on consumers but for agriculture production as well. For example, for decades the Dietary Guidelines Advisory Committee has recommended that Americans decrease their consumption of cholesterol, citing eggs as a top contributor of dietary cholesterol. Consequently, per capita consumption of eggs dropped roughly 30 percent and dramatically affected egg farmers. Yet this warning was recently overturned in the 2015 report. Before the federal government makes recommendations that could have long-lasting consequences for agricultural industries, we must guarantee the science is clear and irrefutable.\nCompared to prior advisory committee reports, the 2015 report contained a seemingly unprecedented expansion in the scope of issues the committee chose to address. It is extremely difficult to reverse or change public policy, once enacted, without causing consumer confusion.\n[ READ: Food Waste Is an Environmental Problem ]\nUSDA and HHS will jointly release the final guidelines later this year, and in the meantime, the agencies have received over 29,000 comments, many of which were developed by nutritionists and other experts in the study of the human body. Included in these submitted comments, available for public viewing on the committee's website, were scientific studies and other evidence that observers assert have been ignored by the advisory committee. This is why we expect each and every comment to be considered by USDA and HHS before the final dietary guidelines are published.\nGiven its expansion of the scope of evidence and movement away from its charter, there is a concern about whether the committee's recommendations will maintain the scientific integrity necessary to benefit the public. It is my hope that as USDA and HHS review the 2015 dietary committee recommendations, they consider the scientific evidence behind each of the determinations to ensure Americans are presented with the best and most reliable information for achieving a healthy, nutritional lifestyle.\nTAGS: diet and nutrition Congress USDA HHS food safety", "external_links": ["http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdpb89%3Fsrc=usn_li&title=Why%20the%20Science%20behind%20the%20Dietary%20Guidelines%20Matters&summary=The%202015%20dietary%20guidelines%20report%20strays%20from%20fact-based%20nutrition%20advice%20%E2%80%93%20and%20that%27s%20a%20problem.%3Cbr%20%2F%3E&source=U.%20S.%20News", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdpb89%3Fsrc=usn_tw&via=usnews&text=Why%20the%20Science%20behind%20the%20Dietary%20Guidelines%20Matters", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdpb89%3Fsrc=usn_fb", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdpb89%3Fsrc=usn_rd&title=Why%20the%20Science%20behind%20the%20Dietary%20Guidelines%20Matters", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdpb89%3Fsrc=usn_su", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdpb89%3Fsrc=usn_gp"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T15:02:47.615+03:00", "highlightTitle": ""}