{"organizations": [], "uuid": "3646625e053103f107bce3d95b7ae744c15b6a14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/10/15/us/politics/15whowon-image/15whowon-image-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Politics.xml", "section_title": "NYT &gt; Politics", "url": "http://www.nytimes.com/2015/10/15/us/politics/democratic-debate-hillary-clinton-bernie-sanders-biden.html", "country": "US", "title": "Who Won and Lost the Democratic Debate? The Web Has Its Say", "performance_score": 4, "site": "nytimes.com", "participants_count": 1, "title_full": "Who Won and Lost the Democratic Debate? The Web Has Its Say - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T11:25:00.000+03:00", "replies_count": 0, "uuid": "3646625e053103f107bce3d95b7ae744c15b6a14"}, "author": "Alan Rappeport", "url": "http://www.nytimes.com/2015/10/15/us/politics/democratic-debate-hillary-clinton-bernie-sanders-biden.html", "ord_in_thread": 0, "title": "Who Won and Lost the Democratic Debate? The Web Has Its Say", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Bloggers, commentators and the Twitterati quickly weighed in on the first Democratic debate, scoring the winners and losers. Hillary Rodham Clinton was the clear victor, according to the opinion shapers in the political world (even conservative commentators).\n Vermont won some points for his integrity, while the others — Martin O’Malley, the former governor of Maryland; Jim Webb , the former senator from Virginia and secretary of the Navy; and Lincoln Chafee , the former Rhode Island governor and senator — were mostly viewed as having missed their chance.\nSome suggested that another loser was the man still deciding on a run, Vice President Joseph R. Biden Jr. , as Mrs. Clinton appeared to be formidable. Others disagreed.\n“I’m still amazed the other four candidates made Hillary Clinton come off as the likable, reasonable, responsible Democrat.” — Erick Erickson , the conservative radio host\n Critic's Notebook: In First Debate, Democrats Keep the Drama to a Minimum OCT. 14, 2015 Hillary “Hillary Clinton won. She won because she’s a strong debater. She won because Bernie Sanders is not. She won because the focused on liberal policies — and not her email scandal or character.” — Ron Fournier , The National Journal\n“One impression from Tuesday night’s Democratic debate: Vice President Joe Biden has no rationale to step into the race. If he’s been waiting until after this first prime-time test to see if Hillary Clinton collapsed, he must have seen for himself that she crushed it.” — Fred Kaplan , an author who writes about military issues and policy for Slate\n“Hillary was (astonishingly) much more likable and personable than everyone’s favorite crazy socialist uncle. She had few to no cringe-inducing moments. She deftly threw red meat to the base when presented with the opportunity without saying anything that would hurt her in the general.” — Leon H. Wolf , Red State, a conservative blog\n“It was, without question, the climax of the debate. Hillary Clinton was defending herself against email allegations, when Bernie Sanders came to her rescue. In doing so, he not only demonstrated the decency that is the hallmark of his campaign, but also proved that he’s no ordinary politician.” — Brian Hanley , The Huffington Post\n“Hillary Clinton won because all of her opponents are terrible.” — Ryan Lizza , The New Yorker\n“The former governor of Maryland needed a moment in this debate to break out of the 1 percent crowd. He didn’t get one. Oddly, O’Malley sounded the most like a politician of anyone on the stage even though he is the only one who has never spent any time in office in the nation’s Capitol.” — Chris Cillizza , The Washington Post\n“Intense and brooding. Had trouble getting in the mix or finding a resonant voice on issues, even in his foreign policy wheelhouse. Frequently expressed frustration about a lack of talk time, coming across as griping and grumpy.” — Mark Halperin , Bloomberg Politics, labeling Mr. Webb the debate’s biggest loser\n“Perhaps the biggest loser was the man who was not there — Vice President Joe Biden. While his draft committee ran a powerful ad showing the person and his values in Mr. Biden’s own voice, the fact is that Mrs. Clinton was just commanding tonight. Mr. Biden has to decide now and not kick the can down the road because of deadlines. I don’t see how he chooses to run now.” — John Zogby , the pollster, who writes at Forbes\n“There is a very real opportunity for Joe Biden to enter the race after this first debate. Just like respondents in last night’s pre-debate focus group, people were deeply affected by Draft Biden’s emotional ad urging Biden to run. After watching the ad, 20 people indicated that it made them want Biden to run — just after seeing the ad.” — Chris Kofinis, whose company, Park Street Strategies, conducted a focus group of 39 undecided Iowa Democrats\n“Cruel to say but true, Chafee’s ‘I’d just been appointed to my dad’s Senate seat, I was confused’ answer will join ranks of disastrous replies.” — James Fallows , The Atlantic\nLoading... Go to Home Page »\nSite Index The New York Times News World U.S. Politics N.Y. Business Tech Science Health Sports Education Obituaries Today's Paper Corrections Opinion Today's Opinion Op-Ed Columnists Editorials Contributing Writers Op-Ed Contributors Opinionator Letters Sunday Review Taking Note Room for Debate Public Editor Video: Opinion Arts Today's Arts Art & Design ArtsBeat Books Dance Movies Music N.Y.C. Events Guide Television Theater Video Games Video: Arts Living Automobiles Crossword Food Education Fashion & Style Health Jobs Magazine N.Y.C. Events Guide Real Estate T Magazine Travel Weddings & Celebrations Listings & More Classifieds Tools & Services Times Topics Public Editor N.Y.C. Events Guide TV Listings Blogs Multimedia Photography Video NYT Store Times Journeys Subscribe Manage My Account Subscribe Subscribe Times Insider Home Delivery Digital Subscriptions NYT Opinion Crossword Email Newsletters Alerts Gift Subscriptions Corporate Subscriptions Education Rate Mobile Applications Replica Edition International New York Times", "external_links": ["https://twitter.com/JamesFallows/status/654138655242633216", "http://www.huffingtonpost.com/brian-hanley/bernie-sanders-won-the-de_1_b_8290498.html", "http://www.bloomberg.com/politics/articles/2015-10-14/grading-the-democratic-debate-hillary-clinton-schools-her-rivals", "http://www.forbes.com/sites/johnzogby/2015/10/13/clinton-and-sanders-are-obvious-winners-in-democratic-debate-but-biden-loses-big-as-a-no-show/", "https://www.washingtonpost.com/news/the-fix/wp/2015/10/13/winners-and-losers-from-the-1st-democratic-presidential-debate/", "http://www.redstate.com/2015/10/13/hillary-clinton-wins-round-1-knockout-think/", "http://www.nationaljournal.com/s/90050/hillary-clinton-won-wont-always-be-this-way?mref=home", "https://twitter.com/EWErickson/status/654138188705976320", "http://static01.nyt.com/images/2015/10/13/us/politics/hanerdemdebatepool-286/hanerdemdebatepool-286-thumbStandard.jpg", "http://static01.nyt.com/images/2015/10/14/us/SUB-14UP-Assess/SUB-14UP-Assess-thumbStandard-v2.jpg", "http://linkis.com/5DTOK", "http://static01.nyt.com/images/2015/10/13/us/politics/hanerdemdebatepool-303/hanerdemdebatepool-303-thumbStandard.jpg", "http://a1.nyt.com/assets/article/20151009-111728/images/foundation/logos/", "https://twitter.com/RyanLizza/status/654129142070386688"], "published": "2015-10-14T11:25:00.000+03:00", "crawled": "2015-10-14T12:01:33.376+03:00", "highlightTitle": ""}