{"organizations": ["Associated Press   Wisconsin Assembly"], "uuid": "d7c434c61b3205369558bb17e9c5767f0684f55f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://washingtontimes.com/rss/headlines/news/politics/", "section_title": "www.washingtontimes.com stories: Politics", "url": "http://www.washingtontimes.com/news/2015/oct/22/news-from-around-wisconsin-at-558-pm-cdt/", "country": "US", "title": "News from around Wisconsin at 5:58 p.m. CDT", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 0, "title_full": "News from around Wisconsin at 5:58 p.m. CDT", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7c434c61b3205369558bb17e9c5767f0684f55f"}, "author": "", "url": "http://www.washingtontimes.com/news/2015/oct/22/news-from-around-wisconsin-at-558-pm-cdt/", "ord_in_thread": 0, "title": "News from around Wisconsin at 5:58 p.m. CDT", "locations": ["Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News from around Wisconsin at 5:58 p.m. CDT Thursday, October 22, 2015 By - Associated Press   Wisconsin Assembly committee approves anti-heroin bills \nMADISON, Wis. (AP) - Wisconsin lawmakers moved closer Thursday to passing another round of legislation designed to combat heroin abuse, pushing the bills through an Assembly committee with overwhelming support. \nThe package includes four bills. One would require opiate dispensers to enter prescriptions into a statewide data within 24 hours - there is currently no deadline for reporting. Another proposal would require police who find an opiate prescription at an overdose scene to enter it in the database. A third measure would create methadone and pain clinic registries within the state Department of Health Services. The fourth bill would require treatment programs that use methadone to report the number of people receiving the medication annually to the DHS. \nThe Assembly health committee approved all four bills on unanimous votes during a brief meeting Thursday morning. Approval clears the way for the full Assembly to vote on the measures. Republican leaders haven’t scheduled any votes yet, however. Kit Beyer, a spokeswoman for Assembly Speaker Robin Vos, R-Rochester, said the body likely will take up the bills this spring. \nThe state Senate’s health committee unanimously approved the 24-hour reporting deadline, the clinic registries and methadone reporting bills earlier this month. The Senate’s judiciary committee held a public hearing Thursday on requiring police to document prescriptions in the database. Scott Kelly, an aide to judiciary committee chairman Sen. Van Wanggaard, R-Racine, said the committee plans to vote on that measure next week. \nRep. John Nygren, a Marinette Republican who co-chairs the Legislature’s powerful budget committee, wrote all four bills. His daughter, Cassie, has struggled with a heroin addiction for several years; she was sentenced to a year and a half in prison in 2009 and pleaded guilty last March to felony narcotics possession and was sentenced to drug court. He has said the legislation is designed to prevent prescription drug use from blossoming into heroin addiction. \nNygren introduced seven anti-heroin bills during the last legislative session. Those bills required identification to obtain prescription drugs; allowed emergency responders to administer the overdose antidote Narcan; and allowed physicians to give health centers, pharmacies and clinics general permission to dispense Narcan without specific prescriptions. Gov. Scott Walker signed all of the bills into law last spring. \nBoth the Assembly and Senate health committees unanimously approved a fifth Nygren bill Thursday clarifying that pharmacies can hand out Narcan under a physician’s general standing order. Nygren drew up the bill to address Attorney General Brad Schimel’s concerns that the law allowing general dispensation didn’t technically trump other statutes requiring prescriptions to include the recipient’s name, Nygren aide Jennifer Malcore said. \n___ Senator says he has ‘no idea’ whether GAB bill will pass \nMADISON, Wis. (AP) - The chairman of the Senate elections committee said Thursday he had “no idea” whether the full Senate would pass a bill that his panel advanced that would do away with Wisconsin’s nonpartisan elections board. \nRepublican Sen. Devin LeMahieu commented after his committee voted 3-2 to advance that bill and another that would overhaul Wisconsin’s campaign finance law, with Republicans in support and Democrats against. \nThe Assembly passed both proposals on Wednesday, shifting the focus to the Senate, where they also must be approved in identical form before they can be sent to Gov. Scott Walker for his consideration. Some Republican senators are calling for changes to both bills, leading to questions about whether the Senate and Assembly can reach agreement. \nThe bill doing away the nonpartisan Government Accountability Board would replace the panel with two separate commissions, one overseeing elections and the other handling campaign finance, ethics and lobbying laws. The new commissions, unlike the current board comprised of former judges, would be made up of an equal number of Republican and Democratic appointees. \nRepublican Sen. Luther Olsen said this week that he and two or three other Republican senators had concerns about removing the judges and replacing them with partisan appointees. If three or more Republican senators didn’t back the bill, it wouldn’t have enough support to pass.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T07:51:49.100+03:00", "highlightTitle": ""}