{"organizations": [], "uuid": "a41a7ae5904d22f5ddceaf9667a66390d345f76a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/politics", "section_title": "Politics | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/14/markets/oil-prices-waver-oversupply-concerns", "country": "US", "title": "Oil prices waver on oversupply concerns", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "Oil prices waver on oversupply concerns | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T05:02:00.000+03:00", "replies_count": 0, "uuid": "a41a7ae5904d22f5ddceaf9667a66390d345f76a"}, "author": "Dow Jones newswires", "url": "https://www.businessspectator.com.au/news/2015/10/14/markets/oil-prices-waver-oversupply-concerns", "ord_in_thread": 0, "title": "Oil prices waver on oversupply concerns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oil prices wavered in volatile trading on Wednesday amid lingering concerns about the global oversupply of crude at a time when demand is falling.\nOil rallied at the beginning of the month, with Brent crude passing the key $US50-a-barrel mark, on expectations that cuts in production capacity among major producers will curb supply. But strong output data from the Organization of the Petroleum Exporting Countries and the prospect of Iran's return to the market have fueled fears that the global glut of crude isn't going away anytime soon.\n\"Oil prices failed to ignite after the strong rally late last week and the bullish momentum has dissipated,\" said Daniel Ang, analyst at Phillip Futures.\nBrent crude, the global oil benchmark, fell 0.1 per cent to $US49.55 a barrel on London's ICE Futures exchange. On the New York Mercantile Exchange, West Texas Intermediate futures were trading down 0.1 per cent at $US46.65 a barrel.\nIran's parliament on Tuesday approved the nuclear deal agreed with six world powers in July, bringing Tehran another step closer to the easing of international economic sanctions. This would pave the way for an increase of Iran's oil production toward 3.6 million barrels a day from 2.9 million barrels a day currently, according to the International Energy Agency.\nThe IEA, which represents some of the world's largest oil consuming nations, reported on Tuesday that global oil demand will slow to 1.2 million barrels a day next year, from a five-year high of 1.8 million barrels a day in 2015.\nA combination of ample supply and tepid demand has battered oil prices since last summer. Yet many big producers like Saudi Arabia and Iraq haven't cut their output in a bid to protect -- and gain -- market share.\n\"The market surplus has been sustained by OPEC production that has risen in the face of falling oil prices, and could rise further as Iran returns to the export market,\" said Tim Evans, oil analyst at Citi Futures. \"Progress toward political stability in Libya could add to OPEC total supply as well.\"\nMarket participants are bracing for the weekly release of US supply data. The American Petroleum Institute, an industry group, will release its estimate for the domestic inventory levels later on Wednesday. The US Department of Energy on Thursday will publish its official inventory report along with oil production data.\nUS output, which had fueled the global oversupply in the past few years, peaked in April at 9.6 million barrels a day and has been falling since.\nNymex reformulated gasoline blendstock -- the benchmark gasoline contract -- fell 0.4 per cent to $US1.31 a gallon. ICE gasoil changed hands at $US453.50 a metric ton, down $US2.50 from the previous settlement.", "external_links": [], "published": "2015-10-15T05:02:00.000+03:00", "crawled": "2015-10-14T13:58:11.722+03:00", "highlightTitle": ""}