{"organizations": [], "uuid": "1330f5c740423d0431835971974deffbd0789bb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/05/a3b9180d-63d5-464d-bd7f-87cd132edc3a/thumbnail/620x350/7db796f9f20f0ef08ebca3aff1a9ead1/ap804208069054.jpg", "site_section": "http://cbsnews.com/feeds/rss/politics.rss", "section_title": "Politics - CBSNews.com", "url": "http://www.cbsnews.com/news/new-hampshire-gov-maggie-hassan-will-challenge-sen-kelly-ayotte/", "country": "US", "title": "New Hampshire Gov. Maggie Hassan will challenge Sen. Kelly Ayotte", "performance_score": 0, "site": "cbsnews.com", "participants_count": 4, "title_full": "New Hampshire Gov. Maggie Hassan will challenge Sen. Kelly Ayotte - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T14:23:00.000+03:00", "replies_count": 3, "uuid": "a3ae2ad9cb801e54187f49224fca0872b4d74e68"}, "author": "AP", "url": "http://www.cbsnews.com/news/new-hampshire-gov-maggie-hassan-will-challenge-sen-kelly-ayotte/#post-0", "ord_in_thread": 0, "title": "New Hampshire Gov. Maggie Hassan will challenge Sen. Kelly Ayotte", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CONCORD, N.H. -- New Hampshire Gov. Maggie Hassan is running for the U.S. Senate, setting the stage for a contest with Republican incumbent Kelly Ayotte that could be critical to determining control of the chamber.\nIn an online video released Monday morning, the Democratic governor says she's running to bring a bipartisan, common-sense governing approach to Washington that mirrors that of New Hampshire. She says Washington has given in to powerful special interests and lobbyists \"who rigged the system for themselves and against the middle class.\" Watch Hassan's video here:\n\nHassan, in her second term as governor, is the first Democrat to announce she's in the race to challenge Ayotte, a first-term senator. Hassan, 57, has long been considered the party's strongest challenger to Ayotte. Democrats fare well in New Hampshire during presidential elections, when the party's voter turnout spikes, creating a tougher landscape for Ayotte than her first election in 2010.\nAyotte says she expects a \"very spirited campaign.\"\nHassan's announcement comes a little over two weeks after reaching a deal with legislators allowing an $11.3 billion budget plan to go into effect after a months-long stalemate. Republicans control both the House and Senate in Concord.\nHassan mentions the budget deal in her nearly 2 1/2-minute video, as well as the state's Medicaid expansion law that took effect in 2014 and a tuition freeze at the state university system during her first year in office. Hassan dealt with a divided Legislature during her first term, with Republicans running the Senate and Democrats controlling the House.\n\nPlay Video CBS This Morning Bonds between female senators that make Washington work Capitol Hill gridlock is now the norm, but issues gaining traction in the Senate -- like campus sexual assault and human trafficking -- share one... \n\"I can believe we can do better for New Hampshire families,\" she says in the video. She also references a teacher who can't afford to send her child to college, a police officer worried about losing students to drug abuse and \"thousands of women who've had access to health care services threatened by politicians playing games with Planned Parenthood.\"\nSo-called women's issues are likely to be a major focus of the 2016 campaign . Ayotte does not support funding for Planned Parenthood, which has been questioned in recent months for providing fetal tissue from abortions for research. But Ayotte warned her fellow GOP lawmakers last week against shutting down the government over funding for the organization.\nAyotte, a former state attorney general, officially launched her re-election bid during the summer. One of a few female GOP senators, Ayotte rose quickly to national prominence and is often a leading Republican voice on national security and other issues. She has often been mentioned as a potential vice presidential candidate.", "external_links": [], "published": "2015-10-05T14:23:00.000+03:00", "crawled": "2015-10-06T01:02:33.914+03:00", "highlightTitle": ""}