{"organizations": [], "uuid": "d0a1fa394a7c8852c70f42294b50194c49263be1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30238092/opposites-come-together-in-manchester-nh-today-as-presidential-candidates-from-both-parties-address-thousands-at-problem-solver-convention", "country": "US", "title": "Opposites Come Together In Manchester, NH Today As Presidential Candidates from Both Parties Address Thousands at Problem Solver Convention", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Opposites Come Together In Manchester, NH Today As Presidential Candidates from Both Parties Address Thousands at Problem Solver Convention - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "d0a1fa394a7c8852c70f42294b50194c49263be1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30238092/opposites-come-together-in-manchester-nh-today-as-presidential-candidates-from-both-parties-address-thousands-at-problem-solver-convention", "ord_in_thread": 0, "title": "Opposites Come Together In Manchester, NH Today As Presidential Candidates from Both Parties Address Thousands at Problem Solver Convention", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " No Labels\nMANCHESTER, N.H. , Oct. 12, 2015 /PRNewswire-USNewswire/ -- Calling a time out in partisan bickering, eight presidential candidates from both parties today will address two thousand No Labels citizen members who are gathering here today to seek answers to the question, how? How will the next president and Congress come together to solve America's problems?\n\"There has never been an event like this in New Hampshire before and No Labels has clearly hit a nerve,\" said No Labels co-chair Jon Huntsman . \"Voters are tired of hearing the same empty promises and seeing the same failed results election after election. The Problem Solver Convention is the first step in No Labels' yearlong effort to get our leaders focused on a new politics of problem solving where both parties come together around big goals that matter to the American people.\"\nThe Problem Solver Convention, organized by No Labels and The Hill, is the first opportunity for voters to hear from candidates from both major parties. No Labels is a growing citizens movement of Democrats, Republicans and independents dedicated to ushering in a new era of problem solving in American politics.\nParticipating presidential candidates include Gov. Chris Christie (R-NJ), Sen. Lindsay Graham (R-SC), Gov. John Kasich (R-OH), Gov. Martin O'Malley (D-MD), Gov. George Pataki (R-NY), Sen. Bernie Sanders (I-VT), Mr. Donald Trump (R), Sen. Jim Webb (D-VA).\n\"We're so committed to bipartisanship today that every Democrat will be introduced by a Republican and vice versa,\" said No Labels co-chair Joe Lieberman . \"You wouldn't expect a Democratic presidential candidate to be introduced by the former head of CPAC, but that's exactly what's happening today.\"\nProblem Solver Convention attendees will also hear from New Hampshire Democrat and Republican state party chairs Ray Buckley (D) and Jennifer Horn (R), Gov. Maggie Hassan (D-NH), Sen. Kelly Ayotte (R-NH), Sen. Cory Gardner (R-CO), and Sen. Ben Nelson (D-FL), as well as from members of Congress from both sides of the aisle.\nThe No Labels movement urges presidential candidates to support broad goals of its National Strategic Agenda and to commit to meeting with Congressional leaders of both parties within 30 days of taking office.\nToday's full-day Problem Solver Convention is available live online at www.NoLabels.org and on C-SPAN.\nLogo - http://photos.prnewswire.com/prnh/20151012/275954LOGO\n releases/opposites-come-together-in-manchester-nh-today-as-presidential-candidates-from-both-parties-address-thousands-at-problem-solver-convention-300157766.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151012/275954LOGO", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC25503&Transmission_Id=201510120730PR_NEWS_USPR_____DC25503&DateId=20151012", "https://photos.prnewswire.com/prnvar/20151012/275954LOGO", "http://www.nolabels.org/", "http://www.prnewswire.com/news-releases/opposites-come-together-in-manchester-nh-today-as-presidential-candidates-from-both-parties-address-thousands-at-problem-solver-convention-300157766.html"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T14:57:37.469+03:00", "highlightTitle": ""}