{"organizations": [], "uuid": "d744699c251d57a03fcb7d458a7ecca6d01cc25d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://washingtontimes.com//rss/headlines/news/politics/", "section_title": "www.washingtontimes.com stories: Politics", "url": "http://www.washingtontimes.com/news/2015/sep/30/south-carolina-editorial-roundup/", "country": "US", "title": "South Carolina editorial roundup", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "South Carolina editorial roundup", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:43:00.000+03:00", "replies_count": 0, "uuid": "d744699c251d57a03fcb7d458a7ecca6d01cc25d"}, "author": "The Associated Press", "url": "http://www.washingtontimes.com/news/2015/sep/30/south-carolina-editorial-roundup/", "ord_in_thread": 0, "title": "South Carolina editorial roundup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By The Associated Press - Associated Press   \nRecent editorials from South Carolina newspapers: \nSept. 23 \nThe Herald, Rock Hill, South Carolina, on domestic violence in state: \nSouth Carolina once again has ranked worst in the nation for deadly violence against women. This is the fourth time that the state has ranked first and the 18th consecutive year it has ranked in the top 10. \nBut South Carolina cannot accept this as our destiny. And, with significant changes in state law regarding penalties for domestic violence and ongoing attention to the problem, the state finally appears to be taking steps to reduce the violence against women. \nAccording to rankings released Tuesday by the Violence Policy Center, South Carolina had a rate of 2.32 women killed per 100,000 in 2013, the worst in the nation. That’s more than twice the national average and represents 57 known deaths, compared with 50 a year earlier, when the state ranked second in the nation in the number of women killed by men. \nBut earlier this year, state lawmakers passed a substantive domestic violence bill that increased penalties for those convicted of criminal domestic violence. The effort also was supported by both Gov. Nikki Haley and S.C. Attorney General Alan Wilson, who lobbied hard for reforms. \nHaley created a special task force, which still is in place, to study the causes of domestic violence and find ways to reduce it. Wilson was joined by local prosecutors from across the state who worked with him to bring about new and stiffer penalties for domestic abusers. \nVictim advocate groups also were effective in calling for changes. When lobbying lawmakers, they noted that penalties were greater for hunting out of season than for domestic abuse. \nThe bill passed by the Legislature gave prosecutors and judges more options in dealing with domestic abuse. The new law creates a four-tiered system of possible crimes with which suspects can be charged, ranging from a misdemeanor with a possible 90-day sentence to a felony punishable by up to 20 years in prison. \nAnd those convicted of the most serious charges could be barred from owning a gun for up to a decade. \nBut while these changes in the law are a crucial step in dealing with domestic abuse, the state’s high rate of violence is not likely to change until we also address the root causes of violence against women. \nWe are encouraged that Haley’s task force, which has been meeting all year, has proposed dozens of wide-ranging recommendations that promote a comprehensive approach to the problem. Proposals include training and hiring more 911 operators, improving documentation of the crime scene and increasing the number of shelters for abused women and their children statewide. \nIn addition to changing the law, we also must change the culture. We must encourage friends and neighbors to report domestic abuse when they see evidence of it. We need to teach young males nonviolent ways to resolve domestic disputes. We need to provide more safe havens for abused women so they can leave violent relationships. We need to teach law enforcement officers the most effective ways to handle cases of domestic abuse in the field and later, when questioning victims and suspects. \nWhile South Carolina has a long way to go, changes taken this year appear likely to yield results. With hard work, maybe the state finally can lose its ranking among the top-10 states for domestic violence.", "external_links": [], "published": "2015-09-30T23:43:00.000+03:00", "crawled": "2015-10-01T00:18:13.855+03:00", "highlightTitle": ""}