{"organizations": [], "uuid": "e5ab499ed39d2af1a882914ca26ff7bd1f563041", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/Indrani-Mukerjea_1_0_0.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151007/nation-current-affairs/article/indrani-mukerjea-denies-attempting-suicide-cbi-grill-accused", "country": "US", "title": "Indrani Mukerjea denies attempting suicide, CBI to grill accused", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Indrani Mukerjea denies attempting suicide, CBI to grill accused", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T10:13:00.000+03:00", "replies_count": 0, "uuid": "e5ab499ed39d2af1a882914ca26ff7bd1f563041"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151007/nation-current-affairs/article/indrani-mukerjea-denies-attempting-suicide-cbi-grill-accused", "ord_in_thread": 0, "title": "Indrani Mukerjea denies attempting suicide, CBI to grill accused", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 07, 2015, 19.37 pm Indrani Mukerjea stated she had not accumulated the medicines to commit suicide, says police. (Photo: Facebook) Mumbai: Indrani Mukerjea, prime accused in the sensational Sheena Bora murder case, has told the police that she did not attempt suicide with an overdose of medicines but fell unconscious due to shock and trauma after hearing about her mother's death in Guwahati.\nIn her statement to the jail authorities after she was brought back to the prison on Tuesday from J J hospital, where she had been under treatment since Friday after falling unconscious, Indrani stated she had not accumulated the medicines to commit suicide, police officer, requesting anonymity, said.\nThe 43-year-old fainted in the jail due to suspected drug overdose and rushed to the state-run medical facility six days back. Indrani stated that she was in a state of shock after learning about her mother's death, the officer said. She also told the police that her condition had worsened in a similar way when she was a 13-year old, they said.\n\"The jail authorities yesterday recorded the statement of Indrani,\" ADG (Prisons) B K Upadhyay said.\nRead:\nCBI seeks permission to question Indrani Mukerjea\nIndrani Mukerjea is safe and out of danger, say JJ Hospital Doctors\nIndrani Mukerjea critical, next 48 hours crucial: JJ Hospital\nSheena Bora case: Indrani Mukerjea critical after suicide attempt; CM orders probe\nIndrani Mukerjea's lawyer seeks court nod to meet her\nSheena Bora case: Murder-accused Indrani Mukerjea admitted to hospital\nGovernment says probe in Indrani's drug overdose to be over in one week\nThe inquiry report on her sudden worsening of health leading to hospitalisation for suspected drug overdose will be submitted to Maharashtra Home Department by this weekend or next week, Upadhyay said.\nThe authorities have also recorded statement of those who had been on duty in the jail when Indrani's health worsened, police said.\nMeanwhile, CBI, which took over the investigation in the case, today obtained permission from a local court to question Indrani, her former husband Sanjeev Khanna and driver Shyamvar Rai, all accused in the case, for 12 days in jail.\n Indrani Mukerjea Sheena Bora murder case Also Read Sheena probe hit after Rakesh Maria’s sudden exit: sources Sheena murder: Focus on forensic evidences, interrogation still on DNA tests confirm body found in Raigad forest is of Sheena Bora Sheena Bora expressed 'hatred' for mother Indrani in recovered diary", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://dd508hmafkqws.cloudfront.net/sites/default/files/Indrani-Mukerjea_1_0_0.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/Indrani-Mukerjea_1_0_0.jpg", "https://apis.google.com/js/plusone.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151007/nation-current-affairs/article/indrani-mukerjea-denies-attempting-suicide-cbi-grill-accused", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js"], "published": "2015-10-09T10:13:00.000+03:00", "crawled": "2015-10-08T23:57:49.534+03:00", "highlightTitle": ""}