{"organizations": [], "uuid": "7ef606fa7916cbf0864a23f06ef57021c0cb40c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/h/t/u/z/w/image.related.articleLeadwide.620x349.gk79l4.png/1444682294934.jpg", "site_section": "http://www.canberratimes.com.au/federal-politics/political-news", "section_title": "Politics | Australian Politics | Federal Politics", "url": "http://www.canberratimes.com.au/federal-politics/political-news/labor-eyes-changes-to-ease-path-of-china-free-trade-agreement-20151012-gk79l4.html", "country": "AU", "title": "Labor eyes changes to ease path of China free trade agreement", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Labor eyes changes to ease path of China free trade agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T04:38:00.000+03:00", "replies_count": 0, "uuid": "7ef606fa7916cbf0864a23f06ef57021c0cb40c5"}, "author": "Peter Martin and Mark Kenny", "url": "http://www.canberratimes.com.au/federal-politics/political-news/labor-eyes-changes-to-ease-path-of-china-free-trade-agreement-20151012-gk79l4.html", "ord_in_thread": 0, "title": "Labor eyes changes to ease path of China free trade agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese President Xi Jinping (rear) and then-prime minister Tony Abbott witness the signing of the declaration of intent on the free trade agreement late last year.\nA step towards allowing the hotly contested China-Australia free trade agreement to go ahead could be at hand, with the Labor caucus set to consider an intended compromise on Tuesday.\nIt is believed the plan would leave the wording of the complex agreement unchanged, thus eliminating the threat from the government and the Chinese that any change could see the whole deal collapse.\nIt would do this by applying a new hurdle for all employers wanting to enter into large-scale labour hires from abroad — that they have advertised locally to source employees, before going offshore.\nThe government has ruled out changes but may be more inclined to an arrangement that would not be able to be characterised as aimed at the Chinese only.\nAdvertisement In the past, it has accused the unions and Labor of engaging in \"racist lies\" and scaremongering in their attack on the proposed deal through a concerted media campaign involving television advertising in which it was claimed Tony Abbott had \"chosen\" Chinese capital over Australian tradespeople.\nIf approved by Labor MPs who have come under direct pressure through their union links, the change could mean the intense political stand-off between the government and the opposition is resolved through a formula that neither directly alters the text of the agreement, nor applies exclusively to Chinese investors.\nFairfax Media understands Labor is considering proposing an amendment to section 140GBA of the Migration Act which requires labour market testing before the import of workers on 457 visas, but only for a class of employers defined in the regulations.\nThe regulations impose the requirement on ordinary employers bringing in a worker at a time, but not on employers using investment facilitation agreements to import them in bulk.\nLabor's proposal would extend the requirement to all employers, including those bringing in workers as part of investment facilitation agreements.\nAn alternative would be to demand a change to the regulations to achieve the same effect.\nThe change would put beyond doubt that employers wanting to bring in large numbers of workers for major projects were subject to the same constraints as employers bringing in workers individually on 457 visas.\nIt would not deal with a separate controversial provision of the free trade agreement that removes the requirement for labour market testing before the import of Chinese engineers, nurses, electricians and motor mechanics.\n ", "external_links": ["https://twitter.com/PoliticsFairfax"], "published": "2015-10-13T04:38:00.000+03:00", "crawled": "2015-10-14T05:25:31.031+03:00", "highlightTitle": ""}