{"organizations": [], "uuid": "62a26d814e513607d009ebd38c4bb4d710b1c7aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lohud.com", "main_image": "http://www.gannett-cdn.com/-mm-/ad302d9aa3715581f4c9b945a3faf3603f66a589/c=0-30-3883-2224&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/09/30/Westchester/Westchester/635792116991750942-TJNBrd-09-18-2015-DailyRocklnd-1-A006--2015-09-17-IMG-TJN-0617-TOBACCO-1-1-10BV47RC-L677075671-IMG-TJN-0617-TOBACCO-1-1-10BV47RC.jpg", "site_section": "http://rssfeeds.lohud.com/westchester/politics", "section_title": "West Chester - Politics", "url": "http://www.lohud.com/story/opinion/readers/2015/09/30/letter-ernie-davis-should-plan-his-exit/73093252/", "country": "US", "title": "Rockland's $32M deal to sell Summit Park hospital falls through", "performance_score": 0, "site": "lohud.com", "participants_count": 0, "title_full": "Rockland's $32M deal to sell Summit Park hospital falls through", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:19:00.000+03:00", "replies_count": 0, "uuid": "62a26d814e513607d009ebd38c4bb4d710b1c7aa"}, "author": "", "url": "http://www.lohud.com/story/opinion/readers/2015/09/30/letter-ernie-davis-should-plan-his-exit/73093252/", "ord_in_thread": 0, "title": "Rockland's $32M deal to sell Summit Park hospital falls through", "locations": ["Rockland County", "Rockland", "Ramapo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ricky", "Robert Brum"], "text": "Rockland's $32M deal to sell Summit Park hospital falls through Robert Brum , rbrum@lohud.com 5:28 p.m. EDT September 30, 2015 Officials said the property will close at the end of the year Buy Photo The Summit Park Hospital and Nursing Care Center in Ramapo. (Photo: Ricky Flores/The Journal News) Buy Photo Story Highlights The private buyer informed Rockland County on Tuesday night that he was terminating the deal. This means the facility may close by Dec. 31. County is seeking to place patients in private facilities; more than 400 workers could lose jobs. 84 CONNECT 16 TWEET LINKEDIN 7 COMMENT EMAIL MORE \nNEW CITY The sale of Rockland’s troubled Summit Park Hospital and Nursing Care Center, considered crucial to the county's financial turnaround, has fallen through and officials said they intend to close the property at the end of the year. \nCounty Executive Ed Day said at a press conference Wednesday afternoon that the planned private buyer, Sympaticare LLC, informed the county Tuesday night that it was terminating the $32 million deal. \n\"Sympaticare LLC chose to walk away from this transaction after publicly stating that it fully intended to continue providing quality health care services to our community,\" he said. \"By pulling out of the deal in the eleventh hour, the prospective buyer confirms that it had failed ... Summit Park patients, residents, medical staff and the people of Rockland County.\" \nDay was joined at the press conference by Rockland County Attorney Thomas Humbach and Deputy Commissioner of Hospitals David Freed. \nThe county executive said his administration offered to delay the handover for a month as long as Sympaticare closed on the sale by Sept. 30. \nSympaticare's owner, Shalom Braunstein of Monsey, did not attend the news conference. A statement from the law firm representing him, Kirland & Ellis LLP, said the agreement was terminated because of pending litigation. Lawsuits opposing the sale were filed by the CSEA, which represents many of the workers at Summit Park, and the Northern Services Group, a competitor. \nThe statement also blamed what it said was the failure of the county's Local Development Corporation to meet certain conditions and \"cure breaches\" of the purchase agreement. \nSympaticare offered to move the closing but the county refused, the statement said, adding that the company remains willing to continue negotiations. \nA total of 432 positions were set to be abolished at Summit Park, including clerical staff, nurses, pharmacists and physical therapists. Some had been interviewed by Sympaticare about staying with the facility, while others had the possibility of moving into other county positions. \nThere had been some indications the deal to sell the aging Ramapo facility might not go off on schedule, but Wednesday's announcement came as a surprise. \nFreed said Rockland would begin working with the state Department of Health to come up with a plan for transferring the patients served by the hospital and nursing home to private facilities by Dec. 31. \nHe said there were 16 people in Summit Park's hospital who could be discharged or treated elsewhere after the facility closes. The county must find alternative facilities for 182 nursing home residents, and slots in comparable programs for another 67 people in an adult day care program. \n\"We've taken great care of them throughout the transition period leading to today ... and that's exactly what we're going to do in the months ahead,\" Freed said. He said the county would take a \"person-by-person approach\" in placing people in other facilities. \nDay called the closing \"a plan we hoped we would never have to use. But the buyer walked away and regrettably now people are going to have to suffer.\" \nOf the hundreds of workers who would be losing their jobs, Day said: \"They know that we are here in this place today through no fault of their own .... These are decent, loyal, hard-working professionals that have soldiered on in the facility that was neglected for too many years by the previous administration.\" \nHe said the personnel department would help the employees with resumé building and interviewing techniques. \nDay said the union was complicit in the job loss, saying his administration asked the CSEA to drop its lawsuit against the sale but refused. \nBut CSEA Southern Region President Billy Riccaldo countered that Day's administration failed to give Sympaticare the cooperation needed to make the transition. \n\"CSEA insisted Rockland officials follow the county charter if they were to sell Summit Park, but instead they spent untold taxpayer dollars on a shadowy LDC to bypass the very rules county leaders long ago put in place,\" Riccaldo said in a statement. 84 CONNECT 16 TWEET LINKEDIN 7 COMMENT EMAIL MORE Read or Share this story: http://lohud.us/1FEXyHm TOP VIDEOS", "external_links": [], "published": "2015-09-30T21:19:00.000+03:00", "crawled": "2015-10-01T00:42:52.416+03:00", "highlightTitle": ""}