{"organizations": [], "uuid": "3c3cdf8796f1070479bd384f04a48f91e2dc574e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.radioiowa.com", "main_image": "http://cdn.radioiowa.com/wp-content/uploads/2015/08/JimWebb1.jpg", "site_section": "http://www.radioiowa.com/category/politics-government/feed/", "section_title": "Radio Iowa » » Politics & Government", "url": "http://www.radioiowa.com/2015/10/20/webb-drops-out-of-democratic-race-ponders-independent-run/", "country": "US", "title": "Webb drops out of Democratic race, ponders independent run", "performance_score": 0, "site": "radioiowa.com", "participants_count": 1, "title_full": "Webb drops out of Democratic race, ponders independent run", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:05:00.000+03:00", "replies_count": 0, "uuid": "3c3cdf8796f1070479bd384f04a48f91e2dc574e"}, "author": "O. Kay Henderson", "url": "http://www.radioiowa.com/2015/10/20/webb-drops-out-of-democratic-race-ponders-independent-run/", "ord_in_thread": 0, "title": "Webb drops out of Democratic race, ponders independent run", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  News / Webb drops out of Democratic race, ponders independent run Webb drops out of Democratic race, ponders independent run October 20, 2015 by O. Kay Henderson Jim Webb at the Iowa State Fair this year. \nFormer Virginia Senator Jim Webb has ended his campaign for the Democratic Party’s presidential nomination and he’s now exploring the idea of running as an independent. \n“The very nature of our democracy is under siege due to the power structure and the money that finances both political parties,” Webb said today in a news conference announcing his decision. “Our political candidates are being pulled to the extremes. They’re increasingly out of step with the people they’re supposed to serve.” \nWebb spent 18 days campaigning in Iowa over the past two years. Among the four other candidates in the Democratic race, only the little-known Lincoln Chaffee has spent less time here. \n“We made visits,” Webb said today. “We didn’t make as many visits as we could have if I’d have had the financial resources to do it or if I had made different decisions about traction.” \nThe most recent poll of likely Iowa Democratic Caucus-goers was conducted in early October by NBC and The Wall Street Journal. It found Webb had just one percent support among Iowa Democrats. Webb said today that Americans “are disgusted” the major parties cannot find ways to work together. \n“How I remain as a voice will depend on what kind of support I’m shown in the coming weeks as I meet with people on all sides of America’s political landscape,” Webb said, “and I intend to do that.” \nWebb acknowledged independent candidates have not been able to win the White House in the past, but with the political process so “jammed up” in Washington, he says an independent “conceivably” could win. \nJust four-and-a-half weeks ago, Webb told Iowa Democratic Party officials he would attend the party’s Jefferson-Jackson Day fundraiser this Saturday, his first visit to Iowa since August. Last week, though, Webb complained about the amount of time he was given to speak in the Democratic candidates’ debate, arguing the event had been “rigged” for the front-runners. Share this:", "external_links": [], "published": "2015-10-20T21:05:00.000+03:00", "crawled": "2015-10-20T21:25:47.154+03:00", "highlightTitle": ""}