{"organizations": [], "uuid": "43f58c9cdb4c0a8515c45738bd668ec6cacd3c5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wapt.com", "main_image": "http://www.wapt.com/image/view/-/35897242/highRes/1/-/maxh/630/maxw/1200/-/avt56dz/-/Hillary-Clinton-in-Texas-jpg.jpg", "site_section": "http://www.wapt.com/9157906?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.wapt.com/politics/clinton-to-hit-alabama-voting-rights-decision/35897180", "country": "US", "title": "Clinton to hit Alabama voting rights decision", "performance_score": 0, "site": "wapt.com", "participants_count": 0, "title_full": "Clinton to hit Alabama voting rights decision", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T19:36:00.000+03:00", "replies_count": 0, "uuid": "43f58c9cdb4c0a8515c45738bd668ec6cacd3c5a"}, "author": "", "url": "http://www.wapt.com/politics/clinton-to-hit-alabama-voting-rights-decision/35897180", "ord_in_thread": 0, "title": "Clinton to hit Alabama voting rights decision", "locations": ["Alabama"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton"], "text": "Clinton to hit Alabama voting rights decision Aide: Clinton will call state's voting laws 'discriminatory and demeaning and it has to end' UPDATED 11:36 AM CDT Oct 17, 2015 Photos Erich Schlegel/Getty Images \nHillary Clinton will use a speech here Saturday to hit Alabama Republicans, including Gov. Robert Bentley, for the state's decision to close 31 driver's license offices and require proof of citizenship to vote. Media Galleries Walker suspends campaign for president \nClinton, who will speak at Alabama Democratic Conference's Convention, will call for Bentley and the Republican-controlled legislature to \"listen to their constituents, and for the offices to stay open -- not just for one day a month,\" according to Clinton aides who previewed the remarks to CNN. \nThe Alabama Law Enforcement Agency announced last week that an $11 million cut in the budget would force the closing of 31 part-time, county-owned satellite locations at which residents can obtain or renew their licenses. The state expects some of the needs of those who would have used such offices to be met online. \nDemocrats, however, have charged that the decision to close the offices is politically motivated due to the state's strict voter identification laws and will disproportionately affect African-American voters. \nClinton will call the state's voting rights laws -- including a requirement to provide proof of citizenship -- \"discriminatory and demeaning and it has to end,\" the aides said. \n\"The closures,\" Clinton will say, \"affect every single county where African-Americans make up more than 75% of registered voters.\" \nClinton has made voting rights a cornerstone of her six-month-old presidential campaign. Clinton told an audience at the historically black Texas Southern University in June that she supports the concept of signing up every American to vote as soon as they're eligible at age 18, unless they specifically opt out. She called for expanded access to polling places, keeping them open for at least 20 days and offering voting hours on evenings and weekends. \nSaturday will also not be the first time Clinton politicizes her voting rights call. The first time Clinton attacked Republicans by name was the same June speech, when the Democratic front-runner hit Texas's Rick Perry, Wisconsin's Scott Walker, Florida's Jeb Bush and New Jersey's Chris Christie, calling for them to \"stop fear-mongering about a phantom epidemic of voter fraud.\" \nThe aides said Clinton will go after Republican presidential contenders on Saturday as well, highlighting \"how many Republican candidates running for president have pushed and supported harmful restrictions on voting across the country.\" \nIn June, Republicans hit back against Clinton's critiques. Ohio Gov. John Kasich accused her of using \"demagoguery\" to try to \"divide\" Americans with the attacks, while Christie suggested she just wanted opportunities to commit voter fraud. \nClinton also headlined a morning fundraiser in Birmingham hosted by Rep. Terri Sewell, the only African-American in the state's congressional delegation. \nSewell has been outspoken about the state's decision to close the driver's license offices. Sewell sent a letter to Attorney General Loretta Lynch on Monday calling for a \"full and thorough investigation\" into the matter. \n\"This decision will leave eight out of the 10 counties with the highest percentage of non-white registered voters without a Department of Motor Vehicles to issue an Alabama driver's license,\" Sewell wrote in the one-page letter. \"This fact combined with Alabama's voter ID law means that the DMV closure decision will disproportionately affect African-American voters in violation of their constitutionally protected right to vote.\" \nClinton's Alabama trip caps off a frantic post-debate blitz that saw the former secretary of state headline seven events in four states in four days. Clinton also headlined two fundraisers in the process.", "external_links": [], "published": "2015-10-17T19:36:00.000+03:00", "crawled": "2015-10-17T20:08:52.074+03:00", "highlightTitle": ""}