{"organizations": [], "uuid": "9de672eb7c0f24150c9e077e7d848079bd7fa719", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/21/0d/e9/1964637_10203396175091892_2088015808_n.jpg", "site_section": "http://www.ajc.com/s/news/georgia-government/", "section_title": "Georgia politics and government news from the AJC | www.ajc.com", "url": "http://www.ajc.com/news/news/local-education/come-benedict-and-world-will-be-yours/nn7Gf/", "country": "US", "title": "Veteran journalist Jerry McCormick found himself at Benedict Coll | www.ajc.com", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Veteran journalist Jerry McCormick found himself at Benedict Coll | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T10:31:00.000+03:00", "replies_count": 0, "uuid": "9de672eb7c0f24150c9e077e7d848079bd7fa719"}, "author": "Jerry McCormick, Class of '90", "url": "http://www.ajc.com/news/news/local-education/come-benedict-and-world-will-be-yours/nn7Gf/", "ord_in_thread": 0, "title": "Veteran journalist Jerry McCormick found himself at Benedict Coll | www.ajc.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I am a Tiger.\nAnd I’m a power for good in society.\nThose are the two things I remember most about being a student at Benedict College.\nJerry McCormick graduated from Benedict College in 1990 I grew up Dillon, S.C. and graduated from the same high school as Ben Bernanke, the former chairman of the Federal Reserve.\nI remember when we had college day at the school in the fall of 1985.\nI told the recruiters I wanted to major in journalism. Many of the recruiters looked at me and just smiled.\nA lifelong journalist, Jerry McCormick recently jumped from print to broadcasting. In 2014 he won an Emmy for his coverage of the Boston Bombing. But the one from Benedict didn’t.\nI can’t remember his name, but I do remember what he said which was: “Come to Benedict and the world will be yours.”\nDecision made.\nBenedict is located in Columbia, S.C.\nIt’s not that far away from parts of the University of South Carolina.\nAnd it’s within walking distance of the statehouse where at that time the Confederate Flag flew.\nI started the fall of 1986.\nMy family did not have a lot of money.\nBut I was lucky to have older brothers who went to college before me and they told me to make sure to go to financial aid the first week of school and let them know my situation.\nThe people at the financial aid office turned out to be some of my best friends at the school. They constantly looked out for scholarships for me. In the end, I went to college with one student loan of $930.\nThe rest was financed through scholarships.\nThat’s the kind of place Benedict was to me. It was a family.\nWhat you didn’t have, someone else did.\nWe looked out for each other all the time.\nI started out in Goodson Hall the male freshman dorm.\nI remember Friday night spade games.\nAnd what we called the buffet rooms, which means several of us pooled our money and ordered pizza or other take-out and played cards or board games and went from room to room.\nI loved going to the basketball games.\nOur mascot was the Benedict Tiger.\nAnd our team did pretty well, but it was the camaraderie of all the students coming together to cheer for our team is what I remember the most.\nWe’d pile into cars, even if we didn’t know people that well, and hit the road for away games. All you’d do is post a sign in the dorm saying you’re going to the game and need some cash for gas and boom: car full of people.\nAnd as much as we had fun, we also took our studies very seriously.\nMy test scores qualified me to make it into the school’s first Honor’s Program.\nI have to admit, that class was hard. It took up a lot of time but it also pushed me academically.\nSusan Dugan was my favorite journalism instructor.\nShe introduced me to photography and she also helped me understand what journalism was all about.\nI also worked with her on the school’s yearbook for two years in a row.\nLittle did I know then, that by accepting that role, it was my first life lesson in management of people.\nWe’d have all-school assemblies every few weeks at that time.\nIt was then we’d have important guest speakers who urged us to follow the school’s motto which was “be a power of good in society.”\nThe one who made the biggest impression on me was Montel Williams.\nThis was before he became the talk show host.\nAt that time he was still in the Navy and was touring schools and encouraging young African-American to stay in school.\nAfterwards, I was one of the few invited to a private reception at the President’s House and I managed to have a one-on-one with him.\nI was struggling in a class and Williams told me that classes are just representations of life.\nYou see a problem, you beat it. It’s just that simple. Don’t let the problems beat you.\nI got an A in the class.\nIn 1987, I pledged Alpha Phi Alpha Fraternity Inc. It’s the oldest black fraternity in the nation.\nI grew up in a family with six brothers, but on that cool crisp fall night in 1987, I gained thousands of others across a nation.\nAnd I owe that to Benedict.\nBenedict showed me I was smart.\nBenedict showed me I was strong.\nBenedict gave me a family and it showed me I was tough.\nI would need these skills especially in the years to come.\nWhen I graduated in 1990, the country was in a recession, but I managed to land my first newspaper job at one of the top newspapers in the country.\nIt was a “foot in the door” job, but needless to say, I’m proud to have “The Cleveland Plain Dealer” on my resume.\nThen in the early 2000’s the newspaper business took a dramatic downturn and it was time for me to go.\nI jumped into broadcasting and won one of its highest awards in 2014 an Emmy.\nI thank Benedict for that.\nIt laid the foundation.\nAs the recruiter said: “Come to Benedict and the world will be yours.”\nYes it is.", "external_links": ["http://media.cmgdigital.com/shared/img/photos/2015/10/21/1a/fa/11701074_10207345363499134_5945524769652876069_n.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/21/31/55/12079417_10208085349198314_2994175165320844530_n.jpg"], "published": "2015-10-21T10:31:00.000+03:00", "crawled": "2015-10-22T00:27:17.991+03:00", "highlightTitle": ""}