{"organizations": [], "uuid": "a4ae7b70fe526fcf8464657f3785eea043796ff2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://www.yallpolitics.com/index.php/yp/atom", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/wicker_funding_bill_adheres_to_budget_caps/", "country": "US", "title": "Wicker: Funding Bill Adheres to Budget Caps", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Wicker: Funding Bill Adheres to Budget Caps", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T14:23:00.000+03:00", "replies_count": 0, "uuid": "a4ae7b70fe526fcf8464657f3785eea043796ff2"}, "author": "Frank Corder", "url": "http://yallpolitics.com/index.php/yp/post/wicker_funding_bill_adheres_to_budget_caps/", "ord_in_thread": 0, "title": "Wicker: Funding Bill Adheres to Budget Caps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wicker: Funding Bill Adheres to Budget Caps Miss. Senator Highlights Pro-Life Provisions Protected by Spending Measure WASHINGTON – U.S. Senator Roger Wicker, R-Miss., today announced that the Senate has approved a measure, H.R. 719, to fund the federal government through December 11. The funding extension was needed because Senate Democrats, despite their previous support, have blocked efforts to bring individual appropriations bills to the Senate floor for consideration. “Earlier this year, Congress passed a tough budget resolution that set strict caps on government spending,” Wicker said. “The proposal that passed the Senate today adheres to those limits. Combined with the spending cuts that we have made over the past few years, it keeps us on a path toward making Washington smaller and more accountable. “This temporary measure gives us additional time to work on more long-term spending bills that comply with the budget and fight the egregious executive overreach of the Obama Administration.” Wicker has consistently supported efforts to redirect federal funding for Planned Parenthood to women’s health programs and community health centers. More than 190 community health sites are located throughout Mississippi to help address health needs, compared to only one Planned Parenthood location. “The fight to end federal support of Planned Parenthood is not over. I remain committed to holding Planned Parenthood responsible for its actions and shielding taxpayers from funding it. I am pleased that this bill reaffirms important pro-life protections, such as the Hyde Amendment.” Senator Wicker was among a group of 49 Senators who signed a letter in July to Health and Human Services Secretary Sylvia Burwell seeking an internal review of Planned Parenthood’s compliance with laws and regulations related to fetal tissue and partial-birth abortions. Last month, he also voted in favor of S. 1881, which would have redirected federal funding for Planned Parenthood to alternative programs that support women’s health. Wicker has a pro-life “A” rating from the Federal National Right to Life Scorecard. He is also a lead author of S. 582, the “No Taxpayer Funding for Abortion Act,” which he introduced with Senator Pat Roberts, R-Kan., in February 2015. The measure would enact a permanent, government-wide prohibition of taxpayer funding for abortion. 9/30/15 Posted October 1, 2015 - 5:23 am YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-01T14:23:00.000+03:00", "crawled": "2015-10-03T04:13:31.911+03:00", "highlightTitle": ""}