{"organizations": [], "uuid": "17b33ba600f3ab4ce92ac423d99d3533cea36db1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/626d5552-25ce-4ab5-95ff-a4aaf9969a2a.img", "site_section": "http://www.ft.com/rss/world/mideast/politics", "section_title": "Middle East & North Africa Politics and Society News - FT.com", "url": "http://www.ft.com/cms/s/0/35dd3c28-6b4a-11e5-aca9-d87542bf8673.html?ftcamp=published_links%2Frss%2Fworld_mideast_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Outside powers at risk from Syria’s fire", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Outside powers at risk from Syria’s fire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:10:00.000+03:00", "replies_count": 0, "uuid": "17b33ba600f3ab4ce92ac423d99d3533cea36db1"}, "author": "", "url": "http://www.ft.com/cms/s/0/35dd3c28-6b4a-11e5-aca9-d87542bf8673.html?ftcamp=published_links%2Frss%2Fworld_mideast_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Outside powers at risk from Syria’s fire", "locations": ["Syria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gideon Rachman", "James Ferguson"], "text": "Outside powers will be burnt by Syria’s fire Gideon Rachman Proxy wars can be very dangerous for the nations that are fuelling the conflict ©James Ferguson \nIn the 1930s, the Spanish civil war sucked in outsiders, with Nazi Germany backing the nationalists, the Soviet Union backing the Republicans and foreign idealists flocking to the country to fight on either side of the conflict. A similar proxy war is under way in Syria today — with both the Russian and US air forces bombing targets in the country, and foreign fighters pouring into Syria. \nThe mutation of a civil war into a “proxy war” between outside powers is almost invariably a tragic and dangerous development. In Syria , it has made the war longer, bloodier, more dangerous to the rest of the world and harder to end. After four years, a conventional civil war might already have burnt out — giving the Syrians some chance of rebuilding their lives and their country. But with outside powers pouring petrol on to the flames of the conflict, it is clear that only some kind of international settlement can offer any hope of ending the conflict. More Europe will fail the values test on refugees \nUnfortunately, we still seem to be in the escalation phase, as outside powers increase their efforts on the battlefield, hoping either for victory for “their” side or to increase their leverage in eventual peace talks. Iran, Russia and the Hizbollah militia have intervened on behalf of President Bashar al-Assad’s regime. The US, Saudi Arabia, the Gulf states, Turkey, France and the UK have supported opposition forces. \nMeanwhile, foreign jihadis continue to travel to Syria to fight as part of the self-proclaimed Isis . \nProxy wars are disastrous for the countries on whose soil they are fought out. But they can also be very dangerous for the powers that are fuelling the conflict. The most obvious risk is that a war fought initially through proxies leads eventually to a direct conflict. The countries that were backing opposite sides in Spain in the 1930s were fighting each other directly by the 1940s. The risk of the Syrian conflict leading to a direct clash between the Iranians and the Saudis, or even the Russians and the Americans, cannot be discounted — particularly when rival air forces are operating in proximity. \nBut the dangers of proxy war extend beyond the risk of direct conflict. The fires of war are hard to control, once they have been deliberately fanned. Pakistan and the US, for example, fought a proxy war against the USSR in Afghanistan in the 1980s — but later suffered grievously from “blowback” from the Islamist militants they had supported in the country. \nIt is not hard to see how the Syrian conflict could generate similar blowback for some of the nations involved in the conflict. The government of Saudi Arabia is clearly threatened by some of the militant Islamist groups it has encouraged and supported in Syria. Russia also risks inflaming its domestic Muslim population and being drawn deeper into another war, even as the conflict in Ukraine festers. \nDespite these risks, outside powers continue to become involved in the Syrian conflict — fearing that their security and status will weaken if they allow other nations or creeds to seize the initiative. More video \nThe most obvious instance is the fight between the forces of Sunni and Shia Islam. The Assad regime is supported by the Shia-dominated states — above all, Iran and Iraq. The anti-Assad forces are supported by the Sunni countries: Saudi Arabia, the Gulf states and Turkey. \nOverlaid on this contest between regional powers is a struggle between the US and Russia — with Russia backing Mr Assad and America continuing to call for his removal. The Russia-US struggle is partly about influence in the Middle East. But it also has broader geopolitical and ideological elements. Russia and the west are already waging a proxy war over the future of Ukraine. They are also at loggerheads over the broader concept of support for “regime change” against undemocratic or oppressive governments. In depth", "external_links": [], "published": "2015-10-05T18:10:00.000+03:00", "crawled": "2015-10-06T08:21:23.723+03:00", "highlightTitle": ""}