{"organizations": [], "uuid": "eced54a88a8a4a54f0a4b6cf7736330c165d3dfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/29/edd5bd8b910399850cb324a5516097/media:e0d876ae365f4c50a1162c4b6cb8395dPolandElections.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/25/poles-vote-in-election-euroskeptic-party-seen-as-favorite", "country": "US", "title": "Poles vote in election, Euroskeptic party seen as favorite", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Poles vote in election, Euroskeptic party seen as favorite - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "eced54a88a8a4a54f0a4b6cf7736330c165d3dfd"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/25/poles-vote-in-election-euroskeptic-party-seen-as-favorite", "ord_in_thread": 0, "title": "Poles vote in election, Euroskeptic party seen as favorite", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By VANESSA GERA and MONIKA SCISLOWSKA, Associated Press\nWARSAW, Poland (AP) — Poles voted Sunday in a parliamentary election that is expected to shift power from a centrist and pro-market party to a socially conservative and somewhat Euroskeptic party that favors more welfare spending to help the poor.\nOpinion polls show the populist Law and Justice party holding a strong lead over Civic Platform, which has governed the country for eight years.\nVoting stations across this nation of 37 million people opened at 7 a.m. (0600 GMT) Sunday and are to close at 9 p.m. (2000 GMT). Exit polls will be released when polls close, with official results due Monday.\nCivic Platform has overseen a period of strong economic growth and extraordinary political stability even during the global financial crisis of 2008-09 and a 2010 plane crash that killed the president and dozens of other state officials. Nonetheless, many voters have grown tired of it due to scandals and a sense that many of its leaders had grown complacent and out of touch.\nA president backed by the party was defeated separately in May by the Law and Justice candidate, President Andrzej Duda.\nOpinion polls in recent days showed that Law and Justice had a strong lead over Civic Platform in this election too, but it isn't clear if the party can win enough votes to govern alone or if will need to pick a coalition partner from one of the smaller parties in the race.\nIn Warsaw, many voters declared support for new, small left- and rightwing parties, while voicing concern for preserving the economic and political stability.\nRetired physicist Adam Jadacki, 69, said he and his wife, Janina, 64, voted for the modern party, Nowoczesna \"because it is the only sensible and rational party, free of emotions and of political infighting.\"\nJadacki said he believes the party has \"sound economic plans, not some empty promises\" like the ruling Civic Platform party.\nNowoczesna is a new force founded by Ryszard Petru, an economist, who is focused on creating sound state finances as base for developing the economy.\nLawyer Katarzyna Bielska, 32, said she supports United Left, a coalition of left-wing parties, in order to end Civic Platform's eight-year-rule while not backing the favored conservative Law and Justice party.\nInterpreter Slawomir Krantz, 49, voted for Civic Platform, which he described as a \"lesser evil,\" because he fears other parties might spoil the stability Poland has achieved.\nA victory by Law and Justice would give the party a chance to implement a brand of politics that is strongly pro-NATO but also somewhat Euroskeptic. The party opposes adopting the euro currency and is strongly anti-migrant, positions that are expected to have a broader impact on the European Union's larger direction in those areas.\nMany Poles who have not benefited from the country's strong economic growth, expected at 3.5 percent this year alone, also support the party's economic program.\nIt promises to reverse an unpopular rise in the retirement age and put more money into the pockets of struggling families with tax breaks, monthly cash bonuses for children under 18 and free medication for people over 75. It also wants to raise taxes on the mostly foreign-owned banks and big supermarkets in Poland and give tax breaks to smaller local businesses and those that adopt Polish technologies.\nJaroslaw Kaczynski, the party chairman, and Beata Szydlo, the party's candidate to be prime minister, have said such changes would create greater social justice.\nCritics, however, slam its economic policies as irresponsible and a threat to the state's financial health.\n\"If they win it could end up looking like Greece here,\" said Arkadiusz Skrodzki, a 22-year-old law student at a Friday evening rally of the ruling Civic Platform party.", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T16:53:08.363+02:00", "highlightTitle": ""}