{"organizations": ["Fed"], "uuid": "f8747f02d60bb161b30ec962e8ebb3091c43f256", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/d0a7eb20-f66a-4584-9b30-2bad8e40869d.img", "site_section": "http://www.ft.com/rss/world/us/politics", "section_title": "US politics news - latest US politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/660790e6-71e5-11e5-ad6d-f4ed76f0900a.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Fed splits fuel doubts on 2015 rate rise", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Fed splits fuel doubts on 2015 rate rise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T23:22:00.000+03:00", "replies_count": 0, "uuid": "f8747f02d60bb161b30ec962e8ebb3091c43f256"}, "author": "", "url": "http://www.ft.com/cms/s/0/660790e6-71e5-11e5-ad6d-f4ed76f0900a.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Fed splits fuel doubts on 2015 rate rise", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sam Fleming"], "text": "Fed splits fuel doubts on 2015 rate rise Sam Fleming in Washington ©EPA \nMarket concerns are rising over divisions at the top of the Federal Reserve on when to lift interest rates, casting fresh uncertainty over the US central bank’s strategy for withdrawing its monetary stimulus. \nThe divisions burst into the open when two Fed board members signalled this week that they oppose a near-term increase in interest rates , questioning the approach adopted by chair Janet Yellen amid divisions over the outlook for inflation. More US deficit widens as exports slow \nLarry Fink, chief executive of the world’s largest asset manager, BlackRock, warned on Wednesday that ”mixed messages” from officials were contributing to volatility and “inflaming the markets”. \nA disappointing US retail sales report on Wednesday, showing headline sales rose just 0.1 per cent in August, further damped traders’ expectations of an early rate rise. By Wednesday afternoon in New York, Fed Funds futures were pointing to a greater than 50% chance that the Fed would wait until after March 2016 to raise rates. \nThe figures sent the 10-year Treasury yield back below 2 per cent, down more than 6 basis points to 1.98. \nDaniel Tarullo said in a CNBC interview on Tuesday that his current expectation was that it was not appropriate to raise rates this year, joining fellow governor Lael Brainard in favouring a wait-and-see approach. \nRoberto Perli of Cornerstone Macro said differences of opinion between regional Fed presidents were not uncommon, “but the novelty here is that both Tarullo and Brainard are members of the Fed’s Board of Governors and as such supposedly close to Yellen”. \nBoth policymakers appeared to raise doubts about an assumption underpinning Ms Yellen’s policymaking approach — namely, that as the US approaches full employment, inflation will start accelerating, according to the so-called Phillips curve. More video \nMr Perli added: “The fact that they essentially called into question Yellen’s speech where she made the case for lift-off this year is remarkable and plunges Fed communication back into confusion after Yellen tried to set things straight a few weeks ago.” \nRenewed uncertainty over the Fed’s intentions will do little to allay concerns in emerging markets, where policymakers have become frustrated by its apparent indecision on when to raise dollar borrowing costs. A further delay would also add to pressure on the European Central Bank and Bank of Japan to offset a weaker dollar with additional quantitative easing of their own. \nMoody’s senior economist Ryan Sweet said the “discordant” rhetoric was significant. “Yellen has time to forge a consensus but airing the officials’ disagreements publicly can have unintended consequences,” he wrote. \nComing after a dismal jobs report, interest rate futures now imply that investors see an even chance that the Fed keeps rates at their historically low levels until March, according to Bloomberg data. “It’s easy to second guess the Fed’s decisions, but the data have been defending the Fed’s decision to wait on rate hikes,” said Brian Jacobsen, a strategist at Wells Fargo Funds Management. \nMr Tarullo suggested the Fed should wait for “tangible evidence” of a pick-up in inflation before raising rates amid a global disinflationary environment, whereas Ms Yellen has said she would not have to see a significant acceleration in inflation before moving. Ms Brainard argued that “a variety of econometric estimates would suggest that the classic Phillips curve influence of resource utilisation on inflation is, at best, very weak at the moment”. \nIn her most recent speech, Ms Yellen said she was among those Fed policymakers who think an increase in 2015 would be appropriate, as she argued factors such as falling commodity prices were likely to be a temporary headwind to inflation. Over the weekend Stanley Fischer , vice-chair of the Fed board, reinforced that message, telling a conference in Lima, Peru, that he also favoured a rise in 2015. \nÁngel Ubide, a senior fellow at the Peterson Institute for International Economics, said it would be unprecedented in recent times if two board governors went ahead and formally dissented against a vote for an increase. \nHe added: “They [Brainard and Tarullo] are right that there is no need to raise rates soon if you look at the outlook for inflation. The question is whether they are leading indicators, and whether Janet Yellen is now also questioning whether it is wise to raise rates in 2015. That is something we simply don’t know.” \nThe Fed held rates unchanged in its September meeting following weeks of speculation that an increase was on the cards. Since then policymakers, including John Williams of the San Francisco Fed, have suggested the decision was a close call, as they continue to hold open the prospect of a move by the end of the year. \nThat impression was confirmed by minutes that revealed on Tuesday that eight of 12 regional Federal Reserve banks had called for an increase in the interest rate on discount window loans at the September meeting, in a possible hawkish signal. The fact that [two] governors are publicly doing this is highly unusual \n- Michael Feroli at JPMorgan \nFew market participants expect a move at this month’s meeting, but the position at the Fed’s December gathering is harder to predict. Mr Tarullo and Ms Brainard argued that caution was currently the right approach, given the uncertainties surrounding the inflation outlook. \nMr Tarullo, who is in charge of bank regulation at the Fed and comments infrequently on monetary policy, argued that, based on a “risk-management approach” of being concerned that a premature rise might be harder to deal with than waiting a little bit longer, he “wouldn’t expect it would be appropriate to raise rates” this year. \nIn a speech on Monday Ms Brainard laid out a detailed argument for caution, questioning the wisdom of moving rates soon because of a risk the Fed would have to execute a costly U-turn. She argued that the central bank should be “watching and waiting”, adding that financial market movements have already delivered a tightening equivalent to two rate hikes. \nThe interventions further cloud muddy communications from the Fed on the policy outlook, at a time when investors have been calling for a sense of where the Fed is heading. Given the divisions in the central bank, however, there is a risk of further confusion in the weeks ahead. Related Topics", "external_links": [], "published": "2015-10-14T23:22:00.000+03:00", "crawled": "2015-10-15T10:54:47.751+03:00", "highlightTitle": ""}