{"organizations": [], "uuid": "9eb87c473f53887e182707b9a42800427bfbf3de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://cei.org/modules/file/icons/application-pdf.png", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/libertarian/2015/10/government-against-itself-public-union-power-and-its-consequences-2620576.html", "country": "US", "title": "Government Against Itself: Public Union Power and Its Consequences | Libertarian", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Government Against Itself: Public Union Power and Its Consequences | Libertarian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:03:00.000+03:00", "replies_count": 0, "uuid": "9eb87c473f53887e182707b9a42800427bfbf3de"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/libertarian/2015/10/government-against-itself-public-union-power-and-its-consequences-2620576.html", "ord_in_thread": 0, "title": "Government Against Itself: Public Union Power and Its Consequences | Libertarian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News) Read the Full Review Here\nThis article was originally published in the Fall 2015 Edition of the Cato Institute’s Cato Journal .\nNo one likes paying more for less, especially for basic public services like fire and police protection. Yet that is the situation many state and local governments now face because of powerful government employee unions. Government costs more than ever, but the quality and effectiveness of the public services that taxpayers need are in decline. Daniel DiSalvo, assistant professor of political science at City College of New York and senior fellow at the Manhattan Institute, tells this story in his new book, Government against Itself: Public Union Power and Its Consequences.\nPublic-sector unions are necessarily political institutions. Seeking to influence public officials in order to gain greater benefits for their members is one of their core functions. Government unions, notes DiSalvo, “are effectively government lobbying itself.” Unlike private sector labor negotiations, public-sector collective bargaining involves government sitting on both sides of the table. Public-sector “managers” face weaker incentives than their private-sector counterparts to resist union demands, such as increased compensation or greater job security. Therefore, collective bargaining in the public sector undermines democratic governance by shifting some government decisions away from public officials and toward unelected government employees.\nPublic-sector collective bargaining also has contributed to one of the biggest fiscal challenges threatening state and local governments around the nation: underfunded public pensions. This is a classic case of concentrated benefits and diffuse costs: government unions have greater incentives to lobby for increased compensation for their members than taxpayers have to organize to resist paying for it.\nDate: Friday, October 9, 2015 Citation: Cato Journal: Fall 2015 Vol. 35 No. 3 Experts: Ivan Osorio Publication Type: Op-Eds & Articles Centers: Center for Economic Freedom Issues: Labor and Employment Government Unions File Attachments: Ivan Osorio – Daniel DiSalvo Book Review – Cato Journal – Fall2015.pdf Teaser: No one likes paying more for less, especially for basic public services like fire and police protection. Yet that is the situation many state and local governments now face because of powerful government employee unions. Government costs more than ever, but the quality and effectiveness of the public services that taxpayers need are in decline.", "external_links": ["http://object.cato.org/sites/cato.org/files/serials/files/cato-journal/2015/9/cj-v35n3.pdf", "http://cei.org/modules/file/icons/application-pdf.png", "http://cei.org//https://cei.org/sites/default/files/Ivan%20Osorio%20-%20Daniel%20DiSalvo%20Book%20Review%20-%20Cato%20Journal%20-%20Fall2015.pdf", "http://www.cato.org/cato-journal/fall-2015"], "published": "2015-10-09T23:03:00.000+03:00", "crawled": "2015-10-10T01:58:24.268+03:00", "highlightTitle": ""}