{"organizations": ["CNN"], "uuid": "19c1cc9949406ed9a06134c9373040e4cae206fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcra.com", "main_image": "http://www.kcra.com/image/view/-/35765352/highRes/2/-/maxh/630/maxw/1200/-/9ssx5mz/-/Bernie-Sanders-JPG.jpg", "site_section": "http://www.kcra.com/11798346?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.kcra.com/politics/sanders-tackles-political-sore-spots/35765292", "country": "US", "title": "Sanders tackles political sore spots", "performance_score": 0, "site": "kcra.com", "participants_count": 0, "title_full": "Sanders tackles political sore spots", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T12:20:00.000+03:00", "replies_count": 0, "uuid": "19c1cc9949406ed9a06134c9373040e4cae206fa"}, "author": "", "url": "http://www.kcra.com/politics/sanders-tackles-political-sore-spots/35765292", "ord_in_thread": 0, "title": "Sanders tackles political sore spots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sanders"], "text": "Sanders tackles political sore spots Democratic presidential hopeful talks guns, immigration UPDATED 2:20 AM PDT Oct 10, 2015 Photos Pool via CNN \nBernie Sanders didn't shy away from two hot button issues that have given him problems in the past -- guns and immigration -- during a large rally in Tucson, Arizona, on Friday night. Stories Outsiders shine at latest debate \nSanders opened his more than hour-long speech with extensive comments on guns -- an issue that he is more conservative on than most Democrats -- and immigration -- an issue that, until months ago, he has not included in his stump speech. \nThe fact that Sanders ran head first into these issues, before launching into his standard stump speech, shows the senator is honing his message on two issues that are likely to come up at next week's Democratic debate on CNN. \nSanders has been doing some debate prep, according to his aides, and will continue to do more in the coming days as he travels to Las Vegas, the site of the debate. Though aides were clear to say they wanted Sanders to be himself during the debates, they also acknowledged that the senator was preparing for a \"variety\" of attacks that could be waged against him - including on guns and immigration. \n\"It goes without saying that our condolences go to the families of those who were killed and our hearts and prayers go out for a full recovery for those who were wounded,\" Sanders said after mentioning shootings at Texas Southern University and Northern Arizona University. \"But we also know that we are tired of condolences and we are tired of just prayers.\" \nSanders argued that while the issue of gun control is \"not going to be solved easily,\" that \"does not mean we do not address it and do the best we can.\" \nUnlike much of his liberal record, Sanders is fairly conservative on guns. He voted against the Brady Handgun Violence Prevention Act in 1993, a law that imposed a five-day waiting period for gun purchases and mandated background checks, and voted for allowing guns on Amtrak. \n\"Yes there are disagreement on how we go forward in terms of gun safety,\" Sanders said Friday to 13,000 people at a Tucson park. \"But I think the vast majority of the American people want us to move forward in sensible ways which keep guns out of the hands of people who should not have them.\" \nThe 2016 presidential candidate -- who has been surging in the polls and is riding a wave of momentum into next week's Democratic debate -- then turned to immigration, an issue that many Latino elected officials and activists felt he didn't talk about enough in the early part of his campaign. After acknowledging immigration was a problem, Sanders' now regularly mentions the issue on the stump. \n\"My family story is a story very similar to many people who are here tonight,\" Sanders said, noting his father came to the United States at age 17. \"And that story is the story of America.\" \nSanders promised, as president, that his immigration plan would keep families together and include a path towards citizenship. \nFriday night's event was a unique one for Sanders. A mariachi band opened the event with a series of songs and earned big applause when the members yelled \"Viva Bernie Sanders\" in the middle of their song. \nWhat's more, Sanders picked up his first congressional endorsement at the event when Congressman Raul Grijalva backed his liberal colleague and friend. \n\"Bernie is my friend and beyond friendship, I agree with his values,\" the congressman said. \"I agree with the solutions that he is bringing and his campaign is bringing to the American people. And finally, as part of the answer, it is way past time that we had a national campaign and a voice that speaks truth to power.\"", "external_links": [], "published": "2015-10-10T12:20:00.000+03:00", "crawled": "2015-10-10T13:14:04.522+03:00", "highlightTitle": ""}