{"organizations": [], "uuid": "564c25c606e2ed2ff887a2d7f0fa4d7730c2b87e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/mrh7lxw33e_presidentmahamasspeaking.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/648000/1/president-mahama-announces-measures-to-reduce-road.html", "country": "US", "title": "President Mahama announces measures to reduce road congestion", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "President Mahama announces measures to reduce road congestion", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:00:00.000+03:00", "replies_count": 0, "uuid": "564c25c606e2ed2ff887a2d7f0fa4d7730c2b87e"}, "author": "", "url": "http://www.modernghana.com/news/648000/1/president-mahama-announces-measures-to-reduce-road.html", "ord_in_thread": 0, "title": "President Mahama announces measures to reduce road congestion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mahama"], "text": "  17:00 CET President Mahama announces measures to reduce road congestion By GNA \nBordeaux, Oct 8, GNA - President John Dramani Mahama has announced measures government was putting in place to reduce congestion on road traffic. \nHe said road traffic in the country had moved from 40,000 a few years ago to 400,000 and government needed to take immediate steps to neutralize the trend in the coming years. \nPresident Mahama who was addressing the Bordeaux Chamber of Commerce as part of his week-long official visit to the European country said Ghana was on the verge of acquiring a new national air carrier and gave the assurance that when implemented would ply the sub-region before moving out to other continents. \nApart from that, President Mahama said government was also developing higher occupancy buses to commence the Bus Rapid Transit system which would pick passengers on schedule rather than the current situation where vehicles picked passengers haphazardly. \nGovernment, he also announced was working around the clock to implement light tramp transport in the major cities to reduce congestion and time spent on road transport. \nPresident Mahama said government was also improving the existing airports and establishing more aerodromes to facilitate air movement, which would subsequently reduce congestion on the major roads in the country. \nOn coffee plantation, President Mahama announced that government would revamp the coffee industry as a supplement to cocoa production. \nAs a result, he announced that government was targeting the Central Region that had comparative advantage in its production, and would therefore supply them with improved coffee seeds to step up production. \nThe President also announced that government was working closely with the Colombian government to provide technical support in massive production of coffee in the coming years. \nCoffee production, he said would provide an alternative to cocoa production that was on-going in six out of the 10 regions of the country. \nHe gave the assurance that government would continue to create fertile grounds for investors but urged them to always adhere to their side of the investment bargain in order not to fall below the demands of the law. \nFrom:George-Ramsey Benamba, GNA Special Correspondent in Bordeaux, France", "external_links": [], "published": "2015-10-08T19:00:00.000+03:00", "crawled": "2015-10-09T04:29:15.074+03:00", "highlightTitle": ""}