{"organizations": [], "uuid": "db58418d8c11aabc1f6f0fd07c888b16ee6e027b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz/taxonomy/term/3/all/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/proposed-social-housing-transfers-proceed-next-phase/5/235064", "country": "US", "title": "Proposed social housing transfers proceed to next phase", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Proposed social housing transfers proceed to next phase", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T06:30:00.000+03:00", "replies_count": 0, "uuid": "db58418d8c11aabc1f6f0fd07c888b16ee6e027b"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/proposed-social-housing-transfers-proceed-next-phase/5/235064", "ord_in_thread": 0, "title": "Proposed social housing transfers proceed to next phase", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Wednesday, 21 October, 2015 - 15:30 \nThe proposed transfer of approximately 1,500 Housing NZ Corporation houses and tenancies in Tauranga and Invercargill to registered Community Housing Providers will shortly move to the next stage, Ministers Bill English and Paula Bennett say. \nAs announced by the Prime Minister in January, the Government’s Social Housing Reform Programme includes plans to transfer 1,000 to 2,000 Housing NZ Corporation houses and tenancies to registered Community Housing Providers over the next year. \n\"The Government will now seek Expressions of Interest for transfers in Tauranga and Invercargill following positive responses to market sounding, which closed on 25 September,\" Minister Responsible for Housing New Zealand Corporation Bill English says. \n\"The EOI stage is the first chance for Community Housing Providers to register their intent to participate in transfers in Invercargill and Tauranga.\" \nThe EOI phase will begin on 20 November and will close in early February next year. \n\"This is a significant change for the supply and management of social housing in New Zealand,\" says Social Housing Minister Paula Bennett. \n\"This is a good opportunity for the community housing sector to grow, diversify and innovate, and therefore ensure more families in New Zealand benefit from their expertise in both the provision of social housing and their ability to provide more support for those in need. \n\"We all, together, need to ensure we can implement a transfer process that results in a manageable, regulated, and sustainable industry, while also never losing sight of the overall goal - better looking after vulnerable New Zealanders. \n\"I know we are on the right track and have confidence we will achieve the best way forward for this ground breaking initiative.\" \n ", "external_links": [], "published": "2015-10-21T06:30:00.000+03:00", "crawled": "2015-10-21T07:25:13.471+03:00", "highlightTitle": ""}