{"organizations": [], "uuid": "3e630f9ed3940cacf229ceaa24a500f347eb4054", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "article.wn.com", "main_image": "http://i.ytimg.com/vi/GdR2v9EQxsU/0.jpg", "site_section": "http://rss.wn.com/English/keyword/politics", "section_title": "WN.com - Politics News", "url": "http://article.wn.com/view/2015/10/08/5_CESI_affiliates_take_their_seats_as_the_European_Economic_/", "country": "GB", "title": "5 CESI affiliates take their seats as the European Economic and Social Committee starts its ...", "performance_score": 0, "site": "wn.com", "participants_count": 1, "title_full": "5 CESI affiliates take their seats as the European Economic and Social Committee starts its ... - Worldnews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "3e630f9ed3940cacf229ceaa24a500f347eb4054"}, "author": "wn.com", "url": "http://article.wn.com/view/2015/10/08/5_CESI_affiliates_take_their_seats_as_the_European_Economic_/", "ord_in_thread": 0, "title": "5 CESI affiliates take their seats as the European Economic and Social Committee starts its ...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Source: Confédération Européenne des Syndicats Indépendants) This week marked the start of the 2015-2020 term of European Economic and Social Committee (EESC). Following their appointment at national level, 5 affiliates of CESI took up their mandates as committee members at the EESC constitutive meeting which took place from Tuesday to Thursday. CESI wishes them all the best for their work. • Raymond Hencks , member of the EESC since 2002, will work in the EESC's Group II (Workers' group) and was also elected into the EESC's Bureau (term of office 2015-2018). Raymond Hencks is a member of the executive committee of CESI's Luxembourgish member organisation 'General Confederation of Public Services' (CGFP). • Christian Moos is a new member of the EESC and will be part of Group III (Various interests' group). He is head of the section 'European and international affairs' at CESI's German member 'German Civil Service Federation and Collective Wage Union' (dbb). Next to his work, Christian Moos is involved in EU affairs as, e.g., Secretary general of the German Union of European Federalists (UEF-Germany). • Emilio Fatovic has been a member of the EESC since 2010 and will work in Group II for the next term. Emilio Fatovic is Deputy secretary general of CESI's Italian member 'General Confederation of Independent Trade Unions' (Confsal). Emilio Fatovic is also President of CESI's training centre 'CESI Europe Academy'. • Dumitru Fornea has been in the EESC since 2007 and will also feature in its Group II for the next term. He is Confederal secretary for international relations at CESI's Romanian member National Trade Union Confederation 'CNS MERIDIAN'. • Christophe Lefevre is a new member of the EESC and will work with Mr Fornea, Mr Fatovic and Mr Hencks in Group II. Christophe Lefevre is Confederal executive secretary of CESI's observer organisation 'French Confederation of Management/General Confederation of Executives' (CFE-CGC). At its constitutive meeting, the EESC members also elected their new political leadership, including Georges Dassis as new President. distributed by This content was issued by Confédération Européenne des Syndicats Indépendants on the 2015-10-08 and was initially posted on www.cesi.org. It was distributed, unedited and unaltered, by noodls on 2015-10-08 10:49:14 UTC. The original issuer is solely responsible for the accuracy of the information contained therein. (noodl: 30236300)", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:53:28.762+03:00", "highlightTitle": ""}