{"organizations": [], "uuid": "fd738bd2dd1153f0d7b5ab24012c34b8fa2bbb9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww1.hdnux.com/photos/41/37/01/8777824/3/rawImage.jpg", "site_section": "http://www.chron.com/news/politics/collectionRss/RD-Politics-National-heds-18603.php?cmpid=rrpolitics", "section_title": "RD Politics National heds", "url": "http://www.chron.com/news/politics/article/2016-hopefuls-from-both-parties-speak-at-New-6566110.php", "country": "US", "title": "Trump faces tough questions at bipartisan NH event", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Trump faces tough questions at bipartisan NH event", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:24:00.000+03:00", "replies_count": 0, "uuid": "fd738bd2dd1153f0d7b5ab24012c34b8fa2bbb9b"}, "author": "JILL COLVIN and HOLLY RAMER, Associated Press", "url": "http://www.chron.com/news/politics/article/2016-hopefuls-from-both-parties-speak-at-New-6566110.php", "ord_in_thread": 0, "title": "Trump faces tough questions at bipartisan NH event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 8 \nFormer Democratic vice presidential candidate, former Connecticut Sen. Joe Lieberman, an No Labels co-chairman, introduces Republican presidential candidate Donald Trump to speak at a No Labels Problem Solver convention, Monday, Oct. 12, 2015, in Manchester, N.H. Photo: Jim Cole, AP Former Democratic vice presidential candidate, former Connecticut... Image 2 of 8 \nMiss America Teen Allie Nault of Manchester, N.H., questions Republican presidential candidate Donald Trump during a No Labels Problem Solver convention, Monday, Oct. 12, 2015, in Manchester, N.H. Photo: Jim Cole, AP Miss America Teen Allie Nault of Manchester, N.H., questions... Image 3 of 8 \nRepublican presidential candidate Donald Trump speaks during a No Labels Problem Solver convention, Monday, Oct. 12, 2015, in Manchester, N.H. Photo: Jim Cole, AP Republican presidential candidate Donald Trump speaks during a No... Image 4 of 8 \nRepublican presidential candidate Donald Trump talks with reporters as he arrives to speak at a No Labels Problem Solver convention, Monday, Oct. 12, 2015, in Manchester, N.H. Photo: Jim Cole, AP Republican presidential candidate Donald Trump talks with reporters... Image 5 of 8 \nRepublican presidential candidate Donald Trump arrives to speak at a No Labels Problem Solver convention, Monday, Oct. 12, 2015, in Manchester, N.H. Photo: Jim Cole, AP Republican presidential candidate Donald Trump arrives to speak at... Image 6 of 8 \nRepublican presidential candidate, Sen. Lindsey Graham, R-S.C., speaks during a No Labels Problem Solver convention, Monday, Oct. 12, 2015, in Manchester, N.H. Photo: Jim Cole, AP Republican presidential candidate, Sen. Lindsey Graham, R-S.C.,... Image 7 of 8 \nRepublican presidential candidate, Sen. Lindsey Graham, R-S.C., arrives to speak at a No Labels Problem Solver convention, Monday, Oct. 12, 2015, in Manchester, N.H. Photo: Jim Cole, AP Republican presidential candidate, Sen. Lindsey Graham, R-S.C.,... Image 8 of 8 Trump faces tough questions at bipartisan NH event 1 / 8 Back to Gallery MANCHESTER, N.H. (AP) — Independent-minded voters in politically important New Hampshire challenged Donald Trump Monday on his \"divisive\" style and his attitude toward women. \"Prove me wrong, but I don't think you're a friend to women,\" said one woman in the crowd of more than 1,000. She asked whether, as president, he would support paying women and men equally. Then, apparently referring to reproductive rights, she asked, \"Do I get to choose what I do with my body?\" Out of his usual element of screaming supporters, Trump replied that she'd get paid the same if she does her job as well as a man, and that he is pro-life. \"I respect women, and I'm going to take care of women,\" he said. When another questioner asked whether Trump's his divisive language undermines his ability to solve problems, the candidate replied: \"I went to Ivy League schools, I know what's divisive and what's not divisive.\" He added that when the field of candidates narrows, \"you're going to see I'm going to be much less divisive.\" The billionaire businessman was one of eight candidates from both parties participating in a day-long convention hosted by No Labels. The group was created after the 2010 midterm elections and is pushing for the candidates to agree on job creation, a balanced federal budget, securing Medicare and Social Security and energy independence. The gathering in the state that casts the first votes of the 2016 presidential race was a rare appearance among candidates from both parties. The group's co-chairs, former Utah Gov. Jon Huntsman and former Connecticut Sen. Joe Lieberman , described Monday's convention as \"speed dating\" between presidential candidates and New Hampshire's independent voters, who can cast ballots in either the Republican or Democratic primaries. \"There's never before been a day like this, and never before has America needed something like this,\" Lieberman said. Democratic presidential hopeful Martin O'Malley , who was the first to speak, said the nation needs not just new leadership, but a new way of governing that invites people of all parties to \"return to the table of democracy.\" Speaking via video link from Baltimore, the former Maryland governor said he achieved results in lowering crime and improving education by employing a \"circle of collaboration\" focused on what works, and would take the same approach in tackling income inequality and other national problems as president. \"We didn't get things done by running to our labeled corners, we invited one another to come with ideas. This is a new way of leadership that people are demanding,\" he said. In contrast, Trump said solving problems is about having a strong leader who will step in take charge of a messy situation. Describing several of his real estate projects in New York: \"I had to get the city together, I had to get all the unions together, I had to get everyone together, and we got it done.\" \"You can do these things but it's about leadership,\" he said. \"It had to come from me.\" On the Republican side, Sen. Lindsey Graham of South Carolina, New Jersey Gov. Chris Christie and Ohio Gov. John Kasich also were set to speak. Sanders and former Virginia Sen. Jim Webb , also a Democrat, were expected to speak via video. Graham told the crowd of more than 1,000 that fixing the nation's woes is all about tradeoffs. \"Anybody married? I think you know what I'm talking about,\" he said. ___", "external_links": [], "published": "2015-10-12T20:24:00.000+03:00", "crawled": "2015-10-12T21:49:57.698+03:00", "highlightTitle": ""}