{"organizations": [], "uuid": "680eb9830a1a5c64005f1fba7153688bb9ba09a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wnd.com", "main_image": "http://www.wnd.com/files/2015/03/OBAMA-600.png", "site_section": "http://www.wnd.com/category/front-page/politics/feed/#", "section_title": "WND » Politics", "url": "http://www.wnd.com/2015/10/obama-alludes-to-slavery-for-black-lives-matter-defense/", "country": "US", "title": "Obama alludes to slavery for Black Lives Matter defense", "performance_score": 0, "site": "wnd.com", "participants_count": 1, "title_full": "Obama alludes to slavery for Black Lives Matter defense", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:40:00.000+03:00", "replies_count": 0, "uuid": "680eb9830a1a5c64005f1fba7153688bb9ba09a2"}, "author": "Douglas Ernst", "url": "http://www.wnd.com/2015/10/obama-alludes-to-slavery-for-black-lives-matter-defense/", "ord_in_thread": 0, "title": "Obama alludes to slavery for Black Lives Matter defense", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama alludes to slavery for Black Lives Matter defense 'We as a society, particularly given our history, have to take this seriously' Published: 25 mins ago Text smaller Text bigger \nUnderneath the “open season on crackas” threats and “pigs in a blanket” chants is a serious movement – President Obama promises. \nThe president said Thursday the Black Lives Matter movement needs to be taken “seriously” by the American people because of an injustice “happening in the African-American community that’s not happening in other communities.” \nObama made the comments while speaking at a White House forum on criminal justice. \n“We as a society, particularly given our history, have to take this seriously,” Obama said, the Associated Press reported. “And one of the ways of avoiding the politics of this and losing the moment is everybody just stepping back for a second and understanding that the African-American community is not just making this up.” \nThe president went on to say the Black Lives Matter slogan should not be interpreted as an attempt to elevate one group of people over another. Instead, he said it was an attempt to bring attention to a “legitimate issue that we’ve got to address.” \nThe Black Lives Matter movement coalesced over the past three years during racially-charged media coverage of the 2012 shooting death of Trayvon Martin in Sanford, Florida; the 2014 shooting death of Michael Brown in Ferguson, Missouri; the 2014 death of Eric Garner in Long Island, New York; and the April 2015 death of Freddie Gray in Baltimore, Maryland. \nSupporters of the movement, like Obama, have often been undermined by Black Lives Matter allies. \nIn “Scam: How the Black Leadership Exploits Black America,” Rev. Jesse Lee Peterson – a true black leader whom many affectionately call “the other Jesse” – shows how the civil rights establishment has made a lucrative career out of keeping racial strife alive in America. \nLatausha Nedd, also know as Eye Empress Sekhmet, was arrested in Clayton County, Georgia, Sept. 24, after she allegedly declared “open season on crackas” in a YouTube video, WND reported . \nBlack Lives Matter supporters in St. Paul, Minnesota, were also caught on camera chanting, “Pigs in a blanket, fry ‘em like bacon,” August 31, CBS News reported. \n“I don’t think chanting or singing what’s basically promoting killing police officers is peaceful,” St. Paul Police Federation President Dave Titus told the network at the time. \nNew York City cop killer Ismaaiyl Brinsley posted, “I’m Putting Wings On Pigs Today. They Take 1 Of Ours … Let’s Take 2 of Theirs. #ShootThePolice, #RIPErivGarner and #RIPMike Brown,” on Instagram hours before killing NYPD officers Wenjian Liu and Rafael Ramos on Dec. 20, 2014. \nThe 28-year-old committed suicide shortly afterward shooting both cops while they sat inside their patrol car in Brooklyn. BlackLivesMatter protesters take to the streets. \nThe Democratic National Committee offered an olive branch to the movement on Wednesday and approved of a town hall discussion hosted by the #BlackLivesMatter network and Campaign Zero activists. That idea was rejected by the Black Lives Matter organization on Thursday. \nRace activist DeRay Mckesson told the Washington Post Wednesday that he would continue trying to secure commitments from all presidential candidates to attend a race-themed town hall event, WND reported . Text smaller", "external_links": [], "published": "2015-10-23T03:40:00.000+03:00", "crawled": "2015-10-23T04:09:44.344+03:00", "highlightTitle": ""}