{"organizations": [], "uuid": "361f7beec834ed6c7aae135099fc53105c55c33b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nation.co.ke", "main_image": "\r\n    http://www.nation.co.ke/image/view/-/2929582/medRes/1158092/-/p07drxz/-/948328-01-02.jpg", "site_section": "http://www.nation.co.ke/news/politics/Uhuru-Mzee-Jomo-Kenyatta-Mausoleum-Parliament/-/1064/2427554/-/view/asFeed/-/43hkos/-/index.xml", "section_title": "Daily Nation | Politics", "url": "http://www.nation.co.ke/news/politics/CCM-in-big-battle-to-avoid-Kanu-fate/-/1064/2930136/-/hf3u8hz/-/index.html", "country": "GB", "title": "Lowassa or Magufuli? Tanzania decides", "performance_score": 0, "site": "nation.co.ke", "participants_count": 0, "title_full": "Lowassa or Magufuli? Tanzania decides", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T21:04:00.000+02:00", "replies_count": 0, "uuid": "361f7beec834ed6c7aae135099fc53105c55c33b"}, "author": "", "url": "http://www.nation.co.ke/news/politics/CCM-in-big-battle-to-avoid-Kanu-fate/-/1064/2930136/-/hf3u8hz/-/index.html", "ord_in_thread": 0, "title": "Lowassa or Magufuli? Tanzania decides", "locations": ["Tanzania"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Magufuli", "Kikwete", "Edward Lowassa", "DANIEL HAYDUK"], "text": "Sunday, October 25, 2015 Lowassa or Magufuli? Tanzania decides A Tanzanian man shows his ink-tipped finger after casting his vote for the Tanzanian presidential elections at a polling station on October 25, 2015 in Dar es Salaam. AFP PHOTO | DANIEL HAYDUK In Summary The main opposition candidate in the presidential election, Mr Edward Lowassa, said he was confident of victory but warned that he would outrightly reject the results if there is rigging. President Kikwete voted at his Msoga village in the Coast region at midday, vowing that while still in power his government would have no mercy on people who disrupt the polls. Voters and other residents heeded repeated warnings by the police to leave polling centres after casting their ballots. All polling centres were scheduled to close at 4pm. Advertisement More by this Author \nTanzanians on Sunday thronged polling stations to elect a new president and MPs in one of the most tightly contested elections in the country’s history. \nThe main opposition candidate in the presidential election, Mr Edward Lowassa, said he was confident of victory but warned that he would outrightly reject the results if there is rigging. \nThe former prime minister and long serving Cabinet minister, who decamped from the ruling Chama Cha Mapinduzi (CCM) earlier in the year, cast his vote in his Ngarash village at Monduli near Arusha, saying he was happy that the voting was incident-free in many parts of the country. \nMr Lowassa, 62, who was blocked from contesting Tanzania’s presidency by CCM, is locked in a tight race against the ruling party’s candidate, Dr John Pombe Magufuli, 56. Both are seeking to succeed President Jakaya Kikwete, who is stepping down at the end of his two five-year terms. \n“I am sure to win if there is fairness in the election, but will reject the results if the elections are not free and fair,” Mr Lowassa told journalists after casting his vote at 10am in the company of his wife, Regina. \nAnd Dr Magufuli — a chemistry teacher-turned politician — cast his vote in Chato constituency on the south western shores of Lake Victoria. He, too, exuded confidence that CCM would remain in power despite a strong opposition. \nMs Anna Mgwira, the only woman among the eight presidential candidates, is seeking the top seat on the ACT-Wazalendo Party ticket. She voted in the central region of Singida and said she was happy with the huge turnout of voters and tranquillity shown by Tanzanians in exercising their democratic right. \nWith the scorching sun biting at the height of the dry season, millions of Tanzanians turned up at the 65,105 polling centres to elect the fifth Union president and president of Zanzibar, an autonomous archipelago, where president Ali Mohamed Shein is seeking re-election with CUF’s Seif Sharrif Hamad his main challenger. \nPresident Kikwete voted at his Msoga village in the Coast region at midday, vowing that while still in power his government would have no mercy on people who disrupt the polls. \nAs of mid-day, the voting was going on smoothly throughout the country, with the main challenge being failure by some registered voters to find their names in the electors’ roll. \nAt one polling centre in Arusha, the names of dozens of voters were traced in Kwimba near Mwanza on the shores of Lake Victoria. \nElection officials were making frantic efforts to sort out the mix-up and enable the citizens to vote. \nBusiness came to a standstill in Arusha, the stronghold of the Opposition in Tanzania, as many voters headed to polling stations to cast their ballots. \nMany shops, including Nakumatt Supermarket, were closed. \nVoters and other residents heeded repeated warnings by the police to leave polling centres after casting their ballots. All polling centres were scheduled to close at 4pm. \nEnthusiasm for the fifth multi-party elections in Tanzania was evidently high in Arusha city where a third of the one million residents registered to vote. However, the hectic scenes associated with elections in Arusha were absent, owing to there being no election for the MP for Arusha Urban constituency, following the recent death of Estomih Mallah, a parliamentary candidate for the area under ACT-Wazalendo. \nThe by-election has been slated for January alongside that of MPs in five other constituencies where candidates — including two Cabinet ministers seeking re-election — died in accidents or after falling ill.", "external_links": [], "published": "2015-10-25T21:04:00.000+02:00", "crawled": "2015-10-25T23:50:03.733+02:00", "highlightTitle": ""}