{"organizations": [], "uuid": "1f4aa7b8f631caf6ffc9622278c4f2dc5c9f7c69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/d/3/d/c/image.related.articleLeadwide.620x349.gkfl4w.png/1445747606844.jpg", "site_section": "http://www.canberratimes.com.au/federal-politics", "section_title": "Federal Politics", "url": "http://www.canberratimes.com.au/comment/illadvised-public-foray-by-starcrossed-pair-20151022-gkfl4w.html", "country": "AU", "title": "Kathy Jackson and Michael Lawler: Was this the most ill-advised public foray ever?", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Kathy Jackson and Michael Lawler: Was this the most ill-advised public foray ever?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T11:33:00.000+02:00", "replies_count": 0, "uuid": "1f4aa7b8f631caf6ffc9622278c4f2dc5c9f7c69"}, "author": "", "url": "http://www.canberratimes.com.au/comment/illadvised-public-foray-by-starcrossed-pair-20151022-gkfl4w.html", "ord_in_thread": 0, "title": "Kathy Jackson and Michael Lawler: Was this the most ill-advised public foray ever?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Fugitive manhunt spreads to Victoria\nCommunity mourns little girl's death\nShots fired at chief racing steward's home\nPolice units dispatched across NSW, Vic border\nMelbourne rail crossing plans come under fire\nReplay video Return to video Video settings Please Log in to update your video settings\nMichael Lawler's bizarre Four Corners c-bomb Fair Work Commission vice president Michael Lawler says he feared he would be portrayed as 'c-nt-struck' when his relationship with former Health Services Union leader Kathy Jackson became public. Video courtesy Four Corners, ABC\nPT0M38S 620 349 Watching this week's astonishing Four Corners program on Michael Lawler and Kathy Jackson, I was reminded of a newspaper article I read years ago in Britain concerning ill-advised forays into the public realm.\nThe article concerned a libel case brought by former Manchester United manager Tommy Docherty against one of his former players, Willie Morgan, after Morgan declared on television that Docherty was \"the worst manager in the world\".\nDocherty was from the Gorbals in Glasgow, the toughest part of what was then one of the world's toughest cities. He was tough, quick with his tongue and one for bluff.\nMichael Lawler and Kathy Jackson on Four Corners.\nThe case, at the Old Bailey in 1978, began with Docherty in the witness box. Docherty was a man accustomed to holding court. Morgan's barrister let him do so. He cracked gags, told yarns.\nAdvertisement But day two was very different. Morgan's barrister dissected Docherty's testimony from the previous day, listing its inaccuracies and contradictions, finally saying, \"I put it to you, Mr Docherty, that you are a liar and you have lied under oath.\" Docherty had to agree.\nOn the morning of the third day, Docherty's barrister advised the court his client was dropping the case. The judge awarded Morgan costs and told Docherty that he was very lucky not to be going to prison for perjury.\nOne newspaper's report of the case next day began with a Quote: from Shakespeare's Richard II : \"Let us sit upon the ground/And tell sad stories of the death of kings\". The first sentence of the report also had a literary bent: \"In the most ill-advised libel case since Oscar Wilde sued the Marquess of Queensberry in 1895, Tommy Docherty's case against Willie Morgan yesterday collapsed etc ...\"\nWilde's case would result in him being charged with gross indecency and sentenced to two years imprisonment. Docherty would be charged with perjury, although the jury would find him not guilty on the grounds they didn't believe he intended to lie. Presumably they thought he just couldn't help himself. (The joke in Glasgow was that Docherty admitted to perjury but the judge wouldn't believe him.)\nKathy Jackson and Michael Lawler seem to have approached their Four Corners interviews much as Tommy Docherty approached the Old Bailey on the first day. But what a stunned nation found itself watching was a domestic drama of the proportions of Who's Afraid of Virginia Woolf? , the 1966 movie starring those famously star-crossed lovers, Richard Burton and Elizabeth Taylor.\nLawler's face was endlessly mobile as if his thoughts and feelings were running in a dozen different directions and he was absorbed in the task of trying to bring them all back together. Meanwhile, his star, the one to which he has hitched himself so fatefully, is Kathy Jackson.\nJackson has the manner of a smart attractive woman who knows what's going on and can tell you in a sentence. That makes her well-equipped to supply the electronic media with 15-second sound-bites. But the recent Federal Court case in which she was ordered to repay her union $1.4 million has provided us with the bigger picture in all its shocking and shameless detail.\nIt has been suggested that doing a story on two people so removed from reality is ethically questionable. The question then becomes whether Lawler and Jackson should have been protected from themselves. I don't believe so. There is a legitimate public interest in their story at multiple levels.\nThe person in the program I feel sorry for is Lawler's boss, Iain Ross. Discussing Lawler's sick leave, he sounded like someone trying to show decency to an ill work-mate. And that is a whole lot more decency than Lawler, in taping their private conversation and making it public, showed Ross.\nMartin Flanagan is a senior writer at The Age .", "external_links": [], "published": "2015-10-25T11:33:00.000+02:00", "crawled": "2015-10-26T21:25:14.713+02:00", "highlightTitle": ""}