{"organizations": [], "uuid": "26c8b96afb5af9cbc51d0f149f5eae47dedff260", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/1/0/e/4/x/f/image.related.articleLeadwide.620x349.gkarj5.png/1445685577275.jpg", "site_section": "http://www.canberratimes.com.au/federal-politics", "section_title": "Federal Politics", "url": "http://www.canberratimes.com.au/federal-politics/political-news/low-funding-rate-threatens-success-of-ndis-20151016-gkarj5.html", "country": "AU", "title": "Low funding rate threatens success of NDIS", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Low funding rate threatens success of NDIS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T19:19:00.000+03:00", "replies_count": 0, "uuid": "26c8b96afb5af9cbc51d0f149f5eae47dedff260"}, "author": "", "url": "http://www.canberratimes.com.au/federal-politics/political-news/low-funding-rate-threatens-success-of-ndis-20151016-gkarj5.html", "ord_in_thread": 0, "title": "Low funding rate threatens success of NDIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vulnerable: There are fears the transition to the NDIS may leave some people hard hit.\nServices for some of Australia's most vulnerable people risk being wound back or even cancelled under a new pricing schedule released by the National Disability Insurance Agency which threatens to cut the wages of carers.\nDisability support groups have raised concerns that the hourly rate for individual care is so low they will be unable to cover costs.\nThe biggest threat to the success of the NDIS is the low hourly rate being offered.\nSerhat Oguz The NDIA price guide for two of the most commonly used services – assistance with personal care and help with community access – is set at $41.18 per hour but will fall to $39 per hour from next year when the NDIS starts rolling out more widely.\nDisability support groups say the figure is less than the amount offered under the previous block-funded model which was closer to $50 per hour.\nAdvertisement Serhat Oguz, chief executive of care provider the Windgap Foundation, said the new price guide would deter organisations from offering assistance services, used by an estimated 100,000 Australians with a disability.\n\"The biggest threat to the success of the NDIS is the low hourly rate being offered,\" he said.\nHe described the rate as \"unrealistic and uncommercial\", saying it would force care providers to cut corners or withdraw support.\n\"Service providers will decide not to participate in particular areas or face closure,\" he said.\n\"Ultimately there would be a flow on impact to people with disability who would not be able to get a service provider.\n\"In the short term service providers that may continue to offer services will provide lower quality services with lower qualified staff.\"\nDisability support workers earn an average of about $23 per hour but the rate for the lowest skilled workers is $18.80 per hour.\nCaroline Cuddihy, chief executive of Sunnyfield Disability Services said the community expected high standards from people caring for the most vulnerable.\n\"A lot of these workers will be providing one-on-one care in people's homes,\" she said.\n\"There has to be probity, oversight, checks and controls. You need workers who are well-trained and highly ethical. That sort of quality comes at a cost and no organisation should be forced to lower its standards.\n\"You don't want a situation where people are put at risk.\"\nA spokeswoman for the NDIA, which administers the NDIS, described the new price list as simpler, saying it was created in response to feedback from providers and people with disability in NDIS trial sites.\nThe prices take the Wage Price Index and growth in award pay rates into account.\n\"The NDIS is giving people with disability more choice and control over their lives and the types of supports they receive to achieve their goals,\" she said.\n\"The NDIA will continue to work closely with providers, people with disability, their families and carers as the NDIS is rolled out across Australia.\"\nAbout 460,000 Australians will be eligible for the $22 billion scheme which will be fully established in 2018.", "external_links": [], "published": "2015-10-24T19:19:00.000+03:00", "crawled": "2015-10-26T21:33:59.220+02:00", "highlightTitle": ""}