{"organizations": [], "uuid": "08d4397f3fd9312a6352379991d6973f88ed1348", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.providencejournal.com", "main_image": "http://www.providencejournal.com/storyimage/PJ/20151007/NEWS/151009522/AR/0/AR-151009522.jpg", "site_section": "http://www.providencejournal.com/politics?template=rss&mime=xml", "section_title": "Politics - providencejournal.com", "url": "http://www.providencejournal.com/article/20151007/NEWS/151009522/13809?rssfeed=true", "country": "US", "title": "Republican group releases plan for fixing RI bridges with existing funds", "performance_score": 0, "site": "providencejournal.com", "participants_count": 1, "title_full": "Republican group releases plan for fixing RI bridges with existing funds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T21:30:00.000+03:00", "replies_count": 0, "uuid": "08d4397f3fd9312a6352379991d6973f88ed1348"}, "author": "Jennifer Bogdan  Journal State House Bureau", "url": "http://www.providencejournal.com/article/20151007/NEWS/151009522/13809?rssfeed=true", "ord_in_thread": 0, "title": "Republican group releases plan for fixing RI bridges with existing funds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Republican group releases plan for fixing RI bridges with existing funds Comment By Jennifer BogdanJournal State House Bureau Posted Oct. 7, 2015 at 11:51 am Updated at 1:30 PM PROVIDENCE, R.I. -- The Republican Policy Group released on Wednesday an alternative to Governor Raimondo's plan to fix the state's deficient bridges. Unlike the governor's plan, which proposes deriving millions from truck tolls and allowing a $600-million revenue bond, the Republicans' plan contains no tolls, new fees or bonding . The GOP group, chaired by Rep. Patricia Morgan, R-West Warwick, relies on using revenues that exist within the budget and redirecting them to bridge repairs. \"[The governor] was proposing -- I think -- extraordinary borrowing,\" Morgan said. \"We felt and we have proven you can find that money in existing funds.\" In total, the proposed cuts would total $875.8 million for bridge repairs over 10 years. The plan is not without controversy. The funding sources that would be tapped include a $3 million annual cut to the state's film tax credit program and $500,000 annual cut to Twin River's marketing revenues. Morgan called both examples of \"corporate welfare.\" The group also proposes taking revenue from DMV fees that currently flows into the general fund and redirecting the money for bridge repairs. The proposal calls for $24.3 million from DMV fees in 2017 and grows to $59.7 million by 2026. There's also a $4 million cut to the General Assembly's nearly $42 million budget. Morgan declined to provide specifics on what should be cut, but she held up a list of the Assembly's employees and said there are too many people working for a part-time legislature. Another $300,000 would be cut annually from the Medical Advisory Board's budget. The board has three staff members. Morgan said the board only meets every two months, and those staff members' duties could be shifted to other full-time staff in the Workmen's Compensation Court.", "external_links": [], "published": "2015-10-07T21:30:00.000+03:00", "crawled": "2015-10-08T06:10:09.978+03:00", "highlightTitle": ""}