{"organizations": ["Facebook Clatskanie", "Columbia County Elections", "Facebook Email Twitter Google"], "uuid": "b35cc8e3c6d9f4717e1132b90798d2f100644540", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kgw.com", "main_image": "http://cdn.tegna-tv.com/-mm-/36080e7c32bdc17ed23b437ddc7e49863aeb0b52/c=0-86-299-255&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/07/KGW/KGW/635798193156197809-diane-pohl.jpg", "site_section": "http://rssfeeds.kgw.com/_/20/106347792/kgw/politics", "section_title": "KGW - Politics", "url": "http://www.kgw.com/story/news/politics/2015/10/20/clatskanie-mayor-recall-vote-scheduled-nov-17/74288658/", "country": "US", "title": "Clatskanie mayor recall vote scheduled for Nov. 17", "performance_score": 0, "site": "kgw.com", "participants_count": 0, "title_full": "Clatskanie mayor recall vote scheduled for Nov. 17", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:00:00.000+03:00", "replies_count": 0, "uuid": "b35cc8e3c6d9f4717e1132b90798d2f100644540"}, "author": "", "url": "http://www.kgw.com/story/news/politics/2015/10/20/clatskanie-mayor-recall-vote-scheduled-nov-17/74288658/", "ord_in_thread": 0, "title": "Clatskanie mayor recall vote scheduled for Nov. 17", "locations": ["Pinterest Clatskanie", "Clatskanie"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Diane Pohl"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Clatskanie mayor recall vote scheduled for Nov. 17 A vote to keep or recall Clatskanie Mayor Diane Pohl is scheduled for November 17, the Columbia County Elections announced Tuesday. Post to Facebook Clatskanie mayor recall vote scheduled for Nov. 17 A vote to keep or recall Clatskanie Mayor Diane Pohl is scheduled for November 17, the Columbia County Elections announced Tuesday.  //on.kgw.com/1RUznGx   Clatskanie mayor recall vote scheduled for Nov. 17 KGW Staff 2 p.m. PDT October 20, 2015 Clatskanie Mayor Diane Pohl. CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nCLATSKANIE, Ore. -- A vote to keep or recall Clatskanie Mayor Diane Pohl is scheduled for November 17, the Columbia County elections office announced Tuesday. \nA petition was started in September to recall Pohl and collected 128 signatures, surpassing the 89 needed valid signatures, according to the Columbia County elections office. \nBallots will be mailed to the 865 registered voters in Clatskanie on October 28 or 29. Ballots must be returned by 8 p.m. on November 17. \nPohl has been under fire for the way she handled a complaint involving now former Police Chief Marvin Hoover. A July complaint filed by two of his officers to the Department of Public Safety Standards and Training said Hoover mocked African Americans as monkeys and sang the Confederate battle anthem \"Dixie\" during a conversation about a complaint of racism against officers. \nBackground: Ore. police chief sang Dixie, mocked blacks as monkeys, report says \nHoover was placed on leave in August, then allowed to retire by the Clatskanie city council several weeks later. Mayor Pohl was highly criticized for a letter she wrote to the Clatskanie Chief newspaper praising Hoover and his career and thanking him \"for a job well done.\" Though she knew specific details about the complaint of racism against Hoover, she made no mention of it in the letter. \nThe petition states: \n\"We believe Mayor Pohl should have publicly supported the police officers who filed a report regarding allegations of professional misconduct by former Chief Hoover. \nMayor Pohl should not have rushed to accept and recommend to the city council the acceptance of former Chief Hoover's resignation prior to the completion of the DPSST investigation.\" \nIn a statement about the petition, Pohl said: \n\"This Petition was generated from inaccurate assumptions. The City and I supported our officers. ln our press release dated September 8th it said we supported \"...that the matter was reported\" and we asked that the \"public respect the rights of the individuals who brought this matter forward.\" \nThe city began its investigation. Shortly after, Mr. Hoover's attorney informed the City's attorney that he might be willing to resign, if the terms of a separation package could be agreed upon. The City Council was open to a separation package and agreed to terms severing employment. This was a Council decision. I did not accept any agreement, nor did I make any recommendation. The council deliberated and came to their decision. The ongoing investigation by DPSST is a separate matter that the city has nothing to do with. Our case ended with the cessation of employment. Had the city not voted to accept the agreement, the process could have stretched on for several months resulting in continued costly expenses. The job of Mayor and Council is to protect the city and taxpayers from lawsuits that could be expensive. I respectfully ask to serve as your Mayor for the remainder of my term.\" \nThe Pohl name once again appeared in headlines when Diane's husband, a City of Clatskanie Planning Commissioner, was arrested on 30 counts of public indecency. Ray Pohl is accused of exposing himself multiple times at a local drive-through flower shop in September. Ray resigned from his planning commission position shortly after being arrested.", "external_links": [], "published": "2015-10-21T00:00:00.000+03:00", "crawled": "2015-10-21T00:11:35.915+03:00", "highlightTitle": ""}