{"organizations": [], "uuid": "e61588f9d427b99353034de100a8d26bca03fbbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.npr.org", "main_image": "http://media.npr.org/assets/img/2015/10/09/ap_547582373022_wide-c278e1855933e0a63b55d99f7624e9ffcf63a940.jpg?s=1400", "site_section": "http://www.npr.org/rss/rss.php?id=1012", "section_title": "Politics : NPR", "url": "http://www.npr.org/sections/itsallpolitics/2015/10/09/447245237/4-ways-this-whole-republican-speaker-thing-gets-resolved", "country": "US", "title": "4 Ways This Whole Republican Speaker Thing Gets Resolved : It's All Politics", "performance_score": 2, "site": "npr.org", "participants_count": 16, "title_full": "4 Ways This Whole Republican Speaker Thing Gets Resolved : It's All Politics : NPR", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T01:12:00.000+03:00", "replies_count": 23, "uuid": "b2636653e39311a21d632652042f7bf4ae0ba292"}, "author": "Domenico Montanaro", "url": "http://www.npr.org/sections/itsallpolitics/2015/10/09/447245237/4-ways-this-whole-republican-speaker-thing-gets-resolved#post-0", "ord_in_thread": 0, "title": "4 Ways This Whole Republican Speaker Thing Gets Resolved : It's All Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "i The pressure on Rep. Paul Ryan to run for speaker is mounting, even though he has said repeatedly he doesn't want the job. Molly Riley/AP hide caption\ni toggle caption Molly Riley/AP The pressure on Rep. Paul Ryan to run for speaker is mounting, even though he has said repeatedly he doesn't want the job.\nMolly Riley/AP Chaos ensued in the halls of Congress Thursday when Rep. Kevin McCarthy unexpectedly took himself out of the running to replace John Boehner as speaker of the House.\nThe reason for the pandemonium and, yes, even tears: No one knows where this goes from here.\nHere are the four likely ways it gets resolved:\n1. Paul Ryan steps up and becomes speaker. To a member, the consensus among House Republicans is that the only person who has 218 votes is Wisconsin Rep. Paul Ryan. Why? Because with his budgets and articulation of a conservative message, he has the credibility among establishment and conservative Republicans. The problem with this is that Ryan has said repeatedly he doesn't want the job. But the pressure on Ryan to get in is mounting, from Boehner to the man he ran with for president, Mitt Romney . Ryan has backed away from his steadfast no, and is considering it.\n2. Caretaker speaker. If Plan B (Ryan) fails, what then? No one is quite sure. But one option that has been floated by several House Republicans is to get behind a veteran, who would serve only temporarily. NPR's Susan Davis reports that would most likely be a retiring member, of which there are only a handful.\n3. Boehner forced to stay. There's nothing more than Boehner would like than to get out of town, get to his new Florida house, open a fresh pack of Camels and set a tee time. But they keep pulling him back in. Boehner has vowed to stay on as long as there is no speaker to maintain order. It's why he has repeatedly called Ryan — the person he has always wanted to succeed him — to take over.\nYouTube 4. Someone who hasn't emerged. It sounds obvious to say something no one's thought of, but be honest, how many of you were predicting McCarthy would drop out Thursday? Leadership races can be very fluid. And with the amount of power the 40 or so Freedom Caucus members have — by virtue of the need for 218 Republicans — it would be foolhardy to predict the precise way out. Of course, there is Newt Gingrich, who said he's open to coming out of retirement — just like George Washington. \"If you were to say to me 218 have called you up and given you their pledge, obviously no citizen could ever turn down that kind of challenge,\" he told Sean Hannity. \"This is why George Washington came out of retirement — because there are moments you can't avoid.\"\nWhat about a \"coalition speaker\"?\nNot on this list is the far-fetched idea of a \"coalition\" speaker. In other words, someone who has crossover appeal to both parties, can grab Democratic votes and not need 218 Republicans, since this would be a speaker for the entire House. Sounds like a nice idea, and one that Republican moderate Charlie Dent of Pennsylvania floated on NPR. Never say never. It is a once-in-a-generation event that's occurring. But this scenario is highly unlikely for two reasons:\nOne, parties generally don't like to mess with the other's affairs. One party is in the majority in the House; the other, the minority. The minority likes to let the majority pick its leader, because when the shoe is on the other foot, Democrats wouldn't want Republicans picking their leader.\nTwo, who is this bipartisan Zorro? The House is more polarized than at any time since the Civil War. There are very few moderates on either side — let alone someone who could get half or more of both parties. In short, there is no middle majority. The parties vote largely along party lines and are in their own corners, because that's how alliances and coalitions win, especially in the current Washington.\nOf course, there's always Donald Trump .\nPaul Ryan U.S. House Congress John Boehner Republicans", "external_links": ["http://www.youtube.com/embed/UdMfnIxmRaA?rel=0"], "published": "2015-10-10T01:12:00.000+03:00", "crawled": "2015-10-10T00:39:11.855+03:00", "highlightTitle": ""}