{"organizations": [], "uuid": "586e177f3e365209838596cb8fe6d74dfade70d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.worldbulletin.net", "main_image": "http://media.worldbulletin.net/news/2015/08/31/syria.jpg", "site_section": "http://www.worldbulletin.net/36/politics", "section_title": "Politics | Worldbulletin News", "url": "http://www.worldbulletin.net/todays-news/165444/us-russia-document-to-deconflict-in-syria-to-be-released", "country": "", "title": "US, Russia document to deconflict in Syria to be released | Middle East", "performance_score": 0, "site": "worldbulletin.net", "participants_count": 1, "title_full": "US, Russia document to deconflict in Syria to be released | Middle East | Worldbulletin News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "586e177f3e365209838596cb8fe6d74dfade70d5"}, "author": "World Bulletin / News Desk", "url": "http://www.worldbulletin.net/todays-news/165444/us-russia-document-to-deconflict-in-syria-to-be-released", "ord_in_thread": 0, "title": "US, Russia document to deconflict in Syria to be released | Middle East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'White House says understanding with Russia does not 'rise to the level of any sort of strategic cooperation'\nA document to deconflict U.S. and Russian military operations in Syria will likely to be released Tuesday, a White House official said Monday.\nA memorandum of understanding with Russia was the result of three separate conversations between military officials from both countries that intends to deconflict activities of both sides, said White House spokesman Josh Earnest.\n\"This is ensuring that when pilots are operating, that they're using internationally recognized communications channels, that they're speaking English so that we can -- you know, avoid mishaps,\" Earnest said.\n\"But this does not at all rise to the level of any sort of strategic cooperation at all,\" he added.\nTo emphasize his point, he pointed to the announcement Sunday of an operation by the U.S.-led coalition fighting ISIL that succeeded in killing the leader of an al-Qaeda affiliated group in northwestern Syria that was \"notable\" for the U.S, according to Earnest.\n\"Because we know this is where the Russians are spending a lot of time and carrying out a lot of their military operations,\" he said.\n\"In this instance, the United States was able to successfully carry out this operation without any undue interference from the Russians.\"\nRussia began carrying out airstrikes in Syria late last month. The strikes are aimed at supporting the regime of Syrian President Bashar al-Assad - an ally of Russia - against ISIL, according to the Kremlin.\nTurkey and the West accuse Russia of targeting moderate groups in Syria opposed to Assad, many of which are supported by Ankara and Washington.\nTo avoid military conflicts in the region, the U.S. and Russian military officials on Oct. 1 began talks about air safety above Syria.\nAt least 250,000 people have been killed since the beginning of the Syrian conflict in 2011, with 7.6 million internally displaced and more than 4 million having fled to nearby countries.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T14:25:37.075+03:00", "highlightTitle": ""}