{"organizations": [], "uuid": "1a3c40874c79eb955992b2d1f2847018fa6e2fae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nbcwashington.com", "main_image": "http://media.nbcwashington.com/images/1200*675/20151023+Parrish+McPike.jpg", "site_section": "http://www.nbcwashington.com/news/politics/?rss=y&embedThumb=y&summary=y", "section_title": "NBC4 Washington - Politics", "url": "http://www.nbcwashington.com/news/politics/For-Sluggish-Bush-Some-Backers-Fret-it-May-Soon-Be-Too-Late-336719601.html", "country": "US", "title": "Big Money Rolls into Va. Senate Race With Big Consequences", "performance_score": 0, "site": "nbcwashington.com", "participants_count": 1, "title_full": "Big Money Rolls into Va. Senate Race With Big Consequences", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T04:22:00.000+03:00", "replies_count": 0, "uuid": "1a3c40874c79eb955992b2d1f2847018fa6e2fae"}, "author": "JULIE CAREY", "url": "http://www.nbcwashington.com/news/politics/For-Sluggish-Bush-Some-Backers-Fret-it-May-Soon-Be-Too-Late-336719601.html", "ord_in_thread": 0, "title": "Big Money Rolls into Va. Senate Race With Big Consequences", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Julie Carey, David Culver and the News4 team covering where you live Big Money Rolls into Va. Senate Race With Big Consequences Big Money Rolls into Va. Link Close Embed this video <script type=\"text/javascript\" charset=\"UTF-8\" src=\"http://www.nbcwashington.com/portableplayer/?cmsID=336426371&videoID=XJNhjnxw3dJ7&origin=nbcwashington.com&sec=news&subsec=politics&width=600&height=360\"></script> More videos (1 of 9) « » Big money is rolling into a state Senate race in northern Virginia to pay for ads for gun control. One of those commercials features the father of a slain Virginia TV reporter. Northern Virginia Bureau Chief Julie Carey explains why so much is at stake in this one contest. (Published Friday, Oct. 23, 2015) Big money is rolling into a Virginia state Senate race to pay for ads promoting gun control -- and that effort is also getting a boost from the father of the Roanoke television reporter who was slain during a live broadcast. The District 29 Virginia Senate seat is open in 2015 for the first time in decades. The district cuts across Prince William County from Gainesville, through Manassas and to Woodbridge. DeSean Jackson's LA Home Scene of Home Invasion: PD But its power comes not from its size but from the precarious balance of power in the Virginia Senate. Right now, Republicans have 21 seats to the Democrats' 19. If Democratic candidate Jeremy McPike wins the seat, the Democrats could regain control. That's why McPike had a prominent role at Friday's Hillary Clinton rally in Alexandria -- and why Gov. Terry McAuliffe spoke up for him. I-66 Tolls, Gun Control: Hot Topics in Va. State Senate Race Democrats, Republicans and some outside groups have been making big investments in a very local northern Virginia political contest. Gun control and tolls on I-66 are the two issues taking center stage. Bureau Chief Julie Carey explains what is at stake. (Published Friday, Oct. 23, 2015) \"I need one seat to get control of the Senate, so I can get Medicaid expansion, safe gun restrictions -- all the things I talk about everyday to help to build the new Virginia economy,\" McAuliffe said. McPike's support of gun control is also why he's the beneficiary of $1.5 million in campaign money from Everytown, the gun control group backed by former New York Mayor Michael Bloomberg. Updated Donald Trump Moving in on Bush, Rubio Turf in Florida Some of that money is going to ads featuring Andy Parker, the father of Alison Parker, a reporter for Roanoke television station WDBJ-7 who was killed as she did a live television report on air. Cameraman Adam Ward was also killed. \"Politicians' condolences aren't enough,\" Parker says in one of the ads. Md. Gun Show to Take Place Despite Objection The Parkers also recently held a rally for McPike's campaign. \"It's been humbling to have Andy and Barbara Parker come up and speak something that has real meaning to them,\" McPike said. The GOP candidate, Manassas Mayor Hal Parrish, has been in local politics since he was first elected to the Manassas council in 1993. He said he well understands the fear and terror gun violence can create; his son was a senior at Virginia Tech in 2007 when 32 students and faculty were killed. Parrish said he wanted to focus attention on keeping guns out of the hands of people \"who shouldn't have guns because of mental health issues. I want to work on that.\" Republicans are raising their own issues, including McAuliffe's plan to add tolls to I-66 inside the Beltway. \"We'll put a stop sign on any new toll,\" Parrish said in the ad. The toll, which could be as much as $17 per day for rush hour commuters, has been controversial. The GOP commercials call the toll a \"tax.\" \"A $17 toll without one new mile of lane being built on I-66 inside the Beltway is outrageous,\" said Del. Tim Hugo, R-Fairfax/Prince William. \"This has not been thought out well and I've said I can't support it,\" Parrish said. For the record, McPike says he, too, is opposed to tolls on I-66. McAuliffe calls the GOP ads on his I-66 plan false. \"We're just giving drivers an option,\" he said. \"If you want to pay to go on it as a single driver, do it. \"Folks elected me to get things done,\" McAuliffe said. \"I am a problem-solver. I'm trying to fix 66.\" Published at 9:22 PM EDT on Oct 23, 2015", "external_links": [], "published": "2015-10-24T04:22:00.000+03:00", "crawled": "2015-10-25T03:35:45.547+02:00", "highlightTitle": ""}