{"organizations": [], "uuid": "e950bd6261a9cdbda5ee93d76de284a1b5de8c35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/13/Editorial-Opinion/Images/Pakistan_Daily_Life-06360.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/the-cost-of-fighting-extremism/2015/10/13/6d8de502-705c-11e5-ba14-318f8e87a2fc_story.html", "country": "US", "title": "The cost of fighting extremism", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "The cost of fighting extremism - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "e950bd6261a9cdbda5ee93d76de284a1b5de8c35"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/the-cost-of-fighting-extremism/2015/10/13/6d8de502-705c-11e5-ba14-318f8e87a2fc_story.html", "ord_in_thread": 0, "title": "The cost of fighting extremism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Afghan refugees and internally displaced Pakistani children gather in a mud house to learn how to write the alphabet at a makeshift school on the outskirts of Islamabad, Pakistan, in February. (Muhammed Muheisen/Associated Press) October 13 at 5:13 PM Fareed Zakaria, in his Oct. 9 op-ed column, “ The key to solving Afghanistan ,” disregarded the thousands of lives that were lost fighting extremism, leaving Pakistan politically volatile. The burden of accepting millions of refugees since the Soviet invasion of Afghanistan in 1979 and warding off the Soviets resulted in the destruction of Pakistan’s political and economic structure and sparked religious zeal that led to the present-day extremism.\nTo its credit, Pakistan has borne the responsibility of almost 1.6 million Afghan refugees, who seem unlikely to return to their homeland. Moreover, after the attack on a school in Peshawar in December, the Pakistani military has declared war against extremists. Since then, slayings of activists and leaders speaking out against terrorism have become commonplace. Numerous attacks on minorities by Sunni militants claiming to be the Taliban have scathed Pakistan’s reputation.\nRecently, the Pakistani provinces of Baluchistan and Sindh have received their share of Afghans; the commonality of ethnicity and religious zeal binds them together. Baluchistan needs to be developed and must not be allowed to become a haven for extremists. The United States should push for the economic development of Baluchistan and the safe return of refugees to Afghanistan and make a forceful call to end atrocities against non-Muslims. And diplomacy must go on.\nAnila Ali , Irvine, Calif.", "external_links": ["http://tribune.com.pk/story/911102/unhcr-figures-1-6m-afghan-refugees-in-pakistan/"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:56:51.642+03:00", "highlightTitle": ""}