{"organizations": ["House of Representatives", "National Council"], "uuid": "453b90630c1095dd32e1e12f003c1a43f3b75608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/news-release/2015/10/14/776161/10152517/en/photos/360817/36896/360817.jpg?lastModified=10%2F14%2F2015%2013%3A07%3A40&amp;size=2", "site_section": "http://globenewswire.com//Rss/subjectcode/34/Politics", "section_title": "GlobeNewswire: Politics", "url": "http://globenewswire.com/news-release/2015/10/14/776161/10152517/en/Lt-Colonel-Daniel-M-Gade-Ph-D-Appointed-to-the-National-Council-on-Disability-by-Speaker-of-the-House-of-Representatives.html?f=22&fvtc=1&fvtv=Politics", "country": "US", "title": "Lt. Colonel Daniel M. Gade, Ph.D. Appointed to the National Council on Disability by Speaker of the House of Representatives", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Lt. Colonel Daniel M. Gade, Ph.D. Appointed to the National Council on Disability by Speaker of the House of Representatives", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:07:00.000+03:00", "replies_count": 0, "uuid": "453b90630c1095dd32e1e12f003c1a43f3b75608"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/14/776161/10152517/en/Lt-Colonel-Daniel-M-Gade-Ph-D-Appointed-to-the-National-Council-on-Disability-by-Speaker-of-the-House-of-Representatives.html?f=22&fvtc=1&fvtv=Politics", "ord_in_thread": 0, "title": "Lt. Colonel Daniel M. Gade, Ph.D. Appointed to the National Council on Disability by Speaker of the House of Representatives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel M. Gade"], "text": "Lt. Colonel Daniel M. Gade, Ph.D. Appointed to the National Council on Disability by Speaker of the House of Representatives ET | Source: National Council on Disability photo-release \nWASHINGTON, Oct. 14,   The National Council on Disability (NCD) – an independent federal agency that recommends disability policy to the President, Congress and other federal agencies – welcomes the appointment of Lt. Colonel Daniel M. Gade, Ph.D., of New Windsor, NY to the Council. \nLt. Colonel Gade's appointment to NCD by House Speaker John Boehner was published in the Congressional Record on Thursday, October 8, 2015. Appointments to NCD are made by the President of the United States, the Senate Majority Leader, the Senate Minority Leader, the Speaker of the House, and the House Minority Leader pursuant to section 451 of the Workforce Innovation and Opportunity Act (Pub. L. 113–128). The bill was signed into law by President Obama on July 22, 2014. \nLt. Colonel Gade joins Chair Clyde Terry, Co-Vice Chairs Katherine Seelman, Ph.D. and Royal P. Walker, Jr., J.D., and members Gary Blumenthal, Janice Lehrer-Stein, Lynnae Ruttledge, Kamilah Oni Martin-Proctor, Benro T. Ogunyipe, Bob Brown, and Neil Romano at the independent federal agency. \nLt. Colonel Gade's biography is included at the end of this announcement. \n\"The Council welcomes Lt. Colonel Gade on-board. We're pleased to be adding his expertise and experience to our collective quest to ensure full participation of Americans with disabilities in the civic, social and economic fabric of American life,\" stated NCD Chair Clyde Terry. \nBiography: Lieutenant Colonel Daniel Gade is an assistant professor at the United States Military Academy, and the Deputy Director of the Simon Center for the Professional Military Ethic. He led a tank company in battle in Iraq in 2004 and 2005, where he was wounded in action twice and decorated for valor. A right leg amputee, Lieutenant Colonel Gade remains on active duty in the US Army. He holds a Master's Degree and a PhD from the University of Georgia, and worked as an Associate Director of the Domestic Policy Council in the White House from 2007-2008. \nAbout the National Council on Disability (NCD): First established as a small advisory Council within the Department of Education in 1978, NCD became an independent federal agency in 1984. In 1986, NCD recommended enactment of an Americans with Disabilities Act (ADA), and drafted the first version of the bill which was introduced in the House and Senate in 1988. Since the ADA became law in 1990, NCD has continued to play a leading role in crafting policy solutions, and in advising the President, Congress and other federal agencies on disability policies, programs, and practices. \n### \nA photo accompanying this release is available at: http://www.globenewswire.com/newsroom/prs/?pkgid=36896 Lawrence Carter-Long Public Affairs Specialist National Council on Disability 1331 F Street, NW, Suite 850 Washington, DC 20004 202-272-2004 Voice 202-272-2074 TTY 202-272-2022 Fax Related Articles", "external_links": [], "published": "2015-10-14T20:07:00.000+03:00", "crawled": "2015-10-14T23:11:33.161+03:00", "highlightTitle": ""}