{"organizations": [], "uuid": "efd53d619a3a7bfc44619ab2db51a18e4a68badc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww3.hdnux.com/photos/41/57/14/8844054/5/rawImage.jpg", "site_section": "http://www.seattlepi.com/national/us/", "section_title": "U.S.: Politics, Crime, Weather and More - seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Bangladesh-rejects-Islamic-State-claim-of-attack-6589137.php", "country": "US", "title": "Bangladesh rejects Islamic State claim of attack on Shiites", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Bangladesh rejects Islamic State claim of attack on Shiites - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "efd53d619a3a7bfc44619ab2db51a18e4a68badc"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/crime/article/Bangladesh-rejects-Islamic-State-claim-of-attack-6589137.php", "ord_in_thread": 0, "title": "Bangladesh rejects Islamic State claim of attack on Shiites", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DHAKA, Bangladesh (AP) — Bangladesh's government on Sunday dismissed the Islamic State group's claim that it was behind a bomb attack on thousands of Shiite Muslims in the nation's capital, and said there was no evidence that the Sunni extremist group had any following in the South Asian country.\nIt was the third time the Islamic State group claimed responsibility for an attack in Bangladesh, after it said it was behind the recent killing of two foreigners — an Italian aid worker and a Japanese agricultural worker.\nThe government again redirected blame toward locally banned Islamist groups and the main Islamist political party, accusing them of staging Saturday's attack to destabilize the already fractious and impoverished nation.\n\"Again, I am saying there is no IS,\" Home Minister Asaduzzaman Khan said.\nThe country is struggling, however, to stem rising fears about radical Islam after a spate of violent attacks, including the murder of four atheist bloggers. Responsibility for those attacks was claimed by the domestic Islamist group Ansarullah Bangla Team, and authorities are investigating new threats against more bloggers made in an email signed by an Ansarullah spokesman and sent to Bangladeshi media last week.\nBefore dawn on Saturday, unidentified attackers hurled a set of home-made bombs into a crowd of Shiite Muslims as they were gathering for a religious procession in Dhaka's old quarter. A teenage boy died and more than 100 other people were injured.\nIt was the first time the 400-year-old Shiite procession for the holiday of Ashoura had been targeted in Dhaka. Shiites are a minority in Bangladesh, but are generally not discriminated against, and attacks against them are virtually unheard of.\nWithin hours of the attack, the Islamic State group posted a statement online claiming responsibility for the attack, according to the SITE Intelligence Group , which monitors jihadi activities. The statement could not be independently verified.\nPolice were questioning three suspects detained after the blasts and examining closed-circuit television footage for clues, Dhaka police spokesman Muntasirul Islam said.\nInvestigators also visited the bomb site — the 17th century Huseni Dalan , a Shiite center of learning — where three bombs exploded and two were found undetonated.\nDespite the attacks, thousands of Shiites went ahead with the 8-kilometer (5-mile) procession on Saturday without any further disruption.\nPrime Minister Sheikh Hasina , a moderate who pledged to stamp out militant radical groups, has overseen the arrests of dozens of suspected militants and the banning of six groups in recent years. Experts say the crackdown has left some of Bangladesh's more hard-line Muslims feeling alienated, and has led to a resurgence in activity by Islamic extremist groups.\nThe violence has rattled foreigners and threatened the impoverished country's economy, which relies heavily on foreign aid and a $25 billion garment industry that produces clothing for top international brands.\n___\nThis story has been corrected to show that an Ansarullah Bangla Team spokesman signed an email threatening more bloggers, instead of an Islamic State group spokesman.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T00:45:49.332+02:00", "highlightTitle": ""}