{"organizations": [], "uuid": "7b116e3687592cfca471a0a321197b2885d1efd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30217652/hallmark-solicitors-offer-legal-perspective-on-volkswagen", "country": "US", "title": "Hallmark Solicitors Offer Legal Perspective on Volkswagen", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hallmark Solicitors Offer Legal Perspective on Volkswagen - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "7b116e3687592cfca471a0a321197b2885d1efd2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30217652/hallmark-solicitors-offer-legal-perspective-on-volkswagen", "ord_in_thread": 0, "title": "Hallmark Solicitors Offer Legal Perspective on Volkswagen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hallmark Solicitors\nHULL, England , October 8, 2015 /PRNewswire/ --\nVolkswagen have been found to be falsifying emissions data for some of their diesel engine cars in the United States . It now seems that a similar problem exists here in the U.K. and consumers who currently own an affected vehicle that they purchased new could potentially have a claim against the manufacturer.\nHull -based litigation specialists, Hallmark Solicitors, have been closely following matters as they have developed. They say: - \" If cars sold by Volkswagen Group in the UK are found to contain defeat devices then this could give rise to claims by purchasers of new Volkswagens, who still own them, on the basis of false information given to them by Volkswagen. \"\nHallmark Solicitors continue: - \" The engine thought to be affected is the EA189 2.0 litre turbo diesel engine, used between 2009 and 2015, which in addition to being used by Volkswagen, is also used by Audi, Seat and Skoda in the UK in a wide variety of models including the Volkswagen Golf and Passat, the Audi A3 and A4 and the Seat Leon and Skoda Octavia. Owners should be able to find out which engine is fitted to their car by either checking their V5C or by looking at their Service Book which should have a data sticker attached to it which will show the engine type fitted. \"\nOwners may have legal claims for breach of contract due to alleged misrepresentations made to them by VW Group when they purchased cars. Purchasers thought that they were buying something that they were not.\nAlastair Redfern of Hallmark Solicitors says: - \" There are a number of potential areas of claim, including the recovery of any premium paid for a ' clean diesel \" model, potential reduction in the value of the car, potentially higher fuel bills and any potential increase in road tax. \"\nHallmark Solicitors continue: - \" Company and fleet operators may be proportionally worse off because they purchase fleets of cars rather than individual vehicles often based upon emissions and fuel consumption data, and also because they often buy with the residual value of their fleet firmly in mind at the time of purchase. \"\n\" There is certainly the possibility of a group action in the U.K. against Volkswagen on behalf of purchasers of any affected products. Anyone who thinks that their car might be affected can register their potential claim with us for free and receive further information as the situation develops. \"\nHallmark Solicitors can be contacted on +44-(0)1482-616-616.\nUche Akali\nManaging Director\nHallmark Solicitors\n+44-(0)8456-808-251\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510082253&Transmission_Id=201510081259PR_NEWS_USPR_____enUK201510082253&DateId=20151008", "http://www.xmlnews.org/ns/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:57:47.134+03:00", "highlightTitle": ""}