{"organizations": [], "uuid": "bc77cfb637e4c2de6e1366136d187ebde0ead005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/business/articles/2015/10/19/united-to-release-plan-following-ceos-hospitalization", "country": "US", "title": "United to release plan following CEO's hospitalization", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "United to release plan following CEO's hospitalization - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "bc77cfb637e4c2de6e1366136d187ebde0ead005"}, "author": "USNews", "url": "http://www.usnews.com/news/business/articles/2015/10/19/united-to-release-plan-following-ceos-hospitalization", "ord_in_thread": 0, "title": "United to release plan following CEO's hospitalization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "United Continental expects to release details on plan following CEO's hospitalization Associated Press Oct. 19, 2015 | 2:06 p.m. EDT + More By DAVID KOENIG, AP Airlines Writer\nDALLAS (AP) — United Airlines is preparing to release details about how it plans to move forward during the hospitalization of its new CEO, Oscar Munoz.\nIn a brief statement Monday, Chairman Henry Meyer III said the board would finish a corporate-governance review and would likely say more in the next day or two. United provided no additional information about Munoz's condition.\nMunoz, 56, became CEO in early September after Jeff Smisek abruptly stepped down amid a federal investigation.\nMunoz vowed that he would deal with customer-service issues and other problems at the world's second-biggest airline. He was admitted to a hospital on Thursday. The company disclosed his hospitalization on Friday after The Wall Street Journal reported that he had suffered a heart attack, and shares fell 3 percent.\nShares of United Continental Holdings Inc. rose 62 cents, or 1.1 percent, to $56.59 in afternoon trading Monday.\nPublicly traded companies must disclose when there is a change in CEOs, but there is no legal requirement to disclose a health setback or hospitalization of a top executive. It is up to the board to decide whether the information is material — whether investors would consider it important.\n\"It's a judgment call,\" said Donna Dabney, executive director of The Conference Board, a business group that does research on management and other corporate topics. \"Corporate governance usually goes beyond what the minimum legal requirements are.\"\nCompanies have tilted toward more disclosure ever since Apple Inc. was criticized for failing to provide more information about CEO Steve Jobs' pancreatic cancer, Dabney said. However, she said, boards are reluctant to comment if they believe they don't know all the facts about a situation, such as the extent of a CEO's health problems.\n\"You want to be transparent to your constituents; beyond even your shareholders but to the public and your employees,\" Dabney said.\nMunoz took ill just five weeks after replacing Jeff Smisek, who departed during a federal investigation into whether the airline gave preferential treatment to a former chairman of the agency that operates the New York-area airports. The rapid-fire series of events complicates the job of the United board.\n\"They are concerned about the appearance of stability for the company and how it affects customers, suppliers and competitors,\" said Jill Fisch, a law professor and corporate-governance expert at the University of Pennsylvania.\nFisch said the United board may not have all the information it needs because Munoz's doctors are bound by their own confidentiality rules. The board could face liability if it is either too optimistic or too pessimistic about Munoz' health, she said.\nUnited said Friday that operations were continuing normally in Munoz's absence. United, in addition to its United Express regional flight operation, operates nearly 5,000 flights a day.\nThe Chicago company is scheduled to report third-quarter financial results Thursday.\nUnited has been plagued by technology challenges since its 2010 merger with Continental. More recently, the federal began investigating whether under Smisek the airline gave preferential treatment to a former chairman of the agency that operates the New York-area airports. Despite those hurdles, United has posted strong profits, earning $1.7 billion in the first half of 2015.\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZeccu5%3Fsrc=usn_fb", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZeccu5%3Fsrc=usn_tw&via=usnews&text=United%20to%20release%20plan%20following%20CEO%27s%20hospitalization", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZeccu5%3Fsrc=usn_rd&title=United%20to%20release%20plan%20following%20CEO%27s%20hospitalization", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZeccu5%3Fsrc=usn_li&title=United%20to%20release%20plan%20following%20CEO%27s%20hospitalization&summary=&source=U.%20S.%20News", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZeccu5%3Fsrc=usn_su", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZeccu5%3Fsrc=usn_gp"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T21:20:18.864+03:00", "highlightTitle": ""}