{"organizations": ["Associated Press"], "uuid": "4149c7a76062f06086d553eacd92e5f20bef2252", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/53/5b/JN_Facebook_Icon.png", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/top-news/irs-husband-and-wife-apply-to-same-sex-couples-too/nn7KW/", "country": "US", "title": "IRS: 'Husband' and 'wife' apply to same-sex couples, too", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "IRS: 'Husband' and 'wife' apply to same-sex couples, too", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:14:00.000+03:00", "replies_count": 0, "uuid": "4149c7a76062f06086d553eacd92e5f20bef2252"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/irs-husband-and-wife-apply-to-same-sex-couples-too/nn7KW/", "ord_in_thread": 0, "title": "IRS: 'Husband' and 'wife' apply to same-sex couples, too", "locations": ["WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["STEPHEN OHLEMACHER"], "text": "Updated: 6:14 p.m. Wednesday, Oct. 21, 2015 | Posted: 6:14 p.m. Wednesday, Oct. 21, 2015 IRS: 'Husband' and 'wife' apply to same-sex couples, too By STEPHEN OHLEMACHER The Associated Press WASHINGTON — \nThe IRS is making it official: The tax agency says it will now recognize same-sex marriages regardless of where they were performed. \nThe IRS and the Treasury Department also said they will interpret the terms \"husband\" and \"wife\" to apply to same-sex spouses as well as opposite-sex spouses. \nThe IRS proposed the regulations Wednesday to implement the Supreme Court's decision in June legalizing same-sex marriages in every state. \nThe Supreme Court ruled 5-4 that the Constitution provides a right to same-sex marriage. Before the ruling, there were 13 states that did not recognize same-sex marriages. Since the ruling, agencies across the federal government have been updating their regulations to reflect the change. \nTreasury Secretary Jacob Lew said the regulations would ensure \"that all are treated equally under the law.\" \n\"These regulations provide additional clarity on how the federal government will treat same-sex couples for tax purposes in light of the Supreme Court's historic decision on same-sex marriage,\" Lew said. \nThe Human Rights Campaign, which advocates for gay rights, praised the proposed regulations. \nSen. Ron Wyden, D-Ore., said, \"With new rules enshrining marriage equality in our tax laws, we're taking another important step in a very long march.\" \nThe IRS has recognized same-sex marriages for tax purposes since 2013, as long as the marriages were performed in states where same-sex marriage was legal. Same-sex marriages are now legal in every state. \nThe IRS said the regulations would apply to all federal tax provisions in which marriage is a factor, including filing status, exemptions, the standard deduction and employee benefits. The proposed regulations would not apply to domestic partnerships, civil unions or similar relationships, the IRS said. \nTaxes are a decidedly mixed bag when it comes to marriage. Married couples generally must file their federal income tax returns using either the \"married filing jointly\" or \"married filing separately\" filing status. Some couples are able to lower their tax bills by getting married, while others pay a marriage penalty. \nSome of the biggest tax savings go to couples in which one spouse relies on the other for employer-provided health insurance. By law, employer-provided health insurance is tax-free for the vast majority of workers, married spouses and dependent children. But if a worker's unmarried partner is covered, those benefits, which can be worth thousands of dollars a year, are taxed. \nSome wealthy same-sex couples could do well, too, if one spouse inherits a lot of money from the other. That was the central issue in the 2013 Supreme Court case that struck down the federal Defense of Marriage Act, or DOMA. \nIn the 2013 case, Edith Windsor of New York sued to challenge a $363,000 federal estate tax bill after her partner of 44 years died in 2009. Under federal law, married couples can inherit unlimited amounts of money from their spouses, tax-free. \n___ \nFollow Stephen Ohlemacher on Twitter: http://twitter.com/stephenatap Copyright The Associated Press", "external_links": [], "published": "2015-10-22T01:14:00.000+03:00", "crawled": "2015-10-22T11:37:17.099+03:00", "highlightTitle": ""}