{"organizations": [], "uuid": "7bb60ef6764bae01da3e9ef3434bcad8509df9ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/politics/", "section_title": "Politics | ArcaMax Publishing", "url": "http://www.arcamax.com/politics/opeds/s-1735398?fs", "country": "US", "title": "Education will change your life | Op Eds", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Education will change your life | Op Eds | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "7bb60ef6764bae01da3e9ef3434bcad8509df9ab"}, "author": "arcamax.com", "url": "http://www.arcamax.com/politics/opeds/s-1735398?fs", "ord_in_thread": 0, "title": "Education will change your life | Op Eds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How does a poor Latina from Texas end up as the president of the fourth-largest community college in the state of Washington? Drive, education and helping hands.\nMy parents might not have had the opportunity to stay in school long, but they both realized the value of education. They not only ran their small family upholstery business and raised their children, they also taught English and U.S. citizenship classes to recent immigrants and were active volunteers in the community.\nI also had some wonderful teachers, who, even with limited resources, inspired me, believed in me, and kept me excited about learning. When I learned my hard work and class standing would get me a few scholarships, I was thrilled beyond words. I give thanks to the many people -- family members, teachers, friends and colleagues -- who offered me their encouragement and support as I navigated my way through college and down a career path that led me to where I am today.\nI found my niche in the community college system, because I know first hand how access to education can not only provide marketable skills, but also build self-esteem and provide a pathway towards more enriching lives. I also know, personally, that access to education means textbooks and classwork, as well as the opportunity to connect with role models who will take the time to say, \"I've been there, it's hard, but I'll help you, and you can succeed.\"\nHow can we provide that support? I have several beliefs that have served me well:\n-- Lift as you climb. We must not only show others that they are very capable, we need to take the time to share our experiences so that others can learn from our mistakes and our successes.\n-- Pay it forward (especially financially). One of the biggest hurdles for students is having sufficient funds to pay for college. Personally, I have established three different scholarship programs (one at my high school and two at Edmonds Community College) to help students pay for a community college education. I hope to lead by example and reach out to others to create similar legacies.\n-- Give back by serving as a mentor and advocate for others. To increase the number of Latinas serving at the higher levels of administration, I initiated quarterly dinners to encourage them to obtain their doctorate degrees. In my role as president of Edmonds Community College, I also involve students in leadership roles at the college and enjoy one-on-one meetings with them.\nAs a young Latina growing up in Texas, I did not set out to become a community college president. Now, I realize this is my most rewarding career experience because I get to influence the services and resources we provide our students, work with an outstanding group of students and employees, and influence so many in my community. I hope more Latinos and Latinas will reap the rewards of a higher education degree and achieve their dreams. I've attained mine.\nAbout The Writer\nJean Hernandez is president of Edmonds Community College in Lynnwood, Wash. She wrote this for Progressive Media Project, a source of liberal commentary on domestic and international issues; it is affiliated with The Progressive magazine. Readers may write to the author at: Progressive Media Project, 409 East Main Street, Madison, Wis. 53703; email: pmproj@progressive.org; Web site: www.progressive.org. For information on PMP's funding, please visit http://www.progressive.org/pmpabout.html#anchorsupport.\nThis article is available to Tribune News Service subscribers. Tribune did not subsidize the writing of this column; the opinions are those of the writer and do not necessarily represent the views of Tribune or its editors.\n(c)2015 Jean Hernandez\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["http://www.facebook.com/sharer.php?u=http://www.arcamax.com/politics/opeds/s-1735398&h=Education+will+change+your+life", "http://www.progressive.org/pmpabout.html#anchorsupport.", "https://plus.google.com/share?url=http://www.arcamax.com/politics/opeds/s-1735398", "http://twitter.com/share?url=http://www.arcamax.com/politics/opeds/s-1735398&hashtags=ArcaMax"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T07:44:46.400+03:00", "highlightTitle": ""}