{"organizations": [], "uuid": "9ccb6354b23ecec0ee4faa898eb5feacfba02589", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-n_55ed58946a502cc22ead5fe7415dcb47.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/netanyahu-urges-kerry-to-reject-palestinian-lies/article/2574735?custom_click=rss", "country": "US", "title": "Netanyahu urges Kerry to reject Palestinian 'lies'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Netanyahu urges Kerry to reject Palestinian 'lies' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:14:00.000+03:00", "replies_count": 0, "uuid": "9ccb6354b23ecec0ee4faa898eb5feacfba02589"}, "author": "Pete Kasperowicz", "url": "http://www.washingtonexaminer.com/netanyahu-urges-kerry-to-reject-palestinian-lies/article/2574735?custom_click=rss", "ord_in_thread": 0, "title": "Netanyahu urges Kerry to reject Palestinian 'lies'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Israeli Prime Minister Benjamin Netanyahu on Thursday called on the U.S. and other countries to pressure Palestinian Authority President Mahmoud Abbas to \"stop spreading lies\" that Israel is the one inciting violence in the region that has led to dozens of deaths.\nNetanyahu spoke alongside Secretary of State John Kerry just before they were set to hold a meeting in Berlin, and said the meeting was taking place as Palestinian-inspired attacks continued.\n\"Yesterday was a tough day,\" Netanyahu said. \"We had four terrorist attacks.\"\n\"This morning began — we had an attack in which two terrorists tried to murder a bus full of school children,\" he added. \"There is no question that this wave of attacks is driven directly by incitement — incitement from Hamas; incitement from the Islamist movement in Islam; and incitement, I am sorry to say, from President Abbas and the Palestinian Authority.\"\n  Obama on #BLM: People 'have to take it seriously' 'The African American community's not just making this up. It's not just something being politicized.'\nBy Kelly Cohen • 10/22/15 5:07 PM Related Story: http://www.washingtonexaminer.com/article/2574118/ \"I think it's time for the international community to say clearly to President Abbas: Stop spreading lies about Israel, lies that Israel wants to change the status quo on the Temple Mount, lies that Israel wants to tear down the Al-Aqsa Mosque, and lies that Israel is executing Palestinians,\" Netanyahu said. \"All of that is false.\"\nConservatives within the United States have criticized the Obama administration for issuing a blanket call to both Israel and the Palestinians to help de-escalate tensions and growing violence. These critics say the administration is treating as equivalent the violent Palestinian attacks against Israelis, and Israel's responses to those attacks.\nBut Kerry declined to take up Netanyahu's specific request to call out the Palestinians, and instead said incitement to violence must stop, without saying who is doing the inciting.\n\"We have to stop incitement, we have to stop the violence,\" Kerry said in Berlin. \"And I think it's critical. Obviously, this conversation that you and I will have is very important to settle on the steps that will be taken that take us beyond the condemnation and beyond the rhetoric.\"\n\"It is absolutely critical to end all incitement and all violence, and to find a road forward to build the possibility that is not there today for a larger process,\" Kerry added.\nAlso from the Washington Examiner U.S., Pakistan aim to provide clean energy to 30 million people Partnership wants to kickstart more investment by the private sector.\nBy Kyle Feldscher • 10/22/15 5:01 PM Kerry said he has already spoken with Palestinian Authority President Mahmoud Abbas during his trip to Europe and the Middle East this week, and said he believes \"people want this to de-escalate.\"\nTop Story Gowdy scolds Benghazi Dems for focus on 'money,' not 'heroism' Gowdy tore into Democrats at the Benghazi hearing for complaining about the $5 million price tag Thursday.\nBy Al Weaver • 10/22/15 4:34 PM", "external_links": [], "published": "2015-10-22T20:14:00.000+03:00", "crawled": "2015-10-23T01:00:35.340+03:00", "highlightTitle": ""}