{"organizations": ["Prism Robert Litt Comments Data", "ECJ"], "uuid": "a43cdfdc9fd9d1bb343d89780c3abf62b51c12dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/m/img/social/og-ft-logo-large.png", "site_section": "http://www.ft.com/rss/world/us/politics", "section_title": "US politics news - latest US politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/90be63f4-6863-11e5-a57f-21b88f7d973f.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "The ECJ has its facts wrong about Prism", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "The ECJ has its facts wrong about Prism", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T09:05:00.000+03:00", "replies_count": 0, "uuid": "a43cdfdc9fd9d1bb343d89780c3abf62b51c12dd"}, "author": "", "url": "http://www.ft.com/cms/s/0/90be63f4-6863-11e5-a57f-21b88f7d973f.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "The ECJ has its facts wrong about Prism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert Litt"], "text": "October 5, 2015 7:05 am The ECJ has its facts wrong about Prism Robert Litt Comments Data collection neither ‘mass’ nor ‘unrestricted’, says Robert Litt \nLast month an advocate-­general of the European Court of Justice issued an opinion in a case of exceptional significance for commercial relations between the US and the EU. Washington, which is not a party to the proceedings, has no opportunity to make a direct submission to the Court. We respect the EU’s legal process . However, the advocate-general’s judgment contains a number of inaccuracies — and before the court makes a final decision we want to set the record straight. \nThe case concerns the “safe harbour” rules that allow companies with operations in Europe to transfer personal data to servers in the US. This framework, in operation since 2000, is based on a finding by the European Commission that it provides adequate privacy protection under EU law. More than 4,400 companies rely on it to transfer data necessary to support transatlantic trade, the digital economy and jobs in both the EU and the US. More Carney is wrong on our fossil fuels need \nThe lawsuit was brought in Ireland. It is based on press reports concerning a US foreign intelligence programme called Prism, which, the complaint says, allows “unrestricted access to mass data stored on servers in the United States”. \nThe Irish High Court adopted this characterisation, as did the advocate-general, who said: “The evidence now available would admit of no other realistic conclusion.” \nActually, the available evidence demonstrates the contrary. \nSince press reports about this programme began surfacing in 2013, President Barack Obama has ordered extensive public disclosures about it. Court documents have been released and two independent bodies have released reports examining US surveillance practices. These sources, which are publicly available, accurately describe the Prism programme, which is another name for foreign intelligence collection subject to judicial supervision under section 702 of the Foreign Intelligence Surveillance Act. \nPrism “is not based on the indiscriminate collection of information in bulk”, as a report from the US Privacy and Civil Liberties Oversight Board makes clear. \nThis body, an independent, bipartisan agency within the executive branch, has stated that the programme “consists entirely of targeting specific persons about whom an individualised determination has been made”. It can be used only to collect communications for an approved foreign intelligence purpose, such as combating terrorism or weapons proliferation, and the court must approve procedures that ensure that targets are appropriately chosen. \nThe programme does not give the US “unrestricted access” to data. Rather, the US may obtain communications only relating to specific identifiers, such as an email address or telephone number; only if the US believes those identifiers are being used to communicate foreign intelligence information; and only with the legally compelled assistance of communications service providers under the supervision of an independent court. \nEven when the US does intercept communications of ordinary people — because, for example, those people are communicating with valid foreign intelligence targets — strict procedures limit how long they can be retained and how they can be disseminated. \nLast year there were 90,000 targets of surveillance under Section 702. That may sound a lot. But it is a tiny proportion of the 3.2bn people who use the internet worldwide. \nThis programme helps protect Americans as well as our partners and allies. But it can be used only when authorised by law, in a manner that protects the privacy of all persons, and with extensive oversight from all three branches of our government. \nThe US legal framework for intelligence collection includes robust protection for privacy under multiple layers of oversight and a remarkable degree of transparency. \nThe decisions of judicial bodies should be informed by accurate information. Prism is focused and reasonable. It does not involve “mass” and “unrestricted” collection of data, as the advocate-general says. \nThe writer is general counsel of the US Office of the Director of National Intelligence Related Topics", "external_links": [], "published": "2015-10-05T09:05:00.000+03:00", "crawled": "2015-10-05T09:15:38.126+03:00", "highlightTitle": ""}