{"organizations": [], "uuid": "5222194d011159571e22ed844b6956d6640c9678", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newrepublic.com", "main_image": "http://www.newrepublic.com/sites/default/files/bed-kiss.jpg", "site_section": "http://www.newrepublic.com/taxonomy/term/17538/feed#", "section_title": "The New Republic - Politics", "url": "http://www.newrepublic.com/article/123171/sex-serious-college-women-wont-be-satisfied-until-they-decide", "country": "US", "title": "Is Sex Serious? College Women Won’t Be Satisfied Until They Decide.", "performance_score": 0, "site": "newrepublic.com", "participants_count": 1, "title_full": "Is Sex Serious? College Women Won’t Be Satisfied Until They Decide.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:25:00.000+03:00", "replies_count": 0, "uuid": "5222194d011159571e22ed844b6956d6640c9678"}, "author": "Elizabeth Bruenig", "url": "http://www.newrepublic.com/article/123171/sex-serious-college-women-wont-be-satisfied-until-they-decide", "ord_in_thread": 0, "title": "Is Sex Serious? College Women Won’t Be Satisfied Until They Decide.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Elizabeth Bruenig Photo: Shutterstock.com I had been studying abroad in England for about a year when I finally got around to sorting through the orientation materials for my graduate program at Brown University. To my surprise, I was required to complete an online tutorial on sexual misconduct, as opposed to just being given a pamphlet on the subject. Overseas, the graduate students had been treated like adults; nobody bothered us with detailed primers on how to have sex. Not so at Brown, which also compels undergraduates to take the online tutorial and, during orientation, to participate in group discussions on sexual misconduct. These are followed by ongoing educational campaigns, via email and other avenues, about what the rules about sex are at Brown. By and large, these programs are not about the obvious forms of sexual misconduct one might suspect to find at a university, namely the pursuit of naive students by lecherous professors. Nor are they primarily concerned with the forms of sexual misconduct all of us already understand to be criminal acts, like peeping through unattended windows, abducting unsuspecting pedestrians, or groping strangers. They’re mostly about the kinds of scenarios that, until very recently, were ambiguously perceived as rude or distasteful but not necessarily the criminal act of rape: two drunk kids hooking up, for instance, or one partner progressing from second base to third without clarifying that specific intention ahead of time. But because those latter forms of misconduct have been popularly re-categorized as tantamount to (or dangerously close to) rape, universities are scrambling to protect themselves from lawsuits and Title IX complaints by instituting “ affirmative consent ” policies, with some states adding legislation to that effect. The idea of affirmative consent policies is to place the onus on the initiator of sexual activity to establish the presence of enthusiastic, committed consent, rather than relying on a lack of refusal as permission to continue. If students really follow these policies, one presumes, a certain sort of sexual misconduct on college campuses will almost entirely disappear. Despite these putative advances, some sexually active college students are not without their reservations. In a recent New York magazine essay, Rebecca Traister interrogates the sole primacy of consent in campus feminist sex ethics. “Young feminists,” she writes, “have adopted an exuberant, raunchy, confident, righteously unapologetic, slut-walking ideology that sees sex—as long as it’s consensual—as an expression of feminist liberation. The result is a neatly halved sexual universe, in which there is either assault or there is sex positivity.” The bifurcation of all sex into criminal or liberating, Traister argues, leaves students without language to discuss the vast amount of sex between those two poles which is merely unfulfilled, gross, or boring. A more robust feminist discourse, she concludes, would investigate why so much sex is, for women, regrettably bad—namely because men are not taught to be particularly interested in women’s sexual needs, something that would be corrected in a more enlightened world. I agree with Traister that the simplification of all sex into assault or liberation is a reductive, misleading mistake, and that it springs from an essentially under-developed feminism. I also agree that it makes more sense to focus resources on how students can seek out the kind of sex they want to have instead of focusing purely on how to avoid the devastating assaults seemingly waiting around every corner . After all, as Traister observes, the current sexual discourse on campus is failing to make young women feel particularly happy. Yet it seems to me that the students Traister interviews in her article are not so much disappointed about missing out on pleasure due to bad sex as they are distraught by the emotional consequences of sex with selfish (or at least indifferent) partners, which is a much more puzzling and difficult problem to remedy. One woman, for instance, describes a consensual but drunken sexual experience involving more than one man, later writing \"I feel weird about what went down” and describing it as “such a fucked-up experience.” From the most liberal sex-positive standpoint, this level of emotional tumult over sex with a selfish partner doesn’t make a lot of sense. The idea of denuding sex of its relational connotations is that women will be more free to explore their own sexual interests, uninhibited by expectations that such things be confined to serious, loving relationships—a privilege that has always been afforded men. The result is a world of no-strings-attached sex that people can pursue without any relationship or mutual goal, each engaging for his or her own benefit. And yet, it seems to be the impersonal, uninvested brand of sex that affirmative consent policies and Traister’s subjects each gesture to correct. In both affirmative consent scenarios and the pro-sex world Traister's subjects imagine, sexual initiators (in most cases men) are expected to at least go through the motions of caring about their partner’s pleasure, enthusiasm, emotional state, and overall well-being: a sexual etiquette of gentlemanly concern. \nEtiquette is the small change of morality, a collection of rules-of-thumb that gesture to larger principles. In this case, so much university time and money devoted to preventing not only criminal assaults but unsatisfying and alienating sex suggests that there’s something significant about sex that raises its stakes so high. Is sex serious or not? If it isn’t, then perhaps the emotional consequences of bad sex described by Traister’s subjects are a result of social programming, whereby so many people burdening sex with undue gravitas causes others to internalize such feelings. In that case, the very worst thing we can do is expound in endless tutorials and seminars on the life-shattering terror of sexual encounters where one is bored and only passively interested. Programs like these would only stand to emphasize that when sex is unsatisfying, one should expect to be crushed by internal turmoil. \nBut if sex is serious, then it makes sense to warn impressionable students newly immersed in cultures of extreme sexual license about the consequences of entering into intimate encounters without a sound idea of what it could mean for them. And, further, it’s only right to implore students not to have sex unless they genuinely respect their partners, care about them, maybe even—radical as it is—love them. Either way, it’s clear consent-only rhetoric hasn’t entirely cleansed the murky waters of college sex culture, and that perhaps nothing will until we can decide what we’re consenting to when we say “yes.” For more stories, like the New Republic on Facebook: Loading Related Articles...", "external_links": [], "published": "2015-10-21T19:25:00.000+03:00", "crawled": "2015-10-22T03:07:29.342+03:00", "highlightTitle": ""}