{"organizations": [], "uuid": "e7bb0fc4a25ac083e123eecded62c1349c8516b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef-1.bbci.co.uk/news/1024/media/images/82989000/jpg/_82989169_parl.jpg", "site_section": "http://www.bbc.co.uk/news/politics", "section_title": "UK Politics - BBC News", "url": "http://www.bbc.com/news/uk-politics-34526583", "country": "US", "title": "Select committee shuffle", "performance_score": 0, "site": "bbc.com", "participants_count": 1, "title_full": "Select committee shuffle - BBC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "e7bb0fc4a25ac083e123eecded62c1349c8516b3"}, "author": "BBC", "url": "http://www.bbc.com/news/uk-politics-34526583", "ord_in_thread": 0, "title": "Select committee shuffle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Select committee shuffle Mark D'Arcy Parliamentary correspondent 14 October Politics An interesting test of the strength among Labour MPs is due next Tuesday, as at least three former Labour shadow cabinet members seek a new role in select committee land.\nNormally elections to fill vacancies in select committees and the parliamentary Labour party's ruling body, the Parliamentary committee, would be pretty routine affairs - but not at the moment. Now, almost any random election is translated into a grudge match between the new leadership and its supporters, and heavy-hitters among the anti-Corbyn refuseniks, who have conspicuously not taken posts on the Labour front bench.\nI don't know if the candidacies of the likes of Chuka Umunna to Home Affairs, Rachel Reeves for the Treasury committee and Mary Creagh for Environmental Audit amount to a slate, or whether a group of individuals are separately seeking new roles. But the outcome will show if their parliamentary colleagues sympathise with their decision to leave the front bench, (or perhaps want to deliver a swipe at their leader) or whether they regard them as out of touch grandees with a sense of entitlement. And it may provide an early guide to the internal balance of the 2015 PLP.\nOrdinary select committee members are elected from within their party groups (as opposed to committee chairs who're elected by all MPs) and the promotion of large numbers of Labour MPs to the Corbyn front bench means there are quite a few vacancies available.\nFor the record they are: Communities and Local Government, 1 place, Defence, 1, Culture, Media and Sport, 1 (and because the Labour MPs remaining on this committee are all male, only women can be nominated), Energy and Climate Change, 3, Environment, Food and Rural Affairs, 1 (another women only seat), Environmental Audit, 2, Health, 3, Home Affairs, 2, Justice, 3, Science and Technology, 2, Treasury, 1, Work and Pensions, 1, Women and Equalities, 1, Public Accounts, 3 and Petitions, 2.\nIn addition there are two vacancies on the crucial Parliamentary committee, following the return of Emily Thornberry and the departure of David Anderson. The committee holds regular meetings with the leader and its responsibilities include protecting the rights of backbenchers, so - to pluck an example from the air - any sweeping disciplinary action against MPs who defied the party whip would have to be backed by the committee.\nFormer shadow work and pensions secretary Rachel Reeves' pitch for the Treasury committee is: \"I hope that this experience makes me well qualified to take on the government on their programme of austerity, deep cuts and regressive policies that disproportionately hit working families, the most vulnerable and women. I also believe that my experience in challenging government ministers in the chamber and on the media during budgets and pre-budget reports in the last parliament will mean I am well qualified to challenge them on the Comprehensive Spending Review, cuts to tax credits and departmental spending cuts in excess of 25% - which we all know will have a devastating impact on public services including schools, social care, policing and local authority spending.\"\nIn an email to colleagues, former shadow BIS Secretary, Chuka Umunna, mentions his work as chair of the London Gangs Forum and speaks of the \"need a far more sane and rational debate on immigration.\"\n\"We cannot as a party duck addressing this issue. I do not believe we should give any quarter or pander to the likes of UKIP (as Theresa May did in her Tory Party Conference speech the other week) who seek to use this issue to sow the seeds of division and set different groups against each other. What I do believe is we need to do far more to help support those who come to our shores in integrating into the communities where they settle which I do not believe the Government is doing. I will not hesitate in calling the Government out on these issues if elected to the Committee.\"\nNominations for the various posts close on Friday and the ballot will be held next Tuesday (October 20th) and the results will emerge that evening. And for the real anoraks, there will also be elections for the chairs and vice-chairs of backbench departmental committees - who as I noted in an earlier post are allowed, under the PLP's standing orders, to speak, on occasion from the despatch box. Nominations for those posts will close at 3.00pm on Friday, October 30th- and a vote will be held, if the elections are contested, on Wednesday, November 4th.", "external_links": ["http://static.bbci.co.uk/news/1.91.0426/img/correspondents/circles/markdarcy.png"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T21:07:28.426+03:00", "highlightTitle": ""}