{"organizations": [], "uuid": "e7e6b7e55e90cc97bc40d67920282278487b7308", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/current-events/51118-ben-carson-education-let-fox-control-henhouse.html", "country": "US", "title": "Ben Carson on education: Let the fox control the henhouse!", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "Ben Carson on education: Let the fox control the henhouse!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T21:05:00.000+03:00", "replies_count": 0, "uuid": "e7e6b7e55e90cc97bc40d67920282278487b7308"}, "author": "johnwk", "url": "http://defendingthetruth.com/current-events/51118-ben-carson-education-let-fox-control-henhouse.html", "ord_in_thread": 0, "title": "Ben Carson on education: Let the fox control the henhouse!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". It still amazes me that Ben Carson, who is identified as a conservative and indicates he embraces our Constitution said he thinks Under Carsons thinking, the fox ought to be in charge of the henhouse. But those who support our Constitution and its list of particulars for which Congress is authorized to tax and spend federal revenue know very well that Congress is not authorized to tax for and finance public school systems adopted by the States. The Maryland Constitutio Now, with respect to our federal Constitution and its delegated powers, we find Delegate Charles Pickney, on August 18th of the federal Convention which framed our constitution proposed a broad power \"To establish seminaries for the promotion of literature and the arts and sciences\" . But this proposal was rejected by the Convention in favor of a limited grant of power expressed in Article 1, Section 8, Cl.8, of the proposed constitution. The limited power, later agreed upon by ratification of our Constitution authorizes Congress \"[t]o promote the Progress of Science and useful Arts. by securing for limited Times to Authors and Inventors the exclusive Right to their respective Writings and Discoveries. As nightfall does not come at once, neither does oppression. In both instances there is a twilight where everything remains seemingly unchanged. And it is in such twilight that we all must be aware of change in the air - however slight - lest we become unwitting victims of darkness.", "external_links": [], "published": "2015-10-17T21:05:00.000+03:00", "crawled": "2015-10-18T00:20:42.704+03:00", "highlightTitle": ""}