{"organizations": [], "uuid": "18c78f08bf745f85fa8cbe1db6453219303449b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30170339/cap-solar-wins-national-award-for-innovative-energy-project-for-nonprofits", "country": "US", "title": "CAP Solar Wins National Award For Innovative Energy Project For Nonprofits", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CAP Solar Wins National Award For Innovative Energy Project For Nonprofits - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "18c78f08bf745f85fa8cbe1db6453219303449b5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30170339/cap-solar-wins-national-award-for-innovative-energy-project-for-nonprofits", "ord_in_thread": 0, "title": "CAP Solar Wins National Award For Innovative Energy Project For Nonprofits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Greater Bergen Community Action\nGoldman Sachs investment spurs savings from solar installations, helping keep local facilities' doors open\nHACKENSACK, N.J. , Oct. 2, 2015 /PRNewswire/ -- Greater Bergen Community Action affiliate CAP Solar received IREC's 2015 \"Community Renewable Energy Project of the Year.\"\nIREC VP/CEO Larry Sherwood , presenting the award commented, \"This is the most innovative use of financing options for projects of this type that we have seen.\"\nThe green-technology collaboration implements solar energy projects to lower costs for NJ nonprofits.\nTwo megawatts of solar power were installed on 36 nonprofit roofs, creating 23 jobs and saving $3m+ over 15 years. Some facilities remain open due largely to their installations.\nRobert F. Halsch Jr. , GBCA Executive Director, said, \"Our hope is that with this valuable attention, our model will be replicated over and over again nationally by other nonprofits.\"\nCAP Solar was made possible through a $10m equity investment by Goldman Sachs Urban Investment Group. Goldman Sachs utilized New Market Tax Credits to create an economic model, reducing the cost of installing, managing and maintaining solar power for smaller sites, enabling them to enter a previously inaccessible market.\n\"Goldman Sachs has a long-standing commitment to addressing critical environmental issues and has provided over $60bn of clean energy financing and investment since 2006,\" said Margaret Anadu , managing director in the Goldman Sachs Urban Investment Group. \"We are especially proud of CAP Solar because it has achieved important cost savings for NJ nonprofits and serves as a model for implementing energy-efficient programs on a smaller scale in low-income communities.\"\nwww.capsolar.org .\nGREATER BERGEN COMMUNITY ACTION\nCommunity Action Agency GBCA is part of a nationwide network addressing the intractable and persistent problem of poverty in America.\nGBCA mobilizes public and private resources to change the conditions in which low-income residents live and work, and the institutions that impact their lives.\nAbout the Urban Investment Group at Goldman Sachs\nEstablished in 2011, the Urban Investment Group deploys the firm's capital by making investments and loans that benefit urban communities. Through its comprehensive community development platform, UIG is a catalyst in the revitalization of underserved neighborhoods. UIG has committed more than $4.1 billion , facilitating the creation and preservation of more than 17,000 housing units--the majority of which are affordable to low, moderate, and middle-income families--as well as 1,800,000+ square feet of community facility space, and 5,000,000+ square feet of commercial, retail, and industrial space.\nIREC\nRecognized thought leader, stakeholder coordinator, expert resource and facilitator of regulatory reform; its work expands consumer access to clean energy; generates information and objective analysis grounded in best practices and standards; and leads national efforts to build a quality-trained clean energy workforce, benefitting consumers, policymakers, utilities and the clean energy industry.\nAn independent, not-for-profit 501(c)(3) relying on donors, sponsors, and program funder support.\nPhotos:\nhttp://www.prlog.org/12496662\nPress release distributed by PRLog\n releases/cap-solar-wins-national-award-for-innovative-energy-project-for-nonprofits-300153261.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/cap-solar-wins-national-award-for-innovative-energy-project-for-nonprofits-300153261.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA13150&Transmission_Id=201510020701PR_NEWS_USPR_____DA13150&DateId=20151002", "http://www.xmlnews.org/ns/", "http://www.prlog.org/", "http://www.prlog.org/12496662", "http://www.capsolar.org/"], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T19:17:01.475+03:00", "highlightTitle": ""}