{"organizations": [], "uuid": "3d1b795549a43407ac60763623e01d6836965ede", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.vice.com", "main_image": "https://news-images.vice.com/images/articles/meta/2015/10/06/harper-again-rejects-call-for-inquiry-into-missing-and-murdered-indigenous-women-in-canada-1444164831.jpg?crop=0.5625xw:1xh;center,top", "site_section": "https://news.vice.com/topic/politics", "section_title": "Politics | VICE News", "url": "https://news.vice.com/article/harper-again-rejects-call-for-inquiry-into-missing-and-murdered-indigenous-women-in-canada", "country": "US", "title": "Harper Again Rejects Call for Inquiry Into Missing and Murdered Indigenous Women in Canada", "performance_score": 3, "site": "vice.com", "participants_count": 1, "title_full": "Harper Again Rejects Call for Inquiry Into Missing and Murdered Indigenous Women in Canada | VICE News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "3d1b795549a43407ac60763623e01d6836965ede"}, "author": "Tamara Khandaker", "url": "https://news.vice.com/article/harper-again-rejects-call-for-inquiry-into-missing-and-murdered-indigenous-women-in-canada", "ord_in_thread": 0, "title": "Harper Again Rejects Call for Inquiry Into Missing and Murdered Indigenous Women in Canada", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Canadian Prime Minister Stephen Harper has once again rejected a call to conduct a national inquiry into missing and murdered aboriginal women, saying \"we are way past the time for further study.\"\nHarper, who is running for re-election, was asked Tuesday by VICE's Matty Matheson at a rally in Whitby, Ontario, whether he would change his position on the UN-requested inquiry.\n\"Our government position on this has been very clear,\" said Harper. \"We have moved forward with a whole series of criminal justice reforms that deal with the problems of violence against people generally, violence against women in particular.\"\nHarper said there have already been about 40 studies on the topic, and that the ruling Conservatives were moving forward with a plan of action that \"deals with issues of prevention, investments in preventative services, particularly on reserves, that deals with issues of inquiry, of investigation.\"\n\"Most of these murders, sad as they are, are in fact solved,\" he said. \"We are way past the time for further study, this is a time for action, and our government is going to proceed with our action plan.\"\nRelated: Police Say Indigenous Women Are Still Overrepresented in Canadian Murder Statistics\nIn a 2014 report, the Royal Canadian Mounted Police (RCMP) found 1,107 Aboriginal women had been murdered and another 164 went missing between the years 1980 and 2012. It surveyed data from all police jurisdictions across the country.\nAs of June 2015, 106 murder and 98 missing cases remained unresolved, according to the RCMP.\nThis means about 90 percent of the murder cases have been solved.\nAccording to the report, solve rates between Aboriginal and non-Aboriginal homicide victims are comparable, but they differ depending on the province.\nFor example, in Nova Scotia, the solve rates are 80 percent, while in New Brunswick, they are 100 percent for Aboriginal women. For non-Aboriginal women, they're as low as 84 percent in British Columbia, and as high as 100 percent in PEI, the Yukon, and the Northwest Territories. However, the rates fluctuate when the numbers are small, like in Atlantic Canada.\nThe report also says certain homicides appear to be resolved less frequently — for example, for Aboriginal victims in the sex trade, the solve rate is less than 60 percent, while for non-Aboriginal victims, it's 65 percent.\nThe overall average time to solve female homicide was similar — 212 days on average, with an average clearance time of 224 days for Aboriginal women and 205 days for non-Aboriginal women.\nIn 2013, Aboriginal women represented 4.3 percent of the overall female population. They were overrepresented in figures related to homicides, however, representing 16 percent of all homicide victims.\nThe New Democratic Party has promised to initiate an inquiry within 100 days of forming a government.\nAt a town hall hosted by VICE Canada in Toronto on Monday, Liberal leader Justin Trudeau reiterated his support for a government-funded inquiry.\n\"We need a national public inquiry into the tragedy that are the missing and murdered indigenous girls,\" he said. \"We need to get justice for the victims. We need healing for the family. And we need to ensure as a society, as a country, that we stop this ongoing tragedy.\"\nTrudeau criticized those who contend that such a public airing isn't necessary.\n\"That's almost worse. If people think they already know what the problem is, then why haven't they fixed it,\" said Trudeau. \"I think we actually still need to dig into the reasons behind this and how we're going to move forward and how we're going to prevent this from continuing to happen.\"\nIn May 2014, UN special rapporteur on the rights of indigenous peoples James Anaya released a report, calling the government's efforts to address problems faced by indigenous people \"insufficient.\"\nHe echoed calls from Canadian politicians, native groups, and other UN members, urging the Harper government to launch a national inquiry into missing and murdered Aboriginal women.\nFollow Tamara Khandaker on Twitter: @animatk", "external_links": ["https://twitter.com/anima_tk"], "published": "2015-10-06T03:00:00.000+03:00", "crawled": "2015-10-07T00:59:54.397+03:00", "highlightTitle": ""}