{"organizations": [], "uuid": "33a987316dd701e4632ca6b7bce0bdc0949ed3a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30246375/award-winning-educator-michelle-herczog-joins-proconorg-board-of-directors", "country": "US", "title": "Award-Winning Educator Michelle Herczog Joins ProCon.org Board of Directors", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Award-Winning Educator Michelle Herczog Joins ProCon.org Board of Directors - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "33a987316dd701e4632ca6b7bce0bdc0949ed3a9"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30246375/award-winning-educator-michelle-herczog-joins-proconorg-board-of-directors", "ord_in_thread": 0, "title": "Award-Winning Educator Michelle Herczog Joins ProCon.org Board of Directors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " ProCon.org\nCalls ProCon.org \"an outstanding resource for critical thinking and preparing students for college, career, and civic life\"\nSANTA MONICA, Calif. , Oct. 13, 2015 /PRNewswire-USNewswire/ -- The nation's leading source for the pros and cons of controversial issues , ProCon.org (online at www.procon.org ), announced today that prominent educator Dr. Michelle Herczog has joined the organization's Board of Directors .\nDr. Herczog is the Immediate Past President of the National Council for the Social Studies (NCSS), the largest association in the nation devoted solely to social studies education. She was involved in the development of the \"College, Career, and Civic Life (C3) Framework for Social Studies State Standards\" published by NCSS in 2013 and continues to support schools in implementation efforts to increase the rigor and relevance of social studies education for all students.\nDr. Herczog was Vice-Chair and member of the California Instructional Quality Commission, an advisory board to the California State Board of Education on instructional materials and content standards. She also served on the California Task Force on K-12 Civic Learning commissioned by California State Supreme Court Chief Justice Tani G. Cantil-Sakauye . The Task Force released a report of recommendations in 2013 to provide opportunities for all students to develop the knowledge, skills, and dispositions to become actively engaged citizens. She currently serves on the Power of Democracy Steering Committee, working to implement each of the Task Force recommendations.\nShe also served as Co-Chair of the California Coalition for the Partnership for 21st Century Skills, instrumental in the establishment of California as an official P21 Leadership State. The P21 initiative is dedicated to preparing students for college, career, and global citizenship by fusing rigorous content knowledge with 21st century skills of collaboration, critical thinking, communication, and creativity within standards, assessments and professional development programs.\nCommenting on her new role with ProCon.org, Dr. Herczog stated: \"Critical thinking is an important skill all students must have in order to succeed in the 21st century. Having used ProCon.org in teacher training, and working closely with K-12 teachers, I know that it is an outstanding resource for critical thinking and preparing students for college, career, and civic life. I am thrilled the ProCon.org Board has invited me to help advance their mission in education to create an informed, engaged, responsible citizenry.\"\nJay Rakow , CEO of ProCon.org, said: \"We are excited to have someone with Dr. Herczog's distinguished reputation and extensive experience as an educator. She will be an important voice for educators at our table and will help make sure that as we continue our rapid growth the needs and interests of teachers and students remain a top priority.\"\nDr. Herczog received her Doctoral Degree in Education as well as her BA at UCLA. She received her MA in Education at California State University, Northridge .\nAbout ProCon.org\nProCon.org has more than 20 million visitors a year to its no-cost, ad-free website. It presents highly curated and exhaustively referenced content in a mostly pro and con format.\nProCon.org is free of charge, requires no registration, and has been used by educators in more than 6,500 schools in all 50 states and in 80 foreign countries. Information is presented on 53 different ProCon.org issue websites in subjects ranging from alternative energy, gay marriage, and medical marijuana to the death penalty, immigration, and physician-assisted suicide. The organization also conducts student workshops and professional development workshops for teachers.\nFor information about ProCon.org, visit www.procon.org\nFacebook: www.facebook.com/procon.org\nTwitter: www.twitter.com/procon_org\nPinterest: www.pinterest.com/proconorg\nYouTube: www.youtube.com/proconorg\nTumblr: http://proconorg.tumblr.com\nFor information about ProCon.org, please contact:\nKamy Akhavan , President & Managing Editor\nkamy@procon.org\n310-587-1407\nLogo - http://photos.prnewswire.com/prnh/20130208/MM57290LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/award-winning-educator-michelle-herczog-joins-proconorg-board-of-directors-300158462.html\n ", "external_links": ["http://www.procon.org/view.background-resource.php?resourceID=2709", "http://www.youtube.com/proconorg", "http://proconorg.tumblr.com/?soc_src=mail&soc_trk=ma", "http://photos.prnewswire.com/prnvar/20130208/MM57290LOGO", "http://photos.prnewswire.com/prnh/20130208/MM57290LOGO", "http://www.prnewswire.com/news-releases/award-winning-educator-michelle-herczog-joins-proconorg-board-of-directors-300158462.html", "http://www.procon.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC26369&Transmission_Id=201510130620PR_NEWS_USPR_____DC26369&DateId=20151013", "http://www.pinterest.com/proconorg", "http://www.xmlnews.org/ns/", "http://www.twitter.com/procon_org", "http://www.facebook.com/procon.org"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T15:22:22.458+03:00", "highlightTitle": ""}