{"organizations": [], "uuid": "bc76eebfe71f0e4e6e1248634e6a001379e1f804", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/20/7c/993b450545b3a53d3a8d637e0f19/140729-scheduling-editorial.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/20/report-government-aid-favors-big-business", "country": "US", "title": "Report: Government Aid Favors Big Business", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Report: Government Aid Favors Big Business - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "bc76eebfe71f0e4e6e1248634e6a001379e1f804"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/20/report-government-aid-favors-big-business", "ord_in_thread": 0, "title": "Report: Government Aid Favors Big Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report: Government Aid Favors Big Business A new report suggests economic development incentives are disproportionately aimed at big business. Small businesses often get the short end of the stick when it comes to economic development packages, according to a new study.\nBy Andrew Soergel Oct. 20, 2015 | 3:40 p.m. EDT + More Small businesses are consistently snubbed by government-led economic development programs, according to a new study issued Tuesday by corporate and government watchdog group Good Jobs First .\nThe study's findings run contrary to the typical political narrative that small businesses are viewed as the backbone of the U.S. economy. According to the report, large businesses actually command the lion's share of government-issued economic development incentives.\nGood Jobs First analyzed more than 4,200 awards designed to stimulate economic activity throughout 14 strategically selected states dating back to 2007. The study found that 70 percent of the awards – and 90 percent of their monetary value – went straight to large businesses.\nRELATED\nChina Syndrome Dampens Third Quarter Earnings \"State economic development spending is profoundly biased against small, local and entrepreneurial businesses,\" Greg LeRoy, executive director of Good Jobs First and lead author of the study, said in a statement accompanying the report. \"Our findings definitively confirm what many small businesspeople have long believed.\"\nThe study defines a small business as an enterprise that is locally owned, employs fewer than 100 people and consists of no more than 9 individual establishments. Its authors argue that the division in funding is unfair, considering the sheer size of the small business economy. The Census Bureau most recently estimated that firms with fewer than 100 workers on their payrolls employ more than a third of America's workers and account for 98 percent of all companies nationwide.\n\"As a policy solution, we do not recommend simply reallocating deals and dollars,\" LeRoy said. \"Instead, states should reform their incentive rules by tightening eligibility to exclude large recipients.\"\nSee Photos\n5 Signs the Labor Market's in Trouble Although the sheer number of larger firms in the U.S. is dwarfed by small and local businesses, it's important to keep in mind that firms with at least 100 workers employ nearly two-thirds of the U.S. workforce. So cutting them off from government stimulus awards entirely probably would not be a good option.\nBut small businesses have consistently led the charge in terms of job creation in recent months, according to ADP's monthly Small Business Report . Catering to such firms, or at least opening the door a little wider, could go a long way toward increasing employment totals nationwide.\nSmall businesses are also more dependent on stimulus packages like tax breaks, considering how difficult it is for many to access sufficient credit and lock down loans. A separate small business study conducted by service employment site Thumbtack found that nearly 17 percent of small business owners said credit access was their top problem. More than 10 percent of respondents cited taxes as a primary concern, and another 9 percent said they were most worried about competition from large businesses. Stimulus packages could potentially lighten small businesses' load and encourage more hiring or more output, both of which would be positive for the broader economy.\nRELATED\nSeniors Miss Out on Social Security Bump \"Given small businesses' important role in the economy – and their still-lingering credit access problems coming out [of] the Great Recession – this massive allocation of tax breaks to big businesses is wasteful and ineffective economic development policy,\" the report said. \"At the very least, states should substantially reduce the total amount of subsidy dollars flowing to big businesses.\"\nThe Good Jobs First survey's findings support the results of a separate in-house study published last month, which found that small businesses \"overwhelmingly believe that state economic development incentives favor big businesses, that states are overspending on large individual deals, and that state incentive programs are not effectively meeting the needs of small businesses seeking to grow,\" according to a press release .\n\"\"Despite their pro-small business rhetoric, state officials' programs are perceived as biased in favor of large companies that receive big tax-break packages,\" LeRoy said in a statement.\nTAGS: economy economic stimulus small business employment", "external_links": ["http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZedtik%3Fsrc=usn_su", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZedtik%3Fsrc=usn_gp", "https://www.whitehouse.gov/blog/2010/08/17/small-businesses-are-backbone-our-economy-and-cornerstones-our-communities", "http://www2.census.gov/econ/susb/data/2012/", "http://www.goodjobsfirst.org/sites/default/files/docs/pdf/levelfieldprrel.pdf", "https://www.thumbtack.com/survey#/sentiment!context=states&employer=2&index=1&industry=0&view=absolute", "http://www.adpemploymentreport.com/2015/September/SBS/SBS-NER-September-2015.aspx", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZedtik%3Fsrc=usn_rd&title=Report%3A%20Government%20Aid%20Favors%20Big%20Business", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZedtik%3Fsrc=usn_li&title=Report%3A%20Government%20Aid%20Favors%20Big%20Business&summary=A%20new%20report%20suggests%20economic%20development%20incentives%20are%20disproportionately%20aimed%20at%20big%20business.&source=U.%20S.%20News", "http://www.goodjobsfirst.org/sites/default/files/docs/pdf/shortchanging.pdf", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZedtik%3Fsrc=usn_tw&via=usnews&text=Report%3A%20Government%20Aid%20Favors%20Big%20Business", "http://www.goodjobsfirst.org/sites/default/files/docs/pdf/levelfieldreport.pdf", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZedtik%3Fsrc=usn_fb"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T00:31:03.064+03:00", "highlightTitle": ""}