{"organizations": [], "uuid": "b36acef354dee1e0ec636e77cfe5461014cdeff6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com:80/polopoly_fs/1.1438267!/fileImage/httpImage/102215-ts-debate1.jpg", "site_section": "http://www.northjersey.com/cmlink/politics-rss.rss#", "section_title": "Politics News on NorthJersey.com", "url": "http://www.northjersey.com/news/education/candidates-running-for-board-of-ed-speak-at-forum-1.1438266", "country": "US", "title": "Candidates running for Teaneck Board of Ed. speak at forum - Education", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Candidates running for Teaneck Board of Ed. speak at forum - Education - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:32:00.000+03:00", "replies_count": 0, "uuid": "b36acef354dee1e0ec636e77cfe5461014cdeff6"}, "author": "Megan Burrow", "url": "http://www.northjersey.com/news/education/candidates-running-for-board-of-ed-speak-at-forum-1.1438266", "ord_in_thread": 0, "title": "Candidates running for Teaneck Board of Ed. speak at forum - Education", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Buy this photo BERNADETTE MARCINIAK/STAFF PHOTOGRAPHER Teaneck Board of Education candidates forum was held at Teaneck High School on Oct. 19. Pictured, from left, are Victoria Fisher, incumbent David Gruber, Kathleen Muse, incumbent Sarah Rappoport and incumbent Gervonn Rice. The forum was run by an independent professionally-trained moderator. TEANECK - Residents heard from the candidates for the Teaneck Board of Education Monday night at a candidate’s forum held by the League of Women Voters of Teaneck at the high school. \nAll five candidates, incumbents David Gruber, Sarah Rappoport and Gervonn Rice, and challengers Victoria Fisher and Kathleen Muse participated in the forum, which was run by an independent professionally-trained moderator.\nBuy this photo At the beginning of the Oct. 19 forum, each candidate gave a brief opening statement explaining why they were running for the three open, three-year-terms on the school board. \nGruber, a 23-year resident of Teaneck completing his first term on the board, said he has had a life-long interest in public policy, and wants to continue working to make sure tax dollars are spent efficiently.\n\"We do not have unlimited resources. Teaneck is among the highest taxed municipalities in the United States and I for one would rather invest in pre-k and other areas rather than salaries that keep going up and up,\" he said. \nRappoport, a resident of Teaneck for three decades, is also running for a second term on the board. Among the issues she said she would like to continue working on are the \"ongoing effort to close achievement gaps, the ever-present need to protect taxpayers wallets,\" and ensuring equitable education for all Teaneck students. \n\"I think our children deserve a better and more thorough conversation than what usually goes on in town,\" she said. \nRice, currently the vice-president of the school board, is running for her fourth term. A life-long resident of Teaneck, Rice said she and all three of her children have been the beneficiaries of an education in Teaneck Public Schools. \n\"It’s all about students first,\" she said. \"Public education is being eroded because it’s not properly funded and it’s unfortunate that 90 percent of the burden falls on the taxpayers. Until we can lobby and perhaps unite together to fight that battle, it is important to use the resources that we have effectively and conscientiously.\"\nFisher, a 25-year resident, is also a product of Teaneck schools. She said her background in public administration and service makes her well prepared to tackle the challenges the school board currently faces. \n\"I’m here tonight because I believe that public education is bar none the most important public service that a government can provide,\" she said. \nMuse, a resident for 10 years, has 18 years experience in teaching and school administration and currently works as a substitute teacher in Teaneck schools. As a parent of two children in the school district, Muse said she would bring the perspective of a parent and a teacher to the board. \n\"What drives me is my experience in education, my knowledge of grant writing, and I hope to be able to give that educational support,\" she said. \"The law states that all children are entitled to a thorough and efficient education and I want to be sure that includes all students from our diverse community.\"\nBefore the forum began, residents were invited to write questions down on cards for the candidates to answer. The questions dealt with a wide variety of topics, including ideas to improve involvement of both public school and non-public school parents, how to shine light on the positive things going on in the schools, whether they would support eliminating the high school football program and using the money saved towards pre-school, and what they would bring to the table during the next labor negotiation with the Teaneck Township Education Association.\nOn engaging parents, Rice said the district has to get creative, particularly because in so many Teaneck families, both parents work outside of the home. Since she has been on the board, the district has introduced Skyward, computer software that enables schools to send emails to parents and allows parents to check students’ grades online. \n\"There are a lot of ways to engage them and we try to accept and understand that just because a parent may not be in the building, they are engaged, they are connected, and they do care about their students,\" she said. \"Our back-to-school nights, our parent-teacher conferences are well attended, but we have to be more creative in finding ways to engage our parents.\"\nGruber said \"engagement is really tough,\" but he would like to see an increased use of social media to reach parents and the community. In terms of parents of children not in the public school system, Gruber said, \"I think it’s a question of communication and potentially are there opportunities to leverage the resources of the various day schools as well as the public schools and perhaps have some joint activities.\"\nFisher noted that Teaneck is incredibly diverse, but also fractured, and that the board should work to bring Teaneck residents together. \"I think we clearly need to do a better job of engaging parents and residents. If you’ve been to a board of education meeting in the last year, you’ll know that the folks that show up are either very angry, or their children are being honored. There is no in between,\" she said. \"We need to do a better job of bringing folks out and meeting people where they’re at.\"\nMuse raised the idea of doing remote polling of parents using a free computer application. \"Maybe then the board could hear more feedback from the community, because people don’t really have the time unfortunately. Perhaps with social media we could engage them more,\" she said. \nRappoport called engagement \"one of the greatest challenges facing not only this school district, but public education at large.\"\nPeople have very busy lives and you do have to meet them where they are,\" she said. An idea discussed at a recent board meeting was traveling to PTOs and PTAs during the budget process to explain to them, \"the choices we’re faced with the budget.\"", "external_links": [], "published": "2015-10-22T03:32:00.000+03:00", "crawled": "2015-10-22T08:26:08.209+03:00", "highlightTitle": ""}