{"organizations": [], "uuid": "6389c6610cfb7cb9bc6bb7ee7b606f35cb4a05cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/56/c36d1e88070e6ef0f3de2191e28855/media:545cc92d0470424ba1248cdd5dec5118FRANCE_CRASH.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/23/the-latest-at-least-40-dead-in-bus-truck-crash-in-france", "country": "US", "title": "The Latest: French PM says crash worst in 30-plus years", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "The Latest: French PM says crash worst in 30-plus years - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "6389c6610cfb7cb9bc6bb7ee7b606f35cb4a05cc"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/23/the-latest-at-least-40-dead-in-bus-truck-crash-in-france", "ord_in_thread": 0, "title": "The Latest: French PM says crash worst in 30-plus years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PARIS (AP) — The latest news about the crash between a bus and a truck in southwest France. All times local:\n1:15 p.m.\nFrench Prime Minister Manuel Valls says a bus and truck collision in southwest wine country that killed 42 was the deadliest road accident in France in more than 30 years.\nValls, speaking to reporters near the crash site in the village of Puisseguin, said eight people survived the accident, including four who were injured and in serious condition.\nFrench media reported that the bus driver was among those who escaped, and the truck driver was killed.\nValls said: \"Forty-two people were killed in atrocious conditions in this bus in flames after this very violent frontal collision.\" He says the passengers were \"elderly people who were going on an excursion for one day. They should have returned home tonight.\"\nHe added: \"It's a terrible shock for the area, for (the region) Aquitaine, for France.\"\n___\n12:55 p.m.\nQuestions are surfacing over the safety of the road where a bus and truck collided Friday, killing 42.\nLegislator Noel Mamere, who represents the Gironde region where the accident occurred, said the collision was on an \"extremely dangerous curve that is considered very accident-prone,\" adding \"that should make us question ourselves about political choices made in terms of infrastructure.\"\nLegislator Gilles Savary said some roads in the region are in need of upkeep. Local officials also mentioned pervious accidents in the area.\nImages of the site show a narrow winding road surrounded by woods.\nLawyers defending road accident victims accused officials of not doing more to ensure road safety.\n___\n10:35 a.m.\nFrench authorities have opened a preliminary investigation into a crash between a bus and truck near Bordeaux that killed at least 42 people.\nThe circumstances of the crash remain unclear, according to Pierre Dartout, the top government official for the Aquitaine region, who announced the investigation to reporters near the crash site.\nBoth vehicles caught fire after the crash Friday morning.\nThe mayor of the town where the collision occurred, Xavier Sublett of Puisseguin, said on i-Tele television that the driver of the bus managed to open the door, allowing eight people to escape.\nHe said helicopters were evacuating severely burned victims.\n___\n10 a.m.\nFrench President Francois Hollande says at least 42 people were killed and several others gravely injured when a bus and truck crashed and caught fire in southwest France.\nHollande's office said in a statement Friday that Prime Minister Manuel Valls and Interior Minister Bernard Cazeneuve are heading to the site of the crash east of Bordeaux.\nCalling it an \"immense tragedy,\" Hollande promised an investigation into what happened. He also expressed \"the solidarity of the whole nation\" with loved ones of the victims.\n___\n9:45 a.m.\nA French legislator says that most of the victims in a crash that killed at least 40 were elderly people from southwest France heading on a day trip.\nGilles Savary, lawmaker from the region, said on BFM television that a bus company from the town of Libourne was leading the group on a tourist trip. The bus collided with a truck near the village of Puisseguin on Friday, and authorities say at least 40 people were killed.\nSavary called it one of the worst crashes in recent years in the region.\n___\n9:15 a.m.\nFrench police say that at least 40 people have been killed in a collision between a bus and truck near the southwestern city of Bordeaux.\nAn official with the national gendarme service said the crash occurred near the town of Puisseguin, and that death toll may have been so unusually high because the bus caught fire.\nThe official said scores of emergency workers in the region have been mobilized to help. The official was not authorized to be publicly named.", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T16:45:00.324+03:00", "highlightTitle": ""}