{"organizations": [], "uuid": "876af5c682f962a37fb3f8c05daebb06bbdc4335", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30302478/new-top-us-general-looks-to-capitalize-on-iraq-successes", "country": "US", "title": "New top US general looks to capitalize on Iraq successes", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New top US general looks to capitalize on Iraq successes - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "876af5c682f962a37fb3f8c05daebb06bbdc4335"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30302478/new-top-us-general-looks-to-capitalize-on-iraq-successes", "ord_in_thread": 0, "title": "New top US general looks to capitalize on Iraq successes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By LOLITA C. BALDOR\nAssociated Press BAGHDAD (AP) - In a bid to capitalize on some recent battle successes in Iraq, Baghdad leaders told a top U.S. general Tuesday that they will move to improve coordination between the country's disparate and sometimes warring factions battling Islamic State militants.\nGen. Joseph Dunford, chairman of the Joint Chiefs of Staff, said Prime Minister Haider al-Abadi and Defense Minister Khaled al-Obeidi agreed to begin talks Wednesday with U.S. leaders on selecting a single commander who can speak for all the groups when trying to coordinate missions with the U.S.-led coalition.\nThe move, he said, will allow the Iraqi security forces, the Kurdish government forces known as the Peshmerga, the Sunni tribes and the popular mobilization troops to work better together.\n\"We need somebody who is empowered by you to make decisions and work with us, so we can provide support across all Iraqi forces,\" Dunford said he told them, adding that a fundamental principle of commanding and controlling forces is \"wherever two or more are gathered, one must be in charge.\"\nDunford traveled to Iraq Tuesday in the last segment of a five-day trip, which also included stops in Israel and Jordan. It was his first trip to the war zone since taking the chairman's job on Oct. 1, and he spent time meeting with military commanders and leaders of the Kurdish government in northern Iraq in the morning, then went to Baghdad.\nSpeaking to reporters traveling with him, Dunford offered a somewhat upbeat assessment of the situation in Iraq. And he said he is asking his top advisers and commanders to come up with recommendations on how the U.S.-led coalition can motivate the Iraqi forces, seize the opportunities presented by the recent successes in Beiji and Ramadi, and pick up the pace of operations.\nHe didn't provide specifics, but said some of it could include additional training, more equipment or improving how the coalition is doing things.\nHe added that the U.S. is trying to get an operations center set up in northern Iraq that would allow the Iraqi security forces and the Peshmerga to coordinate operations better.\nThe U.S.-led coalition began airstrikes in Iraq more than a year ago, after Islamic State insurgents swept across the country, taking over large sections of its west and north. Much of the Iraqi Army collapsed, with troops fleeing or joining the militants.\nSince then, the battle to take back the lost ground has stuttered and stalled.\n\"Three or four weeks ago, there was no movement at all around Ramadi, no movement toward Beiji,\" said Dunford. \"Now we see more movement than we've seen before, movement that I think we can take a look at and say, 'OK, how do we reinforce success now?'\"\nLate last week Iraqi troops backed by Shiite militia fighters drove IS militants out of the Beiji oil refinery, which has been contested for months.\nAccording to U.S. Maj. Mike Filanowski, an intelligence officer with the military's joint task force in Baghdad, Iraq's special operations troops were key to securing the refinery's perimeter and the power plant to the north. They are now slowly moving toward the center of the refinery, clearing enemy fighters.\nMosul and Ramadi, the capital of Iraq's western province of Anbar, are both under IS control, and efforts to retake them have been problem-plagued.\nEarlier this month, however, U.S. officials said Iraqi ground forces advanced to the outer suburbs of Ramadi and said conditions may soon be right to launch an assault to take back the city.\nDunford, however, was also frank about the challenges ahead, and warned that he will not be talking about any specific timelines for the Iraq campaign.\nBetter integrating the Iraq forces will be one challenge, but others include building up the Syrian rebel forces to fight IS, getting additional needed equipment and ammunition to the Kurds in northern Iraq and encouraging the Iraq government to be more inclusive and live up to its commitments to the Sunni tribal fighters.\n\"A year ago, ISIL was making progress unchecked,\" said Dunford, using an acronym for Islamic State. \"So, I'm not trying to put lipstick on a pig here. I'm trying to be honest about where we are. The momentum of ISIL was stopped, they have lost ground.\"\nDunford's stop in Iraq comes after three days of meetings with senior military and government leaders in Israel and Jordan, two key U.S. allies in the region. In both countries, Dunford heard officials' concerns about the Islamic State threat and the roiling instability in the region.\n___\nThis story has been corrected to show the rank of Mike Filanowski is major, not lieutenant colonel.\n ", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T05:51:59.807+03:00", "highlightTitle": ""}