{"organizations": [], "uuid": "f8eab0955de0b30b498ea1ba5d4755ce915724f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/10/National-Politics/Images/GOP_2016_Cruz-03fa3-4117.jpg", "site_section": "http://www.washingtonpost.com/wp-dyn/rss/politics/index.xml", "section_title": "Politics", "url": "https://www.washingtonpost.com/politics/as-rand-paul-stalls-ted-cruz-seeks-to-pick-up-support-among-libertarians/2015/10/10/4523022a-6e9d-11e5-9bfe-e59f5e244f92_story.html", "country": "US", "title": "As Rand Paul stalls, Ted Cruz seeks to pick up support among libertarians", "performance_score": 1, "site": "washingtonpost.com", "participants_count": 1, "title_full": "As Rand Paul stalls, Ted Cruz seeks to pick up support among libertarians", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:52:00.000+03:00", "replies_count": 0, "uuid": "f8eab0955de0b30b498ea1ba5d4755ce915724f5"}, "author": "Katie Zezima", "url": "https://www.washingtonpost.com/politics/as-rand-paul-stalls-ted-cruz-seeks-to-pick-up-support-among-libertarians/2015/10/10/4523022a-6e9d-11e5-9bfe-e59f5e244f92_story.html", "ord_in_thread": 0, "title": "As Rand Paul stalls, Ted Cruz seeks to pick up support among libertarians", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As Rand Paul stalls, Ted Cruz seeks to pick up support among libertarians Resize Text By Katie Zezima October 10 at 9:25 AM Follow @katiezez \nNASHUA, N.H. — Sen. Ted Cruz (R-Tex.) came to a convention of libertarian-leaning Republicans and talked about shrinking government, slashing regulations, fighting against the bulk collection of phone data and his great affinity for a rival in the presidential race. \n“I love Rand Paul,” Cruz said. \nPaul, Kentucky’s junior U.S. senator and scion of one of America’s most famous libertarian families, was fully expected to lock down the support of libertarian voters in the presidential election. But as Paul’s poll numbers have sagged nationally — and in such libertarian-minded places as New Hampshire — Cruz is trying to pick off the so-called liberty vote. \nCruz essentially crashed what was supposed to be Paul’s big libertarian party here, the biannual meeting of the Republican Liberty Caucus. Cruz stood in a hotel here on a dreary Friday morning, surrounded by supporters and curious attendees who held signs and jostled for photos. \n“I was elected with tremendous support from the liberty movement,” Cruz said of his 2012 Senate campaign, noting that Rand and Ron Paul both endorsed him in that race. Sen. Rand Paul (R-Ky.) speaks to the Republican Liberty Caucus Friday in Nashua , N.H. (Jim Cole/AP) \nThe Texas Republican’s presidential campaign has been making the case that as Paul’s effort has floundered, Cruz is viable: flush with cash and able to go the long haul. \nOn the trail, Cruz has evoked the Fourth Amendment and railed against the Federal Reserve. Last month, the campaign rolled out a video showing eight former Ron Paul supporters now backing Cruz. \n“The liberty movement has been integral to our campaign since Day One,” he said. \nCruz breaks down the Republican electorate into four brackets of support: Tea party conservatives, evangelical Christians, establishment Republicans and libertarians. He sees his base in the tea party and evangelical wings, but he is also trying to siphon off libertarian voters with a message of limited government. \nCruz tailored his speech here in New Hampshire to those voters. He took a less hawkish tone when discussing foreign policy, stating that the U.S. “shouldn’t engage in nation-building” and calling for armed Kurdish ground troops to fight the Islamic State. \n“There’s no reason for us to get in the middle of the Syrian civil war,” he said. \nCruz touted the liberty movement as an “amazing thing” and vowed that the size of government will be “materially smaller” if he is elected president. The Texan touted a bill he co-sponsored to end the bulk collection of phone metadata — an issue that Paul championed earlier this year with a nearly 11-hour Senate floor speech. \n“This is the battleground between Cruz and Paul,” said Dave Nalle, a former chairman of the Liberty Caucus. He said Paul appeals to privacy-minded libertarians while Cruz appeals to those who want a strict adherence to the Constitution. \n“I was impressed” with Cruz, said Louis Colavecchio Sr. of Wakefield, R.I., who hasn’t decided who he will vote for in the primary. \nThe scramble for supporters seems to have somewhat strained the cordial relationship between the onetime Senate allies. Last week, Paul said Cruz was “pretty much done for\" in the Senate after Cruz tried to disrupt the passage of a government funding bill because it gave money to Planned Parenthood. \n“Ted has chosen to make this really personal and chosen to call people dishonest in leadership ... which really goes against the decorum and also against the rules of the Senate, and as a consequence he can’t get anything done legislatively,” Paul said on Fox News Radio. Cruz called Paul “a friend” and “good man” Friday. \nPaul gave an animated speech here and appeared to be in his comfort zone, saying he wants a government that leaves him alone. He reminded his audience of his marathon Senate speech to defend that principle. He called for reform of the criminal justice system, and he knocking his rivals for their stated willingness to intervene in other countries. Paul also rapped Congress, labeling a just-passed bill that temporarily funds the government “a bunch of crap” and the body itself “impotent and inconsequential.” \n“I’m embarrassed that I’m even a part of it,” said Paul, sporting a bright blue belt with the University of Kentucky’s logo on it. \nPaul played down the threat from Cruz. \n“Both here and Iowa we know where our support is and where my dad’s support was, and we feel comfortable that the overwhelming majority of it is with us,” Paul said. \nSome libertarians here were uncomfortable with Cruz making religion such a large part of his campaign. \n“I don’t think he’s going to have as much sway on Rand Paul’s electability as people think he will because he’s a religious zealot. It’s too much,” said Austin Sekel, 22, who is supporting Paul. Cruz “needs to stop grandstanding on the Senate floor,” he said. \nSekel and others said they don’t think that Paul’s sagging poll numbers will change anything. He believes Paul has a base of support that hasn’t yet engaged. \nBob Pyle, a pastor from Harrisburg, Pa., believes Paul has a “solid, loyal following that is not given to the sounds of throwing red meat.” Between those people and Ron Paul supporters, Pyle thinks the Kentucky Republican’s fortunes will only increase. \nOther people here aren’t completely enamored with either candidate. Some libertarians have felt that Paul has run his race too far from his father’s pure libertarian principles. They include John Cisar, 36, of Burlington, Vt. \n“I think there’s a big schism among libertarians that he’s fallen short of expectations,” Cisar said of Paul. Cisar said he is not a Cruz fan, and he thinks Paul is the more acceptable candidate in the 2016 race. \n“He’s the lesser of the evils,” Cisar said of Paul. “And that doesn’t make me feel really good inside to vote for him.” Katie Zezima is a national political correspondent covering the 2016 presidential election. She previously served as a White House correspondent for The Post. politics Success! Check your inbox for details. You might also like: Please enter a valid email address Sign Up", "external_links": [], "published": "2015-10-10T16:52:00.000+03:00", "crawled": "2015-10-10T16:59:42.015+03:00", "highlightTitle": ""}