{"organizations": [], "uuid": "fb08aa284f0e221f19cf1110acf9bb1bd7b046f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/FartGuyFarting.png", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151003/lifestyle-offbeat/article/us-man-fired-farting-too-much-office", "country": "US", "title": "US man fired for farting too much in office | Deccan Chronicle", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "US man fired for farting too much in office | Deccan Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T11:33:00.000+03:00", "replies_count": 0, "uuid": "fb08aa284f0e221f19cf1110acf9bb1bd7b046f7"}, "author": "PTI", "url": "http://www.deccanchronicle.com/151003/lifestyle-offbeat/article/us-man-fired-farting-too-much-office", "ord_in_thread": 0, "title": "US man fired for farting too much in office | Deccan Chronicle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PTI | October 03, 2015, 19.19 pm Representative image only New York: A 70-year-old man in the US state of Pennsylvania was fired by a pork company for farting too much at work, according to a media report.\nRichard Clem, a former comptroller for Case Pork Roll Company based in Trenton New Jersey, was given the pink slip as he couldn't help his flatulence after undergoing a gastric bypass surgery in 2010 and his symptoms of \"extreme gas and uncontrollable diarrhoea\" worsened in 2013.\n\"I think it's disgusting. This is all very embarrassing. The fact is that I was a loyal and trusted employee for 10 years,\" Clem said.\n\"It was very dangerous. More than once, I'm arriving for work and I'm up the steps and into the bathroom right away. You don't hold it in. You don't do it. You're not going to make it. I always kept a change of clothes at work just in case,\" Clem was Quote: d as saying by the Daily News.\nThe 190-kilogramme man, who suffered from obesity and had the operation to save his life, was forced to work from home at least once before being fired in February last year.\nHis wife Louann, who worked part-time as his administrative assistant, quit the same day because of the \"harassment and discrimination her husband faced,\" she said in a lawsuit filed against the company last month.\nHis gas \"constantly\" prompted complaints from his boss. The man's flatulence was masking the scent of the pork company's popular hickory-smoked ham, according to the suit. \"We have to do something about Rich. This can't go on.\nWe cannot run an office and have visitors with the odour in the office. Tell Rich that we are getting complaints from visitors who have problems with the odours,\" said Thomas Dolan, the company president, according to the lawsuit.\nClem said he only shared an office space with his wife and didn't have to interact with visitors. \"We just opened a window if we wanted to. We used to burn candles all the time,\" he said.\nClem said he had dropped down to 136 kilogrammes and controls his gas through medication, but now fears all the attention will keep him from finding another job.\n\"I feel better, but there goes my reputation. Who wants to hire a fart boy?\" Clem said.\n lifestyle offbeat Pennsylvania US Also Read Fighting the big C Hondurans get in the spirit with World record human christmas tree Watch: Introducing 'Jatinder', the dating app for Indians Why funk music makes people want to dance", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://twitter.com/share?url=http://deccan-lb-1621008713.ap-southeast-1.elb.amazonaws.com/151003/lifestyle-offbeat/article/us-man-fired-farting-too-much-office", "http://dd508hmafkqws.cloudfront.net/sites/default/files/FartGuyFarting.png", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/FartGuyFarting.png", "http://deccan-lb-1621008713.ap-southeast-1.elb.amazonaws.com/151003/lifestyle-offbeat/article/us-man-fired-farting-too-much-office", "http://www.facebook.com/sharer.php", "http://vuukle.com/js/vuukle.js"], "published": "2015-10-04T11:33:00.000+03:00", "crawled": "2015-10-04T01:08:02.817+03:00", "highlightTitle": ""}