{"organizations": [], "uuid": "20e13c656d1d300dfacb8e346cd3f5ab363b8d38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-6ca1d2315ab6c783791a8485b40b8baf.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/dems-to-gop-we-wont-help-with-speaker-vote/article/2573709?custom_click=rss", "country": "US", "title": "Dems to GOP: We won't help with speaker vote", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Dems to GOP: We won't help with speaker vote | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T17:46:00.000+03:00", "replies_count": 0, "uuid": "20e13c656d1d300dfacb8e346cd3f5ab363b8d38"}, "author": "Susan Ferrechio", "url": "http://www.washingtonexaminer.com/dems-to-gop-we-wont-help-with-speaker-vote/article/2573709?custom_click=rss", "ord_in_thread": 0, "title": "Dems to GOP: We won't help with speaker vote", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House Democrats signaled on Thursday that they won't offer any help to Republicans when it comes to scrounging up votes for the next House speaker.\nThe idea has been floated by some moderate House Republicans that the best way forward is to find a middle-of-the-road candidate who can get some Democratic support, after Majority Leader Kevin McCarthy dropped out of the race. But a spokesman for Minority Leader Nancy Pelosi, D-Calif, said that's not likely to happen.\n\"It's up to House Republicans to choose the next Speaker,\" Pelosi's Deputy Chief of Staff Drew Hammill told the Washington Examiner .\nHouse Republicans have also signaled that they don't think much of the idea.\n  Dubya's big role pushing brother Jeb for president George W. Bush has been most effective for Jeb raising money from wealthy Jewish Republicans.\nBy David M. Drucker • 10/09/15 12:01 AM But in the aftermath of McCarthy's abrupt decision not to run for speaker, it was discussed as a possible way to get around the problem that conservative Republicans are causing for the GOP. Rep. Charlie Dent, R-Pa., a party moderate, says that may be the only formula to circumvent that faction.\n\"You marginalize them,\" Dent told the Washington Examiner . Dent pointed to bills the House has recently passed with both Republican and Democratic support, including key spending bills and an education reform bill.\n\"We need a bipartisan coalition to pass legislation right now,\" Dent said. \"We may need a bipartisan coalition to elect the next speaker. That's the reality.\"\nConservatives make up a faction large enough to block a speaker from being elected, which requires 218 votes on the House floor. Dent said McCarthy's withdrawal shows that conservatives are willing to shoot down anyone they don't like.\n\"I've said that a group of members who wanted to take down John Boehner is likely going to frag the next guy,\" Dent said. \"That's what just happened.\"\nAlso from the Washington Examiner Obama rapped for not answering Russia's moves Defense Secretary Ash Carter called Russian behavior \"unprofessional.\"\nBy Charles Hoskinson • 10/09/15 1:00 AM Dent said Republicans must \"accept the reality\" that conservatives will not vote for a candidate who is not of their political ilk and \"stop appeasing those who simply can't get the votes.\"\nThe House Freedom Caucus, one of the most conservative factions, is backing the relatively obscure Rep. Daniel Webster, R-Fla., who at this point is unlikely to win the 218 votes needed to win the speaker's gavel.\nTop Story Rock bottom? No, things could get worse for House Republicans \"There   strategist.\nBy Byron York • 10/08/15 7:02 PM", "external_links": [], "published": "2015-10-08T17:46:00.000+03:00", "crawled": "2015-10-09T14:38:57.387+03:00", "highlightTitle": ""}