{"organizations": [], "uuid": "5b716a01573acfc509a33ed25cb56d1b7a6d236b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30214382/apgmi-retain-london-legal-firm-and-commence-action-against-ex-directors", "country": "US", "title": "APGMI Retain London Legal Firm and Commence Action Against Ex-directors", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "APGMI Retain London Legal Firm and Commence Action Against Ex-directors - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5b716a01573acfc509a33ed25cb56d1b7a6d236b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30214382/apgmi-retain-london-legal-firm-and-commence-action-against-ex-directors", "ord_in_thread": 0, "title": "APGMI Retain London Legal Firm and Commence Action Against Ex-directors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " EdenCancan\nLONDON , October 8, 2015 /PRNewswire/ --\nAsia Pacific Gold Mining Investment Ltd (APGMI) is today announcing that legal action has been initiated against a number of ex-directors of the company. This action is being undertaken via the UK courts.\nMichael Cunningham and also David Mapley were dismissed from the company on 20 th February 2015 at an EGM held in St John, Canada . The board of APGMI has engaged a respected legal firm with specialist commercial law expertise, to commence proceedings against the pair.\nThe claim that has been submitted specifically states that Mr Cunningham and Mr Mapley mishandled or were negligent in their negotiation of an important contract with an Ethiopian mining company, and have subsequently refused to provide necessary paperwork as legally required.\nWithin the claim Mr Cunningham and Mr Mapley, in their capacity of directors, are accused of numerous items including; unreasonable expending money of the company excessively in respect of a mining project in Ethiopia , failing to carry out any or adequate due diligence and failing to act on information to the effect that the project had serious problems, failing to protect the investment by ensuring that the money was properly and securely invested or ring-fenced and diverting to themselves a corporate opportunity by acquiring for themselves a share in the mining project at a small fraction of the price paid by APMGI for its equivalent share.\nSenior Legal Partner Richard Spector said:\n\" We feel this is a strong case and are intending to seek considerable damages from these individuals . \"\nAn APGMI spokesperson said:\n\" I would like to reassure our shareholders that we are taking every effective legal route open to us. \"\nNotes to announcement:\nAPGMI is incorporated in New Brunswick, Canada , the new board is working with the company secretary to ensure strict compliance with the province's Company law Asia Pacific Gold Mining Investment Ltd (Asia Pacific GMI Ltd) was formed to pursue business opportunities relating to gold and other valuable mineral resources. The company was pursuing opportunities in Africa . APGMI does not use nor has ever used social media and its official website is http://www.asiapacificgmi.com . Any social media or other sites are not endorsed and may represent breaches of copyright.\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510082198&Transmission_Id=201510080729PR_NEWS_USPR_____enUK201510082198&DateId=20151008", "http://www.xmlnews.org/ns/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T20:56:52.352+03:00", "highlightTitle": ""}