{"organizations": [], "uuid": "404ea12a3d15d634da0c61464a39602a0bf2811e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "yallpolitics.com", "main_image": "", "site_section": "http://www.yallpolitics.com/index.php/yp/atom", "section_title": "Yall Politics", "url": "http://yallpolitics.com/index.php/yp/post/illuminating_article_in_edweek_about_lawsuits_dominating_k-12_funding/", "country": "US", "title": "Illuminating article in EDWEEK about lawsuits dominating K-12 funding nationally", "performance_score": 0, "site": "yallpolitics.com", "participants_count": 1, "title_full": "Illuminating article in EDWEEK about lawsuits dominating K-12 funding nationally", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T21:51:00.000+03:00", "replies_count": 0, "uuid": "404ea12a3d15d634da0c61464a39602a0bf2811e"}, "author": "Staff of Y'all Politics", "url": "http://yallpolitics.com/index.php/yp/post/illuminating_article_in_edweek_about_lawsuits_dominating_k-12_funding/", "ord_in_thread": 0, "title": "Illuminating article in EDWEEK about lawsuits dominating K-12 funding nationally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "K-12 Funding Fights Roil States' Back-to-School Landscape In Texas, meanwhile, a long-running court battle over K-12 spending is relatively close to a conclusion. The state supreme court heard oral arguments earlier this month in Texas Taxpayer and Student Fairness Coalition v. Williams, in which a coalition of districts along with other groups, have argued that lawmakers' $5.4 billion in state funding cuts in 2011 were unconstitutional. Last year, state District Court Judge John Dietz sided with the plaintiff districts in his ruling, which the state appealed. In an exhibit submitted as part of the case, the Fort Bend Independent district stated that inflation-adjusted, per-student spending in Texas fell by $312 from 2003-04 to 2014-15, even as the percentage of economically disadvantaged students rose from 53 percent to 60 percent. But in a brief filed last month, state Commissioner of Education Michael Williams and other plaintiffs argued that the 2011 funding cuts were merely a \"snapshot\" that has been superseded by subsequent events, such as lawmakers' approval of a $1.5 billion increase to the state's basic education allotment for the 2016-17 biennial budget. They added, \"But the exposure for that photo has been very long, and the interim movement within the system has left a blurry image for the court to assess.\" Living on a Budget In contrast to the special sessions in Washington state that produced gains for school aid, Alabama state spending on schools took a hit as lawmakers approach the start of a new fiscal year. In order to fill a budget deficit, lawmakers agreed earlier this month to transfer tax revenue projected to yield $80 million in fiscal 2016 from the state's Education Trust Fund, a K-12 budget that is separate from the general fund. (The fiscal year in Alabama begins Oct. 1.) In previous budget negotiations, lawmakers had considered K-12 cuts as large as $250 million for fiscal 2016. A different battle over K-12 funding will take place in Mississippi at the ballot box this fall. Initiative 42, backed by those who want significant increases on K-12 spending, would require the state to provide an \"adequate and efficient\" system of public schools, and would specifically give the state's chancery courts oversight of the legislature regarding this requirement. Republican lawmakers have vigorously objected, arguing that the courts do not have this power under the state constitution, and subsequently succeeded in placing Alternative 42 on the ballot. That alternative would give the legislature the power to oversee an \"effective\" system of schools. The sponsors of the original initiative have objected, arguing that the legislators are merely seeking to confuse voters through their alternative measure. However, earlier this month, Initiative 42 backers did drop a legal challenge in which they sought to have the ballot language for their measure expanded. Education Week Posted October 1, 2015 - 12:47 pm YallPolitics.Com now uses Facebook for comments. Log into Facebook to comment here.", "external_links": [], "published": "2015-10-01T21:51:00.000+03:00", "crawled": "2015-10-03T04:12:11.618+03:00", "highlightTitle": ""}