{"organizations": [], "uuid": "1551fe981151d9582a38f3284e4e3fede8df9dec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30189639/red-cross-opens-35-shelters-to-help-flooding-victims-in-north-and-south-carolina", "country": "US", "title": "Red Cross Opens 35 Shelters to Help Flooding Victims in North and South Carolina", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Red Cross Opens 35 Shelters to Help Flooding Victims in North and South Carolina - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "1551fe981151d9582a38f3284e4e3fede8df9dec"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30189639/red-cross-opens-35-shelters-to-help-flooding-victims-in-north-and-south-carolina", "ord_in_thread": 0, "title": "Red Cross Opens 35 Shelters to Help Flooding Victims in North and South Carolina", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " American Red Cross\nUrges People to Remain Vigilant as More Flooding Threatens\nWASHINGTON , Oct. 5, 2015 /PRNewswire-USNewswire/ -- In response to the historic and unprecedented flooding in the southeastern United States , the American Red Cross is providing safe shelter and support across the Carolinas where the flooding has destroyed homes, forced evacuations and left thousands without water or power.\nOver the weekend, Red Cross workers opened 35 shelters in North and South Carolina – 30 in South Carolina alone – where more than 200 people spent Sunday night. The Red Cross has mobilized nearly 400 Red Cross workers, 22 emergency response vehicles and shelter supplies to support 5,000 people in South Carolina . Additional rain and flooding are expected over the next few days, and the Red Cross has more supplies and disaster workers standing ready if needed. For the latest news updates, you can follow @RedCrossSC on Twitter.\n\"Anyone who needs a warm, safe place to stay and a hot meal is welcome at any of our shelters,\" said Louise Welch Williams , chief executive officer, Red Cross of the Palmetto South Carolina Region. \"We have additional shelters across the state on standby and are working closely with our government partners to ensure people's immediate needs are being met.\"\nDOWNLOAD EMERGENCY APP People should download the free Red Cross Emergency App to get emergency alerts, find out where shelters are and have flooding safety information immediately available. The Emergency App can be foundin smartphone app stores by searching for the American Red Cross or going to redcross.org/apps. Parents can also download the Red Cross Monster Guard App to teach children what to do in case of a flood or other disaster.\nHOW TO HELP \"People from across the country are looking to the Red Cross for help, and our volunteers are on the frontlines providing shelter, food, comfort and hope,\" said Brad Kieserman , vice president of disaster operations and logistics for the Red Cross. \"We depend on generous financial donations to provide assistance, and we need your help now.\"\nPeople can help by donating to Red Cross Disaster Relief by visiting redcross.org , calling 1-800-RED CROSS or texting the word REDCROSS to 90999 to make a $10 donation to support disasters big and small. Contributions may also be sent to your local Red Cross chapter or to the American Red Cross, P.O. Box 26902, Lehigh Valley, PA 18002-6902.\nGIVE BLOOD NOW The severe flooding has forced the cancellation of about 30 Red Cross blood drives in North Carolina , South Carolina and Virginia through Monday, causing about 650 blood and platelet donations to go uncollected. As flooded roadways and power outages continue, additional blood drives may be cancelled in the coming days.\nThe Red Cross moved blood products into the region to ensure blood would be available in the event of widespread flooding. In South Carolina, there some challenges transporting blood to hospitals with hundreds of road closures across the state. The Red Cross' priority is to deliver emergency products and transport routine requests as conditions allow.\nAll eligible donors in parts of the country unaffected by flooding are encouraged to call 1-800-RED CROSS (1-800-733-2767) or visit redcrossblood.org to schedule an appointment to give blood.\nRESPONDING FROM ALASKA TO FLORIDA The Red Cross is providing help to people from Alaska to Florida affected by other disasters. In Florida , more than a dozen Red Cross volunteers are providing emotional support and other assistance for the families of the seamen aboard the cargo ship El Faro which sank during Hurricane Joaquin last week.\nIn Alaska , Red Cross volunteers are providing shelter in Fairbanks and North Pole after a blizzard left thousands of people without power. In Oregon , volunteers are providing mental health support to residents and assistance at community events after last week's tragic school shooting.\nIn California , Red Cross volunteers and partner organizations continue to provide shelter, food and supplies to residents struggling to recover after last month's wildfires. Red Cross caseworkers are meeting with people to help plan their recovery and providing support to people who need help.\nCORPORATIONS HELP RED CROSS STAY READY The generous donations from the members of our Annual Disaster Giving Program (ADGP) and Disaster Responder Program enable the Red Cross to prepare communities for disasters big and small, respond whenever and wherever disasters occur and help families during the recovery process.\nADGP $1 Million members are: American Airlines; Anthem Foundation; Boise Paper; Caterpillar Foundation; Costco Wholesale; Disney; Enterprise Rent-A-Car Foundation; FedEx Corporation; The Home Depot; Humble Bundle; LDS Charities; Lowe's Companies, Inc.; Mazda North American Operations; Merck & Co., Inc.; Nationwide Foundation; State Farm; Target; UPS; VSP? Vision care for life; and Walmart.\nADGP $500,000 members are: 3M; Altria Group; American Express; Anheuser-Busch Foundation; Aon; Bank of America; BNY Mellon; Capital One; Cisco Foundation; Citi Foundation; ConAgra Foods Foundation; Darden Restaurants Foundation; Delta Air Lines; Discover; Dr Pepper Snapple Group; Edison International; Ford Motor Company; Grainger; John Deere Foundation; Johnson Controls; Kraft Foods Group Foundation; Medtronic; Meijer; Mondelez International Foundation; National Grid; PepsiCo Foundation; Prudential Foundation; San Manuel Band of Mission Indians; Southwest Airlines; Sprint; Sunoco; The TJX Companies, Inc.; United Airlines ; United Technologies Corporation; Visa; Wawa ; and Wells Fargo.\nDisaster Responder Program members are: 1-800-BOARDUP; Alcoa; Astellas USA Foundation; AstraZeneca; AT&T; AvalonBay Communities, Inc.; AXA; Ball Foundation; BHP Billiton; The Clorox Company; Entergy Corporation; Farmers Insurance; General Motors Foundation; H&M; Hewlett-Packard Company Foundation; Hi-Rez Studios; IBM Corporation; IKEA; Ingersoll Rand Foundation; Interstate All Battery Center; Land O'Lakes , Inc.; Marsh & McLennan Companies; MetLife Foundation; Morgan Stanley; Neiman Marcus ; New Balance Foundation; Northrop Grumman Corporation; Northwestern Mutual and the Northwestern Mutual Foundation; Procter & Gamble Company; PSEG Foundation; PuroClean Disaster Recovery; Residence Inn by Marriott; Ryder; San Diego Gas & Electric (SDG&E); Southeastern Grocers Home of BI-LO Harveys Winn Dixie; Starwood Hotels & Resorts Worldwide Foundation, Inc.; State Street Foundation; Swiss Re Foundation; T O Y O T A; U.S. Bank; and U-Haul International.\nAbout the American Red Cross:\nThe American Red Cross shelters, feeds and provides emotional support to victims of disasters; supplies about 40 percent of the nation's blood; teaches skills that save lives; provides international humanitarian aid; and supports military members and their families. The Red Cross is a not-for-profit organization that depends on volunteers and the generosity of the American public to perform its mission. For more information, please visit redcross.org or visit us on Twitter at @RedCross .\nLogo - http://photos.prnewswire.com/prnh/20090108/RedCrossLOGO\n releases/red-cross-opens-35-shelters-to-help-flooding-victims-in-north-and-south-carolina-300154256.html\n ", "external_links": ["http://www.redcross.org/monsterguard", "http://twitter.com/redcross", "http://www.redcross.org/", "http://www.xmlnews.org/ns/", "http://www.redcross.org/prepare/mobile-apps", "http://www.redcrossblood.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC20163&Transmission_Id=201510051436PR_NEWS_USPR_____DC20163&DateId=20151005", "https://twitter.com/RedCrossSC", "http://www.redcross.org/supporters/corporate-foundations/annual-disaster-giving-program", "http://www.redcross.org/mobile-apps/emergency-app", "http://photos.prnewswire.com/prnh/20090108/RedCrossLOGO", "http://www.prnewswire.com/news-releases/red-cross-opens-35-shelters-to-help-flooding-victims-in-north-and-south-carolina-300154256.html", "https://www.redcross.org/donate/disaster-relief", "http://photos.prnewswire.com/prnvar/20090108/RedCrossLOGO"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T03:53:39.118+03:00", "highlightTitle": ""}