{"organizations": ["Foundry United Methodist Church", "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> GOP", "Dartmouth College", "U.S. House of Representatives", "Wellesley College", "Judiciary Committee", "state", "Southern New Hampshire University in Manchester", "House of Representatives", "CNN", "House Ethics Committee", "Senate", "House Select Committee", "GOP", "Clintons", "House", "New York Republican", "Osama bin Laden", "NATO", "U.N.", "George Washington University", "Congress", "Victoria Mxenge Housing Project", "Unity Rally in Unity", "Senate Education and Labor Committee", "Kentucky Republican", "Association of Southeast Asian Nations", "Republican Policy Committee", "Benghazi", "FBI", "Social Security and Medicare", "Senate Foreign Relations Committee", "White House", "Republican Study Committee", "Rodino Committee", "Congressional", "State Department", "CBS"], "uuid": "da11eacd3690b97b0d4a936c4e4a26448e0ae309", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150927151944-john-boehner-kevin-mccarthy-february-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/18/politics/republicans-congress-infighting/index.html?eref=rss_politics", "country": "US", "title": "GOP infighting dominates Capitol Hill on crucial week", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "GOP infighting dominates Capitol Hill on crucial week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T01:22:00.000+03:00", "replies_count": 0, "uuid": "da11eacd3690b97b0d4a936c4e4a26448e0ae309"}, "author": "", "url": "http://edition.cnn.com/2015/10/18/politics/republicans-congress-infighting/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "GOP infighting dominates Capitol Hill on crucial week", "locations": ["Portugal", "Rhinebeck", "Portsmouth", "Philippi", "Cape Town", "Wellesley", "Capitol Hill", "Afghanistan", "Dhaka", "Florida", "Hopkinton", "California", "New Hampshire", "R-Indiana", "Massachusetts", "Cambridge", "Bangladesh", "Ohio", "Myanmar", "Libya", "Texas", "New York City", "Queens", "Benghazi", "Cairo", "New York", "Kansas", "U.S.", "Arkansas", "Manchester", "United States", "Tahrir Square", "Kabul", "Chicago", "North Korea", "Israel", "Colombia", "Iowa", "Vietnam", "R-Kentucky", "South Africa", "Wisconsin", "Cafe Havana", "Hanoi", "Washington", "Ben Gurion International Airport", "Roosevelt Island", "Malta", "Sunnyside", "Hanover", "America", "Lisbon", "Janesville", "Denver", "Cartagena", "Alaska", "Georgia", "Contoocook", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hillary Rodham Clinton", "Boehner", "McConnell", "Mike Pompeo", "Bill Clinton", "Andrew Cuomo", "Messer", "John", "Gowdy", "John Kerry", "Mitch McConnell", "Lynn Westmoreland", "David Jolly", "Pelosi", "Ronald Reagan", "Hanna", "Aung San Suu Kyi", "Hamid Karzai", "Paul", "O'Neill", "Mike Gravel", "Joe Biden", "Tip O'Neill", "Webster", "Pompeo", "Eliot Spitzer", "Daniel Webster", "Hillary Rodham", "Al Gore", "Felipe Bravo", "Nancy Pelosi", "Obama", "Kevin McCarthy", "Clinton", "Catherine", "Ryan", "Hillary", "Luke Messer", "William", "Jim Wright", "Bill Flores", "Barack Obama", "Monica Lewinsky", "Charles Schumer", "Lewinsky", "Dorothy Rodham", "Marc Mezvinsky", "Rosalynn Carter", "Hillary Clinton", "Chelsea", "Hastert", "John Doar", "George Nethercutt", "Suu Kyi", "Rand Paul", "Westmoreland", "Paul Ryan", "Newt Gingrich", "Tom Foley", "Jolly", "Don Hewitt", "Richard Nixon", "Hugh Rodham", "Richard Hanna", "Tipper Gore", "Dennis Hastert", "Bill", "Gingrich", "Foley", "Dennis Kucinich", "Tyler", "Harry Reid", "Christian Caraballo", "John Boehner", "Ahmet Davutoglu"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> GOP infighting dominates Capitol Hill on crucial week Updated 2313 GMT (0613 HKT) October 18, 2015 JUST WATCHED Congress must address leadership turmoil and debt ceiling when they return to Washington Hillary Clinton will also testify at a highly-anticipated Benghazi hearing Washington (CNN) When Republicans left Capitol Hill right before Columbus Day, they hoped a little break would help cool tensions ripping their party apart and threatening their governing majority. So much for that. After a week-long recess, Republicans returning to Washington on Monday are growing anxious as Rep. Paul Ryan is putting off a decision on whether to run for House speaker. Meanwhile, leading Republicans are downright furious at Rep. Richard Hanna's comments suggesting the Benghazi committee was aimed at hurting Hillary Clinton, who testifies on Thursday. And fiscal talks between congressional Republicans and the White House have yielded little progress so far, meaning that House and Senate leaders are likely to move a debt ceiling increase separately from a large fiscal package -- and prompt a revolt from their party's right wing. Read More 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power The current Speaker of the U.S. House of Representatives is John Boehner, a Republican from Ohio. He gained his power from his predecessor, former Speaker Nancy Pelosi, when the GOP gained the majority of seats in the House in the 2010 midterm elections. Boehner remains in his leadership role after keeping the majority of the House in the 2014 midterms. Click through for other recent speakers: Hide Caption 1 of 7 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power U.S. Rep. Nancy Pelosi was the first and only female speaker of the House. Her speakership lasted from January 4, 2007, to January 3, 2011. Pelosi, a Democrat, lost her seat to the Republican majority in the 2010 midterms. John Boehner took the gavel. Hide Caption 2 of 7 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power Dennis Hastert remains the longest serving Republican speaker in history, from January 6, 1999, to January 3, 2007. However, the GOP lost its majority in the House of Representatives, leaving Democrat Nancy Pelosi to become speaker. On Thursday, May 28, Hastert was accused in an indictment of lying to the FBI and evading currency reporting requirements as he sought to pay off a subject to \"cover up past misconduct.\" On Thursday, October 15, the U.S. Attorney's office in Chicago said Hastert plans to plead guilty in the case. Hide Caption 3 of 7 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power Newt Gingrich broke the four-decade long line of Democratic speakers by becoming speaker from 1995 to 1999 and was named Man of the Year by Time magazine for the accomplishment. He then fell from grace after a disappointing 1998 midterm election for the GOP, prompting him to step down from both the speakership and Congress. Gingrich's resignations came as a complete surprise to many, as the speaker had been fighting to keep his top job until the announcement. Hide Caption 4 of 7 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power Tom Foley, a Democrat who represented Washington state in the House for 30 years, took over the office of the Speaker after the resignation of Jim Wright. Foley served as speaker from 1989 to January 1995 but was defeated in the 1994 re-election campaign to George Nethercutt. Hide Caption 5 of 7 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power Jim Wright of Texas served two years as speaker, after Massachusetts Democrat Tip O'Neill retired. But he stepped down in 1989 after facing a House Ethics Committee investigation on improprieties with the sale of his book and fees from speaking engagements. He was the first speaker to resign in the face of a scandal. He died recently on May 6, 2015, at 92. Hide Caption 6 of 7 7 photos: The hand-off: How Speakers Boehner to O'Neill came to power A Massachusetts Democrat who served as speaker from 1977 until retirement in 1987, Tip O'Neill was well-known for his deal-making as well as his collegiality with former President Ronald Reagan. Former Speaker Nancy Pelosi thought to commemorate the 34-year congressional career of O'Neill with an office building on the edge of Capitol Hill that bears his name. O'Neill was the longest continuously serving House speaker of any party in U.S. history. Hide Caption 7 of 7 The toxic mix comes at a dangerous time for Republicans. They are trying to showcase that their party can present a vision for governing and a clear message ahead of 2016. But major fiscal calamities, including the prospects of the first-ever U.S. debt default and the second government shutdown in as many years, could send Washington -- and their party -- reeling. Sen. Rand Paul, R-Kentucky, a contender for the presidential nomination, said in an interview with CNN that now is the time to dig in and battle the president on issues like government spending and default -- and show conservative voters that the party is willing to fight for its principles, even if it means a potential shutdown. \"I've been arguing for more exertion of the power of the purse,\" Paul said. \"I think the only way to do that -- to exactly use your leverage -- is to let all the spending expire.\" READ: Gowdy to fellow Republicans not on Benghazi panel: Shut up But the disarray in the GOP -- particularly the leadership vacuum in the House -- has spawned fears among some that Republicans must get their house in order before the problems become much more widespread heading into 2016. \"It's true that nobody in America is inspired by all this drama and palace intrigue,\" Rep. Luke Messer, R-Indiana, said. \"It's also true that we better get ourselves together so that this doesn't happen multiple times over the next year and half.\" GOP leadership turmoil As Congress reconvenes this week, all eyes will be on Ryan, especially Wednesday when the GOP holds two closed-door conference meetings to discuss the party's future. To alleviate pressures on the next speaker, Republicans are hoping to placate the party's right wing by giving more power to the rank-and-file, including by putting more Republicans elected since the 2010 elections at the leadership table -- a proposal championed by Messer. Last week, Ryan, the party's 2012 vice presidential nominee, stayed out of the spotlight in Janesville, Wisconsin -- and told friends and allies he's still skeptical of taking the job, though he hasn't shut the door quite yet. If he doesn't get into the race, upwards of a dozen candidates could jump in, ranging from the conservative head of the Republican Study Committee, Rep. Bill Flores of Texas, Rep. Daniel Webster of Florida, Rep. Mike Pompeo of Kansas and Georgia Rep. Lynn Westmoreland, who told CNN Friday that he was prepared to make a run for speaker. The longer Ryan waits, the less patience Republicans are bound to have. \"Frankly, I think waiting doesn't make it easier,\" said Messer, chairman of the Republican Policy Committee. \"The longer we wait, the harder it is to commit.\" If Ryan doesn't get in, it could take \"several weeks\" for the conference to back a candidate who can get 218 votes on the House floor to get elected speaker, according to Rep. David Jolly, R-Florida, who backs Webster's bid. \"If we just elect another speaker who is going to decide not to tackle hard issues for the sake of politics, we'll probably lose the White House next year,\" Jolly said. Benghazi comments Just as Republicans are grappling with their leadership problems, Hillary Clinton is set to testify before the House Select Committee on Benghazi on Thursday. It's a huge moment for the GOP-led Congress and Clinton -- with the potential to reshape the committee's investigation and the presidential race. 50 photos: Hillary Clinton's career in the spotlight 50 photos: Hillary Clinton's career in the spotlight Former Secretary of State Hillary Clinton, pictured here on Tuesday, March 3, has become one of the most powerful people in Washington. Here's a look at her life and career through the years. Hide Caption 1 of 50 50 photos: Hillary Clinton's career in the spotlight Before she married Bill Clinton, she was Hillary Rodham. Here, Rodham talks about student protests in 1969, which she supported in her commencement speech at Wellesley College in Wellesley, Massachusetts. Hide Caption 2 of 50 50 photos: Hillary Clinton's career in the spotlight Rodham, center, a lawyer for the Rodino Committee, and John Doar, left, chief counsel for the committee, bring impeachment charges against President Richard Nixon in the Judiciary Committee hearing room at the U.S. Capitol in 1974. Hide Caption 3 of 50 50 photos: Hillary Clinton's career in the spotlight Arkansas Gov. Bill Clinton helps first lady Rosalynn Carter on a campaign swing through Arkansas in June 1979. Also seen in the photo is Hillary Clinton, center background. Hide Caption 4 of 50 50 photos: Hillary Clinton's career in the spotlight Bill Clinton embraces his wife shortly after a stage light fell near her on January 26, 1992. They talk to Don Hewitt, producer of the CBS show \"60 Minutes.\" Hide Caption 5 of 50 50 photos: Hillary Clinton's career in the spotlight With Hillary, Democratic presidential candidate Bill Clinton waves to the crowd at his victory party after winning the Illinois primary on March 17, 1992. Hide Caption 6 of 50 50 photos: Hillary Clinton's career in the spotlight Al Gore, Tipper Gore, Bill Clinton and Hillary Clinton wave to supporters at the Chautauqua Institution in Chautauqua, New York, after they gave speeches on family values on August 23, 1992. Hide Caption 7 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton gestures at a campaign rally November 3, 1992, in Denver. After taking office, President Clinton chose his wife to head a special commission on health care reform, the most significant public policy initiative of his first year in office. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Bill and Hillary Clinton have a laugh together on Capitol Hill in 1993. Hide Caption 9 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton pours herself a cup of tea in 1993 while testifying to the Senate Education and Labor Committee about health care reform. Hide Caption 10 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks at George Washington University on September 10, 1993, in Washington during her husband's first term. Hide Caption 11 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton waves to the media on January 26, 1996, as she arrives at federal court in Washington for an appearance before a grand jury. The first lady was subpoenaed to testify as a witness in the investigation of the Whitewater land deal in Arkansas. Hide Caption 12 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary Clinton looks on as President Clinton discusses the Monica Lewinsky scandal in the Roosevelt Room of the White House on January 26, 1998. Hide Caption 13 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary and Bill Clinton arrive at Foundry United Methodist Church on August 16, 1998, in Washington. He became the first sitting president to testify before a grand jury when he testified via satellite about the Lewinsky matter. Hide Caption 14 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton shakes hands during a St. Patrick's Day parade in the Sunnyside neighborhood of Queens, New York, on March 5, 2000. Hide Caption 15 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton waves to the crowd as she arrives on the stage at the Democratic National Convention on August 14, 2000, in Los Angeles. Hide Caption 16 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton campaigns for a Senate seat October 25, 2000, at Grand Central Station in New York. Hide Caption 17 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary Clinton is sworn in as a senator of New York in a re-enactment ceremony with, from left, President Clinton, nephew Tyler, daughter Chelsea, brother Hugh Rodham, mother Dorothy Rodham and Vice President Al Gore on January 3, 2001, in Washington. Hide Caption 18 of 50 50 photos: Hillary Clinton's career in the spotlight Andrew Cuomo, Eliot Spitzer and Clinton celebrate with a crowd of Democratic supporters after their wins in various races November 7, 2006, in New York. Hide Caption 19 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks during a post-primary rally on January 8, 2007, at Southern New Hampshire University in Manchester, New Hampshire. Hide Caption 20 of 50 50 photos: Hillary Clinton's career in the spotlight The Clintons pay a visit to the 92nd annual Hopkinton State Fair in Contoocook, New Hampshire, on September 2, 2007. Hide Caption 21 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks at a campaign rally September 2, 2007, in Portsmouth, New Hampshire. She was running for the Democratic presidential nomination. Hide Caption 22 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton addresses a question during a debate with other Democratic presidential candidate at Dartmouth College in Hanover, New Hampshire, on September 26, 2007. Also pictured are U.S. Rep. Dennis Kucinich of Ohio, left, and former U.S. Sen. Mike Gravel of Alaska. Hide Caption 23 of 50 50 photos: Hillary Clinton's career in the spotlight Felipe Bravo, left, and Christian Caraballo are covered with Hillary Clinton stickers in downtown Manchester, New Hampshire, on January 8, 2008. Hide Caption 24 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton campaigns in Council Bluffs, Iowa, with her daughter, Chelsea, on January 1, 2008, two days ahead of the January 3 state caucus. Hide Caption 25 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton waves as she speaks to supporters at the National Building Museum on June 7, 2008, in Washington. After pulling out of the presidential race, Clinton thanked her supporters and urged them to back Barack Obama to be the next president of the United States. Hide Caption 26 of 50 50 photos: Hillary Clinton's career in the spotlight Obama and Clinton talk on the plane on their way to a Unity Rally in Unity, New Hampshire, on June 27, 2008. Hide Caption 27 of 50 50 photos: Hillary Clinton's career in the spotlight Obama watches Clinton address the Democratic National Convention on August 26, 2008. The two endured a long, heated contest for the 2008 nomination. Hide Caption 28 of 50 50 photos: Hillary Clinton's career in the spotlight Sen. Charles Schumer, left, looks toward Secretary of State designate Clinton as Senate Foreign Relations Committee chairman Sen. John Kerry, center, looks on during nomination hearings January 13, 2009, on Capitol Hill. Hide Caption 29 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton testifies during her confirmation hearing for secretary of state on January 13, 2009, in Washington. Hide Caption 30 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton, as secretary of state, dances with a local choir while visiting the Victoria Mxenge Housing Project in Philippi, a township on the outskirts of Cape Town, South Africa, on August 8, 2009. Hide Caption 31 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton looks through binoculars toward North Korea during a visit to an observation post July 21, 2010, at the demilitarized zone separating the two Koreas. Hide Caption 32 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton walks up the steps to her aircraft as she leaves a meeting of the Association of Southeast Asian Nations on July 23, 2010, in Hanoi, Vietnam. Hide Caption 33 of 50 50 photos: Hillary Clinton's career in the spotlight Hillary and Bill Clinton pose on the day of their daughter's wedding to Marc Mezvinsky on July 31, 2010, in Rhinebeck, New York. Hide Caption 34 of 50 50 photos: Hillary Clinton's career in the spotlight U.S. President Barack Obama and Clinton observe a moment of silence before a NATO meeting November 19, 2010, in Lisbon, Portugal. Hide Caption 35 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton listens as Turkish Foreign Minister Ahmet Davutoglu makes a brief statement November 29, 2010, before a bilateral meeting at the State Department in Washington. Hide Caption 36 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton shakes hands with a child during an unannounced walk through Tahrir Square in Cairo on March 16, 2011. Hide Caption 37 of 50 50 photos: Hillary Clinton's career in the spotlight Obama, Vice President Joe Biden, Clinton and members of Obama's national security team receive an update on the Osama bin Laden mission May 1, 2011, in the Situation Room of the White House. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton checks her personal digital assistant prior to departing Malta on October 18, 2011. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton dances while in Cartagena, Colombia, on April 15, 2012. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton enjoys a beer at Cafe Havana in Cartagena, Colombia, on April 15, 2012. Hide Caption 41 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton appears with little makeup during an event in Dhaka, Bangladesh, on May 6, 2012. She tells CNN, \"I feel so relieved to be at the stage I'm at in my life right now ... Because you know if I want to wear my glasses, I'm wearing my glasses. If I want to wear my hair back I'm pulling my hair back. You know at some point it's just not something that deserves a lot of time and attention.\" Hide Caption 42 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks as Afghanistan President Hamid Karzai listens during a news conference at the presidential palace in Kabul, Afghanistan, on July 7, 2012. Hide Caption 50 photos: Hillary Clinton's career in the spotlight Clinton arrives at Ben Gurion International Airport in Israel on July 15, 2012. Hide Caption 44 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton looks on as Obama makes a statement in response to the attack at the U.S. Consulate in Libya on September 12, 2012. Hide Caption 45 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton applauds Myanmar opposition leader Aung San Suu Kyi during a ceremony where Suu Kyi was presented with the Congressional Gold Medal on September 19, 2012. Hide Caption 46 of 50 50 photos: Hillary Clinton's career in the spotlight Bill Clinton kisses his wife after introducing her at the Clinton Global Initiative annual meeting on September 24, 2012, in New York City. Hide Caption 47 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton shakes hands with Catherine, the Duchess of Cambridge, while attending a reception with Prince William, second from right, in New York in December. Hide Caption 48 of 50 50 photos: Hillary Clinton's career in the spotlight Clinton speaks to reporters at U.N. headquarters on Tuesday, March 10, addressing her use of private email for official work as secretary of state. She said she used a private domain out of \"convenience\" but admitted in retrospect \"it would have been better\" to use multiple emails. Hide Caption 49 of 50 50 photos: Hillary Clinton's career in the spotlight Democratic presidential candidate, former Secretary of State Hillary Rodham Clinton gestures before speaking to supporters Saturday, June 13 on Roosevelt Island in New York, in a speech promoted as her formal presidential campaign debut. Hide Caption 50 of 50 But internally, the Benghazi probe has been beset by problems -- largely by the GOP's own making. California Rep. Kevin McCarthy, the House majority leader who abruptly dropped out of the speaker's race earlier this month, initially gave Democrats fresh talking points when he touted the committee's work in causing Clinton's poll numbers to drop. And Hanna, the New York Republican, said on a radio program last week that the committee was in part \"designed to go after\" Clinton. The comments, which gave Clinton more ammunition to accuse the committee of launching a partisan witchhunt, infuriated Republicans -- especially since Hanna had no involvement in the panel's work. Westmoreland, a member of the Benghazi committee, asserted that Hanna made \"uninformed, personal comments.\" \"I've never seen him at any of our meetings, I've never seen him at a hearing. I've never seen him at a witness interview. I've never talked to him about Benghazi. I don't know if he's ever talked to any of the other members,\" Westmoreland told CNN. \"It seems like he's just getting this information from the Democrats and Media Matters.\" READ: Lynn Westmoreland would seek speakership if Paul Ryan doesn't run Asked if he were frustrated by Hanna's comments, Pompeo said: \"My life is full of frustrations.\" Messer added: \"My advice would be to all my colleagues who are not on the committee: We ought to do our best to leave the commentary quiet -- and let those folks do their job. ... The problem is not with the work of the Benghazi committee, the problem has been with members not on the committee deciding that they would be political commentators.\" A spokeswoman for Hanna did not respond to multiple inquiries seeking comment. Pessimism grows over bipartisan fiscal deal As Republicans navigate ahead of the much-anticipated Clinton hearing, GOP leaders must resolve a looming standoff with the White House over several key fiscal matters, including funding highway programs by Oct. 29, raising the national debt ceiling by Nov. 3 and funding the government by Dec. 11. Both parties are preparing to pass yet another short-term extension of highway funding to keep road and construction programs afloat. But a much more arduous task revolves around raising the debt ceiling, which has been one of the most divisive fights within the GOP for the past several years. Hoping to avoid a standoff, staff-level talks between the White House and congressional leaders -- Boehner, Senate Majority Leader Mitch McConnell, Senate Minority Leader Harry Reid and House Minority Leader Nancy Pelosi -- have taken place behind-the-scenes over the last few weeks. The goal, according to people familiar with the process, is to find a big fiscal deal that would lift spending caps for two years and raise the debt ceiling through the 2016 elections. To circumvent the possibility of a Dec. 11 shutdown, the two sides are seeking to raise spending for defense and domestic programs by roughly $76 billion per year -- and find other cuts within the budget to offset those increases and counteract sequestration. McConnell, sources said, proposed cuts to Social Security and Medicare to pay for the increased spending, but Democrats rejected that offer. And Republicans said last week that the White House's proposed offsets were not suitable. Pessimism on Capitol Hill is now growing that there will be a large-scale fiscal deal, meaning that Boehner -- in his final days in office -- appears likely to move a debt ceiling bill separately in order to avoid a default on the country's $18.4 trillion national debt. Such a move would almost certainly provoke a full-scale rebellion on the right. Paul, the Kentucky Republican who has slipped in the presidential polls, said he would insist that the GOP passes a constitutional amendment to balance the budget before raising the debt ceiling -- a bill that has virtually no chance of overcoming Senate Democratic opposition. Paul added that the GOP should let government funding expire and force Democrats to make concessions in order to reopen the government. \"I think we should let all the spending expire, make them start over -- and make the Democrats get 60 votes to start spending,\" Paul said. The White House has repeatedly said that it would not negotiate over the debt ceiling increase -- meaning that the President wants Congress to raise the borrowing limit without putting any strings on it. Messer, a member of Boehner's leadership team, said the outgoing speaker would lose ample support in the GOP if he tried to move a clean debt ceiling bill. Still, Boehner could get such a measure through the House relying on Democrats. \"The only way you get a sizable number of Republican votes is to include spending reductions in any debt ceiling increase,\" Messer said. \"If John decides to go another route, he'll be doing it without very many Republicans.\" <div id=\"ad_rect_atf_01\" class=\"ad-ad_rect_atf_01 ad-refresh-adtop\"></div> More from Politics", "external_links": [], "published": "2015-10-19T01:22:00.000+03:00", "crawled": "2015-10-19T01:53:33.426+03:00", "highlightTitle": ""}