{"organizations": [], "uuid": "0b63086bfeba9f961448658a7505b3e12dc0f625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/09/22/b01db6c0-5fdb-4c05-bbac-e3eb32dcb1c5/thumbnail/620x350/68e4261e27c950777cb167e5be8033bd/rts1tk8.jpg", "site_section": "http://www.cbsnews.com/rss/primary_source.rss", "section_title": "Politics - CBSNews.com", "url": "http://www.cbsnews.com/news/carson-goes-on-book-tour-with-few-public-campaign-events-scheduled/", "country": "US", "title": "Carson goes on book tour with few public campaign events scheduled", "performance_score": 0, "site": "cbsnews.com", "participants_count": 0, "title_full": "Carson goes on book tour with few public campaign events scheduled", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:17:00.000+03:00", "replies_count": 0, "uuid": "0b63086bfeba9f961448658a7505b3e12dc0f625"}, "author": "", "url": "http://www.cbsnews.com/news/carson-goes-on-book-tour-with-few-public-campaign-events-scheduled/", "ord_in_thread": 0, "title": "Carson goes on book tour with few public campaign events scheduled", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Carson", "Rebecca Shabad"], "text": "By Rebecca Shabad CBS News October 15, 2015, 2:24 PM Carson goes on book tour with few public campaign events scheduled \nU.S. Republican candidate Dr. Ben Carson speaks during the Heritage Action for America presidential candidate forum in Greenville, South Carolina September 18, 2015. REUTERS/Chris Keane More + \nBen Carson will spend the next two weeks with most of his time devoted to promoting his book \"A More Perfect Union\" and raising money, rather than at public campaign events organized by his team. \nA report by ABC News on Thursday said Carson had put his public campaign events on hold while he goes on his book tour, but Carson campaign spokesman Doug Watts told CBS News that the idea that Carson is suspending his campaign in any way is \"patently false.\" \n\"There are 100 ways that you can campaign on a daily basis,\" Watts said. \nThrough the end of October, Watts said Carson has 18 fundraising events, which he termed \"campaign events.\" Watts claimed that Carson would have six open campaign events in the two-week period. Asked what they were, he said Carson had an \"open retail\" event on Thursday morning in Atlanta for breakfast that did not appear previously on his public schedule, and has another event scheduled in Virginia on Friday that is closed to the press. He also counted an upcoming appearance on ABC's \"This Week\" among the campaign events. \nWatts provided a list of a few other events in October that included \"retail campaign stops\" in Virginia, Texas, Oklahoma and Kansas. \nCarson, a former neurosurgeon , had committed to go on a book tour last year when he signed his book contract, Watts said. A description of the book that Carson wrote said it's about his defense of the Constitution from those who misinterpret or undermine it. \nWatts asserted that Carson has done his fair share of public campaign events recently. \n\"We have done more public events than fundraisers in the last few months,\" he said. \"Most of America would not know the difference between book tour and campaign because they're watching him on TV.\" \nExcept for a cattle call with other candidates on Saturday, a Faith and Freedom event on Sunday, a few \"retail campaign stops\" and the next GOP debate on Oct. 28, the majority of the events Carson has scheduled through mid-November are book tour stops or fundraisers. \nHis next major public campaign event is a town hall in South Carolina on Nov. 13. \nAccording to the Federal Election Commission, Carson is well within his rights to sell books while he campaigns. Previous rulings also allow campaigns to buy candidates' books and distribute them. But candidates cannot convert campaign funds for personal use, including for a book tour. \nCarson is certainly not the first candidate in the 2016 presidential cycle to promote a book during a campaign. Former Hewlett-Packard CEO Carly Fiorina, for example, launched her campaign when her book came out in May. Sen. Ted Cruz, R-Texas, also went on his book tour over the summer. \nBut Carson's decision to shift away from non-stop campaign events for a few weeks could be politically risky. He's been in second place behind GOP frontrunner Donald Trump in various polls over the last few months. \nAt the same time, it appears the campaign is taking a break with ongoing public campaign events in order to keep Carson's finances as clean as possible. \nCBS News' Donald Judd contributed to his report. © 2015 CBS Interactive Inc. All Rights Reserved. Shares", "external_links": [], "published": "2015-10-15T23:17:00.000+03:00", "crawled": "2015-10-15T21:31:55.570+03:00", "highlightTitle": ""}