{"organizations": [], "uuid": "ad9a77085c6a7681a2d6b7d3b3dd439d3a5bb0f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/12/Local-Politics/Images/MDearlyvotingC_10_0_238106252.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/dont-underplay-electronic-election-theft/2015/10/13/9b2f3b02-7104-11e5-ba14-318f8e87a2fc_story.html", "country": "US", "title": "Don’t underplay electronic election theft", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Don’t underplay electronic election theft - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad9a77085c6a7681a2d6b7d3b3dd439d3a5bb0f9"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/dont-underplay-electronic-election-theft/2015/10/13/9b2f3b02-7104-11e5-ba14-318f8e87a2fc_story.html", "ord_in_thread": 0, "title": "Don’t underplay electronic election theft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Election judges set up electronic voting machines before early voters arrive at the Silver Spring Civic Center in Silver Spring in 2010. (Marvin Joseph/The Washington Post) October 13 at 5:12 PM It’s a step forward to editorialize openly about our voting system risks [“ Model T’s in the voting booth ,” editorial, Oct. 8]. But electronic election theft was curiously underplayed considering The Post’s many recent reports on hacking of other computer systems.\nWe should be forcefully addressing the potential and alleged actuality of electronic election theft. Optical-scan paper ballot systems, such as Maryland’s new equipment, are a step forward because they facilitate validation by observable ballot recounting. They won’t catch fraud, however, unless manual recounts are regularly conducted of at least statistically sampled voting results. California recounts a portion of its ballots unannounced and has avoided telltale signs of vote-tampering. California also requires access to proprietary codes that tabulate voting. Would the laptop voting proposed in The Post’s editorial even provide for observable ballot recounting?\nIt’s time to stop treating electronic election theft as the “third rail” and seriously assess investigations alleging wrongdoing. The focus should be less on voting machine newness than on implementing voting machine designs and election protocols that erect effective barriers to election manipulation.\nIf all this sounds paranoid, consider: Vote-shifting malware is thought to typically include code allowing unaltered vote tabulation in advance of Election Day, when tests are usually run, and again after election-hour manipulations. Notice the strong parallel to the astounding confession that Volkswagen diesel engine software appropriately controls emissions only during testing, but the vehicles polluted otherwise.\nRichard H. Pratt , Garrett Park", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:58:54.290+03:00", "highlightTitle": ""}