{"organizations": [], "uuid": "a29a562a86a3375ab3160674dc7239818b8ea6aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151020113410-bill-clinton-jeb-bush-composite-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/10/20/politics/jeb-bush-bill-clinton-bin-laden-9-11-attack/index.html", "country": "US", "title": "Jeb Bush faults Bill Clinton over bin Laden pursuit", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Jeb Bush faults Bill Clinton over bin Laden pursuit - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "a29a562a86a3375ab3160674dc7239818b8ea6aa"}, "author": "Ashley Killough", "url": "http://www.cnn.com/2015/10/20/politics/jeb-bush-bill-clinton-bin-laden-9-11-attack/index.html", "ord_in_thread": 0, "title": "Jeb Bush faults Bill Clinton over bin Laden pursuit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Jeb Bush said Bill Clinton did not pursue Osama bin Laden hard enough during his presidency Clinton himself has expressed regret for not being able to get bin Laden Washington (CNN) Jeb Bush, who's been defending his brother against criticism from Donald Trump over the 9/11 attacks, offered his own critique of a former president Monday night, saying Bill Clinton made a mistake by not going after Osama bin Laden hard enough.\nIn an interview with Sean Hannity on Fox News, audio was played of Clinton talking in 2002 about claims from Sudan's government that it offered up bin Laden to the United States in 1996.\nClinton said he passed on the decision to bring him in, adding that bin Laden had not committed a crime against the U.S. and there was \"no basis on which to hold him, though we knew he wanted to commit crimes against America.\"\nResponding to those comments, Bush said that Clinton did not approach bin Laden in the proper context, saying he should have been viewed through a terrorism lens and a threat to national security rather than through normal law enforcement channels.\n\"I think the Clinton administration made a mistake of thinking bin Laden had to be viewed from a law enforcement perspective,\" Bush said. \"Similarly, President Obama's policies seemed to be focused on that as well.\"\nRead More Bush described terrorism as \"a war against Western civilization, and without the United States' leadership, this will be a problem for generations to come. And I think we need to be much more forceful, both here to protect the homeland as well as overseas.\"\nClinton later said he misspoke in the 1996 speech and there was not an offer to bring in bin Laden. The 9/11 Commission in 2004 said it found no evidence of a Sudanese offer.\nThere have, however, been several reports that the Clinton administration did consider indicting Bin Laden -- just not in relation to that offer, according to FactCheck.org .\nClinton himself has expressed regret for not being able to get bin Laden but has forcefully defended his efforts in trying.\n\"At least I tried. That's the difference in me and some, including all the right-wingers who are attacking me now. They ridiculed me for trying. They had eight months to try. They did not try. I tried,\" he said in a 2006 Fox News interview. \"So I tried and failed. When I failed, I left a comprehensive anti-terror strategy and the best guy in the country, Dick Clarke, who got demoted.\"\nIn that same interview, Clinton criticized Fox News for asking him whether he did enough to go after bin Laden. \"I want to know how many people in the Bush administration you asked this question of,\" he said.\nBush has spent the past several days defending his brother against Trump, who's been blasting George W. Bush for letting 9/11 happen on his watch . In the interview Monday night, Bush again knocked his presidential rival for going after his brother.\n\"We need a steady hand,\" he said. \"His view of history is just wrong. The simple fact is that when we were attacked, my brother created an environment where for 2,600 days, we were safe. No one attacked us again. And he changed the laws. He did everything necessary. He united the country and he kept us safe. And just a tip of the hat to that and moving on to the threats today is what we should be focusing on. Donald Trump is not a serious candidate as it relates to foreign policy.\"\nFollow @CNNpolitics", "external_links": ["http://www.factcheck.org/2008/01/clinton-passed-on-killing-bin-laden/", "https://twitter.com/CNNpolitics"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T19:40:57.916+03:00", "highlightTitle": ""}