{"organizations": [], "uuid": "09946be7ee7d59d115b7a601373b773a6aa9a508", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz//politics/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/nation-tova-obrien-interviews-john-key/5/233454", "country": "US", "title": "On The Nation: Tova O'Brien interviews John Key", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "On The Nation: Tova O'Brien interviews John Key", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:19:00.000+03:00", "replies_count": 0, "uuid": "09946be7ee7d59d115b7a601373b773a6aa9a508"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/nation-tova-obrien-interviews-john-key/5/233454", "ord_in_thread": 0, "title": "On The Nation: Tova O'Brien interviews John Key", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Saturday, 3 October, 2015 - 11:19 \nOn The Nation: \nTova O'Brien interviews Prime Minister John Key \nKey says Australia will back down on its policy of deporting Kiwis sentenced to at least a year in prison: \"I don’t actually think the Australian position’s sustainable over the very long term\". \nSays he will be meeting with new PM Malcolm Turnbull to discuss the issue \"in the very foreseeable future\". He could play the \"ANZAC spirit\" card, but won’t be \"throwing our toys out of the cot\" as that would force him \"into a corner\". \n\"You’ve got to give political leaders a chance if they’re going to make nuanced changes to policies to do so in a way where they can preserve their dignity but maybe cut you a bit more space. \" \nKey says NZ could live with \"some extension\" of patent lengths on medicines as part of the TPP but not a \"dramatic one\" \n\"But we are at that crunch point with dairy, where we need to get more for New Zealanders if we can, and that’s what we’re working on.\" \nSays Islamic State and Syrian President both need to go but IS probably needs to be dealt with first \nSays NZ position in line with US thinking and the perceived softening of Australia’s stance on removing Bashar Al-Assad is because its policy was always \"in a slightly different space to us\" \n\"Their position, as I understand, was saying that Assad had to go straight away. We’ve never held that view. We’ve said he has to go but there can be a transition of him leaving power.\" \nSays he doesn’t think West will ever support Assad staying in power, citing fact he has used chemical weapons against his own people. \n\"The West will never support that, the Americans never will, and actually, New Zealand won’t either.\" \nTova O’Brien: Prime Minister, just starting with Syria, starting with your speech; you said it’s not Assad or the Islamic State, but both have to be dealt with. Which comes first? \nJohn Key: Potentially, some people would argue the Islamic State, insomuch that Assad is a more challenging issue, and in the end, while Assad has to go, there has to be a series of different institutions that can survive Assad. The very point that President Obama made in his speech about Libya was that in one sense, they got rid of Gaddafi, and that was great, but they left a whole lot of institutions falling over. But as I said yesterday, both of them are bad, and for a very long time we’ve been extremely critical of Assad. He’s a guy that’s used chemical weapons against his own people. But we’ve never argued that there should be regime change immediately; we’ve just been arguing that he has to go. And now both of them have to go. \nBut we have been more aligned with America in its camp, which has always said that Assad must go. Russia’s obviously moved the ground. Some countries in the West are softening; Australia, Germany saying that they may now have to work them. Is that what you meant when you said a workable political solution will not be a perfect one? \nYes, in a way, although I don’t think-what’s happened with Australia is they were in a slightly different space to us. Their position, as I understand, was saying that Assad had to go straight away. We’ve never held that view. We’ve said he has to go but there can be a transition of him leaving power. So that’s really if insomuch that there’s a softening, that’s probably it. In terms of the US, I’m not sure about their earlier positions, but Obama basically said on Monday that there would be some time frame. He didn’t put a time frame on that, but he essentially gave at least the feeling that they’re very much aligned with where we think things should go. But, look, in the end, the long term position for Syria is very poor, and it’s not sustainable in its current form, because people can’t live there. They can’t live there either under ISIL, but they certainly can’t live there under Assad. And they were pouring out of Syria long before ISIL started doing things. ISIL just filled a particular void that was there. \nAbsolutely. And even you said in New York back in 2013 that Assad is a war criminal who must be brought to account. You’ve reiterated some of these statements this week. You condemn those who shield him, but is the new political reality that that’s exactly what we’re having to do - to work with him, effectively, shielding him? \nNo, I think that’s the Russian position. I mean, the Russian position is reasonably clear, and as I said, tactically, in the very, very short term, quite clever, because he says, ‘Look, you’re all opposed to ISIL. I’m opposed to the Islamic State as well.’ So in that regard, he’s getting everyone to line up behind him in the way against Islamic State. But that’s not new either. We’ve all been opposed to them long before he said that. We’ve been in Iraq, trying to train forces to degrade the Islamic State. Essentially, though, the point about Assad and Assad going, I don’t think he’ll ever change his view. I mean, partly as I’ve been saying this week, what he’s been doing, on the one hand, by turning everyone’s attention on to ISIS is also, though, to turn around and try to strengthen and at least preserve his relationship with Assad and actually demonstrate to people that he stood by Assad. We just don’t share that view, and we don’t think it’s sustainable, and I don’t think the West will ever actually agree to support Assad, because over time, when we understand fully everything that’s gone on, this is a leader that has, as I said earlier, used chemical weapons against his people. The West will never support that, the Americans never will, and actually, New Zealand won’t either. \nJust want to move you on to detention centres - New Zealanders being deported from Australia. This law change happened last December. You’re only really speaking out about it now. Were you blindsided? \nNo. We have held the view for a long period of time and made the point, actually, in the past to both Tony Abbott and to the Foreign Minister that we think where they’ve set the threshold in terms of deportations is too low. I mean, they would make the point that these are still people that have been imprisoned for one year or more. My simple point is it’s the same theme, really, as the rights of New Zealanders in Australia, that simply we have free-labour markets, so by definition, a huge number of New Zealanders go across the Tasman. We know that there’s a better part of half a million, and the point we make to the Australians is yeah, we understand that you want to have these tougher rules in these areas, but actually, there has to be, I think, a degree of saying that because we have these free-labour markets… These people are virtually Australians. Let’s be blunt. They’re able to go across the Tasman at their will unless they have some sort of criminal record - historical criminal record. Then you’ve got to take a bit of the rough with the smooth, because we do a bit of that as well. Now, we do have the right to deport people, but it’s at a much higher threshold. In terms of the Australians sending them to detention centres, that’s caused, I think, technically because when people come out of prison, often they’re appealing their case, and so there’s nowhere, technically, to put them, would be the Australian argument. Again in the past, they’d go back into the community at some point. If they deported them, then they deport them. But now what’s happening is they’re taking a more hard-line view, and again, to me, for the most part, I think that feels pretty tough, and it simple comes back to - do we have a special relationship with Australia or not? In my view, the answer’s yes. I don’t actually think the Australian position’s sustainable over the very long term, and we are going to encourage the Australian Government to consider the matter. \nBut how many New Zealanders need to be thrown into detention centres before we take a serious diplomatic stance? Because if, say, Indonesia, Iran or Russia and 200 New Zealanders holed up, you would have taken major action by now. \nFirstly, we want a successful outcome, so the question is - how do you achieve a successful outcome? I think throwing our toys out of the cot is not necessarily going to achieve that in the short-term. I think it’s far better, actually, for us to sit down with the new Prime Minister and to talk to through the issues, and we’re going to have the opportunity to do that, I would say, in the very foreseeable future. We have been working on these issues for some time. In fact, I think we’ve been behind the scenes making some progress with the Abbott Government about the rights of New Zealanders in Australia. In the end, every country has a sovereign right to make their own rules and their own laws, and anyone that moves to that country, whether they like it or not, has to observe those laws if they want to go there. So I think our relationship with Australia, in a way, maybe it does mean that we deal with in a slightly different way, but it also means we’re far more likely to get a better outcome, because we can go back and say, ‘Here’s the Anzac spirit. Here’s all of these things.’ We can play those cards. \nYeah, but it’s tricky, though, because even Australia’s Immigration Minister Peter Dutton is taking a hard line. He’s making no apology. \nPeter Dutton: We have the ability to cancel visas if people are here doing the wrong thing, if they’re committing offenses in our society. We don’t have a tolerance for that, and that’s the way in which the law operates, and it will continue into the future. \nYou talk about the Anzac spirit and things, but how do you actually change their mind? \nWe do the sorts of things we’re doing. I mean, I’ve spoken to the Foreign Minister when I had an opportunity earlier this week on Monday. The Foreign Minister of New Zealand, Murray McCully, has been speaking to Julie Bishop for some time now. I’ll raise the matter with Malcolm Turnbull. I’ve raised the matter before with Tony Abbott. It’s a change of government. You’ve got to be a bit careful. We don’t want to, sort of, force Malcolm Turnbull into a corner where he has to, sort of, pick and choose. You’ve got to give political leaders a chance if they’re going to make nuanced changes to policies to do so in a way where they can preserve their dignity but maybe cut you a bit more space. It’s got to be a chance that we can see some change there. I mean, Malcolm Turnbull’s not known for being an unreasonable guy. \nWhere do you think that they might move? Cos it used to be people who have served 24 months in prison being sent back home, now it’s down to 12 months. Could they go back up to the 24-month threshold? \nDon’t know. We just haven’t had those discussions in detail with them. \nIs that something you may be pushing for, though? Is that kind of a fair compromise? \nIt might be, but we will need to sit down and have a talk to them about that. But it’s not unusual for countries to have a carve-out for a particular manner. I mean, if you have a look at all sorts of rules that apply - I mean, you take investment into New Zealand, for example, the threshold out of Australia is the better part of, I think, around about $800 million. For every other country, it’s around about, even with the Free Trade Agreement, around about 100 million. They vary a little bit. But there’s a special level of the threshold for Australia. So it’s not like this is unique ground, that they might somehow say, ‘Because of the relationship between New Zealand and Australia, because we’re almost one market together, we’ll take a slightly different view when it comes to Kiwis.’ \nAnd let’s talk about the Trans-Pacific Partnership, because it’s crunch time, isn’t it? Have we had to give ground on areas of concern - the investor state disputes, pharmaceuticals and dairy? \nNot in terms of investor state. We’re not worried about that. There will be investor state dispute provisions within TPP. We’ve had them in the last four FTAs. We’ve had-there’s never been a case taken against New Zealand. I think it’s highly unlikely that there actually would be. Most of the things that Jane Kelsey and those who support her say are factually incorrect. Or alternatively, they represent the actions that a country outside of New Zealand, you know, away from New Zealand might take, but we haven’t. \nPharmaceuticals and dairy? \nWell, yeah, of course there’s a horse-trading process going on at the moment. There always is in every FTA. We care desperately about making sure we improve the deal that’s on the table with dairy. They care desperately about what’s happening in the intellectual property and sort of pharmaceutical space. \nWhat about patent lengths? So could New Zealand sacrifice patent lengths on medicines for the sake of dairy, as some insiders are saying? \nNo. The United States would probably see it as somewhat separated. They certainly want to see the extension of patents and corporates and the likes. They do want to do that, and we could live with some extension, but not, you know, we don’t think a dramatic one. We also-you’d be aware, obviously, go away and have a look at what the financial impractical implications of all of these things are so that when we go out and say, ‘We’re only going to sign something if we think it’s in the best interests of New Zealand’, we don’t, sort of, make that stuff up. We have models, and we have all sorts of assessment techniques. And everything I’ve seen so far allows me to continue to say I think that we are progressing towards something that would absolutely be in New Zealand’s best interests. If it’s not, we won’t sign it. But we are at that crunch point with dairy, where we need to get more for New Zealanders if we can, and that’s what we’re working on. \nAll right, Prime Minister, we’ll leave it there. Thank you very much for your time. \nThanks very much. \nTranscript provided by Able. www.able.co.nz \nThe Nation on TV3, 9.30am Saturdays and 10am Sundays. Proudly brought to you by New Zealand on Air’s Platinum Fund. \n ", "external_links": [], "published": "2015-10-03T02:19:00.000+03:00", "crawled": "2015-10-03T08:52:10.141+03:00", "highlightTitle": ""}