{"organizations": [], "uuid": "c396de7c05c4a643653fbe72c6a746fb3a6d7275", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "https://d1jn4vzj53eli5.cloudfront.net/mc/_external/2015_10/-credit-gage-skidmore-photo-on.jpg?h=200&w=300", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/libertarian/2015/10/ben-carson-and-the-politics-of-fantasy-2620396.html", "country": "US", "title": "Ben Carson and the Politics of Fantasy | Libertarian", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Ben Carson and the Politics of Fantasy | Libertarian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:17:00.000+03:00", "replies_count": 0, "uuid": "c396de7c05c4a643653fbe72c6a746fb3a6d7275"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/libertarian/2015/10/ben-carson-and-the-politics-of-fantasy-2620396.html", "ord_in_thread": 0, "title": "Ben Carson and the Politics of Fantasy | Libertarian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nIf only Ben Carson had been in that classroom at Umpqua Community College, the outcome might have been different. The gunman reportedly asked several people their religion, only to be shot regardless of the answer. Carson said he would have been braver than they were.\n“Not only would I probably not cooperate with him, I would not just stand there and let him shoot me,” he said in an interview on Fox News Channel. “I would say, ‘Hey, guys, everybody attack him. He may shoot me, but he can’t get us all.’”\nCarson has never had to face a homicidal maniac training a gun barrel on him, but he has no doubt that if he did, he would respond with courage and resolve. Maybe he would. Maybe the 18 people shot last week simply lacked his unflinching nerve in the face of death. Maybe if he had been there, he would have saved them.\nMore likely, though, is that he’s living on a different planet. Evidence abounds that Carson maintains only intermittent contact with reality. He resembles Lewis Carroll’s White Queen, who told Alice, “Why, sometimes I’ve believed as many as six impossible things before breakfast.”\nSome voters think a Carson presidency is neither impossible nor undesirable. In the latest Wall Street Journal /NBC News poll in Iowa, he has 19 percent of the Republican vote, second only to Donald Trump.\nThese supporters may like his story: a poor African-American—raised in Detroit by an illiterate single mother—who grew up to attend Yale and become a neurosurgeon, the first one ever to separate twins conjoined at the head. They may like that he embraces conservative themes without reservation.\nThey may be pleased that as a black man who sounds just like a white tea party conservative, he absolves conservatives of any possible racial prejudice. Herman Cain filled the same role four years ago.\nBut they may also like Carson for his habit of believing impossible things that validate their extreme ideology. Carson is proof that when it comes to Republican primary voters, ridiculous statements are the price of admission.\nHe drew attention by saying he could not accept a Muslim for president, on the theory that Islam is incompatible with American values. This was too much for Lindsey Graham, who noted that 3,500 Muslim members of the U.S. military have fought in Iraq and Afghanistan. Carson apparently didn’t notice that two Muslim members of Congress have taken the oath to uphold the Constitution—the same one Christian and Jewish members take.\nHe earned his right-wing bona fides by saying that Obamacare is “slavery, in a way.” Barack Obama’s arguments about saving lives and ensuring access to care were lies because “it was never about health care. It was about control.” But what would you expect of a president Carson regards as a “psychopath”?\nCentral to his appeal in the GOP is his withering contempt for liberals—”the most racist people there are,” in his view. He believes “political correctness is ruining our country.”\nCarson is a Christian who thinks Charles Darwin’s theory of evolution is a fraud promoted by “the forces of evil.” He likens same-sex marriage to legalizing pedophilia and bestiality and predicts it will lead us to “a disastrous ending, as witnessed in the dramatic fall of the Roman Empire.”\nHe said that homosexuality is obviously a choice “because a lot of people who go into prison go into prison straight—and when they come out, they’re gay.” He later apologized for his words, without abandoning his view.\nHis comment was a reminder that he has strange views on penal issues. Carson said that when he visited federal prisons, he was “flabbergasted by the accommodations,” and he worries that we are “creating an environment that is conducive to comfort where a person would want to stay.”\nIt’s hard to imagine how someone so intellectually and professionally accomplished could utter such howling nonsense. But there is no real mystery. Great distinction in one field is no protection against unmitigated foolishness in another. Bobby Fischer may have been the greatest chess genius ever, but he ended up a paranoid anti-Semite.\nCarson is an exceptional surgeon who knows very little about public policy or history and has a habit of letting his imagination fill in the gaps. He can believe anything that suits his preferences, as long as it’s impossible.\n© Copyright 2015 by Creators Syndicate Inc.", "external_links": ["https://d1jn4vzj53eli5.cloudfront.net/mc/_external/2015_10/-credit-gage-skidmore-photo-on.jpg?h=200&#038;w=300"], "published": "2015-10-08T05:17:00.000+03:00", "crawled": "2015-10-08T07:38:43.201+03:00", "highlightTitle": ""}