{"organizations": [], "uuid": "bc6cbab283b86ca2d02244e42497aa93135ca9b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30246718/hastings-hastings-supports-the-campaign-for-tobacco-free-kids", "country": "US", "title": "Hastings & Hastings Supports the Campaign for Tobacco-Free Kids", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hastings & Hastings Supports the Campaign for Tobacco-Free Kids - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "bc6cbab283b86ca2d02244e42497aa93135ca9b6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30246718/hastings-hastings-supports-the-campaign-for-tobacco-free-kids", "ord_in_thread": 0, "title": "Hastings & Hastings Supports the Campaign for Tobacco-Free Kids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hastings & Hastings\nTobacco is one of the leading causes of preventable death in the United States. The hard numbers are devastating. Over one hundred million deaths were attributed to tobacco use in the 20th century alone.\nPHOENIX , Oct 13, 2015 /PRNewswire/ -- These numbers are projected to rise even higher in the 21st century. Proper education about the dangers of tobacco starts in childhood, which is why Hastings & Hastings supports the Campaign for Tobacco-Free Kids.\nLogo - http://photos.prnewswire.com/prnh/20151009/275681LOGO\nThe Campaign for Tobacco-Free Kids is an organization that is aimed at reducing tobacco use by children and young adults in the Unites States and around the world. The Campaign is built upon a mission with 6 major tenets. They aim to promote public policies which have already been proven to reduce tobacco consumption. They expose tobacco industry efforts to mislead and misinform children. Further, they support strengthening tobacco regulations, and mobilizing individuals in the fight against tobacco. Finally, they inform the public about the effects of tobacco and empower them to be tobacco-free.\nThe Campaign for Tobacco-Free Kids acknowledges the nearly incomprehensible difficulties associated with quitting tobacco use. This is why it is so important to prevent children from starting to use tobacco. During the 1960s, 46 percent of the American population smoked, today that number has dropped all the way to 22 percent. The Campaign for Tobacco-Free Kids aims at reducing this number to zero.\nBeyond the education of children, the Campaign also concerns itself with the education of teens and college students. There has been a recent spike in the adoption of smoking within these two major demographics. Individuals who take up smoking during these years are likely to continue smoking for a minimum of four more years. Four years of tobacco use can cause devastating and everlasting damage to the body.\nHastings & Hastings supports all the dedication and hard work of the Campaign for Tobacco-Free Kids. If tobacco use continues as stands, it is likely that 5.6 million children who are currently under the age of 18 will ultimately die from tobacco use. The goal of the Campaign is to save each and every one of these 5.6 million lives. Hastings & Hastings lauds the incredible lifesaving efforts of the Campaign for Tobacco-Free Kids.\nAbout Hastings & Hastings\nHastings & Hastings is an Arizona consumer law firm. We are an experienced trial law firm that represents personal injury and wrongful death victims at a Discount Fee.\nContact Information\nKristy Guell\n(480) 706-1100\nkristy.guell@hastingsandhastings.com\nhttp://hastingsandhastings.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/hastings--hastings-supports-the-campaign-for-tobacco-free-kids-300157277.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151009/275681LOGO", "http://hastingsandhastings.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY24626&Transmission_Id=201510130700PR_NEWS_USPR_____NY24626&DateId=20151013", "http://www.prnewswire.com/news-releases/hastings--hastings-supports-the-campaign-for-tobacco-free-kids-300157277.html", "http://www.xmlnews.org/ns/"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T15:19:37.213+03:00", "highlightTitle": ""}