{"organizations": [], "uuid": "d2c11083273b1c89685141181ec846362ab10505", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.itv.com", "main_image": "http://www.itv.com/news/assets/branding/fb.png", "site_section": "http://www.itv.com/news/wales/politics/", "section_title": "Politics | Wales - ITV News", "url": "http://www.itv.com/news/wales/update/2015-10-20/first-minister-says-assembly-should-block-proposed-english-veto/", "country": "GB", "title": "First Minister says Assembly should block proposed \"English veto\"", "performance_score": 0, "site": "itv.com", "participants_count": 1, "title_full": "First Minister says Assembly should block proposed \"English veto\" | Wales - ITV News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T23:12:00.000+03:00", "replies_count": 0, "uuid": "d2c11083273b1c89685141181ec846362ab10505"}, "author": "itv.com", "url": "http://www.itv.com/news/wales/update/2015-10-20/first-minister-says-assembly-should-block-proposed-english-veto/", "ord_in_thread": 0, "title": "First Minister says Assembly should block proposed \"English veto\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First Minister Carwyn Jones has condemned the draft Wales Bill, claiming that it would create an English veto on Welsh laws. He said proposed new restrictions on the National Assembly’s ability to legislate would make the devolution settlement more complex and less powerful. Mr Jones made it clear that he would ask the Assembly to refuse legislative consent for the bill as drafted to go ahead.\nThe Bill contains extensive new requirements for Whitehall to consent to Assembly bills, something which would be both inappropriate in principle, and bureaucratic in practice. They amount to nothing less than an English veto on Welsh laws. In pursuing its legislation, the Assembly would be subject to a new test of necessity which would introduce new areas of legal doubt and uncertainty. If these provisions had been in place during this administration, lawyers advise that less than one third of our Bills could have been passed without the prior approval of the UK Government. What kind of devolution would that be? The draft Bill, which reverses the two unanimous decisions of the Supreme Court in the Byelaws and Agricultural Wages Board cases, proposes a type of reserved powers model which, if implemented, would be a major step backwards for devolution in Wales. Without major improvement, the Bill is a recipe for ever more referrals to the Supreme Court and ever more inter-governmental disputes. That cannot be in the interests of the National Assembly, the Welsh Government or, indeed, the UK Government. The Bill as drafted will not provide the coherent and durable devolution settlement that the people of Wales deserve.\n– Fist Minister Carwyn Jones MP Last updated Tue 20 Oct 2015 Read more 7 updates Draft Wales Bill Politics Carwyn Jones Cardiff Wales Newport Swansea North Wales South Wales Gwent Mid and West Wales", "external_links": [], "published": "2015-10-20T23:12:00.000+03:00", "crawled": "2015-10-21T05:39:03.969+03:00", "highlightTitle": ""}