{"organizations": [], "uuid": "d51ad06d6330e68b2e017c9e68d55a1fd14af9cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30268193/donald-a-baer-named-to-the-advisory-council-for-the-first-year-potus-2017-a-new-project-at-the-miller-center-of-the-university-of-virginia", "country": "US", "title": "Donald A. Baer Named to the Advisory Council for The First Year: POTUS 2017, a New Project at The Miller Center of The University of Virginia", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Donald A. Baer Named to the Advisory Council for The First Year: POTUS 2017, a New Project at The Miller Center of The University of Virginia - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "d51ad06d6330e68b2e017c9e68d55a1fd14af9cb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30268193/donald-a-baer-named-to-the-advisory-council-for-the-first-year-potus-2017-a-new-project-at-the-miller-center-of-the-university-of-virginia", "ord_in_thread": 0, "title": "Donald A. Baer Named to the Advisory Council for The First Year: POTUS 2017, a New Project at The Miller Center of The University of Virginia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Burson-Marsteller\nNEW YORK , Oct. 15, 2015 /PRNewswire/ -- Burson-Marsteller, a leading global communications and public relations firm, today announced that Worldwide Chair and CEO Donald A. Baer has been named to the Advisory Council of a new initiative at The Miller Center of The University of Virginia . The initiative, The First Year: POTUS 2017 , will provide historical analysis and forward-looking recommendations to guide the next President of the United States in his or her critical first year.\nThe Miller Center is a nonpartisan affiliate of the University of Virginia that specializes in presidential scholarship, public policy and political history.\nBaer will be one of 20 Advisory Council members who represent both national political parties and have served in senior positions in government, business and media. Baer was selected because of his role as a senior White House adviser for President Bill Clinton , where he played a major role in the 1996 re-election campaign, and his expertise in public policy and communications. From 1994-98, Baer served President Clinton as Assistant to the President and White House Director of Strategic Planning and Communications and, before, as Chief Speechwriter/Director of Speechwriting and Research. He has been an adviser to several other Democratic Party presidential candidates and was a journalist covering U.S. politics and The White House. Among other areas, he will help the initiative focus on issues around managing the transition from campaigning to governing.\nThe First Year: POTUS 2017 project will be a resource for major officials in the next presidency, providing historical insight designed to offer guidance for contemporary governance. Starting in October 2015 , The Miller Center will release a set of short memos every two to three months on a wide range of policy and institutional topics including:\nWhy the First Year Matters National Security and Foreign Policy Global Economy, Trade, and Competitiveness Fiscal, Tax and Finances Opportunity and Mobility Race, Immigration, Citizenship Infrastructure Science, Technology and Values Broken Government Presidential Communications \"We are delighted to have Donald Baer on board as we launch this major new initiative,\" said William J. Antholis , Director and CEO of The Miller Center. \"In January 2017 , the new president will be confronted with many of the same challenges faced by his or her predecessors. The purpose of the First Year project is to examine these lessons of history, and use them to provide an intellectual blueprint for the 45 th president. Donald's unique insights and experiences within presidential first years will add tremendous value to our project.\"\n\"I am deeply honored to be part of this important project, especially because I have known the excellent work of The Miller Center since I was a student at The University of Virginia Law School,\" said Baer. \"As the next president faces the challenges of bringing the nation together and building consensus around solutions for our greatest problems, the work of Bill Antholis and his Miller Center colleagues will provide crucial lessons in leadership, including on how to communicate a sense of purpose and direction to help America move forward.\"\nAbout Burson-Marsteller\nBurson-Marsteller, established in 1953, is a leading global public relations and communications firm. It provides clients with strategic thinking and program execution across a full range of public relations, public affairs, reputation and crisis management, advertising and digital strategies. The firm's seamless worldwide network consists of 73 offices and 84 affiliate offices, together operating in 110 countries across six continents. Burson-Marsteller is a unit of WPP, the world's leading communications services network. For more information, please visit www.burson-marsteller.com .\n releases/donald-a-baer-named-to-the-advisory-council-for-the-first-year-potus-2017-a-new-project-at-the-miller-center-of-the-university-of-virginia-300160404.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://millercenter.org/about/firstyear", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY28188&Transmission_Id=201510150921PR_NEWS_USPR_____NY28188&DateId=20151015", "http://millercenter.org/", "http://www.prnewswire.com/news-releases/donald-a-baer-named-to-the-advisory-council-for-the-first-year-potus-2017-a-new-project-at-the-miller-center-of-the-university-of-virginia-300160404.html", "http://www.burson-marsteller.com/"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T19:50:16.932+03:00", "highlightTitle": ""}