{"organizations": [], "uuid": "70ebd01372310b1c343b7ad43aef1796862410d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30324268/sunnova-closes-additional-financing-of-300-million", "country": "US", "title": "Sunnova Closes Additional Financing of $300 Million", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Sunnova Closes Additional Financing of $300 Million - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "70ebd01372310b1c343b7ad43aef1796862410d6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30324268/sunnova-closes-additional-financing-of-300-million", "ord_in_thread": 0, "title": "Sunnova Closes Additional Financing of $300 Million", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Sunnova\nTotal capital raised reaches nearly $900 million\nNew investors join Sunnova's board of directors\nHOUSTON , Oct. 22, 2015 /PRNewswire/ -- Sunnova Energy Corporation today announced it secured approximately $300 million in committed debt and equity funding that the company will use to continue growing its position in the residential solar energy service market. The transactions include a conduit facility arranged by Credit Suisse, and an equity financing round led by Triangle Peak Partners, LP. Additional equity investors include business development companies sponsored by Franklin Square Capital Partners LP, which are sub-advised by GSO Capital Partners LP, the global credit investment platform of Blackstone.\nSunnova previously held the record for the largest-ever round of funding raised by a private residential solar service company in the United States when it closed a $250 million financing round in November 2014 . Today's announcement brings Sunnova's total fundraising to almost $900 million , evidence of Sunnova's position as a market leader in residential solar power service.\n\"We are pleased to partner with these world-class energy investors to continue Sunnova's momentum and fund our growth in the global power industry,\" said Sunnova Chief Executive Officer William J. (John) Berger. \"We are eager to leverage the experience and resources that these energy leaders bring to the table.\"\nWith this funding round, Sunnova continues its successful growth in the power industry and takes another step toward being a profitable power company in the global marketplace. Sunnova will utilize the funding to give more homeowners access to low-cost power and create more job opportunities for local partner firms and contractors nationwide.\nInvestors Join Sunnova's Board of Directors\nSeveral new individuals will serve on Sunnova's board of directors as part of the transaction, including Rob Horn from GSO Capital Partners LP, Mike Morgan and David Pesikoff from Triangle Peak Partners, LP and C. Park Shaper from SEIS Holdings, LLC.\nSeveral current Sunnova board members will remain on the board, including William J. (John) Berger , Russell Gordy , David Kinder and Richard Rabinow .\n\"The residential solar service industry has seen impressive growth in recent years. Sunnova's innovative business model leverages local channel partners to accelerate the broad adoption of rooftop solar,\" said Mike Morgan from Triangle Peak Partners, LP. \"Sunnova is building a next-generation power company that will increasingly compete with conventional energy and traditional, centralized electric utilities. We are excited to help Sunnova accomplish great things.\"\nAbout Sunnova\nSunnova is a different kind of power company, offering rooftop solar service to homeowners within and outside the United States through our network of local sales and installation partners. Our mission is to change the energy industry by providing the choice of low-cost, worry-free solar power that generates long-term savings for our customers and continued business growth for partners. For more information, visit sunnova.com and follow @Sunnova_Solar on Twitter or connect on Facebook and LinkedIn.\nCONTACT:\nChristen David\nDirector Public Relations\nO 281.545.0827 C 713.504.5183\nchristen.david@sunnova.com\nLogo - http://photos.prnewswire.com/prnh/20150318/182860LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/sunnova-closes-additional-financing-of-300-million-300164303.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/sunnova-closes-additional-financing-of-300-million-300164303.html", "http://photos.prnewswire.com/prnvar/20150318/182860LOGO", "http://www.xmlnews.org/ns/", "http://www.sunnova.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA35270&Transmission_Id=201510220730PR_NEWS_USPR_____DA35270&DateId=20151022", "http://photos.prnewswire.com/prnh/20150318/182860LOGO"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T19:29:29.850+03:00", "highlightTitle": ""}