{"organizations": [], "uuid": "54dd8956c96ddb78138e6d7c454567bc9f6ba3a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.odt.co.nz", "main_image": "", "site_section": "http://www.odt.co.nz/news/politics/feed", "section_title": "Otago Daily Times Online News - Politics", "url": "http://www.odt.co.nz/news/politics/359160/govt-scraps-redundant-legislation", "country": "NZ", "title": "Govt scraps redundant legislation", "performance_score": 0, "site": "odt.co.nz", "participants_count": 0, "title_full": "Govt scraps redundant legislation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:57:00.000+03:00", "replies_count": 0, "uuid": "54dd8956c96ddb78138e6d7c454567bc9f6ba3a4"}, "author": "", "url": "http://www.odt.co.nz/news/politics/359160/govt-scraps-redundant-legislation", "ord_in_thread": 0, "title": "Govt scraps redundant legislation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News: Politics \nThe Government is scrapping 120 redundant laws, ranging from the Rugby World Cup 2011 legislation to laws providing funding for royal visits. \nThe laws were now superfluous, Regulatory Reform Minister Steven Joyce said, and the tidy-up would remove about one tenth of the legislation on the books. \nMr Joyce and Act leader David Seymour are doing the purge as part of Act's confidence and supply agreement which included a Productivity Commission aimed at removing red tape. \nMany of the laws in question give an overview of New Zealand's history. They include authorisation to fund a post-war visit by King George VI and Queen Elizabeth, the Queen Mother, in the late 1940s - a visit that never went ahead because George fell ill and later died in 1952. \nAnother was special legislation for relief funding after the 1931 Hawkes Bay earthquake. \nOthers included a 1978 law dissolving the National Airways Corporation after it merged with Air New Zealand, and a 1987 law to abolish the Tobacco Board. \nThe market reforms of the Rogernomics years also feature - including the waterfront industry reforms of the late 1980s. \nOne of the more recent examples was the law for the Rugby World Cup 2011, which was hosted by New Zealand. About half of the 120 were finance acts. \nThe laws will be repealed by a piece of legislation. The draft bill has gone out for consultation to lawyers and the public to double-check the laws included in the purge were no longer needed and there would not be any unintended consequences from their repeal. \nReleasing a draft bill rather than waiting for public submissions in select committee was one of the recommendations of the Productivity Commission, Mr Seymour said. \n\"Utilising the collective wisdom of the public can ensure Bills and regulations are of a high standard.\" \nSome of the laws applied to specific events and were no longer needed because that event had passed, while others had been replaced by more modern legislation. \nIn cases where only one or two provisions of the law still applied, those provisions would be transferred to be covered by other laws. \n- By Claire Trevett of the New Zealand Herald", "external_links": [], "published": "2015-10-13T00:57:00.000+03:00", "crawled": "2015-10-13T04:33:59.568+03:00", "highlightTitle": ""}