{"organizations": [], "uuid": "52f3f4a88e6ebc2463ad8e3ba131c70261132cd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.vice.com", "main_image": "https://news-images.vice.com/images/articles/meta/2015/10/14/federal-court-clears-the-way-for-muslims-to-sue-the-nypd-1444847831.jpg?crop=0.6686159844054581xw:1xh;0.28460038986354774xw,0xh", "site_section": "https://news.vice.com/topic/politics", "section_title": "Politics | VICE News", "url": "https://news.vice.com/article/court-rules-that-muslims-can-sue-the-nypd-for-spying-on-them", "country": "US", "title": "Court Rules That Muslims Can Sue the NYPD for Spying on Them", "performance_score": 1, "site": "vice.com", "participants_count": 1, "title_full": "Court Rules That Muslims Can Sue the NYPD for Spying on Them | VICE News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "52f3f4a88e6ebc2463ad8e3ba131c70261132cd0"}, "author": "Avi Asher-Schapiro", "url": "https://news.vice.com/article/court-rules-that-muslims-can-sue-the-nypd-for-spying-on-them", "ord_in_thread": 0, "title": "Court Rules That Muslims Can Sue the NYPD for Spying on Them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In a strongly worded opinion that invoked discrimination against Jews as well as the United States government's internment of Japanese-Americans during World War II, a federal court has cleared the way for Muslims to sue the New York Police Department for spying on Muslim students, businesses, and mosques.\nThe ruling, issued by the Third US Circuit Court of Appeals in Philadelphia late on Tuesday, reversed a lower court's decision to throw out the case. Back in 2014, New Jersey district judge Judge William Martini dismissed the suit, Hassan v. City of New York , which was brought by a coalition of Muslims who accused the NYPD of spying on them without cause.\nThe lower court's controversial ruling found that the plaintiffs did not have legal standing to sue the NYPD, since the police claimed to be pursuing terrorists and did not explicitly single out people based on their religion. Martini also ruled that the plaintiffs could not show a causation between the NYPD's conduct and their claims of discrimination.\nThe Third Circuit rejected that logic and gave the lower court a brief history lesson.\n\"Today it is acknowledged... that the FDR Administration and military authorities infringed the constitutional rights of Japanese-Americans during World War II by placing them under curfew and removing them from their West Coast homes and into internment camps,\" Circuit Judge Thomas Ambro wrote in an opinion for a three-judge panel. \"Yet when these citizens pleaded with the courts to uphold their constitutional rights, we passively accepted the Government's representations.\"\nThe latest ruling will now return the case to the lower court for review on the merits of the case itself.\nRelated: The NSA's Racist Targeting of Individuals Is as Troubling as Indiscriminate Surveillance\nGlenn Katon, the legal director of the organization Muslim Advocates and one of the lawyers suing the city, said that the Third Circuit's ruling puts the NYPD on notice.\n\"The court made it clear that they aren't just an arm of the state here to rubber stamp whatever the city or police wants to do,\" he said. \"We know what happened the past when courts do not apply the Constitution.\"\nKaton hopes that the ruling will lay the groundwork for a court-ordered cessation of police spying on Muslim communities.\nUsing a trove of leaked documents, the Associated Press exposed the details of the NYPD's surveillance of Muslims in an award-winning investigation published in 2011. The series , written by Adam Goldman and Matt Apuzzo, revealed that in the wake of 9/11 the NYPD's Intelligence Division implemented broad surveillance of Muslims living in the NYC area, often without any reasonable suspicion of criminal activity.\nThe NYPD mapped out mosques and Muslim-owned businesses as it deployed undercover agents into the Muslim neighborhoods to build a detailed databases on community members. In the end, the AP found that the program did not produce a single investigative lead or terrorism conviction.\nThe pending lawsuit draws heavily on the AP investigation, and accuses the NYPD of singling out Muslims for special attention because of their faith.\nThe lead plaintiff is Syed Farhaj Hassan, a soldier who works in US Army intelligence. In the suit, he claimed that he had to stop going to his mosque because he knew that NYPD surveillance might mistakenly finger him as a terrorist — and he was afraid of losing his job.\n\"The NYPD's blanket surveillance of Muslims casts guilt on all people of that faith by suggesting that Muslims pose a special threat to public safety,\" the suit charged. According to the complaint, the NYPD spied on at least 20 mosques, 14 restaurants, 11 retail stores, two grade schools, and two Muslim student associations in New Jersey.\nRelated: Hijab-Wearing Potential Hire Wins Discrimination Suit Against Abercrombie & Fitch\n\"There is no Muslim exception to the Constitution,\" said Baher Azmy, legal director for the Center for Constitutional Rights, which represents the plaintiffs along with Muslim Advocates.\nMayor Bill de Blasio shut down the NYPD's demographics unit, the squad responsible for mapping Muslim communities, in 2014. But he's been cagey about the extent of current NYPD snooping, and his office has yet to comment on the merits of the lawsuit.\n\"At this stage, the issue is whether the NYPD in fact surveilled individuals and businesses solely because they are Muslim, something the NYPD has never condoned,\" New York City Law Department spokesperson Nick Paolucci said. \"Stigmatizing a group based on its religion is contrary to our values.\"\nWhen asked by VICE News if the practice could have gone on even without being officially \"condoned,\" city representatives said that they are \"reviewing\" the case. The NYPD did not respond to a request for comment.\nKaton isn't convinced that the NYPD has completely curtailed its mass surveillance of Muslims, so he's looking to the courts to intervene.\n\"The main thing we want is an injunction that the NYPD cannot spy on our clients unless they have a lead or actual reasons to believe they've done something wrong,\" he said. \"We want a judgment that says clearly that that practice is unconstitutional — that would be a powerful precedent.\"\nFor now, the Third Court's ruling has given some in the Muslim community a sense of validation over raising these concerns.\n\"What this tells me is that we are not just paranoid,\" said Linda Sarsour, director of the Arab American Association of New York. \"Muslims are not just making things up — surveillance is really impacting our community and has been impacting our community at least since 9/11.\"\nSarsour emphasized that there has yet to be a full reckoning of the NYPD's surveillance program.\n\"They did not close down the entire intelligence gathering apparatus that continues to monitor us,\" Sarsour said, though she's not sure about the extent of the program. The NYPD will not discuss it publicly.\nFollow Avi Asher-Schapiro on Twitter: @AASchapiro\nPhoto via Flickr", "external_links": ["http://www2.ca3.uscourts.gov/opinarch/141688p.pdf", "http://www.ap.org/Index/AP-In-The-News/NYPD"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-15T19:52:44.202+03:00", "highlightTitle": ""}