{"organizations": [], "uuid": "a10d89943143aa6e7e27c053fa5893a81b7f4418", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/current-events/50855-gun-violence-only-american-epidemic-we-legislatively-required-accept.html", "country": "US", "title": "Gun violence is the only American epidemic we are legislatively required to accept", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "Gun violence is the only American epidemic we are legislatively required to accept", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:38:00.000+03:00", "replies_count": 0, "uuid": "a10d89943143aa6e7e27c053fa5893a81b7f4418"}, "author": "LongWinded", "url": "http://defendingthetruth.com/current-events/50855-gun-violence-only-american-epidemic-we-legislatively-required-accept.html", "ord_in_thread": 0, "title": "Gun violence is the only American epidemic we are legislatively required to accept", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gun violence is the only American epidemic we are legislatively required to accept User Name Current Events Current Events Forum - Latest political news and events 2 Thanks Quote: . . . Only gun violence is subjected to federal laws, passed by cheap crooks and supported by the paranoid, requiring government to not even examine why these things are happening. If private planes were crashing into American public classrooms at the rate of one a week. you can damn well bet that the cable news networks would pee their tailored pants in alarm, and presidential contenders would be beside themselves with public fury demanding that something be done, and there would be select committees and all of the usual pomp that important men surround themselves with when they want to be seen as giving a damn. We would shut down the airports. We would demand inspections of each and every plane. We would, in short, do something. If elementary, middle, high school, or college students in America were constantly being killed on a classroom-by-classroom scale by crashing private planes, or monthly gas explosions, or a steady stream of ricin bombs, or packs of rabid wolves, or toxic pencil shavings, or ordinary crayons, or, yes, car accidents, heart attacks, or cancer, we would do something. We would do a lot of somethings; new laws, new safety requirements, new commissions, new investigations; we would keep doing them until we had made such incidents, at the very least, more rare than they used to be. The right to simply walk into any classroom in America and start murdering people, however, is specifically and conspicuously Protected. It may not be infringed in the slightest, says the NRA, which has predicated all their recent lobbying and promotional fearmongering on the explicit premise that what with the \"knockout game,\" and immigrants, and ISIS, and the government itself, their members may themselves find themselves in a position where they, too, need to murder large numbers of people at once and government shall not interfere with those preparations. This radicalwell, objectively insanepremise is cited even by sitting congressmen as the reason why the rest of America shall be prohibited from doing anything to prevent those mass murders. . . . On the reverse side, we can also vote out those who do nothing to stop these murders.", "external_links": [], "published": "2015-10-06T01:38:00.000+03:00", "crawled": "2015-10-06T10:46:08.917+03:00", "highlightTitle": ""}