{"organizations": [], "uuid": "53436655eb03682cc60616c6e8809c087899e5d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abqjournal.com", "main_image": "http://main.abqjournal.netdna-cdn.com/wp-content/uploads/2015/10/Mideast-Syria-Russia-400x230.jpg", "site_section": "http://www.abqjournal.com/category/politics", "section_title": "Politics | Albuquerque Journal News", "url": "http://www.abqjournal.com/658492/politics/did-u-s-weapons-supplied-to-syrian-rebels-draw-russia-into-the-conflict.html", "country": "US", "title": "Did U.S. weapons supplied to Syrian rebels draw Russia into the conflict?", "performance_score": 0, "site": "abqjournal.com", "participants_count": 1, "title_full": "Did U.S. weapons supplied to Syrian rebels draw Russia into the conflict? | Albuquerque Journal News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T07:05:00.000+03:00", "replies_count": 0, "uuid": "53436655eb03682cc60616c6e8809c087899e5d4"}, "author": "Liz Sly / The Washington Post", "url": "http://www.abqjournal.com/658492/politics/did-u-s-weapons-supplied-to-syrian-rebels-draw-russia-into-the-conflict.html", "ord_in_thread": 0, "title": "Did U.S. weapons supplied to Syrian rebels draw Russia into the conflict?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIRUT – American antitank missiles supplied to Syrian rebels are playing an unexpectedly prominent role in shaping the Syrian battlefield, giving the conflict the semblance of a proxy war between the United States and Russia, despite President Barack Obama’s express desire to avoid one.\nThe U.S.-made BGM-71 TOW missiles were delivered under a two-year-old covert program coordinated between the United States and its allies to help vetted Free Syrian Army groups in their fight against President Bashar al-Assad. Now that Russia has entered the war in support of Assad, they are taking on a greater significance than was originally intended.\nSo successful have they been in driving rebel gains in northwestern Syria that rebels call the missile the “Assad Tamer,” a play on the word Assad, which means lion. And in recent days they have been used with great success to slow the Russian-backed offensive aimed at recapturing ground from the rebels.\nSince Wednesday, when Syrian troops launched their first offensive backed by the might of Russia’s military, dozens of videos have been posted on YouTube showing rebels firing the U.S.-made missiles at Russian-made tanks and armored vehicles belonging to the Syrian army. Appearing as twirling balls of light, they zigzag across the Syrian countryside until they find and blast their target in a ball of flame.\nThe rebels claim they took out 24 tanks and armored vehicles on the first day, and the toll has risen daily since then.\n“It was a tank massacre,” said Capt. Mustafa Moarati, whose Tajamu al-Izza group says it destroyed seven tanks and armored vehicles Wednesday.\nMore missiles are on the way, he said. New supplies arrived after the Russian deployments began, he said, and the rebels’ allies have promised further deliveries soon, bringing echoes of the role played by U.S.-supplied Stinger antiaircraft missiles in forcing the Soviet Union to withdraw from Afghanistan in the 1980s.\nThe hits also plunged Washington into what amounts to a proxy war of sorts with Moscow, despite Obama’s insistence this month that “we’re not going to make Syria into a proxy war between the United States and Russia.”\n“It’s a proxy war by happenstance,” said Jeff White of the Washington Institute for Near East Policy, who counted at least 15 tanks and vehicles destroyed or disabled on one day. “The rebels happen to have a lot of TOWs in their inventory. The regime happened to attack them with Russian support. I don’t see it as a proxy war by decision.”\nWhether it becomes one or not is one of the key questions confronting the Obama administration in the wake of President Vladimir Putin’s decision to throw Russia’s support behind Assad’s regime.\nThe TOW missile program overseen by the CIA is entirely separate from a failed program run by the Pentagon that was intended to influence the outcome of the other war being waged in Syria, the one in the northeastern part of the country against the Islamic State.\nThe CIA program got underway before the Pentagon one, in early 2014, with the goal of propping up the flagging rebellion against Assad’s rule by delivering training, small arms, ammunition and the antitank missiles, which have proved instrumental in eroding the government’s key advantage over the lightly armed rebel force – its tanks and heavy armor.\nSupplied mostly from stocks owned by Saudi Arabia, delivered across the Turkish border and stamped with CIA approval, the missiles were intended to fulfill another of the Obama administration’s goals in Syria – Assad’s negotiated exit from power. The plan, as described by administration officials, was to exert sufficient military pressure on Assad’s forces to persuade him to compromise – but not so much that his government would precipitously collapse and leave a dangerous power vacuum in Damascus.\nInstead, the Russian military intervened to shore up the struggling Syrian army – an outcome that was not intended.\n“A primary driving factor in Russia’s calculus was the realization that the Assad regime was militarily weakening and in danger of losing territory in northwestern Syria. The TOWs played an outsize role in that,” said Oubai Shahbandar, a Dubai-based consultant who used to work with the Syrian opposition.\n“I think even the Americans were surprised at how successful they’ve been,” he added.\nIt was no accident, say U.S. officials and military analysts, that the first targets of Russian airstrikes in Syria were the locations where the rebels armed with TOW missiles have made the most substantial gains and where they most directly threaten Assad’s hold over his family’s heartland in the coastal province of Latakia.\nThose areas were also where the first offensive since the Russian intervention was launched, with columns of Syrian armored vehicles and tanks setting out from government strongholds into the countryside of the provinces of Hama and Idlib.\nWhat the TOWs have done, White said, is “offset the regime’s advantage in armor. The TOWs have cut away at that edge, and that’s what we’ve seen playing out. It’s like the Stingers in Afghanistan.”\nIt is unclear whether the TOWs will be able to change the course of the war, as did the Stinger antiaircraft missiles introduced in the 1980s by the CIA in Afghanistan, where they were used by the mujahideen to shoot down Russian helicopters and paralyze the Soviet army.\nNow that the Russians have introduced more intensive and heavier airstrikes and, for the first time, combat helicopters seen in videos strafing villages in the Hama area, the TOW missiles may only be able to slow, but not block, government advances.\nThe rebels have appealed for the delivery of Stinger missiles or their equivalents to counter the new threat from the air, but U.S. officials say that is unlikely. The Obama administration has repeatedly vetoed past requests from the rebels, as well as their Turkish and Saudi allies, for the delivery of antiaircraft missiles, out of concerns that they could fall into extremist hands.\nBut the TOW missile program is already in progress, and all the indications are that it will continue. Saudi Arabia, the chief supplier, has pledged a “military” response to the Russian incursion, and rebel commanders say they have been assured more will arrive imminently.\nUnder the terms of the program, the missiles are delivered in limited quantities, and the rebel groups must return the used canisters to secure more, to avoid stockpiling or resale.\nThe system appears to have helped prevent the missiles from falling into extremist hands. Robert Ford, who was serving as U.S. envoy to Syria when the program got underway, said he was aware of only two TOWs obtained by the al-Qaida affiliate Jabhat al-Nusra, while “dozens and dozens” have been fired by moderate groups.\n“Nusra made a big public display of having these two missiles,” said Ford, who is now a fellow at the Middle East Institute. Had they acquired more, he said, “they would be using them now.”\nThe supplies of the missiles, manufactured by Raytheon, are sourced mainly from stocks owned by the Saudi government, which purchased 13,795 of them in 2013, for expected delivery this year, according to Department of Defense documents informing Congress of the sale. Because end-user agreements require that the buyer inform the United States of their ultimate destination, American approval is implicit, said Shahbandar, a former Pentagon adviser.\nBut no decision is required from the Obama administration for the program to continue, Shahbandar said. “It doesn’t need an American green light. A yellow light is enough,” he said. “It’s a covert effort and it’s technically deniable, but that’s what proxy wars are.”", "external_links": [], "published": "2015-10-12T07:05:00.000+03:00", "crawled": "2015-10-12T09:28:07.273+03:00", "highlightTitle": ""}