{"organizations": [], "uuid": "27e6e7f7dc95bc33f94c738f5c66e79591d22ab9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wnd.com", "main_image": "http://www.wnd.com/files/2015/10/LinconWHSite.jpg", "site_section": "http://www.wnd.com/category/front-page/politics/feed/#", "section_title": "WND » Politics", "url": "http://www.wnd.com/2015/10/harbinger-man-brings-a-message-of-hope/", "country": "US", "title": "'Harbinger Man' brings a message of hope", "performance_score": 0, "site": "wnd.com", "participants_count": 1, "title_full": "'Harbinger Man' brings a message of hope", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T04:07:00.000+03:00", "replies_count": 0, "uuid": "27e6e7f7dc95bc33f94c738f5c66e79591d22ab9"}, "author": "-NO AUTHOR-", "url": "http://www.wnd.com/2015/10/harbinger-man-brings-a-message-of-hope/", "ord_in_thread": 0, "title": "'Harbinger Man' brings a message of hope", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Harbinger Man' brings a message of hope New documentary film on Jonathan Cahn premieres Published: 9 mins ago Text smaller Text bigger \nJonathan Cahn is known as “America’s Prophet.” But the subject of the blockbuster new documentary “The Harbinger Man,” premiering Friday, is sometimes characterized as a preacher of doom. \nWND Founder and CEO Joseph Farah argues that couldn’t be further from the truth. \nSummarizing Cahn’s message, Farah says: “If God’s people, called by His name, would humble themselves and pray and seek His face, He would do these things: hear their prayers, forgive their sin, and heal their land. In other words, God was not expecting or demanding everyone to follow Him, just His kids, just His children, just the believers. Therefore, it is the believers who have this special responsibility. It is they who hold the key to the healing of our land. \n“That’s the really good news Jonathan Cahn brings to us. It’s up to us; it’s up to believers to do this and do it now. Is that too much to expect?” \nMany believers don’t think so. Cahn has become one of the most influential forces in American Christianity, known around the world for authoring “The Harbinger,” which remained on the New York Times bestseller list for more than 100 weeks. He also introduced millions to “The Mystery of the Shemitah,” the seven-year cycle outlined in the Bible which mysteriously corresponds with major geopolitical events and dramatic developments in the American economy. \nAt the center of Cahn’s speeches and writings is a powerful call to repentance directed at American Christians. Cahn believes the reason his message has spread so far isn’t because of anything he has done. \nInstead, he argues, the credit belongs entirely to God. \nCahn says God is saying, “This is my hand, this is my doing.” He believes the message of “The Harbinger” was sent out by God, because, in Cahn’s words, “He is a God of compassion, a God of salvation, and He warns because He acts.” \nThis warning has spread all the way to the top of the American political system. \n“When people first heard the message, they said, ‘This has got to go to Washington,’” Cahn recalled. “This has got to go to the president. Well, it just seems to have happened by God that the word has gone to Washington. I’ve been called to Washington several times. Members of Congress, senators, presidential candidates who have either read ‘The Harbinger,’ who are handing out ‘The Harbinger,’ , who have alluded to ‘The Harbinger,’ , who take it very seriously, it’s affected them. I don’t know if it’s gone to the White House or not, but I know it’s gone to Congress.” \nThis is fitting because the message of “The Harbinger” is intricately tied with the leadership of the United States. \n“There’s been a connection with ‘The Harbinger’ to national leaders in Washington and political leaders from the beginning,” Cahn said. “Several of the harbingers involve American leaders. The pronouncing of the vows over the stone at New York City. Some of the things that were said that launched the building of that tower. The actual eighth and ninth harbinger that involve national leaders proclaiming this judgment on America. The president of the United States is part of it.” \n“The Harbinger Man” specifically cites Barack Obama declaring in a speech, “We will rebuild, we will recover, and the United States of America will emerge stronger than ever.” \nIn contrast to these words of defiance, Cahn recalled what he spoke at the Inaugural Prayer Breakfast in January 2013 for the occasion of President Obama’s second inaugural. \n“We have forgotten God,” Cahn preached. \nEchoing an earlier speech by President Abraham Lincoln, Cahn intoned: “We have forgotten the gracious hand who preserved us in peace and multiplied and enriched and strengthened us. It behooves us then to humble ourselves before the offended power. To confess our national sins and to pray for clemency and forgiveness.” \nDrawing a parallel between America’s present social chaos and the trial the nation experienced during the War Between the States, Cahn stated at the time: “Lincoln sent forth this call to America to repent, to return to God, to seek his mercy, and soon after that call went forth, the tide of war began to turn and it would eventually lead to national healing. \n“The words of Abraham Lincoln ring out to us today. That those nations only are blessed whose God is the Lord. Has this nation grown so far from God that we cannot even imagine a president doing so today?” \nAddressing Obama, Cahn thundered, “Mr. President, if you seek, if you look to Lincoln as your model, then dare to follow him in his actions.” \nCahn remembered how he was sick before the speech and hadn’t slept in days. Again, he gave credit to God for bringing him to the capital to speak on the occasion and allowing him to say what the nation needed to hear. \n“The same time the inauguration was happening, this was happening, which I believe was a prophetic word and which I believe was because the Lord wanted a prophetic word in Washington on the day of that inauguration,” Cahn commented. “So there is this continual thing that goes back to the biblical principle, that God sends his warning almost always to kings, and to thrones, and to powers. \n“Prophetic words are often brought to leaders, brought to kings, brought to thrones, speaking to powers, happens again and again, from Moses and Pharaoh to Jeremiah. So I believe that’s part of it because the leaders represent the nation.” \nLooking back on his life, Cahn feels he was destined to serve as a kind of watchman. \n“Now, in my life, there’s always been this thing about trumpets,” said Cahn. “Now, what are trumpets but the sounding of the alarm? But it’s always come up throughout my life. It’s the sound of the watchman sounding the alarm. And that’s what ‘The Harbinger,’ and the ‘Shemitah,’ and the whole thing is, is sounding the alarm.” \nLike all Jewish children, Cahn was circumcised as an infant, which is supposed to be the occasion when Jews enter the covenant with God. He recalled, laughing, how the day he was circumcised actually fell on the Jewish Feast of the Trumpets. It also came during the peak of the Shemitah, and was accompanied by a solar eclipse. \n“It’s way back, but it’s almost like all these themes are in the messages,” Cahn marveled. \nLooking back on Cahn’s incredible journey and his message of repentance, Farah judged, “This is not a dire prediction of doom, it’s our hope.” \nAnd ultimately, he believes “The Harbinger Man” contains a powerful message for all Christians. \nWith the film now available for sale, some viewers are getting their own first look. And at least some of them enthusiastically agree. \n“I just watched ‘The Harbinger Man,’” one reader wrote. “I’m not going to attempt to comment on it because no words will do it justice. I’ve never seen you [Joseph Farah] get emotional, but the last few words of your introduction were filled with emotion. And that’s how I am now – filled with emotion.” \nWhat prompted this reader’s reaction? Farah stated: “My heart wants all believers to hear this message, and to know and love Jonathan Cahn the way I have come to know him, love him, and be thankful for him. He doesn’t call himself a prophet. But if he is not a prophet for our time, then I don’t know the definition of a prophet.” \nBut Cahn says he is just doing what he was meant to do. Reflecting on a life seemingly filled with miracles, he simply pronounced, “I don’t believe there’s any accidents with God.” \nSee the “Harbinger Man” trailer:", "external_links": [], "published": "2015-10-17T04:07:00.000+03:00", "crawled": "2015-10-17T04:20:29.846+03:00", "highlightTitle": ""}