{"organizations": [], "uuid": "ba9dcb78ca91f3bb5f84021dd50206e031a8465f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30320394/bernstein-litowitz-berger-grossmann-llp-announces-securities-class-action-suit-filed-against-pier-1-imports-inc-and-certain-of-its-senior-executives", "country": "US", "title": "Bernstein Litowitz Berger & Grossmann LLP Announces Securities Class Action Suit Filed Against Pier 1 Imports, Inc. And Certain Of Its Senior Executives", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bernstein Litowitz Berger & Grossmann LLP Announces Securities Class Action Suit Filed Against Pier 1 Imports, Inc. And Certain Of Its Senior Executives - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba9dcb78ca91f3bb5f84021dd50206e031a8465f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30320394/bernstein-litowitz-berger-grossmann-llp-announces-securities-class-action-suit-filed-against-pier-1-imports-inc-and-certain-of-its-senior-executives", "ord_in_thread": 0, "title": "Bernstein Litowitz Berger & Grossmann LLP Announces Securities Class Action Suit Filed Against Pier 1 Imports, Inc. And Certain Of Its Senior Executives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Bernstein Litowitz Berger & Grossman LLP\nNEW YORK , Oct. 21, 2015 /PRNewswire/ -- Bernstein Litowitz Berger & Grossmann LLP (\"BLB&G\") today announced that it filed a securities class action lawsuit on behalf of its client Town of Davie Police Pension Plan (\" Davie Police \") against Pier 1 Imports, Inc. (\"Pier 1\" or the \"Company\") (NYSE: PIR), and certain of its senior executives (collectively \"Defendants\"). The action, which is captioned Town of Davie Police Pension Plan v. Pier 1 Imports, Inc., et al. , No. 3:15-cv-03415 ( N.D. Tex .), asserts claims under Sections 10(b) and 20(a) of the Securities Exchange Act of 1934 (the \"Exchange Act\"), 15 U.S.C. §§ 78j(b) and 78t(a), and SEC Rule 10b-5 promulgated thereunder, 17 C.F.R. § 240.10b-5, on behalf of investors who purchased or otherwise acquired Pier 1 common stock during the period from December 19, 2013 to September 24, 2015 , inclusive (the \"Class Period\").\nThis case was filed as a related action to Kenney v. Pier 1 Imports, Inc., et al. , No. 3:15-cv-02798 ( N.D. Tex .) (\" Kenney \"), the first-filed securities class action in this matter, which is presently pending before the Honorable Sidney A. Fitzwater. Pursuant to the notice published on August 27, 2015 in connection with the filing of the Kenney action pursuant to the Private Securities Litigation Reform Act of 1995, investors wishing to serve as the lead plaintiff are required to file a motion for appointment as lead plaintiff by no later than October 26, 2015 .\nThe Complaint alleges that during the Class Period, Pier 1 and certain of its senior executives violated provisions of the Exchange Act by issuing false and misleading press releases, financial statements, filings with the Securities and Exchange Commission (\"SEC\"), and statements during investor conference calls. Based in Fort Worth, Texas , Pier 1 is a retailer of decorative home furnishings and gifts imported from countries around the world. Although Pier 1 has traditionally been a \"brick and mortar\" retailer, during fiscal year 2013, the Company began to aggressively grow and develop online sales of its products. To that end, Pier 1 launched a new e-commerce website, Pier1.com, as part of its \"1 Pier 1\" omni-channel initiative that sought to turn the Company from an in-store retailer to a combined in-store and online retailer.\nAs alleged in the Complaint, throughout the Class Period, Defendants misrepresented the success of \"1 Pier 1\" and issued earnings guidance that reflected significant growth, which it attributed, in large part, to its burgeoning e-commerce business. As months passed and costs associated with the implementation of \"1 Pier 1\" began to mount, the Company continued to misrepresent the success of its e-commerce initiative and assured investors that the Company was well-positioned to handle the higher levels of inventory needed to support the growth strategy, and that increased inventories would not result in discounting of merchandise or lower margins. As a result of these misrepresentations, Pier 1 stock traded at artificially inflated prices during the Class Period.\nOn February 10, 2015 , the Company sharply reduced its financial guidance for the fiscal year ending February 28, 2015 , which the Company attributed to softer than expected sales in January and February 2015 and \"unplanned\" expenses, primarily related to supply chain costs associated with the \"1 Pier 1\" initiative. Pier 1 also announced that the Company's Chief Financial Officer Charles H. Turner had suddenly \"retired.\" Then, on September 24, 2015 , the Company significantly reduced its earnings guidance for fiscal 2016, which Pier 1 attributed to margin pressures from increased promotional and clearance activity, as well as inventory related issues within its distribution center network. These disclosures caused a material decline in the price of Pier 1 stock. The Complaint filed on behalf of Davie Police expands upon the Kenney action by alleging, among other things, that the full truth concerning the Defendants' misrepresentations was not disclosed until September 24, 2015 , the end of the alleged Class Period.\nDavie Police is represented by BLB&G, a firm of over 100 attorneys with offices in New York , California , Louisiana , and Illinois. If you wish to discuss this Action or have any questions concerning this notice or your rights or interests, please contact Avi Josefson of BLB&G at 212-554-1493, or via e-mail at avi@blbglaw.com .\nSince its founding in 1983, BLB&G has built an international reputation for excellence and integrity. Specializing in securities fraud, corporate governance, shareholders' rights, employment discrimination, and civil rights litigation, among other practice areas, BLB&G prosecutes class and private actions on behalf of institutional and individual clients worldwide. Unique among its peers, BLB&G has obtained several of the largest and most significant securities recoveries in history, recovering billions of dollars on behalf of defrauded investors. More information about BLB&G can be found online at www.blbglaw.com .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/bernstein-litowitz-berger--grossmann-llp-announces-securities-class-action-suit-filed-against-pier-1-imports-inc-and-certain-of-its-senior-executives-300164308.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY35251&Transmission_Id=201510211823PR_NEWS_USPR_____NY35251&DateId=20151021", "http://www.prnewswire.com/news-releases/bernstein-litowitz-berger--grossmann-llp-announces-securities-class-action-suit-filed-against-pier-1-imports-inc-and-certain-of-its-senior-executives-300164308.html", "http://www.xmlnews.org/ns/"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T03:18:33.211+03:00", "highlightTitle": ""}