{"organizations": ["Republican", "CNBC", "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Trump", "GOP", "Republican National Committee", "CNN"], "uuid": "f1f59a9427d938291b8e40a123ce40c4e4da5e43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151012142920-donald-trump-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/15/politics/trump-carson-cnbc-republican-debate-threaten-pullout/index.html?eref=rss_politics", "country": "US", "title": "Trump, Carson threaten to boycott next GOP debate", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Trump, Carson threaten to boycott next GOP debate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:56:00.000+03:00", "replies_count": 0, "uuid": "f1f59a9427d938291b8e40a123ce40c4e4da5e43"}, "author": "", "url": "http://edition.cnn.com/2015/10/15/politics/trump-carson-cnbc-republican-debate-threaten-pullout/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Trump, Carson threaten to boycott next GOP debate", "locations": ["Boulder", "Colorado"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul", "Carson", "Donald J. Trump", "Lewandowski", "Ted Cruz", "Donald Trump", "Trump", "Ben Carson", "Corey Lewandowski", "Chris LaCivita"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> <div id=\"ad_bnr_atf_01\" class=\"ad-ad_bnr_atf_01 ad-refresh-adbanner\"></div> Trump, Carson threaten to boycott next GOP debate Updated 1147 GMT (1847 HKT) October 16, 2015 JUST WATCHED Candidates say the debate can't be over 2 hours The next GOP faceoff is Oct. 28, hosted by CNBC (CNN) Republican front-runners Donald Trump and Ben Carson are threatening to pull out of the next Republican primary debate if the hosts don't agree to their demands. In a letter to CNBC, which is hosting the next debate, the two candidates said they would not participate in the Oct. 28 debate \"if it is longer than 120 minutes including commercials and does not include opening and closing statements.\" Early Friday morning, Trump tweeted that CNBC had agreed to limit the debate to two hours. \"Fantastic news for all, especially the millions of people who will be watching!\" Trump said. Thursday, in a conference call between Republican National Committee officials and top advisers to the presidential campaigns, Trump campaign manager Corey Lewandowski had said that Trump would consider skipping the debate if his terms were not met. Read More Top aides to Senators Ted Cruz and Rand Paul also insisted that the debate feature opening and closing statements, with Paul aide Chris LaCivita saying at one point that CNBC could \"go f--- themselves\" if they weren't willing to agree to those terms, according to two sources on the call. The demand for opening and closing statements reflects the candidates' interest in getting their messages out unchallenged. The demand for a two-hour debate comes in the wake of CNN's decision to extend the previous GOP debate to three hours, leaving some of the candidates visibly exhausted. But were CNBC to agree to a two-hour broadcast, including commercials, with opening and closing statements, it would limit the actual debate time to less than 90 minutes -- a short period of time considering that 10 or more GOP hopefuls are likely to appear on stage for the main event. 17 photos: Top quotes from the Republican debate 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 photos: Top quotes from the Republican debate Hide Caption 17 of 17 One source who was on the call said it was clear from Lewandowski's remarks that Trump had no interest in participating in the CNBC debate, which will be held in Boulder, Colorado. In a statement, CNBC said, \"Our goal is to host the most substantive debate possible. Our practice in the past has been to forego opening statements to allow more time to address the critical issues that matter most to the American people. We started a dialogue yesterday with all of the campaigns involved and we will certainly take the candidates' views on the format into consideration as we finalize the debate structure.\" Trump took to Twitter on Thursday to protest the terms of the debate. \"The @GOP should not agree to the ridiculous debate terms that @CNBC is asking unless there is a major benefit to the party,\" he wrote. The @GOP should not agree to the ridiculous debate terms that @CNBC is asking unless there is a major benefit to the party. — Donald J. Trump (@realDonaldTrump) October 15, 2015 \".@CNBC is pushing the @GOP around by asking for extra time (and no criteria) in order to sell more commercials,\" he continued. \"Why is the @GOP being asked to do a debate that is so much longer than the just-aired and very boring #DemDebate?\" . @CNBC is pushing the @GOP around by asking for extra time (and no criteria) in order to sell more commercials. — Donald J. Trump (@realDonaldTrump) October 15, 2015 Why is the @GOP being asked to do a debate that is so much longer than the just-aired and very boring #DemDebate ?", "external_links": [], "published": "2015-10-16T14:56:00.000+03:00", "crawled": "2015-10-16T15:01:23.384+03:00", "highlightTitle": ""}