{"organizations": [], "uuid": "9c5518cd55bdb5e01fa2f86b1afffef1b4460049", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30247834/join-the-duck-fight-for-a-cure-this-october-with-aflacs-this-duck-wears-pink-breast-cancer-campaign", "country": "US", "title": "Join the Duck, Fight for a Cure this October with Aflac's 'This Duck Wears Pink' Breast Cancer Campaign", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Join the Duck, Fight for a Cure this October with Aflac's 'This Duck Wears Pink' Breast Cancer Campaign - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "9c5518cd55bdb5e01fa2f86b1afffef1b4460049"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30247834/join-the-duck-fight-for-a-cure-this-october-with-aflacs-this-duck-wears-pink-breast-cancer-campaign", "ord_in_thread": 0, "title": "Join the Duck, Fight for a Cure this October with Aflac's 'This Duck Wears Pink' Breast Cancer Campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Aflac\nFundraising efforts support partnership with the American Association for Cancer Research\nCOLUMBUS, Ga. , Oct. 13, 2015 /PRNewswire/ -- Aflac, the leading provider of voluntary insurance at the work site in the United States , announced today that its national \"This Duck Wears Pink\" campaign will run for the second year throughout the month of October – National Breast Cancer Awareness Month. Aflac is committed to the prevention and treatment of breast cancer through research, education and funding in collaboration with the American Association for Cancer Research (AACR).\nTo support the cause, consumers can visit www.thisduckwearspink.com to make a tax-deductible donation directly or to purchase pink-themed Aflac Duck merchandise, with 100 percent of net proceeds being donated to the AACR. Fans can also show their support by engaging with the Aflac Duck on Facebook , Twitter and Instagram using the hashtag #thisduckwearspink throughout the month of October.\n\"As highlighted in the recently released AACR Cancer Progress Report 2015 , cancer continues to be an enormous public health challenge and there is a growing need for cancer research,\" said Mitch Stoller , executive director of the AACR. 1 \"We are grateful for Aflac's committed partnership and generous investments toward breast cancer research demonstrated through continuing its 'This Duck Wears Pink' campaign again this year.\"\nIn its first year, Aflac raised nearly $70,000 in one month from sales of the much-loved pink plush Aflac Duck in support of its \"This Duck Wears Pink\" initiative and the AACR. This year, new branded merchandise is available for purchase, including:\nA 6-inch plush duck sporting an Aflac-branded pink hat, a pink ribbon on its chest, and two pink and white pom-poms to help spread cheer to breast cancer survivors and supporters. An updated hat and T-shirt, rubber wristbands and more. \"Because so many of Aflac's employees, agents and policyholders are impacted every year by breast cancer, it was a natural next step for the company to expand our steadfast support of childhood cancer into a pink initiative,\" said Keith Pellerin , vice president of Product Management and Innovation at Aflac. \"We are proud to have the Aflac Duck to partner with the American Association for Cancer Research to support such a passionate group of cancer survivors and their loved ones as we all rally together again this October to fight for a cure.\"\nAflac was founded upon its flagship cancer insurance policy and has been committed to the fight against cancer for the past 20 years, donating more than $100 million to fund childhood cancer treatment and research. Families across the country continue to be impacted firsthand by unexpected cancer diagnoses every day. To hear a real Aflac story from policyholder and breast cancer survivor Celia, click here .\nTo purchase merchandise, donate to the cause or learn more, please visit www.thisduckwearspink.com .\nAbout the American Association for Cancer Research\nFounded in 1907, the American Association for Cancer Research (AACR) is the world's oldest and largest professional organization dedicated to advancing cancer research and its mission to prevent and cure cancer. AACR membership includes more than 35,000 laboratory, translational, and clinical researchers; population scientists; other health care professionals; and cancer advocates residing in 97 countries. The AACR marshals the full spectrum of expertise of the cancer community to accelerate progress in the prevention, biology, diagnosis, and treatment of cancer by annually convening more than 20 conferences and educational workshops, the largest of which is the AACR Annual Meeting with over 18,000 attendees. In addition, the AACR publishes eight peer-reviewed scientific journals and a magazine for cancer survivors, patients, and their caregivers. The AACR funds meritorious research directly as well as in cooperation with numerous cancer organizations. As the Scientific Partner of Stand Up To Cancer, the AACR provides expert peer review, grants administration, and scientific oversight of team science and individual grants in cancer research that have the potential for near-term patient benefit. The AACR actively communicates with legislators and policymakers about the value of cancer research and related biomedical science in saving lives from cancer. For more information about the AACR, visit www.AACR.org .\nAbout Aflac\nWhen a policyholder gets sick or hurt, Aflac pays cash benefits fast. For six decades, Aflac insurance policies have given policyholders the opportunity to focus on recovery, not financial stress. In the United States , Aflac is the leading provider of voluntary insurance at the work site. Through its trailblazing One Day Pay SM initiative, Aflac U.S. can receive, process, approve and disburse payment for eligible claims in one business day. In Japan , Aflac is a leading provider of medical and cancer insurance and insures 1 in 4 households. Aflac individual and group insurance products help provide protection to more than 50 million people worldwide. For nine consecutive years, Aflac has been recognized by Ethisphere magazine as one of the World's Most Ethical Companies. In 2015, Fortune magazine recognized Aflac as one of the 100 Best Companies to Work For in America for the 17 th consecutive year. Also, in 2015, Fortune magazine included Aflac on its list of Most Admired Companies for the 14th time, ranking the company No. 1 in innovation for the insurance, life and health category. Aflac Incorporated is a Fortune 500 company listed on the New York Stock Exchange under the symbol AFL. To find out more about Aflac and One Day Pay SM , visit aflac.com or espanol.aflac.com.\n1 American Association for Cancer Research, AACR Cancer Progress Report 2015 – accessed Sept. 30, 2015 - http://cancerprogressreport.org/2015/Documents/AACR_CPR2015.pdf\nMedia contact – Kristen Fraser , 706.243.5543 or mediarelations@aflac.com\nAnalyst and investor contact – Robin Y. Wilkey , 706.596.3264 or 800.235.2667, FAX: 706.324.6330, or rwilkey@aflac.com .\nVideo - http://www.youtube.com/watch?v=ypWTkxJ-ECk&feature=youtu.be\nPhoto - http://photos.prnewswire.com/prnh/20151012/276248\nLogo - http://photos.prnewswire.com/prnh/20151012/276250LOGO\n releases/join-the-duck-fight-for-a-cure-this-october-with-aflacs-this-duck-wears-pink-breast-cancer-campaign-300158661.html\n ", "external_links": ["https://youtu.be/ypWTkxJ-ECk", "http://www.xmlnews.org/ns/", "http://www.thisduckwearspink.com/", "https://photos.prnewswire.com/prnvar/20151012/276250LOGO", "http://cancerprogressreport.org/2015/Documents/AACR_CPR2015.pdf", "https://twitter.com/aflacduck", "http://cancerprogressreport.org/Pages/default.aspx", "http://www.youtube.com/watch?v=ypWTkxJ-ECk?version=3", "http://www.youtube.com/watch?v=ypWTkxJ-ECk", "https://instagram.com/aflacduck/", "http://www.aacr.org/", "http://www.prnewswire.com/news-releases/join-the-duck-fight-for-a-cure-this-october-with-aflacs-this-duck-wears-pink-breast-cancer-campaign-300158661.html", "https://www.facebook.com/aflacduck", "http://photos.prnewswire.com/prnh/20151012/276250LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL26305&Transmission_Id=201510130923PR_NEWS_USPR_____CL26305&DateId=20151013", "http://photos.prnewswire.com/prnh/20151012/276248", "https://photos.prnewswire.com/prnvar/20151012/276248"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T17:28:15.996+03:00", "highlightTitle": ""}