{"organizations": ["KVUE", "Facebook Email Twitter Google", "WFAA"], "uuid": "175031ff61f0364408c53d0f979af13f54c52169", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kvue.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/e1d78d18d18c0e71d5c7c4a0350b598687f50fe1/c=0-50-534-352/local/-/media/2015/07/24/KVUE/KVUE/635733260756345470-635732687016778862-trump.JPG", "site_section": "http://rssfeeds.kvue.com/_/20/106058666/kvue/politics", "section_title": "KVUE - Politics", "url": "http://www.kvue.com/story/news/politics/2015/10/07/in-texas-trump-both-popular-and-vilified/73548554/", "country": "US", "title": "In Texas, Trump both popular and vilified", "performance_score": 0, "site": "kvue.com", "participants_count": 0, "title_full": "In Texas, Trump both popular and vilified", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:06:00.000+03:00", "replies_count": 0, "uuid": "175031ff61f0364408c53d0f979af13f54c52169"}, "author": "", "url": "http://www.kvue.com/story/news/politics/2015/10/07/in-texas-trump-both-popular-and-vilified/73548554/", "ord_in_thread": 0, "title": "In Texas, Trump both popular and vilified", "locations": ["Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Wiggins", "Donald Trump", "Trump"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest In Texas, Trump both popular and vilified Despite countless predictions of his impending decline, Donald Trump continues to top the polls among Republican presidential primary voters across the nation. Now he's expanding his campaign into Texas. Post to Facebook In Texas, Trump both popular and vilified Despite countless predictions of his impending decline, Donald Trump continues to top the polls among Republican presidential primary voters across the nation. Now he's expanding his campaign into Texas.  //kvue.tv/1RuKCoN   In Texas, Trump both popular and vilified Mark Wiggins, KVUE 10:06 p.m. CDT October 7, 2015 Donald Trump during his visit to Texas on July 23 (Photo: WFAA) CONNECT TWEET   Despite countless predictions of his impending decline, Donald Trump continues to top the polls among Republican presidential primary voters across the nation. Now he's expanding his campaign into Texas, where he's both popular and vilified. \nAt pi単ata stores across Austin, the usual ghosts and skeletons of fall are making room for a new face. At Pi単ata Party Palace, Ashley Chavez says it began with a request from a single customer which led the store owner to order 10 custom Donald Trump pi単atas from Mexico. \n\"Everybody started buying them, so he ordered 50 more, and it is the number one selling pi単ata in our store right now,\" said Chavez. The store now offers at least four different variations, each with its own take on the billionaire and reality television star's hair. The reason for the popularity? \n\"They want to beat him up,\" said Chavez. \nWith his calls for a border wall and mass deportation, Trump has courted controversy since referring to immigrants as \"rapists\" during his campaign kickoff. Shortly afterward, he was met with protests at the Texas-Mexico border. Yet the latest Texas Lyceum Poll showed Trump leading with 21 percent of Texas Republicans. \n\"I think the polling that you're seeing is a reflection of the strength he's had nationally,\" said Republican consultant Matt Mackowiak. \"It's a reflection of the huge media attention he's gotten over the past three or four months.\" \nThis weekend's Saturday Night Live cold open was just the latest example of Trump winning the free media primary. According to the New York Times and Washington Post , Trump has spent just $2 million on the presidential primary so far -- a fraction of the nearly $20 million spent by Democratic contender Hillary Clinton. \nTrump has also appointed a new state director for Texas, who despite reportedly calling Trump \"a joke\" in August, posted an enthusiastic tweet last week. Could it all augur ill for favorite son Sen. Ted Cruz (R-TX), who is trailing Trump by five points in his home state? \n\"Cruz is still in very strong shape in Texas,\" said Mackowiak, noting Cruz's strong campaign infrastructure and political cache. \"I think as Iowa, New Hampshire, South Carolina happen, we're likely to see Cruz rise and survive February so that he can start having some significant victories in March.\" \nJust days before apportioning 155 delegates to top finishing candidates, Texas will host a televised debate -- offering candidates a chance to smash each other. Read or Share this story: http://kvue.tv/1RuKCoN TOP VIDEOS", "external_links": [], "published": "2015-10-08T06:06:00.000+03:00", "crawled": "2015-10-08T06:24:29.873+03:00", "highlightTitle": ""}