{"organizations": [], "uuid": "c26ebcd7c0cb062096322c00aa2995a494a99884", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30331856/authorities-1-killed-3-wounded-in-tennessee-state-shooting", "country": "US", "title": "Authorities: 1 killed, 3 wounded in Tennessee State shooting", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Authorities: 1 killed, 3 wounded in Tennessee State shooting - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "c26ebcd7c0cb062096322c00aa2995a494a99884"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30331856/authorities-1-killed-3-wounded-in-tennessee-state-shooting", "ord_in_thread": 0, "title": "Authorities: 1 killed, 3 wounded in Tennessee State shooting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ERIK SCHELZIG\nAssociated Press NASHVILLE, Tenn. (AP) - One man was killed and three women were wounded in an on-campus shooting stemming from a fight over a dice game on the campus of Tennessee State University, police said Friday.\nThe 19-year-old who died in the Thursday night shooting was not enrolled at the school, police spokesman Don Aaron said. It wasn't known whether the shooter, who fled the scene, was a student.\nThe shooting occurred in a courtyard around 10:50 p.m. Witnesses said an argument over the dice game boiled over into a fistfight when \"suddenly shots were fired,\" Aaron said.\nThree female students whom Aaron described as \"innocent passers-by\" were struck during the shooting. One was grazed and didn't require medical attention, while two others were taken to Vanderbilt University Medical Center with injuries. One had been released by Friday morning, while the other was in stable condition and was expected to make a full recovery, Aaron said.\n\"This was an isolated shooting incident in a courtyard,\" Aaron said. \"There were never, we believe, any other students in danger in dormitories or elsewhere on campus.\"\nSeveral students used their phones to record the fight. Police have obtained some video, but encouraged other students who scattered when the shooting began to come forward with further recordings and information.\n\"The person who fired those shots put innocent persons in extreme danger in this isolated incident,\" Aaron said. \"We're hoping that TSU students that have this video, have this knowledge, understand that this person put them in danger tonight, and will report what they know.\"\nPolice did not yet have a description of the suspect, and could not say whether an exchange of gunfire occurred until the evidence is analyzed.\nPolice expected to complete their crime scene investigation Friday morning and allow the campus to return to normal operations. They planned to release the identity of the man who died later in the day.\nThe incident comes just over a week after three people were wounded by gunfire at an off-campus party across the street from the college.\n ", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T13:30:10.563+03:00", "highlightTitle": ""}