{"organizations": ["SNP"], "uuid": "02ec6d44939b53334e49cafc2d5aafa3906b81ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "martini.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4319448/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://martini.heraldscotland.com/politics/political_news/13844976.STUC_to_address_SNP_conference_as_party_hails__quot_bonds_of_solidarity_quot__with_unions/?ref=rss", "country": "", "title": "STUC to address SNP conference as party hails \"bonds of solidarity\" with unions", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "STUC to address SNP conference as party hails \"bonds of solidarity\" with unions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T02:10:00.000+03:00", "replies_count": 0, "uuid": "02ec6d44939b53334e49cafc2d5aafa3906b81ac"}, "author": "", "url": "http://martini.heraldscotland.com/politics/political_news/13844976.STUC_to_address_SNP_conference_as_party_hails__quot_bonds_of_solidarity_quot__with_unions/?ref=rss", "ord_in_thread": 0, "title": "STUC to address SNP conference as party hails \"bonds of solidarity\" with unions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "STUC to address SNP conference as party hails \"bonds of solidarity\" with unions STUC to address SNP conference as party hails \"bonds of solidarity\" with unions 0 comments \nTHE Scottish Trades Union Congress (STUC) is to address the SNP conference for the first time ever in what the party has claimed is a historic move. \nGrahame Smith, the General Secretary, has accepted an invitation to speak at this week's event in Aberdeen to debate the UK Government's Trade Union Bill, which both the SNP and Labour Party strongly oppose. \nWhile the STUC is not affiliated to Labour, 10 of its members are and Mr Smith's appearance will be welcomed by the SNP as a sign of its success in appealing to left-leaning voters. \nLoading article content \nThe SNP has made significant efforts to win support of trade unions in recent years. Nicola Sturgeon made a significant speech at the STUC conference earlier this year in which she attacked Labour and promised to champion trade unionism. The SNP's Trade Union branch has over 16,000 members, while Ms Sturgeon has signed a memorandum of understanding with the STUC to oppose austerity and demand further powers for the Scottish Parliament. \nMr Smith will speak on a motion condemning the Trade Union Bill as an \"ideological attack\" that contravenes human rights, which is likely to pass with overwhelming support from delegates. \nHe said: \"I am absolutely delighted to have this historic opportunity to speak at SNP conference. It has never happened before and demonstrates the very constructive relationship with both the Scottish Government and the SNP as a political party. \n\"The fact that I am speaking on the debate on the Trade Union Bill demonstrates that a key aspect of that relationship is the Scottish Government’s work to take forward the Fair Work agenda, champion good workplace relations and support the role of trade unions. This is in stark contrast to the approach of the UK Government.\" Share article \nThe UK Government's Trade Union Bill, which is currently making its way through Westminster, proposes higher voting thresholds for strike ballot, double the amount of notice unions have to give before a strike can be held and would allow employers to use agency workers to replace striking staff. \nSNP business convener Derek Mackay said: \"That the STUC will address SNP conference for the first time is a welcome and historic development.\" Promoted Stories", "external_links": [], "published": "2015-10-14T02:10:00.000+03:00", "crawled": "2015-10-14T06:59:02.948+03:00", "highlightTitle": ""}