{"organizations": [], "uuid": "2f47383ab39390ca82d947a1b6a2e984a662b184", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "health.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/9f/72/3736749c48a8a3556b1b1e1bd416/150504-veterans-stock.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://health.usnews.com/health-news/patient-advice/articles/2015/10/08/wars-the-world-over-leave-many-fighting-ptsd-at-home-and-abroad", "country": "US", "title": "Wars the World Over Leave Many Fighting PTSD at Home and Abroad", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Wars the World Over Leave Many Fighting PTSD at Home and Abroad - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "2f47383ab39390ca82d947a1b6a2e984a662b184"}, "author": "USNews", "url": "http://health.usnews.com/health-news/patient-advice/articles/2015/10/08/wars-the-world-over-leave-many-fighting-ptsd-at-home-and-abroad", "ord_in_thread": 0, "title": "Wars the World Over Leave Many Fighting PTSD at Home and Abroad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wars the World Over Leave Many Fighting PTSD at Home and Abroad From Syrian War refugees to American soldiers, many are struggling to deal with trauma. Approximately 8 million people in the U.S. suffer from PTSD, including many veterans and individuals who have suffered trauma.\nBy Michael O. Schroeder Oct. 8, 2015 | 11:54 a.m. EDT + More The world is at war. Pockets of civil unrest from Syria to Afghanistan put soldiers and civilians in harm’s way. And for those who live through the trauma, many now battle with post-traumatic stress disorder , in which their past remains, in many ways, a part of the present.\n“Normally you have a sense that you have a future in front of you,” says Dr. Barbara Lopes Cardozo, a psychiatrist and medical officer at the Centers for Disease Control and Prevention. But for those with PTSD , she says, it’s almost like a person is mentally stuck at a point in time. “It’s as if the memory is still current … it’s like it’s not in the past, [and through] flashbacks they’re reliving that memory as if it’s in the present time. So they don’t really move forward. There’s no future.”\nLopes Cardozo’s work is focused on mental health in “emergency settings” overseas – in conflict and war zones and areas where disasters have taken place . She’s visited Syrian refugee camps in the north of Jordan. “For the Syrian refugees, there’s been a huge amount of violence. They’ve had to flee from bombings to leave everything behind quickly – their life was threatened – all those things make them at risk for PTSD,” she says.\nFigures vary widely on the likelihood that refugees, military veterans and others who have spent time in war zones will develop PTSD. But it’s clear many carry mental wounds home with them related to their time in or near combat, such as anxiety , depression and PTSD. A study published in the International Journal of Psychiatry in Clinical Practice in March estimated one-third of Syrian refugees in Turkey had PTSD and, among Syrian refugees studied, women exposed to two or more traumatic events with a personal or family history of psychiatric disorder were more than twice as likely to develop PTSD.\nAccording to the World Health Organization, traumatic events and loss are a common experience in people’s lives, with roughly 16 percent of people exposed to war – compared to about 22 percent overall who say they’ve witnessed violence and nearly 19 percent who have experienced interpersonal violence. WHO’s 2013 study estimated 3.6 percent of the world’s population suffered from PTSD in the previous year. In the U.S., approximately 8 million people suffer from PTSD, including many military and individuals who have suffered other types of trauma, such as domestic abuse.\nValvincent Reyes, a licensed clinical social worker based in Torrance, California, and a combat veteran therapist affiliated with the Patriot Support Programs, which supports the U.S. Department of Defense and Veterans Administration, has tended to the mental health needs of soldiers on the front lines in Afghanistan, as well as at home in the U.S.\nHe encourages anyone struggling with PTSD to ask a medical or mental health professional about their concerns. “Tell your story,” he says. If you’re not sure who to see , start by opening up to someone with whom you’ve built rapport, Reyes says. That could be a trusted physician or clergyman, trained to identify emotional distress. Seek their input on mental health professionals to see to regain firm footing for the way forward.\nThe CDC similarly recommends seeking support from family, friends and clergy, as well as engaging in leisure activities, taking time to resolve daily conflicts so they don’t add stress , realizing that some things remain out of one’s control and recognizing the need to call a mental health center for trained help. Though the agency reports that about half of those with PTSD recover within three months without help, for many others, symptoms continue for years, devastating relationships, families and making it more difficult to function at home and work.\nAfter returning from three tours in Iraq in the fall of 2009, Gary, who requested that his last name not be used for the sake of anonymity, found himself experiencing high levels of anxiety while driving or riding in a car or walking on the sidewalk near the road. Though he wasn’t angry or abusive, his wife, Heather, says he lied about things large and small.\nSeemingly disparate issues, Gary says he started to piece things together – and recognize that he was suffering from PTSD – in speaking with a friend of his who was a Vietnam veteran and dealing with his own demons. After seeing a series of counselors who did not provide the help he needed, he began seeing Reyes, and the couple says it’s made all the difference as they move forward.\nReyes' background in the military, Heather says, has helped provide her with context she didn’t have since marrying Gary three years ago. Reyes told the couple he believes Gary’s lying – including about mundane items, like where he put his shoes – gave him a sense of control he felt he’d lost while serving – namely when his helicopter crashed. “He was trying to get out of that helicopter. He had that sense of just trying to get himself to safety, but he had no control of what the helicopter was doing,” Heather says, describing that discussion.\nFor Gary, going to the counseling sessions together – and being open and honest – has allowed the couple to develop a road map to move ahead. He's also taken stock of the support Heather provides: \"My wife has been the true rock,\" he says. \"I am so fortunate right now to have [her and Reyes] around me to assist me with these problems.”\nTAGS: health patients patient advice PTSD mental health", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdy66k%3Fsrc=usn_gp", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZdy66k%3Fsrc=usn_su", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZdy66k%3Fsrc=usn_rd&title=Wars%20the%20World%20Over%20Leave%20Many%20Fighting%20PTSD%20at%20Home%20and%20Abroad", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZdy66k%3Fsrc=usn_tw&via=usnews&text=Wars%20the%20World%20Over%20Leave%20Many%20Fighting%20PTSD%20at%20Home%20and%20Abroad", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZdy66k%3Fsrc=usn_li&title=Wars%20the%20World%20Over%20Leave%20Many%20Fighting%20PTSD%20at%20Home%20and%20Abroad&summary=From%20Syrian%20War%20refugees%20to%20American%20soldiers%2C%20many%20are%20struggling%20to%20deal%20with%20trauma.&source=U.%20S.%20News", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZdy66k%3Fsrc=usn_fb"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T19:24:07.640+03:00", "highlightTitle": ""}