{"organizations": [], "uuid": "cffe092215956e0ff556ca555a5669a89a530aa8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/20/d3/78/83dcce242e3042008a5b1fbb92d54b64-9bf7b2153ebc4a7684a39de42a26126b-0.jpg", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/top-news/jeb-bush-finding-place-for-brothers-tenure-in-2016/nn6gH/", "country": "US", "title": "Jeb Bush finding place for brother's tenure in 2016 campaign", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Jeb Bush finding place for brother's tenure in 2016 campaign", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:19:00.000+03:00", "replies_count": 0, "uuid": "cffe092215956e0ff556ca555a5669a89a530aa8"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/jeb-bush-finding-place-for-brothers-tenure-in-2016/nn6gH/", "ord_in_thread": 0, "title": "Jeb Bush finding place for brother's tenure in 2016 campaign", "locations": ["Washington", "South Lawn", "Iowa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["THOMAS BEAUMONT", "Jeb Bush", "JILL COLVIN", "George W. Bush"], "text": "Updated: 6:19 p.m. Tuesday, Oct. 20, 2015 | Posted: 6:19 p.m. Tuesday, Oct. 20, 2015 Jeb Bush finding place for brother's tenure in 2016 campaign View Larger FILE - In this April 19, 2006 file photo, President George W. Bush, accompanied by his brother, then-Fla. Gov. Jeb Bush, speaks on the South Lawn at the White House in Washington. Jeb Bush is tossing aside any hesitations about embracing former President George W. Bush’s legacy and is searching for new ways to incorporate him into his White House campaign. (AP Photo/Ron Edmonds, File) By THOMAS BEAUMONT and JILL COLVIN The Associated Press DES MOINES, Iowa — \nAfter initially struggling with questions about the Iraq War and his brother's tenure as the nation's leader, Jeb Bush has tossed aside any hesitations about embracing former President George W. Bush 's legacy and is searching for new ways to incorporate him into his White House campaign. \nIt's a shift due in no small part to the jabs of Republican front-runner Donald Trump , who isn't backing down from his assertions that Bush's brother bears some responsibility for 9/11. \n\"In the latest episode of the reality show that is Donald Trump 's campaign, he has blamed my brother for the 9/11 terrorist attacks on our nation,\" Bush wrote in a column published Tuesday in National Review. \"That Trump echoes the attacks of Michael Moore and the fringe left against my brother is yet another example of his dangerous views on national-security issues.\" \nSpurred on by Trump, Bush is showing none of the hesitation in embracing his brother's presidency that tripped him up in the weeks leading to the formal launch of his 2016 campaign. Jeb Bush fumbled answers to questions about his brother's decision to invade Iraq in 2003 for an entire week in May, struggling to explain whether he would have done the same. \nBush is on much more comfortable ground when it comes to his brother's response to 9/11. \n\"The simple fact is that when we were attacked, my brother created an environment where, for 2,600 days, we were safe,\" Bush said Monday night on Fox News. \"No one attacked us again. And he changed the laws, he did everything necessary, he united the country, and he kept us safe.\" \nThe back and forth between the two candidates began at the second Republican debate, when Bush defended his brother as a president who kept the nation safe after the billionaire businessman claimed George W. Bush 's presidency \"gave us Barack Obama , because it was such a disaster.\" \nWhile George W. Bush 's favorability among all Americans remains mixed, nearly three-quarters of Republicans have a favorable view of him, according to a Pew Research poll in May. Jeb Bush scored his biggest applause of the evening when he pivoted to his right to face Trump and said calmly, \"As it relates to my brother, there's one thing I know for sure. He kept us safe.\" \nThe debate hall at the Ronald Reagan Presidential Library erupted in applause, and the comment has since become a part of the former Florida governor's campaign stump speech. \n\"The reaction to Donald Trump 's remarks show that no one accepts them,\" said longtime Bush supporter and donor Al Hoffman. \"Jeb isn't afraid, and what he's saying is we're brothers and we're going to support each other.\" \nYet Trump shows no signs of slowing his ridicule of Bush's applause line. On Monday, he tweeted links to stories about pre-9/11 intelligence failures and continued to talk it up Tuesday in a pair of television interviews. \n\"What happened is that Jeb Bush started talking about it and then instead of just letting it go, he started talking about it and now everybody virtually ... is agreeing with me,\" Trump said in an interview with Fox Business Network's Stuart Varney. \"Because, let's face it, you can't say the country was safe when the World Trade Center came down during his regime.\" \nIn the past week, George W. Bush has written two emails to supporters asking for donations, and the campaign is using his name to appeal to donors, including one Sunday where Jeb Bush asks supporters to \"help me defend my brother against Trump's comments.\" \nFormer President George W. Bush , as well as the brothers' father, former President George H. W. Bush, and their mother, Barbara, plan to attend a Jeb Bush campaign donor conference in Houston this weekend. The elder Bush brother will also headline a fundraiser next Thursday, the invitation to which came from two of his chiefs of staff while in office. \nMeanwhile, Bush's 2016 presidential campaign is looking anew at how best to build on the positive response the former president's name has invoked. Voters, specifically those who identify fighting terrorism as a top priority, continue to view the former president favorably, said Bush campaign spokesman Tim Miller. \n\"We've seen a very positive response to emails from President Bush,\" Miller said. \n___ \nColvin reported from Newark, New Jersey. \n___ \nFollow Thomas Beaumont and Jill Colvin on Twitter at: http://twitter.com/tombeaumont and http://twitter.com/colvinj \n__ \nThis story has been corrected with Stuart Varney working at Fox Business Network. An earlier version said he was with CNBC. Copyright The Associated Press", "external_links": [], "published": "2015-10-21T01:19:00.000+03:00", "crawled": "2015-10-21T10:06:39.064+03:00", "highlightTitle": ""}