{"organizations": [], "uuid": "6b851dbaf2e3b1163f6d90d27430b40482e46f93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151017113520-donald-trump-october-14-2015-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/10/19/politics/donald-trump-september-11-south-carolina/index.html", "country": "US", "title": "Voters back Trump despite disagreement on 9/11 blame", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Voters back Trump despite disagreement on 9/11 blame - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "6b851dbaf2e3b1163f6d90d27430b40482e46f93"}, "author": "Sara Murray, CNN", "url": "http://www.cnn.com/2015/10/19/politics/donald-trump-september-11-south-carolina/index.html", "ord_in_thread": 0, "title": "Voters back Trump despite disagreement on 9/11 blame", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Anderson, South Carolina (CNN) Donald Trump's suggestion that George W. Bush bears some responsibility for the September 11 terrorist attacks didn't sit well with voters here. But it's not inspiring them to turn on Trump.\n\"I think he went a little too far,\" Bobby Ladd, a 77-year-old resident of Liberty, South Carolina, said of Trump's comments. \"But I'm still going to vote for him.\"\nTrump set off his latest controversy last week when he told Bloomberg TV, \"When you talk about George Bush, I mean, say what you want, the World Trade Center came down during his time.\"\nTrump added: \"Blame him, or don't blame him, but he was president. The World Trade Center came down during his reign.\"\nWhile the GOP front-runner reiterated those comments on Twitter, he made no mention of September 11 when he took the stage in front of a crowd of thousands Monday. When reporters tried to question him about the issue after the event, Trump dodged the press -- a rare move for the normally accessible candidate.\nRead More \"I don't know that we know all the truth,\" Julie Childers, a 44-year-old who turned out to see Trump, said of the terrorist attacks. But, \"I wouldn't say that George W. Bush is to blame.\"\nEven so, she intends to vote for Trump.\nStill, attacking the former president could be a risky strategy in a Republican primary. While the former president remains a divisive figure among the general public, Republicans overwhelmingly view him in a positive light. Some 88% of Republicans said they had a favorable view of him in a May CNN/ORC poll.\nJoseph Franchi, a 21-year-old Clemson University student who was decked out in Trump campaign swag, said of September 11, \"I don't think anyone was to blame for that.\"\nHe and his friend Conor Leddy -- both fans of Trump -- said they were attracted to the candidate's calls for a stronger military, his off-the-cuff speaking style and his ability to attract diverse crowds, from college students to retirees.\nOne point the men agreed on: \"If Trump became president he would protect our country,\" Leddy said. \"I feel safe with Trump.\"\nEven undecided voters showed little sign that Trump's latest controversial comment would be a driving factor in whether to vote for him.\n\"That bothered me,\" Dallas Jones, a 70-year-old retired schoolteacher, said of Trump's comments.\nHer husband, Wayne Jones, jumped to Bush's defense.\n\"It wasn't his fault,\" Wayne said. \"Bush couldn't control that. I don't think (Trump) could if he were president.\"\nBut both of the Joneses are still considering casting their ballots for Trump. But there's another candidate high on their list, too: Jeb Bush.\n\"It's just too far out,\" to make a decision yet, Wayne said.\nFollow @CNNpolitics", "external_links": ["https://twitter.com/CNNpolitics"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T06:22:15.715+03:00", "highlightTitle": ""}