{"organizations": [], "uuid": "24c44a17a40d9455b49902339ba5eefb6244550c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/1001/20151001_031131_phillip-lindsay.jpg", "site_section": "http://www.denverpost.com/localpolitics", "section_title": "Local Politics - The Denver Post", "url": "http://www.denverpost.com/colleges/ci_28907805/phillip-lindsay-is-all-about-toughness-team-colorado", "country": "US", "title": "Phillip Lindsay is all about toughness, team for Colorado Buffs", "performance_score": 0, "site": "denverpost.com", "participants_count": 2, "title_full": "Phillip Lindsay is all about toughness, team for Colorado Buffs - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T11:11:00.000+03:00", "replies_count": 1, "uuid": "86ba1891c01446daa6e70808b5ce78b8d28af4ab"}, "author": "John Meyer", "url": "http://www.denverpost.com/colleges/ci_28907805/phillip-lindsay-is-all-about-toughness-team-colorado#post-0", "ord_in_thread": 0, "title": "Phillip Lindsay is all about toughness, team for Colorado Buffs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOULDER — When people around the Colorado football program talk about running back Phillip Lindsay, they tend to start with who he is, not what he does with the football.\nHe's good at that, too.\nThe 5-foot-8, 180-pound redshirt sophomore and Denver South product rushed for 113 yards and two touchdowns last week against Nicholls State. He leads the team in all-purpose yards (384), having averaged 7.4 yards per touch.\nBut first they talk about attitude, effort, team-first orientation and toughness. Lindsay played two games his senior year of high school with a blown out ACL, yet managed to rush for 299 yards in those games. He took a shot to the ribs in the Colorado State game two weeks ago and stayed in the game. Last week he led the team in carries and yards despite lingering rib pain.\n\"Nothing stops him,\" said CU coach Mike MacIntyre. \"He is a phenomenal young man. He has great parents, just a great family base. Football is extremely important to him, but being successful at everything is important to him. He does well in school, he does well off the field, he's a great leader. He has that character, internal fortitude. He'll be a success at whatever he does.\"\nLindsay's father, Troy, was a fullback at CSU after playing at Thomas Jefferson.\n\"Once Phillip gets something in his mind, it's going to get done, and he really wants to win,\" Troy said. \"He really wants CU to win. He says they've been down too long and it's time for them to get back up there.\"\nAdvertisement CU could take a significant step toward that with Oregon coming to Folsom Field Saturday night for a nationally televised game on ESPN. Injuries have thinned CU's backfield the past two weeks, magnifying Lindsay's value.\n\"I play a role,\" Lindsay said. \"Sometimes it's big, sometimes it's not. But when it's time for me to go out and produce, I have to produce to the best of my ability.\"\nFootball runs in his bloodlines. His uncle, Tony, coached him at South and was a running back at Utah. Two cousins played at Oklahoma State. Brother Zach is a redshirt freshman running back at Northern Colorado. Another brother, Marcus, is a junior running back at South and being recruited by CU.\n\"Our whole family is football-minded,\" Troy said. \"Phillip has been coached since he was young to understand that you have to have other people to help. He knows there's nothing he can do out there by himself. That concept for him, it's just instilled in him.\"\nApparently so, even if those values may seem old-fashioned in today's football.\n\"You've got to grow up,\" Phillip said. \"At some point you have to understand that the world is not about you. You need people, you need help. And in order for us to go where we want to go, everybody has to be on board. In order for me to make the plays I can make, my offensive line has to make the plays they make. The offensive line is doing a tremendous job right now. I can't stress enough how proud and how happy I am to have these dudes blocking for me.\"\nRunning backs coach Klayton Adams said Lindsay has good quickness and speed, has developed into a reliable pass protector and has good ball skills out of the backfield. He also knows he's going to get \"a maximum level of effort\" and toughness from Lindsay.\n\"I just love the game of football,\" Lindsay said. \"For me and my family, football is a way for us to express ourselves. It's also a way to learn, to build friendships, to build bonds. You take football into the real world. As a football team, you have to be together, and in the work world you're going to have to work together. My father always told me to never talk about yourself because it's not about you. It's not about me. The big picture is not about me scoring touchdowns, getting 100 yards. The big picture is about winning.\"\nThat's why people around the CU program are so fond of Lindsay.\n\"Anytime I hear that kind of stuff,\" said his father, \"it kind of makes me want to cry.\"\nJohn Meyer: jmeyer@denverpost.com or @johnmeyer", "external_links": [], "published": "2015-10-01T11:11:00.000+03:00", "crawled": "2015-10-02T02:04:58.705+03:00", "highlightTitle": ""}