{"organizations": [], "uuid": "0edfdf5abe2ed1f99ffe8f63478eb203d01d8a43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbn.com", "main_image": "", "site_section": "http://www.cbn.com/cbnnews/politics/feed/", "section_title": "CBN.com - Politics", "url": "http://www.cbn.com/cbnnews/politics/2015/October/Jindal-America-Needs-Revival-Not-Gun-Control/", "country": "US", "title": "Jindal: America Needs 'Revival' Not Gun Control", "performance_score": 0, "site": "cbn.com", "participants_count": 1, "title_full": "Jindal: America Needs 'Revival' Not Gun Control - Politics - CBN News - Christian News 24-7 - CBN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "0edfdf5abe2ed1f99ffe8f63478eb203d01d8a43"}, "author": "Benjamin Gill", "url": "http://www.cbn.com/cbnnews/politics/2015/October/Jindal-America-Needs-Revival-Not-Gun-Control/", "ord_in_thread": 0, "title": "Jindal: America Needs 'Revival' Not Gun Control", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The presidential campaign season is keeping the newly revived gun control debate alive. But one candidate is trying to revive a completely different debate -- the one about the spiritual condition of America.\nOn the gun control side, Chicago's Roman Catholic archbishop called this weekend for more gun restrictions in the aftermath of the Oregon college shooting and ongoing street violence in Chicago.\nBut even as that religious leader called for more earthly laws, it was a Republican presidential candidate who said the real issue is spiritual.\n\"Passing more laws to take away the rights of law-abiding Americans won't stop this problem, won't stop the next massacre, won't stop the next tragedy,\" Louisiana Gov. Bobby Jindal told ABC News \"This Week.\"\nJindal believes an external fix won't help because America needs to be fixed from the inside out, saying the country really needs a \"spiritual revival.\"\nJindal also called for a spiritual revival back in January at a massive prayer rally called \"The Response.\"\nSunday, he cited America's \"moral decay\" and a lack of respect for life seen in violent movies, TV shows, song lyrics and video games.\nJindal says fatherlessness is another big part of the problem that needs to be addressed.\nIn the past, the gun control conversation has come and gone from the headlines. But with so many Republican candidates in the field, the gun conversation will likely remain a big issue.\nAt a campaign appearance in Tennessee, frontrunner Donald Trump spoke out for gun rights, saying, \"The Second Amendment to the Constitution is clear.\"\nTrump also noted that he has a New York concealed-carry permit.\nAnd former Hewlett-Packard CEO Carly Fiorina has been hammering President Barack Obama for \"politicizing\" the Oregon shooting with his call for stricter gun regulations.\nRetired neurosurgeon Ben Carson has made similar arguments to Trump and Fiorina. He pointed out this weekend on CNN that \"many of the places where these mass shootings occur are gun-free zones.\"\n\"They select these places because they know they're not going to meet resistance,\" he explained.\nBut the major news media outlets have focused instead on some of Carson's more candid comments, trying to turn them into political gaffes.\nFor example, Carson pointed out last week that the Nazis disarmed their populace. He then came under fire for stating that the Jews could have fought back against the Holocaust if they had been better armed.\nOn Sunday, he defended those comments.\n\"Basically, what I said is that when tyranny occurs traditionally around the world, they try and disarm the people first. And that is exactly what happened in Germany,\" Carson said. \"You know, mid- to late 30s they started a program to disarm the people and by mid- to late 40s, look what had happened.\"\nCarson also took a lot of heat for saying the best way to confront a mass shooter is to rally all the hostages to rush the gunman, instead of waiting for him to shoot you.", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T16:51:49.102+03:00", "highlightTitle": ""}