{"organizations": [], "uuid": "3a4cd76bc4e629dfd95dba56a23613f90a116036", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/16379413.cms", "site_section": "http://timesofindia.indiatimes.com/", "section_title": "India News, Latest Sports, Bollywood, World, Business &amp; Politics News - Times of India", "url": "http://timesofindia.indiatimes.com/life-style/health-fitness/fitness/Listen-to-your-body-while-you-workout/articleshow/16379230.cms", "country": "IL", "title": "Listen to your body while you workout", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Listen to your body while you workout - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 1, "uuid": "3a4cd76bc4e629dfd95dba56a23613f90a116036"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/life-style/health-fitness/fitness/Listen-to-your-body-while-you-workout/articleshow/16379230.cms", "ord_in_thread": 0, "title": "Listen to your body while you workout", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If your body is clicking, cramping and whirling while you work out , stop and listen to what it has to say\nCracking joints, cramps and even yawns mean much more if they happen while you're in the gym. When you're working out, the body adjusts to the change in activity level. It reacts differently to anaerobic (short bursts of high intensity) and aerobic (low bursts of moderate intensity) exercise programs and expresses them through these symptoms.\nExperts say these are signs that should make you go 'hmmm'. Feeling giddy Dr Shivani Chowdhury Salian, an associate professor in the Department of Physiotherapy at Dr DY Patil University puts the reasons for dizziness down to drop in blood pressure, sudden change of position (sitting to standing or vice versa), drop in blood sugar or exercising at a high intensity. Exercise may also trigger a pre-existing condition such as an inner-ear disorder that causes vertigo. Have you forgotten to breathe? Concentrating on a movement may make you hold your breath, limiting oxygen supply. Nuri Khan of Studio 5 Aerobic Centre says, \"Drink water before you start. You could also be over-exercising or doing it too fast. Lack of sleep can also make you giddy.\"\nHow to fix it: Check your blood pressure and get a good night's sleep. After a spell, walk around slowly for several minutes to bring down your heart rate. Don't put your head between your knees (lower than your heart). It will affect your blood pressure and make you feel faint. Sip on water or an energy drink. \"If your dizziness worsens, get medical attention. It could indicate a seizure or stroke ,\" says Salian. You break into a yawn Yawning indicates fatigue or high level of exertion. It also reflects the brain cooling\ndown after high activity. Excessive yawning is what you need to pay attention to. It may be caused by a vasovagal reaction, which may indicate a heart problem. If you find yourself falling asleep on the treadmill or while driving, you may suffer from sleep apnea or narcolepsy.\nHow to fix it: If it's just periodic yawning, get a good night's sleep beforehand or switch exercise routines. If you're yawning more and lifting weights less, it's time to call the doctor.\nJoints crack\nDehydration, lack of Vitamin D or air trapped in the joints can cause them to pop and crack. \"Typically, this is harmless,\" says Salian, \"and perfectly normal, but you should see your doctor if there is pain. It could be the result of an injury.\" Crunching or grinding sensations, followed by swelling, are red flags. They could signal arthritis.\nHow to fix it: If the clicking is occasional, it's harmless. If it swells or limits mobility, stop exercising and apply the PRICER technique — Prevention, Rest, Ice, Compression, Elevation and Rehabilitation. Then, go see a specialist. If the cracking is the result of osteoarthritis , corticosteroid injections and pain medications can help. Muscle cramps According to Salian, \"Exercise Associated Muscle Cramping (EAMC) most commonly occurs in muscles that span two joints.\" It can happen because of quick change in temperatures — say you jump into a cold pool or into a hot yoga studio; build up of lactic acid and dehydration. The bad news is: Cramps become increasingly frequent with age.\nHow to fix it: The fastest way to dissolve a cramp is to stretch the contracting muscle in the opposite direction. Say the cramp is in your calves: Straighten your leg and move your ankle up and down to stretch those muscles and release the lactic acid. Continue stretching this way for 30 to 60 seconds after the cramp goes away to reduce the chance of it returning. Don't forget to drink lots of water.\nmirrorfeedback@indiatimes.com", "external_links": ["http://www.speakingtree.in/topics/health/heart", "http://www.speakingtree.in/topics/health/exercise"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-17T06:51:20.516+03:00", "highlightTitle": ""}