{"organizations": [], "uuid": "dd9c2060f544ad5d6ca231bab4224c21896f7f67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tehelka.com", "main_image": "http://www.tehelka.com/wp-content/plugins/all-in-one-seo-pack/images/default-user-image.png", "site_section": "http://www.tehelka.com//feed.xml", "section_title": "Tehelka - Investigations, Latest News, Politics, Analysis, Blogs, Culture, Photos, Videos, Podcasts", "url": "http://www.tehelka.com/2015/10/government-welcomed-for-coming-up-with-advisory-for-online-taxis/", "country": "US", "title": "Government welcomed for coming up with advisory for online taxis", "performance_score": 0, "site": "tehelka.com", "participants_count": 1, "title_full": "Government welcomed for coming up with advisory for online taxis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T21:16:00.000+03:00", "replies_count": 0, "uuid": "dd9c2060f544ad5d6ca231bab4224c21896f7f67"}, "author": "Tehelka Web Desk", "url": "http://www.tehelka.com/2015/10/government-welcomed-for-coming-up-with-advisory-for-online-taxis/", "ord_in_thread": 0, "title": "Government welcomed for coming up with advisory for online taxis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comment \n\nGuidelines have been put together to legalise app-based taxi companies, including the United States-Uber and its domestic rival Ola, ending months of uncertainty on how they operate in the country. The central government has laid these rules for the first time, on October 13. \nThe state governments have been directed to guarantee that companies operate with call centres and their taxis follow certain emission guidelines, according to a six-page advisory issued last week. \nUber and Ola both welcomed the government’s move as a step in the right direction. \nTo ensure passenger safety, the guidelines also call for checking drivers’ background. And what’s more, any person convicted of any ‘offence’ under criminal laws in the past will not be allowed to become a driver, as per the guidelines. \nOla, supported by Japan’s Softbank, called the advisory “positive” that will help it work closely with different states. Uber called the norms a big leap in identifying rules and regulations for such companies. \nIn the last some months, app-based taxi services had to face the authorities ire over safety measures, especially in New Delhi , where an Uber driver was accused of raping a woman passenger in December 2014. \nThe services were banned in New Delhi after the incident, but came to its rescue by revoking the decision recently. The incident led to outrage against online taxi companies, especially after it was found the accused driver had a criminal record. \nIn April, the transport ministry said such firms brought “value to the economy and the people”. */", "external_links": [], "published": "2015-10-13T21:16:00.000+03:00", "crawled": "2015-10-14T01:43:35.348+03:00", "highlightTitle": ""}