{"organizations": [], "uuid": "93802528313f432f37a77dc8ab29442ce2241cd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "straitstimes.com.feedsportal.com", "main_image": "http://www.straitstimes.com/sites/all/themes/custom/bootdemo/images/facebook_logo.jpg", "site_section": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/index.rss", "section_title": "RSS Breaking News - Politics", "url": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/s/4a615e00/sc/24/l/0L0Sstraitstimes0N0Cpolitics0Cactivists0Enominate0Eex0Eisa0Edetainee0Efor0Enobel0Eprize/story01.htm", "country": "SG", "title": "Activists nominate ex-ISA detainee for Nobel prize,", "performance_score": 0, "site": "feedsportal.com", "participants_count": 1, "title_full": "Activists nominate ex-ISA detainee for Nobel prize, Politics News & Top Stories - The Straits Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T13:00:00.000+03:00", "replies_count": 0, "uuid": "93802528313f432f37a77dc8ab29442ce2241cd1"}, "author": "Lim Yan Liang", "url": "http://straitstimes.com.feedsportal.com/c/32792/f/677429/s/4a615e00/sc/24/l/0L0Sstraitstimes0N0Cpolitics0Cactivists0Enominate0Eex0Eisa0Edetainee0Efor0Enobel0Eprize/story01.htm", "ord_in_thread": 0, "title": "Activists nominate ex-ISA detainee for Nobel prize,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A group of political activists and opposition politicians have nominated former political detainee Chia Thye Poh for the Nobel Peace Prize, saying his fight for political rights here has inspired current activists.\nAt a press conference yesterday, Singaporeans First party chief Tan Jee Say said he pushed for the nomination \"out of a sense of public duty\", despite not personally knowing Dr Chia, 74, a former Internal Security Act (ISA) detainee.\n\"We now want the world, and in particular the citizens of Singapore, to know of this personal tragedy and the huge sacrifices that he and his compatriots had made,\" he said at the event attended by rights activists and supporters of Dr Chia, who was not present as he could not be contacted. He is said to spend most of his time in Europe.\nThe former member of the opposition Barisan Socialis, who was elected to Parliament in 1963, was arrested on Oct 29, 1966 for organising and leading an illegal street procession earlier that month, to demand that a general election be held and eight conditions be met. This included the release of all political detainees and the abolition of laws he deemed undemocratic.\nHe was released in May 1989, after having spent time in prison and halfway houses, and was allowed to live on Sentosa island.\nFrom 1992, he was allowed to live on the main island of Singapore. During this period, he earned a living doing translation work for the Sentosa Development Corporation.\nThe restrictions imposed on his travel, public speeches and political activities were fully lifted by the Singapore Government in November 1998.\nMr Tan argued that the nine-year restriction period, taken together with the 23 years of detention, made Dr Chia the world's longest-serving political prisoner, exceeding the 27 years that Nelson Mandela was imprisoned for.\nFormer Singapore Democratic Party member James Gomez, who wrote the nomination letter in January with film-maker Martyn See, said the Nobel Peace Prize Committee confirmed it had received the letter. But it is not known if Dr Chia made the shortlist, finalised in May. There were 273 nominees this year.\nThe committee, made up of five members appointed by the Norwegian Parliament, will choose the Nobel Peace Prize laureates through a majority vote this week.\nA version of this article appeared in the print edition of The Sunday Times on October 04, 2015, with the headline 'Activists nominate ex-ISA detainee for Nobel prize'. Print Edition | Subscribe Topics: TAN JEE SAY NOBEL PRIZE CHIA THYE POH //str.sg/Z6NA Copy", "external_links": ["http://www.sphsubscription.com.sg/eshop", "http://str.sg/Z6NA"], "published": "2015-10-04T13:00:00.000+03:00", "crawled": "2015-10-05T03:51:56.018+03:00", "highlightTitle": ""}