{"organizations": ["Ofsted", "Church of England"], "uuid": "ed6821d9832465788a0a177216ddf75706e85bb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pistonheads.com", "main_image": "", "site_section": "http://pistonheads.com/gassing/rss_forum.asp?f=205&mid=0", "section_title": "News, Politics & Economics", "url": "http://www.pistonheads.com/gassing/topic.asp?t=1549703", "country": "IE", "title": "My 4.5 year olds daughter's experience of C of E school", "performance_score": 0, "site": "pistonheads.com", "participants_count": 0, "title_full": "My 4.5 year olds daughter's experience of C of E school", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:13:00.000+03:00", "replies_count": 0, "uuid": "ed6821d9832465788a0a177216ddf75706e85bb4"}, "author": "", "url": "http://www.pistonheads.com/gassing/topic.asp?t=1549703", "ord_in_thread": 0, "title": "My 4.5 year olds daughter's experience of C of E school", "locations": ["Sofia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["God", "Mrs xxx"], "text": "[news] 10:30 Firstly, this is not meant as a religion bashing post, I usually hang out on the TVR forums but hey . I'll delete it if I start getting crucified Background I have chosen to send my child to a Church of England school and have to admit that this is out of pure convenience (walking distance ) + it is a good village school. Personally I think it is verging on abhorrent for the state to direct young children in the direction of any religion, but clearly my principles took a back seat to convenience. I am all for learning about religion as an important part of our world - but putting across religion as fact to a small child is nothing short of indoctrination. In honesty I thought in this day and age the pedalling of religiousness might of been dialled back a bit from the attempt at indoctrination I experienced myself in a similar school which lead me to want to be a vicar at the age of 8.A few things in the last few weeks have piqued a little concern.1) My 4.5 year old telling me at the weekend that God loved her move than her mummy and daddy and God is in her heart. Her teacher (regular stand in teacher) told her this when they were talking about a book about God. I tried to explain that some people believe in God and some people don't and that I don't to which I got - \"it must be true Mrs xxx told me\". I told her the stories were nice, but were just stories like Sofia the 1st and that she should tell Mrs xxx if she talks about God again that she will decide if she believes in God when she is older - Caveat this is a 4.5 year old so I accept she might have taken something out of context.2) The fact that they have the Lords Prayer emblazoned across the main hall with a bible worship stand in the middle - I guess I expected it, but it still feels rather odd 3) Having just read the latest Ofsted report regarding 'Pupil's spiritual, moral, social and cultural development' \"Pupil's added to the reverence of the worship through their considered responses, reflection, prayers and singing\". Definition of reverence - 'The feeling or expression of reverence and adoration for a deity'. WtF I can't believe that the state is pressing my daughter into worshipping a deity of any kind (Unless it is a TVR of course).So how hypocritical of me - sending my daughter to a Church school and then moaning about them trying to get to sign up!What do I do - Take it up with the Head Mistress, quiet word with her normal teacher, ask for her to be opted out of any religious interference, find a different school (This would be cruel and is off the table to be fair), longer term school governor if the opportunity arrises?As it goes will be asking to speak to her teacher this PM, not sure how best to take it further - Any suggestions or am I being a prat and should just let it slide on the basis that long term it is likely to make very little difference.Matt", "external_links": [], "published": "2015-10-21T22:13:00.000+03:00", "crawled": "2015-10-21T21:29:47.650+03:00", "highlightTitle": ""}