{"organizations": ["Troyes", "Anglican Church", "Catholic Church", "Church of England", "Insane Rulers"], "uuid": "98c4501a318983facd5d2a5a6290398e3248722d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.watchmojo.com", "main_image": "/uploads/mojothumbs/PH-H-Top10-Insane-Rulers-In-History-720p30_100.jpg", "site_section": "http://watchmojo.com/rss/feeds.php?id=12", "section_title": "WatchMojo.com Politics and History", "url": "http://www.watchmojo.com/index.php?id=14482", "country": "US", "title": "Top 10 Insane Rulers in History", "performance_score": 0, "site": "watchmojo.com", "participants_count": 0, "title_full": "Top 10 Insane Rulers in History", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T19:23:00.000+03:00", "replies_count": 0, "uuid": "98c4501a318983facd5d2a5a6290398e3248722d"}, "author": "", "url": "http://www.watchmojo.com/index.php?id=14482", "ord_in_thread": 0, "title": "Top 10 Insane Rulers in History", "locations": ["France", "Egypt", "Rome", "England", "Beijing", "Muscovite Russia", "Russia", "Castile", "United Kingdom", "Tordesillas", "China", "Baiae"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Murad IV", "Elizabeth I", "Yelena", "Anne Boleyn", "Justin II", "Nazi Führer Adolf Hitler", "Farouk", "Henry", "Charles VI", "Joseph Stalin", "Ibrahim", "George III", "Ivan Ivanovich", "Philip", "Nero", "Ivan IV", "Incitatus", "Caligula", "Henry VIII", "Joanna", "Murad", "Charles", "Henry V", "Ivan IV Vasilyevich", "Zhu Houzhao", "Catherine Howard", "Aragon", "Ivan", "Zhengde", "Juana"], "text": "  Top 10 Insane Rulers in History Top 10 Insane Rulers in History These real-life figures were memorable because they were straight-up psychotic! Welcome to http://www.WatchMojo.com, and today we’re counting down our picks for the Top 10 Insane Rulers in History. For this list, we’re ranking some of the most violent, mentally unstable, and outright selfish royal leaders in history. We’re excluding non-royal dictators, such as Soviet leader Joseph Stalin and Nazi Führer Adolf Hitler as well as democratically elected politicians here. But don’t forget to check out our other lists of the Top 10 Conquerors and Top 10 Ruthless Dictators if you’re looking for that kind of thing! #10: Farouk I of Egypt 1920 – 1965 Farouk I may have the distinction of being the last royal ruler of Egypt; however, his achievements were lackluster and his personal behavior was dislikable. Farouk was a glutton; reportedly eating 600 oysters weekly, so it should come as no surprise he eventually weighed close to 300 pounds! While being fat isn’t a crime, stealing the watch off of Prime Minister Winston Churchill sure is. Farouk’s kleptomania pales in comparison to what he did when he had nightmares about lions, though – he went to his local zoo and shot two dead in their cage. #9: Ivan IV of Russia 1530 - 1584 Most commonly known as Ivan the Terrible, it’s probably not surprising that Ivan IV Vasilyevich is regarded as Russia’s greatest and most terrifying leader. This czar united Muscovite Russia, ruthlessly expanded Russia east to turn it into an empire, and is considered the father of modern Russia. This aside, Ivan was terribly paranoid; he famously established the secret police known as the oprichniki, which antagonized and mass-executed political dissidents. In a fit of rage, he caused his daughter-in-law Yelena to miscarry and killed his son Ivan Ivanovich, who was coming to wife’s defense, by smacking his head with a scepter and losing his only sound heir. #8: Ibrahim of the Ottoman Empire 1615 - 1648 Ibrahim initially lived a life of captivity and barely avoided execution by his ruling brother, Murad IV, who killed their four other brothers. Once Murad died, Ibrahim succeeded him and quickly became known for his physical and mental breakdowns – posthumously earning him the nickname Ibrahim the Mad. Ibrahim obsessed over his harem, often influenced by concubines, and gave them excessive gifts like a palace. Disgusted at his ineffectiveness, Ottoman elites killed the Sultan - with his mother’s consent. So, as you can imagine, his legacy wasn’t great – after his death a myth circulated that he drowned 280 concubines because they may have slept with other men. #7: Henry VIII of England 1491 - 1547 Henry VIII wanted to annul the marriage to his first wife and the Catholic Church said no, so by putting his foot down and stating the Sovereign reigned supreme over the Church of England, he basically founded the Anglican Church! Henry married 6 times, had numerous affairs and illegitimate children, and executed two of his wives – his second wife Anne Boleyn, who was the mother of Elizabeth I, and his fifth wife Catherine Howard. Beyond his affinity for uxoricide, Henry had a tendency to overspend. The economy was strong at his reign’s outset, however he nearly bankrupted England by blowing state funds on excessive things, such as thousands of needless tapestries and pistols. #6: Zhu Houzhao of China 1491 - 1521 Known as the Zhengde Emperor, Zhu Houzhao didn’t want to rule. Zhengde became emperor at 14 and quickly took to a life of luxury and womanizing. Outside of Beijing, Zhengde blew state funds on creating palaces for exotic zoos and then converting them into harems; many women died there due to living conditions and the lack of food provided. He notoriously made royal officials pretend to be market vendors while he imagined himself shopping like a commoner and he accidentally burned down his palace with gunpowder. This guy was nuts. #5: Charles VI of France 1368 - 1422 In the middle of the Hundred Years War, Charles VI became king at the tender age of 11 and was a puppet of his manipulative uncles; Charles ousted them at 21. Determined to improve France, he earned the nickname Charles the Beloved. By 1392, he began suffering bouts of insanity – killing his own knights, running wildly into forests, kicking Jews out of the kingdom, and signing the Treaty of Troyes, which recognized English King Henry V as his successor. Is any wonder he was later dubbed Charles the Mad? #4: Joanna of Castile 1479 - 1555 Juana married King Philip the Handsome in 1506. While their marriage started passionately, Philip had numerous affairs, causing her constant paranoia about her husband's infidelities. Once Philip died, Juana allegedly wouldn't let women come near his corpse, including nuns. Her son Charles had his mother confined to a convent in Tordesillas, largely as a power play to consolidate his rule, however Juana’s paranoia got the best of her and she believed the nuns conspired to murder her. The Queen of Castile and Aragon tragically died in confinement and earned the moniker, Juana the Mad. #3: Nero of the Roman Empire 37 - 68 In the year 64, a fire raged throughout Rome for 5 days. Legend suggests Nero simply played his fiddle as Rome burned. Ancient historians accuse Nero of arson to make way for a palace, though Christians were blamed. Not a fan of Christianity, it’s rumored Nero created “Christian candles” by dipping followers in oil and lighting them on fire. He competed in the 67 Greek Olympics, was injured in a chariot race and bombed at acting, but judges let him win – and why not? Nero mass-executed people, including his mother and at least one of his wives. We’d probably let him win too. #2: Caligula of the Roman Empire 12 - 41 Caligula was sexually perverse and viciously cruel, indiscriminately executing family and friends. He over-compensated, vied to be worshipped as a god, and built the then-largest boat as a personal floating palace. After an oracle alleged Caligula was as likely to become emperor as to ride a horse on the Bay of Baiae, the Emperor blew funds on a pontoon bridge for the bay and rode his horse Incitatus across, while sporting Alexander the Great’s breastplate. Ancient historians say he wanted to appoint Incitatus as consul and later make him a priest. Caligula was eventually assassinated. Before we get unveil our number one pick, here are some honorable mentions: - George III of the United Kingdom 1738 - 1820 - Justin II of the Byzantine Empire 520 - 578", "external_links": [], "published": "2015-10-12T19:23:00.000+03:00", "crawled": "2015-10-13T00:22:01.699+03:00", "highlightTitle": ""}