{"organizations": [], "uuid": "c954207284755cd724b98fc38dc6b00089b1d35e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/f3b0524e-c6a6-4bfa-b18e-a482c0f7f70e.img", "site_section": "http://www.ft.com/rss/world/uk/politics", "section_title": "Politics & Policy - latest UK politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/7d3a0a24-733d-11e5-a129-3fcc4f641d98.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Financials ‘at risk’ of money-laundering", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Financials ‘at risk’ of money-laundering", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:09:00.000+03:00", "replies_count": 0, "uuid": "c954207284755cd724b98fc38dc6b00089b1d35e"}, "author": "", "url": "http://www.ft.com/cms/s/0/7d3a0a24-733d-11e5-a129-3fcc4f641d98.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Financials ‘at risk’ of money-laundering", "locations": ["Heathrow"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Heathrow courts SNP over third runway \nThe report , published by the Treasury and the Home Office, said: “The same factors that make the UK an attractive place for legitimate financial activity — its political stability, advanced professional services sector, and widely understood language and legal system — also make it an attractive place through which to launder the proceeds of crime.” \nThis was welcomed by Transparency International UK, the campaign group, as “a clear and unambiguous recognition” of the problems posed by money-laundering in the UK and the weaknesses in the country’s system for detecting illicitly and corruptly obtained money. \nBut the report was criticised as “misleading” by the Law Society, which said its findings were not backed up by robust intelligence. It took issue with the claim that there were “known professional enablers” within the legal sector who facilitated money-laundering through the purchase of property and the creation of structures that concealed criminals’ ownership of assets. \nJonathan Smithers, the society’s president, said: “Shortcomings in the intelligence-gathering in preparing this report have resulted in what we believe is a misleading assessment.” \nThe assessment admitted that there were “significant intelligence gaps, in particular in relation to ‘high-end’ money-laundering”. UK law enforcement agencies were “still establishing the strength of understanding needed” to tackle what was judged to be a significant threat posed by the financial and professional services sectors. \nThe supervision regime, which is meant to identify potential money-laundering cases, was inconsistent, the report said. It also noted that the law enforcement response to money-laundering had been “weak for an extended period of time”. \nBut it added that the National Crime Agency, set up in 2013, was working on building a better intelligence picture and response to “high-end” money-laundering. International corruption cases involving millions of pounds of assets in the UK were under investigation, it said. \nThe report added there was evidence that banks were leaving themselves vulnerable when it came to dealing with the risks associated with “politically exposed persons” that recent investigations had linked to significant cases of international corruption. \nThe assessment also highlighted the vulnerability of the UK property market to money-laundering because of the ease with which ownership could be obscured using offshore holding companies. It said there were known estate agents who were facilitating money-laundering by arranging and negotiating the purchase of property. \nThe report raised concerns over the consistency of supervision of the accountancy sector and the levels of compliance among regulated professionals. It noted that criminals could use accountants to conceal the origins of criminal funds with tactics such as creating trusts and offshore corporate structures, providing false accounts, and insolvency malpractice. \nThe findings were criticised by Paul Simkins, director of quality assurance at the Institute of Chartered Accountants in England and Wales and chair of the UK’s Anti-Money LaunderingSupervisors Forum. He said the accounting industry should have been segmented into different risk groups, separating members of the professional bodies that have strict codes of ethical conduct from those without any professional qualification or licensing certificate. \nCampaigners criticised the government for sending out a “mixed message”, following a decision to drop one of the most contentious parts of a tough new accountability regime for top executives in the financial sector. Stuart McWilliam, senior campaigner at Global Witness, a campaign group, said: “On the same day it revealed the key role played by banks in enabling corruption and money-laundering, it has rolled back on a major part of its pledge to hold senior bankers to account.” Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-10-15T20:09:00.000+03:00", "crawled": "2015-10-15T20:45:44.184+03:00", "highlightTitle": ""}