{"organizations": [], "uuid": "403a08bcd95ed15440013b9c5d9c533b2aee7979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30257715/an-actual-awareness-month-for-a-disease-with-little-to-no-awareness", "country": "US", "title": "An Actual Awareness Month for a Disease With Little to No Awareness", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "An Actual Awareness Month for a Disease With Little to No Awareness - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "403a08bcd95ed15440013b9c5d9c533b2aee7979"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30257715/an-actual-awareness-month-for-a-disease-with-little-to-no-awareness", "ord_in_thread": 0, "title": "An Actual Awareness Month for a Disease With Little to No Awareness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Lewy Body Dementia Association\nATLANTA , Oct. 14, 2015 /PRNewswire-USNewswire/ -- In its sixth year, during the month of October, the disease with the unusual name of Lewy body dementia (LBD) is being heralded as Lewy Body Dementia Awareness Month nationwide. Texas also recently designated October as Lewy Body Dementia Awareness Month for the Lone Star state. The Lewy Body Dementia Association (LBDA) is determined to keep sharing information until LBD rolls off the tongue as easily as other well-known diseases.\nAccording to James E. Galvin , M.D., M.P.H., Professor and Associate Dean of Clinical Biomedical Science, Charles E. Schmidt College of Medicine, Florida Atlantic University and board member of the LBDA, \"One of the reasons for the lack of awareness is because LBD has mixed elements of both Parkinson's and Alzheimer's, so it is frequently misdiagnosed. A misdiagnosis, however, can have serious consequences in prescribing the wrong medications, such as worsening LBD symptoms or causing a more rapid decline.\" Getting an LBD diagnosis takes an average of 18 months and visits to three different doctors. \"Informing caregivers, patients and the medical community about LBD is the key to receiving an earlier, correct diagnosis,\" added Galvin.\nOther Reasons Why LBD Awareness is So Important:\nApproximately 1.4 million people in the U.S. have LBD. Typical onset is after age 50. It is the second most common form of progressive dementia after Alzheimer's disease. Studies show LBD caregivers are more emotionally, physically and financially burdened than Alzheimer's caregivers, due to: Behavioral changes, leading some patients to be turned away from care facilities. Others not believing caregivers about the disease's seriousness, because people with LBD may go in and out of lucidity. Movement changes, including muscle stiffness, slowness or tremor. Isolation because the disease is not well-known or understood. What are Lewy Bodies and What do they do?\nLBD is characterized by an abnormal build-up of Lewy bodies, which are protein deposits in the brain cells that regulate behavior, memory, movement, and personality. It impairs thinking, movement, sleep, and behavior-causing hallucinations or acting out dreams. LBD also affects blood pressure control, temperature regulation, digestion, and other autonomic body functions. While there is currently no cure, recognizing symptoms early can help ensure quicker, appropriate treatment and caregiver support.\n\"Let's put an end to misdiagnoses, isolation, suffering and confusion,\" said Michael Koehler , Board President of the Lewy Body Dementia Association \"LBDA needs volunteers nationwide to help shine a light on LBD in their communities.\"\nThis year's awareness month theme is \"Let's Beat Lewy .\" The general public, healthcare community and LBD families can help \"beat\" LBD in a variety of ways:\nAttend a fundraiser or organize your own Participate in a LBD 5K Lobby local politicians for change Spread awareness on social media Donate Visit http://www.lbda.org/awareness_movement for further details. Proceeds will be donated to LBDA, the only national health organization in the United States providing comprehensive education and support for the 1.4 million people and families affected by LBD.\nAbout the Lewy Body Dementia Association\nThe Lewy Body Dementia Association (LBDA) is a nonprofit organization dedicated to raising awareness of Lewy body dementias (LBD), promoting scientific advances, and supporting people with LBD, their families and caregivers. LBD, a complex disease that can present with a range of physical, cognitive and behavioral symptoms, is a \"family disease.\" It dramatically affects not only the person diagnosed but also the primary caregiver. The only national health organization dedicated to LBD , LBDA supports all those affected by Lewy body dementias through outreach, education and research. To learn more about LBD and LBDA, please visit www.lbda.org .\n releases/an-actual-awareness-month-for-a-disease-with-little-to-no-awareness-300159483.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/an-actual-awareness-month-for-a-disease-with-little-to-no-awareness-300159483.html", "http://www.lbda.org/awareness_movement", "http://www.lbda.org/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC27823&Transmission_Id=201510140848PR_NEWS_USPR_____DC27823&DateId=20151014"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T19:51:53.579+03:00", "highlightTitle": ""}