{"organizations": [], "uuid": "a4ebd023dc7fb1ee95de97ab02a4e5e09c4357d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/5e/b1/5a76d5c847a9b5ac5ffb78b50b9b/151008-boston-editorial.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/08/obamas-college-scorecard-shows-pell-grant-data-problem", "country": "US", "title": "Obama's College Scorecard Shows Pell Grant Data Problem", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Obama's College Scorecard Shows Pell Grant Data Problem - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a4ebd023dc7fb1ee95de97ab02a4e5e09c4357d9"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/08/obamas-college-scorecard-shows-pell-grant-data-problem", "ord_in_thread": 0, "title": "Obama's College Scorecard Shows Pell Grant Data Problem", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama's College Scorecard Shows Pell Grant Data Problem There's finally federal data on low-income college graduation rates—but it's wrong. Boston University, which said the Department of Education's data about its students with Pell Grants was incorrect, held its commencement ceremonies on May 17, 2015.\nBy The Hechinger Report Oct. 8, 2015 | 5:56 p.m. EDT + More By Sarah Butrymowicz\nThe U.S. Department of Education has released college-by-college graduation rates for low-income students receiving federal grants, for the first time ever—information advocates, and Congress, have long demanded.\nBut there turns out to be a problem: A lot of the numbers are wrong.\nRELATED\nStudy: Pell Grant Success Dependent on Individual Schools In comparison to reviews of the same data by independent organizations, the Department of Education figures—released in conjunction with the Obama administration's long-awaited College Scorecard, which is meant to provide consumers with helpful information about universities and colleges—are off by an average of 10, and as much as 59, percentage points.\nThat's a wide margin of error in the realm of statistics.\n\"Ten percentage points is pretty worrisome for me,\" said Mamie Voight, director of policy research at the nonpartisan Institute for Higher Education Policy.\nThe figures measure the success of students who get Pell grants , which provide up to $5,775 a year and typically go to Americans from low-income families to pay for tuition or other college expenses at a cost to the federal government of more than $31 billion a year. Knowing how many of these students ever graduate not only tells taxpayers what they're getting for their money; it helps to measure the effectiveness of colleges and universities at helping all their undergraduates earn degrees.\nYet while schools are required by law to provide the graduation rates of Pell recipients to any applicants who ask, a loophole protects them from having to report the same figures to the government. So the Department of Education used something called the National Student Loan Database System, or NSLDS, to calculate the percentage of people with Pell grants who earn degrees in four, five and six years.\nTrouble is, the NSLDS was designed to keep track of student loans, not to monitor the graduation rates of Pell recipients. A student who gets a Pell grant, but doesn't get another federal loan, for instance, will likely be missed.\n\"It's not the best fix,\" said Andrew Nichols, director of higher education research and data analytics for The Education Trust, which advocates for low-income students.\n[ READ: Find Child Care Resources for Community College Students ]\nHigher-education lobbyists have objected to the College Scorecard on the grounds the information it provides is inaccurate or can be misleading. And, at least in this case, they appear to be right.\nThe analysis compared figures provided by the government with a report released last month by The Education Trust, which used data from state education systems, colleges and universities themselves and other sources, including U.S. News & World Report.\n\"The U.S. News data set allowed us to acquire Pell graduation rate data for many institutions, specifically private institutions that were not included in the collection from the systems and coordinating agencies,\" the report reads . \"We combined the U.S. News data with the IPEDS graduation rate data to construct a completion rate for the non-Pell Grant students, which was used to assess gaps in completion at each campus.\"\nThe Education Trust report shows that, on average, there's a 10 percentage point difference between what the College Scorecard materials estimate to be the percentage of Pell recipients who graduate within six years and what The Education Trust found they were at the 1,088 four-year institutions for which both have results.\nBoston University had the largest gap. According to the Department of Education numbers, only 25 percent of BU's students who get Pell grants graduated in 2013 with four-year degrees after even six years. The university's self-reported figure, however, is 84 percent. BU confirmed that the Department of Education's data was incorrect.\nCourtesy of Pew Research Center. A separate Hechinger Report analysis of Pell graduation rates obtained directly from the nation's 50 largest public and 32 biggest private colleges and universities—18 privates refused to provide them—also shows the same discrepancies with the Department of Education figures.\nAn Education Department official, who responded on condition that her name not be used, acknowledged that the data were imperfect and said that the department will work with universities and colleges to identify mistakes so that the rates grow more precise with time.\nVoight and other experts said there's no reason the data can't be accurate right now.\nThey said one solution would be to simply call for universities and colleges to give the government the graduation rates of their Pell students, just as they already submit their graduation rates broken down by race.\nWhile that's an option, the Department of Education official said, the agency is continuing to work with the existing data in NSLDS \"in the interest of minimizing the burden on institutions.\"\nRELATED\nWeigh Downsides of Tuition Assistance Through Employer-College Partnerships But experts said requiring that universities and colleges provide their Pell Grant graduation rates shouldn't be an additional burden, since they're already supposed to be calculating this number to provide to prospective students.\n\"That is not a real high bar to be able to do that,\" said Christine Keller, executive director of the Student Achievement Measure , which tracks individual students through their educations, and which is a project of two national associations of public universities, the Carnegie Corporation, and the Bill & Melinda Gates Foundation. (Carnegie and Gates are both among the funders of The Hechinger Report, which produced this story.) The data comes from a private, nonprofit, nongovernmental organization called the National Student Clearinghouse.\nThe groups involved in the Student Achievement Measure have called for a similar federal data system. There's a big obstacle to doing that, however: current law, pushed by higher-education groups, bans the Department of Education from collecting student-level data.\nChanging that might be a political hurdle, but Keller is hopeful.\n\"If we could lift the ban, if we could create from the beginning a data set that was intended to do these sort of calculations, we'd have more trustworthy, more valid, more accurate information rather than struggling with the weaknesses of some of the current systems and trying to fix them on the back end.\"\nThis story was produced by The Hechinger Report , a nonprofit, independent news organization focused on inequality and innovation in education. Read more about higher education .\nTAGS: colleges college admissions Pell grants student loans loans students financial aid graduation rates", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe0q9s%3Fsrc=usn_gp", "https://edtrust.org/resource/pellgradrates/", "http://hechingerreport.org/content/common-core-can-help-english-learners-california-new-study-says_17439/hechingerreport.org", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe0q9s%3Fsrc=usn_li&title=Obama%27s%20College%20Scorecard%20Shows%20Pell%20Grant%20Data%20Problem&summary=There%27s%20finally%20federal%20data%20on%20low-income%20college%20graduation%20rates%E2%80%94but%20it%27s%20wrong.&source=U.%20S.%20News", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe0q9s%3Fsrc=usn_rd&title=Obama%27s%20College%20Scorecard%20Shows%20Pell%20Grant%20Data%20Problem", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe0q9s%3Fsrc=usn_tw&via=usnews&text=Obama%27s%20College%20Scorecard%20Shows%20Pell%20Grant%20Data%20Problem", "https://collegescorecard.ed.gov/data/documentation/", "https://edtrust.org/wp-content/uploads/2014/09/MethodsDataCollection_ThePellPartnership_EdTrust_2015.pdf", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe0q9s%3Fsrc=usn_fb", "http://hechingerreport.org/category/higher_ed/", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe0q9s%3Fsrc=usn_su", "http://hechingerreport.org/an-unprecedented-look-at-pell-grant-graduation-rates-from-1149-schools/", "http://www.studentachievementmeasure.org/"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T03:12:15.770+03:00", "highlightTitle": ""}