{"organizations": ["USAToday.com", "Richmond International Raceway"], "uuid": "2721f3c0c6a44cfe2a7157747fe9d5ba496c774d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wtsp.com", "main_image": "http://cdn.tegna-tv.com/-mm-/9d89834e67febbd901162e52732538297c160e33/c=0-191-4680-2835&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/10/15/WTSP/WTSP/635804840558825354-GettyImages-492684478.jpg", "site_section": "http://rssfeeds.wtsp.com/_/20/108138838/wtsp/politicsandelections", "section_title": "WTSP - Politics", "url": "http://www.wtsp.com/story/news/politics/elections/2015/10/15/trump-handles-hecklers-calls-bernie-sanders-maniac/73973558/", "country": "US", "title": "Trump handles hecklers, calls Bernie Sanders a 'maniac'", "performance_score": 0, "site": "wtsp.com", "participants_count": 0, "title_full": "Trump handles hecklers, calls Bernie Sanders a 'maniac'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:39:00.000+03:00", "replies_count": 0, "uuid": "2721f3c0c6a44cfe2a7157747fe9d5ba496c774d"}, "author": "", "url": "http://www.wtsp.com/story/news/politics/elections/2015/10/15/trump-handles-hecklers-calls-bernie-sanders-maniac/73973558/", "ord_in_thread": 0, "title": "Trump handles hecklers, calls Bernie Sanders a 'maniac'", "locations": ["Va.", "Richmond", "Mandel Ngan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bernie Sanders", "Donald Trump"], "text": "Trump handles hecklers, calls Bernie Sanders a 'maniac' USA Today, USAToday.com 5:39 a.m. EDT October 15, 2015 Republican presidential candidate Donald Trump speaks during a rally at the Expo Hall of the Richmond International Raceway on Oct. 14, 2015 in Richmond, Va. (Photo: Mandel Ngan, AFP/Getty Images) 12 CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nDonald Trump continued his analysis of Tuesday’s night’s debate, which he live-tweeted , during a rally in Richmond, Va. on Wednesday. \nThe Republican front-runner’s biggest criticism was that he felt no one went after Hillary Clinton aggressively enough. “Nobody attacked her,” he said. “There was no attack.” \nThe moderators and other Democratic candidates stuck to policy questions, Trump said. In contrast, he felt the Republican debates were “like a reality-television show. With me, everything was an attack.” \nTrump was appalled at the extent to which he felt Clinton moved to the left to compete with Vermont Sen. Bernie Sanders, whom he calls a communist/socialist and a “maniac.” \n“I watched last night as Hillary and Bernie Sanders, they just couldn’t give away things fast enough,” Trump said, presumably referring to their promises of spending on programs such as higher education and paid family leave. “And they’re giving them to illegal immigrants. They want heath care for illegal immigrants. They want drivers licenses for illegal immigrants. They want, listen to this, social security for illegal immigrants.” \nOn health care, Trump promised to repeal Obamacare and replace it with “something that’s going to be terrific.” He said his plan will save money, allow patients to choose their doctors and feature lower deductibles. He did not, however, provide any further details. \nTrump sardonically praised Clinton for her flip-flop on the Trans-Pacific Partnership trade pact. \n“I have to hand it to Hillary Clinton. You’re all going to be mad at me, but I have to hand it to her,” he told the crowd of supporters. “It took great courage for her to go against President Obama on the trade pact. You know why? Because she could be indicted,” he said, implying that upsetting Obama could leave her open to prosecution for having classified material on her private email server. \n“Petraeus did 5% of what she did and they destroyed his life,” Trump said. \nAt one point, the crowd erupted in boos as a small group of immigration activists waived signs and began to heckle the candidate. \n“That’s alright,” Trump says as the boos subsided. “That’s why we have freedom of speech,” he said. \nAt least one Trump supporter was not as understanding, cursing and spitting on one protester .", "external_links": [], "published": "2015-10-15T12:39:00.000+03:00", "crawled": "2015-10-15T13:03:57.792+03:00", "highlightTitle": ""}