{"organizations": ["GOP", "U.S. Navy", "Facebook", "CNN", "Democratic", "Democratic Party"], "uuid": "6aaee5b0804bdd6c05f841ee970373fb3a1182a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151014005114-hillary-clinton-october-13-2015-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/13/politics/democratic-debate-fact-check/index.html?eref=rss_politics", "country": "US", "title": "Debate winners and losers", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Debate winners and losers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:25:00.000+03:00", "replies_count": 0, "uuid": "6aaee5b0804bdd6c05f841ee970373fb3a1182a5"}, "author": "", "url": "http://edition.cnn.com/2015/10/13/politics/democratic-debate-fact-check/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Debate winners and losers", "locations": ["Las Vegas", "Pacific Rim", "U.S.", "Washington", "Rhode Island", "United States of America", "Maryland", "Vermont", "Iraq"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Axelrod", "Brady Bill", "Lincoln Chafee", "Bernie Sanders", "Barack Obama", "Anderson Cooper", "Mark Preston", "Chafee", "O'Malley", "Gloria Borger", "Webb", "Obama", "Sanders", "Hillary Clinton", "Clinton", "African-American", "Jim Webb", "David Axelrod", "Martin O'Malley", "Bernie Sanders Bernie Sanders"], "text": "Debate Day superstitions and rituals: How CNNers amp up Washington (CNN) The field of Democratic presidential hopefuls faced off in their first debate, hosted by CNN and Facebook, on Tuesday night. For more than two hours, the candidates tried to make their best impressions before a national audience discovering many of them for the first time. Here's how they did: Hillary Clinton Read More Hillary Clinton proved without a doubt Tuesday night why she is the Democratic Party's presidential front-runner. Clinton remained unflappable throughout the debate, showcasing her political experience and her command of the issues -- all the while deftly handling criticism of her flip-flops and displaying a humor that put a more human face to her oft-criticized candidacy. From the outset, Clinton was pressed to defend her changing stances on various issues -- from the Pacific Rim trade deal to same-sex marriage -- and came out from the tough questioning with a strong one-liner that very much fits the frame of her campaign: \"I'm a progressive. But I'm a progressive who likes to get things done.\" David Axelrod, CNN senior political commentator and the chief strategist for the Obama campaign that trounced Clinton in 2008, said she did \"very well\" and that her campaign was likely \"thrilled with the performance.\" \"She was poised she was passionate and she was in command,\" Axelrod said. \"If I were her campaign I would be thrilled with what she did tonight.\" 10 photos: The first Democratic debate 10 photos: The first Democratic debate Democratic presidential candidates take the stage before debating in Las Vegas on Tuesday, October 13. From left are former U.S. Sen. Jim Webb, U.S. Sen. Bernie Sanders, former Secretary of State Hillary Clinton, former Maryland Gov. Martin O'Malley and former Rhode Island Gov. Lincoln Chafee. Hide Caption 1 of 10 10 photos: The first Democratic debate An audience member watches the debate, which was the first Democratic debate of this election cycle. Hide Caption 2 of 10 10 photos: The first Democratic debate Sanders speaks during the debate. CNN's Mark Preston said Sanders' opening remarks \"hit on all of the hot-button liberal issues: Take back the government from billionaires, climate change. He all but said it is time for a revolution.\" Hide Caption 3 of 10 10 photos: The first Democratic debate Clinton is the national front-runner in the Democratic race. \"I would not ask anyone to vote for me based on my last name,\" she said during the debate. \"I'm campaigning because I think I have the right combination of what Americans are looking for ... and I can take the fight to Republicans.\" Hide Caption 4 of 10 10 photos: The first Democratic debate Webb listens to moderator Anderson Cooper during the debate. Webb is a former Marine who also served as secretary of the U.S. Navy. \"You may be sure that in a Webb administration, the highest priority will be the working people who every day go out and make this country stronger at home, and who give us the right reputation and security overseas under a common-sense foreign policy,\" Webb said. Hide Caption 5 of 10 10 photos: The first Democratic debate O'Malley faces the camera while delivering remarks. He went after Sanders on gun control early in the debate, and -- in what could be interpreted as a veiled swipe at Clinton -- he said, \"I am very clear about my principles.\" Hide Caption 6 of 10 10 photos: The first Democratic debate Chafee touted his experience, saying he is the only candidate who has been a mayor, senator and governor. \"I have had no scandals. I've always been honest. I have the courage to take the long-term view, and I've shown good judgment,\" he said in his opening statement. Hide Caption 7 of 10 10 photos: The first Democratic debate One of the debate's memorable moments was when Sanders and Clinton shook hands following Sanders' take on the Clinton email scandal. \"Let me say something that may not be great politics, but the secretary is right -- and that is that the American people are sick and tired of hearing about the damn emails,\" Sanders said. \"Enough of the emails, let's talk about the real issues facing the United States of America.\" Hide Caption 10 photos: The first Democratic debate Audience members watch the debate. Hide Caption 10 photos: The first Democratic debate The Democratic field this year is less than half the size of the Republican field. Hide Caption 10 of 10 And Clinton showed her mettle when she came under attack from three of her opponents on the stage over her vote in favor of the Iraq War, dismissing the idea that her judgment should be questioned over that vote by tying in President Barack Obama's decision to tap her as secretary of state. And to top it off, she used the question to play up her foreign policy chops. \"I recall very well being on a debate stage, I think, about 25 times with then Senator Obama, debating this very issue. After the election, he asked me to become secretary of state. He valued my judgment, and I spent a lot of time with him in the Situation Room, going over some very difficult issues,\" Clinton said. Opinion: Clinton brings it In what came as a surprise to some pundits, Clinton also did not shy away from taking on her chief rival, Vermont Sen. Bernie Sanders. Clinton tested Sanders over his shifting stance on gun control in a way that he failed to do on her policy flips -- Sanders even appeared flustered. When asked whether Sanders is \"tough enough on guns,\" Clinton didn't do any tip-toeing. \"No, not at all,\" she said, before pointing out that Sanders has five times voted against the Brady Bill, which aimed to curtail gun violence. Clinton didn't just take on her runner-up, she also made a point of going after Republicans -- making the case yet again that she's the best prepared to take on the GOP in the general election. Unclear Bernie Sanders Bernie Sanders didn't shock anyone: he played to his base and thrived off the momentum that his insurgent campaign has enjoyed. But his attempts at expanding his base of support -- by including criminal justice reform in his opening statement and unequivocally stating \"Black lives matter\" later on -- checked boxes but likely didn't inspire voters in the African-American community. And he didn't do anything to convince voters he can overcome the electability hurdles a self-declared \"democratic socialist\" is sure to face in the general election. \"He spoke to his supporters. He spoke to the base of the Democratic Party. I'm not sure he showed why he's electable,\" CNN chief political analyst Gloria Borger said. 5 photos: Key quotes from the Democratic debate 5 photos: Key quotes from the Democratic debate Hide Caption 5 photos: Key quotes from the Democratic debate Hide Caption 5 photos: Key quotes from the Democratic debate Hide Caption 5 photos: Key quotes from the Democratic debate Hide Caption 5 photos: Key quotes from the Democratic debate Hide Caption 5 of 5 But one thing Sanders did show was his passion for addressing the core issues of his campaign: income inequality and reckless behavior and excesses on Wall Street. And for voters still getting introduced to Sanders, that's likely appealing. Sanders displayed the same impassioned, off-the-cuff speaking style that has galvanized hundreds of thousands of Americans to join what Sanders hopes will become a veritable \"political revolution.\" But the Vermont senator faced his toughest moment as he addressed his record on gun laws. It's the one issue where Clinton has consistently been to Sanders' left and he seemed ill-equipped to cope with her frontal attack.", "external_links": [], "published": "2015-10-14T20:25:00.000+03:00", "crawled": "2015-10-14T21:07:03.622+03:00", "highlightTitle": ""}