{"organizations": [], "uuid": "67b2237ed0d4898d21313e236833b32115d4fb88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://www.deccanchronicle.com/sites/default/files/black%20money%20-%20DC_0_0_1_0_0_0_0_0_0_2_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0.jpg", "site_section": "http://www.deccanchronicle.com/", "section_title": "Deccan Chronicle - Latest India news | Breaking news | Hyderabad News | World news | Business | Politics", "url": "http://www.deccanchronicle.com/151009/commentary-columnists/article/black-money-war-must-begin-home", "country": "US", "title": "Black money war must begin at home", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Black money war must begin at home | Deccan Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T10:13:00.000+03:00", "replies_count": 0, "uuid": "67b2237ed0d4898d21313e236833b32115d4fb88"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151009/commentary-columnists/article/black-money-war-must-begin-home", "ord_in_thread": 0, "title": "Black money war must begin at home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | Vivek Kaul | October 09, 2015, 01.27 am Representational Image By September 30, 2015, those who had black money hidden abroad had to declare it to the government. On this the government will charge a tax of 30 per cent and a penalty of 30 per cent. From the numbers that have been put out by the ministry of finance, and the fact that in the last one year the government has spent a huge amount of political capital on it, it’s clear that the effort to unearth black money that has moved abroad has been a complete flop.\nDuring the compliance period offered by the government, 638 declarants declared assets and income amounting to Rs 4,147 crore. There is perhaps more black money hidden just in Delhi. Given that the government is levying a 30 per cent tax and 30 per cent penalty on this money, the total revenue collected from this effort would be Rs 2,488 crore. This is not even a drop in the ocean of black money.\nIn response to this finance minister Arun Jaitley wrote on his Facebook page: “The bulk of black money is still within India. We thus need a change in national attitude where plastic currency becomes the norm and cash an exception. The government has been working to incentivise this change. The opening of a large number of payment gateways, Internet banking, payment banks and the emerging reality of e-commerce will prompt the use of plastic money significantly.”\nWith the rise of plastic money, the hope is that the total amount of black money generated in the Indian financial system will go down. With plastic money it is fairly easy to keep track of transactions and hence tax them. While this may or may not happen, there is a simple thing that Mr Jaitley and the Modi government can do to kickstart their war against domestic black money.\nIt should be made compulsory for political parties to receive donations only through the plastic money route and as cheques. Given that it is so passionate about unveiling black money in the country, the BJP can take a lead on this and start taking donations only through the plastic money and cheque route. One bogey that can be raised against this suggestion is about those who do not have a bank account. How will they donate money to a political party if they want to?\nThe ministry of finance in a press release dated September 4, 2015, had said: “The achievement under Pradhan Mantri Jan Dhan Yojana (PMJDY) is heading towards saturation. Initial demand for bank accounts was expected to be around 7.5 crore (75 million). However, so far close to 18 crore accounts have been opened. 15.74 crore Rupay debit cards have been issued.” If these numbers are to be believed, then most Indians now have access to a formal banking channel. They also have debit cards. And these can be used to make donations to political parties.\nWhile everyone who has a debit card may not know how to use them currently, it can be easily taught. Prime Minister Modi has communicated extensively on asking people to give up their subsidised cooking gas. He can do the same with Rupay debit cards. The government can run ad campaigns on it as well.\nOnce donations made to political parties move away from cash, there will be an audit trail. No black money will go into the funding of parties, breaking the nexus between politicians and those who have black money. Once black money stops funding political parties, the government (the present government and the ones to come) is bound to crack down on domestic black money. Until then they will only make statements because there is no incentive to crack down on black money.\nAlso, political parties should be brought under the ambit of the RTI Act. The government is against this move. In an affidavit submitted to the Supreme Court in late August 2015, the Modi government had said: “If political parties are held to be public authorities under RTI Act, it would hamper their smooth internal working, which is not the objective of the RTI Act and was not envisaged by Parliament. Further, it is apprehended that political rivals might file RTI applications with malicious intentions, adversely affecting their political functioning.”\nI guess the only reason the government is opposing political parties being brought under RTI is because then people can file an RTI and be able to get the funding details of political parties. And that is something no political party is comfortable with.\nAt the state level, real estate companies are big financiers of political parties. Real estate is where most black money gets invested. Once political parties are brought under RTI, this nexus can start to unravel as well. The nation has a genuine problem of black money. The problem is well known. The solutions to it are also well known. The question is, will our politicians do something about it or will they just keep talking about it?\nVivek Kaul is the author of the Easy Money trilogy.\nHe tweets at @kaul_vivek\n Black money plastic money Columnists commentary Also Read Ghani’s visit opens a window of possibilities Rage in the margins Indian economy is a work in progress Regions out, nation in", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/black%20money%20-%20DC_0_0_1_0_0_0_0_0_0_2_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0.jpg", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/black%20money%20-%20DC_0_0_1_0_0_0_0_0_0_2_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0_0.jpg", "http://www.facebook.com/sharer.php", "http://twitter.com/share?url=http://www.deccanchronicle.com/151009/commentary-columnists/article/black-money-war-must-begin-home", "http://vuukle.com/js/vuukle.js"], "published": "2015-10-09T10:13:00.000+03:00", "crawled": "2015-10-08T23:43:00.401+03:00", "highlightTitle": ""}