{"organizations": [], "uuid": "0e3f96d85e01cd20f6cf14347d4df7fb217623ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.vice.com", "main_image": "https://news-images.vice.com/images/articles/meta/2015/10/20/us-immigration-officials-accused-of-recruiting-colleagues-for-sex-parties-1445362989.jpg?crop=0.6647173489278753xw:1xh;0.1968810916179337xw,0xh", "site_section": "https://news.vice.com/topic/politics", "section_title": "Politics | VICE News", "url": "https://news.vice.com/article/us-immigration-officials-accused-of-recruiting-colleagues-for-sex-parties", "country": "US", "title": "US Immigration Officials Accused of Recruiting Colleagues for Sex Parties", "performance_score": 0, "site": "vice.com", "participants_count": 1, "title_full": "US Immigration Officials Accused of Recruiting Colleagues for Sex Parties | VICE News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "0e3f96d85e01cd20f6cf14347d4df7fb217623ff"}, "author": "VICE News", "url": "https://news.vice.com/article/us-immigration-officials-accused-of-recruiting-colleagues-for-sex-parties", "ord_in_thread": 0, "title": "US Immigration Officials Accused of Recruiting Colleagues for Sex Parties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The US Immigration and Customs Enforcement agency (ICE) confirmed Tuesday that it is investigating allegations that ICE officials in San Diego enlisted subordinates for sex parties while on the job.\nThe San Diego Union-Tribune reported on Monday that it had obtained a copy of a complaint filed by ICE employees in San Diego that includes lurid details of carnal soirees as well as allegations of abuse of power. Employees at the ICE Enforcement Removal Operations office in San Diego accused their supervisor of recruiting employees on government time to participate in collective hanky-panky after-hours with him and his wife — who also worked for ICE.\nThe complaint was submitted earlier this year to the Inspector General's Office and is currently being investigated.\n\"The agency takes all allegations of misconduct seriously,\" Lauren Mack, an ICE spokesperson, said in a statement. \"The matter... has been referred to ICE Homeland Security Investigations Office of Professional Responsibility (OPR) for further investigation. That inquiry is ongoing and, as such, we are unable to offer further comment at this time.\"\nMack declined to elaborate further on the details of the investigation.\nRelated: DOJ Report Reveals DEA Agent 'Sex Parties'\nThe unnamed supervisor is said to have approached colleagues at work to ask if they wanted to come over to his house to engage in a swinger-style sex party. Using his personal phone, he also allegedly texted and emailed his co-workers while at work to tell them about the erotic shindigs.\nSubordinates and junior employees felt under pressure to participate, according to the complaint, which provides odd details of the X-rated gatherings. After arriving, the participants were stripped of their phones and ushered into a backroom.\n\"The parties take place while their kids are watching a movie in their rooms,\" the complaint read. \"Kids are told that mom and dad are working on a project with the other couples and not to disturb them nor knock on the bedroom door for at least an hour.\"\nThese frolics, the complaint alleges, created a hostile work environment.\n\"Employees are being affected, traumatized, coerced and violated,\" it said. \"It is an abuse of authority and needs to stop.\"\nPhoto via Wikimedia Commons", "external_links": ["https://commons.wikimedia.org/wiki/File:US_Immigration_and_Customs_Enforcement_SWAT.jpg", "http://www.sandiegouniontribune.com/news/2015/oct/19/complaint-alleges-swingers-parties-for-ice-agents/"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-22T03:09:44.664+03:00", "highlightTitle": ""}