{"organizations": [], "uuid": "ff366cfc1b12550a61f99b2fdacdeb722dfa231a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "https://www.nationformarriage.org/email/graphics/2015/10/nom-email-header-retina-2015-10-09_newsletter.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/prominent-legal-scholars-declare-supreme-court-marriage-ruling-anti-constitutional-and-illegitimate-and-not-binding-precedent-3063080.html", "country": "US", "title": "Prominent Legal Scholars Declare Supreme Court Marriage Ruling \"Anti-Constitutional and Illegitimate\" and Not Binding Precedent | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Prominent Legal Scholars Declare Supreme Court Marriage Ruling \"Anti-Constitutional and Illegitimate\" and Not Binding Precedent | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:28:00.000+03:00", "replies_count": 0, "uuid": "ff366cfc1b12550a61f99b2fdacdeb722dfa231a"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/prominent-legal-scholars-declare-supreme-court-marriage-ruling-anti-constitutional-and-illegitimate-and-not-binding-precedent-3063080.html", "ord_in_thread": 0, "title": "Prominent Legal Scholars Declare Supreme Court Marriage Ruling \"Anti-Constitutional and Illegitimate\" and Not Binding Precedent | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nDear Marriage Supporter,\nMarking the opening of the new US Supreme Court term this week, a group of over 60 prominent legal scholars has issued a major statement declaring that the notorious ruling from the last Court term which purported to redefine marriage in the Obergefell v Hodges case is “anti-constitutional and illegitimate” and should not be treated public officials or citizens as binding precedent or settled law. The scholars, including NOM co-founder Professor Robert George and Chairman Dr. John Eastman, said that the decision is, “lacking anything remotely resembling a warrant in the text, logic, structure, or original understanding of the Constitution” and “must be judged anti-constitutional and illegitimate.” They called on the other branches of government and American citizens to refuse to treat the decision as binding precedent or consider it to have settled the law of the United States.\n“We stand with James Madison and Abraham Lincoln in recognizing that the Constitution is not whatever a majority of Supreme Court justices say it is,” said NOM’s co-founder Professor Robert P. George, the McCormick Professor of Jurisprudence at Princeton University and one of the authors of the statement. “We remind all officeholders in the United States that they are pledged to uphold the Constitution of the United States, not the will of five members of the Supreme Court.”\nThe legal scholars called on all state and federal officeholders:\n“To refuse to accept Obergefell as binding precedent for all but the specific plaintiffs in that case. To recognize the authority of states to define marriage, and the right of federal and state officeholders to act in accordance with those definitions. To pledge full and mutual legal and political assistance to anyone who refuses to follow Obergefell for constitutionally protected reasons. To open forthwith a broad and honest conversation on the means by which Americans may constitutionally resist and overturn the judicial usurpations evident in Obergefell .” The sixty-four legal scholars who signed the statement when issued (four others have since added their names) emphasized that the course they are advocating is neither extreme nor disrespectful of the rule of law, relating their position to that of President Lincoln who regarded the claim of supremacy for the Supreme Court in matters of constitutional interpretation as incompatible with the republican principles of the Constitution. Quoting from President Lincoln’s first inaugural address, the scholars said that if Americans succumb to the idea of judicial supremacy, “the people will have ceased to be their own rulers, having to that extent practically resigned their government into the hands of that eminent tribunal.”\nThe statement from the scholars including NOM’s Chairman, Dr. John Eastman (the Henry Salvatori Professor of Law & Community Service, Dale E. Fowler School of Law at Chapman University) said, “To treat as “settled” and “the law of the land” the decision of five Supreme Court justices who, by their own admission, can find no warrant for their ruling in the text, logic, structure, or original understanding of the Constitution, would indeed be to resign our government into the hands of that eminent tribunal. That is something that no citizen or statesman who wishes to sustain the great experiment in ordered liberty bequeathed to us by our Founding Fathers should be willing to do.”\nThis statement from some of the top legal experts in America is a major development, one that will help focus attention on the utter lack of legal authority the Supreme Court had to redefine marriage. Since the moment the decision was issued last June, NOM has declared it to be illegitimate because it completely lacks any constitutional basis. It simply represents the desire of five justices to cast aside constitutional principles and millennia of understanding about marriage in order to gain favor with popular culture and powerful constituencies.\nNOM is working to overturn the Supreme Court’s Obergefell ruling, and enact legislative protections for people of faith so that they are not punished by government for living out the truth of marriage in their daily lives. You can read our five-point plan here.\nAlabama Judges Refuse To Issue Same-Sex ‘Marriage’ Licenses Taking the admonishment of legal scholars to heart that the Supreme Court’s marriage ruling in Obergefell is illegitimate, several Alabama probate judges have petitioned the state Supreme Court for a judgement upholding the state constitution and prohibiting the state from issuing same-sex ‘marriage’ licenses. The judges acknowledge that the state must “recognize” same-sex ‘marriage’ licenses issued elsewhere that are valid under the laws of other states, but that the federal government is powerless to force the state to itself issue licenses that violate its state constitution. Saying that the Obergefell ruling was “born from a strained interpretation of the US Constitution, the new same-sex marriage license is a child of the federal government, not the State of Alabama…Therefore, the recognition of same-sex marriage as a civil right under the United States Constitution vests the U.S. Congress with the authority and responsibility to enforce the right and to provide the appropriate licensing, the same as it exclusively does in many other areas of federal law.”\nThe actions by these Alabama Probate Judges are welcome, because it puts into focus the constitutional limitations between the three federal branches of government. It’s one thing for the US Supreme Court to issue a ruling, but they have no power to force other branches of government, or the states, to enforce it. There is no such thing as “judicial supremacy” under the constitution. The Supreme Court is supreme only as to its position within the federal court system. They are not superior to the legislative or judicial branches of government. These branches of government, and the states as well, have the power to assess the legitimacy of any ruling issued by the Court and determine for themselves how, if at all, to give it force and effect. This was the principle invoked by President Lincoln when he refused to consider the ruling of the Supreme Court in the Dred Scott case as binding on anyone but the specific parties to the case.\nThus, as the legal scholars pointed out in their statement, the Obergefell ruling should be considered binding only on the plaintiffs in that particular case. It’s up to the Congress to determine if it wishes to enact statutes providing for the issuance of federal same-sex ‘marriage’ licenses. No state can be compelled to issue marriage licenses in violation of the laws or constitution of that state.\nAnother Kentucky Clerk Joins Kim Davis in Refusing To Issue Same-sex ‘Marriage’ Licenses A third elected county clerk in Kentucky has joined Kim Davis in refusing to violate her conscience and the constitution of the state of Kentucky by issuing ‘marriage’ licenses to same-sex couples. According to media reports , Whitley County Clerk Kay Schwartz will not issue same-sex marriage licenses which are illegal under Kentucky law. The ACLU is considering a lawsuit to attempt to force her to issue the licenses even though doing so violates both her conscience and the state constitution.\nSupport the First Amendment Defense Act If you have not done so already, now is a perfect time to contact your members of Congress to urge them to sign on to support the First Amendment Defense Act (HR 2802/S 1598). There are 150 sponsors and co-sponsors in the House of Representatives, and 38 in the US Senate. NOM is working hard with allies to advance this critical legislation to protect individuals, nonprofit groups, ministers and churches from government retaliation simply for standing for the truth of marriage in the public square. We are hoping for hearings in the next few weeks, so it is imperative that you weigh in with your federal representatives to urge their support of this critical legislation.\nNOM Needs Your Support Our plate is full with work that needs to be done to restore marriage to the law, protect the rights of people to continue to support marriage without fear of retaliation, and engage the culture at all levels on the critically important role a thriving marriage cultures contributes to society. We depend on you and other grassroots supporters to continue our work. Please consider making a gift of $15, $25, $50 or $100 or more.\nDonate and Have Your Gift Matched Today! Your contribution of any amount through the end of the year will be matched by a generous supporter, doubling the effectiveness of your gift. This is a great blessing, and will provide much needed financial support. If you can make a generous donation of $25, $50 or even $100, NOM will get double the help , and it will come at a critical time.\nThank you for all your efforts to support marriage.\nFaithfully,\nDonate Today", "external_links": ["http://feeds2.feedburner.com//nom/https://americanprinciplesproject.org/founding-principles/statement-calling-for-constitutional-resistance-to-obergefell-v-hodges%E2%80%AF/", "http://feeds2.feedburner.com//nom/https://nationformarriage.org/donate/c4/?utm_source=vervemail&#038;utm_medium=email&#038;utm_campaign=newsletter-2015-10-09&#038;utm_content=donatelink2&#038;ref=EN151009NANT", "https://www.nationformarriage.org/email/graphics/2015/10/nom-email-header-retina-2015-10-09_newsletter.jpg", "http://www.wkyt.com/wymt/home/headlines/Whitley-County-clerk-says-she-is-issuing-marriage-licenses-but-not-to-same-sex-couples-330176061.html", "http://feeds2.feedburner.com//nom/https://www.nationformarriage.org/email/graphics/2015/10/100915-Petition-Judge-Enslen-for-declaratory-judgment.pdf", "https://www.nationformarriage.org/email/graphics/template/brian-brown-signature.jpg", "http://www.nomblog.com/40532/", "http://feeds2.feedburner.com//nom/https://nationformarriage.org/donate/c4/?utm_source=vervemail&#038;utm_medium=email&#038;utm_campaign=fr-2015-10-09&#038;utm_content=donatebuttonbottom&#038;ref=EB151009NANT", "http://feeds2.feedburner.com//nom/https://nationformarriage.org/donate/c4/?utm_source=vervemail&#038;utm_medium=email&#038;utm_campaign=newsletter-2015-10-09&#038;utm_content=donatelink1&#038;ref=EN151009NANT", "http://feeds2.feedburner.com//nom/https://nationformarriage.org/donate/c4/?utm_source=vervemail&#038;utm_medium=email&#038;utm_campaign=fr-2015-10-09&#038;utm_content=donatecta1&#038;ref=EB151009NANT", "http://feeds2.feedburner.com//nom/https://www.congress.gov/bill/114th-congress/house-bill/2802?q=%7B%22search%22%3A%5B%22%5C%22hr2802%5C%22%22%5D%7D&#038;resultIndex=1"], "published": "2015-10-09T22:28:00.000+03:00", "crawled": "2015-10-10T02:00:59.588+03:00", "highlightTitle": ""}