{"organizations": [], "uuid": "a5cbceb9ab934672606c7cd06f1106c2a429291b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30304053/voters-want-congress-to-close-the-online-sales-tax-loophole", "country": "US", "title": "Voters Want Congress To Close The Online Sales Tax Loophole", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Voters Want Congress To Close The Online Sales Tax Loophole - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "a5cbceb9ab934672606c7cd06f1106c2a429291b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30304053/voters-want-congress-to-close-the-online-sales-tax-loophole", "ord_in_thread": 0, "title": "Voters Want Congress To Close The Online Sales Tax Loophole", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " International Council of Shopping Centers (ICSC)\nNew National Poll Shows Continued Strong Support for Federal Legislation\nWASHINGTON , Oct. 20, 2015 /PRNewswire-USNewswire/ -- Today the International Council of Shopping Centers (ICSC) released the results of a national poll that shows that seven out of 10 registered voters support federal legislation that requires online-only sellers to collect sales tax at the time of purchase. This is the fourth year in a row that Americans from across the political spectrum have expressed overwhelming support for efairness legislation to close the online sales tax loophole.\n\"The shopping center industry is a premier driver of economic activity and one way our centers accomplish this is through the collection and remittance of sales taxes, which provide communities the revenue they need to fund critical municipal services,\" said Tom McGee , president and CEO of ICSC. \"It's time to level the playing field so that online-only sellers compete under the same rules.\"\nThe national poll also found that eight out of 10 Americans think collecting sales tax from online-only vendors at the time of purchase is easier than the current system of self-reporting. This is the only national poll that has tracked attitudes among voters on these two issues for four consecutive years.\nThe national poll identified a number of key findings, including:\nSeven out of 10 Americans support federal legislation that would require online-only vendors to collect sales tax at the time of purchase. Eight out of 10 Americans think it would be easier to collect sales tax from online-only vendors at the time of purchase. Over half of Americans think that the current uneven playing field is inherently unfair and gives online-only vendors a clear, competitive advantage. Nine out of 10 Americans say local retailers are important to their community's economic health and prosperity. \"Year after year voters continue to voice overwhelmingly strong support for federal legislation that closes the online sales tax loophole and makes sure that all retailers are free to compete for customers and sales without the federal government picking winners and losers in the marketplace,\" said Betsy Laird , senior vice president of Global Public Policy for ICSC. \"Americans have spoken; it's time to pass efairness legislation.\"\nICSC has promoted efairness for more than a decade, advocating that a \"sale is a sale\" regardless of whether the purchase takes place on Main Street, at shopping centers, or over the Internet. For more information about efairness and how the current sales tax system is unable to support the 21 st century retail marketplace, please visit efairness.org .\nAbout ICSC\nFounded in 1957, ICSC is the global trade association of the shopping center industry. Its more than 70,000 members in over 100 countries include shopping center owners, developers, managers, investors, retailers, brokers, academics, and public officials. The shopping center industry is essential to economic development and opportunity. They are a significant job creator, driver of GDP, and critical revenue source for the communities they serve through the collection of sales taxes and the payment of property taxes. These taxes fund important municipal services like firefighters, police officers, school services, and infrastructure like roadways and parks. Shopping centers aren't only fiscal engines however; they are integral to the social fabric of their communities by providing a central place to congregate with friends and family, discuss community matters, and participate in and encourage philanthropic endeavors. For more information about ICSC visit www.icsc.org and for the latest news from ICSC and the industry go to www.thecenterofshopping.com .\nAbout the Survey\nOpinion Research Corporation (ORC) conducted a survey among two national probability samples, which, when combined, consists of 1,008 adults, 507 men and 501 women 18 years of age and older, living in the continental United States . Interviewing for this CARAVAN® Survey was completed on September 10-13, 2015 . 508 interviews were from the landline sample and 500 interviews from the cell phone sample.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/voters-want-congress-to-close-the-online-sales-tax-loophole-300162608.html\n ", "external_links": ["http://www.icsc.org/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC32726&Transmission_Id=201510200800PR_NEWS_USPR_____DC32726&DateId=20151020", "http://www.efairness.org/", "http://www.prnewswire.com/news-releases/voters-want-congress-to-close-the-online-sales-tax-loophole-300162608.html", "http://www.thecenterofshopping.com/"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T18:32:30.679+03:00", "highlightTitle": ""}