{"organizations": [], "uuid": "e88261210288ecc1dcec05bb23960b829c2c4685", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/362e69e5-57d4-4cd8-bcb5-f7b55d5c60e0.img", "site_section": "http://www.ft.com/rss/world/us/politics", "section_title": "US politics news - latest US politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/5883ac2c-78dc-11e5-a95a-27d368e1ddf7.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Clinton defiant over embassy attack", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Clinton defiant over embassy attack", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T04:07:00.000+03:00", "replies_count": 0, "uuid": "e88261210288ecc1dcec05bb23960b829c2c4685"}, "author": "", "url": "http://www.ft.com/cms/s/0/5883ac2c-78dc-11e5-a95a-27d368e1ddf7.html?ftcamp=published_links%2Frss%2Fworld_us_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Clinton defiant over embassy attack", "locations": ["Benghazi", "Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Barney Jopson", "Demetri Sevastopulo"], "text": "Clinton defies Republican criticism over Benghazi attack Demetri Sevastopulo and Barney Jopson in Washington ©AP \nHillary Clinton, the former US secretary of state who is running for president, faced heavy criticism on Thursday from Republicans on the Congressional committee investigating the 2012 attack on the US consulate in Benghazi that claimed the lives of four Americans including the US ambassador. \nIn a gruelling hearing that ended 11 hours after it began on Thursday morning, Republicans grilled Mrs Clinton, the secretary of state from 2009 to 2013, over her role in the US decision to join the European campaign in Libya, her role overseeing security for state department staff overseas and her use of a private email account for official business. More Biden’s exit comes with sting for Clinton \nThe Select Committee on Benghazi is the ninth congressional probe into the attack on the US diplomatic compound. Republican leaders established the committee, placing Trey Gowdy, a former prosecutor, in charge, as the other panels failed to reach any conclusion about the attack. \n“Why were there so many requests for more security personnel and equipment, and why were those requests denied in Washington,” Mr Gowdy said as he opened the long-awaited hearing into the attack in Libya. \nDuring the hearing Mrs Clinton maintained her composure to avoid providing Republicans with material to use against her in the presidential election. But she was very firm in defending herself, while subtly accusing Republicans of playing politics with the investigation. \n“We need leadership at home to match our leadership abroad. Leadership that puts national security ahead of politics and ideology,” Mrs Clinton said in her opening statement. \nThroughout her appearance, Mrs Clinton was asked why she did not respond to requests from US officials in Benghazi for more protection as the security situation deteriorated. “It is not about what you knew about them. It is about what you did about them. And that was nothing,” said Lynn Westmoreland, an Arkansas Republican. Why didn’t you fire someone? \n- Mike Pompeo, a Republican congressman \nMrs Clinton rejected claims that she paid insufficient attention to security. “Well, Congressman, of course I made it abundantly clear that we had to do everything we could to protect our people. What I did not — and do not believe any secretary should — do was to substitute my judgment from thousands of miles away for the judgment of the security professionals who made the decisions about what kind of security would be provided.” \n“Why didn’t you fire someone?” asked Mike Pompeo, a Republican congressman, in response to a report into the attack which concluded that state department security personnel had made mistakes. \nDemocrats accuse Republicans of using the probe to attack Mrs Clinton to damage her presidential campaign. Adam Smith, a Democrat from Washington, pointed out that some of the questions were focused on issues that were not germane, such as what Mrs Clinton’s role was in the US decision to join the campaign to oust Libyan leader Muammer Gaddafi. \n“That is not about the attack on Benghazi,” said Mr Smith. “We have seen that this committee is focused on you,” said Mr Smith. “There were many other agencies involved in this and yet yours is the one that they have aggressively focused on.” Clinton faces Benghazi questions: as it happened \nCongress quizzes Democratic candidate on 2012 attack \nRead more \nThe view that Republicans are politicising Benghazi to hurt Mrs Clinton rather than establish what happened was given more credence when Kevin McCarthy , the Republican House majority leader, recently suggested that the committee was established to demonstrate that she is not trustworthy. \nIn an interview with Fox News last month, Mr McCarthy said: “Everybody thought Hillary Clinton was unbeatable, right? But we put together a Benghazi special committee, a select committee. What are her numbers today? Her numbers are dropping. Why? Because she’s untrustable. But no one would have known any of that had happened, had we not fought.” \nThe Benghazi hearing was an important opportunity for Mrs Clinton to push back against suggestions that she is not trustworthy, a charge that has dogged her presidential campaign. In a Quinnipiac poll earlier this year, when people asked what word they most associated with Mrs Clinton, the top answers were “liar”, “dishonest” and “untrustworthy”. \nOne driver of that sentiment was the revelation this year that Mrs Clinton used a private email account — hosted on a private server in her home — for her state department business, and the perception that she was not forthcoming about what has been called a “home brew” arrangement. \nWhile the Benghazi committee has so far failed to uncover any smoking gun that suggests that Mrs Clinton was in some way responsible for the attack and deaths in Libya, Mr Gowdy’s panel was the one which discovered that Mrs Clinton had not used a government email address for her official work. \nAt nearly 9pm on Thursday, a weary looking Mrs Clinton finished answering questions from members of the committee, which many commentators concluded had conducted a partisan attack on the former secretary of state.", "external_links": [], "published": "2015-10-23T04:07:00.000+03:00", "crawled": "2015-10-23T05:31:23.177+03:00", "highlightTitle": ""}