{"organizations": ["FOX", "House GOP", "WVUE New Orleans News"], "uuid": "c515e587322c1b676d399f68faf1d34a01bc9c10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://images.worldnow.com/AP/images/9072524_G.jpg", "site_section": "http://www.fox8live.com/category/13571/political-news?clienttype=rss", "section_title": "FOX 8 News WVUE-TV - Political - Headline", "url": "http://www.fox8live.com/story/30322720/in-speaker-bid-rep-ryan-sparks-debate-on-work-life-balance", "country": "US", "title": "In speaker bid, Rep. Ryan sparks debate on work-life balance", "performance_score": 0, "site": "fox8live.com", "participants_count": 0, "title_full": "In speaker bid, Rep. Ryan sparks debate on work-life balance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:48:00.000+03:00", "replies_count": 0, "uuid": "c515e587322c1b676d399f68faf1d34a01bc9c10"}, "author": "", "url": "http://www.fox8live.com/story/30322720/in-speaker-bid-rep-ryan-sparks-debate-on-work-life-balance", "ord_in_thread": 0, "title": "In speaker bid, Rep. Ryan sparks debate on work-life balance", "locations": ["Wis.", "Washington", "Capitol Hill"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MARY CLARE JALONICK", "ERICA", "Ryan", "Paul Ryan", "Harnik"], "text": "In speaker bid, Rep. Ryan sparks debate on work-life balance - FOX 8 WVUE New Orleans News, Weather, Sports, Social Member Center: Mobile Apps In speaker bid, Rep. Ryan sparks debate on work-life balance (AP Photo/Andrew Harnik). In this Oct. 20, 2015, photo, Rep. Paul Ryan, R- Wis., speaks at a news conference following a House GOP meeting on Capitol Hill in Washington. Ryan may or may not become the next speaker of the House. He’s already become an u... By MARY CLARE JALONICK and ERICA WERNERAssociated Press \nWASHINGTON (AP) - Republican Rep. Paul Ryan is likely to become the next speaker of the House. He's already become an unlikely spokesman for balancing family life with work. \nA reluctant candidate for the top leadership post, the 45-year-old Ryan made clear this week that he will step up only under several conditions. One is reducing the travel time and fundraising associated with being speaker, so that he can spend weekends at home in Janesville, Wisconsin, with his wife, Janna, and three school-age kids. \n\"I cannot and will not give up my family time,\" he said after a private meeting with House Republicans on Tuesday. \"I may not be able to be on the road as much as previous speakers, but I pledged to make up for it with more time communicating our message.\" \nRyan's comments made him the rare Republican, and man, to spotlight the difficulties of balancing the demands of work life and family in an increasingly fast-paced world. \n\"Three cheers for Paul Ryan,\" said Anne-Marie Slaughter, a former State Department official and author of an attention-getting 2012 essay in The Atlantic on leaving her high-level job to head home to her husband and two boys. She said she is pleased that a high-profile man is shedding light on the issue. \n\"He'll reinvent the job,\" Slaughter said in an interview Wednesday. \"We'll see how he does it.\" \nNot everyone is pleased with Ryan's approach. It has met with resistance from some conservatives, inside and outside of Congress, who said being speaker requires total commitment. \nRep. Tim Huelskamp, R-Kan., a member of the hard-line Freedom Caucus, said he has concerns about Ryan's conditions on family time. \n\"Speaker's a big job,\" Huelskamp said. \"And it's not a 9-to-5 job. So there are a lot of questions to be answered.\" \nAnother caucus member, Rep. Mick Mulvaney, R-S.C., said most members won't fault Ryan for wanting that family time and that it probably won't be a determining factor in whether he becomes speaker. \n\"At the same time, we all know that this job by its very nature takes certain sacrifices and if you want to move up the ladder, it takes more sacrifices,\" Mulvaney said. \nOther Republicans balked at anyone who would question Ryan's request. Oklahoma Rep. Tom Cole, a Ryan supporter, said home time would give Ryan balance. \n\"Look at how productive he's been,\" Cole said. \"Anybody making a point like that probably hasn't chaired two committees, written four budgets that passed, run for vice president of the United States and now being in a position to be speaker of the House. The guy's not an underachiever.\" \nRyan would bring generational change as speaker, and his comments are partly a reflection of that. Most previous speakers have been older men. The current speaker, Rep. John Boehner, R-Ohio, and the previous one, Rep. Nancy Pelosi, D-Calif., are grandparents. \n\"It's difficult,\" said Rep. Carlos Curbelo, R-Fla., who is 35 and the father of two young children. He said he tries to bring them with him to official events so he gets to spend more time with them. \nGroups that have advocated for better family leave policies were quick to praise Ryan for talking about spending more time with his children - and quick to criticize him for not being supportive enough of leave for others. Several advocacy groups pointed out that Ryan twice voted against legislation that would have given federal employees paid parental leave. \nThe group Family Values @ Work said that most Americans don't have the resources Ryan does to demand more family time. \n\"We urge Rep. Ryan to expand his gaze from his own family to those of the entire nation,\" said Ellen Bravo, the group's executive director. \nSen. Elizabeth Warren, D-Mass., chimed in with a tweet directed at Ryan: \"Family time should not be a privilege reserved for the speaker of the House. You deserve it - and so does everyone else.\" \nSlaughter said Ryan's demands are particularly influential because he is a man. Women often face scrutiny for saying the same things, she said. \n\"If Nancy Pelosi said that, it would be all over,\" Slaughter said. \nAs Ryan has weighed a run, current GOP leaders said they were working to convince him that the family time would not be a problem. \n\"I think there's a way to do that,\" Boehner, known for his prolific fundraising, said on Wednesday. \"And I frankly outlined over the last week or so a way that Paul could do this differently than the way I did it.\" \nLouisiana Rep. Steve Scalise, the No. 3 Republican in House leadership, told Ryan in a phone conversation recently that he tries to keep weekends free by fundraising on Fridays or on weekdays during periods when the House isn't in session. \nThe next weekend Scalise texted Ryan a photo of himself and his two children, covered in Silly String at a local festival. \n___ \nFind Mary Clare Jalonick on Twitter at http://twitter.com/MCJalonick Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-22T17:48:00.000+03:00", "crawled": "2015-10-22T17:56:34.607+03:00", "highlightTitle": ""}