{"organizations": [], "uuid": "686e13dff2818ef693eec0cde9bf5d9013e6200d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nymag.com", "main_image": "http://pixel.nymag.com/imgs/daily/intelligencer/2015/10/15/15-robert-kathleen-durst.w1200.h630.jpg", "site_section": "http://nymag.com/thecut/", "section_title": "The Cut – Fashion, Beauty, Politics, Sex and Celebrity", "url": "http://nymag.com/daily/intelligencer/2015/10/civil-suit-to-be-filed-against-the-jinxs-durst.html", "country": "US", "title": "Civil Suit to Be Filed Against Jinx’s Durst -- NYMag", "performance_score": 0, "site": "nymag.com", "participants_count": 1, "title_full": "Civil Suit to Be Filed Against The Jinx’s Durst -- NYMag", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:48:00.000+03:00", "replies_count": 0, "uuid": "686e13dff2818ef693eec0cde9bf5d9013e6200d"}, "author": "Lisa DePaulo", "url": "http://nymag.com/daily/intelligencer/2015/10/civil-suit-to-be-filed-against-the-jinxs-durst.html", "ord_in_thread": 0, "title": "Civil Suit to Be Filed Against Jinx’s Durst -- NYMag", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Courtesy of HBO\nThe family of Robert Durst's first wife, Kathleen, who mysteriously disappeared in 1982, took the first step Thursday afternoon in pursuing a wrongful-death civil suit against the real-estate heir and suspected murder. Durst, 72, is in federal prison in Louisiana on gun and drug charges and is awaiting trial in Los Angeles for killing his close friend, writer Susan Berman . Durst, who is worth an estimated $110 million, has never been charged in his wife's disappearance on a night the couple fought at their home on a lake in the Westchester County village of South Salem. Durst told police that Kathleen, who went by Kathie, returned alone on a train to New York City that night, but there are no reliable witnesses to that trip or her arrival, and her body has never been found.\nThe suspicious circumstances surrounding her disappearance have stayed in the public eye thanks to filmmaker Andrew Jarecki, who first made a movie inspired by it, All Good Things , and then interviewed Durst for his hair-raising HBO documentary miniseries The Jinx , which centered on this case.\nKathleen’s family, the McCormacks, have retained criminal lawyer and former Manhattan prosecutor Alex Spiro. This morning in New York county surrogate court Spiro fired the first salvo in a wrongful-death suit against Durst, by filing a petition to have Kathleen’s brother, Jim McCormack, appointed administrator of Kathie’s estate. The current administrator is her mother, Ann Catherine, who is 101 years old and unable to represent the family in these proceedings. “The reason James McCormack wishes to be appointed administrator at this time,” Spiro writes in this morning’s filing, “is to commence a possible wrongful death action against the decedent’s husband, Robert Durst.”\nRobert Durst after his arraignment in New Orleans last March. Photo: Gerald Herbert/AP\nFor many years, says Jim McCormack, friends and observers wondered why his family never went after Durst in civil court — particularly as the years ticked by and Durst wasn’t even indicted or brought before a grand jury. “I guess this is the weird part of my personality,” says McCormack, who is now 70 and was 37 when his sister vanished. Kathleen, the youngest of five siblings, would be 63 today. “But I always held out hope that Kathie was, you know, out there somewhere. I know it sounds sophomoric to think that, but she’s my baby sister and that’s how I felt.”\nThat all changed the night of March 15 with the airing of the final episode of The Jinx . Among other things, the documentary helped bring about Durst’s arrest for Berman’s murder. The night of the finale, Jim McCormack; his wife, Sharon; and their daughter, Elizabeth, who bears an eerily strong resemblance to Kathleen, watched with some others at director Jarecki’s Manhattan home. McCormack remembers being shell-shocked, then sobbing, when the episode ended with Durst's apparent admission of murder : “What the hell did I do? Killed them all, of course,” spoken into a live mic in a bathroom after being confronted by Jarecki with seeming evidence of his guilt.\n“That, sadly, was the closure we’ve been chasing after for years and years,” say McCormack. “After 33 years of hell — really, there’s no other way to describe what our family has been through — we decided it’s time to sue.” The Jinx also helped make the case possible in another way: In New York State, there is a two-year statute of limitations on wrongful-death suits — unless there is new evidence. What stunned McCormack while watching the series wasn’t just the apparent admission at the end, but the other disclosures Durst made on film. For example, that story he told for three decades about how he talked to Kathie that night after she supposedly got back to their New York apartment? The one that the cops believed and that firmly put the case in New York City instead of Westchester? Never happened, he admitted on camera.\nDurst in The Jinx. Photo: HBO\n“The last time I saw Bob Durst physically was in March of 1982,” about six weeks after Kathie’s disappearance, says McCormack. “My sister Mary and I drove up to the house in South Salem. Bob was there. He wanted us to take whatever we deserved that was Kathie’s from the house. Because he was basically writing her off. And he was saying, ‘I don’t know what happened, she left me and I just don’t want this stuff around,’ which I thought was pretty ghoulish, but at that point you’re in a fog of disbelief and pain and anguish. Where is she? What happened?”\nThey left the house, where she is believed to have been murdered, with “a fishing rod, a fishing net, and a rain poncho. That’s pretty much all that was left of her possessions.” (As has been widely reported, Durst disposed of many of his wife’s possessions, including her clothes and medical-school books, in the weeks after her disappearance, at one point clogging the trash chute at one of the buildings owned by Durst’s family in the city, where the couple kept an apartment.) McCormack says his sister had beautiful jewelry given to her by Durst, which they also haven’t seen since 1982. “I always wondered,” says Jim, “did anyone ever go through the other girlfriends’ jewelry boxes?”\nAt the time of Kathie’s disappearance, the couple was separated, though they were spending the weekend together in South Salem. She was in regular consultations with a divorce lawyer who is now deceased. It’s not a great stretch to imagine that, had she lived, she’d have gotten a substantial settlement. “I’ll tell you what we really want,” says McCormack. He would like to know where Kathie’s remains are and be able to give her a proper Catholic burial. “I definitely would like to know where she is,\" he says. \"Maybe I don’t want to know the gory details of how she died, because I’ve had pretty bad nightmares over the years.”\nThe family's plan, should they prevail in civil court, is to take a good part of any jury award or settlement and start a foundation in Kathie’s name. He’s been planning this for several years. It would be called Kathie’s Porch Light Foundation — McCormack always said he kept the porch light on for his sister — and would provide financial help to people pursuing degrees in the health-care field. After all, Kathie was a trained nurse just three months shy of graduating from medical school when she disappeared.\nMcCormack says he would like to think there is a part of Robert Durst that remembers he loved Kathie at one point. (McCormack has always described the early years of his sister’s marriage as magical.) He says he holds out hope that Durst will do “what is fair and ethical and moral and all that other stuff.”\nMeanwhile, Alex Spiro is much less emotional: “He did it, and we can prove it.”", "external_links": ["http://www.youtube.com/watch?v=uC6pPWVVXhg", "http://www.durst.org/", "http://www.magpictures.com/allgoodthings/", "http://www.vulture.com/2015/03/the-jinx-finale-robert-durst.html"], "published": "2015-10-16T03:48:00.000+03:00", "crawled": "2015-10-15T23:01:36.004+03:00", "highlightTitle": ""}