{"organizations": [], "uuid": "a55b991be16298eaedabc4649bf96201e19ead7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "chicago.suntimes.com", "main_image": "http://bullseye-prod.aggrego.org//wp-ag/wp-content/uploads/sites/71/2015/10/LucasMuseumSept.jpg?o=eyJ3aWR0aCI6MCwiaGVpZ2h0IjowLCJ4IjowLjUsInkiOjAuNX0%3D&amp;s=WeG9lSMCjrX2JAY4PgR1jX6d9cM%3D", "site_section": "http://chicago.suntimes.com/", "section_title": "Chicago Sun-Times | Chicago : News : Politics : Things To Do : Sports", "url": "http://chicago.suntimes.com/chicago-politics/7/71/1024868/emanuel-appointed-chicago-plan-commission-poised-approve-lucas-museum", "country": "US", "title": "Emanuel-appointed Plan Commission approves Lucas Museum", "performance_score": 0, "site": "suntimes.com", "participants_count": 1, "title_full": "Emanuel-appointed Plan Commission approves Lucas Museum | Chicago Sun-Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T21:05:00.000+03:00", "replies_count": 0, "uuid": "a55b991be16298eaedabc4649bf96201e19ead7b"}, "author": "| emailAddress.indexOf('@') == -1) {errorString = 'Please enter your email address';} var isError = false; if (errorString.length > 0) isError = true; if (isError) alert(errorString); return !isError;}", "url": "http://chicago.suntimes.com/chicago-politics/7/71/1024868/emanuel-appointed-chicago-plan-commission-poised-approve-lucas-museum", "ord_in_thread": 0, "title": "Emanuel-appointed Plan Commission approves Lucas Museum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Movie mogul George Lucas’ plan to build a $400 million interactive museum on 17 acres of free lakefront land is about to turn from Hollywood dream into a Chicago reality.\nThe Chicago Plan Commission made certain of it Thursday by signing off on a 99-year lease of lakefront land south of Soldier Field approved by the Chicago Park District one day before.\nThe Plan Commission is the final arbiter over all matters involving the Lakefront Protection Ordinance.\nThe commission’s approval marks the biggest hurdle yet for the futuristic project privately financed by the filmmaker of Star Wars fame that will include a parking structure on the west side of Lake Shore Drive, and additional green space on what is now unsightly surface parking lots.\nThe museum itself will include up to 300,000 square feet of exhibition space. That’s 100,000 square feet less than originally planned for the futuristic structure, designed by Chinese architect Ma Yansong.\nPlans also include nearly 5 acres of green space to be divided in a garden, an event prairie, an eco-park and a dune field.\nYansong called his conceptual design for a flowing white sculptural building topped by a Saturn-like floating ring of an observation deck a “new type of architecture for the world.”\nCritics have called it everything from a palace for Jabba the Hutt to an amorphous, land-eating colossus, the Jetsons on the lakefront and close encounters of the fourth or fifth kind.\nThe Plan Commission — composed of Mayor Rahm Emanuel’s appointees and three new members — engaged in none of that civic hand-wringing. Instead, Thursday’s debate was dominated by the contribution the museum devoted to visual storytelling would make to Chicago’s already world-renowned museum campus.\n“The museum in itself, along with the green space, is a dramatic improvement over a surface parking lot along the lakefront. It will serve as an attraction to people –not just throughout the United States, but throughout the world,” said Ald. Will Burns (4th), whose ward includes the project.\n“And it will help to bring another vital amenity to the south lakefront which, for many years, has lagged behind the north lakefront in terms of attractions and things that drive value along the South Side of Chicago.”\nThe three-hour debate was lopsided, but it did have a few uncomfortable moments.\n“It’s a $10 ground lease over 99 years….I went back and looked at my property tax bill. The Park District is a tax- levying body. It has its own pension obligation…We know revenues are going to come out of this if approved and built. Maybe funding youth narrative arts programs throughout the city. And we’re not going to see any of that. Can you explain a little bit how this is in the best interests of the Park District?” said Plan Commission member Juan Carlos Linares.\nLinares said the “clear language” of the Lakefront Protection Ordinance and the 1973 Lakefront Plan for Chicago says no further private development east of Lake Shore Drive.\n“There’s a clear distinction here with cultural or museum properties. Would it not have been better as a first step to perhaps amend this to add an exclusive exception for museums because it’s just not there?” said Linares, who cast the only no vote, citing the “plain letter” of the law.\nCity planner Heather Gleason noted that the furor that followed construction of Lake Point Tower east of Lake Shore Drive gave birth to the “no new development” edict.\n“Inappropriate development being residential, commercial and industrial development and not museums. Museums are mentioned throughout the lakefront plan as being appropriately cited in the parks,” Gleason said.\n“When you look at the plan, it’s referenced over and over again. It references the zoo and the conservatory in Lincoln Park. It talks about the planetarium. It talks about the aquarium. The intent was clearly that museums should be in parks. The idea [of a ban] was this other type of development—like industrial development, residential development–that would be private in nature.”\nLinares countered that, if the Plan Commission was being asked to “take this leap” and make “this cultural exception,” museum programming should have been a lot more diverse.\n“When you look at the website, which is your window to the world, there is little or no diversity there at all. And even on the side of gender, there’s a site on pin-up models, but there’s nothing on women artists at all,” Linares said.\n“I don’t know if I would want to take my daughter to that. If we’re going to make this leap to interpret this as this cultural exception, what’s your response on your programming and how you’re going to have this reflect the cultural fabric of Chicago?”\nLucas Museum President Don Bacigalupi countered, “We’re a nascent organization. I’m a staff of one at the moment. I’ve been here for three months. We have a long way to go as we’re building the museum, building the collection, building the programs. We will absolutely diversify the collection, the program offerings and make it a place welcoming of your daughter and many other daughters as well as people of all backgrounds.”\nFriends of the Parks, which supports the museum, but not the location, urged the Plan Commission to reject the plan and force Lucas to consider alternative sites away from the lakefront.\nFriends of the Park filed a lawsuit in federal court to try and block the project that’s still pending, despite after-the-fact rushed through the Il. General Assembly tailor-made to eliminate the lawsuit’s central argument: by allowing construction on “formerly submerged” Lake Michigan land.\n“I hear the State of Illinois building may be available. There’s also the Michael Reese site or any other site west of Lake Shore Drive,” said Melody Moore of Friends of the Parks.\nMoore said she also has “major concerns” about Emanuel’s ability to uphold his promise not to use public funds for the project.\n“The city still has not sufficiently addressed the significant traffic failure that could occur, specifically during special events,” Moore said.\nPrior to the final vote, Bacigalupi and his traffic and landscape consultants walked the Plan Commission through a lengthy presentation about what the new museum would be like and how the additional green space would enhance the lakefront experience.\nThey talked in detail, as they did before the Park District board, about plans to build a new, $40 million, 1,863-space public parking garage to replace surface parking lost to the museum on land west of Lake Shore Drive now owned by the Metropolitan Pier and Exposition Authority. The land will be leased to the Park District.\nThe Lucas Museum will also have its own underground parking garage for museum patrons that would provide guaranteed parking, even during Bears games, as well as an outdoor “event prairie” tailgating lawn fit for up to 560 cars next to the museum.\nBut, there’s bad news for tailgating Bears fans. They stand to lose the south lot, which is one of their favorite tailgating venues. If tailgating is not allowed on the top level of the new garage, that will leave Bears fans will fewer than 1,000 spots for pre- and post-game tailgating.\nInitially, parking revenue from Lucas Museum visitors will be split between the museum and the Chicago Park District to allow the museum to recoup construction costs. After the museum is made whole, the Park District will get all of the money.\nThe Lucas museum and a bridge to Northerly Island would be privately financed, with the exception of free lakefront land and an array of transportation improvements that could prove to be quite costly for a city facing a massive property tax increase to solve a $30 billion pension crisis.\nTo unclog a transportation bottleneck caused by the concentration of museums, conventions, concerts, sporting and special events in one lakefront location, the mayor’s site selection committee has proposed: extending bus rapid transit to the museum campus; creating a “dedicated trolley service” to and from the Loop and West Loop rail stations; building a “pedestrian connection” from the Lucas museum to Northerly Island; adding bike paths around the museum campus; upgrading 31st Street to handle higher traffic volumes; adding water access via Burnham Harbor and a connection to the Lake Michigan Water Trail and upgrading the 18th Street entrance and exits to McCormick Place and the museum campus as well as the Roosevelt Road interchange.\nThe Lucas Museum still must be approved by the City Council’s Zoning Committee and by the full City Council. Neither vote is in doubt. Barring complications, construction could begin as early as next spring. The museum is expected to be up and operating by 2019 or 2020.", "external_links": [], "published": "2015-10-15T21:05:00.000+03:00", "crawled": "2015-10-16T00:48:43.424+03:00", "highlightTitle": ""}