{"organizations": [], "uuid": "0a705d552d57eeb587b2c8935193166d95b899a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-56291acf/turbine/bs-md-hogan-quotes-20151022", "site_section": "http://www.baltimoresun.com/news/maryland/politics/rss2.0.xml", "section_title": "Politics - Baltimore Sun", "url": "http://www.baltimoresun.com/news/maryland/bs-md-hogan-quotes-20151022-story.html", "country": "US", "title": "State officials' reactions to Gov. Hogan's $135 million bus plan", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 0, "title_full": "State officials' reactions to Gov. Hogan's $135 million bus plan", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:09:00.000+03:00", "replies_count": 0, "uuid": "0a705d552d57eeb587b2c8935193166d95b899a8"}, "author": "", "url": "http://www.baltimoresun.com/news/maryland/bs-md-hogan-quotes-20151022-story.html", "ord_in_thread": 0, "title": "State officials' reactions to Gov. Hogan's $135 million bus plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hogan"], "text": "State officials' reactions to Gov. Hogan's $135 million bus plan Hogan unveils Baltimore transformative transit plan \nGov. Larry Hogan on Thursday unveiled what he described as a \"transformative\" $135 million plan to improve Baltimore's bus system — seeking to fill a mass transit void left by his cancellation of the Red Line light rail project. \nGov. Larry Hogan on Thursday unveiled what he described as a \"transformative\" $135 million plan to improve Baltimore's bus system — seeking to fill a mass transit void left by his cancellation of the Red Line light rail project. The Baltimore Sun \nGov. Larry Hogan on Thursday unveiled what he described as a \"transformative\" $135 million plan to improve Baltimore's bus system — seeking to fill a mass transit void left by his cancellation of the Red Line light rail project. \nHere's a selection of the mixed bag of reactions from state officials. \nBaltimore County Executive Kevin Kamenetz \n\"Although the Governor has not shared his transportation plan with me, it appears that it once again leaves the Baltimore region stuck in traffic. Simply 'window dressing' a bus system is not a mass transportation solution. \n\"They should have been doing upgrades as part of their job anyway. The plan will do nothing to increase choice ridership on mass transit, and it does nothing to promote economic development.\" \nTransportation Secretary Pete Rahn \n\"The existing transit system in Baltimore is broken. . . . The governor gets it.\" \nGov. Larry Hogan \n\"The bottom line is that Baltimore's current transit system is a mess. It is poorly integrated and simply doesn't make any sense.\" \nMTA Administrator Paul Comfort \n\"This is a comprehensive, organic reboot of our bus route system.\" \nState Sen. Catherine E. Pugh \n\"It addresses the network and the need to cut down travel time, the need to connect communities to where the jobs are.\" \nSen. Ben Cardin \n\"Governor Hogan's decision to help Baltimore's bus system run more efficiently is welcome news for the people who live, work and play in the city. While I welcome his suggestions to streamline bus service, his announcement is in no way a comprehensive, long-term solution to improving public transportation, reducing traffic or creating new jobs in Baltimore City. Spending $150 million to make buses run on time is a good start but no substitute for the 10 years of planning, $900 million in hard-fought federal funding and the economic growth that Governor Hogan threw away when he killed the Red Line in Baltimore. \n\"In an op-ed from September, the Governor wrote: 'Over the next several months, my administration will announce a series of innovative ideas that have the potential to deliver real change.' I have to ask, is color-coding bus lines and removing lanes from already congested city streets 'real change' to the people commuting to and through Baltimore? Making the buses run on time is not innovative, it is what is expected of our transit agencies. I agree with Governor Hogan that public transit should be multimodal and comprehensive, but this new plan falls short on both counts.\" \nMayor Stephanie Rawlings-Blake \n\"Governor Hogan's plan falls far short of revolutionizing transportation across our critical East-West corridor, as would have happened with the Red Line. Baltimore is woefully behind other cities in public transit, and this plan does little to advance it. At best, this bus plan may help the state fulfill its basic obligations under Maryland law. But it fails to deliver the regional East-West economic development benefits that Baltimore's business leaders, elected officials and residents had been counting on through the Red Line. Perhaps most importantly, Governor Hogan's proposal does little for the citizens of Baltimore who are in desperate need of forward-thinking transportation services to increase their access to jobs and better health care, childcare, and educational opportunities. I am still left without an answer to what happened to the $736 million in state transportation funding that Governor Hogan took away from the region and redistributed to highway projects across the state.\"", "external_links": [], "published": "2015-10-22T20:09:00.000+03:00", "crawled": "2015-10-23T00:12:57.145+03:00", "highlightTitle": ""}