{"organizations": [], "uuid": "a586f48395385455a7b6bb6dfcea349257e163af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/07/16/66/3a/AJC-OGImage200x200.jpg", "site_section": "http://www.ajc.com/s/news/georgia-government/", "section_title": "Georgia politics and government news from the AJC | www.ajc.com", "url": "http://www.ajc.com/news/news/state-regional-govt-politics/you-always-need-to-remember/nn8bM/", "country": "US", "title": "Georgia state Sen. Ross Tolleson on living with Alzheimer's | www.ajc.com", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Georgia state Sen. Ross Tolleson on living with Alzheimer's | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T20:00:00.000+03:00", "replies_count": 0, "uuid": "a586f48395385455a7b6bb6dfcea349257e163af"}, "author": "Jim Galloway", "url": "http://www.ajc.com/news/news/state-regional-govt-politics/you-always-need-to-remember/nn8bM/", "ord_in_thread": 0, "title": "Georgia state Sen. Ross Tolleson on living with Alzheimer's | www.ajc.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Any politician of experience has a stump speech lodged in the brain, a memorized compilation of talking points, jokes and anecdotes that can be pulled out at a moment’s notice.\nIt is a fine thing to have at the ready when meeting strangers.\nBut when the same trusted clichés are required for encounters with friends, everyday work colleagues and long-time acquaintances, all sorts of alarm bells go off.\nEarlier this month, state Sen. Ross Tolleson, a Republican of some weight in the state Capitol, abruptly announced his retirement after 12 years in the Legislature.\nIn other decades, he might have cited unspecified health issues, or a desire to spend more time with his family. Instead, the 59-year-old lawmaker let the truth be known: He has been diagnosed with early onset Alzheimer’s disease.\n“I’m not going to hide from life. And I’m not going to lay on the porch, either,” said Tolleson, as we sat in his pine-paneled office in downtown Perry. His family had once been in the lumber business.\n“I’m going to talk about America, because I’m concerned about the nation. I love America more than the politics, and that’s what’s gone wrong. If you turn on TV and watch Washington D.C., it’s just politics. What happened to America?” he said.\nThis last portion is the stump speech – the easily accessible topic that rises to the top when other thoughts drift out of reach. But it is not a false part of the man. Since 2002, Tolleson has been a mainstay of the GOP center in the Senate – that portion of the chamber that has attempted to ward off harsher Republican positions.\nSometimes successfully, sometimes not.\nTolleson came to the Senate in 2003, replacing Sonny Perdue – who had left the chamber for employment elsewhere.\nThe new guy and I struck up a friendship as members of a small, select club at the state Capitol. We both got our first taste of politics by interning for U.S. Sen. Sam Nunn – me in ’77, he in ’78.\nTolleson’s service as chairman of the Senate Natural Resources and Environment Committee has probably meant nothing to you, unless you’re a farmer or enjoy a glass of water now and then. In 2011, it was his bill that allowed local governments to strike partnerships with private companies to build reservoirs – a response to the state’s drought crisis.\nEnvironmentalists were not always happy with him. In 2014, his Flint River Drought Protection Act, a controversial measure that allowed some water from aquifers to be used to increase the flow of the Flint River, raised hackles.\nTolleson’s topic of expertise was arcane and complicated, so when a certain fuzziness set in, it was obvious. An aide began fielding calls about shifts in his behavior.\n“My wife finally said, ‘You’ve got to go checked out,’” the senator said. “At the end of the day, we had a lot of conversations about this. I really hated stepping down in the middle of a term, because – to me – that forces the counties to pay for another special election. And that bothers me.\n“But I thought, it’s not right if I’m not 100 percent there.”\nSo in July, Ross and Sally Tolleson went to Atlanta to break the news to Lt. Gov. Casey Cagle. In September, the couple had a sit-down with Gov. Nathan Deal.\nGenetics might be at work here. Tolleson’s grandmother was similarly afflicted. But there could be other ingredients, too. Tolleson was a free safety, the final line of defense for his high school football team. “I was hit head-on all the time,” he said. “That could be where my problems come from.”\nThe state senator has ceded management of his illness to his bride of 36 years. “My wife’s trying to get me into a clinical trial now. It’ll be in Atlanta,” Tolleson said. “I want to do anything I can to keep it in check. It’s the early, early stages. That’s a blessing, too. I’ll have to be careful later.”\nAlzheimer’s seems to attack newer memories first. Over a meatloaf lunch in downtown Perry, Tolleson points to the clinic where a doctor delivered him for $150 in 1956, then to the church where he was married, then to the building that was once a drug store with a soda fountain. He can rattle off the names of every teacher he had in elementary school.\nNeighbors who greet him, and there are many, are quickly recognized. But their names come slowly, and sometimes not at all.\nTolleson is by nature an affable and optimistic fellow, and can laugh much of it off. But now and then he crosses the line that separates humor and the unfathomable. ”It’s a scary thing,” he said, smiling. “I told my wife, ‘I don’t want to wake up one morning and not know who you are.’”\nThe openness has helped. Friends and strangers have offered advice and shared experiences. The Tollesons have a 25-year-old son, Tripp, and two twin daughters, Ansley and Kelly, who are juniors at the University of Georgia. Kelly just raised $1,200 for Alzheimer’s research on her Facebook page.\nTolleson didn’t want to exit the Legislature this quickly. This week, the Newton County Commission shelved plans for the Bear Creek reservoir project. He wants some answers from the state Environmental Protection Division. He believes it’s important to move forward with reservoirs in the state.\nBefore he left the Capitol, Tolleson wanted to pitch a bill to put state lawmakers on a full-time salary to help them resist temptation. “I think that’d be great. It’d keep it clean,” he said.\nBut we ended our conversation talking about the kerfuffle over at Stone Mountain Park. Tolleson reminded me that one of his first votes in the Senate was to raise the current state flag – and put a end to that particular fight over Confederate symbolism.\nBut he doesn’t want other markers torn down. “If you start obliterating history, that’s when you start repeating bad things in life. I think you always need to remember. You always need to remember,” Tolleson said, trailing off.\nYes, you do.", "external_links": [], "published": "2015-10-24T20:00:00.000+03:00", "crawled": "2015-10-24T16:18:48.384+03:00", "highlightTitle": ""}