{"organizations": [], "uuid": "f928767f1410a26e423d9ce4c0740cab0de86d4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "dailycaller.com", "main_image": "http://cdn01.dailycaller.com/wp-content/uploads/2015/08/2015-08-11T131723Z_1_LYNXNPEB7A0NZ_RTROPTP_4_USA-ELECTION-TRUMP-e1439558067392.jpg", "site_section": "http://dailycaller.com/section/politics/page/41/", "section_title": "Politics | The Daily Caller - Part 41", "url": "http://dailycaller.com/2015/08/14/ann-coulter-unintentionally-makes-the-case-against-donald-trump/", "country": "US", "title": "Ann Coulter Unintentionally Makes The Case Against Donald Trump", "performance_score": 1, "site": "dailycaller.com", "participants_count": 26, "title_full": "Ann Coulter Unintentionally Makes The Case Against Donald Trump | The Daily Caller", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:54:00.000+03:00", "replies_count": 99, "uuid": "720aef2f98d254f50db348570074acad95b4d999"}, "author": "dailycaller", "url": "http://dailycaller.com/2015/08/14/ann-coulter-unintentionally-makes-the-case-against-donald-trump/#post-0", "ord_in_thread": 0, "title": "Ann Coulter Unintentionally Makes The Case Against Donald Trump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4680276 It’s time we accept the fact that Ann Coulter and her ilk are solely animated by, and utterly obsessed with, the issue of illegal immigration. This is not merely a facet of their larger conservative worldview, but, instead, the defining issue. You can be for single-payer healthcare — or taxpayer-funding of Planned Parenthood — so long as you say mean things about Mexicans. You can flip-flop on all sorts of litmus test issues, and do things that would get any other conservative voted off the island. Screaming about “amnesty” covers a multitude of sins.\nThis creates horrible blind spots. Let’s take, for example, Donald Trump’s recent comments about abortion. During the debate, he argued that he changed his mind on abortion after seeing a child whose parents ultimately decided against aborting him become a superstar. One wonders what would have happened had that child become a loser. Nobody serious about supporting a culture of life could hear Trump’s comments and not cringe. But that was just the tip of the iceberg.\nOn the heels of multiple videos demonstrating that Planned Parenthood was involved in harvesting and selling the organs of aborted babies, and as Republican statesmen were attempting to defund the group, Trump argued that Planned Parenthood does some good stuff.\n“I would look at the good aspects of it, and I would also look because I’m sure they do some things properly and good for women,” Trump said on CNN’s New Day . “I would look at that, and I would look at other aspects also, but we have to take care of women,” he said. “The abortion aspect of Planned Parenthood should absolutely not be funded.”\nDespite the fact that Trump is a brilliant businessman who promises he can get the Mexican government to pay to build a wall, he appears unfamiliar with the fact that money is fungible. He apparently doesn’t realize that taxpayer subsidizing of Planned Parenthood’s legitimate activities would free up other money to be directed toward abortions.\nMore interesting than Trump’s ridiculous position, however, is the fact that his apologists are still making excuses. Consider this from Ann Coulter on Hannity : “It isn’t a flip-flop on Planned Parenthood. He is not a politician, he is not familiar with all the deceptive ways Planned Parenthood will sneak through funding for abortion. ” [Emphasis mine.]\nLet’s assume she’s right. Let’s assume that Donald Trump isn’t evil — just ignorant. Isn’t that an indictment on his candidacy? Isn’t it fair to suspect that this naïveté is both dangerous and disqualifying. Maybe there is something to be said for, I don’t know, electing someone who has a little bit of experience? Now, I’m not suggesting you have to have served in the Senate for three terms; how about someone who’s been elected dog catcher? I think we derisively refer to these people as… politicians .\nAgain, though, none of this matters, so long as Trump’s sufficiently tough on immigration. Another funny thing Coulter said during that Hannity interview. “We send Mexico $14 billion in foreign aid every year, of course they’ll pay for the wall.”\n(Don’t tell Ann, but I’m pretty sure this means we would pay for the wall.)\n Share TOP Hide Comments Show comments Loading, please wait... Kevin McCarthy’s Benghazi Moment 12:54 PM 10/01/2015 Misunderestimating Donald Trump: Why The Pundits Got Him Wrong 11:10 AM 09/30/2015 Meet The New Boss: Can Kevin McCarthy Change The Culture? 8:52 AM 09/29/2015 CarlyCare: Will Anyone Care She Supported The Individual Mandate? 2:57 PM 09/24/2015 Rubio Shows Conservatives How To Talk About Pope Francis 8:51 AM 09/23/2015 How Donald Trump Hurt Scott Walker 5:53 PM 09/21/2015 Conservatives Shouldn’t Attack Pope Francis 9:51 AM 09/21/2015 Ann Coulter–And The ‘F—ing Jews’ 11:39 AM 09/18/2015 Is Donald Trump Playing Us For ‘Chumps’? 11:01 AM 09/15/2015 Carly Fiorina Responds To Trump: ‘I Am Proud Of Every Wrinkle’ [VIDEO] 8:35 AM 09/14/2015 The Daily Caller Register for Emails Learn more...", "external_links": ["http://www.politico.com/story/2015/08/donald-trump-backs-off-push-defund-planned-parenthood-121267.html#ixzz3inG4IVTy", "https://www.facebook.com/DailyCaller", "http://www.mediaite.com/tv/coulter-trump-never-flip-flopped-everyone-else-flip-flops-worse/"], "published": "2015-10-01T20:54:00.000+03:00", "crawled": "2015-10-03T23:10:39.516+03:00", "highlightTitle": ""}