{"organizations": ["House"], "uuid": "facc1cca79c9b7fd7b7108b19f1ecafe5aea44f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmbfnews.com", "main_image": "", "site_section": "http://www.wmbfnews.com/Global/category.asp?C=146173&clienttype=rss", "section_title": "WMBF - News - Politics", "url": "http://www.wmbfnews.com/story/30213492/mccarthy-abruptly-withdraws-candidacy-for-house-speaker", "country": "US", "title": "McCarthy abruptly withdraws candidacy for House speaker", "performance_score": 0, "site": "wmbfnews.com", "participants_count": 0, "title_full": "McCarthy abruptly withdraws candidacy for House speaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:03:00.000+03:00", "replies_count": 0, "uuid": "facc1cca79c9b7fd7b7108b19f1ecafe5aea44f1"}, "author": "", "url": "http://www.wmbfnews.com/story/30213492/mccarthy-abruptly-withdraws-candidacy-for-house-speaker", "ord_in_thread": 0, "title": "McCarthy abruptly withdraws candidacy for House speaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["McCarthy"], "text": "McCarthy abruptly withdraws candidacy for House speaker By ERICA WERNERAP Congressional Correspondent \nWASHINGTON (AP) - With no warning, Majority Leader Kevin McCarthy withdrew Thursday from the contest for speaker of the U.S. House, shocking fellow Republicans just before voting was to begin and plunging Congress into chaos. \nLawmakers said they were thunderstruck and in disbelief following McCarthy's announcement, which came moments after they had showed up for an election nearly certain to end with McCarthy as their pick for speaker. A mere two weeks ago outgoing Speaker John Boehner announced his plans to resign under conservative pressure, also without warning and stunning to all. \n\"Over the last week it has become clear to me that our conference is deeply divided and needs to unite behind one leader,\" McCarthy said. \"I have always put this conference ahead of myself. Therefore I am withdrawing my candidacy for speaker of the House.\" \nMcCarthy said he would stay on as majority leader. The speaker's election was postponed, as may be the scheduled Oct. 29 vote for speaker by the full House, Democrats as well as Republicans. \nWhat happens next is unknown. McCarthy was by far the heavy favorite to replace Boehner. Congress is facing major budget deadlines and fiscal decisions. \nAt the White House, presidential spokesman Josh Earnest said it would be easy for Democrats to poke fun at the Republicans' troubles if not for the serious issues Congress faces. He said the next speaker will have to tame a small but vocal group of lawmakers with a strong ideological bent or find a way to \"buck up\" more mainstream House Republicans. \nThe lawmaker most widely seen as a potential speaker in McCarthy's place immediately ruled it out. \n\"Kevin McCarthy is best person to lead the House, and so I'm disappointed in this decision,\" said Rep. Paul Ryan of Wisconsin, the former vice presidential nominee who now chairs the Ways and Means Committee. \"While I am grateful for the encouragement I've received, I will not be a candidate. \nOne leadership ally, Rep. Steve Stivers of Ohio, said McCarthy \"didn't see a path to 218\" - the number of votes needed to prevail on the House floor. McCarthy faced opposition from a bloc of 30-plus hardline conservative lawmakers who didn't command the numbers to block him in Thursday's secret-ballot elections, but might have prevented him from winning a floor vote later on. \nThere was talk among some lawmakers of elevating a \"caretaker\" speaker who could serve with consensus support at least for the short term. \nRank-and-file lawmakers seemed unsure how to react or what to say as they milled around the lobby of the Longworth Office Building where they had gathered to eat barbecue and then - they thought - vote for a new speaker. Instead the meeting was adjourned moments after it began with McCarthy making his announcement as his wife and kids looked on. \n\"Disbelief, from the surprise announcement by Boehner to the quick nature of this election to it now being postponed - it's uncertainty on top of uncertainty,\" said freshman Rep. Ryan Costello of Pennsylvania. \"I've been here nine months, I've never seen anything like this. I'd bet you most other members who have been here 20 or 30 years would say the same thing.\" \n\"He was making his plea this morning for speaker and this afternoon he's out of the race. What happened in those four hours, I don't know,\" said Rep. John Fleming of Louisiana. \nThe other two announced Republican candidates for speaker - Reps. Jason Chaffetz of Utah and Daniel Webster of Florida - lack widespread support in the House GOP, although Webster has the backing of the hardline House Freedom Caucus. \nThursday's secret ballot - even if it had proceeded as expected - still would have been merely an early skirmish in the chaotic battle to lead the House. It was to have been followed by the vote in the full House where the Freedom Caucus could have blocked McCarthy's ascent. \nMcCarthy's candidacy for speaker had gotten off to a rough start with a gaffe when he suggested the House's Benghazi committee was set up to drive down Hillary Rodham Clinton's poll numbers, rather than search for the truth about the 2012 attacks in Libya that killed four Americans. He was roundly criticized and quickly backtracked, but the flub dogged him, giving an opening for Chaffetz to get into the race. \n___ \nAssociated Press writers Andrew Taylor, Mary Clare Jalonick and Alan Fram contributed to this report.  ", "external_links": [], "published": "2015-10-08T21:03:00.000+03:00", "crawled": "2015-10-08T21:06:41.880+03:00", "highlightTitle": ""}