{"organizations": [], "uuid": "367d98ff97efb67d80579359b175a4998dae9164", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30319343/amgen-foundation-announces-new-4-million-commitment-to-bring-hands-on-biotechnology-labs-to-secondary-school-students", "country": "US", "title": "Amgen Foundation Announces New $4 Million Commitment to Bring Hands-On Biotechnology Labs to Secondary School Students", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Amgen Foundation Announces New $4 Million Commitment to Bring Hands-On Biotechnology Labs to Secondary School Students - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "367d98ff97efb67d80579359b175a4998dae9164"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30319343/amgen-foundation-announces-new-4-million-commitment-to-bring-hands-on-biotechnology-labs-to-secondary-school-students", "ord_in_thread": 0, "title": "Amgen Foundation Announces New $4 Million Commitment to Bring Hands-On Biotechnology Labs to Secondary School Students", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Amgen\nAmgen Biotech Experience Expected to Reach More Than 150,000 Students Over Next Two Years\nTHOUSAND OAKS, Calif. , Oct. 21, 2015 /PRNewswire/ -- The Amgen Foundation announced today that it will invest more than $4 million to support and strengthen the Amgen Biotech Experience program across the United States , Puerto Rico , United Kingdom and Ireland . The Amgen Biotech Experience includes an engaging series of labs that effectively bring biotechnology into classrooms. This new commitment will also strengthen the program's alignment with the United States' Next Generation Science Standards, which are focused on engaging students in more authentic science learning experiences. With the support of Education Development Center, Inc. (EDC), the global nonprofit leading the Amgen Biotech Experience Program Office, the investment is expected to empower 1,000 teachers who will reach more than 150,000 new students with the labs over the next two years.\nExperience the interactive Multimedia News Release here: http://www.multivu.com/players/English/7414055-amgen-biotech-experience-grant/\n\"We are very excited to extend our commitment to the Amgen Biotech Experience, a program that began 25 years ago, with the intent to ignite a deep passion for innovation and scientific discovery in students,\" said Robert A. Bradway , chairman and chief executive officer of Amgen. \"This program, which provides advanced biotech curriculum and professional-grade lab equipment at no cost to schools, has opened countless students' eyes to the world of biotechnology, fueling potential long term advancements to both medicine and society.\"\nThe Amgen Biotech Experience labs were designed by Amgen scientists and educators to inspire the next generation of innovators and give high school biology students the opportunity to experience real science at their fingertips. The Amgen Biotech Experience does this by providing science teachers with advanced training, curriculum and research-grade equipment, allowing them to run labs in their classrooms that incorporate the core technologies used by the biotech industry in the discovery of human therapeutics. With the help of secondary school teachers inside and outside the United States , 72,000 students across Amgen regions participated in the labs this past year.\n\"When teaching the Amgen Biotech Experience, you might just light a fire in a student that didn't think they could do science before, and that kid could solve a problem that we desperately need an answer to. That's pretty powerful,\" said Winnie Litten , a teacher at Oak Park High School in Oak Park, Calif. Wendy Wooten , a teacher at Reseda High School in Reseda, Calif. , added, \"The Amgen Biotech Experience gives students the confidence that they belong in science.\" This innovative, hands-on approach to science is continuing to demystify science for students, inspiring many to pursue science, technology, engineering and math (STEM) degrees in college.\n\"We're pleased with the Amgen Biotech Experience's continued growth,\" says David Offensend , president and chief executive officer at EDC. \"This program helps give students a real-world, hands-on lab experience to introduce them to the excitement of biotechnology and scientific discovery.\"\nSince the program's inception in 1990, the Amgen Biotech Experience has reached more than 425,000 students and today's announcement brings the total Amgen Foundation investment in the program to more than $13 million .\nVisit www.amgenbiotechexperience.com to learn more about the Amgen Biotech Experience, and watch this short video to hear what teachers and students are saying about the program.\nAbout the Amgen Foundation\nThe Amgen Foundation seeks to advance excellence in science education to inspire the next generation of innovators, and invest in strengthening communities where Amgen staff members live and work. To date, the Foundation has donated over $200 million to local, regional, and international nonprofit organizations that impact society in inspiring and innovative ways. The Amgen Foundation brings the excitement of discovery to the scientists of tomorrow through several signature programs, including Amgen Scholars, Amgen Biotech Experience, and Amgen Teach. For more information, visit www.amgeninspires.com and follow us on Twitter @AmgenFoundation .\nCONTACT: Amgen Thousand Oaks\nJennifer van der Borgt, 805-447-5597 (media)\njenvan01@amgen.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/amgen-foundation-announces-new-4-million-commitment-to-bring-hands-on-biotechnology-labs-to-secondary-school-students-300164022.html\n ", "external_links": ["http://www.multivu.com/players/English/7414055-amgen-biotech-experience-grant/gallery/image/8836ce54-6b90-4c15-88e5-52cd3d9037a2.HR.jpg", "http://photos.prnewswire.com/prnvar/20081015/AMGENLOGO", "http://www.multivu.com/players/English/7414055-amgen-biotech-experience-grant/", "http://www.amgenbiotechexperience.com/", "http://www.multivu.com/players/English/7414055-amgen-biotech-experience-grant/gallery/image/f17a6acb-021b-4186-9742-dfccbab3f3a4.HR.jpg", "http://www.youtube.com/watch?v=amiRz7tik-s", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/amgen-foundation-announces-new-4-million-commitment-to-bring-hands-on-biotechnology-labs-to-secondary-school-students-300164022.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=MM30804&Transmission_Id=201510211615PR_NEWS_USPR_____MM30804&DateId=20151021", "http://www.twitter.com/amgenfoundation", "http://www.amgeninspires.com/", "http://origin-qps.onstreammedia.com/origin/multivu_archive/MNR/7414055_Bringing_Biotech_Into_Classrooms_1016_10s.jpg", "https://fpdownload.adobe.com/strobe/FlashMediaPlayback.swf", "http://www.multivu.com/players/English/7414055-amgen-biotech-experience-grant/gallery/image/a63b6171-860b-4960-898b-157ba62aec82.HR.jpg", "http://origin-qps.onstreammedia.com/origin/multivu_archive/MNR/7414055_Bringing_Biotech_Into_Classrooms_1016.mp4&skin=http://fpdownload.adobe.com/FlexPlayer/jwplayer/skin/en.xml&autostart=false&poster=http://origin-qps.onstreammedia.com/origin/multivu_archive/MNR/7414055_Bringing_Biotech_Into_Classrooms_1016_10s.jpg"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T00:42:15.964+03:00", "highlightTitle": ""}