{"organizations": [], "uuid": "2c3b9662cf95f2e7d25bc132d31af40cffdd001e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://global.fncstatic.com/static/v/all/img/og/og-fn-foxnews.jpg", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/politics/2015/10/09/overhaul-florida-districts-hurts-would-be-house-speaker/", "country": "US", "title": "Overhaul of Florida's districts hurts would-be House speaker", "performance_score": 0, "site": "foxnews.com", "participants_count": 3, "title_full": "Overhaul of Florida's districts hurts would-be House speaker | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 2, "uuid": "753e1674f2c032f1d3d24bb47347cb93edf13515"}, "author": "Associated Press", "url": "http://www.foxnews.com/politics/2015/10/09/overhaul-florida-districts-hurts-would-be-house-speaker/#post-0", "ord_in_thread": 0, "title": "Overhaul of Florida's districts hurts would-be House speaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published October 09, 2015 Associated Press TALLAHASSEE – A Florida judge called Friday for a sweeping overhaul of the state's 27 congressional districts, including one held by one of the Republicans seeking to become the next U.S. House speaker.\nJudge Terry Lewis recommended a new congressional map that would make it nearly impossible for U.S. Rep. Dan Webster — one of the hard-line conservatives who pushed John Boehner to resign as speaker and then turned on Boehner's No. 2, Kevin McCarthy — to win re-election from his current central Florida district.\nLewis's ruling also could lead to the ouster of Democratic U.S. Rep. Gwen Graham from her north Florida seat while resurrecting the political career of former Gov. Charlie Crist, who is expected to run for Congress as a Democrat. The judge also went along with a proposal that would make it harder for South Florida Republican U.S. Rep. Carlos Curbelo to get re-elected.\nRegistered Democratic voters outnumber Republicans in Florida, but the GOP holds a 17-10 advantage in the state's congressional delegation. Even if Graham were to lose re-election, Democrats could still pick up an additional three seats under the map recommended by Lewis.\nGerrymandering — in which parties in power redraw electoral districts to give themselves an edge — is a nationwide phenomenon that many blame for Washington's legislative paralysis, since it makes it harder for mainstream politicians who compromise with their opponents to get re-elected. Florida voters sought to end it by approving a 2010 referendum, amending the state Constitution to apply \"Fair Districts\" standards. They mandate that legislators cannot draw districts intended to help incumbents or a member of a political party.\nThen, in a stinging ruling in July, the Florida Supreme Court said Republican operatives had \"tainted\" previous mapping efforts, and ordered eight districts redrawn. The House and Senate gathered in a rare August special session, but deadlocked over a new map drawn up by legislative staff.\nThe high court then turned to Lewis, who made his recommendation on Friday following a three-day trial, during which he sorted through 7 different proposals. Three were made by the GOP-controlled Legislature, and four others by groups that sued over the current districts.\nLewis ultimately sided with a map prepared by a coalition including the League of Women Voters of Florida.\nNow the justices must decide whether to accept or reject the judge's proposal, which is similar to one of the maps prepared by legislative map-drawers, but handles several South Florida districts differently. Lawyers for the coalition had argued that legislative proposals appeared to be aimed at helping Curbelo, a Republican. Legislative lawyers strongly denied the allegation.\nOne of the key changes would radically alter the 5th district, now represented by Corrine Brown, a black Democrat, from a north-south configuration to one that stretches east-west across northern Florida, from Jacksonville to just west of Tallahassee. As a result, the city of Tallahassee would be split, and Graham, the daughter of former Gov. Bob Graham, would be placed in a solidly Republican district.\nBrown has sharply criticized the shift and has a lawsuit pending in federal court to try to block it. During the trial, Lewis questioned shifting Brown's district even though the Supreme Court had recommended it. But in his ruling, he accepted those portions of the map that were agreed to by both the Legislature and the groups that sued.\n\"I am not at liberty to draw something different than what is contained within the maps proposed by the parties,\" Lewis wrote.\nDavid King, the lead lawyer representing the League of Women Voters of Florida and others group, called the ruling a \"a great victory for the people of Florida and for restoration of representative democracy as it was intended to work.\"\n\"If the Florida Supreme Court agrees with Judge Lewis and orders this map to be used, we will have ensured that Floridians have the opportunity to vote in constitutional and fair Congressional districts in 2016,\" King said.", "external_links": ["http://www.ap.org/"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T02:40:12.570+03:00", "highlightTitle": ""}