{"organizations": ["Tories"], "uuid": "6af7ce98c7728472a4fe419a0da8184579290049", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4281294/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://www.heraldscotland.com/politics/political_news/13794591.Sketch__Corbyn___caring_and_compassionate__except__that_is__to_the_Tories_and_the_Press/?ref=rss", "country": "", "title": "Sketch: Corbyn - caring and compassionate, except, that is, to the Tories and the Press", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Sketch: Corbyn - caring and compassionate, except, that is, to the Tories and the Press", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:53:00.000+03:00", "replies_count": 0, "uuid": "6af7ce98c7728472a4fe419a0da8184579290049"}, "author": "", "url": "http://www.heraldscotland.com/politics/political_news/13794591.Sketch__Corbyn___caring_and_compassionate__except__that_is__to_the_Tories_and_the_Press/?ref=rss", "ord_in_thread": 0, "title": "Sketch: Corbyn - caring and compassionate, except, that is, to the Tories and the Press", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Corbyn"], "text": "0 comments \nIT was, at times, difficult to judge who Jeremy hated most – the Tories or the Press. \nThe “sneering” scribes were the butt of not one but several jokes; some of them pretty good, it has to be said. \n“You might have noticed in some of our newspapers they’ve taken a bit of an interest in me lately,” noted Jezza. “According to one headline ‘Jeremy Corbyn welcomed the prospect of an asteroid wiping out humanity.’” \nLoading article content \nAs his audience laughed, whistled and cheered, the leader quipped: “Asteroids are pretty controversial. It’s not the kind of policy I’d want this party to adopt without a full debate in conference.” \nIt all put the comrades in a good mood for their leader’s, at times, rambling speech. \nAfter thanking, Oscars-style, Ed, Harriet, all his fellow candidates, the Shadow Cabinet, the party staff, and Uncle Tom Cobley, the new chief launched into a meandering journey, which had at its start, middle and finish a message about the “new politics”, kinder, caring and compassionate. \nJeremy, a decent chap, spoke about traditional British values of fairness, decency, solidarity; it smacked a bit of mother’s love and apple pie. Promoted stories \nOut was personal abuse – no pig jokes here – and in was respect; except, of course, for the fourth estate. \nHe pressed a number of democratic socialist buttons, including making every school accountable to local government, council house investment and trade union rights and berated David Cameron and the Tories for austerity, looking after their hedge fund donors, trying to gerrymander the electoral register and sucking up to human rights abusing oligarchies like Saudi Arabia. \nWhile he spoke about taking a collegiate approach to decision-making, Mr C made it pretty clear that when it came to his pet hate – Trident – he had a ginormous mandate from the party members; it did not seem Jezza was ready to accept the party’s current policy of renewing the nuclear deterrent for long. \nAs the chief comrade talked of the “new politics” and the “New Left”, how people should not accept what the Tory orthodoxy gave them, he returned to having a pop at the press for “sneering” at Labour’s huge leap in membership. \n“If they were sports reporters writing about a football team they’d be saying: ‘They’ve had a terrible summer. They’ve got 160,000 new fans. Season tickets are sold out. The new supporters are young and optimistic. I don’t know how this club can survive a crisis like this.” \nAs the comrades whooped and whistled some more, media bottoms shuffled uncomfortably in their seats. Share article \nAnd then having made his audience laugh, Jeremy ended by trying to put a tear in its eye, referring to the original Labour comrade - Keir Hardie. \nDeclaring how the Scottish founder stood up for social justice and against prejudice, he quoted him saying what his purpose was in politics: “’Trying to stir up a divine discontent with wrong.'” Promoted Stories", "external_links": [], "published": "2015-09-30T19:53:00.000+03:00", "crawled": "2015-10-01T14:44:01.375+03:00", "highlightTitle": ""}