{"organizations": [], "uuid": "d47d43df0c8953fcbc615fb837de65dcd938c906", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/icons/t_logo_291_black.png", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Politics.xml", "section_title": "NYT &gt; Politics", "url": "http://www.nytimes.com/2015/10/02/us/private-probation-company-accused-of-abuses-in-tennessee.html", "country": "US", "title": "Private Probation Company Accused of Abuses in Tennessee", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "Private Probation Company Accused of Abuses in Tennessee - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:48:00.000+03:00", "replies_count": 0, "uuid": "d47d43df0c8953fcbc615fb837de65dcd938c906"}, "author": "Shaila Dewan", "url": "http://www.nytimes.com/2015/10/02/us/private-probation-company-accused-of-abuses-in-tennessee.html", "ord_in_thread": 0, "title": "Private Probation Company Accused of Abuses in Tennessee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " A private probation company in Tennessee is violating racketeering laws by jailing impoverished people who fail to pay court fines for traffic violations and misdemeanor offenses, and by refusing to waive fees for the indigent, according to a lawsuit filed Thursday.\nIn the lawsuit, seven probationers, many of them sick or disabled and living on as little as $129 a month in food stamps, say they lost housing, jobs and cars, sold their blood plasma and went without food after repeated threats by the company that they would be jailed if they could not pay.\nThe lawsuit, filed in Federal District Court in Nashville, alleges that the county and the company, Providence Community Corrections in Rutherford County, southeast of Nashville, are violating racketeering laws by extorting money through “the wrongful use of fear.”\nErnest Burgess, the Rutherford County mayor, had no comment because he had not yet reviewed the suit, a woman in his office said.\nContinue reading the main story Related Coverage News Analysis: The Collateral Victims of Criminal Justice SEPT. 5, 2015 Probation May Sound Light, but Punishments Can Land Hard AUG. 2, 2015 Skip Child Support. Go to Jail. Lose Job. Repeat. APRIL 19, 2015 Driver’s License Suspensions Create Cycle of Debt APRIL 14, 2015 In a statement, the probation company said: “Providence Community Corrections’ mission is to encourage people to complete their probation successfully per the terms set by the courts, and while we have not yet been formally notified nor had time to review this case, what we can say is that in each of the states we serve, we steadfastly comply with the laws governing the probation system.”\nAs private probation has become more widespread, so have lawsuits alleging abuses. The companies offer local governments the promise of collecting more of their outstanding court fees and fines. But civil rights advocates say that such debts often go unpaid because of the debtors’ poverty and that aggressive efforts to collect the money under threat of incarceration impose a continual strain on society’s most vulnerable members. In Alabama and Georgia, lawsuits have curbed the use of private probation companies.\nThe lawsuit in Tennessee, filed by Equal Justice Under Law, a civil rights group, and the pro bono arm of the law firm Baker Donelson, describes a financial arrangement between the county and Providence Community Corrections that is typical in many respects: The county pays nothing to the company, which earns money instead by charging monthly fees to probationers as well as surcharges for drug tests, warrants and other services.\nThe company even refused to let destitute probationers complete their required community service hours without first paying a community service fee, the plaintiffs say.\nThe arrangement gives the company a direct financial interest in the length of probationary periods. It also gives it broad powers to set the conditions of probation, including such requirements as forbidding alcohol consumption regardless of the nature of the offense, and to “revoke” probation and have the offender jailed, according to the suit.\nThe plaintiffs say that once they were sent to county jail, they were manhandled or ridiculed by jail officials. Paula Pullum, a 48-year-old plaintiff with severe medical problems — including a heart ailment — claims that when she submitted a letter detailing her health issues and required medications, a jailer tore it up.\nAdvertisement\nContinue reading the main story Advertisement\nContinue reading the main story Plaintiffs say that even when the company was aware of their indigence, they were not told they could apply to have their court costs waived. When they asked for a waiver, they said, they were denied or told they would first have to make payments for several months, pay for the form, pass a $20 drug test and pay a $25 fee to get a court hearing.\nProvidence Community Corrections targeted probationers who had some fixed income, like disability payments, and repeatedly threatened them with jail if they did not bring in money, the lawsuit says. On at least two occasions, receipts submitted by two plaintiffs show, their entire payments were applied to their probation fees while their court cost balance remained the same. One plaintiff, Cindy Rodriguez, originally owed the court $578. After a year on probation, though she had paid nearly that much to the company, she still owed $512, she says in the lawsuit.\nMs. Rodriguez, who said she was in continual back pain and subsisted on disability payments, said she was never told she could seek an indigence waiver. When she finally learned she could and asked for one, she was told it was too late, she said.\nThe Supreme Court has held that probation cannot be revoked for failure to pay a fine unless a court first finds the defendant is able to pay. Tennessee law does not allow probation to be revoked for failure to pay.\nBut the plaintiffs say that law was routinely ignored or that the company trumped up reasons to claim probation violations\nLoading... Go to Home Page »\nSite Index The New York Times News World U.S. Politics N.Y. Business Tech Science Health Sports Education Obituaries Today's Paper Corrections Opinion Today's Opinion Op-Ed Columnists Editorials Contributing Writers Op-Ed Contributors Opinionator Letters Sunday Review Taking Note Room for Debate Public Editor Video: Opinion Arts Today's Arts Art & Design ArtsBeat Books Dance Movies Music N.Y.C. Events Guide Television Theater Video Games Video: Arts Living Automobiles Crossword Food Education Fashion & Style Health Jobs Magazine N.Y.C. Events Guide Real Estate T Magazine Travel Weddings & Celebrations Listings & More Classifieds Tools & Services Times Topics Public Editor N.Y.C. Events Guide TV Listings Blogs Cartoons Multimedia Photography Video NYT Store Times Journeys Subscribe Manage My Account Subscribe Subscribe Times Premier Home Delivery Digital Subscriptions NYT Opinion Crossword Email Newsletters Alerts Gift Subscriptions Corporate Subscriptions Education Rate Mobile Applications Replica Edition International New York Times", "external_links": ["http://static01.nyt.com/images/2015/04/20/us/20SUPPORT01/20SUPPORT01-thumbStandard.jpg", "http://static01.nyt.com/images/2015/08/01/us/00PROBATIONWEB1/00PROBATIONWEB1-thumbStandard.jpg", "http://static01.nyt.com/images/2015/09/06/opinion/sunday/06dewan/06dewan-thumbStandard.jpg", "http://static01.nyt.com/images/2015/04/14/us/14license-web/14license-web-thumbStandard.jpg", "http://a1.nyt.com/assets/article/20150928-155824/images/foundation/logos/"], "published": "2015-10-02T03:48:00.000+03:00", "crawled": "2015-10-02T04:05:59.821+03:00", "highlightTitle": ""}