{"organizations": [], "uuid": "c203047791dabfca13a329d0d2c2bc3d422714d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/04/14/9e/12/NBA_Player_Stabbed_Bask2.jpg", "site_section": "http://www.ajc.com/s/news/georgia-government/", "section_title": "Georgia politics and government news from the AJC | www.ajc.com", "url": "http://www.ajc.com/news/sports/pro-sports/jury-selected-for-sefolosha-trial/nnwHy/", "country": "US", "title": "Jury selected for Sefolosha trial", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Jury selected for Sefolosha trial | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:24:00.000+03:00", "replies_count": 0, "uuid": "c203047791dabfca13a329d0d2c2bc3d422714d5"}, "author": "Danny Knobler", "url": "http://www.ajc.com/news/sports/pro-sports/jury-selected-for-sefolosha-trial/nnwHy/", "ord_in_thread": 0, "title": "Jury selected for Sefolosha trial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The trial of Hawks player Thabo Sefolosha began Monday with jury selection. Defense attorney Alex Spiro declared that his client is “completely innocent.”\nOpening statements are set for Tuesday morning, with Sefolosha facing charges of obstructing government administration, resisting arrest and disorderly conduct, in a case stemming from a dispute outside a New York nightclub early April 8. Judge Robert Mandelbaum dismissed a fourth charge of harassment.\nA jury of four women and two men was chosen to hear the case, which is expected to conclude by the end of the week.\nSteven Colquitt Thabo Sefolosha takes a break during Hawks' training camp at the University of Georgia in Athens. Sefolosha is progressing from a broken right fibula suffered during an arrest in New York last winter. During jury selection at Manhattan Criminal Court, attorneys for both the state and for Sefolosha raised the issue of race, with Spiro suggesting that police actions towards Sefolosha could have been influenced by his race.\n“I can’t have a referendum, but my client is black,” Spiro said in court.\nProsecutor Francesca Bartolomey said she expects to call six witnesses, all police officers. Spiro said he would call six to eighth witnesses in Sefolosha’s defense. Former Hawk Pero Antic, who was with Sefolosha and was originally charged in the case, is on the witness list.\nProsecutors offered Sefolosha an adjournment in contemplation of dismissal, without the day of community service they asked for last month, But he turned it down in favor of a trial in which he hopes to prove his innocence.", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/01/5e/d8/hawks-athens5.jpg"], "published": "2015-10-05T13:24:00.000+03:00", "crawled": "2015-10-06T00:44:35.208+03:00", "highlightTitle": ""}