{"organizations": [], "uuid": "1f732a2a1e249688476fc110adf273868e63b80e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/89/e78c4d447e94dced53474bb4588ba5/media:ad41b5294b55412a9d117d2f70ab62f5CaliforniaAntibioticsAnimals.JPEG", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/science/news/articles/2015/10/10/california-adopts-strictest-limits-on-livestock-antibiotics", "country": "US", "title": "California adopts strictest limits on livestock antibiotics", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "California adopts strictest limits on livestock antibiotics - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f732a2a1e249688476fc110adf273868e63b80e"}, "author": "USNews", "url": "http://www.usnews.com/news/science/news/articles/2015/10/10/california-adopts-strictest-limits-on-livestock-antibiotics", "ord_in_thread": 0, "title": "California adopts strictest limits on livestock antibiotics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "California adopts nation's toughest restrictions on use of antibiotics for livestock In this Wednesday Oct. 7, 2015 photo, cattle graze in a field near Sacramento, Calif. California has adopted the toughest limits in the U.S. on the use of antibiotics in healthy livestock, barring their routine use to prevent illness or promote growth. Calling the overuse of antibiotics \"an urgent public health problem,\" Gov. Jerry Brown announced Saturday, Oct. 10, 2015 he signed the legislation. (AP Photo/Rich Pedroncelli,)\n 42 p.m. EDT + More By JULIET WILLIAMS, Associated Press\nSACRAMENTO, Calif. (AP) — California has adopted the toughest limits in the nation on the use of antibiotics in healthy livestock, barring their routine use to prevent illness or promote growth.\nCalling the overuse of antibiotics \"an urgent public health problem,\" Gov. Jerry Brown announced Saturday that he signed the legislation. The bill, SB 27, will curb the overuse of antibiotics in livestock, which limits the effectiveness of the medicines in both animals and people and contributes to the spread of dangerous, drug-resistant superbugs.\n\"The science is clear that the overuse of antibiotics in livestock has contributed to the spread of antibiotic resistance and the undermining of decades of life-saving advances in medicine,\" Brown said in a statement.\nThe U.S. Centers for Disease Control and Prevention calls antibiotic resistance one of the world's most pressing health problems and estimates that 23,000 Americans die annually as a result of antibiotic-resistant infections.\nThe agency has recommended phasing out their use in cases solely to promote growth in livestock. In low doses, some antibiotics can generate greater muscle development by boosting the efficiency of food that animals eat.\nSupporters of the legislation by Sen. Jerry Hill, D-San Mateo, say the antibiotics are fed to mostly healthy animals such as cows, pigs and chickens to make them grow faster and prevent disease in crowded industrial farms.\nWidespread use of antibiotics by humans and animals reduce their effectiveness in treating illnesses because the diseases adapt by mutating, creating superbugs. Once-treatable illnesses can become dangerous infections when antibiotics are no longer effective.\n\"The lifesaving potential of antibiotics is quickly diminishing, and people are dying because the drugs are less effective,\" Hill said in a statement.\nOpponents argued that the California legislation does not go far enough to restrict preventive or routine use of antimicrobial drugs. Groups such as the California Cattlemen's Association remained neutral on the bill.\nMichael Hansen, a senior scientist at Consumers Union, the policy division of Consumer Reports, said many companies have voluntarily agreed to stop using antibiotics to promote growth after guidance from the Food and Drug Administration.\n\"No state yet has been able to pass a bill that is stronger than the one in California, and the fact that California is an important ag state, that makes this an important action,\" Hansen said.\nThe antibiotics are different from the growth hormones used by many food producers that have drawn criticism and that some grocery stores and food chains have phased out. Companies including McDonald's, Chipotle and Panera also have begun promoting their chicken as raised without antibiotics.\nBrown, a Democrat, vetoed a similar version of the bill last year, urging the state Department of Food and Agriculture to work with lawmakers on the issue. His office helped make changes to this year's measure to strengthen protections against using antibiotics to prevent disease.\nThe bill allows exemptions when a licensed veterinarian determines antimicrobial drugs are needed to treat a disease or infection, to control the spread of a disease, or in relation to surgery or a medical procedure, according to an analysis prepared for the Legislature.\nThe California Veterinary Medical Association expressed concern that veterinarians might not be able to prescribe the drugs preventively to treat diseases for which there is no test available to determine which animals are carriers.\nThe law, which takes effect in 2018, also eliminates the availability of livestock antibiotics for over-the-counter sales.\n ", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe35eq%3Fsrc=usn_gp", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe35eq%3Fsrc=usn_fb", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe35eq%3Fsrc=usn_li&title=California%20adopts%20strictest%20limits%20on%20livestock%20antibiotics&summary=&source=U.%20S.%20News", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe35eq%3Fsrc=usn_rd&title=California%20adopts%20strictest%20limits%20on%20livestock%20antibiotics", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe35eq%3Fsrc=usn_su", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe35eq%3Fsrc=usn_tw&via=usnews&text=California%20adopts%20strictest%20limits%20on%20livestock%20antibiotics"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T07:07:46.735+03:00", "highlightTitle": ""}