{"organizations": [], "uuid": "a1b05c06c3c1a5f89cd6aae75b67f0d37594b706", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2011/06/23/Obituaries/Advance/Images/Farrakhan-Edit006.JPG", "site_section": "http://www.washingtonpost.com/opinions", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/louis-farrakhans-pleas-for-justice-are-blunted-by-bigotry-and-calls-to-violence/2015/10/08/3518ddca-6dd3-11e5-aa5b-f78a98956699_story.html", "country": "US", "title": "Louis Farrakhan’s pleas for justice are blunted by bigotry and calls to violence", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Louis Farrakhan’s pleas for justice are blunted by bigotry and calls to violence - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "a1b05c06c3c1a5f89cd6aae75b67f0d37594b706"}, "author": "Jonathan A. Greenblatt", "url": "http://www.washingtonpost.com/opinions/louis-farrakhans-pleas-for-justice-are-blunted-by-bigotry-and-calls-to-violence/2015/10/08/3518ddca-6dd3-11e5-aa5b-f78a98956699_story.html", "ord_in_thread": 0, "title": "Louis Farrakhan’s pleas for justice are blunted by bigotry and calls to violence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, DC - OCTOBER 16: Nation of Islam leader Louis Farrakhan gives a two hour speech at the Million Family March in Washington, DC on October 16, 2000. (Robert A. Reeder/THE WASHINGTON POST) By Jonathan A. Greenblatt October 8 at 8:38 PM Jonathan A. Greenblatt is national director of the Anti-Defamation League.\nF rom Charleston to Baltimore and Ferguson, it’s undeniable that our country continues to wrestle with racism and inequality. But recently there have been some notable and hopeful developments — including bipartisan prison reform and the removal of the Confederate battle flag from the grounds of the South Carolina statehouse.\nThis weekend in Washington, a major demonstration will take place that is billed as a call for justice yet is being organized and led by Nation of Islam leader Louis Farrakhan, who has a long history of bigotry against whites, Jews and the lesbian, gay, bisexual and transgender community.\nThe stated goals of Saturday’s commemoration of the 1995 “Million Man March” — including advocating for educational equity, ending police violence against people of color and addressing poverty and racism — are admirable and critically important. Tens of thousands of black men attending that first Million Man March two decades ago pledged to renounce violence except in self-defense and to “strive to love my brother, as I love myself.”\nYet Farrakhan has repeatedly rejected this central pledge of brotherly love. Instead, he frequently has promoted hatred — and not just years ago, but in the weeks leading up to this march.\nAt a promotional event in Milwaukee in August, Farrakhan said , “White people deserve to die, and they know, so they think it’s us coming to do it.”\nIn July in Miami,", "external_links": ["http://michigan.adl.org/2015/09/02/farrakhan-promotes-million-man-march-with-anti-semitism-bigotry/", "http://www.csmonitor.com/1995/1020/20183.html"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T05:11:08.743+03:00", "highlightTitle": ""}