{"organizations": [], "uuid": "b9f53b2e7ea8cc1f210d27ca7150003c3d8c345f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/09/17/1c199e81-3cfd-45c4-a2fb-c33b617fd85b/thumbnail/620x350/9858fea7f041d9e7eed3f9a39a650800/rts1ho3.jpg", "site_section": "http://cbsnews.com/feeds/rss/politics.rss", "section_title": "Politics - CBSNews.com", "url": "http://www.cbsnews.com/news/donald-trump-and-jeb-bush-agree-on-one-thing/", "country": "US", "title": "Donald Trump and Jeb Bush agree on one thing", "performance_score": 0, "site": "cbsnews.com", "participants_count": 7, "title_full": "Donald Trump and Jeb Bush agree on one thing - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T11:54:00.000+03:00", "replies_count": 10, "uuid": "2549313d215f72d7e65a142ef508a4bbfc0e9ca8"}, "author": "Rebecca Kaplan CBS News", "url": "http://www.cbsnews.com/news/donald-trump-and-jeb-bush-agree-on-one-thing/#post-0", "ord_in_thread": 0, "title": "Donald Trump and Jeb Bush agree on one thing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "They have plenty of differences on the campaign trail, but businessman Donald Trump and former Florida Gov. Jeb Bush have finally found something to agree on: That the Washington Redskins should not change their name.\n\"Honestly, I don't think they should change the name, unless the owner wanted to,\" Trump, the front-runner for the 2016 GOP nomination, said in an interview with the New York Times.\n\"I know Indians that are extremely proud of that name,\" he said. \"They think it's a positive.\"\nLast week, Bush came under fire for similar sentiments.\n\"I don't think it should change it,\" he said when he appeared on \"The Arena\" radio program. \"But again, I don't think politicians ought to be having any say about that, to be honest with you. I don't find it offensive. Native American tribes generally don't find it offensive.\"\n\nPlay Video CBS Evening News Trademark decision adds pressure for Redskins to change name The federal trademark board said the Washington team's name is “disparaging to native Americans” and ruled that the team's trademark of the name ... \nYet some Native Americans do find the name offensive , and the team has been locked in both a legal and public relations battle over its mascot. Earlier this year, a federal judge ordered the team's trademark registration cancelled because the name might be disparaging (the team can appeal the decision). Sen. Maria Cantwell, D-Washington, also introduced a bill last year to eliminate the team's tax-exempt status because it had not changed the name.\nThe Democratic National Committee immediately pounced on Bush's remarks, saying in a statement that his \"support of the Washington football team's name and mascot is extremely insulting to Native American people and is one of many reasons he will not earn the Native American vote. The team's name is a racial slur that perpetuates negative stereotypes of Native American people, and reduces proud cultures to an insulting caricature.\"", "external_links": [], "published": "2015-10-05T11:54:00.000+03:00", "crawled": "2015-10-05T18:40:59.176+03:00", "highlightTitle": ""}