{"organizations": [], "uuid": "04e1579ae65cce2dcf22a2b900d52da8ee023f0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3279475.1445319969!/fileImage/httpImage/image.gif_gen/derivatives/16x9_1180/trudeau.gif", "site_section": "http://rss.cbc.ca/lineup/politics.xml", "section_title": "CBC | Politics News", "url": "http://www.cbc.ca/news/politics/canada-election-2015-majority-liberal-regional-narrative-1.3279126?cmp=rss", "country": "IL", "title": "How Justin Trudeau's Liberal majority swept across Canada", "performance_score": 2, "site": "cbc.ca", "participants_count": 1, "title_full": "How Justin Trudeau's Liberal majority swept across Canada", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T09:53:00.000+03:00", "replies_count": 0, "uuid": "04e1579ae65cce2dcf22a2b900d52da8ee023f0c"}, "author": "Janyce McGregor", "url": "http://www.cbc.ca/news/politics/canada-election-2015-majority-liberal-regional-narrative-1.3279126?cmp=rss", "ord_in_thread": 0, "title": "How Justin Trudeau's Liberal majority swept across Canada", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Justin Trudeau's Liberal majority swept across Canada Canadians swing from Harper's 'strong, stable' Conservative majority to a truly national Liberal one By Janyce McGregor, CBC News Posted: Oct 20, 2015 2:53 AM ET Last Updated: Oct 20, 2015 2:58 AM ET All 13 provinces and territories are sending Liberal MPs to Ottawa for the 42nd Parliament, part of a broad and decisive win by Justin Trudeau's campaign. (Sean Kilpatrick/Canadian Press) Related Stories Elizabeth May re-elected, leaving party with 1 seat \nThe Liberal Party sent to the woodshed in 2006 — and told, decisively, to stay there in 2008 and 2011 — has been welcomed back to the government side of the House of Commons. \nNot just conditionally invited, but embraced, with a bigger, broader majority than pollsters or even the most optimistic Liberal strategists predicted. Terry Milewski : Stephen Harper's legacy: Good, bad and a dose of ugly \nSurprising as it might have seemed at first, the majority streamed in from both old and new directions on Monday night, built on foundations from governments past, but supported with fresh seats from places unaccustomed to voting for Trudeau's party in recent memory. \nNo worries about building a properly representative national cabinet for this new prime minister: every province and all three territories are sending at least one Liberal to the 42nd Parliament. Conservative's Leona Aglukkaq out as Liberals sweep the North Atlantic Canada sweep Former television host Seamus O'Regan snatched St. John's South-Mount Pearl for the Liberals, one of two ridings Liberals took over from New Democrats in Newfoundland. (CBC) \nThe flood of red seats rose first in the East, a region pollsters had predicted would favour the Liberals, but not in this magnitude. Only Liberals were left standing. \nOutgoing cabinet minister Peter MacKay's Central Nova riding went Liberal by the kind of margin MacKay used to enjoy as a Conservative. He called it a \"sea of change.\" Atlantic Canada gives nation 1st glimpse of Liberal strength \n\"We're used to high tides here in Atlantic Canada. This is not what we had hoped for at all,\" MacKay said on the CBC News election special. \"People were looking for something different.\" \nLost in the tide were NDP team anchors like Nova Scotia's Megan Leslie, the party's deputy leader, and Peter Stoffer, viewed as one of the most popular, constituency-first MPs on the Hill. \nBut when even faithful New Brunswick Conservative seats turned red, the hints of broad change truly materialized. \n\"When people wanted to change the Harper government in Atlantic Canada they saw a dynamic, new-generation leader with new ideas, who was positive,\" said Liberal Dominic LeBlanc, a longtime family friend of Trudeau's dating back to their fathers' political careers, and likely to be a senior New Brunswick cabinet minister. Francophone Quebec returns \nLiberals breezed to victory on their traditionally friendly turf on the Island of Montreal, even giving NDP Leader Tom Mulcair a bit of a scare in Outremont earlier in the evening. \nBut perhaps the most extraordinary story of the Trudeau majority is a return to the kind of support his father Pierre used to pull in Quebec. Francophones, always an integral part of a credible national government, have, if not forgotten, then at least forgiven past Liberal sins. Compared with the 2015 alternatives, they've decided to sign back on. Stunning Liberal gains in Quebec come at the expense of NDP \nThe much-discussed three- and four-way races anticipated in Quebec appeared to break often in the Liberals' favour, with 40 seats in total, more than three-quarters of which represented gains — much more support than the party enjoyed during its previous Liberal governments under Jean Chrétien in the '90s, when the Bloc Québécois held a lock on the vast majority of francophone seats. Gaspésie-Îles-de-le-Madeleine was the first Quebec riding to swing for the New Democrats in 2011. In 2015, Diane Lebouthillier's win was only the beginning for the Liberals outside Montreal. (Marika Wheeler/CBC News) \nThe BQ staged a modest but incomplete comeback: its 10 seats going forward are more than its four after 2011, and two at dissolution, but leader Gilles Duceppe's personal comeback failed in his downtown Montreal riding, and the party still won't have official party status in the Commons. \nThe New Democrats' orange wave of 2011 — which came at the expense of the BQ — crashed across Quebec in 2015, with all but 16 of the 58 seats won then slipping from their hands. \nFormer leader and party elder Stephen Lewis said he thought the niqab controversy did real damage in Quebec. \n\"It's a testament to Tom Mulcair, he didn't move, he showed he had real integrity and principle, but somewhere, somewhere, we went slightly off the rails,\" Lewis said. \nOn a rough night elsewhere in Canada, the Conservative campaign's relative emphasis on the ridings around Quebec City earned it modest success, with its best-ever finish during Stephen Harper's tenure: 12 seats. Fortress Ontario's red bricks \nJean Chrétien's majority governments in the '90s were built around Ontario —most famously, his 101-seat-strong Ontario caucus after the 1997 vote. \nPollsters forecast a strong performance and the Ontario returns did not disappoint: 80 seats at the end of the night, in comparison with the Conservatives' 33 and the NDP's eight. Rookie politician and former Toronto police chief Bill Blair won the riding of Scarborough Southwest Monday night in a Liberal sweep of the city. (CBC News) \nTrudeau's caucus is not only urban and stretches far beyond Toronto — although as expected, the Greater Toronto Area did overwhelmingly swing to Liberal candidates, at the expense of Tory cabinet ministers like Joe Oliver and Julian Fantino. Liberals sweep Brampton, Mississauga en route to GTA dominance \nFormer finance minister Jim Flaherty's Whitby seat also switched sides. \nNDP veterans like Peggy Nash and Olivia Chow failed to buck the current of progressive voters decamping en masse. \nNorthern and eastern Ontario seats, including many in Ottawa, turned Liberal, as did a handful of urban seats in 519 centres like London and Kitchener-Waterloo .", "external_links": [], "published": "2015-10-20T09:53:00.000+03:00", "crawled": "2015-10-20T10:23:17.085+03:00", "highlightTitle": ""}