{"organizations": [], "uuid": "5cb9cf744a302333a0df1fbc846907e593d85a48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livemint.com", "main_image": "http://www.livemint.com/rf/Image-621x414/LiveMint/Period1/2015/10/22/Photos/pds-kzcD--621x414@LiveMint.jpg", "site_section": "http://livemint.com//rss/economy_politics", "section_title": "economy_politics", "url": "http://www.livemint.com/Politics/TCXLaXV1AJ6GdWoZmH85rI/Karnatakas-public-distribution-system-to-go-digital-within.html", "country": "IN", "title": "Karnataka’s public distribution system to go digital within three months", "performance_score": 0, "site": "livemint.com", "participants_count": 1, "title_full": "Karnataka’s public distribution system to go digital within three months - Livemint", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:34:00.000+03:00", "replies_count": 0, "uuid": "5cb9cf744a302333a0df1fbc846907e593d85a48"}, "author": "Nidheesh M.K.", "url": "http://www.livemint.com/Politics/TCXLaXV1AJ6GdWoZmH85rI/Karnatakas-public-distribution-system-to-go-digital-within.html", "ord_in_thread": 0, "title": "Karnataka’s public distribution system to go digital within three months", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bengaluru: Karnataka food and civil supplies minister Dinesh Gundu Rao on Wednesday said the state’s fair price shops will go digital within the next three months.\nThe state is mapping and feeding Aadhaar and biometric information of ration card holders into a server. All transactions in the public distribution system (PDS) will have to be authenticated digitally, using point-of-sale machines at shops, said Rao.\nThe move comes in the backdrop of similar digital initiatives undertaken in states such as Kerala, Andhra Pradesh and Chhattisgarh to ensure transparency and plug PDS leakages.\n“The public distribution system in Karnataka is already IT-enabled. We have updated our database in a server through NIC (National Information Center) and already, some 3000 shops are running on it,” he said.\n“We will only give the specifications; we won’t purchase the (PoS) device. The shopowner is free to buy it from different companies. It will be a one-time expenditure for him and in return, we are going to more than double the commission (for shopowners),” said Rao.\nKarnataka has more than 1.5 crore ration card holders getting subsidised rice, pulses and oil from around 20,000 shops across the state. A pilot run of the project will be kickstarted in Udupi soon, the minister said.\n“In the last two months alone, as part of the digital initiatives, the government has removed some 2.7 lakh BPL cardholders, including about 800 top government employees, who are not eligible for subsidies. The state was also able to recover more than Rs 50 lakh as penalty during the process,” he said.\n“On an average, we are removing 3,000 cards per day. We are doing this by various methods including cross-checking database of government employees and database for ration cardholders,” said Rao.", "external_links": [], "published": "2015-10-22T04:34:00.000+03:00", "crawled": "2015-10-22T00:17:27.654+03:00", "highlightTitle": ""}