{"organizations": [], "uuid": "da3caf5ef52ec2f2b296b28228cedefaf39ea3c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/32/7fb1cc565e76b929175be997a37358/media:f39302c8a83d4fdbb3d8646482478a7cHolidayFasterDelivery.JPEG", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/business/articles/2015/10/16/wal-mart-others-speed-up-deliveries-to-shoppers", "country": "US", "title": "Wal-Mart, others speed up deliveries to shoppers", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Wal-Mart, others speed up deliveries to shoppers - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "da3caf5ef52ec2f2b296b28228cedefaf39ea3c0"}, "author": "USNews", "url": "http://www.usnews.com/news/business/articles/2015/10/16/wal-mart-others-speed-up-deliveries-to-shoppers", "ord_in_thread": 0, "title": "Wal-Mart, others speed up deliveries to shoppers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ANNE D'INNOCENZIO, AP Retail Writer\nBETHELEHEM, Pa. (AP) — Christmas won't come early this year, but the gifts might.\nJust in time for the winter holiday shopping season, Amazon, Wal-Mart, Macy's and other retailers are working behind the scenes to make sure they can deliver online orders to shoppers faster.\nRetailers are building bigger warehouses —some the size of 20 football fields — to handle shipments. They're also sending orders to shoppers directly from their stores and using sophisticated software that tells them the quickest, cheapest way to get orders shipped. And Amazon is cutting the time it takes to process an order from hours to minutes by using robots to pull items for shipment in its warehouses.\nIt's a race for time by retailers as more people shop online. U.S. online sales are expected to increase 12 percent to $371 billion this year, accounting for 10 percent of overall retail sales, says Forrester Research. But as online shopping grows, so does the impatience of shoppers who want their orders fast.\nTraditional brick-and-mortar stores are trying to catch up to Amazon.com, which set the standard for speed with its two-day delivery for members of its Prime loyalty program who pay $99 a year. But even Amazon feels pressure to please customers who have little tolerance for lengthy delivery waits.\n\"I would like to plan ahead, but I've been able to wait until the last minute to get things done,\" said Keri Early, a Clyde, Illinois, resident who orders from Amazon frequently.\nFor many retailers, the goal to meet the demands of shoppers like Early for speedy service is to make two-day delivery standard. That's half the average for standard delivery for the top 40 online retailers, according to data company StellaService. But most are stopping short of guaranteeing customers faster deliveries.\nWal-Mart says it aims to get packages to shoppers who get standard shipping within two days for a majority of the U.S. this holiday season. The retailer now uses 83 of its more than 4,500 U.S. stores to ship to customers.\nThe world's largest retailer also is spending $1.2 billion to $1.5 billion in online investments this year and $1.1 billion next year. That's up from last year's $1 billion. The investments are squeezing profit: Wal-Mart stock tumbled Wednesday after it warned earnings would be down as much as 12 percent next year in part because of its heavy spending on e-commerce.\nStill, Wal-Mart is spending to stay competitive with online rivals. Since last year, the world's largest retailer has opened five warehouses across the country in Bethlehem, Pa., Fort Worth, Texas, Plainfield, Indiana, and Atlanta to handle online orders. Two more are opening in Florida next year.\nThe new warehouses each will ship hundreds of thousands of orders daily, four to five times its dozens of existing smaller warehouses. Each new warehouse has about a million items, five times the network of older warehouses. That will enable Wal-Mart to offer more consolidated orders arriving in fewer boxes.\n\"This is going to allow us to be more efficient, to do it faster, to do it cheaper and be more accurate with the orders, which is important with the customers,\" said Greg Foran, CEO of Wal-Mart's U.S. business.\nOne of Wal-Mart's two Bethlehem, Pa. warehouses opened in July and is considered the retailer's crown jewel. It has two towers with four stories of the fastest moving items of the season that can be retrieved through a computerized chute. For example, for the holidays, that would include iPads and swimsuits for the summer\n\"By mid-November, this place will be humming,\" said Justen Traweek, Wal-Mart's vice president of e-commerce operations and fulfillment.\nOther retailers also have built new warehouses to meet demand:", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T19:13:01.989+03:00", "highlightTitle": ""}