{"organizations": [], "uuid": "97b7694b50760e6d951247020d0c5e984df7444d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8893006_G.jpg", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30128280/nonprofits-seek-supreme-court-review-of-contraceptives-case", "country": "US", "title": "Nonprofits seek Supreme Court review of contraceptives case", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Nonprofits seek Supreme Court review of contraceptives case - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "97b7694b50760e6d951247020d0c5e984df7444d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30128280/nonprofits-seek-supreme-court-review-of-contraceptives-case", "ord_in_thread": 0, "title": "Nonprofits seek Supreme Court review of contraceptives case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARK SHERMAN\n Religion, birth control and President Barack Obama's health care overhaul are about to collide at the Supreme Court yet again.\nFaith-affiliated charities, colleges and hospitals that oppose some or all contraception as immoral are battling the administration over rules that allow them to opt out of covering the contraceptives for women that are among a range of preventive services required to be in health plans at no extra cost.\nThe religious-oriented nonprofit groups say the accommodation provided by the administration does not go far enough because they remain complicit in providing government-approved contraceptives to women covered by their plans, though the groups are not on the hook financially.\nA new federal appeals court ruling is the first to agree with the nonprofits, after seven other appellate panels sided with the administration. Such disagreements among lower courts often are a trigger for consideration by the Supreme Court.\nIf the Supreme Court takes up the matter in its term that begins in October, it would be the fourth high court case stemming from the health care overhaul that Obama signed into law in 2010.\nThe high court has twice preserved the law, but has allowed some for-profit employers with religious objections to refuse to pay for contraceptives for women.\nHouses of worship and other religious institutions whose primary purpose is to spread the faith are exempt from the requirement to offer birth control.\nFor other religious-affiliated nonprofit groups such as hospitals and schools, the administration argues that the accommodation creates a generous moral and financial buffer between religious objectors and funding birth control. The nonprofit groups just have to raise their hands and say that paying for any or all of the 20 devices and methods approved by government regulators would violate their religious beliefs.\nTo do so, they must fill out a government document or otherwise notify the government so that their insurers or third-party administrators can take on the responsibility of paying for the birth control. The employer does not have to arrange the coverage or pay for it. Insurers get reimbursed by the government through credits against fees owed under other parts of the health law.\nBut dozens of colleges, hospitals, charities and other organizations have said in lawsuits they still are being forced to participate in an effort to provide coverage for contraceptives, including some which they claim amount to abortion. The government may impose fines on groups that do not comply.\nMark Rienzi, who has represented some of the nonprofits, said the government is asking the groups to do more than just raise their hands.\n\"Everyone's claim is, 'I can't do it on the form and in the way that lets you use my plan to give out the stuff. I can't be involved,'\" Rienzi said. The government has other ways of providing the contraceptives, he said.\nAppeals courts in Chicago, Cincinnati, Ohio, Denver, New Orleans, New York, Philadelphia and Washington, D.C., have dismissed those claims. But the 8th U.S. Circuit Court of Appeals in St. Louis decided otherwise in a case involving several nonprofit groups in Missouri, including CNS International Ministries of Bethel and Heartland Christian College of Newark.\n\"In light of CNS and HCC's sincerely held religious beliefs, we conclude that compelling their participation in the accommodation process by threat of severe monetary penalty is a substantial burden on their exercise of religion,\" Judge Roger Wollman wrote for a unanimous three-judge panel in its decision Sept. 17. Wollman said the groups probably have a right under the federal Religious Freedom Restoration Act to refuse to comply with the regulations.\nSeven appeals already are pending at the Supreme Court; the justices could decide by the end of October whether to hear one or more of those.\nThe earlier appellate rulings found that the administration's rules removed the organizations from providing contraceptives and turned the process over to third parties. Far from burdening their religious exercise, the rules allowed the groups to wash their hands of any involvement, wrote Judge Richard Posner of the Chicago-based 7th U.S. Circuit Court of Appeals.\nThe administration has strenuously opposed the appeals, arguing in part that there is no reason to take up the issue because no appeals court had disagreed. That changed with the 8th Circuit ruling. But the administration also has contended that the accommodation does not violate the nonprofits' religious rights.\nEven if the Supreme Court rejects that argument, the administration has said in court papers, the justices should determine that the system for getting contraceptives to women covered by the groups' insurance plans is the most effective and efficient way to do so.\n ", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-10-03T12:24:12.160+03:00", "highlightTitle": ""}