{"organizations": [], "uuid": "d5598b0e1919737ab41b8e37103832453b40f42d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arktimes.com", "main_image": "http://media2.fdncms.com/arktimes/imager/u/slideshow/4127585/bulldogs.jpg", "site_section": "http://www.arktimes.com/arkansas/Rss.xml", "section_title": "Arkansas news, politics, opinion, restaurants, music, movies and art, Arkansas Times", "url": "http://www.arktimes.com/RockCandy/archives/2015/10/16/staff-picks-bulldogs-bet-cyphers-ginger-scallion-sauce-and-a-message-from-kaya", "country": "US", "title": "Staff Picks: Bulldogs, BET cyphers, ginger scallion sauce and a message from Kaya", "performance_score": 0, "site": "arktimes.com", "participants_count": 1, "title_full": "Staff Picks: Bulldogs, BET cyphers, ginger scallion sauce and a message from Kaya", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:34:00.000+03:00", "replies_count": 0, "uuid": "d5598b0e1919737ab41b8e37103832453b40f42d"}, "author": "Will Stephenson", "url": "http://www.arktimes.com/RockCandy/archives/2015/10/16/staff-picks-bulldogs-bet-cyphers-ginger-scallion-sauce-and-a-message-from-kaya", "ord_in_thread": 0, "title": "Staff Picks: Bulldogs, BET cyphers, ginger scallion sauce and a message from Kaya", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Friday, October 16, 2015 Arkansas Times Recommends Staff Picks: Bulldogs, BET cyphers, ginger scallion sauce and a message from Kaya Posted By Will Stephenson , Max Brantley , Caitlin Love , Lindsey Millar , Bryan Moats and Kaya Herron on Fri, Oct 16, 2015 at 4:34 PM click to enlarge @jmarcoz Arkansas Times Recommends is a weekly series in which Times staff members (or whoever happens to be around at the time) highlight things we've been enjoying this week. So I'm a sucker for smush-face dogs — bulldogs, Frenchies, pugs. As such I could look at jmarcoz's Instagram account all day. Smush faces galore. Longer on the English variety than French, but plenty of both and lots and lots of puppy shots. You can have your cat shots. I'll take the bullies. How can you not smile? — Max Brantley I recommend both of David Remnick's books on Russia. They're really good. — David Ramsey Five YouTube lessons: 1.) What it sounds like to spend 40 minutes driving around Galveston, Texas, in the rain. 2.) A two-minute loop of one line from Chris De Burgh's 1986 ballad \"Lady In Red,\" an empty sentence fragment turned rainbow trance state. 3.) Can's only hit single in the UK , performed on Top of the Pops in 1976. Video cuts off right before host Noel Edmonds quips, \"We wanted to have them on at the beginning of the show, but then realized we couldn't have a Can opener.\" 4.) Randall Lyon performing live on Little Rock's KABF in the early '90s, with New York Times pop critic Robert Palmer. Tav Falco: \"I guess Randall was as close to genius as anyone I’ve ever known.\" 5.) The soundtrack to the 1980 cult movie \"Maniac,\" written by and starring Joe Spinell, who was in \"Rocky\" and \"Taxi Driver\" and played mob assassin Willi Cicci in \"The Godfather\" movies. He was planning a \"Maniac\" sequel when he died in 1989, after cutting himself accidentally on a glass shower door and falling asleep on his couch. — Will Stephenson On Tuesday, I flipped between the Democratic presidential debate, an on-demand episode of \"The Knick\" and \"The BET Hip-Hop Awards.\" (You can't put me in a box, marketers!). This is what I took away: Syphilis used to make people's noses fall off. Bernie's \"The American people are sick and tired of hearing about your damn emails\" gift to Hillary. And playwright, actor and new MacArthur genius grant recipient Lin-Manuel Miranda is a really good rapper. Miranda is, of course, the writer and star of \"Hamilton,\" the consensus Broadway show of the year. It's the life story of Alexander Hamilton, told mostly through rapping. It's impossible to get a ticket for. But the cast album just came out, and while, as someone who deeply dislikes musical theater, I like this verse above better, the album is pretty great. — Lindsey Millar About twice a week I prepare a savory and delicious topping called ginger scallion sauce, a recipe from the Momofuku cookbook , which I got from my boyfriend for my birthday last year. To show my gratitude, I slow-cooked a ten pound pork butt for his birthday the next month, using a recipe from this cookbook. I served the pork butt with the ginger scallion sauce. The ingredients are un-mysterious: minced ginger and sliced scallions, with soy sauce and rice vinegar and a dash or two of kosher salt. I learned over time that this sauce can go on anything, so I've been putting it on everything: rice with vegetables, rice without vegetables, chicken ramen, rice noodles.Anyway, the sauce is delicious and perfect if you're looking to add something to your bland and vaguely asian-flavored meal (if you eat tofu, add this to it). The sauce takes some time to prepare, but it's worth it. There's the chopping of scallions (2 1/2 cups), which takes about 10 minutes with a dull blade. Then you have to prepare minced, peeled ginger (1/2 cup), which, if you've ever tried to peel ginger you know it takes ages. I've expedited the mincing process by using my blender, into which I drop the ginger after I've shaved off most of the root skin. Mix these together with 1 1/2 teaspoons soy sauce (I confused this unit for months and was adding tablespoons of soy sauce to the mix until just a few weeks ago), 3/4 teaspoons rice vinegar, and 3/4 teaspoons of kosher salt. Add to a rice-based meal and eat up. — Caitlin Love Enjoy . — Bryan Moats I'm not really sure what to say. Today is my last day as an intern at the Arkansas Times and it has been an incredible experience. I've worked with the best editorial staff in the country for a full year — learning and making memories I won't ever be able to forget — laughing all along the way. I'm so thankful to have had this opportunity and for everyone who has helped me on this journey. Max, your laugh is a sound I will never be able to forget and I'm still in shock that I had the privilege to work with the Max Brantley. Your words are poignant, pithy, and always insightful. It has truly been a pleasure to be in your presence. David, thank you for believing in me. You took me under your wing, showed me how to conduct interviews, reach people where they are and write the stories that matter. It was an honor to share a byline with you. Leslie, thank you for editing every piece with care, teaching me about style, keeping our meetings entertaining and making me feel like a part of the team. You are the life of the party and I'm so glad I got to attend. Will, thank you for picking my brain and recommending articles and songs that I wouldn't have come across myself, they always seem to be just right for me and have helped me explore interests I didn't know I had. Moats, you are amazing. Watching you work tirelessly to create covers and graphics over the last year has deepened my respect for artists in general, but graphic designers in particular. The Times owes its beauty to you. Chilson, thank you so much for always being on the scene, capturing the world going on around us and still being the coolest guy in the office. Lindsey, thank you so much for this opportunity, for believing in me and assigning me tasks that challenged me and helped me grow as a writer, researcher and person. I appreciate everything you've done to help me along the way and I can't thank you enough. And lastly a special thank you to Benji for being a compass and a friend in the times I needed one the most. You are an amazing writer and an even better human being. Thank you for never losing patience with my seemingly endless lines of questioning, valuing and respecting my opinion while being true to yourself. You are wonderful. For those that I did not mention by name, please charge it to my head and not my heart, I'm having a hard time writing this as it is with tears streaming down my face. No one can tell because of all my hair and discrete sniffles, but know that I am falling to pieces at my desk. You have all made a significant impact on my life and I appreciate each and everyone of you. This Friday I recommend you let the people you care about know how much they mean to you and thank them for their presence in your life. Also check out this awesome candy and booze Halloween pairing chart. You can thank me later. — Kaya Herron", "external_links": [], "published": "2015-10-17T00:34:00.000+03:00", "crawled": "2015-10-17T01:29:04.922+03:00", "highlightTitle": ""}