{"organizations": [], "uuid": "214baac7893f9d46e61855ae45e36760eff175f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30305529/ibc-congratulates-the-liberal-party-of-canada", "country": "US", "title": "IBC congratulates the Liberal Party of Canada", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "IBC congratulates the Liberal Party of Canada - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "214baac7893f9d46e61855ae45e36760eff175f9"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30305529/ibc-congratulates-the-liberal-party-of-canada", "ord_in_thread": 0, "title": "IBC congratulates the Liberal Party of Canada", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Insurance Bureau of Canada\nLooks forward to collaborating to build resilient communities\nTORONTO , Oct. 20, 2015 /CNW/ - Today, Insurance Bureau of Canada (IBC) welcomed Canada's Prime Minister-elect, Justin Trudeau , and his colleagues at the Liberal Party of Canada as they form a new majority government.\n\"On behalf of IBC and its members, I would like to extend my sincere congratulations to Mr. Trudeau and to all Members of Parliament who prevailed in yesterday's election,\" said Don Forgeron , President and CEO, IBC. \"We look forward to working with the government on its election pledge to strengthen communities facing increasingly severe weather events stemming from climate change.\"\nPrior to 2009, insured damages from natural catastrophes were not notable. Today, however, they sit around $1 billion a year and in 2013 hit a historic high of $3.2 billion . The insurance industry has witnessed first-hand the devastating effects severe weather has had on Canadians, governments and businesses.\nIBC has prioritized climate change adaptation and earthquake preparedness. A 2013 report commissioned by IBC from AIR Worldwide showed that Canada is not prepared financially for a severe earthquake that could negatively impact Canada's economy.\nAbout Insurance Bureau of Canada\nInsurance Bureau of Canada (IBC) is the national industry association representing Canada's private home, auto and business insurers. Its member companies make up 90% of the property and casualty (P&C) insurance market in Canada . For more than 50 years, IBC has worked with governments across the country to help make affordable home, auto and business insurance available for all Canadians. IBC supports the vision of consumers and governments trusting, valuing and supporting the private P&C insurance industry. It champions key issues and helps educate consumers on how best to protect their homes, cars, businesses and properties.\nP&C insurance touches the lives of nearly every Canadian and plays a critical role in keeping businesses safe and the Canadian economy strong. It employs more than 118,000 Canadians, pays $6.7 billion in taxes and has a total premium base of $48 billion .\nFor media releases and more information, visit IBC's Media Centre at www.ibc.ca . Follow IBC on Twitter @InsuranceBureau or like us on Facebook . If you have a question about home, auto or business insurance, contact IBC's Consumer Information Centre at 1-844-2ask-IBC.\nIf you require more information, IBC spokespeople are available to discuss the details in this media release.\n ", "external_links": ["http://www.ibc.ca/", "http://www.xmlnews.org/ns/", "http://www.ibc.ca/on/resources/studies/air-study", "https://twitter.com/InsuranceBureau", "http://rt.prnewswire.com/rt.gif?NewsItemId=C8111&Transmission_Id=201510201013CANADANWWEB______C8111&DateId=20151020", "https://www.facebook.com/insurancebureau"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T18:17:21.586+03:00", "highlightTitle": ""}