{"organizations": [], "uuid": "2b3556acf0e498ffc5e8459bef2ef1a5365772b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news-leader.com", "main_image": "http://www.gannett-cdn.com/-mm-/c29386fa0119ce3d2c8dffc53fd4532e49bb7ac4/c=0-532-1684-1483&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/19/Springfield/Springfield/635808662933478300-FinalCover.JPG", "site_section": "http://rssfeeds.news-leader.com/springfield/politics", "section_title": "Springfield - Politics", "url": "http://www.news-leader.com/story/news/politics/elections/2015/10/19/presidential-candidate-ben-carson-visit-springfield-part-book-tour/74229656/", "country": "US", "title": "Presidential candidate Ben Carson to visit Springfield as part of book tour", "performance_score": 0, "site": "news-leader.com", "participants_count": 0, "title_full": "Presidential candidate Ben Carson to visit Springfield as part of book tour", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:41:00.000+03:00", "replies_count": 0, "uuid": "2b3556acf0e498ffc5e8459bef2ef1a5365772b1"}, "author": "", "url": "http://www.news-leader.com/story/news/politics/elections/2015/10/19/presidential-candidate-ben-carson-visit-springfield-part-book-tour/74229656/", "ord_in_thread": 0, "title": "Presidential candidate Ben Carson to visit Springfield as part of book tour", "locations": ["Springfield"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jon Swedien", "Ben Carson"], "text": "Presidential candidate Ben Carson to visit Springfield as part of book tour Jon Swedien , News-Leader 4:41 p.m. CDT October 19, 2015 Book cover of Republican presidential candidate Ben Carson's book, \"A More Perfect Union.\" (Photo: submitted photo) 102 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE \nRepublican presidential candidate Ben Carson told the News-Leader Monday he hopes his book tour, which will stop in Springfield Thursday, encourages people to study the U.S. Constitution. \nCarson will make an appearance at 7:30 p.m. Thursday at the Mardel Christian & Education Supply store at 1533 E. Battlefield Rd., where he will sign copies of his latest book, \"A More Perfect Union.\" \n\"I was a little bit alarmed over how much people knew about our constitution,\" Carson said Monday in an interview. He explained he believes too many citizens don't have a strong grasp of the U.S. Constitution. Carson, a retired neurosurgeon, authored the book along with his wife, Candy Carson. In the book, Carson discusses his view of the constitution and many of his conservative views, including that states should be given the right to decide on gay marriage, and that he opposes restrictions on gun ownership. \nCarson said this month he will be focused on the book tour some days and will have campaign events other days. Carson's move to interrupt his campaign for a book tour is \"unusual,\" but probably won't hurt or benefit the campaign in any substantial way, said Daniel Ponder, the L.E. Meador Chair in Political Science at Drury University. \n\"It's just another way to get him out in front of the public,\" Ponder said. \nCarson said hundreds and even thousands of people have showed up to his book signings. He said the signings give him little time to interact with people because they are moving through the signing line quickly but he still hears words of encouragement. \nHolding a book tour isn't the only thing that has garnered Carson headlines in recent weeks. \nCarson, who has shot up to second place in many polls for the Republican nomination behind Donald Trump, made several controversial statements this month, including that he would not support a Muslim for president, and that the Holocaust would have been less successful had German citizens had guns. \nCarson doesn't believe those comments hurt him among voters because many understand the point he was making, he said. \n\"The people absolutely know what I am saying,\" Carson said. \nThat may well be true among many voters in the Ozarks, Ponder said. Carson's brand of conservative evangelical Christian politics fits right in with many in the Ozarks, Ponder said. \n\"He's among his crowd\" in Springfield, Ponder said. \nMardel, the store hosting the event, states in a post on its website that all books to be signed at Thursday's event must be bought at the store. 102 CONNECT 6 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://sgfnow.co/1LH0nrS TOP VIDEOS", "external_links": [], "published": "2015-10-20T00:41:00.000+03:00", "crawled": "2015-10-20T11:45:13.330+03:00", "highlightTitle": ""}