{"organizations": [], "uuid": "8c0673b2a2684696bcf99a60715b144414ad8fe9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "saharareporters.com", "main_image": "", "site_section": "http://saharareporters.com/feeds/politics/feed", "section_title": "Politics", "url": "http://saharareporters.com/2015/10/17/i-will-not-resign-if-we-fail-defeat-boko-haram-%E2%80%93-buhari", "country": "", "title": "I Will Not Resign If We Fail To Defeat Boko Haram – Buhari", "performance_score": 0, "site": "saharareporters.com", "participants_count": 1, "title_full": "I Will Not Resign If We Fail To Defeat Boko Haram – Buhari", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T00:45:00.000+03:00", "replies_count": 0, "uuid": "8c0673b2a2684696bcf99a60715b144414ad8fe9"}, "author": "siteadmin", "url": "http://saharareporters.com/2015/10/17/i-will-not-resign-if-we-fail-defeat-boko-haram-%E2%80%93-buhari", "ord_in_thread": 0, "title": "I Will Not Resign If We Fail To Defeat Boko Haram – Buhari", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I Will Not Resign If We Fail To Defeat Boko Haram – Buhari If Boko Haram isn’t defeated by December, however, Buhari said he “will not resign”. by Vanguard Newspaper Oct 17, 2015 \nIn a wide-ranging and exclusive interview with Al Jazeera English’s flagship current affairs show, ‘UpFront’, Nigerian president Muhammadu Buhari pledged to defeat Boko Haram by December but also acknowledged he would be willing to negotiate with the group to secure the release of the kidnapped Chibok schoolgirls. \nPresident Muhammadu Buhari \n“They have to prove to us that they are alive, they are well, and then we can…negotiate with them,” President Buhari told ‘UpFront’ host Mehdi Hasan. “We said it and we meant it. If we are satisfied that the girls are alive.” \nWhen asked whether he would offer financial payments, or a prisoner release, to Boko Haram in return for the girls, Buhari did not rule out either option. “Well it depends on the negotiations with the leadership of Boko Haram.” \nThe president has pledged to defeat Boko Haram by the end of 2015 and told Hasan: “As soon as the rainy season comes, which is by the end of the year […] Boko Haram will virtually be out of their main stronghold and that will be the end of it [….] Attacks by Boko Haram on townships, on military installations, will certainly stop.” \nIf Boko Haram isn’t defeated by December, however, Buhari said he “will not resign”. \n“I will be determined to stay and fight it out.” \nThe president claimed not to have seen the Amnesty International report from June 2015,‘Nigeria: Stars on their shoulders: Blood on their hands’, in which the human-rights group documented abuses, torture and unlawful killings by the Nigerian armed forces and urged the government to prosecute a group of officers and senior commanders. “I haven’t received that report personally,” said Buhari. “If I get those documents… I assure you that I will take action as Commander in Chief.” \nIn the past, Buhari has been quoted as saying he supports “thetotal implementation of the sharia in the country” but he told ‘UpFront’ that “Nigerian law does not allow for” so-called sharia punishments, such as stonings and amputations, adding: “I cannot change it. I haven’t been voted by [a] majority of Nigerians to change Nigerian constitution.” \nAsked about his record as a military dictator in the mid-1980s, and the alleged human-rights abuses which occurred on his watch, Buhari said: “If there is any injustice that can be proved against me when I was there, I will gladly apologize.” The president refused, however, to concede that his now-notorious ‘war against indiscipline’ in the 1980s featured any such “injustice”.", "external_links": [], "published": "2015-10-18T00:45:00.000+03:00", "crawled": "2015-10-18T16:25:13.862+03:00", "highlightTitle": ""}