{"organizations": [], "uuid": "9ac8c438bb828c73fa665cba50e7b19337092964", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30188671/marijuana-pesticide-flap-brings-consumer-lawsuit-in-colorado", "country": "US", "title": "Marijuana pesticide flap brings consumer lawsuit in Colorado", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Marijuana pesticide flap brings consumer lawsuit in Colorado - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "9ac8c438bb828c73fa665cba50e7b19337092964"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30188671/marijuana-pesticide-flap-brings-consumer-lawsuit-in-colorado", "ord_in_thread": 0, "title": "Marijuana pesticide flap brings consumer lawsuit in Colorado", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By KRISTEN WYATT\nAssociated Press DENVER (AP) - Two marijuana users in Colorado filed a lawsuit Monday against a pot business they said used an unhealthy pesticide to grow their weed - a case that lawyers say is the first product liability claim in the nation involving the legal marijuana industry.\nThe case underscores disagreement over what chemicals should be allowed in the cultivation of pot and leaves the plaintiffs facing an unusual dilemma: The U.S. government still regards almost all marijuana as an illicit drug and there are no federal safety guidelines for growing it.\nThe state of Colorado has approved a list of pesticides that are acceptable to grow pot, but it's far from complete and leaves out several pesticides that are commonly used on both food and tobacco.\nThe lawsuit filed in state court targets the use of a fungicide called Eagle 20 EW by a Denver-based pot company called LivWell, where authorities seized thousands of plants earlier this year, saying they had been treated with the pesticide.\nEagle 20 EW is commonly used on grapes and hops but can become dangerous when heated and is banned for use on tobacco. No research exists on whether the fungicide is safe to use on pot that will be eaten.\nLivWell insists its products are safe, and its confiscated plants were released by authorities after testing at acceptable levels.\nStill, the plaintiffs insist that LivWell should be punished for using a chemical not listed by the state as acceptable for use on pot.\n\"The case is all about making sure that the cannabis industry is safe for consumers,\" said Steven Woodrow, an attorney for the plaintiffs.\nLivWell lawyer Dean Heizer said the nine-shop chain no longer uses Eagle 20 EW and added that no consumer illnesses have been linked to marijuana pesticides in Colorado or any other state.\n\"We have no reason to believe our product is not perfectly safe,\" he said.\nColorado is one of four states that have legalized the sale of recreational marijuana. Oregon and Washington state also allow such sales. Alaska could see retail purchases next year.\nThe U.S. Environmental Protection Agency, which regulates pesticides, told Colorado and Washington state authorities in June that they could apply to have some cannabis-related chemicals approved through what's called a special local need registration. But that process could take years.\nNews reports about pesticide questions seem to be spurring more government oversight, at least in Colorado. Denver authorities in September announced two marijuana recalls for unauthorized pesticide use.\nIn addition. Colorado Attorney General Cynthia Coffman has assigned fraud investigators to review whether some marijuana companies are improperly using the word \"organic\" on products.\nAlison Malsbury, a Seattle attorney who has reviewed product liability potential in the marijuana industry and isn't involved in the Denver lawsuit, called the legal action a harbinger of things to come.\n\"I think we're going to be seeing a lot of similar lawsuits in other states,\" Malsbury said, pointing out that the nation's largest marijuana producer, California, has no pot regulations at all. Medical marijuana is grown and sold in California but recreational sales remain against state law.\n\"States need to develop comprehensive lab-testing requirements and guidelines about what pesticides are OK to use on this product,\" Malsbury said. \"It's going to be treated no differently than no food or beverages. We're not there yet. But it's headed that way.\"\n___\nKristen Wyatt can be reached at http://www.twitter.com/APkristenwyatt\n ", "external_links": ["http://www.twitter.com/APkristenwyatt"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T22:45:46.556+03:00", "highlightTitle": ""}