{"organizations": [], "uuid": "90894e9ccd79fbc34f51e3dc7f21394de90c48f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2012/11/21/Production/Daily/A-Section/Images/mammoAP11022311568.jpg", "site_section": "http://www.washingtonpost.com/opinions", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/why-did-the-american-cancer-society-ignore-evidence-about-early-detection/2015/10/23/3368498a-78c7-11e5-a958-d889faf561dc_story.html", "country": "US", "title": "Why did the American Cancer Society ignore evidence about early detection until now?", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Why did the American Cancer Society ignore evidence about early detection until now? - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "90894e9ccd79fbc34f51e3dc7f21394de90c48f2"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/why-did-the-american-cancer-society-ignore-evidence-about-early-detection/2015/10/23/3368498a-78c7-11e5-a958-d889faf561dc_story.html", "ord_in_thread": 0, "title": "Why did the American Cancer Society ignore evidence about early detection until now?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Rui Vieira/ASSOCIATED PRESS) By Barron H. Lerner October 23 at 1:29 PM Barron H. Lerner, a professor in the division of medical ethics at New York University’s Langone Medical Center, is the author of “The Breast Cancer Wars” and, most recently, “The Good Doctor.”\nFor a century, the American Cancer Society has held up “early detection” of breast and other cancers as its mantra. Once, this made sense. But over the past few decades, the limitations of this approach have become increasingly apparent to researchers, physicians and other advocacy groups: Early detection may not save lives, and it can lead to unnecessary procedures. Yet the ACS has continued to insist that early detection was still the best way to find and treat the disease, and it demanded that Americans not skimp on regular breast exams and mammograms.\nFinally, this past week, the organization announced a new policy . It conceded that women at average risk for breast cancer should begin annual screening at age 45 — not age 40, as previously prescribed — and that screening can become less frequent after age 54. Why did it take the nation’s most fervent anti-cancer group so long to grapple with new facts? The answer is a reminder that the best way to fight disease is with evidence — and that we should not pay for tests that are not effective, even if they are popular.\nIn 1913, when the ACS was founded as the American Society for the Control of Cancer, early detection was obviously the key. Cancer was seen as a fatal disease. People sat at home with enlarging masses, frightened to visit their doctors and hear the bad news. At New York-Presbyterian Hospital, admitted patients were noted to have waited for up to three years before seeking treatment.\nThus, the ACS inaugurated a campaign warning of cancer’s “danger signals.” It urged anyone with problems such as a breast mass, weight loss or irregular bleeding to see a doctor immediately. Such advice made sense. On average, people whose cancers were diagnosed at an earlier stage did better.\nEarly detection received a huge boost in the 1940s with the introduction of the Pap smear, in which doctors scraped a woman’s cervix, looking for abnormal cells that might become cancerous. The ACS vigorously promoted Pap testing with its Women’s Field Army, which enlisted women for a fee of $1 annually to “fight” cancer. Military metaphors, which persist today, sent an optimistic message that cancer could be “defeated” with enough effort. ACS officials who traveled the country promoting the Pap smear received standing ovations after their presentations. Indeed, Pap testing fulfilled its promise. Aggressive treatment of cervical lesions prevented cancer; mortality from the disease dropped by 60 percent in the decades after 1950.\nWith this triumph in hand, the ACS turned to breast cancer. There was no Pap smear for the breast, but doctors could examine women’s breasts in the office, and women could examine them at home. Between 1950 and 1955, more than 5 million American women viewed an ACS film called “Breast Self-Examination.” Searching for cancers when they were small, the argument went, made much more sense than waiting until they were larger and more likely to have spread.\nBy the mid-1950s, radiologists were experimenting with mammograms, X-rays that could potentially identify even smaller breast cancers. Again, there was enormous enthusiasm. Women who declined screening, one physician wrote, were “playing Russian roulette with their lives.”\nHoping to achieve statistical proof, some doctors who were optimistic about mammography decided to study it using randomized controlled trials, in which some women were screened and a control group was not. There are now eight long-term trials of mammography based in the United States, Canada, Sweden and Scotland. And while there is debate about what these studies show, it’s clear that", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/0195161068", "http://www.amazon.com/exec/obidos/ASIN/0807035041"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T23:59:33.431+03:00", "highlightTitle": ""}