{"organizations": [], "uuid": "8a72692ded639eab452be9ad3c150a25dcb936bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/4c/44fe5564f7d8e856652790502f95a7/media:0a59abd12ace436a803f57b5ed38e1feCanadaElection.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/16/conservative-canadian-leader-fighting-to-stay-in-power", "country": "US", "title": "Conservative Canadian leader fighting to stay in power", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Conservative Canadian leader fighting to stay in power - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "8a72692ded639eab452be9ad3c150a25dcb936bc"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/16/conservative-canadian-leader-fighting-to-stay-in-power", "ord_in_thread": 0, "title": "Conservative Canadian leader fighting to stay in power", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ROB GILLIES, Associated Press\nTORONTO (AP) — Conservative Prime Minister Stephen Harper's nearly 10 years in power could end next week, along with his dream of shattering Canada's image as a liberal bastion.\nHarper, one of the longest-serving Western leaders, is seeking a rare fourth term in Monday's election but polls show him narrowly trailing Liberal leader Justin Trudeau, the son of late Prime Minister Pierre Trudeau, one of Canada's most charismatic politicians.\nA Trudeau victory could ease Canada's tensions with the administration of President Barack Obama, whose reluctance to approve the Keystone XL pipeline has damaged ties between the two major trading partners. While Trudeau supports the Alberta-to-Texas pipeline, it's not a do-or-die issue like it is for Harper, who represents a district in oil-rich Alberta.\nThe pipeline is important to Canada, which needs infrastructure to export its growing oil sands production. But Harper's unease with Obama goes deeper, said Robert Bothwell, a Canadian history professor at the University of Toronto.\n\"It's ideological,\" he said. \"Obama sees the world entirely different and Harper sees Obama and sees a liberal.\"\nHarper has done what many thought impossible since coming to power in 2006: He won three consecutive elections and nudged a traditionally center-left country to the right. He gradually lowered sales and corporate taxes, avoided climate change legislation, supported the oil industry against environmentalists and backed Israel's right-wing government. He has put a more conservative face on the nation of 35 million, deemphasizing health care and multiculturalism as the things that make Canadians proud.\nFor Harper, a loss to the Liberals would be personally devastating. Former colleagues say his long-term goal is nothing short of redefining what it means to be Canadian, killing the long-held notion that the Liberals — the party of long-time leaders Pierre Trudeau and Jean Chretien — are Canada's natural party.\n\"His whole being is about destroying the Liberals,\" Bothwell said. \"If Justin beats Harper, Harper will just go through the roof or maybe he'll melt like the Wicked Witch of the West.\"\nThe Liberals have increased their lead over the Conservatives by more than 7 percentage points. According to the CTV/Globe and Mail/Nanos Nightly Tracking Poll, the Liberals are at 37.1 percent, followed by the Conservatives at 29.4 percent. The New Democrats, a leftist party that moved to the center in a bid to get elected for the first time, are at 23.7 percent. The margin of error for the survey of 1,200 respondents is 2.8 percentage points.\nA minority government in the 338-seat Parliament appears likely no matter which party wins the most seats. That would mean the winning party would have a shaky hold on power and need to rely on another party to pass legislation. Harper has said he'll step down as Conservative leader if his party loses.\nBut Antonia Maioni, a political science professor at Montreal's McGill University, is not counting Harper out, noting the Conservatives have a strong and growing base and \"after 10 years of power, perhaps against all odds, is at least competitive to form a government.\"\nHarper, 56, a sharp strategic thinker and trained economist, campaigned on the economy but was hurt when Canada entered a mild recession in the first half of the year after oil prices tumbled. Canada suffered less from the 2008 financial crisis than its southern neighbor, but Canada's economy has been outpaced by the U.S. in recent years.\nHarper then made the Islamic face veil a focus of the campaign after his government lost an attempt in court to ban the practice of wearing the niqab while swearing the oath of citizenship. Opposition leaders accused Harper of playing racial politics with an issue of little relevance to most Canadians.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T14:43:22.775+03:00", "highlightTitle": ""}