{"organizations": [], "uuid": "4e917a0c71147436b37354f3dbb3c15012d89321", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/16/385735-zaheer2.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/sport/column-it-is-a-new-beginning-for-me-zaheer-khan-2135387", "country": "SG", "title": "It is a new beginning for me: Zaheer Khan", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "It is a new beginning for me: Zaheer Khan | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:00:00.000+03:00", "replies_count": 0, "uuid": "4e917a0c71147436b37354f3dbb3c15012d89321"}, "author": "dna     | From the print edition", "url": "http://www.dnaindia.com/sport/column-it-is-a-new-beginning-for-me-zaheer-khan-2135387", "ord_in_thread": 0, "title": "It is a new beginning for me: Zaheer Khan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The toughest call in a cricketing career is when one has to walk away from the game itself. You almost 'will' yourself and want to push that few, extra miles but then the body, after nearly two decades, decides not to respond.\nAs I was training for the upcoming season, it dawned on me that my shoulder may not last the rigours of bowling nearly eighteen overs a day, and that's when I knew it was time…\nWith immediate effect, I bid adieu to my career in international cricket. I look forward to signing off my last season in domestic cricket at the conclusion of Indian Premier League season 9.\nAs a kid from a small town Shrirampur, I gave up a career in engineering to pursue bowling. My parents backed that decision and every decision since! My dad, I distinctly remember said, \"Engineers toh bahut saare hein tu bowler hi ban na!\"\nI fondly remember my initial days, way back in 1996 at National Cricket Club at Cross Maidan to the call up for the Mumbai Under-19 team. My crucial months of training at the MRF Pace Foundation, my debut with Baroda in the Ranji trophy to going on to leading Mumbai, I have cherished every game. Each game was an opportunity that allowed me to express myself freely in the best way I could – on the cricket field, always trying to improve as a player.\nLeading up to my debut for India in 2000 and beyond, I got crucial opportunities, with people backing me at different and difficult stages and I was able to contribute to Indian cricket and learn many things along the way. I was able to try out different ideas while playing because of the unconditional support I received from my captains and coaches, who trusted and supported me in setting fields or trying a different approach or tactic that was loaded with risk.\nMy greatest cricketing moment was lifting the World Cup as part of Team India and creating history. We played as a top team and being part of the journey of India as a top ODI side was very fulfilling. As a young fast bowler who grew up watching the legends of the game, I remember the satisfaction and joy to win a Test match for India. Winning ways are addictive and I thoroughly enjoyed sporting the whites for India as we emerged as the No. 1 Test playing nation in the world.\nFor those who supported me, especially in the BCCI, Baroda Cricket Association and Mumbai Cricket Association, I am grateful for the encouragement. It has been a privilege to be part of various teams during my career including the Indian cricket team, Baroda, Mumbai, Worcestershire (critical to my come back in the national team in 2007), Mumbai Indians, Royal Challengers Bangalore and Delhi Daredevils. Today, I have many, many individuals to thank -- from physios, trainers, support staff, colleagues, captains, coaches, selectors, senior officials, administrators in various associations, groundsmen, team management as also team owners. Kindly pardon me for my inability to name each one of you but that does not take away from the deep sense of gratitude I have for your support in allowing me to live my dream.\nMy colleagues, who I shared dressing room pranks have, over the years, become some of my closest friends. It has been a pleasure to play alongside them as each added a different perspective. I've enjoyed listening to them as also contributing in a small way to their growth.\nMy family has been patiently watching from the sidelines but they have always been central to my life. I can't thank my parents enough for understanding me and allowing me to chase my dream. My elder brother, Zeeshan, who dutifully reminded me that, 'my job wasn't finished with my India debut, but I needed to make every game count'. My younger brother, Anees, has shouldered a lot of pressure which allowed me the freedom to enjoy on the cricket field. He's never watched me play live, but his encouragement has been a significant part of my life.\nTo those millions of fans and well wishers of Indian cricket who've watched and encouraged me over the years, I trust you know that I was always trying and never gave up.\nI thank the members of the media for the many words of appreciation and constructive criticism during the course of my career.\nCricket has been my only life over the past two decades and is in fact the only thing I know well. Cricket has made me the individual I am, giving me everything in life and much more. I walk away with fantastic memories, life defining experiences and great friendships. My mother summarised it well in reaction to my decision to retire,\n\"Theek hein, bahut accha safar tha hamara...\" (It's OK, I has been a very good journey for us).\n'Zak is Back' is perhaps a headline that may come my way again, as I have every intention of giving back to this game and our wonderful country which gave this kid from Shrirampur the opportunity to chase and live his dream!\n—Zaheer Khan", "external_links": [], "published": "2015-10-16T16:00:00.000+03:00", "crawled": "2015-10-16T05:57:28.240+03:00", "highlightTitle": ""}