{"organizations": [], "uuid": "e6073c309c94508db855dacf90c720aa8fab8fce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tehelka.com", "main_image": "http://www.tehelka.com/wp-content/plugins/all-in-one-seo-pack/images/default-user-image.png", "site_section": "http://www.tehelka.com/category/current-affairs/?feed=custom_feed", "section_title": "Tehelka - Investigations, Latest News, Politics, Analysis, Blogs, Culture, Photos, Videos, Podcasts » Current Affairs", "url": "http://www.tehelka.com/2015/10/doctor-engineer-or-death/", "country": "IN", "title": "Doctor, Engineer – or Death", "performance_score": 0, "site": "tehelka.com", "participants_count": 1, "title_full": "Doctor, Engineer – or Death", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T08:42:00.000+02:00", "replies_count": 0, "uuid": "e6073c309c94508db855dacf90c720aa8fab8fce"}, "author": "Ankush Vats", "url": "http://www.tehelka.com/2015/10/doctor-engineer-or-death/", "ord_in_thread": 0, "title": "Doctor, Engineer – or Death", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comment Rat race Undue pressure from parents is resulting in increased suicide rates among students. Photo: Tribhuvan Tiwari/outlook \nA guitar gathers dust in the corner of a room in Indra Vihar in Kota, Rajasthan . The instrument belonged to 17-year-old Sandeep Kumar from Ghaziabad, Uttar Pradesh, who will now never strum its strings. Kumar committed suicide in June this year, in despair that he would never meet the aspirations of his parents, who wanted him to become a doctor. \nIn December last year, he had come to Kota, known as the ‘coaching factory’ of India, to prepare for the medical entrance examination. However, his real vocation was different. “He used to play really well. He wanted to become a musician. But he wanted to fulfill his parents’ dream first, that of becoming a doctor,” says his classmate Abhishek Faujdar. \nKumar was not the only one facing this kind of predicament. \nSeventeen-year-old Sidharth Ranjan from Muzaffarpur, Bihar, recently committed suicide, homesick to the point of despair. Ranjan, who was also preparing for the medical entrance exam, had just returned to Kota after spending a month at home recovering from dengue fever. \nTwo days before his body was found in his rented room by the landlord, he had asked his parents to move to Kota with him. “I told him it was not possible because we had permanent jobs here,” regrets his father Ashish Ranjan. “But he was insistent. If I had known he was so tense, I would have brought him back. He was my only child.” \nIn the last two decades, Kota has emerged as the coaching hub of India. Lakhs of students come to this once sleepy district of Rajasthan every year to prepare for medical and engineering entrance exams. However, only a few make the cut. Those who find it difficult to cope up with the competitive environment suffer severe stress — sometimes taking the drastic step of ending their lives. \nAccording to the National Crime Records Bureau , 45 students committed suicide in Kota in 2014, a rise of around 61.3 percent from the previous year. The toll had reached 24 by September this year. However, not all the student suicide cases in Kota are due to academic pressure. \nRough estimates suggest that there are as many as 1.5 lakh students in Kota taking coaching for engineering and medical entrance exams at any given point of time. The classes take place in separate batches, starting from as early as 7 am and continuing till 8 pm. \nDr Akhil Aggarwal, a Kota-based psychiatrist who treats students suffering from clinical depression on a daily basis, says that parents need to be supportive of their child’s performance. “I have come across several cases where the parents pressurise or threaten their children to make them perform better. This puts the child, who is already living in a hostile and competitive environment, under added stress. In one case, a girl took an overdose of sleeping pills — fortunately, she survived. When I asked her why she took such a step, she revealed that her parents had threatened that if she didn’t qualify for the exam, they would get her married,” Aggarwal tell Tehelka. \nIn a similar case, a student had to be hospitalised after he tried to take his own life. During counseling, it turned out that his death wish was triggered by his father’s suicide a few years ago. “He told me he wanted to go home. When I asked his mother to take him back, she just refused, saying, ‘What would he do at home?’ I was shocked with her response.” \nThe students Tehelka spoke to agreed with the psychiatrist’s opinion that more than the coaching benchmarks, it’s parental expectations that they fail to meet. In one particular case, a student had qualified for chemical engineering in iit but his parents wanted him to drop another year and go for computer science. “He finally committed suicide, leaving behind an apology note for his parents that he couldn’t fulfill their expectation,” recalls 23-year-old Ashish Mishra, his classmate. */", "external_links": [], "published": "2015-10-26T08:42:00.000+02:00", "crawled": "2015-10-26T10:46:30.575+02:00", "highlightTitle": ""}