{"organizations": [], "uuid": "ec420cc13a45d0201dad80ba067a4983314212ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4364786/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13894473.Stuff_convention__we_ll_block_cruel_Tory_welfare_cuts_in_the_Lords__Farron_tells_LibDems/", "country": "GB", "title": "Stuff convention, we'll block cruel Tory welfare cuts in the Lords, Farron tells LibDems", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 2, "title_full": "Stuff convention, we'll block cruel Tory welfare cuts in the Lords, Farron tells LibDems (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T06:13:00.000+02:00", "replies_count": 1, "uuid": "ec420cc13a45d0201dad80ba067a4983314212ee"}, "author": "Tom Gordon", "url": "http://www.heraldscotland.com/politics/13894473.Stuff_convention__we_ll_block_cruel_Tory_welfare_cuts_in_the_Lords__Farron_tells_LibDems/", "ord_in_thread": 0, "title": "Stuff convention, we'll block cruel Tory welfare cuts in the Lords, Farron tells LibDems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE leader of the LibDems yesterday vowed to block Tory welfare cuts in the Lords this week, accusing David Cameron of lying on the issue in the general election.\nTim Farron told the Scottish LibDem conference his party would not allow the government to impoverish millions of families by cutting £4.5bn off tax credits from next April.\nHe confirmed LibDem peers in the Lords - where the Tories are outnumbered - would force a vote on a rare “fatal motion” in a bid to wreck the legislation needed to enact the cuts.\nHe said the 70-year-old Salisbury convention that the Lords did not block the Commons did not apply, as the cuts were not detailed in the Tories’ manifesto.\n“Stuff the convention,” he told delegates in Dunfermline.\nThe tax credit cuts, announced by Chancellor George Osborne in July, are part of a Tory plan to cut £13bn a year from the welfare bill by 2020-21.\nDespite the Tories claiming to be 'for workers', the cuts will affect almost all of the UK’s 3.3m in-work families whose wages are topped up by tax credits, 2.7m of them with children.\nThe House of Commons Library says the average loss per family will be £1300 next year.\nFacing growing demands from Tory MPs for a rethink, Osborne this week said he remained “comfortable” with the policy.\nFarron, who took over from Nick Clegg in July, said: “In Scotland almost 250,000 hard working families will lose an average of £1000 a year. That’s more than 300,000 children who are being made to bear the brunt of the Chancellor’s blind ideological obsession.\n“So be in doubt: this cruel, heartless, mean-spirited and misjudged policy is George Osborne’s poll tax and we will fight it as we fought the poll tax - it will not stand - not on our watch.”\nPromoted stories He mocked Cameron for not taking up the LibDem offer of Lords reform during the Coalition.\n“David Cameron has reacted with fury. How dare we use the unelected Lords to defeat the government’s will. If only he’d had the chance to reform the House of Lords in the last parliament. So, Dave, I will take great pleasure in hoisting you with your own petard.”\nGoing off script, he added: “'What about the convention?' he protests. Stuff the convention. Less than a fortnight before the election, Dave, you were assuring voters you would not cut tax credits. No mincing words. You lied. So don't complain when we call you out on it.\n“You give me the choice of abiding by a 70-year-old establishment deal or standing up for 3m low-income families, I know whose side we are on. We will block the tax credit cuts.\"\nBriefing the media afterwards, Farron said LibDems would also ignore the convention that the Lords does not block government finance business, saying of such conventions: “They're more guidelines rather than exact rules.\n“A week before polling day, David Cameron explicitly ruled out tax credit cuts. Now he proposes to do them, but it was not in the manifesto, which is the essential underpinning of the Salisbury convention. If Osborne is not going to back down in any other way, we need to lay a fatal motion which forces him to rethink. And if it forces Lords reform, then hurrah.\"\nIn his speech, Farron also accused the SNP of being “terrifyingly authoritarian” and of having a poor record in office, then urged them to join LibDem efforts to keep the UK in the EU.\nCrossbencher Baroness Meacher, who is also fighting the tax credit cuts, yesterday accused the Treasury of “bullying tactics” and applying “enormous pressure” to peers on the issue.\nShe said the threats included closing the House of Lords and the creation of 100 new Conservative peers.\nSNP Social Justice Secretary Alex Neil last night wrote to Work and Pensions Secretary Iain Duncan Smith calling for the “thoughtless” tax credit changes to be ditched.\nShare article Neil said: “Removing this vital support from thousands of families will widen the gap in inequalities and push even more people into poverty.”\nTax credits gave around £2bn to Scottish households in 2013-14, with two-thirds of support going to low-income working families.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-25T06:13:00.000+02:00", "crawled": "2015-10-25T10:05:44.713+02:00", "highlightTitle": ""}