{"organizations": [], "uuid": "8e79307dcea12791b68ce4cd4b85d2a97ae235a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jpupdates.com", "main_image": "", "site_section": "http://jpupdates.com/feed/", "section_title": "JP Updates | Breaking News NYC, Jewish Political News & Updates", "url": "http://jpupdates.com/2015/10/21/netanyahu-under-fire-over-claim-palestinian-inspired-holocaust/", "country": "US", "title": "Netanyahu Under Fire over Claim Palestinian Inspired Holocaust", "performance_score": 0, "site": "jpupdates.com", "participants_count": 1, "title_full": "Netanyahu Under Fire over Claim Palestinian Inspired Holocaust", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:52:00.000+03:00", "replies_count": 0, "uuid": "8e79307dcea12791b68ce4cd4b85d2a97ae235a3"}, "author": "JP Newsroom", "url": "http://jpupdates.com/2015/10/21/netanyahu-under-fire-over-claim-palestinian-inspired-holocaust/", "ord_in_thread": 0, "title": "Netanyahu Under Fire over Claim Palestinian Inspired Holocaust", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share \n( AFP ). Israeli Prime Minister Benjamin Netanyahu has stirred controversy by suggesting the then head of the Muslim community in Jerusalem gave Hitler the idea to exterminate Jews — a claim historians say is inaccurate. \nIn a speech on Tuesday, Netanyahu said the then grand mufti of Jerusalem, Haj Amin al-Husseini, a Palestinian nationalist, convinced Hitler to carry out the Holocaust. \n“Hitler didn’t want to exterminate the Jews at the time. He wanted to expel the Jews,” Netanyahu told the World Zionist Congress. \n“And Haj Amin al-Husseini went to Hitler and said: ‘If you expel them, they’ll all come here.’‘So what should I do with them?’ he asked. He said: ‘Burn them.'” \nIsraeli opposition politicians as well as Palestinian leaders have sharply criticised Netanyahu’s comments, while historians say they are inaccurate. \nThey came amid three weeks of Palestinian unrest and attacks threatening a full-scale uprising. \nThe Israeli premier sought to tie his historical reference to current debates over the Al-Aqsa mosque compound in Jerusalem, arguing that the mufti had also falsely claimed at the time that Jews were seeking to destroy it. \nNetanyahu has said in recent in weeks that such Palestinian incitement over the Al-Aqsa compound, which Jews call the Temple Mount, was helping feed the current unrest. \n“It is a sad day in history when the leader of the Israeli government hates his neighbour so much so that he is willing to absolve the most notorious war criminal in history, Adolf Hitler, of the murder of six million Jews during the Holocaust,” Palestine Liberation Organisation secretary general Saeb Erekat said in a statement. \nThe leader of the Israeli opposition, Isaac Herzog, said on his Facebook page that “even the son of a historian must be precise when it comes to history,” referring to the prime minister’s late father, Benzion, who specialised in Jewish history. \nThe chief historian at Israel’s Yad Vashem Holocaust memorial and research centre said Netanyahu’s comments were inaccurate. \n“Though he had very extreme anti-Jewish positions, it wasn’t the mufti who gave Hitler the idea to exterminate the Jews,” Dina Porat told AFP. \n“The idea far predates their meeting in November 1941. In a speech to the Reichstag on January 30, 1939, Hitler evoked ‘an extermination of the Jewish race’,” she said.", "external_links": [], "published": "2015-10-21T15:52:00.000+03:00", "crawled": "2015-10-21T16:02:14.974+03:00", "highlightTitle": ""}