{"organizations": [], "uuid": "d95ceffaaac6b96fb8a646a7518a3e21ff445b8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30247827/blue-kc-implements-rx-savings-solutions-innovative-platform-to-optimize-prescription-drug-spend", "country": "US", "title": "Blue KC Implements Rx Savings Solutions' Innovative Platform To Optimize Prescription Drug Spend", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Blue KC Implements Rx Savings Solutions' Innovative Platform To Optimize Prescription Drug Spend - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "d95ceffaaac6b96fb8a646a7518a3e21ff445b8e"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30247827/blue-kc-implements-rx-savings-solutions-innovative-platform-to-optimize-prescription-drug-spend", "ord_in_thread": 0, "title": "Blue KC Implements Rx Savings Solutions' Innovative Platform To Optimize Prescription Drug Spend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Rx Savings Solutions\nAdvanced healthcare solution will provide immediate and measurable savings on medications\nOVERLAND PARK, Kan. , Oct. 13, 2015 /PRNewswire/ -- Blue Cross and Blue Shield of Kansas City (Blue KC) has selected Rx Savings Solutions to provide Blue KC members with state-of-the art healthcare software to help them save money on prescription drugs. Rx Savings Solutions provides an online tool that alerts members via text message or email when a savings opportunity exists for prescriptions accessible in their pharmacy network. This can be a combination of optimizing clinical therapies or finding lower pricing at local pharmacies.\n\"We chose Rx Savings Solutions for their leading-edge innovative solution. The software will help lower costs for everyone involved,\" said Danette Wilson , President and CEO of Blue KC. \"With the help of this cutting-edge platform, we are providing new value for our members.\"\nCustomers who implement Rx Savings Solutions' software experience proven cost-savings and a measurable ROI within the first two months of use. For instance, in just ten months, Rx Savings Solutions was able to deliver more than $100,000 in immediate savings to a mid-size employer and its 5,200 health plan members.\n\"Our software solution is proactive, patented and proven,\" said Michael Rea , founder and CEO of Rx Savings Solutions. \"Blue KC understands the need for a tool to help their members reduce their prescription drug costs. When we eliminate complexity for our members, we see behavior changes that save money and can improve their health and wellness.\"\nRx Savings Solutions' system is HIPAA security compliant. All interaction between the software platform and the employee is confidential. Rx Savings Solutions delivers unbiased, accurate, and cost-effective data to subscribers based solely on the location and medication needs of each user.\nThe new tool will be rolled out to all Blue KC membership in the first half of 2016.\nFor more information about Rx Savings Solutions, visit rxsavingssolutions.com , or follow them on LinkedIn .\nAbout Rx Savings Solutions\nRx Savings Solutions offers an innovative, patented engagement software system empowering employers and employees to be educated consumers of healthcare. Founded and operated by a team of pharmacists and software engineers, Rx Savings Solutions supports a collaborative, cost-saving solution for purchasing prescription drugs. Using their clinical backgrounds, Rx Savings Solutions delivers personalized recommendations on ways to optimize therapies to members, while achieving savings results for both employers and employees. Located in Kansas City , Rx Savings Solutions serves self-insured businesses, employer groups, health plans and their members nationwide. For more information, visit rxsavingssolutions.com.\nAbout Blue Cross and Blue Shield of Kansas City\nBlue Cross and Blue Shield of Kansas City , the largest not-for-profit health insurer in Missouri and the only not-for-profit commercial health insurer in Kansas City , has been part of the Kansas City community since 1938. Blue Cross and Blue Shield of Kansas City provides health coverage services to more than one million residents in the greater Kansas City area, including Johnson and Wyandotte counties in Kansas and 30 counties in Northwest Missouri . Our mission: to use our role as the area's leading health insurer to provide affordable access to health care and to improve the health and wellness of our members. Blue Cross and Blue Shield of Kansas City is an independent licensee of the Blue Cross and Blue Shield Association. For more information on the company, visit its website at BlueKC.com .\n releases/blue-kc-implements-rx-savings-solutions-innovative-platform-to-optimize-prescription-drug-spend-300158480.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "https://www.rxsavingssolutions.com/", "http://www.rxsavingssolutions.com/", "http://www.prnewswire.com/news-releases/blue-kc-implements-rx-savings-solutions-innovative-platform-to-optimize-prescription-drug-spend-300158480.html", "http://www.bluekc.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY26014&Transmission_Id=201510130900PR_NEWS_USPR_____NY26014&DateId=20151013", "https://www.linkedin.com/company/3597039?trk=tyah&trkInfo=clickedVertical%3Acompany%2CclickedEntityId%3A3597039%2Cidx%3A1-1-1%2CtarId%3A1440103246191%2Ctas%3ARx%20Savings"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T17:32:50.929+03:00", "highlightTitle": ""}