{"organizations": [], "uuid": "111624e9aaa2c92872dff987a22776ccc690672c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-ebb2dff905ca3d07992d362686fcc291.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/falling-energy-prices-push-inflation-to-zero-in-september-but-core-heats-up/article/2574167?custom_click=rss", "country": "US", "title": "Falling energy prices push inflation to zero in September, but core heats up", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Falling energy prices push inflation to zero in September, but core heats up | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T11:38:00.000+03:00", "replies_count": 0, "uuid": "111624e9aaa2c92872dff987a22776ccc690672c"}, "author": "Joseph Lawler", "url": "http://www.washingtonexaminer.com/falling-energy-prices-push-inflation-to-zero-in-september-but-core-heats-up/article/2574167?custom_click=rss", "ord_in_thread": 0, "title": "Falling energy prices push inflation to zero in September, but core heats up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Falling energy prices held inflation to a standstill in September, the Bureau of Labor Statistics reported Thursday morning.\nCore inflation, however, is on the rise, in a development that will be viewed by the Federal Reserve as a sign that the economy is still heating up.\nConsumer prices were unchanged from a year ago in September, after rising slightly above zero on an annual basis in recent months.\nMonth-to-month, prices were down 0.2 percent between August and September, right in line with private sector economists' expectations.\n  Poor enrollment expected for Obamacare Administration expects 14 million people to sign up for coverage next year\nBy Robert King • 10/15/15 11:33 AM Related Story: http://www.washingtonexaminer.com/article/2574118/ The decline in prices in September was driven by a nearly 5 percent drop in energy prices, led by a 9 percent decline in gasoline prices.\nFood and shelter costs, meanwhile, accelerated. Over the past year, declines in energy prices of a quarter or a third have been offset by the cost of rent and shelter growing at a rate above 3 percent.\nMeanwhile, core inflation, a less-volatile gauge of price changes that strips out food and energy costs, accelerated to 1.9 percent on an annual basis in September.\nCore inflation, which is thought to be more predictive of future months' price changes than headline inflation, is now just shy of the Federal Reserve's target. That target is 2 percent, although it is benchmarked to an inflation index that is usually slightly lower than the CPI.\nThursday's inflation numbers will likely serve to reassure the Fed that it is correct to expect inflation to rise slowly toward its target.\nAlso from the Washington Examiner Sanders raises $2.5 million in 24 hours after debate During the last fundraising quarter, the Sanders campaign raised $26 million to Clinton's $28 million.\nBy Ariel Cohen • 10/15/15 11:31 AM The biggest price declines in the month were attributable to factors the Fed sees as \"transitory,\" and likely to abate even as the U.S. domestic economy and jobs market strengthen. Energy price declines, for example, can be traced to falling demand in China and other emerging market economies. While the drop in oil has decimated U.S. drillers and the associated rise in the dollar has squeezed domestic manufacturing, such factors will not pitch the country into recession, Fed chairwoman Janet Yellen reckons.\nInstead, Fed members meeting in Washington at the end of the month will see rising core inflation as a sign that the domestic economy is still gaining momentum and drawing unemployed or underemployed workers into jobs.\nIn the months ahead, the Fed willl have to decide whether to raise interest rates from zero to keep inflation on target over the next few years.\n ", "external_links": [], "published": "2015-10-15T11:38:00.000+03:00", "crawled": "2015-10-15T20:11:46.510+03:00", "highlightTitle": ""}