{"organizations": ["CET Delhi Public School", "Spelling Bee Competition Politics", "Delhi Public School"], "uuid": "859bb826bc112aaee85866de7588f0decff2f702", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/d28jb44aau_9723262810096_773531313726.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/648321/1/delhi-public-school-shines-at-spelling-bee-competi.html", "country": "US", "title": "Delhi Public School shines at Spelling Bee Competition", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Delhi Public School shines at Spelling Bee Competition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:06:00.000+03:00", "replies_count": 0, "uuid": "859bb826bc112aaee85866de7588f0decff2f702"}, "author": "", "url": "http://www.modernghana.com/news/648321/1/delhi-public-school-shines-at-spelling-bee-competi.html", "ord_in_thread": 0, "title": "Delhi Public School shines at Spelling Bee Competition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Politics | 9 October 2015 20:06 CET Delhi Public School shines at Spelling Bee Competition By Myjoyonline.com \nSeven students from DPSI on Tuesday put up an impressive performance at the Tema Regional Spelling Bee Competition which saw 23 spellers qualifying to the national level of the event. \nThe 23 spellers were also made up of students from four other schools within Tema. \nSpeaking to journalists after the event, David Raj, Principal of the School, said if his students are unable to make it to the international level of the event in 2016, they would have learnt a lot of life-changing things. \n“We took the initiative because we saw that in this particular competition, the children have to actually remember a lot of spellings of different words and their meanings. \nI know that if they are actually putting all their heart and soul into the preparation for this competition, they will be national champions and also the ‘Scripps Spelling Bee’ [champions] in the United States,” Mr Raj stated. \nHe added that students who put a lot of efforts into the preparation for the event would also gain the skills of becoming good orators and build a strong vocabulary base for their writing skills as well. \n“If not champions in the spelling bee, they will be good orators. They will have lots of concentration, their vocabulary would be strong and when they address a gathering, their usage of words would be surely of a greatest angle compared to the other children. I think this competition changes the personality of a child,” he noted. \nHe urged all schools to register their pupils for the competition, adding that it is “a great initiative”. He commended the Young Educators Foundation (YEF), organisers of the spelling bee contest, for encouraging the event in Ghana. \nMimi Ellis, a parent of one of the contestants, disclosed that the contest gives a whole meaning to words while having fun at the same time. \nShe urged parents to encourage their wards to take part in the event because it has a lot of benefits for the children. \nAwurabena Berko, one of the finalists, disclosed that her preparation towards the spelling bee contest had given her a boost in her academics, especially in English Language. \n“It makes it easier for [us] to spell and know the meanings of certain words we use in our writing,” Ms Berko said.", "external_links": [], "published": "2015-10-09T22:06:00.000+03:00", "crawled": "2015-10-10T11:21:19.345+03:00", "highlightTitle": ""}