{"organizations": [], "uuid": "9c2406745d0975387c7f46a826219f5a468eda58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30262110/connected-kids-meet-the-minions-and-get-cyberaware-as-national-cyber-security-awareness-month-comes-to-los-angeles", "country": "US", "title": "Connected Kids Meet The Minions And Get #CyberAware As National Cyber Security Awareness Month Comes To Los Angeles", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Connected Kids Meet The Minions And Get #CyberAware As National Cyber Security Awareness Month Comes To Los Angeles - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "9c2406745d0975387c7f46a826219f5a468eda58"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30262110/connected-kids-meet-the-minions-and-get-cyberaware-as-national-cyber-security-awareness-month-comes-to-los-angeles", "ord_in_thread": 0, "title": "Connected Kids Meet The Minions And Get #CyberAware As National Cyber Security Awareness Month Comes To Los Angeles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " National Cyber Security Alliance\nDepartment of Homeland Security Headlines Event Teaching 300 Public School Students, Parents and Teachers to Stay Safe Online\nLOS ANGELES , Oct. 14, 2015 /PRNewswire-USNewswire/ -- In recognition of October as National Cyber Security Awareness Month (NCSAM), the National Cyber Security Alliance (NCSA), along with its partners, Comcast NBCUniversal and CreativeFuture, today co-hosted an educational and entertaining event to promote cyber safety best practices for the next generation of Internet users. Linking cybersecurity to connected kids against the backdrop NCSAM's theme of the week, \"Connected Communities and Families: Staying Protected While We Are Always Connected,\" the event was organized to empower young students to become more responsible digital citizens. See President Obama's NCSAM 2015 proclamation here: http://ncsam.info/1Mic1WH\nThe event, \"Connected Kids: Lessons in Cybersecurity for Students, Parents and Teachers,\" was held at The Globe Theatre at Universal Studios Hollywood, setting the stage for 300 fourth and fifth graders from Los Angeles -area public schools – McKinna, Toluca Lake and Superior Elementary – to gain first-hand online safety advice from leading local and national experts. Headlined by Dr. Andy Ozment , Assistant Secretary of Cybersecurity and Communications at the Department of Homeland Security (DHS), experts led a series of interactive activities touching on a range of topics and common challenges, including maintaining a healthy real and digital life balance, respecting creative work, protecting reputations and privacy, and using the Internet as an educational resource.\nCybersecurity at Home and at School – Behind Digital Doors Survey Insights\nKicking off the event, NCSA also revealed the findings from its co-commissioned survey with ESET® , \"Behind Our Digital Doors: Cybersecurity and the Connected Home,\" which highlighted the need for more cybersecurity education at home and at school. The study revealed that although one in five American homes received a data breach notification last year, there is a prevailing false sense of online security across the nation, with 79 percent of respondents stating that they feel safe in their connected homes. The study also discovered that 83 percent of parents strongly believe that it is important for their child to graduate from high school with the right skills to use technology safely, securely, ethically and productively while just 54 percent have ever received any cyber safety-related instruction at school.\n\"With so much of our children's lives and activities connected to the Internet, moms and dads across the country are realizing that safer and more secure use of technology is an essential piece of the parenting puzzle,\" said Michael Kaiser , Executive Director, NCSA. \"The good news is that four out of five (79 percent) of parents have had a talk about online safety with their kids. More troubling is that 60 percent allow password sharing with friends and only 34 percent require that children provide all passwords to online accounts. We have some distance to go in helping families successfully navigate the digital world.\"\nTools and Tips to Keep Connected Kids Safer Online\nThrough out the day, students, parents and teachers participated in a range of educational and entertaining sessions designed to equip everyone with actionable tools and resources to use the Internet safely, more securely and responsibly. Part of the fun included a Minions experience, engaging in an interactive \"digital citizenship toolkit\" presentation, a quiz show and a Q&A with experts providing insightful advice on how to stay cyber aware.\n\"Learning about cybersecurity and responsible digital citizenship is essential for children, parents, and teachers, but it also benefits the entire Internet ecosystem - from creatives to audiences and everyone in between,\" said Ruth Vitale , Chief Executive Officer, CreativeFuture. \"Today's youth have the opportunity to shape the way we connect with the digital world - and learning the skills to interact with technology responsibly will spell a better digital future for us all.\"\nPlease see http://creativefuture.org/blog/ for more details on the event, collateral, pictures and more.\nFor more detail and analysis of the \"Behind Our Digital Doors: Cybersecurity & The Connected Home\" survey, please visit: http://ncsam.info/1NGGGD2\nAbout National Cyber Security Awareness Month\nNational Cyber Security Awareness Month (NCSAM) was created as a collaborative effort between government and industry to ensure every American has the resources they need to stay safer and more secure online. Now in its 12 th year, NCSAM is co-led by the Department of Homeland Security and the National Cyber Security Alliance, the nation's leading nonprofit public-private partnership promoting the safe and secure use of the Internet and digital privacy. Recognized annually in October, NCSAM involves the participation of a multitude of industry leaders ? mobilizing individuals, small- and medium-sized businesses, non-profits, academia, multinational corporations and governments. Encouraging digital citizen around the globe to STOP. THINK. CONNECT ., NCSAM is harnessing the collective impact of its programs and resources to increase awareness about today's ever-evolving cybersecurity landscape. Visit the NCSAM media room: https://www.staysafeonline.org/about-us/news/media-room/\nAbout the National Cyber Security Alliance\nThe National Cyber Security Alliance (NCSA) is the nation's leading nonprofit public-private partnership promoting the safe and secure use of the Internet and digital privacy. Working with the Department of Homeland Security (DHS), private sector sponsors and nonprofit collaborators to promote cybersecurity awareness, NCSA board members include representatives from ADP, AT&T, Bank of America, BlackBerry, Comcast Corporation, ESET, Facebook, Google, Intel, Logical Operations, Microsoft, PayPal, PKWARE, RSA - the Security Division of EMC, Raytheon, Symantec, Verizon and Visa. Through collaboration with the government, corporate, nonprofit and academic sectors, NCSA's mission is to educate and empower digital citizens to use the Internet securely and safely, protect themselves and the technology they use, and safeguard the digital assets we all share. NCSA leads initiatives for STOP.THINK.CONNECT., a global cybersecurity awareness campaign to help all digital citizens stay safer and more secure online; Data Privacy Day, celebrated annually on January 28 and National Cyber Security Awareness Month, launched every October. For more information on NCSA, please visit staysafeonline.org/about-us/overview/ .\nAbout Comcast NBCUniversal: http://corporate.comcast.com/\nAbout CreativeFuture : http://creativefuture.org/about/\nAbout iKeepSafe : http://ikeepsafe.org/copyright/\nLogo - http://photos.prnewswire.com/prnh/20131212/DC32528LOGO\nLogo - http://photos.prnewswire.com/prnh/20111007/DC82477LOGO\nLogo - http://photos.prnewswire.com/prnh/20121004/DC87170LOGO-a\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/connected-kids-meet-the-minions-and-get-cyberaware-as-national-cyber-security-awareness-month-comes-to-los-angeles-300159824.html\n ", "external_links": ["http://ncsam.info/1NGGGD2", "http://www.eset.com/int/", "http://corporate.comcast.com/", "http://www.stopthinkconnect.org/", "http://creativefuture.org/blog/", "http://ikeepsafe.org/copyright/", "http://photos.prnewswire.com/prnh/20111007/DC82477LOGO", "http://photos.prnewswire.com/prnvar/20121004/DC87170LOGO-a", "http://photos.prnewswire.com/prnvar/20131212/DC32528LOGO", "http://ncsam.info/1Mic1WH", "http://creativefuture.org/about/", "http://www.prnewswire.com/news-releases/connected-kids-meet-the-minions-and-get-cyberaware-as-national-cyber-security-awareness-month-comes-to-los-angeles-300159824.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC27946&Transmission_Id=201510141600PR_NEWS_USPR_____DC27946&DateId=20151014", "https://www.staysafeonline.org/about-us/news/media-room/", "http://photos.prnewswire.com/prnvar/20111007/DC82477LOGO", "https://staysafeonline.org/about-us/overview/", "http://photos.prnewswire.com/prnh/20121004/DC87170LOGO-a", "http://photos.prnewswire.com/prnh/20131212/DC32528LOGO"], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:53:15.281+03:00", "highlightTitle": ""}