{"organizations": [], "uuid": "f3ea53b292f52b420ef7d8d9b643a615b44d1196", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.statesman.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/07/3a/45/eb86507f07ce407bb39b5549292d80c6-7bcf6e047aca4cc09ca528e22e5e3879-0.jpg", "site_section": "http://www.statesman.com/s/news/texas/", "section_title": "Texas state news and politics from the American-Statesman | www.statesman.com", "url": "http://www.statesman.com/news/news/national/5-things-know-now/nnxsf/", "country": "US", "title": "5 things to know now: Attempted attack on Clinton email server...", "performance_score": 0, "site": "statesman.com", "participants_count": 1, "title_full": "5 things to know now: Attempted attack on Clinton email server... | www.statesman.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:00:00.000+03:00", "replies_count": 0, "uuid": "f3ea53b292f52b420ef7d8d9b643a615b44d1196"}, "author": "Debbie Lord", "url": "http://www.statesman.com/news/news/national/5-things-know-now/nnxsf/", "ord_in_thread": 0, "title": "5 things to know now: Attempted attack on Clinton email server...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here's a roundup of news trending across the nation and world today.\nWhat to know now:\n1. Clinton server target of attack : Hillary Clinton's private email server was the subject of attempted hacks by unidentified parties in China, South Korea and Germany during a period of time when it was left unprotected, an Associated Press story is reporting. The attempted cyberattacks into the server Clinton had installed at her New York home took place while she work at the State Department. A “threat monitoring” system was installed in October 2013 which thwarted otherattempted cyberattacks, the story said.\n2. Big find : Law enforcement authorities found more than a half million dollars in the back yard of a home in Fontana, Calif., Wednesday, apparently money left over from a $1 million bank heist in 2014. The home was once owned by an armored car driver who was convicted robbing a Los Angeles bank, according to the FBI.\n3. Not so real : Rupert Murdoch, founder of Fox News Channel and News Corp, suggested President Barack Obama isn't a \"real black president\" in a tweet he posted Wednesday. His remark came as he praised Republican presidential candidate Ben Carson and his wife on Twitter.\nBen and Candy Carson terrific. What about a real black President who can properly address the racial divide? And much else.\n— Rupert Murdoch (@rupertmurdoch) October 8, 2015 4. Settlements after hypnosis : The families of three Florida high school students who died after their principal hypnotized them have reached a settlement with the school district where the man once worked. School authorities maintain that there was no explicit link between the deaths of the teenagers -- Wesley McKinley, 16, Marcus Freeman, 16, and Brittany Palumbo, 17 -- and the fact they were hypnotized by former principal George Kenney. McKinley and Palumbo committed suicide. Freeman was killed in a car accident.\n5. Keep on rockin’ : The Rock and Roll Hall of Fame released its list of nominations for induction into the hall on Thursday. On the ballot this year are: Janet Jackson, Cheap Trick, The Cars, Los Lobos, Chaka Khan, Steve Miller, Chicago and Nine Inch Nails. The inductees will be announced in December.\nClick here to see Janet Jackson perform \"Rhythm Nation.\"\nSomething extra\nOut of this world -- Check out photos from NASA's collection of images of the Apollo moon project. The collection is compiled in a Flickr account called the Project Apollo Archive. Kipp Teague gathered the images - some 12,000 mostly black and white photos -- that chronicle missions from Apollo 7 through Apollo 17.", "external_links": ["http://www.foxnews.com/us/2015/10/08/fbi-digs-up-more-than-500g-in-backyard-california-man-who-looted-armored-truck/", "http://hosted.ap.org/dynamic/stories/U/US_MURDOCH_OBAMA?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2015-10-07-23-39-41", "http://time.com/4065732/florida-school-settlement-hypnosis-principal/", "https://youtu.be/OAwaNWGLM0c", "http://www.foxnews.com/politics/2015/10/08/clinton-email-server-reportedly-target-cyberattacks-from-china-south-korea/", "http://www.myajc.com/ap/ap/ohio/janet-jackson-chicago-the-cars-nominated-for-rock-/pCrbdh/", "https://twitter.com/rupertmurdoch/status/651924724960874497"], "published": "2015-10-08T13:00:00.000+03:00", "crawled": "2015-10-08T14:56:04.726+03:00", "highlightTitle": ""}