{"organizations": ["House Benghazi"], "uuid": "a0a81a3a8bbb7fc0ffbb810af5ab183d9bfbf4f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abc17news.com", "main_image": "http://www.abc17news.com/image/view/-/35851904/highRes/2/-/maxh/640/maxw/640/-/fpnepg/-/Huma-Abedin-Benghazi-jpg.jpg", "site_section": "http://www.abc17news.com/news/politics/18518124?format=rss_2.0&view=feed", "section_title": "Political Top Stories", "url": "http://www.abc17news.com/news/politics/abedin-to-testify-before-house-benghazi-panel/35873600", "country": "US", "title": "Abedin testifies before House Benghazi panel", "performance_score": 0, "site": "abc17news.com", "participants_count": 0, "title_full": "Abedin testifies before House Benghazi panel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:19:00.000+03:00", "replies_count": 0, "uuid": "a0a81a3a8bbb7fc0ffbb810af5ab183d9bfbf4f5"}, "author": "", "url": "http://www.abc17news.com/news/politics/abedin-to-testify-before-house-benghazi-panel/35873600", "ord_in_thread": 0, "title": "Abedin testifies before House Benghazi panel", "locations": ["Guerrucci"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chris Frates", "Huma Abedin", "Eric Bradner", "Abedin", "Manu Raju CNN"], "text": "Abedin testifies before House Benghazi panel Huma Abedin giving interview behind closed doors By Eric Bradner, Chris Frates and Manu Raju CNN POSTED: 05:02 AM CDT Oct 16, 2015 UPDATED: 12:19 PM CDT Oct 16, 2015 Aude Guerrucci - Pool/Getty Images WASHINGTON (CNN) - \nLong-time Hillary Clinton aide Huma Abedin is testifying Friday in front of the House panel investigating the Benghazi attacks. Related Content Clinton aide Abedin blasts Carson over comment \nAbedin, the vice chairwoman of Clinton's presidential campaign and a former top aide at the State Department, went behind closed doors for a transcribed interview -- a major difference from what Clinton herself is set to face next week in a public hearing scheduled for Thursday. \nBefore the hearing started, a committee aide said Abedin will be questioned about the events leading up to, during and after the September 11, 2012 attacks on U.S. facilities in Libya -- as well as \"executive branch activities and efforts to comply with congressional inquiries into them.\" \nShe won't face questions about her controversial work for Teneo, a strategic consulting firm, or the Clinton Foundation while also serving as a \"special government employee\" for Clinton at the State Department. \nIn a written statement, Clinton campaign spokesman Nick Merrill said Abedin \"has been nothing but entirely cooperative with the Committee's requests.\" \n\"Yet it remains unclear why the committee is focused on her, given her lack of knowledge about the events surrounding Benghazi,\" Merrill said in a written statement. \"The Committee¹s focus on Huma (as opposed to numerous intelligence and defense community officials still outstanding) is additional evidence that the actual attack in Benghazi, and its lessons about how we might better protect diplomats serving in dangerous places, are the last things on the committee's mind.\" \nRanking Democrat on the committee Elijah Cummings of Maryland, echoed those concerns to reporters after a few hours of testimony. \n\"The question becomes whether this is a taxpayer funded effort to derail the candidacy of Hillary Clinton,\" he said. \"It is interesting to note that the people most closely associated with Hillary Clinton seem to be treated differently.\" \nBut Republican committee member Lynn Westmoreland of Georgia defended to CNN the need to talk to Abedin. \n\"If you look at what her job was, you would think she would have some knowledge of some of the events,\" Westmoreland said, adding later, \"I imagine everyone at the state department had some knowledge.\" \nWestmoreland said that Abedin spoke for roughly 30-35 minutes, and has been \"forthcoming\" and \"very nice.\" He added there were some instances she couldn't \"recall fully.\" \nThe appearances come after House Majority Leader Kevin McCarthy, R-California, credited the committee with dragging down Clinton's poll numbers in her bid for the 2016 Democratic presidential nomination -- a line that fired up Democratic criticism of the panel. \nRepublican Rep. Trey Gowdy, the Benghazi committee chairman, has insisted the panel's work isn't driven by politics. \nCopyright 2015 by CNN NewSource . All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Recommended", "external_links": [], "published": "2015-10-16T20:19:00.000+03:00", "crawled": "2015-10-16T20:37:24.030+03:00", "highlightTitle": ""}