{"organizations": [], "uuid": "64fe7995ff0927fd4aa543037e64417d9f14f323", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00015/the-mia-welcomes-accs-decision.htm", "country": "US", "title": "The MIA Welcomes ACC’s Decision", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "The MIA Welcomes ACC’s Decision", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T01:35:00.000+03:00", "replies_count": 0, "uuid": "64fe7995ff0927fd4aa543037e64417d9f14f323"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00015/the-mia-welcomes-accs-decision.htm", "ord_in_thread": 0, "title": "The MIA Welcomes ACC’s Decision", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The MIA Welcomes ACC’s Decision Thursday, 1 October 2015, 11:35 am Press Release: Motor Industry Association \nThe MIA Welcomes ACC’s Decision to Consult on Changes to the Way it Risk Rates Vehicles \nThe Minister for ACC today announced she is consulting on vehicle levies for the 2016/17 year. The MIA welcomes the Minister’s decision to include in its consultation a number of changes, advocated by the MIA, to the way in which it risk rates vehicles for levy purposes. \nThe proposals to reduce overall vehicle levies by 33% ($66.99 average reduction) is significant. The proposed reductions in reducing the petrol levy by 1.2 cents per litre and the motorcycle safety levy by $5.00 are also welcomed. \nThe ACC Board and the Minister for ACC has also listened to concerns raised by the MIA on how it risk rates vehicles under the new levy structure. Risk rating, introduced for the current 2015/16 levy year, worked well for the majority of vehicles but was plagued with errors for some makes and models due to the inflexible nature of the ACC model used to rate vehicles. \nThe MIA called for changes to be made to the system to incorporate model generations as opposed to treating a series of model generations over a long time period as one generation, thereby penalising new models for the less safe outcomes of much earlier models. ACC has also included proposals to tighten up the rigour around use of total secondary safety index data so that the outcome is more credible and has proposed to extend the use of New Car Assessment safety ratings. These measures are necessary to improve the overall credibility of the risk banding process and the MIA welcomes these initiatives. \nThere are a number of alternative options proposed by the Minister as well as some future initiatives she is seeking feedback on. The MIA will examine these carefully and provide the Minister and her Board with a considered response. \nENDS", "external_links": [], "published": "2015-10-01T01:35:00.000+03:00", "crawled": "2015-10-01T02:43:45.925+03:00", "highlightTitle": ""}