{"organizations": [], "uuid": "987428e6e338d2c4e355b1d620924042c2d613ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "kdhnews.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/kdhnews.com/content/tncms/assets/v3/editorial/e/25/e25c5f10-68a7-11e5-8eec-db1bd7467a8f/560de89635f2d.image.jpg", "site_section": "http://kdhnews.com//search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=news/politics*&f=rss", "section_title": "The Killeen Daily Herald - news/politics", "url": "http://kdhnews.com/news/politics/another-candidate-announces-for-district/article_27360a76-68a5-11e5-8efa-c385545aa86d.html", "country": "US", "title": "Another candidate announces for District 54", "performance_score": 0, "site": "kdhnews.com", "participants_count": 1, "title_full": "Another candidate announces for District 54", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T12:30:00.000+03:00", "replies_count": 0, "uuid": "987428e6e338d2c4e355b1d620924042c2d613ef"}, "author": "hwilen@kdhnews.com(Holden Wilen)", "url": "http://kdhnews.com/news/politics/another-candidate-announces-for-district/article_27360a76-68a5-11e5-8efa-c385545aa86d.html", "ord_in_thread": 0, "title": "Another candidate announces for District 54", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Larry Smith Posted: Friday, October 2, 2015 4:30 am Another candidate announces for District 54 Holden Wilen | Herald staff writer Killeen Daily Herald | 0 comments Posted on Oct 2, 2015 by Holden Wilen \nA 10-year veteran of the Army underwhelmed by the choice of candidates for the Texas State House District 54 seat has become the third candidate to throw his hat in the ring. \nLarry Smith, 39, originally from Detroit, has spent 16 years in Texas and moved to Killeen while serving in the Army. After getting medically discharged as a captain in 2006, he decided to stay. \nSmith, who describes himself as a tea party-friendly conservative, said he decided to run for office because he can provide an independent voice to represent Central Texas and veterans. He said Killeen Mayor Scott Cosper and optometrist Austin Ruiz, the other two candidates for District 54, are tied to the political system. \n“I am not bought,” said Smith, a former infantry officer. “A developer has to understand there is nothing coming his way strictly for the basis of his donations. He is not donating for the favors I can offer him. He is going to donate based on my character. If he doesn’t like it, then he needs to go vote for the other guy and write him a check.” \nSmith, who is unemployed but previously worked for an oil company in South Texas and also worked as a consultant, said as a veteran, he wants to help give back to the community and represent military communities that are in need of more funding. If elected, Smith said he will fight for Bell County, Killeen, Harker Heights and other area communities because municipalities and the school system will be hit hard by troop reductions at Fort Hood. \n“For every military dependent that leaves the school district, that is $5,000 in direct federal funding. \n“If 4,000 people are leaving Fort Hood, let’s just say 1,000 children are associated with that, that is $5 million. I’m sure any teacher can quickly add up and figure out how many will be out of a job. This is the start of it. This is just the first round of cuts. They will continue to 2020.” \nTo help deal with the cuts, Smith said he will fight for an amendment to the Texas Constitution, modeling it after one used previously to help Hidalgo County. \nHidalgo has struggled with poverty, Smith said, so the Legislature amended the Constitution by lowering the amount the county has to pay back in Medicare repayment from other counties in Texas. \nSmith said he will propose an amendment allowing the state to give Bell County more sales tax revenues than other counties because of its infrastructure related to Fort Hood. \n“Bell and municipalities cannot afford to keep paying for infrastructure issues without jacking up property taxes and fines,” Smith said. “We need help. The help is going to come from getting a bigger slice of the pie.” \nSmith said he looks forward to ramping up his campaign and getting people to come out and vote. \nHe also said he is looking forward to building relationships with other legislators to gain support for his amendment proposal. \n“We as a community need to start electing a better quality of people,” Smith said. “That is not going to happen until we get out and actually start voting; 4 or 5 percent voter turnout is not going to get you good city leadership.” \nContact Holden Wilen at hwilen@kdhnews.com or 254-501-7463​", "external_links": [], "published": "2015-10-02T12:30:00.000+03:00", "crawled": "2015-10-02T17:41:39.477+03:00", "highlightTitle": ""}