{"organizations": [], "uuid": "93df5b8bb7fae8ce1002eb0fa8f9feb61a005276", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.poconorecord.com", "main_image": "http://www.poconorecord.com/storyimage/PR/20151014/NEWS/151019746/AR/0/AR-151019746.jpg", "site_section": "http://www.poconorecord.com/news/politics?template=rss&mime=xml", "section_title": "Politics and Elections - poconorecord.com", "url": "http://www.poconorecord.com/article/20151014/NEWS/151019746/101019/NEWS?rssfeed=true", "country": "US", "title": "Analysis: Clinton's debate showing may allay Dem concerns", "performance_score": 0, "site": "poconorecord.com", "participants_count": 1, "title_full": "Analysis: Clinton's debate showing may allay Dem concerns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:34:00.000+03:00", "replies_count": 0, "uuid": "93df5b8bb7fae8ce1002eb0fa8f9feb61a005276"}, "author": "Lisa Lerer Associated Press", "url": "http://www.poconorecord.com/article/20151014/NEWS/151019746/101019/NEWS?rssfeed=true", "ord_in_thread": 0, "title": "Analysis: Clinton's debate showing may allay Dem concerns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Oct. 14, 2015 at 10:34 AM By Lisa Lerer Posted Oct. 14, 2015 at 10:34 AM » Social News LAS VEGAS (AP) — Forceful and confident in debate, Hillary Rodham Clinton may have heartened Democrats worried that her handling of a private email server used while secretary of state might indicate larger problems with her campaign and her political skills. Clinton's strong performance Tuesday night in the party' first presidential debate of the 2016 race might give Vice President Joe Biden another reason to stay on the sidelines. Biden, still mulling a run, watched from his Washington home. Clinton tried to portray herself as President Barack Obama's natural successor, and when asked how she would differ from him, mildly noted that she would be the first female president, if elected. Much of debate amounted to a referendum on Clinton's nearly quarter-century in politics: her vote for the Iraq war while in the Senate; shifts to the left on trade and other issues; the email matter; and her judgment on foreign policy. She acknowledged that all the candidates on stage had \"changed a position or two\" during their political careers. A notable moment came when Sen. Bernie Sanders of Vermont, her most formidable current opponent, rose to her defense about the email server issue. \"The American people are sick and tired of hearing about your damn emails,\" said Sanders. \"Enough of emails.\" \"Thank you Bernie,\" said Clinton, as the two shook hands. A veteran of 25 presidential debates in the 2008 race against Obama, Clinton cut a practiced figure, hoping to create the kinds of takeaways that can set campaign narratives. Clinton aides had pointed to the debate as a turning point for the campaign, a chance to move past a summer slump and provide a boost for the more intense fall calendar. Still, with nearly four months before the first round of voting and over a year before Election Day, many questions remain. Even with Sanders dismissal of the email issue, Clinton faces a slow-drip of news on that subject, a result of a court order mandating monthly releases of her correspondence. Those releases will continue right up to three days before the Iowa caucuses, which are Feb. 1. On Oct. 22 she is scheduled to testify before the House committee investigating the deadly attacks on the American mission in Benghazi, Libya, in 2012, when she headed the State Department. The Democratic base has shifted left during the eight-years of Obama's administration. Clinton, at times, has struggled to keep pace with her party. In the past two years, she's changed on gay marriage, the Cuban embargo, driver's licenses for immigrants in the country illegally and the Keystone XL pipeline. Days before the debate, she announced her opposition to the Trans-Pacific Partnership, a sweeping free trade deal that she once called the \"gold standard.\" Those moves have fed lingering concerns among the Democratic party base and Sanders' insurgent campaign. Clinton struggled at times during the debate to explain why her positions have seemed to shift with the electoral calendar. \"We know that if you are learning, you're gonna change your position,\" she said. \"I never took a position on Keystone until I took a position on Keystone.\" But she also quickly tried to undercut Sanders' liberal image and seemed to catch him a bit by surprise with a swift attack on his record on gun control legislation. When asked whether he had been tough enough on the issue as a senator, she said simply: \"No. Not at all.\" Sanders said it was a complicated issue. Clinton said, \"I was in the Senate at the same time. It wasn't that complicated to me.\" The two-hour debate presented a stark contrast to the early ones in the GOP race. Ten-candidate brawls on the Republican side have revealed a party with deep ideological divides over immigration, foreign policy and civil liberties. The Democrats presented a far more unified front, with the candidates arguing more about their personal pasts than the direction they would take the country. Unlike the Republicans, all largely supported their leadership in Washington, criticizing the president rarely and carefully. While Clinton passed her first test, there will be more to come. The candidates have five more primary debates, and several of the contenders are pushing for more. By Lisa Lerer", "external_links": [], "published": "2015-10-14T18:34:00.000+03:00", "crawled": "2015-10-14T19:33:19.714+03:00", "highlightTitle": ""}