{"organizations": [], "uuid": "a06015bf38e3e78eafffe7b4925a3e260263cdbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "", "site_section": "http://www.usnews.com", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/us/articles/2015/10/20/san-francisco-board-reaffirms-status-as-immigrant-sanctuary", "country": "US", "title": "San Francisco board reaffirms status as immigrant sanctuary", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "San Francisco board reaffirms status as immigrant sanctuary - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "a06015bf38e3e78eafffe7b4925a3e260263cdbe"}, "author": "USNews", "url": "http://www.usnews.com/news/us/articles/2015/10/20/san-francisco-board-reaffirms-status-as-immigrant-sanctuary", "ord_in_thread": 0, "title": "San Francisco board reaffirms status as immigrant sanctuary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Francisco board reaffirms status as immigrant sanctuary after woman killed on pier 06 p.m. EDT + More By JANIE HAR, Associated Press\nSAN FRANCISCO (AP) — San Francisco supervisors vigorously reaffirmed the city's status as a sanctuary city on Tuesday by rejecting a resolution that encouraged cooperation with federal immigration officials involving inmates in local jails.\nIn addition, the board unanimously approved a resolution urging the sheriff not to participate in a detainer-notification system that asks jails to let Immigration Customs and Enforcement officials know when an inmate of interest is being released.\nThe actions sent a strong but symbolic message to critics who had lambasted the city after the July 1 shooting of a 32-year-old woman on a city pier. Kate Steinle was killed by a Mexican national who had been released from jail despite federal requests to detain him for deportation proceedings.\nThe death of Steinle cast an uncomfortable spotlight on the city that proudly declares itself a refuge for immigrants. As outrage mounted nationally, U.S. Sen. Dianne Feinstein, a California Democrat, criticized the sheriff, saying suspect Juan Francisco Sanchez-Lopez should have been detained.\nSanchez-Lopez says he found the gun under a bench on the pier, and it accidently fired when he picked it up.\n\"All of us in this room agree that the death of Kathryn Steinle was senseless and tragic, but what many of us disagree on is the role — if any — that San Francisco's existing sanctuary and due process for all\" ordinance played in the event, Supervisor Malia Cohen said.\nSan Francisco declared itself a sanctuary city in 1989, passing an ordinance that bans city officials from enforcing immigration laws or asking about immigration status unless required by law or court order.\nSupervisors on Tuesday tabled another resolution urging the sheriff to revoke a department-wide memo prohibiting communication between his staff and federal immigration authorities.\nEarlier in the day, Senate Democrats in Washington blocked legislation pushed largely by Republicans that would punish jurisdictions that don't cooperate with federal immigration agents.\nCopyright 2015 The Associated Press .\nTAGS: Associated Press", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZee1ih%3Fsrc=usn_gp", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZee1ih%3Fsrc=usn_su", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZee1ih%3Fsrc=usn_tw&via=usnews&text=San%20Francisco%20board%20reaffirms%20status%20as%20immigrant%20sanctuary", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZee1ih%3Fsrc=usn_li&title=San%20Francisco%20board%20reaffirms%20status%20as%20immigrant%20sanctuary&summary=&source=U.%20S.%20News", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZee1ih%3Fsrc=usn_rd&title=San%20Francisco%20board%20reaffirms%20status%20as%20immigrant%20sanctuary", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZee1ih%3Fsrc=usn_fb"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T02:21:09.420+03:00", "highlightTitle": ""}