{"organizations": [], "uuid": "ab980a8248075c2d975bba58e1ce3d0f86243c1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-9cdff666206af1baae85058fd96e0056.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/echoes-of-vietnam-in-obamas-isis-metrics/article/2574588?custom_click=rss", "country": "US", "title": "Echoes of Vietnam in Obama's ISIS metrics", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Echoes of Vietnam in Obama's ISIS metrics | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:01:00.000+02:00", "replies_count": 0, "uuid": "ab980a8248075c2d975bba58e1ce3d0f86243c1d"}, "author": "Charles Hoskinson", "url": "http://www.washingtonexaminer.com/echoes-of-vietnam-in-obamas-isis-metrics/article/2574588?custom_click=rss", "ord_in_thread": 0, "title": "Echoes of Vietnam in Obama's ISIS metrics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Obama administration's strategy for convincing Americans that its efforts against the Islamic State are succeeding is all in the numbers: a careful tally of dead extremists, destroyed equipment and degraded capabilities.\nThe daily barrage of metrics is reminiscent of the daily \"body counts\" used to define success in another war half a century earlier: Vietnam. In that war, the body counts added up to defeat for the United States, which many former officials and analysts warn is where the administration's approach is headed if it doesn't take a broader view.\n\"We are due for a comprehensive review of the administration's strategy against ISIS,\" said Bilal Saab, a senior fellow at the Atlantic Council. \"We can continue to step up our kinetic efforts, but the overall plan to the extent that one is discernable lacks clear strategic guidance. Killing one bee at a time when you're dealing with a massive whole beehive is not exactly sound strategy.\"\nhttp://www.washingtonexaminer.com/article/2574118/ 1 But the administration's story is that its 65-nation coalition is winning against the Islamist extremist group, a story that's backed up by impressive numbers. As of Oct. 8, according to U.S. Central Command, 13,781 targets had been destroyed or damaged in more than 7,400 airstrikes, including 126 tanks, 3,956 buildings, 3,930 fighting positions and 232 targets associated with the group's attempts to exploit oil resources it has captured in Iraq and Syria.\n  Obamacare regs give nurses a headache Hospitals want more education in a profession that has been   low-income people.\nBy Sean Higgins • 10/26/15 12:01 AM Though military officials publicly shy away from trying to calculate how many Islamic State fighters have been killed, officials have privately told reporters the figure is about 20,000. And officials are not shy about letting reporters know when a strike has killed one of the group's leaders.\n\"To be sure, there are still‚ you know, we estimate between 20,000-30,000 enemy fighters out there on this battlefield. That's a lot. The numbers of killed — you know, we try to stay away from body counts, generally speaking. I'm not going to argue with those numbers that you just cited. But we try not to get into that,\" Col. Steve Warren, spokesman for the operation to fight the Islamic State, told reporters Oct. 13.\n\"But what I'll tell you is we have eliminated ISIL fighters as fast as they've been able to recruit them, we're able to eliminate them. And then you add in the fact that we have been eliminating their leaders ... and you're beginning to see the edges fray.\"\nBut the administration's emphasis on numbers has frustrated observers who see other indicators that the extremists are holding their own, and possibly even gaining ground. The metrics passed out in Pentagon briefings and press releases have drawn comparisons to those during the Vietnam War derided by reporters as \"The Five O'clock Follies.\"\nThe Vietnam experience left a deep reservoir of distrust between reporters and the military, and was a direct cause of the official reluctance to deal in body counts in Middle Eastern conflicts from the Gulf War 25 years ago until today's fight against the Islamic State.\nAlso from the Washington Examiner For Priebus, it's win or bust for 2016 Priebus says the party will be \"cooked\" if it loses to a Democrat for a third straight cycle.\nBy Al Weaver • 10/26/15 12:01 AM Critics today say the numbers illustrate a lack of strategic perspective reminiscent of that which contributed to defeat in Vietnam.\nSenate Armed Services Chairman John McCain, a former Navy pilot who endured more than five years as a prisoner of war in Vietnam, also compared the policy of the Obama administration to one which many Democrats had also seen as a parallel of the conflict in Southeast Asia.\n\"In a display of self-delusion that can rival the Bush administration's Iraq policy at its worst, the Obama administration now tells us their strategy is working, that we are making progress, that time is on our side, that strategic patience is all we need, and that we should just stay the course,\" the Arizona Republican said at a committee hearing in September.\nSaab noted that the problem of the Islamic State stems from systemic failure of governance in the Arab world, and that a successful change in strategy requires some acceptance of political risk, which the administration so far has been unwilling to do.\nThe extremist group also has staying power in the region, noted Hassan Hassan, co-author of ISIS: Inside the Army of Terror .\nAlso from the Washington Examiner New 'smart' drugs tell doctor you're not taking them A new smart drug could be particularly useful in ensuring the mentally ill continue taking their medications.\nBy Paige Winfield Cunningham • 10/26/15 12:01 AM \"I have no doubt that ISIS will stay at least for a decade, not only as a group that exists somewhere, but as a group that controls terrain [which will] probably be wider in the region,\" he said, noting that economic disruption from the coalition airstrikes have made it easier for the group to recruit from local populations in Syria and Iraq, reducing its dependence on foreign fighters.\n\"Airstrikes have disrupted a wartime economy that was functioning before ISIS,\" he said. \"I notice that families do either of two things: the first one is either get their sons to join ISIS, or send their sons overseas to Europe as refugees. So, either join the refugee army or ISIS army.\"\nTop Story Joe Biden: 'I'm   Trump' \n \nBy Curt Mills • 10/25/15 8:16 PM", "external_links": [], "published": "2015-10-26T02:01:00.000+02:00", "crawled": "2015-10-26T11:05:11.496+02:00", "highlightTitle": ""}