{"organizations": ["County Assembly", "MCA"], "uuid": "525e2c8571e360eda521841aeae715c0672e42d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nation.co.ke", "main_image": "\r\n    http://www.nation.co.ke/image/view/-/2924458/medRes/1154890/-/ki7x4u/-/DNWAIRIA0709d.jpg", "site_section": "http://www.nation.co.ke/news/politics/Cord-begins-search-for-referendum-signatures/-/1064/2429002/-/view/asFeed/-/3vhj9h/-/index.xml", "section_title": "Daily Nation | Politics", "url": "http://www.nation.co.ke/news/politics/Muranga-Governor-impeached/-/1064/2924446/-/oyhhdv/-/index.html", "country": "GB", "title": "MCAs send Murang’a Governor home over Sh2.5bn debt", "performance_score": 0, "site": "nation.co.ke", "participants_count": 0, "title_full": "MCAs send Murang’a Governor home over Sh2.5bn debt", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T20:05:00.000+03:00", "replies_count": 0, "uuid": "525e2c8571e360eda521841aeae715c0672e42d1"}, "author": "", "url": "http://www.nation.co.ke/news/politics/Muranga-Governor-impeached/-/1064/2924446/-/oyhhdv/-/index.html", "ord_in_thread": 0, "title": "MCAs send Murang’a Governor home over Sh2.5bn debt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joseph Machiri", "Mwangi Wairia", "Kamacharia", "Mary Waithera", "Murang", "Nduati Kariuki"], "text": "Wednesday, October 21, 2015 MCAs send Murang’a Governor home over Sh2.5bn debt Murang'a County Governor Mwangi Wairia who was impeached on October 21, 2015 by MCAs who accused him of gross misconduct. FILE PHOTO | NJUGI NGUGI | NATION MEDIA GROUP In Summary Last week, County Assembly Speaker Mr Nduati Kariuki allowed a notice of the impeachment Motion tabled by nominated member Mary Waithera. It was seconded by Kamacharia MCA Mr Joseph Machiri on Wednesday at the expiry of the seven-day notice allowed by the Standing Orders of the House. The MCA also accused the executive of spending Sh247 million on advertising against the Assembly’s recommendation of Sh7 million. Advertisement More by this Author \nMurang’a County Governor Mwangi wa Iria has been impeached. \nMembers of the County Assembly (MCAs) on Wednesday accused the county boss of misusing cash and failing to manage the county’s debt. \nMr Wa Iria was impeached after 34 out of 49 MCAs voted for his removal, for alleged gross misconduct and abuse of office. \nHe needed only two more votes to survive but fell short. \nLast week, County Assembly Speaker Mr Nduati Kariuki allowed a notice of the impeachment Motion tabled by nominated member Mary Waithera. \nIt was seconded by Kamacharia MCA Mr Joseph Machiri on Wednesday at the expiry of the seven-day notice allowed by the Standing Orders of the House. \nMs Waithera accused the governor of gross violation of the Constitution and abuse of office. \nShe alleged lack of accountability in the management and use of county resources, exemplified by an unsustainable debt of Sh2.5 billion. \nAccording to her, this was not disclosed in the debt management and fiscal papers. \nAUDITOR'S REPORT \nShe cited the Auditor-General’s report that revealed that the county spent over Sh28 million in “unclear circumstances on a controversial co-operative society known as Shilingi Kwa Shilingi. \nThe MCA also accused the executive of spending Sh247 million on advertising against the Assembly’s recommendation of Sh7 million. \n“The governor has also failed to establish the county budget and economic forum and also disregarded the County Assembly and undermined its legislative authority through requisition of monies and not remitting the same hence crippling operations of the House,” said Ms Waithera \nThe assembly accused the governor of borrowing Sh200 million from the Kenya Commercial Bank (KCB) without guarantee from the National Treasury. \nKahumbu Ward MCA Erick Kamande, who opposed the impeachment Motion, said the leaders should iron out their differences for the sake of peace. \nSUPREMACY WAR \nThe governor has been involved in a supremacy battle with local MPs led by Kigumo’s Jamleck Kamau. \nOn Wednesday, Mr Kamau preferred to stay out of the fray. \n“We will issue a comprehensive statement on the issue with other MPs by the weekend,” he said. \nHis impeachment battle now moves to the Senate, where senators have to approve the move to send him home. \nNyeri County governor Nderitu Gachagua is also under pressure from MCAs. \nSeveral county assemblies including Embu, Makueni, Kericho and Pokot have in the past unsuccessfully attempted to impeach their governors.", "external_links": [], "published": "2015-10-21T20:05:00.000+03:00", "crawled": "2015-10-21T20:36:37.079+03:00", "highlightTitle": ""}