{"organizations": [], "uuid": "b70504f59d3069925a562d84920618c880514b90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/uypc6ge664_images_2.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/648325/1/we-need-new-leadership-not-another-eurobond.html", "country": "US", "title": "We Need New Leadership Not Another Eurobond", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "We Need New Leadership Not Another Eurobond", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:26:00.000+03:00", "replies_count": 0, "uuid": "b70504f59d3069925a562d84920618c880514b90"}, "author": "", "url": "http://www.modernghana.com/news/648325/1/we-need-new-leadership-not-another-eurobond.html", "ord_in_thread": 0, "title": "We Need New Leadership Not Another Eurobond", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Yaw P. K. Manu"], "text": "Politics | 9 October 2015 21:26 CET We Need New Leadership Not Another Eurobond By Yaw P. K. Manu \n“Hopes of President Mahama fixing the country’s broken down economy continues to dim by the day as Government struggles to borrow monies at abnormally high interest rates, to service Ghana’s fast growing debt. Currently, Ghana spends $3billion every year, the equivalent of the famous Chinese Development bank loan, to service only interest on debt payment, so what magic will $1billion Eurobond work for Ghana? What we really need is competent political leadership, and that is where Nana Akufo-Addo and the NPP come in”. \nThese were the comments of the Director of Communications of the Opposition New Patriotic Party, Nana Akomea, on the NDC government’s celebration of raising $1billion on the Euro market. \nAccording to him, the high interest rate of 10.7% percent levied on the Eurobond was indicative of the international financial market’s low level of confidence in the Ghanaian economy. \nExplaining, Nana Akomea said the interest rate placed on loans like the Eurobond are largely dependent on the level of confidence that the international financial market has in your economy. “Where they believe that the state of your economy poses a high risk to their investment, they will ask for a higher interest rate, and vice versa”. \nAccording to him, the 10.7% placed on Ghana’s Eurobond is the highest demanded interest any African country that has gone for a Eurobond has secured. “Even in 2007, without crude oil to back the economy, and without a World Bank guarantee, Ghana was able to secure an interest rate of 8.5% for its Eurobond. So what happened, and they are now asking for an unprecedented 10.7% interest? Even recently war-ravaged Ivory Coast was able to secure a Eurobond facility at an interest rate of 6.5%, so why is Ghana borrowing at a whopping 10.7%?” he asked. \nThe former Member of Parliament for Okaikoi South also expressed doubts that the $1billion Eurobond, would have any long lasting significant impact on the country’s economy. \n“Over the years, the Mahama government has sent our debt levels to unprecedented levels. From a debt of nearly $9billion by end 2008, the Mahama -led NDC has borrowed beyond $30billion. They have gone in for an IMF supervised loan of close to $1billon, they have gone for cocoa syndicated loans, they have borrowed domestically and internationally, they have placed taxes on almost everything taxable, and yet the economy is in a state of limbo, with only routine infrastructure to boast about” he said. \nAccording to Nana Akomea, the only way that Ghana can once again become the vibrant economy that it was before, with a stable currency, and high investor confidence, and a clamp down on corruption, is if there is a change in political leadership. \n“It is obvious that as an oil producing economy, the only reason why we are running around for, and applauding high-interest rate loans is because political leadership has failed to safeguard what we have, and failed to use it judiciously”, he stated. \nNana Akomea called on Ghanaians to join the NPP work towards a massive electoral victory in 2016, stating that the only way Ghanaians can have hope for a promising and prosperous Ghanaian economy, is if the Nana Akufo-Addo and the NPP are voted into office to provide competent and un-corruptible leadership. Politics Follow Us TIME AND TIDE WAITS FOR NO MAN; SO SAVOUR EVERY SECOND AND MAKE THE BEST OF EVERY SITUATION By: Albert Amponsah Akuo", "external_links": [], "published": "2015-10-09T23:26:00.000+03:00", "crawled": "2015-10-10T11:20:01.896+03:00", "highlightTitle": ""}