{"organizations": [], "uuid": "167180cfbc8c09e62ff9e35f51729c753d4f6e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00353/concerted-action-needed-to-crack-land-price-inflation.htm", "country": "US", "title": "Concerted action needed to crack land price inflation", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Concerted action needed to crack land price inflation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T02:45:00.000+03:00", "replies_count": 0, "uuid": "167180cfbc8c09e62ff9e35f51729c753d4f6e71"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00353/concerted-action-needed-to-crack-land-price-inflation.htm", "ord_in_thread": 0, "title": "Concerted action needed to crack land price inflation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "21 OCTOBER 2015 \nConcerted action needed to crack land price inflation \nThe operation of our planning systems needs to change if New Zealand cities are to have enough land for housing, says the Productivity Commission in its final report on using land for housing, released today. \n“The average price of residential land has increased rapidly in recent years, reflecting an inability to zone and service enough land to meet demand,” says Commission Chair, Murray Sherwin. “In Auckland, land is now five times more expensive than it was twenty years ago.” \n“This has real impacts on the wellbeing of New Zealanders. It contributes to high housing costs, shuts aspiring owners out of the market, narrows the types and quality of housing choices, leads to over-crowding, and creates barriers to people moving into cities where there are more jobs and higher incomes.” \n“There are many obstacles to the supply of land within and outside of cities. Local homeowners oppose developments that could increase rates, decrease the value of their houses or simply change their neighbourhoods.” \n“Many councils prefer to house growing populations by encouraging greater density within existing city boundaries. However, some planning rules have the effect of inhibiting that increased density. Where a city has barriers to both growing up and growing out, the inevitable response to the demand for housing is higher prices.” \n“Our urban planning systems are not set up to respond to the information provided by market prices. The sharp increase in house prices that has occurred in recent years is a clear indication that rising demand for housing is not being met with rising supply. This needs to change.” \n“In its final report, the Commission makes a number of recommendations to increase the responsiveness of planning to demand, including better cost-recovery for infrastructure, proper cost-benefit analysis before planning rules are introduced, and more support from central government to help councils develop higher-intensity housing on inner-city sites.” \n“But the most important thing that councils and the government need to do is create a credible commitment to release and service more land and to bring land price inflation under control. We need to break the pattern whereby there is more money to be made from simply holding land instead of using it.” \n“If councils are unable to make this commitment, then central government will need to step in and make it happen. Government should set a limit for land price inflation which would clearly signal to councils, landowners and developers the conditions under which government would intervene to make more land available.” \n“A sufficient supply of land for housing, an adequate supply of affordable housing, and the effective functioning of our cities, are topics of national importance. Central government has a legitimate interest in resolving those issues, where local councils cannot.” \nThe report is available from www.productivity.govt.nz/inquiry-content/using-land \nAbout the inquiry The Government asked the Commission to examine and compare the rules and processes of local government to identify leading practices in planning and taking decisions about making land available for housing, and providing for necessary infrastructure, as well as look at models adopted by cities overseas that might provide valuable lessons for New Zealand. \nAbout the New Zealand Productivity Commission \nThe Commission – an independent Crown entity – was established in April 2011 and completes in-depth inquiry reports on topics selected by the Government, carries out productivity-related research, and promotes understanding of productivity issues.", "external_links": [], "published": "2015-10-21T02:45:00.000+03:00", "crawled": "2015-10-21T05:36:31.320+03:00", "highlightTitle": ""}