{"organizations": [], "uuid": "4341a12e3d32d9bdc1cfa3c1b77ff0e17a460c8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.japantoday.com", "main_image": "", "site_section": "http://www.japantoday.com/feed/category/politics", "section_title": "Japan Today: Japan News and Discussion - Politics", "url": "http://www.japantoday.com/category/politics/view/govt-urges-businesses-to-increase-investment-to-lift-economy", "country": "US", "title": "Politics › Gov't urges businesses to increase investment to lift economy", "performance_score": 0, "site": "japantoday.com", "participants_count": 0, "title_full": "Politics › Gov't urges businesses to increase investment to lift economy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T10:30:00.000+03:00", "replies_count": 0, "uuid": "4341a12e3d32d9bdc1cfa3c1b77ff0e17a460c8a"}, "author": "", "url": "http://www.japantoday.com/category/politics/view/govt-urges-businesses-to-increase-investment-to-lift-economy", "ord_in_thread": 0, "title": "Politics › Gov't urges businesses to increase investment to lift economy", "locations": ["TOKYO"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "( 1 ) TOKYO — \nThe government urged business leaders Friday to boost capital investment to lift the Japanese economy as it faces the risk of falling into a recession amid China’s economic slowdown. \nIn a dialogue attended by Prime Minister Shinzo Abe, Cabinet members and business leaders, the participants also discussed policy measures requested by the private sector including a corporate tax rate reduction and regulatory reforms. \n“I hope industry circles will show stepped-up and specific prospects” for expanded corporate investment in facilities and human resources, Abe told the meeting. \nThe Abe government’s move to publicly try to exercise influence on business decisions came after it demanded companies raise wages in previous spring wage negotiations. \nThe government is expected to urge companies to raise wages in future meetings. \nThe government has shown dissatisfaction with businesses, with officials saying companies have been reluctant to expand investment though they are making high profits. \nBusinesses, meanwhile, have called on the government to slash corporate tax rates that are relatively high compared with international standards. \nAbe said the increase in corporate investment “has not been enough,” while pledging to offer government support to eliminate the problems “without sanctuary” areas. \nFinance Minister Taro Aso presented statistics showing that companies’ retained profits increased by nearly 50 trillion yen from fiscal 2012 to 2014, calling on businesses to make more “positive investments.” \nAmong seven business leaders who attended the first dialogue were the leaders of Japan’s three business lobbies including the Japan Business Federation, known as Keidanren. \nAt the dialogue, Keidanren requested the government to reduce the effective corporate tax rate to below 30% at an early date, promote regulatory reforms and restrain electricity fees. \nThe business lobby also argued companies have been actively using funds to implement mergers and acquisitions of domestic and overseas companies. \nThe dialogue, which will be held on a monthly basis, will set different themes in each meeting such as innovation, new industries and tourism and invite business leaders related to the issues, according to the government. \nThe move follows Abe’s pledge to expand Japan’s nominal gross domestic product to 600 trillion yen by around 2020 from 490 trillion yen under his “Abenomics” policy package that now consists of three new “arrows.” \nThe government is aiming to realize an economic recovery led by private sector investment and stimulating domestic demand, as the economy suffers from weak exports and production on the back of slowdowns in emerging economies including China. \nAmid tepid private consumption, Japan’s economy is feared to face another setback in the July-September period after shrinking an annualized 1.2% in the second quarter of 2015. © KYODO", "external_links": [], "published": "2015-10-16T10:30:00.000+03:00", "crawled": "2015-10-16T10:59:29.922+03:00", "highlightTitle": ""}