{"organizations": [], "uuid": "028504700d930493b4ae9420a0fedf1a7dcbad9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newrepublic.com", "main_image": "http://www.newrepublic.com/sites/default/files/citizens-united-jim-crow.jpg", "site_section": "http://www.newrepublic.com/taxonomy/term/17538/feed#", "section_title": "The New Republic - Politics", "url": "http://www.newrepublic.com/article/123014/citizens-uniteds-legal-roots-lie-jim-crow-supreme-court", "country": "US", "title": "Citizens United's Legal Roots Lie in the Jim Crow Supreme Court", "performance_score": 0, "site": "newrepublic.com", "participants_count": 1, "title_full": "Citizens United's Legal Roots Lie in the Jim Crow Supreme Court", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:26:00.000+03:00", "replies_count": 0, "uuid": "028504700d930493b4ae9420a0fedf1a7dcbad9d"}, "author": "Lawrence Goldstone", "url": "http://www.newrepublic.com/article/123014/citizens-uniteds-legal-roots-lie-jim-crow-supreme-court", "ord_in_thread": 0, "title": "Citizens United's Legal Roots Lie in the Jim Crow Supreme Court", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Citizens United's Legal Roots Lie in the Jim Crow Supreme Court By Lawrence Goldstone Photo: Drew Angerer / Getty Images \nA s John Roberts begins his second decade as the chief justice, a number of Supreme Court rulings during his tenure are once more in the news, perhaps none more so than Citizens United v . Federal Elections Commission . The 5-4 decision, which applied First Amendment guarantees of freedom of speech to a private corporation, has been targeted lately by Democrat presidential candidates Hillary Clinton (“ Citizens United was about me. Think how that makes me feel. ”) and Bernie Sanders, who declared this week , “No nominee of mine to the United States Supreme Court will get that job unless he or she is loud and clear that one of their first orders of business will be to overturn Citizens United .\" Americans are equally hostile to the decision: A national poll released by Bloomberg Politics this week found that 78 percent of respondents want Citizens United overturned, while only 17 percent support the ruling. \nWhat many Americans might not know, however, is that the manner in which corporations came to be granted personal rights is inextricably linked to a series of late nineteenth century Supreme Court rulings that disemboweled the Fourteenth and Fifteenth amendments and ushered in the Jim Crow era, when state and local laws were passed to create racial segregation. \nThe Fourteenth Amendment, ratified in 1868, was aimed at securing fundamental rights for the four million newly freed slaves. Section 1 conferred citizenship on any person born in the United States, made them citizens of the state in which they resided, and guaranteed all Americans “due process of law” and “equal protection of the laws.” To the man who drafted that section of the amendment, Representative John Bingham of Ohio, this meant that the personal guarantees of the Bill of Rights would apply to state as well as federal law. Most in Congress who voted for the amendment agreed, and we take such guarantees against state action for granted today. And the Fifteenth Amendment, of course, guaranteed black men the right to vote. \nBut after Chief Justice Salmon P. Chase died in 1873, protections for black Americans began to unravel, all enabled and often mandated by the Supreme Court. \nPresident Ulysses Grant had a great deal of difficulty filling Chase’s seat. Having failed three times to find an acceptable candidate, he settled on Morrison R. Waite. It was not a choice based on excellence. Waite was described by Grant’s attorney general as “sufficiently obscure for the occasion,” and characterized by the Nation as firmly “in the first rank of second rank lawyers.” Stung by the criticism and determined to make his mark, Waite decided to author the majority opinion in the most inflammatory case on the 1876 docket, United States v . Cruikshank . \nOn Easter Sunday, 1873, 250 heavily armed white men, dragging a cannon behind them, besieged 150 black men who, in the wake of a ferociously disputed gubernatorial election, had taken refuge in the courthouse in Colfax, Louisiana. The hopelessly outgunned black men surrendered, whereupon the whites proceeded to slaughter them. At least 100 died, some burned alive in the courthouse, others hunted down as they tried to escape into the woods. Federal prosecutors feared that state courts would acquit any of the whites charged, so they turned to a law that transferred race crimes to federal court and indicted one hundred whites for violating the Constitutional rights of the murdered black men. Only three were convicted. (The suspects could not be tried for murder, which was strictly a state crime.) The three appealed on the grounds that under the Fourteenth Amendment, the federal government had no right to restrict the actions of individuals, only states. \nWaite agreed. Only if an attack could be proven to have been racially motivated could individuals run afoul of federal law, and the mere fact that 100 black men were massacred by an armed force of whites was not proof enough. Cruikshank and his fellow defendants went free. \nOnce emboldened, the Court continued to chip away. Also in 1876, in United States v. Reese , the Court ruled that the Fifteenth Amendment did not actually guarantee the right to vote, but only that the right to vote not be restricted on racial grounds. And such restrictions would be almost impossible to prove. In Virginia v. Rives (1879), the Court ruled that a state had to announce that a law was discriminatory in order to violate Fourteenth or Fifteenth Amendment guarantees. In other words, that virtually no black men in Virginia were on the voting roles or called for jury service was not in itself proof of discrimination. As a result, restricting voting rights through such contrivances as poll taxes, literacy requirements, grandfather clauses, or other ludicrous tests was perfectly acceptable under federal law. \nThen, in 1883, the Waite Court administered the coup de grâce to equal rights when it ruled 8-1 that Congress had no authority to outlaw discrimination by private individuals or organizations and declared the Civil Rights Act of 1875 unconstitutional. \nThe Civil Rights Act of 1875 was perhaps the most far-reaching legislation of its kind ever enacted by Congress. Section 1 stipulated, “That all persons within the jurisdiction of the United States shall be entitled to the full and equal and enjoyment of the accommodations, advantages, facilities, and privileges of inns, public conveyances on land or water, theaters, and other places of public amusement.” But it was also extremely unpopular. Few white Americans, in the South as well as North, were prepared to sit next a black person in a theater, dine in the same restaurant, or even walk in the same park. Restaurants and hotels closed rather than accept black customers. A New York Times editorial denounced the law : “It has put us back in the art of governing men more than two hundred years … startling proof how far and fast we are wandering from the principles of 1787, once so loudly extolled and so fondly cherished.” \nIt took eight years, but five cases were combined and brought before the Court. Three were from the North and none from the Deep South. Justice Joseph Bradley, writing for the majority, could not have been more clear. “Individual invasion of individual rights is not the subject matter of the [Fourteenth] amendment.” \nIn the wake of the Court’s decision and after a number of other cases where the Court claimed to adhere to the letter of the law while bulldozing its spirit, every southern state rewrote its Constitution in a manner that effectively removed black citizens from the political process. Between 1897 and 1900 in Louisiana, for example, the number of black men registered to vote fell from 130,344 to 5,320. And so Jim Crow was born. Between 1890 and 1903, 1,405 black Americans were lynched in the United States. \nThen, having rewritten the Fourteenth Amendment to the detriment of African-Americans, the Court rewrote it once more to protect American corporations. It was an era of burgeoning corporate power, particularly railroads, and many of the justices had specialized in corporate law before being elevated to bench. In a seemingly innocuous 1886 case, Santa Clara County v. Southern Pacific Railroad Company , a unanimous Court ruled that a railroad could not be taxed for fences that had been erected by the state and were therefore not part of the railroad’s property. More significant, however, was an aside taken down by a court reporter, in which Chief Justice Waite asserted, “The court does not wish to hear argument on the question whether the provision in the Fourteenth Amendment to the Constitution, which forbids a State to deny to any person within its jurisdiction the equal protection of the laws, applies to these corporations. We are all of the opinion that it does.” \nFrom there, corporations began to receive the very same Fourteenth Amendment and Bill of Rights protections that had been denied to black Americans, so much so that the eminent legal historian Edward S. Corwin wrote 1909, “This tribunal began a reinterpretation of the Fourteenth Amendment in the light of the principles of Lockian individualism and of Spencerian Laissez Faire , which traverses the results it had previously reached at every point.” Corporate power soared still more in the wake of the Court’s stance, with critics accusing railroad men and other corporate giants of trying to buy the country. \nAnd these corporate protections, wholly extra-Constitutional, continue to be reinforced today. So in Citizens United , when Justice Anthony Kennedy wrote for the majority to grant free speech rights to a corporation established for the sole purpose of trying to buy an election, he was walking in Morrison Waite’s footsteps. Not a particularly exalted place to be. For more stories, like the New Republic on Facebook: Loading Related Articles...", "external_links": [], "published": "2015-10-02T21:26:00.000+03:00", "crawled": "2015-10-02T22:08:56.065+03:00", "highlightTitle": ""}