{"organizations": [], "uuid": "2d8a8d866f9d5f5cec91e81409842499dfd3a00a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.charlotteobserver.com", "main_image": "http://pics.mcclatchyinteractive.com/news/nation-world/national/96phzn/picture40540155/ALTERNATES/LANDSCAPE_1140/House%20Republicans", "site_section": "http://www.charlotteobserver.com/news/politics-government/?widgetName=rssfeed&widgetContentId=8167599&getXmlFeed=true", "section_title": "Politics & Government News | CharlotteObserver.com &", "url": "http://www.charlotteobserver.com/news/politics-government/article40540158.html", "country": "US", "title": "Paul Ryan will run for House Speaker, on one condition", "performance_score": 0, "site": "charlotteobserver.com", "participants_count": 1, "title_full": "Paul Ryan will run for House Speaker, on one condition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:12:00.000+03:00", "replies_count": 0, "uuid": "2d8a8d866f9d5f5cec91e81409842499dfd3a00a"}, "author": "ERICA WERNER \nAssociated Press", "url": "http://www.charlotteobserver.com/news/politics-government/article40540158.html", "ord_in_thread": 0, "title": "Paul Ryan will run for House Speaker, on one condition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 20, 2015 Paul Ryan will run for House Speaker, on one condition \nRep. Paul Ryan, a Wisconsin Republican, says he ‘will be all in’ if various GOP factions agree \nRyan was subject of intense recruiting effort after Kevin McCarthy withdrew Rep. Paul Ryan, R- Wisconsin, leaves his office before a House GOP meeting, Tuesday, Oct. 20, 2015, on Capitol Hill in Washington. The Associated Press reported late Tuesday that Ryan will seek the job of House speaker. Andrew Harnik AP i Order Reprint of this Story WASHINGTON \nRep. Paul Ryan has told House Republicans he will run for House Speaker if he is the unity candidate of the divided party. \nRyan spoke to the House GOP behind closed doors Tuesday and said if all factions can share his vision and he can get the endorsement of the major caucuses, then he will serve as speaker. \nIn a statement released by the Wisconsin congressman, Ryan said he then “will be all in.” \nThe 45-year-old Ryan, under intense pressure to seek the post, gave his colleagues until Friday to express their support. PREVIOUSLY REPORTED \nWith congressional Republicans in crisis, Wisconsin Rep. Paul Ryan made initial forays into the race for speaker on Tuesday, meeting with heads of the hardline faction whose uncompromising demands have created a damaging leadership vacuum in the House. \nRyan’s sitdown with the House Freedom Caucus came ahead of a late-evening meeting of the full Republican conference, the first such gathering following a recess week many spent in a state of suspended animation, waiting to hear from Ryan. \nOutgoing Speaker John Boehner, still hoping to make good on his plans to leave Congress at the end of the month, announced on Fox News Channel that Ryan would have an announcement about his plans later Tuesday evening. \n“I’m not sure what that announcement is going to be, but if he does it, I think he will have the support of the members,” Boehner said. \nRyan’s spokesman, Brendan Buck, cautioned in response that no final decision was expected. But one lawmaker famous for tweeting during past closed-door sessions suggested Ryan was agreeing to run – with conditions. \n“I think we have White smoke, with conditions…. (hash)RunPaulRun,” tweeted Rep. Bill Huizenga, R-Mich. \nRyan, 45, the GOP’s 2012 vice presidential nominee, has consistently said he does not want to be speaker and would prefer to stay on as chairman of the tax-writing Ways and Means Committee, which he’s described as his dream job. \nBut he’s been under heavy pressure to reconsider from Boehner and other party leaders who argue he is the only House Republican with the stature and broad popularity to unite a caucus divided against itself, at a moment of deep turmoil. Congress is hurtling toward an early November deadline to raise the federal borrowing limit or invite a first-ever default, and a deadline to pass spending legislation or risk a government shutdown will follow in early December. \nAnd in a sign that he is exploring the possibility, Ryan met with members of the Freedom Caucus at their request, his spokesman said. This group of three dozen or so hardline conservatives pushed Boehner to announce his resignation by threatening a floor vote on his speakership, and scared off Boehner’s No. 2, Majority Leader Kevin McCarthy, who abruptly withdrew from the speaker’s race just before the recess. \nYet the Freedom Caucus meeting did little to clarify Ryan’s intentions. Rep. Mark Meadows of North Carolina, who was present, said no formal proposals were advanced, and Ryan “didn’t say anything as to whether he’s running or not.” \nAnd other members of the Freedom Caucus said they remained committed to the candidate they endorsed earlier, Rep. Daniel Webster of Florida, a low-key figure who is promising to empower rank-and-file lawmakers by “pushing down” on what he calls the “pyramid of power” in the House. Webster told reporters Tuesday he is staying in the race regardless of Ryan. \nThe leadership turmoil notwithstanding, lawmakers must act by Nov. 3 on the debt limit or face a market-shattering default. And so House GOP leaders also planned to use Tuesday night’s meeting to float a debt limit plan that would link any increase in borrowing authority with deep spending cuts and a vote on a constitutional amendment to require a balanced budget. Such legislation would be certain to draw a White House veto threat and die in the Senate. But it could satisfy demands from conservatives who are loudly protesting the Obama administration’s calls for increasing the debt limit with no strings attached. \nSome of these same conservative elements outside of Congress are on the attack against Ryan, highlighting his support for government bailouts and comprehensive immigration legislation allowing legal status to people in the country illegally. \n“We think Paul Ryan is another example of what’s wrong with Washington, D.C.,” said Jenny Beth Martin, national coordinator of the Tea Party Patriots. “He’s a nice man, but it’s time for someone who is going to be speaker of the House who will disrupt business as usual.” \nYet if Ryan passes on trying for the speaker’s chair, chaos could result. Close to a dozen other lawmakers are declared or potential candidates for the job but it’s not clear if any could attract the needed support. Southern lawmakers met Tuesday to hear from several of these wannabe speakers, but one member in attendance, Rep. Gregg Harper, R-Miss., said only Ryan had the potential to clear the field. \n“He has tremendous standing, people know him,” Harper said. \nRyan did pick up one endorsement Tuesday, but it was probably unwanted. Senate Democratic Leader Harry Reid of Nevada declared himself a fan of Ryan’s and said he hoped he would become speaker. \n“He appears to me to be one of the people over there that would be reasonable; look at some of the other people,” Reid remarked to reporters. When someone noted that an endorsement from Reid, a villain to many Republicans, could hardly help Ryan, Reid shrugged and said: “I just speak the truth.” \n––– \nAssociated Press writers Andrew Taylor and Alan Fram contributed to this report. Related content", "external_links": [], "published": "2015-10-21T03:12:00.000+03:00", "crawled": "2015-10-21T04:14:24.901+03:00", "highlightTitle": ""}