{"organizations": [], "uuid": "3236221b6d055fdbbfa52c29ba4c73fc4e7ef752", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://www.voxy.co.nz/taxonomy/term/3/all/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/proposal-use-npdc-cash-surplus-be-considered/5/234983", "country": "US", "title": "Proposal for use of NPDC cash surplus to be considered", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Proposal for use of NPDC cash surplus to be considered", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:35:00.000+03:00", "replies_count": 0, "uuid": "3236221b6d055fdbbfa52c29ba4c73fc4e7ef752"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/proposal-use-npdc-cash-surplus-be-considered/5/234983", "ord_in_thread": 0, "title": "Proposal for use of NPDC cash surplus to be considered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Wednesday, 21 October, 2015 - 10:35 \nA proposal to use New Plymouth District Council’s operating cash surplus in areas that would otherwise require input from general rates will be considered by the Council next week. \nThe projects include roading repairs following storm damage, preventative maintenance on roads to improve the roading networks’ resilience from future storm damage, replenishing the disaster recovery fund used in the current year as a result of the storm damage, the review of Venture Taranaki Trust (which has previously been approved by the Council), and either the proposed trial of free Saturday parking in New Plymouth’s CBD or debt repayment. \nMayor Andrew Judd says the surplus gives the Council the opportunity carry out work that would otherwise require further rates increases. \n\"We have the opportunity to divert some of these costs from ratepayers,\" says the Mayor. \n\"The roading projects are required to maintain the standard of our roading network. If they are not funded out of the surplus the Council would have to consider a larger than planned rates increase for next year. \n\"Our focus will be on discussing the best use of the surplus for the benefit of our community.\" \nIn its Annual Report 2014/15 the Council reports an operating cash surplus of $1.24 million, or less than one per cent of expenditure. \nNPDC’s Treasury Management Policy enables any surplus to be used to further decrease the annual release from the Perpetual Investment Fund, to repay debt or to fund initiatives that will reduce the demand on rates. \nThe proposed allocation is: \n$377,000 for unfunded storm damage.$200,000 for roading preventative maintenance to improve the resilience of the roading network.$450,000 for the disaster recovery fund, to replenish the fund used in the current year for storm damage$87,000 for the VTT review.$126,000 for the CBD free parking trial (if approved) or the repayment of debt. \nThe extraordinary Council meeting is at 2pm on Wednesday 28 October. \n ", "external_links": [], "published": "2015-10-21T01:35:00.000+03:00", "crawled": "2015-10-21T07:28:11.984+03:00", "highlightTitle": ""}