{"organizations": [], "uuid": "caab857b24c05b313a0580e9898a7f800ea9d056", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "martini.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4288864/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://martini.heraldscotland.com/politics/political_news/13801303.Scottish_council_backs_Jeremy_Corbyn___s_stance_against_ever_firing_nuclear_weapons/?ref=rss", "country": "", "title": "Scottish council backs Jeremy Corbyn’s stance against ever firing nuclear weapons", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Scottish council backs Jeremy Corbyn’s stance against ever firing nuclear weapons", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T02:10:00.000+03:00", "replies_count": 0, "uuid": "caab857b24c05b313a0580e9898a7f800ea9d056"}, "author": "", "url": "http://martini.heraldscotland.com/politics/political_news/13801303.Scottish_council_backs_Jeremy_Corbyn___s_stance_against_ever_firing_nuclear_weapons/?ref=rss", "ord_in_thread": 0, "title": "Scottish council backs Jeremy Corbyn’s stance against ever firing nuclear weapons", "locations": ["Scotland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jeremy Corbyn", "Kezia Dugdale"], "text": "Scottish council backs Jeremy Corbyn’s stance against ever firing nuclear weapons Labour party leader Jeremy Corbyn and Scottish Labour leader Kezia Dugdale in Scotland this week 38 comments \nA Scottish local authority has backed Labour leader Jeremy Corbyn’s stand against ever firing the UK's nuclear weapons. \nNorth Lanarkshire Council supported a motion against Trident's “weapons of death” which, it said, “no rational person would contemplate using”. \nThe new Labour leader faces increasing pressure after he said that if he became Prime Minister he would never deploy the UK's nuclear deterrent. \nLoading article content \nLabour councillor Barry McCulloch said that the council had “backed Mr Corbyn’s view on Trident and nuclear weapons, the first local council in the UK to back Mr Corbyn’s approach”. \nThe SNP, which supported the motion alongside Labour without a vote, is also staunchly opposed to nuclear weapons. \nThe motion also said: “As a member of the Nuclear Free Local Authorities Group, this Council oppose the Tory Government's announcement to renew Trident nuclear weapons.” \nIt added that councillors would write to David Cameron to protest at what they say is the “grossly undemocratic and disrespectful” decision to impose such weapons. \nCouncillors will also call on the Prime Minister to find more productive ways to spend an estimated £100 billion “such as the alleviation of austerity\". Promoted stories \nWhile in Scotland earlier this week Mr Corbyn welcomed support for his position from within Scottish Labour. \nScottish Labour’s deputy leader Alex Rowley has said he hopes his party would oppose the renewal of Trident when members debate the issue next month. \nSupport north of the border could bolster Mr Corbyn’s campaign to change his party policy. \nAt the moment he is at odds with most of his shadow cabinet, including his shadow defence secretary Maria Eagle. \nMr Corbyn has indicated that he had no plans to back down over the issue. \nHe told Labour’s party conference earlier this week that he felt his overwhelming victory in the leadership election had given him a “mandate” on nuclear weapons. \nBut Mr Corbyn faced criticism from within his own front bench for saying he would never countenance the use of Trident. \nA new poll suggests that, just weeks into his new job, Mr Corbyn faces an uphill task in winning over the public. \nThe YouGov survey gave Mr Corbyn a -8 approval rating, compared to Ed Miliband’s +26 after he became Labour leader in 2010. \nThe poll also indicated that a majority of the public, 71 per cent, think Labour need to make \"major changes\" to its policies and beliefs in order to win the 2020 General Election. \nYouGov boss Peter Kellner commented: \"Most Opposition leaders start with voters giving them the benefit of the doubt. Few are giving Mr Corbyn that.\" \nMeanwhile, a Labour donor has called on Mr Corbyn to confirm his belief in the state of Israel. Share article \nMichael Foster heckled Mr Corbyn when he spoke to a Labour Friends of Israel event at the Labour conference. \nMr Foster said: \"I don't think for one moment that Jeremy is anti-Semitic, the problem is he has made no qualification. ... My challenge to Jeremy Corbyn is that, if you Jeremy, believe in the state of Israel, say the word Israel, say that you recognise Israel and that you believe in it.\" Promoted Stories", "external_links": [], "published": "2015-10-03T02:10:00.000+03:00", "crawled": "2015-10-09T08:40:59.207+03:00", "highlightTitle": ""}