{"organizations": [], "uuid": "0636251a63aff20f6e47cc7f3cb5056148a10ac5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/169585/ap-political-news-video", "section_title": "AP Political Video - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30245183/absent-legislation-nyc-to-improve-nuts-and-bolts-of-bail", "country": "US", "title": "Absent legislation, NYC to improve nuts-and-bolts of bail", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Absent legislation, NYC to improve nuts-and-bolts of bail - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "0636251a63aff20f6e47cc7f3cb5056148a10ac5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30245183/absent-legislation-nyc-to-improve-nuts-and-bolts-of-bail", "ord_in_thread": 0, "title": "Absent legislation, NYC to improve nuts-and-bolts of bail", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JAKE PEARSON\nThe Associated Press NEW YORK (AP) - In the absence of statewide bail reform laws, New York City officials are looking for practical fixes they can put in place now to help the 50,000 people sent to jail every year because they can't afford bail money.\nAmong the changes to be announced Tuesday: streamlining the current 65-page form authorizing credit card bail and better coordinating the bus schedule from courthouses to Rikers Island jail so defendants have more time to post bail.\n\"We can't wait for the legislative change,\" said Elizabeth Glazer, Mayor Bill de Blasio's criminal justice coordinator. \"We have a system that we sort of have to fix. But to fix it, we need to understand what makes the system tick.\"\nUnlike in most states, judges in New York must only take into account a defendant's risk of flight, not his threat to public safety, in determining bail. The use of money bail is intended to make sure a defendant doesn't skip court dates but has been criticized for holding pretrial detainees, sometimes for years, simply because they're too poor to post bail.\nCalling the current system unfair, the state's chief judge announced earlier this month he was ordering the judiciary to take administrative steps to change how bail is set, including a review of bail conditions in recent cases and encouraging judges to use other types of bonds besides cash.\nAnd earlier this year, city officials said cash bail would be replaced for about 3,000 low-risk defendants with other supervised options, including text-message reminders and regular check-ins.\nBut Glazer said the city's initiative to study and then correct different facets of the justice system that govern the way bail is posted, dubbed the Bail Lab, is intended to inject more science, and less guesswork, into the system.\n\"While we have a system of money bail the fundamental question we have to ask is, 'What makes someone return to court?'\" said Glazer, adding that a website for the public and experts alike to crowdsource ideas launches on Tuesday.\nOfficials have already discovered some bureaucratic workarounds that could streamline the number of people held behind bars while pulling together enough money to post bail.\nBesides shortening the credit card bail form and coordinating the jail bus schedule, officials say modernizing the archaic process by which inmates can access money in their commissary account toward bail is essential.\nWhile a family member can put bail money into an inmate's commissary account online, using that bail money requires jail officials to physically fax authorization forms from a central intake facility to housing dorms - a process that can take up to six hours to complete. About 77 percent of those held on bail at arraignment are able to post bail within a week of being jailed, according to court statistics.\nIn New York City most people who are arrested are released on their own recognizance or their cases are disposed. But of the 14 percent who are jailed on bail, only nine and 12 percent of misdemeanor and felony defendants respectively post bail at arraignment, according to court statistics.\nReforming the state's bail system has gained increased traction following the June suicide of Kalief Browder, who was 16-years-old when he was arrested on suspicion of stealing a backpack and sent to Rikers for three painful years before his case was dropped. His bail was set at $3,000.\n ", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T09:39:01.322+03:00", "highlightTitle": ""}