{"organizations": [], "uuid": "ba6ccb790302e15e32959efd2250a6badc261af3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/jsnews/images/columns/joeconason.jpg", "site_section": "http://www.arcamax.com/politics/", "section_title": "Politics | ArcaMax Publishing", "url": "http://www.arcamax.com/politics/fromtheleft/joeconason/s-1735434?fs", "country": "US", "title": "Is Benghazi the Real Motive Behind Jason Chaffetz's Bid for House Speaker? | Joe Conason | Columns", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Is Benghazi the Real Motive Behind Jason Chaffetz's Bid for House Speaker? | Joe Conason | Columns | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba6ccb790302e15e32959efd2250a6badc261af3"}, "author": "arcamax.com", "url": "http://www.arcamax.com/politics/fromtheleft/joeconason/s-1735434?fs", "ord_in_thread": 0, "title": "Is Benghazi the Real Motive Behind Jason Chaffetz's Bid for House Speaker? | Joe Conason | Columns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Notable among Rep. Trey Gowdy's many egregious abuses of power as chair of the House Select Committee on Benghazi was his manic grilling of witness Sidney Blumenthal about Media Matters for America -- which had everything to do with politics and Hillary Clinton and nothing to do with the tragic events of Sept. 11, 2012.\nAs Gowdy's pal Jason Chaffetz mounts a rump campaign for House Speaker against inadvertent truth-blurter Kevin McCarthy, that episode behind closed doors on Capitol Hill may have fresh significance. As he acknowledged in yesterday's Washington Post, Gowdy remains furious with McCarthy for his now-infamous boast to Sean Hannity about the political motivations behind the committee's long, expensive, redundant \"investigation\" (at least the eighth probe of the deaths of Ambassador Chris Stevens and three American colleagues in Benghazi):\n\"I heard from him at 6 a.m. the next morning. ... How many times can somebody apologize? Yes, he's apologized as many times as a human can apologize. It doesn't change it. It doesn't fix it.\n\"Kevin is a friend, which makes the disappointment, frankly, even more bitter. If faith tells you to forgive somebody... It's tough.\"\nPerhaps Gowdy is unable to forgive the blabbermouth McCarthy for ruining his charade -- and perhaps he and his friend Chaffetz now think McCarthy is not quite bright enough to lead the House.\nIn that vein, it is worth nothing that according to my sources, Gowdy asked Blumenthal dozens of specific questions about a series of Media Matters posts that embarrassed Chaffetz in 2012 -- one of which called attention to the hypocrisy of the Utah Republican for attacking Clinton and President Obama on Benghazi when he had voted to cut funding for embassy security. (Politico reported this line of questioning last June, but only mentioned the chairman by name once.)\nAnxious to learn who wrote those mean posts about Chaffetz, Gowdy asked Blumenthal why he had called attention to them in an email to Clinton, and much more -- even though none of those protected First Amendment activities bore the slightest relevance to the supposed concerns of the committee he chairs.\nSo is Chaffetz now running against McCarthy to avenge the infuriated Gowdy? He has denied it emphatically, which is only another reason to think it may be true.\n===", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T07:37:18.572+03:00", "highlightTitle": ""}