{"organizations": ["Ivanka Trump Collection", "Development and Acquisitions The Trump Organization"], "uuid": "f4d2590a7ca5911f130ae97c14791cdcf279c54a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wmbfnews.com", "main_image": "http://images.worldnow.com/AP/images/9014296_G.jpg", "site_section": "http://www.wmbfnews.com/Global/category.asp?C=146173&clienttype=rss", "section_title": "WMBF - News - Politics", "url": "http://www.wmbfnews.com/story/30259480/ivanka-trump-dad-disrupting-2016-race-in-positive-way", "country": "US", "title": "Ivanka Trump: Dad disrupting 2016 race in 'positive way'", "performance_score": 0, "site": "wmbfnews.com", "participants_count": 0, "title_full": "Ivanka Trump: Dad disrupting 2016 race in 'positive way'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:57:00.000+03:00", "replies_count": 0, "uuid": "f4d2590a7ca5911f130ae97c14791cdcf279c54a"}, "author": "", "url": "http://www.wmbfnews.com/story/30259480/ivanka-trump-dad-disrupting-2016-race-in-positive-way", "ord_in_thread": 0, "title": "Ivanka Trump: Dad disrupting 2016 race in 'positive way'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Donald Trump", "Kaster", "Ivanka Trump"], "text": "Ivanka Trump: Dad disrupting 2016 race in 'positive way' - WMBFNews.com, Myrtle Beach/Florence SC, Weather Member Center: Shop 84300 Ivanka Trump: Dad disrupting 2016 race in 'positive way' (AP Photo/Carolyn Kaster). Ivanka Trump, daughter of Republican presidential candidate Donald Trump, founder and CEO, Ivanka Trump Collection and executive vice president Development and Acquisitions The Trump Organization, speaks at the Fortune Most P... (AP Photo/Carolyn Kaster). Ivanka Trump, daughter of Republican presidential candidate Donald Trump, founder and CEO, Ivanka Trump Collection and executive vice president Development and Acquisitions The Trump Organization, speaks at the Fortune Most P... \nWASHINGTON (AP) - Ivanka Trump says she's \"incredibly proud\" of her dad for running for president. But she's more ambivalent about whether she's happy about it. \nTrump's oldest daughter appeared at a Fortune magazine forum on Thursday. She was asked if she's happy about Donald Trump's presidential bid. \nShe called that \"a complicated question.\" \nTrump went on to say that as a citizen, she loves what her father is doing. But she added that as a daughter, \"it's obviously more complicated\" because of the intense level of scrutiny her father is facing. \nTrump said her father was changing the dialogue of the presidential race and, in her words, \"disrupting the process in a very positive way.\"   Updated: Wednesday, October 14 2015 11:57 AM EDT 2015-10-14 15:57:13 GMT A small plane plunged into a Florida mobile home park, churning up flames and a column of black smoke, and authorities said they rushed to check for an \"unknown number of victims\" in the chaotic aftermath. More >> A small plane crashed into a mobile home park and set two homes on fire, killing the pilot and a 21-year-old woman who was inside one of the homes, investigators and a relative said Wednesday. More >> The Latest: Lamar Odom hospitalized with ex by his side The latest on the hospitalization of Lamar Odom, who was found unconscious in a Nevada brothel (all times local): More >> The latest on the hospitalization of Lamar Odom, who was found unconscious in a Nevada brothel (all times local): More >> Police: Daycare owner was attacked while protecting kids A Montana daycare owner was punched and hit in the face with a shovel after refusing to hand three young siblings to their father, who was drunk and lacks legal custody, authorities said. More >> A Montana daycare owner was punched and hit in the face with a shovel after refusing to hand three young siblings to their father, who was drunk and lacks legal custody, authorities said. More >> Freddie Gray hearing: Officer's 2 statements admissible The statements two Baltimore police officers made to investigators probing the death of Freddie Gray can be used at the officers' trials, a judge ruled Tuesday. More >> The statements two Baltimore police officers made to investigators probing the death of Freddie Gray can be used at the officers' trials, a judge ruled Tuesday. More >>", "external_links": [], "published": "2015-10-14T18:57:00.000+03:00", "crawled": "2015-10-14T19:02:30.372+03:00", "highlightTitle": ""}