{"organizations": [], "uuid": "196ac3659629363a92fc35298e86160c200fced0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30164056/syngenta-and-informs-announce-new-crop-challenge-award-in-analytics-operations-research", "country": "US", "title": "Syngenta and INFORMS Announce New Crop Challenge Award in Analytics, Operations Research", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Syngenta and INFORMS Announce New Crop Challenge Award in Analytics, Operations Research - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "196ac3659629363a92fc35298e86160c200fced0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30164056/syngenta-and-informs-announce-new-crop-challenge-award-in-analytics-operations-research", "ord_in_thread": 0, "title": "Syngenta and INFORMS Announce New Crop Challenge Award in Analytics, Operations Research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " INFORMS\nApplying Analytics Innovation to Address Worsening Worldwide Hunger\nCATONSVILLE, Md. , Oct. 1, 2015 /PRNewswire-USNewswire/ -- The Institute for Operations Research and the Management Sciences ( INFORMS ), the leading professional association in analytics and operations research, and Syngenta , announce a new, joint award, the Syngenta Crop Challenge, which will focus on ways that analytics can address the problem of feeding millions of people throughout the world who face hunger every day.\nDetails about the award, a collaboration between Syngenta and the INFORMS Analytics Section , are at http://www.ideaconnection.com/syngenta-crop-challenge/ .\n\"This new competition will give our members the chance to apply their considerable talent in analytics to the terrible worldwide problem of hunger and poverty,\" says Glenn Wegryn , President of the INFORMS Analytics Section and Executive Director of the Center for Business Analytics at the University of Cincinnati Carl H. Lindner College of Business.\nThe INFORMS Analytics Section , comprising academics and practitioners, promotes the integration of a wide range of analytical techniques and supports activities that illuminate significant innovations and achievement in the growing field of analytics.\nNearly 7 million hectares of farmland are lost to soil erosion every year. Many people who produce the world's food are living in poverty. Biodiversity is disappearing fast. And the challenge won't get any easier: by 2050, for example, 4 billion people will be living in countries with water scarcity.\n\"At Syngenta, we bring plant potential to life by supporting farmers in the field with the very best seed trait, crop protection and seed treatment technology in industry,\" said Joseph Byrum , Syngenta head of soybean seeds product development and leader of the Syngenta Crop Challenge. \"Our commitment to innovation is unrivaled in the industry. We're fundamentally transforming agricultural productivity through the use of operations research, as evidenced by our Edelman win , and we're looking for exceptional talent to work with us through this challenge.\"\nEach year, farmers have to make decisions about what crops to plant given uncertainties in expected weather conditions and knowledge about the soil at their respective farms. These decisions have important impacts; an unusual weather pattern can have disastrous impacts on crops, but planting to hedge against stressful weather patterns can dramatically reduce yields in normal years.\nHow can a farmer make seed variety decisions that optimally reduce risk and increase yield?\nThis is a question that experts in analytics and operations research can address by competing to win the new Syngenta Crop Challenge.\nCase details will be announced at the 2015 INFORMS Annual Meeting in Philadelphia , which takes place November 1-4. Teams must submit their report by January 2016 . Finalists will be announced in March 2016 . Finalists will make their presentation at the INFORMS Conference on Business Analytics and Operations Research in Orlando, Florida , which takes place April 10-12, 2016 .\nThe winner of the first competition will be announced at the 2016 INFORMS Annual Meeting and receive a $5,000 prize.\nMore information is at http://www.ideaconnection.com/syngenta-crop-challenge/ .\nAbout INFORMS\nINFORMS is the leading international association for professionals in analytics and operations research (O.R.). INFORMS advances research, and develops and promotes best practices in analytics and O.R. through collaboration, knowledge sharing, and professional development. INFORMS helps business, government, and other organization professionals make better decisions to drive value to their organizations and society. Our certification program ( CAP ®), highly cited publications, educational meetings and conferences, continuing education, industry and process-focused networking communities, competitions, and recognition provide professionals with the knowledge and connections they need to achieve ever greater value for their organizations. Further information about INFORMS, analytics, and operations research is at www.informs.org or @informs .\nAbout Syngenta\nSyngenta is a leading agriculture company helping to improve global food security by enabling millions of farmers to make better use of available resources. Through world class science and innovative crop solutions, our 28,000 people in over 90 countries are working to transform how crops are grown. We are committed to rescuing land from degradation, enhancing biodiversity and revitalizing rural communities. To learn more visit www.syngenta.com and www.goodgrowthplan.com . Follow us on Twitter® at www.twitter.com/Syngenta and www.twitter.com/SyngentaUS .\nPhoto - http://photos.prnewswire.com/prnh/20151001/273112\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/syngenta-and-informs-announce-new-crop-challenge-award-in-analytics-operations-research-300152777.html\n ", "external_links": ["http://www.syngenta.com/", "http://photos.prnewswire.com/prnh/20151001/273112", "http://www.xmlnews.org/ns/", "https://twitter.com/INFORMS", "http://www.prnewswire.com/news-releases/syngenta-and-informs-announce-new-crop-challenge-award-in-analytics-operations-research-300152777.html", "http://meetings2.informs.org/wordpress/philadelphia/", "http://www.goodgrowthplan.com/", "http://www.syngenta.com/global/corporate/en/Pages/home.aspx", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC17579&Transmission_Id=201510011300PR_NEWS_USPR_____DC17579&DateId=20151001", "http://www.twitter.com/SyngentaUS", "http://www.ideaconnection.com/syngenta-crop-challenge/", "https://www.certifiedanalytics.org/", "http://www.twitter.com/Syngenta", "https://www.linkedin.com/in/josephbyrumchiefinnovator", "https://photos.prnewswire.com/prnvar/20151001/273112", "https://www.informs.org/Community/Analytics", "https://www.informs.org/About-INFORMS/News-Room/Press-Releases/2015-Edelman-Award-Winner-Syngenta", "http://www.informs.org/"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-01T21:48:59.800+03:00", "highlightTitle": ""}