{"organizations": [], "uuid": "a141bcf236c85d03dcbe625db883576003321516", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9090437_G.jpg", "site_section": "http://www.cbs8.com/category/154657/politics", "section_title": "Politics - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30339686/gop-dems-moving-in-opposite-directions-after-a-pivotal-week", "country": "US", "title": "GOP, Dems moving in opposite directions after a pivotal week", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "GOP, Dems moving in opposite directions after a pivotal week - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "a141bcf236c85d03dcbe625db883576003321516"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30339686/gop-dems-moving-in-opposite-directions-after-a-pivotal-week", "ord_in_thread": 0, "title": "GOP, Dems moving in opposite directions after a pivotal week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By STEVE PEOPLES and LISA LERER\nAssociated Press WASHINGTON (AP) - After a pivotal week, the presidential race has become a tale of two parties on sharply different trajectories: Hillary Rodham Clinton has tightened her grip on the Democratic nomination while Republican concern is reaching new heights. Some officials are even considering what could turn into a GOP civil war to stop Donald Trump - with no fallback option.\nClinton took what was essentially a victory lap on Friday, cheered by excited Democrats a day after her strong performance during an 11-hour Republican-led probe of the 2012 Benghazi attacks. The former secretary of state's high marks for the congressional hearing capped a week in which three of her five Democratic rivals bowed out of the race - none more important than Vice President Joe Biden, who said he wouldn't be getting in.\n\"She's gone in the course of two weeks from being a wobbly front-runner to the almost-certain nominee,\" said Fergus Cullen, a former New Hampshire Republican Party chairman. The GOP field, Cullen said, is more splintered than ever.\nAs Democrats showered a confident Clinton with fresh praise, one-time Republican front-runner Jeb Bush announced deep cuts to his campaign staff. The former Florida governor slashed the payroll by 40 percent and downsized his Miami headquarters in a move that sounded alarms for GOP officials who long assumed Bush would shake off his slow start and ultimately emerge as their party's nominee.\nThe fresh evidence of Bush's struggles only darkened the clouds of uncertainty over the party's field.\nSome Republicans have intensified calls for an organized campaign to take down their dominant candidate, Trump, fearing the tough-talking reality television star is doing lasting damage to the GOP's standing among women and minority voters - Hispanics in particular - heading into 2016.\nThe Club for Growth, an influential Washington-based group focused on fiscal conservatism, seized on fresh polls in Iowa suggesting that Trump's front-runner status could be in jeopardy.\n\"Trump loses when voters know the truth about him,\" Club president David McIntosh said Friday, noting that his group recently spent $1 million on anti-Trump television ads. \"He's not a conservative, and he's really just the worst kind of politician.\"\nYet Trump remains atop most Republican polls. And with Bush's struggles, it's unclear who would take the billionaire businessman's place if he should fall. Several candidates have been stuck for months in the single digits of polling - among them, Florida Sen. Marco Rubio, Texas Sen. Ted Cruz, New Jersey Gov. Chris Christie and Ohio Gov. John Kasich.\n\"At this point there's no singular alternative to Trump,\" said Republican donor Fred Malek, adding that the state of affairs is \"very concerning\" roughly three months before the Iowa caucuses.\nMalek's hope: \"Someone will have a breakthrough moment and catch a little bit of fire and get that bounce in support. When we have one clear alternative to Trump, that person will go on to win.\"\nDespite no political experience, retired neurosurgeon Ben Carson is making an argument to be that person. His campaign manager, Barry Bennett, told The Associated Press Friday that Carson's campaign raised $10 million in October alone - a new mark of fundraising success that makes Carson the envy of many Republican rivals.\nAnd as Republicans fight among themselves, Clinton appears to be getting stronger.\nSupporters who met with her privately during a Friday appearance at the Women's Leadership Forum said she laughed when they advised her to go home and get some rest.\n\"She was glowing,\" said Pamela Eakes, a Clinton donor from Seattle. \"We're grateful to Republicans for giving her the best week ever.\"\nThe Benghazi hearing came in the midst of a major political winning streak for Clinton.\nHer poll numbers in early voting states are rebounding after her commanding performance in the first Democratic debate. Biden decided against a 2016 run, removing a major threat. And two of her other challengers, former Virginia Sen. Jim Webb and former Rhode Island Gov. Lincoln Chafee, dropped out this week.\nClinton on Friday also won the endorsement of the 1.6 million-member American Federation of State, County and Municipal Employees.\n\"Obviously it's a good week for Secretary Clinton,\" Chafee said Friday shortly after announcing his departure from the race. \"It's time to move on and support the party any way I can.\"\nClinton aides tried to downplay her winning streak, stressing that capturing the Democratic primary nomination will still require a lot of work. But, they said, her strong performance in both the debate and her congressional testimony showed off her foreign policy credentials and command of the issues for a broader audience.\nClinton's surge has resurrected dismissive Republican talk that the Democratic contest is simply \"a Clinton coronation.\"\nYet there is little doubt the Republicans would love the certainty that Democrats now enjoy. And in the meantime, the intraparty divide between the GOP's own establishment and anti-establishment wings grows deeper.\nRepublican factions on Capitol Hill appear to have unified behind Wisconsin Rep. Paul Ryan for House speaker, but that's likely to have little impact on the party's political success in 2016. And Democrats suggest that the ongoing Benghazi investigation, at least for now, has helped rather than hurt Clinton's presidential ambitions.\n\"You watch that yesterday and you say this woman should be president of America,\" Virginia Gov. Terry McAuliffe said after a Clinton appearance on Friday. \"We'll let the Republicans keep doing what they're doing.\"\n___\nLerer reported from Alexandria, Va. AP writers Julie Bykowicz in Washington and Jill Colvin in Newark, N.J. contributed to this report.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T12:57:08.068+03:00", "highlightTitle": ""}