{"organizations": [], "uuid": "6dcab66e7700607cadc9374a8f10957f30d0d702", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "https://d1u4oo4rb13yy8.cloudfront.net/a031d9b6-5a87-4b4a-af31-3cca71379ad1.jpg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/763857/the-daily-fix-arun-jaitley-says-intolerance-is-wrong-especially-if-its-from-the-shiv-sena", "country": "SG", "title": "The Daily Fix: Arun Jaitley says intolerance is wrong – especially if it's from the Shiv Sena", "performance_score": 0, "site": "scroll.in", "participants_count": 1, "title_full": "The Daily Fix: Arun Jaitley says intolerance is wrong – especially if it's from the Shiv Sena", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T12:29:00.000+03:00", "replies_count": 0, "uuid": "6dcab66e7700607cadc9374a8f10957f30d0d702"}, "author": "Rohan Venkataramakrishnan", "url": "http://Scroll.in/article/763857/the-daily-fix-arun-jaitley-says-intolerance-is-wrong-especially-if-its-from-the-shiv-sena", "ord_in_thread": 0, "title": "The Daily Fix: Arun Jaitley says intolerance is wrong – especially if it's from the Shiv Sena", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Daily Fix: Arun Jaitley says intolerance is wrong – especially if it's from the Shiv Sena Everything you need to know for the day (and a little more). Above the Fold: Top stories of the day1. Pakistan has admitted that it has developed short-range nuclear weapons to \" deter India \".2. The government is set to tell the Supreme Court that its criteria for picking other judges should be in the public domain .3. At least nine people have been killed after a bus rammed into a lorry near Tirruchirapalli in Tamil Nadu. The Big Story: Street Politics Finance Minister Arun Jaitley has spoken up about recent incidents of intolerance and violence saying all \" right-thinking sections \" disapproved of this trend. Jaitley claimed that the Bharatiya Janata Party had hauled up its own leaders for contributing to the trend, although he only made a reference to \"three gentlemen\" being spoken to by the party president, and insisted that he was outright against intolerance.His reluctance to name the people involved didn't however extend to the BJP's ally in Maharashtra, the Shiv Sena, which has of late forced the cancellation of a Pakistani singer's concerts in Mumbai and Pune, thrown paint at the organiser of a book event involving a former Pakistani diplomat and then had its hooligans break into the cricket board office to ensure that no India-Pakistan cricket series can be considered.\"Issues like relations with neighbouring countries will have to be conducted on the basis of a very well thought-out strategy. They can’t be conducted in a manner on the streets itself,\" Jaitley said. \"I think it is extremely important that every political party, including my friends in the Shiv Sena, realise the importance of this.\" Politiciking and Policying 1. Punjab police claim to have cracked one out of seven cases of the alleged desecration of the Sikh holy book that has led to agitation and violence in the state. 2. The Bombay High Court has given a month to Sohrabuddin Shaikh's brother to consider whether he really wants to withdraw petition challenging BJP President Amit Shah's discharge in an alleged fake encounter case. 3. Patidar leader Hardik Patel has been remanded to police custody until October 23 in the sedition case against him. Punditry 1. TR Andhyarujina in the Indian Express calls the Supreme Court's NJAC verdict a \"legal innovation\" to allow it the power to appoint judges on its own. 2. Arvind Kejriwal's recent plans to crack down on sexual crimes ignores teenage sexuality and could cause more problems than it fixes, writes Rukmini S. in the Hindu .3. Make in India is all well and good, writes Subir Roy in the Business Standard , but India should not turn into the world's low-cost assembly line .  ", "external_links": [], "published": "2015-10-21T12:29:00.000+03:00", "crawled": "2015-10-21T07:56:02.168+03:00", "highlightTitle": ""}