{"organizations": [], "uuid": "13b9753a1e77f104cddd77b94e3195441c53634e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.southcoasttoday.com", "main_image": "http://www.southcoasttoday.com/storyimage/NB/20151013/NEWS/151019753/AR/0/AR-151019753.jpg", "site_section": "http://www.southcoasttoday.com/politics?template=rss&mime=xml", "section_title": "Politics - southcoasttoday.com", "url": "http://www.southcoasttoday.com/article/20151013/NEWS/151019753/101081?rssfeed=true", "country": "US", "title": "Voter turnout the lowest in New Bedford's North End", "performance_score": 0, "site": "southcoasttoday.com", "participants_count": 1, "title_full": "Voter turnout the lowest in New Bedford's North End", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T02:21:00.000+03:00", "replies_count": 0, "uuid": "13b9753a1e77f104cddd77b94e3195441c53634e"}, "author": "Mike Lawrence mlawrence@s-t.com", "url": "http://www.southcoasttoday.com/article/20151013/NEWS/151019753/101081?rssfeed=true", "ord_in_thread": 0, "title": "Voter turnout the lowest in New Bedford's North End", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW BEDFORD Voter turnout the lowest in New Bedford's North End Wards 2, 3 had lowest participation in Oct. 6 prelim; registration deadline Wednesday to vote Nov. 3 Comment Posted Oct. 13, 2015 at 6:01 PM By Mike Lawrence Posted Oct. 13, 2015 at 6:01 PM » RELATED CONTENT • Dana Rebeiro, Joseph Fortes to face off in New Bedford's Ward 4 on Nov. 3... » Social News NEW BEDFORD — The citywide low turnout in the Oct. 6 preliminary election was especially poor in the North End, where Wards 2 and 3 had the lowest participation by percentage among New Bedford’s six wards. “I think that when voting time comes, people want to come out and vote for a reason,” said Ward 2 City Councilor Steven Martins, citing the sole contested ward race, in Ward 4, and an at-large race that saw just one candidate eliminated in the preliminary. “There wasn’t much talk about the election, there wasn’t much on the ballot (for Ward 2 voters),” added Martins, who is unopposed in his re-election bid. Local election officials, politicians and civic leaders are hoping apathy turns to advocacy in the next three weeks, ahead of the Nov. 3 general election. “I would expect that the voter turnout in November will be a lot stronger because of the finals in the mayor’s race, the finals in the School Committee,” said City Council President Brian K. Gomes, the top vote-getter among the 11 candidates in the Oct. 6 preliminary. Wednesday is the deadline for unregistered voters to register for Nov. 3, or for registered voters to notify city election officials of a change of name or address. The election office, on the first floor of City Hall at 133 William St., will be open until 8 p.m. Wednesday to help people register. People with a Massachusetts driver’s license or state ID card also can register and change their address online, through the secretary of state’s website at www.sec.state.ma.us . New Bedford voters will decide mayoral, School Committee, City Council and assessor races Nov. 3. The New Bedford Educators Association will host a debate for the six School Committee candidates at 6 p.m. Wednesday at the New Bedford Whaling Museum, at 18 Johnny Cake Hill downtown. The AJ Gomes Neighborhood Association will host a debate for council and mayoral candidates from 6 to 9 p.m. Oct. 27, at the Alfred J. Gomes School on South Second Street. The SouthCoast Alliance is planning a debate for Oct. 28 at the Zeiterion Performing Arts Center, at a time to be determined. Sponsors include Fun 107, The Standard-Times, the Community Foundation, the Women's Fund of Southeastern Mass. and United Way of Greater New Bedford. New Bedford residents with voting- or registration-related questions can call the city’s election office at 508-979-1420. Follow Mike Lawrence on Twitter @MikeLawrenceSCT . By Mike Lawrence", "external_links": [], "published": "2015-10-14T02:21:00.000+03:00", "crawled": "2015-10-14T03:17:12.413+03:00", "highlightTitle": ""}