{"organizations": [], "uuid": "0862afe3b8640d947c5e15ef1cc1432b63bd1223", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/9022623_G.jpg", "site_section": "http://www.cbs8.com/category/169585/ap-political-news-video", "section_title": "AP Political Video - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30268651/hastert-attorney-says-former-speaker-intends-to-plead-guilty", "country": "US", "title": "Hastert attorney says former speaker intends to plead guilty", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hastert attorney says former speaker intends to plead guilty - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "0862afe3b8640d947c5e15ef1cc1432b63bd1223"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30268651/hastert-attorney-says-former-speaker-intends-to-plead-guilty", "ord_in_thread": 0, "title": "Hastert attorney says former speaker intends to plead guilty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MICHAEL TARM\nAssociated Press CHICAGO (AP) - An attorney for Dennis Hastert told a federal judge Thursday that the former House speaker intends to plead guilty in a federal hush-money case.\nJohn Gallo said during a brief hearing that he expects to have a written plea agreement by Monday. And he asked the judge to set a date for a change of plea. The judge scheduled an Oct. 28 hearing.\nGallo did not mention any of the terms, including what counts Hastert would plead guilty to.\nA plea deal would avert a trial and help keep any potentially embarrassing secrets quiet.\nThe 73-year-old Illinois Republican is charged with breaking banking laws and lying to the FBI in efforts to pay someone $3.5 million to hide claims of past misconduct.\nThe Associated Press and other media, citing anonymous sources, have reported the payments were meant to conceal claims of sexual misconduct decades ago.\nHastert allegedly structured cash withdrawals in increments of just under $10,000 to avoid financial reporting rules and then lied to the FBI about the reason for the withdrawals. Investigators have said Hastert withdrew about $1.7 million.\nWhen Hastert was charged in May, the indictment noted that he had been a longtime high school teacher and wrestling coach in Yorkville, west of Chicago, suggesting the charges are linked to that history.\nBoth defense attorneys and prosecutors have successfully kept details of the underlying allegations under wraps so far.\n___\nAssociated Press Writer Eric Tucker in Washington, D.C., contributed to this report.\n___\nFollow Michael Tarm on Twitter at http://twitter.com/mtarm .\n ", "external_links": ["http://twitter.com/mtarm"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T17:45:12.317+03:00", "highlightTitle": ""}