{"organizations": [], "uuid": "2138958d1f989bed9c18665758736418ec7aee05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-2098be1c35d932d14dbe03579899bfda.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/ten-days-later-gop-no-closer-on-a-speaker-candidate/article/2574455?custom_click=rss", "country": "US", "title": "Ten days later, GOP no closer on a speaker candidate", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Ten days later, GOP no closer on a speaker candidate | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:01:00.000+03:00", "replies_count": 0, "uuid": "2138958d1f989bed9c18665758736418ec7aee05"}, "author": "Susan Ferrechio", "url": "http://www.washingtonexaminer.com/ten-days-later-gop-no-closer-on-a-speaker-candidate/article/2574455?custom_click=rss", "ord_in_thread": 0, "title": "Ten days later, GOP no closer on a speaker candidate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After 10 days away from Washington, House Republicans will return to work on Tuesday no closer to finding a new speaker than when they left on Oct. 9.\nWhen they left, Republican hopes were pinned on House Ways and Means Committee Chairman Paul Ryan, R-Wis., who was talked into reconsidering his firm decision not to run for speaker. But as of Monday, Ryan appeared no closer a decision to run for the top post.\n\"Congressman Ryan spent the weekend at home with his family. There is no update, and he looks forward to listening to and speaking with his colleagues this week,\" said his spokesman, Brendan Buck.\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ Ryan is said to be interested in the job only if he can have it without trading off power with a faction of about 40 House conservatives who would be needed to elect him in a floor vote.\n  Experts predict Kunduz bombers won't get jail time But they say  \nBy Jacqueline Klimas • 10/20/15 12:01 AM The conservatives are demanding rules changes that would end the \"top down\" approach that typifies how House leadership operates. Rules Committee Chairman Pete Sessions, R-Texas, and a trio of GOP lawmakers will begin examining the rules on Tuesday in search of changes that can mollify conservatives.\nIf Ryan doesn't run for the job, a slate of other Republicans are ready to seek election, including Rep. Bill Flores, R-Texas, who heads the Republican Study Committee, a group of about 180 Republicans.\nBut it's not clear whether Flores or other candidates, including House Oversight Committee Chairman Jason Chaffetz, R-Utah, can win 218 floor votes needed to secure the speaker's gavel.\nWith no apparent front-runner, some lawmakers are proposing an election brokered with Democrats, who would provide the votes needed for a GOP speaker who could not win enough support from the conservative faction.\n\"I think in our caucus there is interest and support, there's an openness to a bipartisan approach to this,\" House Minority Leader Nancy Pelosi, D-Calif., said Saturday at a Texas Tribune Festival forum, according to conservativehq.com.\nAlso from the Washington Examiner RNC raises $25 million in third quarter Fundraising haul resulted in the best third quarter in the history of the committee for a non-election year.\nBy David M. Drucker • 10/20/15 12:01 AM But an aide said Pelosi was merely reporting that some in her party have expressed an openness to helping the GOP elect a speaker.\n\"There have been no conversations with Republicans or in our Caucus about the idea,\" the aide said. \"We do not see the Republican Conference being open to this idea.\"\nModerate Republicans suggested a bipartisan election of the speaker after Majority Leader Kevin McCarthy, R-Calif., dropped out of the speaker's race after suggesting he could not win enough votes within the GOP conference.\nRep. Charlie Dent, R-Pa., told the Washington Examiner the GOP should \"marginalize\" its right faction by working with the Democrats.\n\"We need a bipartisan coalition to pass legislation right now,\" Dent said. \"We may need a bipartisan coalition to elect the next speaker. That's the reality.\"\nAlso from the Washington Examiner States ready to sue as Obama climate plan nears final stage Critics of the EPA plan say the administration is stalling publishing the rule in the Federal Register.\nBy John Siciliano • 10/20/15 12:01 AM House Speaker John Boehner, R-Ohio, still plans to retire on Oct. 30, according to his aides, although he has pledged to remain on the job if no successor is elected by that date. But with just ten days left before his initial deadline, Boehner might be stuck with the gavel for a bit longer.\nTop Story GOP establishment readies for war against Trump That  \nBy Byron York • 10/19/15 6:02 PM", "external_links": [], "published": "2015-10-20T03:01:00.000+03:00", "crawled": "2015-10-20T10:58:26.235+03:00", "highlightTitle": ""}