{"organizations": [], "uuid": "ac6071a818da1911454e8bd8eefa9adcc61146ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://washingtontimes.com/rss/headlines/news/politics/", "section_title": "www.washingtontimes.com stories: Politics", "url": "http://www.washingtontimes.com/news/2015/sep/30/law-enforcement-agency-pulls-examiners-out-license/", "country": "US", "title": "Law enforcement agency pulls examiners out license offices", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Law enforcement agency pulls examiners out license offices", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T01:03:00.000+03:00", "replies_count": 0, "uuid": "ac6071a818da1911454e8bd8eefa9adcc61146ab"}, "author": "KIM CHANDLER", "url": "http://www.washingtontimes.com/news/2015/sep/30/law-enforcement-agency-pulls-examiners-out-license/", "ord_in_thread": 0, "title": "Law enforcement agency pulls examiners out license offices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Law enforcement agency pulls examiners out license offices By KIM CHANDLER - Associated Press   \nMONTGOMERY, Ala. (AP) - Alabama agencies on Wednesday announced the closure of smaller state parks, National Guard armories and nearly half of drivers’ license offices to deal with budget cuts in the coming fiscal year. \nThe changes- announced on the eve of the Oct. 1. start of the fiscal year - come after months of warning by Gov. Robert Bentley’s office and doubts by some lawmakers about whether the closures were necessary. \nThe governor said the closures are, “being made by the Legislature simply because of inadequate funding from the Legislature.” Lawmakers approved a general fund budget with $82 million in cuts after rejecting Bentley’s call for larger tax increases throughout three legislative sessions. \n“Since March I’ve been around the state- continuously telling the people of this state - that if we didn’t adequately fund the general fund, the essential services of government would be cut,” Bentley said. \nHowever, the Senate budget chairman said he had concerns that the cuts were in conflict with budget language dictating that state agencies should only make reductions to direct services as a “last resort.” \n“I am concerned that the cuts appear to be coming at the expense of services to the people and not the Montgomery bureaucracy which flies in the face of legislative intent that the bureaucracy be cut first and not services,” Senate Finance and Taxation General Fund Chairman Arthur Orr, R-Decatur, said. \nThe Alabama Law Enforcement Agency said it is pulling examiners out of 31 part-time satellite drivers’ license offices. The closures will require people to go to one of the remaining 44 drivers’ license offices if they must take a driving exam or conduct an in-person transaction. \nThe examiners currently travel to the locations during some days of the week. The agency said the change will save money on travel costs to the offices that handle less than five percent of all license transactions. The change means many of the state’s 67 counties will be without a license office. \nALEA Secretary Spencer Collier urged people to use online services for renewing licenses. \n“The impact of the changes due to the budget cuts will be lessened because of the implementation of these technology-based services, including online renewals,” Collier said. \nThe reductions could be in conflict with budget language that said lawmakers intended to keep all drivers’ license offices open or avoid cuts to direct services. \nHouse Ways and Means Budget Chairman Steve Clouse, R-Ozark, said rural lawmakers had concerns about their constituents having to travel long distances to reach an office. \n“That was their desire that they stay open,” Clouse said. “It will certainly be an inconvenience for folks in those areas.” \nBentley has argued that lawmakers violated the separation of powers between branches of government by trying to dictate how executive-branch agencies handle budget cuts. The governor last week asked the Alabama Supreme Court for an opinion on whether the budget language is constitutional. However, justices on Wednesday denied Bentley’s request for an advisory opinion. \nThe Alabama Department of Conservation and Natural Resources announced the closure of five of Alabama’s 22 state parks because of budget cuts.", "external_links": [], "published": "2015-10-01T01:03:00.000+03:00", "crawled": "2015-10-01T02:26:25.473+03:00", "highlightTitle": ""}