{"organizations": [], "uuid": "7f1f0f90c7c9e6812ed7bd6237824bc83ac0deb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/e9/d9e7982b7ee96d5eb91c5c788df891/media:33780a9bfdc64feb948cf4c38ba15da0MideastIsraelHospitalHavoc.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/13/jerusalem-hospital-copes-with-treating-victims-and-attackers", "country": "US", "title": "Jerusalem hospital copes with treating victims and attackers", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Jerusalem hospital copes with treating victims and attackers - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "7f1f0f90c7c9e6812ed7bd6237824bc83ac0deb1"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/13/jerusalem-hospital-copes-with-treating-victims-and-attackers", "ord_in_thread": 0, "title": "Jerusalem hospital copes with treating victims and attackers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By ARON HELLER, Associated Press\nJERUSALEM (AP) — As a wave of violence sweeps across Jerusalem, victims and perpetrators are often surprised to be reunited — at each other's bedside in the city's largest emergency ward.\nThe Hadassah Medical Center prides itself on checking politics at the door and treating Palestinian attackers and Jewish victims alike. But the tensions on the street are increasingly seeping through the hospital's sterile walls, with family members clashing in the hallways and causing the wounded even more trauma.\nHadassah's Ein Kerem campus is considered a rare model of co-existence in deeply divided Jerusalem, with a mixed Jewish-Arab medical team working together to treat the city's wounded and infirm.\nCoping with conflict is nothing new. More than 20 members of the hospital staff were either killed or lost close relatives during the last decade's Palestinian uprising. They are accustomed to separating their own feelings from the task at hand and treating those on the other side of the region's decades-old conflict.\nDaniel Weiss, the chief resident of Surgery Ward A, said it was \"irrelevant\" whether he was operating on a victim or a wounded attacker.\n\"We have patients of all kinds coming in. It doesn't matter who they are. We treat them all,\" he said. \"It's surreal, but that is the way we are. Jews and Arabs mingle and shop at each other's stores and work at each other's businesses and they lie at the hospital together.\"\nIt's a sentiment echoed by Ahmed Eid, head of surgery at Hadassah's Mount Scopus campus. On Monday, Eid, an Israeli Arab, operated on and saved the life of a 13-year-old Jewish boy who was stabbed in the east Jerusalem area of Pisgat Zeev and arrived at the hospital with barely a pulse after losing large quantities of blood.\n\"This is the situation and it has become very routine for us,\" he said. \"What happens in the country also affects us but it doesn't influence our medicine. Hadassah is a very special place.\"\nThe hospital corridors are filled with women wearing traditional Muslim dresses and headscarves walking alongside ultra-Orthodox Jews and patients with Jewish skullcaps. But the notion of Arabs and Jews being as inseparable in the hospital as they are outside doesn't sit well with everyone.\nOdel Bennett has been hospitalized at Hadassah since a Palestinian stabbed her husband Aharon to death on Oct. 3, seriously wounded her and lightly wounded their 2-year-old son Natan. The attacker stabbed another Israeli man to death before being shot dead.\nThe 22-year-old Bennett recalled how her pleas for help were mocked by local Arab merchants, who laughed at her and told her to \"die\" while a knife was still stuck in her body.\nWhen Bennett learned that a Palestinian woman who stabbed an Israeli man in the Old City several days later was being treated just four doors down the hall, she began to shake and have an anxiety attack.\n\"It is very, very hard to have a victim next to someone who tried to murder,\" she said from her hospital bed, where she is still recovering from 11 stab wounds. \"I understand that the hospital has to take them. I just don't know why they aren't treated in prisons. That's the reality.\"\nHer mother, Miriam Gal, was less diplomatic. Outraged that the woman's family was wandering the halls freely and that one of her relatives got into a fight with a police officer stationed there, she demanded the 18-year-old Palestinian, suffering from gunshot wounds, be moved to a different ward. The hospital ultimately agreed and moved her to a separate ward. When she was ready for discharge this week, the hospital turned her over to police.\n\"We are a terror-stricken family who is hurting, suffering and bereaved,\" Gal said, shaking. \"It is disgusting and outrageous. She has no right to even live and then you put her here?\"", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T14:58:47.779+03:00", "highlightTitle": ""}