{"organizations": [], "uuid": "40e782d063b0d328fa69f0f4b8a17013a6d1bf96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newrepublic.com", "main_image": "http://www.newrepublic.com/sites/default/files/colorado_weed.jpg", "site_section": "http://www.newrepublic.com/taxonomy/term/17538/feed#", "section_title": "The New Republic - Politics", "url": "http://www.newrepublic.com/article/123084/green-rush-and-denvers-housing-crisis", "country": "US", "title": "The Housing Crisis Amid Denver’s Cannabis Boom", "performance_score": 0, "site": "newrepublic.com", "participants_count": 1, "title_full": "The Housing Crisis Amid Denver’s Cannabis Boom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T18:24:00.000+03:00", "replies_count": 0, "uuid": "40e782d063b0d328fa69f0f4b8a17013a6d1bf96"}, "author": "Arielle Milkman", "url": "http://www.newrepublic.com/article/123084/green-rush-and-denvers-housing-crisis", "ord_in_thread": 0, "title": "The Housing Crisis Amid Denver’s Cannabis Boom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Arielle Milkman Photo: Chris Hondros/Getty I n 2012, when Colorado voted to legalize recreational marijuana, statehouse debates on the subject were mainly confined to enforcement, criminality, and addiction. How would the state avoid becoming a destination for drifters, addiction, and cannabis-related crime? And how would the budding industry look to conservative outsiders? Lobbying groups spent significant money on arguments for and against legalization, fueling endless disagreement. But absent from all of the mudslinging was a conversation about what would happen if THC in Colorado proved a rousing success—if the nation embraced the product as a health and recreation option and came to Colorado in droves. Three years later, the initiative has, by most accounts, proven to be an economic boon. In 2014, Colorado marijuana sales totaled $700 million , and the state expects to collect $94 million annually in cannabis taxes by 2016 . But economic analyses about weed’s success never mention skyrocketing housing prices in Denver, a city that’s rapidly becoming unaffordable for all but the wealthy. At the end of June, as I board a full flight from Dallas to Denver, the flight attendant jokingly reminds us that smoking is not permitted in flight, even though we’re on our way to Colorado. The white, bearded bro to my left me chuckles knowingly, before telling me that he’s visiting the state to “have a good time with buddies.” I’m moving back to my home state after some time living on the east coast, and I’m not quite prepared for what I’ll find when I arrive. Returning to Denver in 2015 after some time away is a bit like flying into a dystopian wasteland—but not the addict-ridden zombieland marijuana opponents imagined in 2012. Instead, enormous development projects rise out of the ground in all directions, wood and metal scraping against the eternally blue, big west sky. Denver smells green. Like weed—and money. Lots of money. And its residents are in trouble. I n the first six months of this year, recreational income from cannabis totaled over $253 million in Colorado . Denver, which has housed regulated marijuana operations since 2009, when Colorado codified its medical marijuana practices and nearby cities said no to cannabis business in their jurisdictions, now hosts around 4 million acres of marijuana grow space in its industrially zoned areas. The city plans to use most of its weed tax revenue on enforcement and drug education efforts. The effects of the green growth on housing, however, have been nothing short of controversial: Few can agree on the cumulative effects of legal cannabis on community and city development. But Denver residents are solid on one thing—that the rent is too damn high. The city, for its part, is finally taking measures to protect affordable housing, although some say it’s too little, too late . In mid-September, Denver’s City Council voted through another measure to preserve rapidly disappearing affordable housing —the city will now require owners of affordable units to give at least a year’s notice if they plan to convert their property to market rate rentals or sell it. This means that the city will have more time to negotiate or raise funds to buy properties, ostensibly keeping them as affordable units instead of market-rate ones. This latest measure is part of Michael Mayor Hancock’s affordable housing strategy, which seeks a steady revenue stream of $15 million a year to subsidize building new affordable units. Affordable housing is usually defined as income-qualified housing available to people who make less than 80 percent of the area median income. In Denver, 80 percent of area median income (AMI) is $43,000 per year . Together, this indicates that Hancock’s plan is meant to serve middle income folks—not to preserve or expand housing for people in poverty. J.P. Speers, a real estate broker at Berkshire Hathaway Home Services, believes that legal marijuana has pushed the housing market up. Between millennials who are influenced to move by the idea of legal access to the drug and out-of-state entrepreneurs looking to establish themselves in the industry, Speers says people want to be in Denver. “I do believe that there has been a huge amount of individuals who have moved out here specifically for the marijuana industry, and it has affected the housing market,” he said. Speers started finding real estate for marijuana industry folk after a fellow realtor friend helped find space for Denver’s first medical cannabis dispensary in 2002. Now, having become a broker for marijuana industry workers himself, he gets three or four calls a week from clients interested in finding space for grow operations. Because banks still won’t work with the industry (which is, again, illegal in most parts of the U.S.), many of these entrepreneurs pay in cash. Speers also said he has noticed a significant number of out-of-staters from Florida, Arizona and California buying houses in cash and (he presumes) establishing extralegal grow operations. Carrie Makarewicz, an urban planning professor at the University of Colorado, Denver, on the other hand, doesn’t think the presence of the marijuana industry has a lot to do with the current housing crisis. High costs of living in coastal cities like Boston, New York, San Francisco, and L.A., Makarewicz says, have prompted higher-paid workers to leave oceanside homes for second-tier cities like Denver, And millennials are also moving in droves—for jobs in tech, oil and gas, and other industries, perceived high quality of life, and “recreational opportunities.” At a time of massive migration , Denver also faces a shortage of low to mid-price housing. For Makarewicz, Colorado’s condo defects legislation , which says that condo owners can sue the developers over construction deficits, has deterred builders from creating anything but luxury condos. Housing costs continue to soar, and wages for workers remain stagnant. Colorado’s minimum wage is just $8.23 per hour , while in 2014 the average Denver resident needed to earn at least $35 an hour to afford to live in the city, according to a Zillow study . While prices and populations are up in Colorado cities that aren’t as friendly to the cannabis business, the change is far more dramatic in Denver. Colorado Springs, the second-most populous city in the state, experienced 6.8 percent population growth from 2010 to 2014, compared to Denver’s 10.6 percent. And in Colorado Springs, housing prices increased 5.4 percent in the past year , while they soared by 17 percent in Denver . Mike Elliott, executive director of Denver’s Marijuana Industry Group, said it’s hard to measure the impacts of retail cannabis, because neither the state government nor academics have done serious studies. And it doesn’t seem like either group plans to. Andrew Goetz, chair of the Geography department of the University of Denver, told me he doesn’t know anyone planning studies on the effects of retail cannabis on development in Denver, but said that someone should do the research soon. “If you were to talk to any of the tourism groups, they would say that our record tourism has nothing to do with retail marijuana,” Elliott said. “I think every day that goes by—that sounds more and more ridiculous.” State tourism records may not even accurately capture Colorado’s boom because they don’t record data from non-formal tourism giants like Airbnb. I n a neighborhood dubbed RiNo—short for River North, a cutesy and rather recent appropriation of New York’s penchant for shortening neighborhood names into two brand-able syllables—developers and marijuana growers have engaged in bidding wars for industrial warehouses, and the big losers are the artists who used to make work in them. Cannabis cultivation needs square footage, but it can make use of subpar industrial warehouses—the same type of uninsulated, undeveloped space artists and small nonprofit or creative projects thrive on. As a result, industrial vacancies are at an all time low, and warehouse rent is much higher than it has ever been. Brian Freeland, founder of the LIDA Project—an experimental theater company that was once housed in a warehouse in RiNo, before the owners flipped the building and sold it to a law group—said that interest in development and a pro-growth, pro-business city council increased real estate profits. In his opinion, the legalization of marijuana was a kind of death knell for arts space in Denver. “When you have an almost overnight boom industry, as you see with marijuana, it’s looking for space. And it’s an industry that is making money, so that industry can pay premium for space,” Freeland said. “When you put that against another industry that is historically underfunded and historically not supported by the same kind of city government and mayor’s office, you get a very unfair balance in which the arts are competing in a market economy.” As a consequence, many artists are now looking outside the city of Denver— to nearby Aurora and other suburbs —for a climate more affordable and amenable to the arts. In the end, it doesn’t seem to matter whether legal marijuana increased the value of real estate in the city, or if it’s the result of the Denver city council’s priorities; on the ground, the artists are fleeing anyway. Other economically vulnerable residents are also feeling pushed out. Benjamin Donlon, 27, an organizer working with Denver Homeless Out Loud , a homelessness rights organization, said that many factors in Denver’s economic boom lead to higher housing prices. It’s caused more homelessness in the past year. “I will say that the marijuana industry is driving a lot of development here… there’s definitely a big drive from people from California coming here to start developing the models for the future, which is driving prices through the roof,” Donlon said. Freeland, for his part, wonders if the cannabis rush is just another point in the history of the West’s all or nothing economy—it’s an area of the country that’s historically prided itself on creating profit from wide open space, on colonizing land in the spirit of property and new industry. “The West loves its individual spirit, but we’ve never really planned for the successes or for the failures of our boom and bust economy,” Freeland said. “From the gold rush through the oil boom, through the tech booms to marijuana production—we’re ultimately going to pay the price of not having the foresight of planning.” Freeland is right. Denver is treading water: trying to regulate growth it didn’t plan for, and reaping the benefits of cannabis sales without studying their long-term effects. If history is any indication, we’ll go on madly lurching toward expansive profits in this gold rush, the cost to Denver’s long-term residents and culture be damned. \nArielle Milkman is a freelance writer based in Denver. Follow her @amilkman . For more stories, like the New Republic on Facebook: Loading Related Articles...", "external_links": [], "published": "2015-10-12T18:24:00.000+03:00", "crawled": "2015-10-12T20:24:17.672+03:00", "highlightTitle": ""}