{"organizations": [], "uuid": "68b99cc952f1bad174d31637fca8fea6843a3456", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "", "site_section": "http://www.wsj.com/news/world/asia", "section_title": "Asia Business, Finance &amp; Political News - The Wall Street Journal", "url": "http://www.wsj.com/articles/the-10-point-1444386219", "country": "US", "title": "The 10-Point.", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "The 10-Point. - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T14:23:00.000+03:00", "replies_count": 0, "uuid": "68b99cc952f1bad174d31637fca8fea6843a3456"}, "author": "Gerard Baker", "url": "http://www.wsj.com/articles/the-10-point-1444386219", "ord_in_thread": 0, "title": "The 10-Point.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Good morning,\nTime to Quit The decision by Majority Leader Kevin McCarthy to withdraw from the race to become the next speaker of the House yesterday, following John Boehner ’s decision to step down, underscores the challenges facing all who would seek to lead a fractious GOP. Behind the scenes, he had concluded that what had become a painful and potentially ugly process of securing the required 218 votes would ultimately hobble him in doing the job . “It was only going to get worse,” he said in an interview with the Journal. Our Capital Journal columnist Jerry Seib notes that the “question now is whether there are any Republican leaders, either in Congress or on the presidential campaign trail, who can satisfy both sides in the governance-versus-ideology divide.”\nRisky Business Michael Dell is pressing ahead with an ambitious and risky deal that would require massive debt financing at a time when credit markets have become less hospitable to mergers. Negotiations have advanced for a $50 billion-plus acquisition of data-storage giant EMC and could produce an agreement by next week, according to people familiar with the matter. The deal marks an attempt by Mr. Dell to craft a future for a company caught between the shift toward mobile devices and fierce competition among providers of storage capacity and computing power. The recent rebound in markets has lent urgency to the talks. U.S. stocks climbed again yesterday after minutes from September’s Federal Reserve meeting were released.\nAssad’s Gambit Russia is escalating its military role in Syria with airstrikes in direct support of a ground assault by pro-regime forces. The U.S. warned that the offensive could backfire and NATO officials sought to reassure European and Turkish allies nervous over Moscow’s deepening involvement. Four Russian cruise missiles aimed at antiregime forces in Syria on Wednesday inadvertently landed in Iran , U.S. officials said. Russia’s intervention is lending credence to what is widely believed to be Syrian President Bashar al-Assad’s ultimate aim : Leave only one opponent in the multisided war—Islamic State—and force the West to choose between the extremist group and his regime.\nClaims to Fame In Los Angeles, an abode that has housed generations of Hollywood legends can be the ultimate status symbol. But mansions haunted by the ghosts of Hollywood past can also create challenges when it is time to sell. “Celebrity owned” shows up as frequently in Los Angeles real estate listings as granite countertops, but claims don’t always match the public record. And in today’s market, the well-heeled LA buyer frequently wants something bigger—much bigger—than a Hollywood mansion from the 1930s. Meanwhile, real-estate agents—in pursuit of more deals and commissions—are increasingly switching brokerage firms. And just like the stars of big leagues, when these players move, egos can clash.\nTOP STORIES U.S. Hillary Clinton Gives Joe Biden an Opening\nNASA Report Details Long-Range Plans for Astronauts to Live on Mars\nWORLD Cash Crunch Hits North Korea’s Elite\nNobel Peace Prize Awarded to Tunisian National Dialogue Quartet\nBUSINESS Colombia’s Santo Domingo Family Holds Keys to SABMiller, AB InBev Deal\nVolkswagen U.S. CEO Says He Didn’t Know in 2014 of Emissions Defeat Devices\nMARKETS Gentlemen May Prefer Bonds, But More Traders Take Stocks\nFed’s Rate Delay Spurred by Worry Over Low Inflation, Minutes Show\nToday’s Video Footage Shows Moment French Train Hero Stabbed ENLARGE Stone Associated Press Closed-circuit television footage appears to show the moment U.S. Airman First Class Spencer Stone was stabbed in Sacramento on Thursday night. Photo: Associated Press\nNumber of the Day $50 billion The minimum amount of assets that a financial institution must have to qualify as “too big to fail” under a proposal by Hillary Clinton that says they must pay a new “risk fee,” part of a broad package targeting Wall Street.\nQuote: of the Day ‘ Driven by a lust for power, greed, and a desire to improve their own financial position and reputation at the expense of investors and decency…managing directors plotted to drive founder Bill Gross out of Pimco. ’\n—The legendary bond investor gave his first public account of the circumstances that drove him out of Pimco, saying in a lawsuit that his former colleagues aligned against him to advance their careers and capture some of his bonus. The suit demands damages of no less than $200 million. Today’s Question Going back to our story above, what are your thoughts on Mr. McCarthy’s decision to step aside? Send your comments, which we may edit before publication, to 10point@wsj.com . Please include your name and location.\n—Compiled by Khadeeja Safdar\nReader Response Responding to yesterday’s question about Hillary Clinton’s reversal on the Pacific trade deal , Robert Stone of Indiana wrote, “It should not surprise anyone that she’s as fickle as the response to the latest poll and that she’s trying to separate herself from Obama, a lame duck who is of little use to her except as a point of contrast (in line with the latest poll).” Robert James of Texas described her position change as “a continuation of her willingness to say anything in hopes of getting the nomination. I am looking for a presidential candidate from any party that has principles and leadership not a follower of polls.” Roy Farrow weighed in from Nevada: “Union support is a pillar of the classic Democratic approach of combining silos of voters to secure a majority. She has determined that Joe and her other irritants, Bernie and email, make it imperative that she pander to traditional silos of support. Unions are threatened by liberal trade, ergo Clinton ‘agrees.’” But Slade Howell of North Carolina wrote, “Normally, if Bernie, Elizabeth and Hillary are against something, reflexively I am for it. However, in this case, there are many reasons to oppose this pact, different from the labor protection issues expounded by this trio.”\nThis daily briefing is named \"The 10-Point\" after the nickname conferred by the editors of The Wall Street Journal on the lead column of the legendary \"What's News\" digest of top stories. Technically, \"10-point\" referred to the size of the typeface. The type is smaller now but the name lives on.\nThe 10-Point In Your Inbox CLICK HERE to sign up for this briefing by email.", "external_links": ["http://si.wsj.net/public/resources/images/BN-KR614_Stone_G_20151009033143.jpg"], "published": "2015-10-09T14:23:00.000+03:00", "crawled": "2015-10-09T13:27:52.464+03:00", "highlightTitle": ""}