{"organizations": [], "uuid": "7c211b9587f8a3769f84c29f0e93d179bc19432c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2015/10/12/423687/default/v1/pic-1-1600x900.jpg", "site_section": "http://news.sky.com/feeds/rss/politics.xml", "section_title": "Political News - International and UK Politics | Sky News", "url": "http://news.sky.com/story/1568259/camerons-eu-renegotiation-must-deliver-soon", "country": "IL", "title": "Cameron's EU Renegotiation Must Deliver Soon", "performance_score": 0, "site": "sky.com", "participants_count": 12, "title_full": "Cameron's EU Renegotiation Must Deliver Soon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T19:48:00.000+03:00", "replies_count": 11, "uuid": "6d8881d3e2acf66cfb6c9277026bdcad0d08f713"}, "author": "news.sky", "url": "http://news.sky.com/story/1568259/camerons-eu-renegotiation-must-deliver-soon#post-0", "ord_in_thread": 0, "title": "Cameron's EU Renegotiation Must Deliver Soon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The likelihood of a quick referendum on EU membership is receding rapidly, as the renegotiation proceeds slowly. Senior government sources are playing down the notion that the December European Council will be \"high noon\" for the debate.\nThe deal-making is likely to seep into 2016, which could see a referendum in 2017.\nThe current state of play in the great European renegotiation has been described to me by a Cabinet minister as \"at the moment a type of mating ritual where we are dancing around each other\".\nThe UK and EU partners have been involved in a ritual that is noteworthy for revealing very little.\nPlay video \"EU In Or Out: In Numbers\" Video: EU In Or Out: In Numbers Specifically, the lack of willingness of the UK side to reveal a written-down list of ideas has led to much bafflement.\nMany of David Cameron's interlocutors, in the admittedly impressive charm offensive he has launched since re-election, remain generally supportive.\n:: Leaving EU Is A 'Leap In The Dark', Warns Rose \nSome have reported he asked them for ideas, and was content with receiving public statements that the relevant European Union leader \"wants Britain to stay in the EU\". That was never up for debate.\nThe mating ritual also applies to the weekly technical talks hosted by the European Council's lawyers in Brussels over the summer.\n1 / 7 Gallery: EU Vote: Who Is On Team In\nThe Britain is Stronger in Europe campaign is being headed by the former M&S boss Lord Rose\nThis week, President of the European Council, Donald Tusk, will present early details of these technicalities.\nThe principal diplomatic cause of slow progress was an acceptance by the UK that controversial reforms to EU citizen eligibility for UK tax credits would not be pushed before the Polish elections next week.\nMr Cameron's diplomacy will then pick up again in November.\nThe four broad parameters of the negotiation are limits on migration benefits, strengthening the single market, an opt out from 'ever closer union' and a fundamental and fair settlement within the EU between the euro-outs and euro-ins.\nThese changes need to have \"irreversible\" legal underpinning, but treaty change pre-referendum is not possible.\n1 / 8 Gallery: EU Vote: Who Is On Team Out\nThe Vote Out team has the support of a number of political donors. Among them is 80-year-old spread-betting millionaire and UKIP donor Stuart Wheeler\nIt was highly significant that even Mr Cameron's key centre right ally, new Danish PM Lars Lokke Rasmussen, told me last month in Downing Street that treaty change \"is not very realistic\".\nMr Rasmussen had praised the UK renegotiation in the Danish election campaign.\nIn this respect, the fact that the official campaign chaired by Lord Rose launched on Monday morning with the respected retailer saying he would vote to stay in \"come what may\" is significant.\nLord Rose also suggested he would not be the man to front up leave/remain TV debates.\nThat role might just be being left for the PM - in which case his renegotiation surely has to deliver soon.", "external_links": [], "published": "2015-10-12T19:48:00.000+03:00", "crawled": "2015-10-13T14:40:07.852+03:00", "highlightTitle": ""}