{"organizations": [], "uuid": "a8fdf6533e6260f45a822d045e25f50f110541f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "politicalhumor.about.com", "main_image": "", "site_section": "http://z.about.com/6/o/m/politicalhumor_p2.xml", "section_title": "About.com Political Humor: Most Popular Articles", "url": "http://politicalhumor.about.com/library/blbushisms.htm", "country": "US", "title": "Bushisms - Funny George Bush Quotes Updated...", "performance_score": 1, "site": "about.com", "participants_count": 0, "title_full": "Bushisms - Funny George Bush Quotes Updated...", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:20:00.000+03:00", "replies_count": 0, "uuid": "a8fdf6533e6260f45a822d045e25f50f110541f2"}, "author": "", "url": "http://politicalhumor.about.com/library/blbushisms.htm", "ord_in_thread": 0, "title": "Bushisms - Funny George Bush Quotes Updated...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bush", "George Bush"], "text": "• Bush Joke Archive \n\"I miss being pampered.\" --George W. Bush, reflecting on his presidency, University of Texas at Tyler, Oct. 19, 2010 \n\"This is my maiden voyage. My first speech since I was the president of the United States and I couldn't think of a better place to give it than Calgary, Canada.\" --George W. Bush, as reported by the Associated Press, Calgary, Canada, March 17, 2009 \"I'm going to put people in my place, so when the history of this administration is written at least there's an authoritarian voice saying exactly what happened.\" --George W. Bush, on what he hopes to accomplish with his memoir, as reported by the Associated Press, Calgary, Canada, March 17, 2009 \"One of the very difficult parts of the decision I made on the financial crisis was to use hardworking people's money to help prevent there to be a crisis.\" --George W. Bush, Washington, D.C., Jan. 12, 2009 \n\"I'm telling you there's an enemy that would like to attack America, Americans, again. There just is. That's the reality of the world. And I wish him all the very best.\" --George W. Bush, Washington, D.C., Jan. 12, 2009 \n\"In terms of the economy, look, I inherited a recession, I am ending on a recession.\" --George W. Bush, Washington, D.C., Jan. 12, 2009 \"I guess it's OK to call the secretary of education here 'buddy.' That means friend.\" --George W. Bush, Philadelphia, Jan. 8, 2009 \n\"So I analyzed that and decided I didn't want to be the president during a depression greater than the Great Depression, or the beginning of a depression greater than the Great Depression.\" --George W. Bush, Washington D.C., Dec. 18, 2008 \n\"People say, well, do you ever hear any other voices other than, like, a few people? Of course I do.\" --George W. Bush, Washington, D.C., Dec. 18, 2008 \"I've abandoned free market principles to save the free market system.\" --George W. Bush, Washington, D.C., Dec. 16, 2008 \n\"You know, I'm the President during this period of time, but I think when the history of this period is written, people will realize a lot of the decisions that were made on Wall Street took place over a decade or so, before I arrived in President, during I arrived in President.\" --George W. Bush, ABC News interview, Dec. 1, 2008 \n\"I've been in the Bible every day since I've been the president.\" --George W. Bush, Washington, D.C., Nov. 12, 2008 \"He was a great father before politics, a great father during politics and a great father after politics.\" --George W. Bush, on his father, George H.W. Bush, Washington, D.C., Nov. 12, 2008 \n\"Yesterday, you made note of my -- the lack of my talent when it came to dancing. But nevertheless, I want you to know I danced with joy. And no question Liberia has gone through very difficult times.\" --George W. Bush, speaking with the president of Liberia, Washington, D.C., Oct. 22, 2008 \n\"I want to share with you an interesting program -- for two reasons, one, it's interesting, and two, my wife thought of it -- or has actually been involved with it; she didn't think of it. But she thought of it for this speech.\" --George W. Bush, discussing a company that improves access to clean water in Africa, Washington D.C., Oct. 21, 2008 \n\"This thaw -- took a while to thaw, it's going to take a while to unthaw.\" --George W. Bush, on liquidity in the markets, Alexandria, La., Oct. 20, 2008 \n\"I didn't grow up in the ocean -- as a matter of fact -- near the ocean -- I grew up in the desert. Therefore, it was a pleasant contrast to see the ocean. And I particularly like it when I'm fishing .\" --George W. Bush, Washington, D.C., Sept. 26, 2008 \n\"Anyone engaging in illegal financial transactions will be caught and persecuted.\" --George W. Bush, Washington, D.C., Sept. 19, 2008 \n\"We're fixing to go down to Galveston and obviously are going to see a devastated part of this fantastic state.\" --George W. Bush, Houston, Sept. 16, 2008 \n\"The people in Louisiana must know that all across our country there's a lot of prayer -- prayer for those whose lives have been turned upside down. And I'm one of them.\" --George W. Bush, Baton Rouge, La., Sept. 3, 2008 \n\"First of all, I don't see America having problems.\" --George W. Bush, interview with Bob Costas at the 2008 Olympics, Beijing, China, Aug. 10, 2008 \n\"I'm coming as the president of a friend, and I'm coming as a sportsman.\" --George W. Bush, on his trip to the Olympics in China, Washington, D.C., July 30, 2008 \n\"There's no question about it. Wall Street got drunk -- that's one of the reasons I asked you to turn off the TV cameras -- it got drunk and now it's got a hangover. The question is how long will it sober up and not try to do all these fancy financial instruments.\" --George W. Bush, speaking at a private fundraiser, Houston, Texas, July 18, 2008 ( Watch video clip ) \n\"I think it was in the Rose Garden where I issued this brilliant statement: If I had a magic wand -- but the president doesn't have a magic wand. You just can't say, 'low gas.'\" --George W. Bush, Washington D.C., July 15, 2008 \n\"And they have no disregard for human life.\" --George W. Bush, on the brutality of Afghan fighters, Washington, D.C., July 15, 2008 \n\"The economy is growing, productivity is high, trade is up, people are working. It's not as good as we'd like, but -- and to the extent that we find weakness, we'll move.\" --George W. Bush, Washington, D.C., July 15, 2008 \n\"Goodbye from the world's biggest polluter.\" --George W. Bush, in parting words to British Prime Minister Gordon Brown and French President Nicolas Sarkozy at his final G-8 Summit, punching the air and grinning widely as the two leaders looked on in shock, Rusutsu, Japan, July 10, 2008 \n\"Amigo! Amigo!\" --George W. Bush, calling out to Italian Prime Minister Silvio Berlusconi in Spanish at the G-8 Summit, Rusutsu, Japan, July 10, 2008 \n\"Throughout our history, the words of the Declaration have inspired immigrants from around the world to set sail to our shores. These immigrants have helped transform 13 small colonies into a great and growing nation of more than 300 people.\" --George W. Bush, Charlottesville, Va., July 4, 2008 \n\"Should the Iranian regime-do they have the sovereign right to have civilian nuclear power? So, like, if I were you, that's what I'd ask me. And the answer is, yes, they do.\" --George W. Bush, talking to reporters in Washington, D.C., July 2, 2008 \n\"But oftentimes I'm asked: Why? Why do you care what happens outside of America?\" --George W. Bush, Washington, D.C., June 26,2008 Got a Bushism? Send it to: politicalhumor.guide@about.com Email This Page to a Friend \n\"I remember meeting a mother of a child who was abducted by the North Koreans right here in the Oval Office.\" --George W. Bush, Washington, D.C., June 26, 2008 \n\"I want to tell you how proud I am to be the President of a nation that -- in which there's a lot of Philippine-Americans. They love America and they love their heritage. And I reminded the President that I am reminded of the great talent of the -- of our Philippine-Americans when I eat dinner at the White House.\" --George W. Bush, referring to White House chef Cristeta Comerford while meeting with Filipino President Gloria Macapagal Arroyo, Washington, D.C., June 24, 2008 ( Watch video clip ) \n\"And I, unfortunately, have been to too many disasters as president.\" --George W. Bush, discussing flooding in the Midwest, Washington, D.C., June 17, 2008 \n\"There is some who say that perhaps freedom is not universal. Maybe it's only Western people that can self-govern. Maybe it's only, you know, white-guy Methodists who are capable of self-government. I reject that notion.\" --George W. Bush, London, June 16, 2008 \n\"Your eminence, you're looking good.\" --George W. Bush to Pope Benedict XVI, using the title for Catholic cardinals, rather than addressing him as \"your holiness,\" Rome, June 13, 2008 \n\"The German asparagus are fabulous.\" --George W. Bush, Meseberg, Germany, June 11, 2008 \n\"We've got a lot of relations with countries in our neighborhood.\" --George W. Bush, Kranj, Slovenia, June 10, 2008 \n\"One of the things important about history is to remember the true history.\" --George W. Bush, Washington, D.C., June 6, 2008 \n\"There's no question this is a major human disaster that requires a strong response from the Chinese government, which is what they're providing, but it also responds a compassionate response from nations to whom -- that have got the blessings, good blessings of life, and that's us.\" --George W. Bush, on relief efforts after a Chinese earthquake, Washington, D.C., June 6, 2008 \n\"Let's make sure that there is certainty during uncertain times in our economy.\" -- George W. Bush, Washington, D.C., June 2, 2008 \"We got plenty of money in Washington. What we need is more priority.\" --George W. Bush, Washington, D.C., June 2, 2008 \n\"And so the fact that they purchased the machine meant somebody had to make the machine. And when somebody makes a machine, it means there's jobs at the machine-making place.\" --George W. Bush, Mesa, Arizona, May 27, 2008 \n\"I don't want some mom whose son may have recently died to see the commander in chief playing golf. I feel I owe it to the families to be in solidarity as best as I can with them. And I think playing golf during a war just sends the wrong signal.\" --George W. Bush, Washington, D.C., May 13, 2008 \n\"I'll be long gone before some smart person ever figures out what happened inside this Oval Office.\" --George W. Bush, Washington, D.C., May 12, 2008 \n\"How can you possibly have an international agreement that's effective unless countries like China and India are not full participants?\" --George W. Bush, Camp David, April 19, 2008 \n\"Oftentimes people ask me, 'Why is it that you're so focused on helping the hungry and diseased in strange parts of the world?'\" --George W. Bush, Washington, D.C., April 18, 2008 \n\"We want people owning their home -- we want people owning a businesses.\" --George W. Bush, Washington, D.C., April 18, 2008 \n\"So long as I'm the president, my measure of success is victory -- and success.\" --George W. Bush, on Iraq, Washington, D.C., April 17, 2008 \n\"Thank you, your Holiness. Awesome speech.\" --George W. Bush, to Pope Benedict, Washington, D.C., April 15, 2008 ( Watch video clip ) \n\"A lot of times in politics you have people look you in the eye and tell you what's not on their mind.\" --George W. Bush, Sochi, Russia, April 6, 2008 \n\"Afghanistan is the most daring and ambition mission in the history of NATO.\" --George W. Bush, Bucharest, Romania, April 2, 2008 \n\"Soldiers, sailors, Marines, airmen, and Coastmen -- Coast Guardmen, thanks for coming, thanks for wearing the uniform.\" --George W. Bush, at the Pentagon, March 19, 2008 \n\"I thank the diplomatic corps, who is here as well.\" --George W. Bush, Washington, D.C., March 12, 2008 \n\"Removing Saddam Hussein was the right decision early in my presidency, it is the right decision now, and it will be the right decision ever.\" --George W. Bush, Washington, D.C., March 12, 2008 \n\"Let me start off by saying that in 2000 I said, 'Vote for me. I'm an agent of change.' In 2004, I said, 'I'm not interested in change --I want to continue as president.' Every candidate has got to say 'change.' That's what the American people expect.\" --George W. Bush, Washington, D.C., March 5, 2008 \n\"And so, General, I want to thank you for your service. And I appreciate the fact that you really snatched defeat out of the jaws of those who are trying to defeat us in Iraq.\" --George W. Bush, to Army Gen. Ray Odierno, Washington, D.C., March 3, 2008 \n\"Wait a minute. What did you just say? You're predicting $4-a-gallon gas? ... That's interesting. I hadn't heard that.\" --George W. Bush, Washington, D.C., Feb. 28, 2008 \n\"I'm oftentimes asked, What difference does it make to America if people are dying of malaria in a place like Ghana? It means a lot. It means a lot morally, it means a lot from a -- it's in our national interest.\" --George W. Bush, Accra, Ghana, Feb. 20, 2008 \n\"There is no doubt in my mind when history was written, the final page will say: Victory was achieved by the United States of America for the good of the world.\" --George W. Bush, addressing U.S. troops at Camp Arifjan in Kuwait, Jan. 12, 2008 \n\"I can press when there needs to be pressed; I can hold hands when there needs to be -- hold hands.\" --George W. Bush, on how he can contribute to the Middle East peace process, Washington, D.C., Jan. 4, 2008 \nMore Bushisms", "external_links": [], "published": "2015-10-22T15:20:00.000+03:00", "crawled": "2015-10-23T15:52:38.378+03:00", "highlightTitle": ""}