{"organizations": [], "uuid": "6d8bc14970400045641f6abe36d7fcf08032b8bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.npr.org", "main_image": "http://media.npr.org/assets/img/2015/10/15/evita_wide-2d47e4686ed0c0fc9ad87d7e72d333481253820e.jpg?s=1400", "site_section": "http://www.npr.org/rss/rss.php?id=1014", "section_title": "Politics : NPR", "url": "http://www.npr.org/sections/itsallpolitics/2015/10/15/448968801/new-clinton-spanish-posters-hillary-or-evita", "country": "US", "title": "New Clinton Spanish Posters: Hillary Or Evita? : It's All Politics", "performance_score": 7, "site": "npr.org", "participants_count": 5, "title_full": "New Clinton Spanish Posters: Hillary Or Evita? : It's All Politics : NPR", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T01:29:00.000+03:00", "replies_count": 5, "uuid": "6d8bc14970400045641f6abe36d7fcf08032b8bc"}, "author": "Jessica Taylor", "url": "http://www.npr.org/sections/itsallpolitics/2015/10/15/448968801/new-clinton-spanish-posters-hillary-or-evita", "ord_in_thread": 0, "title": "New Clinton Spanish Posters: Hillary Or Evita? : It's All Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New posters featuring Hillary Clinton seem to be trying to make her \" high flying, adored \" with voters.\nThe new images appeared at a campaign stop in San Antonio, Texas, where Clinton wooed Latino voters on Thursday. But according to NPR's Tamara Keith, the campaign says they don't know where the likeness came from. Banners were plastered all over the venue along with smaller signs and t-shirts.\ni A new Clinton campaign poster unveiled at an event in San Antonio says \"I'm with you\" in Spanish. Tamara Keith/NPR hide caption\ni toggle caption Tamara Keith/NPR A new Clinton campaign poster unveiled at an event in San Antonio says \"I'm with you\" in Spanish.\nTamara Keith/NPR The image of the black-clad Clinton profile may seem familiar to those who love either Argentinean history or musical theater — specifically Andrew Lloyd Weber's \"Evita.\"\nThe 1978 musical told the story of Eva Peron, the actress turned first lady of Argentina. Seen as ruthless and cunning, she and her husband drew support from the \"descamisados,\" or the poor and the working class, to climb to power. She eyed her own political success as well, campaigning for vice president before she died from cancer at the age of just 33. The muscial was briefly revived on Broadway in 2012.\ni Movie posters for the 2012 revival of the musical \"Evita\" are displayed outside the Marquis Theater in New York City. Paul Hadsall/Flickr Creative Commons hide caption\ni toggle caption Paul Hadsall/Flickr Creative Commons Movie posters for the 2012 revival of the musical \"Evita\" are displayed outside the Marquis Theater in New York City.\nPaul Hadsall/Flickr Creative Commons The story of \"Evita,\" as her admirers called her, found broader success in 1996 when the musical was adapted for the big screen, starring Madonna in the title role.\nMadonna on a press tour before filming of \"Evita\" began in 1996. Daniel Muzio/AP hide caption\ni toggle caption Daniel Muzio/AP i Madonna in the 1996 movie \"Evita.\" Getty Images/Getty Images hide caption\ni toggle caption Getty Images/Getty Images Madonna in the 1996 movie \"Evita.\"\nGetty Images/Getty Images The new posters — which translated means \"I'm with you\" — seem to invoke images from both the musical and the movie.\nBut even from that comparison, there could be some controversy. Peronism — the political movement and party she and her husband Juan Peron spurred — was seen a socialist movement, with populist influences that championed labor.\ni Eva Peron, known as Evita, the second wife of Argentine President Juan Peron, was a radio and screen actress before her marriage in 1945. She became a powerful political influence and a mainstay of the Peron government. AFP/AFP/Getty Images hide caption\ni toggle caption AFP/AFP/Getty Images Eva Peron, known as Evita, the second wife of Argentine President Juan Peron, was a radio and screen actress before her marriage in 1945. She became a powerful political influence and a mainstay of the Peron government.\nAFP/AFP/Getty Images Another comparison could be to fashion designer Carolina Herrera, who has dressed many first ladies.\ni Fashion designer Carolina Herrera is pictured during New York fashion week. Getty Images hide caption\ni toggle caption Getty Images Fashion designer Carolina Herrera is pictured during New York fashion week.\nGetty Images One woman at the campaign event had a much different idea to honor Hillary Clinton:\nA 70-year-old Hillary Clinton superfan got her portrait shaved into her head http://t.co/CouCmrfqIW pic.twitter.com/EGmcN8saCy\n— Mashable Watercooler (@watercooler) October 15, 2015 The image also seems to invoke the iconic image of President Obama created by artist Shepard Fairey during the 2008 campaign.\nThe iconic Obama collage from his 2008 campaign, created by Shepard Fairey, was later installed in the National Portrait Gallery. Jacquelyn Martin/AP hide caption\ni toggle caption Jacquelyn Martin/AP", "external_links": ["https://twitter.com/watercooler/status/654733250007429120", "http://t.co/CouCmrfqIW", "https://www.google.com/search?q=hillary+clinton+head+shaved&oq=hillary+clinton+head+shaved&aqs=chrome..69i57j69i64.3863j0j4&sourceid=chrome&es_sm=0&ie=UTF-8", "http://www.youtube.com/watch?v=YGHLt_BARTY", "http://t.co/EGmcN8saCy"], "published": "2015-10-16T01:29:00.000+03:00", "crawled": "2015-10-16T01:38:56.443+03:00", "highlightTitle": ""}