{"organizations": [], "uuid": "c94000d04c0e7cd0ac02758e7ec8545e6625dfe2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/current-events/50798-sneaky-new-voter-suppression-tool-north-carolina-uncovered-one-our-own.html", "country": "US", "title": "The sneaky new voter suppression tool in North Carolina, uncovered by one of our own", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "The sneaky new voter suppression tool in North Carolina, uncovered by one of our own", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T21:01:00.000+03:00", "replies_count": 0, "uuid": "c94000d04c0e7cd0ac02758e7ec8545e6625dfe2"}, "author": "LongWinded", "url": "http://defendingthetruth.com/current-events/50798-sneaky-new-voter-suppression-tool-north-carolina-uncovered-one-our-own.html", "ord_in_thread": 0, "title": "The sneaky new voter suppression tool in North Carolina, uncovered by one of our own", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The sneaky new voter suppression tool in North Carolina, uncovered by one of our own User Name Current Events Current Events Forum - Latest political news and events Quote: . . . What Busa has found is illustrated in the above image: a systematic and very sophisticated effort to make the simple act of going to the polls much, much more difficult for North Carolina's black voters. From Busa's presentation: North Carolina Republicans have been actively moving the goalpoststhey've been moving polling places around like a crazed monkey on crack. They have been cutting numbers of polling places in some counties, increasing numbers in other counties. There has been no systematic analysis of the effect of this. All I've been able to find in any news outlet is, you know: a little local newspaper, say Winston-Salem's, will say: \"the number of early voting sites is twelve this year...by the way, it was fifteen last year.\" That's it. Nobody has taken an overall view. [ ] The headline outcome from our analysis is that in 2014 white voters71% of the electorate in North Carolinahad to travel an additional 119,000 miles from their homes to their nearest Early Voting locations...which is approximately equivalent to halfway from the Earth to the Moon. I hear you ask, \"how did it affect black voters?\" Well, black voters22% of the electoratehad to travel to the moon and halfway home again, 370,000 miles, in 2014, to get to their nearest Early Voting place. [ ] Social equity. Rev. Barber was talking last night about how we should make moral arguments; we shouldn't be talking about liberals and conservatives, we should be talking about right and wrong. And the right and wrong of it is that the well-to-do, like many of us in this room, have a much higher degree of mobility and a lot more freedom to say \"I'm not coming into work...I'll be a half an hour late, because I'm going to stop off and vote first.\" Wage slaves in a low-wage job, which a lot of people of color are stuck in today, don't have that opportunity, to tell the manager of McDonald's \"I'm going to be a half hour late today because I'm going to vote.\" So, I really insist that excessive distance-to-poll is a poll tax. It costs you money to go vote, and the more money it costs, the fewer poor people vote. Most of the voter suppression actions taken by the new Republican majority legislature and McCrory have been very transparent, very apparent to the public: redistricting to corral black votes; voter ID; reducing early voting days; eliminating same day registration; and, particularly damaging to the black voter, eliminating voting on the Sunday before the election, the traditional \"Souls to the Polls\" activity of black churches. All of that was well publicized. This, however, this eliminating and moving of polling places was done very quietly. In Busa's words: \"There was no systematic 'we're going to go into one hundred counties, we're going to steal polling places from blacks in all one hundred counties.' What there was was a rather more efficient and slimy way of doing the same thing.\" It was done under the radar of everybody but Busa and his partner, who sniffed out the problem and have the statistical analysis chops to document it. . . . Cheats. republican/teabaggers can't win on their own, so they cheat to win. You know you are working AGAINST the rights of Americans and AGAINST the interest of Americans, when you have to cheat to win.", "external_links": [], "published": "2015-10-02T21:01:00.000+03:00", "crawled": "2015-10-03T10:50:17.114+03:00", "highlightTitle": ""}