{"organizations": [], "uuid": "ed564c97d95be8dd22761e231598a05118528090", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/3c/4a/29e4efbb46c29f0e4fda6ac84ea9/barack-obama-ap.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/afghanistan-us-troops-drawdown-214470", "country": "US", "title": "Obama weighing change in Afghanistan drawdown", "performance_score": 1, "site": "politico.com", "participants_count": 7, "title_full": "Obama weighing change in Afghanistan drawdown - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T19:21:00.000+03:00", "replies_count": 6, "uuid": "08f90f8f61f0a9e187174d9e408635883d0d60ea"}, "author": "Jack Shafer", "url": "http://www.politico.com/story/2015/10/afghanistan-us-troops-drawdown-214470#post-0", "ord_in_thread": 0, "title": "Obama weighing change in Afghanistan drawdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The top U.S. commander in Afghanistan is recommending a change in President Barack Obama’s plans of drawing down nearly all U.S. troops from Afghanistan by the end of 2016. Army Gen. John Campbell told a Senate panel Tuesday he has given the president options that would diverge from the current plan to withdraw all U.S. troops beyond an embassy presence in Kabul after 2016.\n“Based on conditions on the ground,” Campbell said, “I do believe that we have to provide our senior leadership options different than the current plan we’re on, absolutely.”\nCampbell said the president is currently weighing the options, but declined to go into detail about what he’s recommending before a decision is made. The situation in Afghanistan, he said, has changed since the president set his 2016 withdrawal course, from the rise of the Islamic State in Afghanistan to the standing up of a unity Afghan government to Pakistan’s military operations that have pushed militants into Afghanistan.\n“When the president made that decision, it did not take into account the change over the last two years,” Campbell said. “So, the course of actions that I’ve provided to my senior leadership provide options to adjust that.”\nSenate Armed Services Chairman John McCain (R-Ariz.) blasted the White House for sticking to a drawdown plan based on the calendar, warning that a hasty withdrawal would prompt Afghanistan to follow Iraq into chaos after U.S. troops departed.\n“It is not too late for President Obama to abandon this dangerous course and adopt a plan for U.S. troop presence based on conditions on the ground,” McCain said. “But time is of the essence, and continued delays by the White House are hurting our national security interests and those of our partners in Afghanistan and beyond.”\nDemocrats, too, suggested they favored a conditions-based withdrawal.\nObama to teachers unions: It's still on. By Michael Grunwald\nSen. Jack Reed, the top Democrat on the panel, asked Campbell about whether counterterrorism operations — one of the key continuing U.S. functions in Afghanistan — could be conducted effectively without leaving Kabul.\n“I strongly believe that the U.S. force posture in Afghanistan going forward should be shaped and resourced to enable you, general, to achieve your missions’ objectives, based on conditions on the ground,” Reed said in his opening statement.\nObama has already agreed once to delay the U.S. drawdown since U.S. combat operations in Afghanistan officially concluded at the end of 2014. The White House had hoped to remove half of the 9,800 U.S. troops in Afghanistan by the end of this year, but announced in March it would put off any withdrawals until next year, in part because Afghan leaders asked for \"flexibility\" in the drawdown.\nIn response to senators' questions, Campbell explained why drawing down to 1,000 troops in Kabul by the end of 2016 would be problematic. That plan, he said, would effectively prevent U.S. counterterrorism operations outside of Kabul and would hamper the U.S. mission to train, advise and assist the Afghan security forces.\nAfghan forces were still \"extremely limited\" in their ability to conduct close-air support operations, he said, and the Afghan capability in that area was still several years away despite U.S. efforts to ramp up close-air support training.\nCarson slams Obama for Oregon visit with shooting victims' families By Nick Gass\nHe emphasized the situation in Afghanistan was different than in Iraq — and different than under former Afghan President Hamid Karzai — because Afghanistan's current leaders want U.S. troops to stay.\nCampbell did not provide a timeline for when the president would make a decision on his new withdrawal options, but said the White House knows the lead time that would be required to remove troops from the conflict. And that prompted McCain to complain the military was supposed to begin drawing down troops in three months — and its course of action had yet to be determined.\nCampbell also addressed the airstrike over the weekend of a Doctors Without Borders hospital in Kunduz, which killed nearly two dozen people. He said that Afghan forces called for an airstrike, but the decision to provide it was a U.S. decision and that a hospital was “mistakenly struck.”\nU.S. special operations forces, Campbell said, were also on the ground during the fighting in Kunduz and were talking to the U.S. aircraft that delivered the strike.\nPreliminary results from a U.S. investigation into the airstrike would be ready within 30 days, he said.\n<div", "external_links": [], "published": "2015-10-06T19:21:00.000+03:00", "crawled": "2015-10-06T20:07:38.754+03:00", "highlightTitle": ""}