{"organizations": [], "uuid": "53c18fd30add282e61b266508c3e5ebf1abaa437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.livemint.com", "main_image": "http://www.livemint.com/rf/Image-621x414/LiveMint/Period1/2015/10/21/Photos/cotton.jpg", "site_section": "http://livemint.com//rss/economy_politics", "section_title": "economy_politics", "url": "http://www.livemint.com/Politics/vkV9yfGGtZC4yFGUJbzJCJ/Govt-to-buy-more-cotton-from-farmers-as-China-trims-imports.html", "country": "IN", "title": "Govt to buy more cotton from farmers as China trims imports", "performance_score": 0, "site": "livemint.com", "participants_count": 1, "title_full": "Govt to buy more cotton from farmers as China trims imports - Livemint", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:32:00.000+03:00", "replies_count": 0, "uuid": "53c18fd30add282e61b266508c3e5ebf1abaa437"}, "author": "Rajendra Jadhav", "url": "http://www.livemint.com/Politics/vkV9yfGGtZC4yFGUJbzJCJ/Govt-to-buy-more-cotton-from-farmers-as-China-trims-imports.html", "ord_in_thread": 0, "title": "Govt to buy more cotton from farmers as China trims imports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mumbai: India will be forced to make large-scale government cotton purchases from farmers for a second straight year, following a cut in imports by top buyer China that has depressed prices, industry officials said.\nIndia spent Rs16,000 crore ($2.5 billion) to buy 87 lakh bales of cotton at a government-set minimum support price (MSP) in the marketing year that ended on 30 September, up from just 400,000 bales in the previous year.\n“During the peak supply season, prices will drop below the MSP (minimum support price) level since demand is negligible from China,” said Dhiren Sheth, president of the Cotton Association of India (CAI).\nGovernment buying, aimed at supporting farmers, will prevent the dumping of cotton in overseas markets by the world’s biggest producer at a time when global prices are near six-year lows.\nChina has in recent years taken more than half of India’s cotton exports, propping up prices despite record output, but last year began cutting import quotas to stimulate demand for domestic cotton after it halted a state stockpiling programme.\nChina’s imports fell 42% in the first nine months of the year to 1.16 million tonnes.\nIndian farmers have begun the cotton harvest, but prices are already running below the MSP in some southern spot markets, forcing the state-run Cotton Corporation of India (CCI) to start buying at the support price of Rs4,100 ($63.15) per 100 kg.\n“So far we have opened 50 procurement centres. We could open 300 centres across the country like last year,” said B.K. Mishra chairman and managing director of the CCI.\n“We haven’t fixed any procurement target for the current year, but we will buy as much as farmers want to sell.”\nCAI’s Sheth said he expected the CCI would have to make aggressive purchases again this year as export demand was subdued and carry forward stocks were at record highs at an estimated 7.9 million bales.\nMishra said this year’s procurement was still likely to be lower than last year since production was set to drop 1.5% to 37.7 million bales and consumption by local textile units has been rising.\nDemand from other Asian buyers like Vietnam and Bangladesh is also expected to improve this year, although it is unlikely to make up for China’s lost buying.\n“The Chinese market is huge. No other country can make such large purchases,” said Dharmesh Lakhani, an exporter based in western Gujarat state. Reuters", "external_links": [], "published": "2015-10-20T14:32:00.000+03:00", "crawled": "2015-10-20T10:27:23.871+03:00", "highlightTitle": ""}