{"organizations": [], "uuid": "42761b6ecd3917d13651bf8c1484edc0da205010", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30344014/utility-unveils-industrys-first-unified-video-management-software", "country": "US", "title": "Utility Unveils Industry's First Unified Video Management Software", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Utility Unveils Industry's First Unified Video Management Software - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "42761b6ecd3917d13651bf8c1484edc0da205010"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30344014/utility-unveils-industrys-first-unified-video-management-software", "ord_in_thread": 0, "title": "Utility Unveils Industry's First Unified Video Management Software", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Utility\nNew, Fully Integrated Recording and Video Management Software Enables Police Departments to Fully Access and Activate the Entire Evidence Ecosystem at Half the Cost\nCHICAGO , Oct. 25, 2015 /PRNewswire/ -- Earlier today, Utility announced the unveiling of Rocket IoT™, the first-ever smart patrol car system that fully integrates video captured from In-Car and BodyWorn™ cameras. Rocket IoT™ enables police departments to view and manage police activity in a seamless, efficient and cost-effective manner. Unifying the entire evidence ecosystem eliminates the complexities that arise from having to sift through files on different platforms and ensures that there are no compatibility or readability issues. The announcement was made on the first day of the 2015 International Association of Chiefs of Police (IACP) Annual Conference and Expo held in Chicago from October 24 to October 27, 2015 . The Rocket IoT™ and the video management software is on display at Booth #2625.\n\"This announcement is a watershed moment for law enforcement and the legal evidence technology industry,\" said Robert McKeeman , CEO of Utility. \"With this unified system, officers will be able to view all in-car and BodyWorn™ videos for an incident in sync-even from multiple cars. Conversations will never again be lost in translation when going between multiple videos. Video administrators will no longer have to toggle sequentially through several video files to view an entire scene. Plus, this new solution is about half the cost of traditional in-car plus BodyWorn™ cameras and includes a BodyWorn™ camera.\"\nThe system works by installing each patrol car with Utility's Rocket IoT™ video server, which provides each car with secure WiFi for up to 1,500 feet around the vehicle. The Generation 2 BodyWorn™ camera replaces the wireless microphone. The WiFi vehicle area network provides real-time communications between all in-car and BodyWorn™ cameras in and around the police car. The officer's BodyWorn™ camera will record video and audio even when the officer is beyond the range of traditional 900Mhz wireless microphones. All BodyWorn™ video is automatically geo-tagged, so the precinct can pinpoint the exact location where the video was recorded.\nThis unified solution includes sending immediate \"Officer Down\" alerts to central dispatch should the BodyWorn™ camera sense the officer is in a horizontal position and unresponsive to a set of prompts. It will then initiate recording and relay the officer's exact location to central dispatch. Central dispatch can also distribute real-time BOLO, Silver, and Amber alerts to one officer, a group of officers, or all officers on duty. In addition, central dispatch can also create geo-fences and action zones using the system's GPS and automatically initiate video recording on every BodyWorn™ camera within the selected area. Conversely, GeoFence zones can also ensure video is not recorded in select locations as well.\nBodyWorn™ video and audio is immediately uploaded as it is being recorded via an encrypted network connection to the Rocket IoT™ server in the vehicle, or directly to cloud-based storage. The system uses the H.264 video recording standard to create video files that are half the size of the obsolete H.263 video files. Using video files that are 50 percent smaller results in faster uploads, less upload bandwidth and half the storage file space in cloud storage.\nOnce stored in the cloud, police department administrators can easily search for, view, categorize, redact, and export the video files on a timely basis. Smart Redaction™ is included as part of Utility's AVaiLWeb™ Video Management software as a service. Smart Redaction™ automatically identifies and redacts faces, body parts and other identifiable objects in a video. Video administrators can selectively blur or not blur images as needed. These unique redaction capabilities allow redacted videos to be released quickly for press and Freedom of Information requests. Redaction labor costs are dramatically reduced. Smart Redaction™ enables increased police accountability and transparency.\n\"The department can decide recording policy and then have the technology implement the policy automatically. Policy-based recording is truly a game changer for officer safety,\" said McKeeman. \"We develop all of our products with one goal in mind-policy-based recording. A police officer has a very tough job already. He or she needs to focus on staying safe while protecting and serving the public. A police officer should not be distracted by also having to remember various policies about when to manually start or stop a video recording.\"\nThe Rocket IoT™ makes the police car a smart car, in which all video recording and management software can be automatically updated according to policy changes so officers adhere to the most current guidelines. In addition to video connectivity, the Rocket IoT™ also offers an integrated vehicle diagnostics and ZigBee to provide vehicle performance, maintenance, trouble code status and an inventory of assets in and around the vehicle.\nFor more information on Utility and the revolutionary Rocket IoT™, visit www.utility.com .\nAbout Utility\nUtility is a venture-capital funded company headquartered in Decatur, Georgia (metro Atlanta ). The company was founded in 2001, developing software for mission-critical field-work force operations for the electric and gas industries. This software evolved into AVaiLWeb, Utility's premiere SaaS solution. Utility provides a unified operating platform for safely locating, tracking and supporting all aspects of mobile field operations. AVaiLWeb delivers real-time access to virtually any mobile asset, and provides a cost-effective, enterprise-wide view of the location and status of mobile field operations.\nContact : Jake Mendlinger\nOffice : 516-829-8374 / Cell : 516-639-3373\nEmail : JMendlinger@zimmed.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/utility-unveils-industrys-first-unified-video-management-software-300165772.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/utility-unveils-industrys-first-unified-video-management-software-300165772.html", "http://www.xmlnews.org/ns/", "http://www.utility.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY37597&Transmission_Id=201510251005PR_NEWS_USPR_____NY37597&DateId=20151025"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T19:29:56.099+02:00", "highlightTitle": ""}