{"organizations": [], "uuid": "7d528c62d881ba19a132b80b98b42b6570ce4a14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailysabah.com", "main_image": "http://i.tmgrup.com.tr/dailysabah/y/500x500/b13445ad-dd3e-43cd-a746-2fdf6b331516.jpg?v=40688", "site_section": "http://dailysabah.com//rss/politics", "section_title": "Daily Sabah - Politics", "url": "http://www.dailysabah.com/columns/ibrahim-kalin/2015/10/20/the-deceit-of-sectarianism", "country": "", "title": "The deceit of sectarianism", "performance_score": 0, "site": "dailysabah.com", "participants_count": 0, "title_full": "The deceit of sectarianism", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T00:03:00.000+03:00", "replies_count": 0, "uuid": "7d528c62d881ba19a132b80b98b42b6570ce4a14"}, "author": "", "url": "http://www.dailysabah.com/columns/ibrahim-kalin/2015/10/20/the-deceit-of-sectarianism", "ord_in_thread": 0, "title": "The deceit of sectarianism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COLUMNS The Syrian game and the new power equilibrium \nWe are living through the simultaneous age of macro-conflicts and micro-battles. Meta-narratives and localized stories are intertwined in a way that challenges the end of history, death of ideology and clash of civilizations concepts. From Syria, Iraq and Yemen to Ukraine, Myanmar and North Korea, we witness a conflict of global politics between nation-states and great powers on the one hand and sectarian and ethnic rivals on the other. Secular and religious sectarianism, ethnic and sectarian politics, nation-states and global rivalries are all part of this new chaotic order of sectarian politics. Sectarianism subverts politics at both national and regional levels and breeds extremism in the end. It takes religious, ethnic and secular forms or a combination of them. It is grounded in a deceitful self-centrism. It enforces polarization while claiming to protect its own interest. It resorts to extremism in the name of fighting it. The painful irony of religious and secular sectarianism is that when politics fails to deliver, ordinary people normally turn to religion and morality for guidance. To their credit, many religious dignitaries advise patience and wisdom to their followers. But the current sectarian climate makes this increasingly difficult as religion is misused to justify one or another form of sectarianism which, in turn nation-states use for their narrow political agendas. In such a toxic climate, any incident can become a scene for geopolitical posturing. Take the example of the stampede in Mina, Mecca on Sept. 24 this year. This horrific incident led to the deaths of over 1,000 people. What happened exactly is yet to be confirmed by Saudi officials. Measures need to be taken to prevent such horrible tragedies in the future. Yet the fallout from the stampede is as disconcerting as the incident itself. The stampede quickly became another field of regional conflict between Saudi Arabia and Iran. This is not only wrong, but also dangerous. Another case in point is the new alliance of Russia, Iran and Hezbollah that has emerged to save the regime of Syrian leader Bashar Assad in Syria. Iran and Hezbollah are natural allies so there is nothing surprising about their joint support for Assad. Russia is the odd fellow in the pack, but this oddity itself clarifies an important aspect of the new sectarian warfare in which the communist and even anti-religious Russia is part of a block that does not shy away from joining forces with any power that serves its interests. For its part, Russia does not care about the religious or sectarian identities and proclivities of its allies. The result is both ironic and telling. The Islamic Republic of Iran, Shiite Hezbollah and communist Russia are joining forces to save a secular, Alawite and nationalist Arab leader. As I have discussed here , \"the legacy of imperialist interventions, failed states, poverty, illiteracy and the sense of dispossession and alienation has created deep wounds in the social and political landscape of the Middle East. A divisive political identity has become a powerful ideological tool. Sunni and Shiite extremists are fighting for a plainly secular goal of political domination. Whether in Iraq, Yemen or Pakistan, they are using religious arguments for a worldly prize. Those who fight and kill in the name of Sunni or Shiite Islam are violating the basic principles of their religion.\" The simple fact is that as long as Sunnis from Syria and Iraq to Lebanon and Yemen feel isolated and oppressed, extremist groups will find ground for recruitment. The so-called rise of Shiites in Iraq, Lebanon, Yemen and now in Syria has antagonized the already fragile relations between Sunnis and Shiites across the Muslim world. Even though neither al-Qaida nor the Islamic State of Iraq and al-Sham (ISIS) is Sunni by any stretch of imagination, their terrorist ideology and tactics are mistakenly attributed to Sunni Islam. Hundreds of millions of Sunnis reject extremist ideologies in the name of Islam or the Sunni tradition. Equally, as long as Shiite Muslims feel threatened and marginalized from Iraq and Yemen to Afghanistan and Pakistan, they will be manipulated by various states and non-state actors to stoke sectarian tensions. Just as Sunnis have a religious and moral responsibility to respect and protect their Shiite brethren, Shiite Muslims have an interest in cherishing the pluralistic spirit of the Islamic tradition and reject sectarianism and nation-state agendas. Overcoming religious and secular sectarianism requires wisdom, intelligence and patience. The world as a whole needs the non-sectarian spirit more than ever.", "external_links": [], "published": "2015-10-20T00:03:00.000+03:00", "crawled": "2015-10-20T04:02:20.488+03:00", "highlightTitle": ""}