{"organizations": [], "uuid": "0b2af91890df92b0573b17e1d530cb7d11be10c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/82/3f/c2ce939244c4b3bc035f59ebb2e2/151026-test-editorial.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/26/obama-administrations-school-testing-proposal-comes-under-fire", "country": "US", "title": "Obama Administration's School Testing Proposal Comes Under Fire", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Obama Administration's School Testing Proposal Comes Under Fire - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "0b2af91890df92b0573b17e1d530cb7d11be10c4"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/26/obama-administrations-school-testing-proposal-comes-under-fire", "ord_in_thread": 0, "title": "Obama Administration's School Testing Proposal Comes Under Fire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Obama Administration's School Testing Proposal Comes Under Fire Some say a cap on the amount of time students are tested could have unintended consequences. A 13-year-old student takes part in a trial run of a new state assessment test on Feb. 12, 2015, at Annapolis Middle School in Annapolis, Md.\nBy Lauren Camera Oct. 26, 2015 | 2:49 p.m. EDT + More Organizations representing the country's state school chiefs and biggest urban school districts agree that students are spending too much time taking tests. But they have a beef with a proposal the Obama administration unveiled over the weekend for how to fix that.\nThe Council of Chief State School Officers and the Council of the Great City Schools are taking aim at the administration's recommendation that schools cap the amount of time students spend taking tests at 2 percent – a proposal they say could result in schools blindly eliminating tests without taking into account their quality.\nRELATED\nStudy: Students Burdened By Local, State and Federal Tests \"It's not clear to me that a one-size-fits-all cap is the solution,\" said Michael Casserly, executive director of the Council of the Great City Schools, which itself released a sweeping report over the weekend on testing in the 66 urban districts it represents.\n\"It will reduce time, but the issue of quality won't be addressed,\" Casserly said at a panel at the National Press Club on Monday morning alongside Education Secretary Arne Duncan. \"There is a very strong possibility that good tests would be eliminated. I'd be concerned about being too hard and too fast on a cap.\"\nChris Minnich, executive director of the Council of Chief State School Officers, agreed.\n\"It's clear that [the cap] could have unintended consequences,\" he said. \"I'd rather talk about quality.\"\nDuncan emphasized that the cap recommendation is just that – a recommendation. And he said he hopes it's used to spark a national conversation about the federal, state and local regulations that have led to the overtesting of students.\n[ READ: Education Department Recommends Less Testing ]\n\"What we don't believe in is unnecessary, redundant tests,\" Duncan said. \"Collectively, we have a mutual responsibility to get to a better place.\"\nThe issue of testing gained traction this year as Congress began rewriting No Child Left Behind, the current version of the federal K-12 law. And the administration's guidance comes after it has pushed states to adopt new education policies – including new teacher evaluation systems – that take into account student test scores.\nThose closely watching the politics of testing and the president's education agenda on the whole have argued that the about-face from Duncan and his team is an attempt to smooth relations between teachers unions and Democrats ahead of the 2016 presidential election.\nOver the weekend, the two national teachers unions cheered the administration's testing guidance, and Democratic front-runner Hillary Clinton , whom the unions have endorsed , touted the proposal as well.\n[ ALSO: Parents Support Testing, but Think There's Too Much ]\n\"While testing can provide communities with full information about how our students are doing and help us determine whether we have achievement gaps, we can and must do better,\" Clinton said in a statement. \"We should be ruthless in looking at tests and eliminating them if they do not actually help us move our kids forward.\"\nDuncan and John King , the No. 2 at the Education Department who will soon be secretary when Duncan resigns in December, refuted the claims that they're trying to make nice with teachers unions after embracing policies the unions have historically opposed.\n\"Some of the president's policies have been popular, some of them haven't,\" Duncan said. \"Don't make this something it's not.\"\nTAGS: education policy K-12 education Duncan, Arne standardized tests testing", "external_links": ["https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZekca6%3Fsrc=usn_tw&via=usnews&text=Obama%20Administration%27s%20School%20Testing%20Proposal%20Comes%20Under%20Fire", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZekca6%3Fsrc=usn_gp", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZekca6%3Fsrc=usn_li&title=Obama%20Administration%27s%20School%20Testing%20Proposal%20Comes%20Under%20Fire&summary=Some%20say%20a%20cap%20on%20the%20amount%20of%20time%20students%20are%20tested%20could%20have%20unintended%20consequences.&source=U.%20S.%20News", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZekca6%3Fsrc=usn_rd&title=Obama%20Administration%27s%20School%20Testing%20Proposal%20Comes%20Under%20Fire", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZekca6%3Fsrc=usn_su", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZekca6%3Fsrc=usn_fb"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T21:15:07.111+02:00", "highlightTitle": ""}