{"organizations": [], "uuid": "77474e93e8a90dd7ffe38762df77f4ca99755be2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://beforeitsnews.com/mediadrop/uploads/2015/42/7732417719d9f6f0630b98dba09cddeb1c0fcaec.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/just-not-predictable-3064536.html", "country": "US", "title": "Just not predictable | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Just not predictable | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:24:00.000+03:00", "replies_count": 0, "uuid": "77474e93e8a90dd7ffe38762df77f4ca99755be2"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/just-not-predictable-3064536.html", "ord_in_thread": 0, "title": "Just not predictable | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nMissile appears in a military parade to mark the 70th anniversary of the Workers’ Party / AP\nBill Gertz reports at the Washington Free Beacon,\nNorth Korea is capable of hitting the United States with a long-range nuclear missile, the commander of the U.S. Northern Command said last week.\n“I agree with the intel community that we assess that they have the ability, they have the weapons, and they have the ability to miniaturize those weapons, and they have the ability to put them on a rocket that can range the homelands,” said Adm. William Gortney, the Northcom commander who is also in charge of defending the United States from long-range missile attack.\n“And as the defender of North America, the United States officially, in the ballistic missile defense, I think the American people expect me to take the threat seriously,” he said Wednesday at the Atlantic Council.\nThe comments by Gortney were made days before North Korea held a military parade in Pyongyang marking the anniversary of the founding of the ruling communist Worker’s Party of Korea. Military analysts say the parade showcased a new variant of a long-range road-mobile missile built with Chinese assistance.\n…“With the vengeful desire to turn the citadel of our enemies into a sea of fire, our powerful tactical rockets loaded with diversified and miniaturized nuclear warheads are on the move,” a North Korean commentator said during the parade as several columns of the mobile missiles were shown on television.\nMobile missiles are considered a greater strategic threat than silo-based missiles because they are more difficult to track and can be set up and launched with little or no warning.\n…Gortney said he “looks longingly” back to the time of Kim’s father and predecessor, Kim Jong Il, who, while threatening, was more predictable than the younger Kim.\nGortney noted that Kim has used unusually brutal means to execute his rivals, including his uncle Jang Sang Taek, who in December 2013 was executed by large caliber anti-aircraft guns after being charged with seeking to usurp power.\nKim’s “form of non-judicial punishment is pretty interesting—shooting people with anti-aircraft guns,” Gortney said, adding that Kim is “just not predictable.”\n“We can live with some pretty ugly opponents as long as they’re predictable,” he said. “This guy I just can’t predict. … It’s just a very, very unpredictable and unstable situation over there.”\n…you have a leader in North Korea who has nuclear weapons and is seeking the means to militarize them and deliver them intercontinentally, and that causes me great concern,” Harris said.\n…Conventional North Korean forces include 20,000 to 30,000 artillery pieces within range of Seoul, the South Korean capital, as well as some 100,000 rockets within range of 28,000 American troops and their families along with another 700,000 American citizens who live in South Korea. “So I view the threat from North Korea very seriously,” Harris said.\n…“One of the Obama administration’s key failures of resolve was its failure in 2012 to sanction Beijing over its sale to North Korea of the large sophisticated 16-wheel trucks that now carry North Korea’s nuclear ICBMs aimed at the United States,” he said.\n…“But three years after these Chinese TELs appeared, and now with their third appearance in a North Korean military parade, the administration has yet to provide a substantive public explanation to the American people about China’s assistance for North Korean ICBMs that can now devastate American cities,” Fisher said.\nRead more here.", "external_links": ["http://freebeacon.com/national-security/admiral-north-korea-can-hit-u-s-with-long-range-nuclear-missile/"], "published": "2015-10-14T04:24:00.000+03:00", "crawled": "2015-10-14T06:35:04.835+03:00", "highlightTitle": ""}