{"organizations": [], "uuid": "b5ef4e11a4a4564aaadaccedafaa9e73649282b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30266996/us-department-of-commerce-issues-countervailing-duties-in-canadian-supercalender-case", "country": "US", "title": "U.S. Department of Commerce Issues Countervailing Duties in Canadian Supercalender Case", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "U.S. Department of Commerce Issues Countervailing Duties in Canadian Supercalender Case - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "b5ef4e11a4a4564aaadaccedafaa9e73649282b1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30266996/us-department-of-commerce-issues-countervailing-duties-in-canadian-supercalender-case", "ord_in_thread": 0, "title": "U.S. Department of Commerce Issues Countervailing Duties in Canadian Supercalender Case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Resolute Forest Products Inc.\nUS $\nMONTRÉAL, Oct 15, 2015 /CNW Telbec/ - Resolute Forest Products Inc. (NYSE: RFP) (TSX: RFP) learned that the U.S. Department of Commerce released rates in the countervailing duty (\"CVD\") investigation of imports of supercalendered paper from Canada. Commerce determined a final subsidy rate of 17.87% for Resolute, and rates of 20.18% for Port Hawkesbury Paper LP and 18.85% for all other producers/exporters in Canada. On July 29, 2015 , Commerce calculated a preliminary rate of 2.04% for Resolute. Commerce's justification for the change is based on the application of \"adverse facts available,\" saying that the Company \"did not fully cooperate with the investigation.\"\nResolute believes that it has fully cooperated with the investigation; it is surprised and disappointed with this announcement. The Company also reiterates its position that its production of supercalendered paper has received negligible, if any, direct or indirect subsidies of any kind. The Company will have no further comment until it has reviewed Commerce's written Issues and Decision Memorandum, which is expected to be issued later today.\nAbout Resolute Forest Products\nResolute Forest Products is a global leader in the forest products industry with a diverse range of products, including newsprint, specialty papers, market pulp and wood products. The company owns or operates some 40 pulp and paper mills and wood products facilities in the United States , Canada and South Korea , and power generation assets in Canada . Marketing its products in close to 80 countries, Resolute has third-party certified 100% of its managed woodlands to at least one of three internationally recognized sustainable forest management standards. The shares of Resolute Forest Products trade under the stock symbol RFP on both the New York Stock Exchange and the Toronto Stock Exchange.\nResolute and other member companies of the Forest Products Association of Canada , as well as a number of environmental organizations, are partners in the Canadian Boreal Forest Agreement. The group works to identify solutions to conservation issues that meet the goal of balancing equally the three pillars of sustainability linked to human activities: environmental, social and economic.\nResolute is proud to be ranked by Corporate Knights as one of Canada's Best 50 Corporate Citizens for 2014. The company and Richard Garneau , president and chief executive officer, have been named to Canada's 2015 Clean50, and Resolute was also awarded The New Economy magazine's global Clean Tech Award for best forestry and paper solutions.\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=C2186&Transmission_Id=201510150800CANADANWWEB______C2186&DateId=20151015"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T16:52:35.472+03:00", "highlightTitle": ""}