{"organizations": [], "uuid": "b9ed8d9246e756b6d7a4c28c1b16c5e1c11dcce1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wptz.com", "main_image": "http://www.wptz.com/image/view/-/35788526/highRes/2/-/maxh/630/maxw/1200/-/a50p0r/-/Clinton-PBS-jpg.jpg", "site_section": "http://www.wptz.com/8870878?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.wptz.com/politics/south-carolina-nevada-polls-clinton-ahead/35788446", "country": "US", "title": "Ahead of debate, Clinton leads in SC, Nevada polls", "performance_score": 0, "site": "wptz.com", "participants_count": 0, "title_full": "Ahead of debate, Clinton leads in SC, Nevada polls", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:26:00.000+03:00", "replies_count": 0, "uuid": "b9ed8d9246e756b6d7a4c28c1b16c5e1c11dcce1"}, "author": "", "url": "http://www.wptz.com/politics/south-carolina-nevada-polls-clinton-ahead/35788446", "ord_in_thread": 0, "title": "Ahead of debate, Clinton leads in SC, Nevada polls", "locations": ["Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton"], "text": "Clinton sent GOP 2016ers copies of... \nClinton has the support of 50% of those who say they are likely to attend the Democratic caucus scheduled for February 20 in Nevada -- which plays host to the first debate among the declared Democratic candidates on Tuesday and is the first state to elect delegates after Iowa and New Hampshire. \nSanders follows at 34%, then Vice President Joe Biden at 12%, with the rest of the field garnering less than 1% support. \nAmong those who say they are likely to vote in South Carolina's primary, set for one week after Nevada's caucuses, Clinton holds a larger edge, 49% to Biden's 24%, with Sanders at 18% and former Maryland Governor Martin O'Malley at 3%. \nShould Biden decide to sit out the race for the presidency, Clinton's lead grows in both states. In South Carolina, a Biden-free race currently stands at 70% Clinton to 20% Sanders with O'Malley holding at 3%, and in Nevada, Clinton gains 8 points to 58%, while Sanders picks up just 2 points and would stand at 36%. \nIn South Carolina, Clinton's advantages stem largely from Sanders' unpopularity with black voters, who made up a majority of Democratic primary voters in the state in 2008, the last time there was a competitive Democratic primary. Back then, black voters broke 78% for Barack Obama to 19% for Clinton. \nIn the new poll, 59% of black voters say they back Clinton, 27% say Biden and just 4% for Sanders. Among white voters, Sanders has the edge, 44% to 31% for Clinton and 22% for Biden. Without Biden in the race, it's a near-even split among whites, 48% Clinton to 47% Sanders, while blacks break 84% to Clinton and just 7% would back Sanders. \nThese two states, along with Iowa and New Hampshire, are the only ones permitted by both major parties to hold primaries or caucuses in February, and the outcome of the contests in these early states can make or break a presidential campaign. \nIowa's caucuses will happen first, and a recent NBC News/Wall Street Journal/Marist poll in the state finds Clinton 11 points ahead of Sanders there, a narrower margin than she holds in most national polling. New Hampshire's primary follows, and several recent polls there, including a CNN/WMUR poll released in September, have found Clinton trailing Sanders by a significant margin in the state. \nClinton's stronger support in Nevada and South Carolina could bolster her campaign heading in to the large batch of \"Super Tuesday\" contests set to be held on March 1. \nIn both Nevada and South Carolina, Clinton holds double-digit advantages as the candidate who would do the best job handling the economy, health care, race relations, foreign policy and climate change, and is broadly seen as the candidate with the best chance to win in 2016 (58% say so in South Carolina, 59% in Nevada). \nThe margins between Clinton and Sanders narrow when it comes to which candidate is most honest and trustworthy (in South Carolina, 35% say Clinton, 27% Biden, 21% Sanders, in Nevada, 33% Sanders, 32% Clinton and 22% Biden), and in Nevada, on who best represents Democratic values (44% say Clinton, 37% Sanders) and understands the problems facing people like you (42% Clinton, 39% Sanders). \nThe four other candidates tested in the polls -- former Rhode Island governor Lincoln Chafee, Harvard professor Larry Lessig, O'Malley and former Virginia senator Jim Webb -- lag well behind Clinton, Sanders and Biden on the issues and attributes tested. None of them top 3% on any of those questions. \nThe economy is the clear top issue in both states, with 45% in Nevada and 43% in South Carolina calling it the most important issue in determining their vote for presidency next year. Health care and social issues follow in both states, though South Carolina voters are more apt to say health care is key than Nevada caucus-goers (29% health care, 10% social issues in South Carolina, 16% for each issue in Nevada). \nClinton's biggest issue advantage comes on foreign policy (she's up 38 points over Biden in South Carolina and 30 points over him in Nevada), while the margins are narrower on the economy (47% Clinton, 24% Biden, 18% Sanders in South Carolina, 46% Clinton, 31% Sanders, 15% Biden in Nevada) and climate change (44% Clinton, 22% Sanders and 21% Biden in South Carolina, 41% Clinton, 30% Sanders and 16% Biden in Nevada). \nWhile Sanders and Clinton have been sparring over the economy for quite some time, both foreign policy and energy policy have earned attention from the two campaigns recently. Sanders has highlighted his opposition to the Iraq war in 2002 as a foreign policy credential, while Clinton declared her opposition to the Keystone XL pipeline. \nThe CNN/ORC polls were conducted by telephone October 3-10. A total of 1,009 South Carolina adults were interviewed, including 301 who said they were likely to vote in the Democratic presidential primary. In Nevada, interviews were conducted with 1,011 adults, including 253 who said they were likely to participate in the Democratic presidential caucus. Results among likely Democratic voters in South Carolina have a margin of sampling error of plus or minus 5.5 percentage points, for Nevada Democratic caucus goers, it is 6 points.", "external_links": [], "published": "2015-10-12T20:26:00.000+03:00", "crawled": "2015-10-12T20:29:06.871+03:00", "highlightTitle": ""}