{"organizations": [], "uuid": "77dd257d7088d5da89bed0d829b3720f55050609", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/6e/e972177ccfa11a907583f415673496/media:627fa6d782eb4da195861310e92da782MideastIsraelPalestinians.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/20/the-latest-israel-demolishes-home-of-palestinian-killer", "country": "US", "title": "The Latest: Israel arrests Hamas leader in West Bank", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "The Latest: Israel arrests Hamas leader in West Bank - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "77dd257d7088d5da89bed0d829b3720f55050609"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/20/the-latest-israel-demolishes-home-of-palestinian-killer", "ord_in_thread": 0, "title": "The Latest: Israel arrests Hamas leader in West Bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Latest: Israel arrests top Hamas official in West Bank over incitement to violence Israeli border police check Palestinians ID at a checkpoint as they exit the Arab neighbourhood of Issawiyeh in Jerusalem, Sunday, Oct. 18, 2015. Palestinian assailants carried out a series of five stabbing attacks in Jerusalem and the West Bank on Saturday, as a month-long outburst of violence showed no signs of abating. The unrest came despite new security measures that have placed troops and checkpoints around Palestinian neighbourhoods in east Jerusalem. (AP Photo/Oded Balilty)\nAssociated Press Oct. 20, 2015 | 2:28 a.m. EDT + More JERUSALEM (AP) — The latest developments in a wave of Israeli-Palestinian violence (all times local).\n___\n9:15 a.m.\nIsrael has arrested a top Hamas official in the West Bank, accusing him of inciting recent violence.\nThe military says it arrested Hassan Yousef on Tuesday near Ramallah. It marks the most high-profile arrest since a wave of unrest swept through the region a month ago.\nThe military said Yousef had been \"actively instigating and inciting terrorism\" by encouraging attacks against Israelis. Military spokesman Lt. Col. Peter Lerner says, \"Hamas' leaders cannot expect to propagate violence and terror from the comfort of their living rooms and pulpits of their mosques.\"\nYousef is a co-founder of Hamas whose son, Mosab, later spied for Israel between 1997 and 2007.\nOver the past month, nine Israelis have been killed in Palestinian attacks, most of them stabbings. In that time, 41 Palestinians were killed by Israeli fire, including 20 labeled by Israel as attackers, and the rest in clashes with Israeli troops. An Eritrean migrant died after being shot and beaten by a mob that mistakenly believed he was a Palestinian attacker.\n___\n9:00 a.m.\nThe Israeli military has demolished the home of a Palestinian who killed an Israeli woman last year.\nThe measure is one of the recent steps Israel has undertaken to counter a wave of attacks that have killed nine Israelis in the past month, mostly in stabbings. At least 41 Palestinians have been killed, including 20 identified by Israeli authorities as attackers. The rest died in clashes with Israeli forces.\nThe military says forces demolished the residence of Maher Hashlamoun early Tuesday in Hebron. Last year, Hashlamoun rammed his car into 25-year-old Dalia Lemkus in the West Bank and stabbed her several times. Hashlamon was shot and killed.\nHashlamoun's wife told Palestinian radio that soldiers evacuated their three story building and demolished the third floor apartment where her family lived.\nIsraeli military spokesman Lt. Col. Peter Lerner says the demolition \"sends a clear message that there is a personal price to pay when you are involved in terror.\"\nCopyright 2015 The Associated Press . All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nTAGS: Associated Press", "external_links": ["http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZed6s2%3Fsrc=usn_su", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZed6s2%3Fsrc=usn_fb", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZed6s2%3Fsrc=usn_li&title=The%20Latest%3A%20Israel%20arrests%20Hamas%20leader%20in%20West%20Bank&summary=&source=U.%20S.%20News", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZed6s2%3Fsrc=usn_gp", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZed6s2%3Fsrc=usn_tw&via=usnews&text=The%20Latest%3A%20Israel%20arrests%20Hamas%20leader%20in%20West%20Bank", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZed6s2%3Fsrc=usn_rd&title=The%20Latest%3A%20Israel%20arrests%20Hamas%20leader%20in%20West%20Bank"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T09:40:15.780+03:00", "highlightTitle": ""}