{"organizations": [], "uuid": "b7adb3cc0819b61772754b8f403448f6d063fd14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/4f/b7/a73d74c4404cbfbead74b922402d/151009-b1-editorial.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/13/kunduz-isis-and-the-complexities-of-the-modern-us-air-war", "country": "US", "title": "Kunduz, ISIS and the Complexities of the Modern U.S. Air War", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Kunduz, ISIS and the Complexities of the Modern U.S. Air War - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "b7adb3cc0819b61772754b8f403448f6d063fd14"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/13/kunduz-isis-and-the-complexities-of-the-modern-us-air-war", "ord_in_thread": 0, "title": "Kunduz, ISIS and the Complexities of the Modern U.S. Air War", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "War From Above With Mayhem on the Ground U.S. airmen discuss the harsh truths of fighting in an increasingly crowded Middle East arena. An Air Force B-1 Lancer bomber flies above Kobani, Syria, in 2014.\nBy Paul D. Shinkman Oct. 13, 2015 | 6:00 a.m. EDT + More BOX ELDER, South Dakota – A recent U.S. airstrike that killed almost two dozen hospital workers and patients at a Doctors Without Borders facility in Afghanistan provides a visceral and tragic example of modern conflict's devastating potential, playing out in war zones with fewer trained professionals on the ground to help determine friend from foe.\nThe Pentagon could not immediately explain exactly how or why the medical compound in Kunduz was hit. Gen. John Campbell, who oversees the war in Afghanistan, later said Afghan forces on the ground requested air support and the decision to provide it was made \"within the U.S. chain of command,\" but that, ultimately, striking the hospital was a mistake .\nHow such an egregious error occurred is the focus of Pentagon, NATO and Afghan investigations, and will likely be scrutinized for months to come. But the incident highlights the complexity of warfare in 2015 – pilots operating over Afghanistan, Iraq and Syria say they face incredible challenges in deciphering violence on the ground thousands of feet below them, and in determining how it fits into the narrow parameters Washington has set for military operations.\nAirmen often are forced to work in regions home to groups with shades of both friend and enemy. And despite advanced technologies that give pilots a greater ability to find targets on the ground and direct weapons to them, U.S. policy of late forces them to rely increasingly on indigenous military groups like the Kurdish peshmerga to call in the airstrikes the pilots then carry out.\nRELATED\nU.S. Changes Story on Deadly Doctors Without Borders Strike in Kunduz\nAnd so, the fog of war extends up 30,000 feet.\n\"The last thing we want to do is put a weapon on somebody we're trying to support,\" says a captain in the 34th Expeditionary Bomb Squadron based here at Ellsworth Air Force Base, who asked to be referred to only as Jason.\nJason manages ordnance on board the sleek-looking B-1 bomber as a weapons systems officer, or \"wizzo,\" and belongs to a squadron that dropped a record number of bombs this summer. He and his fellow airmen returned in late July from a deployment to Al Udeid Air Base in Qatar, where temperatures can soar to 140 degrees with 100 percent humidity, and from which the U.S. now wages the bulk of its air campaign in the skies over Iraq, Syria and Afghanistan.\nIn interviews with U.S. News late last month, airmen from the squadron described the growing complexities of participating in a modern war from the skies without having fellow countrymen working on the ground in tandem. The unit's commander, Lt. Col. Joseph Kramer, offered one particular example of when the Islamic State group advanced on the key Iraqi city of Ramadi this spring while his B-1s were providing support to local Iraqi military forces.\nThose local forces eventually, as he says, \"tactfully withdrew.\"\n\"If someone told you during that exact fight that they could pinpoint friend versus foe, the type of friend – was it Sunni militia? Was it Iraq regular forces? That gets pretty difficult in any dynamic environment,\" says Kramer, who previously deployed to Afghanistan four times.\nHe relies, however, on an honor frequently touted here: that this deployment dropped more bombs than any other B-1 tour in the last 10 years.\n\"We dropped over 2,200 weapons,\" he says. \"So my 'gut-feel' is we're doing it right.\"\nThe Air Force headquarters overseeing operations in the Middle East confirms the 34th squadron deployed 18 percent of the 12,000 total weapons dropped during the campaign in Iraq and Syria during their six-month deployment. (Consequently, their replacement B-1 unit, the 37th Bomb Squadron, has so far dropped 25 percent of all weapons from July to October.) They contributed to the massive offensive to retake the town of Tikrit, where administration officials now say 65 percent of the population has been able to return.\nThe high battle rhythm transferred to those on the ground charged with maintaining the planes around the clock.\n\"I've never felt heat like that before,\" says Staff Sgt. Erin Rutherford, one of the squadron's maintainers, who frequently had to wear gloves when working inside the cockpit at Al Udeid to avoid burning her hands amid the soaring heat. \"It was intense.\"\nTheir achievement appears to contradict criticisms of the war's tempo, such as Sen. John McCain of Arizona's assertion that 75 percent of fighters and bombers had been returning to base without deploying their weapons. An Air Force Central Command spokesman, however, said the numbers swelled due to an overall rise in opportunities to target the Islamic State group during the summer. July saw 2,829 munitions dropped, a 67 percent increase from the previous month. August and September saw fewer strikes, but still more than June, the spokesman said.\n\"Airstrikes have expanded further into Syria and [Kurdish forces'] advances on the ground open up more targeting opportunities against Daesh,\" Air Force Master Sgt. Sonny Cohrs says, using an alternative name for the Islamic State group. \"For Iraq, the coalition airstrikes continue to shape the battlefield and lay the groundwork for Iraqi security forces. Coalition air power has been extremely successful in restricting freedom of movement for Daesh.\"\nRELATED\nIn Afghanistan, Taliban and Kunduz Present Harsh Truths for Obama Jason says the improvements the Air Force has overseen in finding targets provide \"comfort with reservation.\" American aircraft have developed procedures for how to operate in an environment like Syria – where the specter of the local military and now the Russian air force continues to lurk – as well as in Iraq and Afghanistan.\nBut sometimes, pilots have to stop and ask themselves whether an order they receive feels right.\n\"Sometimes it may take a little longer,\" says another weapons systems officer in the 34th, who asked to be referred to as Chris. \"The way you figure out friendly versus foe is going to be the same, and the things that make your hair stand up in Afghanistan are the same things that make your hair stand up in Iraq and Syria.\"\nStill, they say, it's frustrating. This latest tour was Chris' second after he deployed to Afghanistan in 2013, back when U.S. forces operated on bases throughout Afghanistan and could communicate with pilots overhead. The entire area of operations was systematically divided up among American combat commanders on the ground.\nChris describes one instance during this latest deployment in which his B-1 was tasked with destroying a series of dirt berms in northern Iraq. The crew struck and successfully demolished two, but were called off the third by the headquarters managing the mission. They later found out those in charge were not able to provide an accurate rendering of fighters on the ground who were \"friendlies,\" nor the locations of enemy positions.\n\"Those guys needed something blown up, and we could have done it for them, but whatever comms they needed to happen just weren't happening,\" he says. \"They basically said, 'We can't confirm this, so we're not going to give you the air support to do that.'\"\nThe 34th was the second B-1 squadron to fly in the complex jumble of operations in Syria, after taking over the mission from the 9th Bomb Squadron, which returned in February.\n\"It was nice having another squadron fly six months before we go and do it,\" Chris says. \"There was a history of them doing it for however many months and nothing really happened. That gave us a warm fuzzy.\"\n\"It wasn't like flying over Nazi Germany or something like that,\" he adds. \"There's always the chance [of an incident], and you want to be on the lookout to make sure nothing was going to happen. You were cautious, but confident that you could do it.\"\nIndeed, Chris and his fellow airmen felt the basic procedures for operating in the increasingly crowded airspace – receiving targets and then dropping bombs – boiled down to matters of training and routine. Their impression differs sharply from their immediate predecessors in the 9th Bomb Squadron, who told U.S. News in May they were \" essentially building a war from scratch .\"\nAirmen in these theaters often wake up on a base not knowing where the day's missions will take them – either \"going north,\" as they call it, to Iraq and Syria, or \"going east\" to Afghanistan. U.S. involvement in that latter campaign continues to wind down, and the 34th bombers stopped flying there regularly toward the end of their deployment.\nRELATED\nU.S. Ends Failed Syrian Training Program, Starts Arming Rebels Directly\nThe challenges that face them, though, continue to grow and require their full attention. Another B-1 pilot who asked to be referred to only as Andrew described the routine experience of going three or four hours while forgetting to drink water, eat food or use the B-1's uncomfortable toilet, which is wedged between the cockpit's two rows of seats.\n\"There was just that kind of intensity in some situations,\" the captain says.\nAnd it won't be growing any less intense for American airmen anytime soon. Kramer, the B-1 commander, says the lines of fighting in Syria are steadily advancing southward, toward Islamic State group strongholds but also nearer to positions where forces loyal to Syrian President Bashar Assad continue to wage war against U.S.-backed rebel fighters. President Barack Obama has long called for Assad to leave power, but also has kept that domestic conflict at arm's length.\nThese factors, along with Russia's increasing role in the theater, muddle America's battlegrounds in the Middle East.\n\"Just as a commander, I would rather my guys fly in a less complicated spot,\" Kramer says. \"So it's concerning. At the same point in time, I realize the fight's going to evolve and every deployment is different. The next will be different than the last.\"\nTAGS: national security Syria Islamic State Afghanistan Iraq Air Force Bashar Assad", "external_links": ["http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe1kym%3Fsrc=usn_su", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe1kym%3Fsrc=usn_li&title=Kunduz%2C%20ISIS%20and%20the%20Complexities%20of%20the%20Modern%20U.S.%20Air%20War&summary=U.S.%20airmen%20discuss%20the%20harsh%20truths%20of%20fighting%20in%20an%20increasingly%20crowded%20Middle%20East%20arena.&source=U.%20S.%20News", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe1kym%3Fsrc=usn_rd&title=Kunduz%2C%20ISIS%20and%20the%20Complexities%20of%20the%20Modern%20U.S.%20Air%20War", "http://www.airforcetimes.com/story/military/pentagon/2015/06/05/many-anti-islamic-state-sorties-dont-include-airstrikes/28545307/", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe1kym%3Fsrc=usn_tw&via=usnews&text=Kunduz%2C%20ISIS%20and%20the%20Complexities%20of%20the%20Modern%20U.S.%20Air%20War", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe1kym%3Fsrc=usn_gp", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe1kym%3Fsrc=usn_fb"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T13:43:22.209+03:00", "highlightTitle": ""}