{"organizations": [], "uuid": "27cbe3a96570750a1f986b903baea7af3e2e0572", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4317387/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13843677.Debate_over_second_referendum_at_SNP_conference_axed/", "country": "GB", "title": "Debate over second referendum at SNP conference axed", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 24, "title_full": "Debate over second referendum at SNP conference axed (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:28:00.000+03:00", "replies_count": 31, "uuid": "27cbe3a96570750a1f986b903baea7af3e2e0572"}, "author": "Daniel Sanderson", "url": "http://www.heraldscotland.com/politics/13843677.Debate_over_second_referendum_at_SNP_conference_axed/", "ord_in_thread": 0, "title": "Debate over second referendum at SNP conference axed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A DEBATE over the timing of a second independence referendum due to take place at the SNP's conference has been abruptly axed.\nThe Law Society of Scotland had scheduled a fringe event entitled \"When will Scotland be ready for #IndyRef2?\" to take place on Thursday, in what was set to be the only debate examining a second referendum at the biggest gathering in the party's history.\nHowever, the society, which has been under scrutiny for its role in the investigation of property deals involving MP Michelle Thomson, has now been cancelled over fears that its impartiality could be called into question.\nA spokeswoman said: \"We were proudly non-partisan during the first referendum. We were concerned about some of the comments made about our fringe event at the SNP conference which made some people call our impartiality into question. That is why we have chosen to cancel this event.\"\nIt had been promised that the meeting would \"consider the pros and cons of pledging a new poll in the near or the more distant future.\" SNP leader Nicola Sturgeon has said she believes a second referendum is inevitable, but has been reluctant to discuss potential timescales other that predicting Scotland will become independent in her lifetime.\nThe Law Society has been criticised for its handling of the investigation into Ms Thomson's former solicitor, Christopher Hales, who was struck off for his part in 13 property deals that were closely linked to the MP in June last year.\nIt has strongly denied that a pro-independence campaigner on its staff was involved in a year-long delay in issuing a full report to the Crown Office, which then told police to begin an investigation within six days.\nShare article Promoted stories The Law Society raised the case twice informally with the Crown Office in December last year and just prior to the General Election in May, but did not reveal the names of Mr Hales's clients until after the general election. It later revealed that it had submitted a report on Christopher Hales to the Serious and Organised Crime Agency, now the National Crime Agency, in 2011.\nMs Thomson, who denies any wrongdoing, withdrew from the SNP party whip at Westminster after it emerged that Police Scotland had launched an investigation into transactions that involved her, which date back to 2010 and 2011.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-13T19:28:00.000+03:00", "crawled": "2015-10-13T16:43:23.820+03:00", "highlightTitle": ""}