{"organizations": [], "uuid": "6da532f66f0699959db1117010a945939118b3c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30167346/justices-to-review-bias-claim-against-top-pennsylvania-judge", "country": "US", "title": "Justices to review bias claim against top Pennsylvania judge", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Justices to review bias claim against top Pennsylvania judge - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "6da532f66f0699959db1117010a945939118b3c1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30167346/justices-to-review-bias-claim-against-top-pennsylvania-judge", "ord_in_thread": 0, "title": "Justices to review bias claim against top Pennsylvania judge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MARK SHERMAN\nAssociated Press WASHINGTON (AP) - The Supreme Court will hear a Pennsylvania death row inmate's claim that the state high court's chief justice had a clear conflict of interest and should have stepped aside from the case.\nThe court on Thursday added the case of Terrance Williams to its winter argument schedule. Williams was convicted of beating a church deacon to death when he was a teenager. Williams claimed the deacon had sexually abused him.\nHis Supreme Court appeal turns on the role played by Ronald Castille, chief justice of the state Supreme Court until his retirement last year. Castille was Philadelphia district attorney when Williams was tried and authorized the pursuit of a death sentence against Williams.\nCastille rebuffed Williams' request that he step aside from the case when it reached Pennsylvania's top court.\nWilliams' case came before the state Supreme Court after a lower court threw out his death sentence in 2012, five days before Williams was scheduled to be executed. The judge found that Philadelphia prosecutors withheld evidence that the victim was molesting boys.\nBut last year, the Pennsylvania Supreme Court unanimously reinstated the death sentence in a ruling that said Williams had the information in question and perjured himself when he claimed not to know 56-year-old deacon Amos Norwood and denied involvement in his killing.\nCastille wrote a separate opinion that criticized the judge who ruled in favor of Williams and the public defenders who represented him. He also defended his former colleagues in the prosecutor's office.\nThe justices will consider whether Castille's decision to remain involved in the case violated Williams' rights and also whether it matters that Castille did not cast the deciding vote in the case.\nIn February, Pennsylvania Gov. Tom Wolf declared a moratorium on the death penalty. The state's last execution was in 1999.\nThe case is Williams v. Pennsylvania, 15-5040.\n ", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T05:45:33.468+03:00", "highlightTitle": ""}