{"organizations": [], "uuid": "d4788b1411bb854abb922caee33833d9ed4f7ec7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/02/National-Enterprise/Images/151002_childsupport_031443814866.jpg", "site_section": "http://www.washingtonpost.com/wp-dyn/rss/politics/index.xml", "section_title": "Politics", "url": "https://www.washingtonpost.com/politics/for-men-in-prison-child-support-becomes-a-crushing-debt/2015/10/18/e751a324-5bb7-11e5-b38e-06883aacba64_story.html", "country": "US", "title": "For men in prison, child support becomes a crushing debt", "performance_score": 3, "site": "washingtonpost.com", "participants_count": 1, "title_full": "For men in prison, child support becomes a crushing debt", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:16:00.000+03:00", "replies_count": 0, "uuid": "d4788b1411bb854abb922caee33833d9ed4f7ec7"}, "author": "Eli Hager", "url": "https://www.washingtonpost.com/politics/for-men-in-prison-child-support-becomes-a-crushing-debt/2015/10/18/e751a324-5bb7-11e5-b38e-06883aacba64_story.html", "ord_in_thread": 0, "title": "For men in prison, child support becomes a crushing debt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For men in prison, child support becomes a crushing debt Resize Text Comments 10 By Eli Hager | The Marshall Project October 18 at 5:00 PM \nFERGUSON, MO. — Earl L. Harris did not owe child support when he was sent to prison in 1997 for selling marijuana. He now concedes that dealing drugs may have been a stupid move for a new father. \nBut Harris, then 19, had grown up poor and dropped out of school, and the only legitimate work available to young, black men like him, he says, was a temp job without benefits. \n“Nobody was hiring,” he said. “I got into hustling because I wanted to support my baby.” \nThe state of Missouri sent Harris to the penitentiary in Boonville, 250 miles from his home and baby daughter. His girlfriend moved on, later marrying someone else. After just two months in prison, Harris started getting the letters. \nChild support. You owe: $168. \nThey came once a month, piling up debt. \nChild support. You owe: $168. Arrears: $336. Arrears: $504. Arrears: $672. Plus interest and other fees. \nOf the 2.2 million people incarcerated in the United States, about half are parents, and at least 1 in 5 has a child support obligation. For most, the debt will keep piling up throughout their imprisonment: By law or by practice, child support agencies in much of the country consider incarceration a form of “voluntary impoverishment.” Parents like Harris, the logic goes, have only themselves to blame for not earning a living. \nBut that may be about to change. The Obama administration has authorized a new set of regulations that would reclassify incarceration as “involuntary,” giving parents the right to push the pause button on child support payments. The regulations are set to be published early next year and implemented by states by 2017. \nCongressional Republicans oppose the new policy. They argue that it would undercut the 1996 welfare reform act, which pressed states to locate missing fathers and bill them for child support so taxpayers wouldn’t bear the full burden of their children’s welfare. \n“I am fundamentally opposed to policies that allow parents to abdicate their responsibilities, which, in turn, results in more families having to go on welfare,” Senate Finance Committee Chairman Orrin G. Hatch (R-Utah) said in a speech in June on the Senate floor. Obama’s new regulations, he said, “would undermine a key feature of welfare reform, which is that single mothers can avoid welfare if fathers comply with child-support orders.” \nFrances Pardus-Abbadessa, head of child support enforcement for New York City, said: “The complaint we often hear is, ‘Why should incarcerated fathers, of all people, be the ones to get a break from their obligations — and at a cost to the taxpayer?’ ” \nAdministration officials and their supporters counter that billing fathers while they’re in prison does little but dig them deeper into debt. \n“Billing poor fathers doesn’t help poor mothers and kids become less poor,” said Jacquelyn Boggess, a poverty expert with the Center for Family Policy and Practice. \n“All it creates,” she said, “is a highly indebted individual.” Aggressive prosecution \nFor Earl Harris, the problem was keeping up. He had a job in prison, cleaning the kitchen, but it paid only $7.50 a month — well short of the $168 the state of Missouri was billing him. \n“Didn’t they know I was in prison?” he asks. “Weren’t they the ones that put me in there?” \nWhen he got out in 2001, the unpaid amount was listed on his credit report — and pursued by an agency with the power to garnish 65 percent of his wages, intercept his tax returns, freeze his bank account, suspend his driver’s license and, if he failed to pay, lock him up again. \nBy then, his debt had surged to more than $10,000. \nHarris entered barbering school but soon returned to drug dealing and was thrown back into prison for nearly a decade. Meanwhile, his child-support debt swelled to more than $25,000. \nHarris’s plight is not unusual. The Marshall Project interviewed nearly three dozen noncustodial parents in 10 states; they all left prison owing between $10,000 and $110,000 in child support. Mostly fathers who are disproportionately black and poor, these parents faced prosecution for not repaying the debt, even after their children were grown. \nAnd what they were able to pay did not necessarily go to their children or the mother. The state often kept their money as repayment for welfare, child care or Medicaid benefits that had been provided to the family while the dad was locked up. \nTo address the issue, the Obama administration began drafting new rules about four years ago. As currently written, the rules would forbid state child support agencies from classifying incarceration as “voluntary,” granting parents the legal right to a reduction in payments while they’re in prison, a right that does not exist in 14 states. \nThe rules would require agencies to inform incarcerated parents of this right and would encourage agencies to provide a reduction in payments automatically. And they would urge states to transfer all payments directly to custodial parents — mostly mothers — and their children. \nThe administration proposal would provide about $35 million over the next five years to modernize the child support system and to provide job training, job placement, bus fare, and other services to fathers facing prosecution for nonpayment. \nThe rule “will make sure that arrears don’t accumulate endlessly while a parent is incarcerated,” said Vicki Turetsky, President Obama’s commissioner of child support enforcement. “Our goal is to collect, month by month, for kids. We can do that when parents are employed, not in debt.” \nHatch and House Ways and Means Committee Chairman Paul Ryan (R-Wis.) have introduced legislation to block the new rules, though neither lawmaker has pushed to advance the measure. \nRon Haskins, a child support expert at the Brookings Institution, said he and other conservatives actually support parts of the new regulations. But they worry, he said, that the policy “could begin a long process of undermining the child support concept, which they strongly believe in.” Stuck in debt \nBack in North St. Louis, Earl Harris, now 38, has put in his hours as an apprentice barber and is one written test away from getting his license. In the meantime, he is living in a halfway house and working at a factory across the river in Illinois, packaging Febreze canisters and Swiffer mops. \nHis hours are 4 p.m. to midnight, though he arrives an hour early to make sure he doesn’t lose his spot to another temp worker waiting outside the building in hopes of getting a shift. After work, he typically gets a cousin to drive him back to his dorm room, where he sleeps from 2 a.m. to 6 a.m. before heading to his daily support group for fathers. \nBy 8 a.m. the dads are circled up, talking about having kids and debt. They have come because the program helps them find a job, develop strategies for handling their arrears and work on their parenting skills. They also get free legal help. Many of them were incarcerated, almost exclusively for selling drugs, and everyone is wearing a jacket and tie, the uniform of employment. \nOne father, Louis Moore, said his debt soared to almost $60,000 while he was inside. Allan Newcomer’s is more than $68,000. \n“Everybody in the penitentiaries was getting the letters,” Newcomer said. \nLisl Williams, a former judge who now works with the fathers, said even if they spend their money on food, clothes or toys for their children, it does not reduce their debt. In many cases, she said, the whole family — the mother, aunts, uncles, cousins — chips in to help pay it, and then the money they pay goes to the government as repayment for welfare they received long ago. \nBecause the fathers don’t have large incomes to garnish, bank accounts to tap or property to seize, she adds, they are more likely to face re-incarceration for not paying their arrears. Corey Mason in St. Louis. (Whitney Curtis/For The Washington Post) \nAnother dad, Corey Mason, said he was incarcerated and already racking up child support debt when he got a notice saying he might have another child by a different mother. He was instructed to go to the medical wing, get a DNA swab and send it to the agency. When they confirmed his paternity, he started getting a new set of child support bills. \nMason sent several handwritten letters to the agency explaining that he was in prison. He said he never got a response. \nNow that he’s out, Mason has a job at the Marriott hotel downtown. He works the graveyard shift, cleaning, shutting down the bar, providing towels to customers who ask for extra. Because the child support agency garnishes well over half his weekly paycheck, he turned down a recent promotion. \n“I want to grow in the company. But I don’t want to work that much harder if they’re just going to take all of it to pay for history,” Mason said. \n“I know I’m the bad man. But I’m working harder now than I ever have, and it’s like this is designed to keep me behind, backed up against the wall, in debt for the rest of my life.” Evading responsibility \nObama has frequently scolded the same absentee fathers who now stand to benefit from his regulations. “Too many fathers are M.I.A., too many fathers are AWOL, missing from too many lives and too many homes,” he told a Chicago audience in 2008 as a candidate for president. \nSome fathers interviewed for this story had multiple children — one man said he had 12 — by different mothers. Many seemed less than eager to find employment. A few served time for domestic violence. \nSome mothers say these men do not deserve to be freed of their debt. \n“There’s a real tension here, as a matter of public policy,” said Joan Entmacher, an expert on family poverty at the National Women’s Law Center. “There are absolutely fathers who evade their responsibilities, saying, ‘Oh, I can’t pay that,’ and not even trying. We don’t want to simply reward that attitude.” \nEven if a father is a deadbeat, however, the evidence is clear: Noncustodial fathers are far more likely to pay child support, and otherwise reengage with their families, if payments are manageable. \nIn a 2012 study by the Center for Policy Research, a private nonprofit research organization, fathers paid a much higher percentage of their monthly obligations when offered relief from unpayable state-owed debt. In studies in Maryland, Illinois and California, fewer than 15 percent remained noncompliant once the old debts were reduced and they were given a schedule of regular payments. And the fathers most likely to abide by “debt compromise” agreements were those who had been incarcerated. \nBoggess, the child support analyst, said that trying to collect the accumulated debt is “like squeezing an empty bottle and hoping something comes out. \n“These fathers are poor, period. Their arrears are uncollectible, period,” she said. “They’ve never even met anyone who had $30,000.” Kevin Johnson, 30, far left, and Milan Woodard, 31, second from left, listen during a Fathers' Support Center session in Wellston, Mo., in September. (Whitney Curtis/For The Washington Post) ‘The debt will be permanent’ \nMany states have already taken action. In 36 states and the District, incarceration is no longer officially considered “voluntary” impoverishment, and an imprisoned father is legally entitled to have his monthly child support bill modified to as little as $50 a month or, in rare cases, stopped altogether. \nBut it is still up to the father to prove he is incarcerated, and then to file for the reduction. This involves navigating a maze of paperwork from prison, usually with no lawyer, irregular access to phones and, in many cases, an eighth- or ninth-grade education. \nThe most common pitfall, said Bo Twiggs, the director of UpNext, a program in New York City that helps recently incarcerated fathers, is that the incarcerated dad has no idea his child support is piling up because he isn’t getting the notices. The debt keeps compounding — and federal law prohibits the reduction of child support bills retroactively. \n“It’s hard for these fathers to understand that they can’t wait, they can’t adjust to life in prison before dealing with child support, that they need to take action immediately because the debt will be permanent,” Twiggs said. “That’s really counterintuitive.” \nWhen these fathers get out of prison, they often don’t notice the debt until the state begins pursuing it, “which forces them to go underground instead of rejoining the formal economy,” said Turetsky, Obama’s commissioner of child support enforcement. \nIndeed, research shows that the two most important factors in a former prisoner’s successful reentry into the community are employment and positive relationships with family. Both of these are hindered by the aggressive pursuit of child support arrears: Garnishing 65 percent of a father’s paycheck, so he is tempted to earn cash off the books; suspending his driver’s license so he can’t get to work; sending him bills that are so far beyond his capacity to pay that he keeps his distance from his family. \n“I see it all the time,” Twiggs said: “Not reengaging with the family. Noncompliance with parole and child support. Under-the-table efforts at income. Self-defeat, high anxiety, general institutional distrust. All of that is triggered by this absolutely overwhelming, impossible feeling of debt.” Focusing on parenthood \nJust a few months out of prison, Earl Harris is not sure whether his debt has been written off as uncollectible. He hasn’t received any communication from the child support agency in more than a year. \nFor the time being, he is focused on being a dad. He phones his daughter, now 21, asking her about her job. He has a 13-year-old son, now, too. \n“The boy is very shy,” he said. “I mean, I was away for so long. . . . He doesn’t know me how he should.” \nThe other day, they went bowling, Harris and his son. He tried to get the conversation rolling, asking questions about Black Ops, one of the boy’s favorite video games, and about the upcoming school year. \n“Hopefully, when I get a paycheck, I’ll be able to buy him school clothes,” Harris said. \nOne night, after a day of work at the factory, Harris couldn’t reach his cousin for a ride. If he didn’t make it back to the halfway house in time, he would get a violation — which could delay his plans to move in with his child. \nIt was midnight. He’d been standing for eight hours, and he was across the river in Illinois. \nHe started walking, as fast as he could, in the direction of St. Louis. \nThe Marshall Project is a nonprofit news organization that focuses on the U.S. criminal justice system. Sign up for its newsletter , or follow The Marshall Project on Facebook or Twitter . politics Success! Check your inbox for details. You might also like: Please enter a valid email address Sign Up", "external_links": [], "published": "2015-10-19T00:16:00.000+03:00", "crawled": "2015-10-19T00:56:21.863+03:00", "highlightTitle": ""}