{"organizations": [], "uuid": "7f59ff4803bb16799a8a1d704e4089d3208f32c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "harvardpolitics.com", "main_image": "http://harvardpolitics.com/blog/wp-content/uploads/2015/10/Bihar_CM_Nitish_Kumar_calls_on_Prime_Minister_Narendra_Modi_.jpg", "site_section": "http://harvardpolitics.com/feed/", "section_title": "Harvard Political Review", "url": "http://harvardpolitics.com/world/bihar-2015-indias-misunderstood-state-election/", "country": "CA", "title": "Bihar 2015: India’s Misunderstood Election", "performance_score": 0, "site": "harvardpolitics.com", "participants_count": 1, "title_full": "Bihar 2015: India’s Misunderstood Election", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T23:23:00.000+03:00", "replies_count": 0, "uuid": "7f59ff4803bb16799a8a1d704e4089d3208f32c3"}, "author": "Ashim Vaish", "url": "http://harvardpolitics.com/world/bihar-2015-indias-misunderstood-state-election/", "ord_in_thread": 0, "title": "Bihar 2015: India’s Misunderstood Election", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Ashim Vaish Indian Prime Minister Narendra Modi meets with Bihari Chief Minister Nitish Kumar in March 2015. \nWith each passing day, the Bihari electoral battlefield intensifies. Candidate-soldiers continue to stack their arsenals with political weaponry—in-depth demographic data, jingoistic slogans, and mudslinging campaigns. Impassioned and ingrained with dogma, each team trudges to the battlefield, vying for victory in the Hindi Heartland. Headlines emphasize the stakes: control of Bihar is crucial in the war for Indian leadership. \nIn the 2014 Indian general elections, the ten-year incumbent Indian Congress Party suffered a humiliating defeat at the national level at the hands of Prime Minister Narendra Modi’s right-wing Hindu nationalist Bharitaya Janta Party (BJP). The bitter losers of the election are eagerly awaiting a rematch, which they see in the Bihar state election. To the Congress Party, this contest represents their best bet to regain national dominance. Given the stakes in this particular election, Modi’s opponents have allied together in hopes of weakening the BJP’s grip on power. This coalition is composed of the Indian National Congress Party and two former rivals: incumbent Chief Minister Nitish Kumar alongside his Janta Dal United and Lalu Prasad Yadav, president of Rashtriya Janta Dal. Although the three parties may have inconsistent ideologies, a common enemy unites them—the unlikely alliance hopes to dethrone the Modi-led government in one fell swoop. \nBut in the center of all this dramatic political tension, much of reality seems to have been lost. Despite all the hyperbole and suggestions that the elections have high stakes, the Bihar contest may not hold as much gravity as the prevailing narrative suggests. \nThe debate in Bihar so far has focused on state-specific issues and is thus unlikely to affect national political dialogue. At a more practical level, the results of the Bihar elections have little hope of significantly reassigning seats in the national legislature. The persistence of caste politics in the region only further limits the scope of the upcoming vote. Put simply, politics in Bihar are unique to the state and the consequences of the election are unlikely to extend beyond its borders. \nCan’t Touch the Center \nThe dialogue in the Bihar election is developing along state-specific lines, not national ones. Nitish Kumar’s campaign platform focuses on his spectacular performance as Chief Minister of the state over the past ten years. His most notable achievements as Bihar’s top executive—and the central talking points of his campaign—have been the establishment of Jankari , an electronic portal for citizen to request government-owned information; the launching of the Mukhyamantri Balika Cycle Yojna , a project encouraging girls to attend school by giving them bicycles; and the implementation of E-Shakti , an initiative aimed at alleviating rural unemployment. \nAlong the same lines, Modi initiated and framed an agenda of development and good governance within Bihar for the carefully constructed coalition of the BJP at pre-election rallies in early August. Countering the incumbent’s rhetoric, the BJP coalition has initiated a campaign poking holes in Kumar’s achievements and emphasizing the persistence of poverty and unemployment in Bihar during his tenure. In essence, the primary discourse—as it should be—is about the socioeconomic situation in Bihar. The grounding of each group’s election platforms to state-based issues prevents any logical extension of the results to the central government’s performance. \nIt is only the erratic Rahul Gandhi, vice president of the Indian National Congress, and Yadav—both of whom are in Kumar’s coalition—who seem to have missed the point. Both seem bent on framing the Bihar contest as a referendum on Modi and the BJP’s leadership. Distracted by an effort to link the Bihar election to Modi’s national standing, Gandhi forgot to endorse his coalition’s own chief ministerial candidate. In a similar vein, Yadav has consistently redrawn attention to Modi via cheap jibes, including a now-viral mimicry of the prime minister at a recent campaign rally. Both Yadav and Gandhi are dead-set on convincing their party members and the media of the overblown importance of this election. \nNot only are the election’s results unrelated to the central government’s performance, but they are also inconsequential to the seat division of the national legislature. The BJP and its allies already possess a comfortable majority in the lower house of the Indian parliament, meaning that they have little to gain in that arena. The vote promises no significant change, meanwhile, to the composition of the upper house, where Modi’s party stands to gain. The BJP and its allies combined need 68 additional seats to achieve a majority in the Rajya Sabha, or upper house. Winning the Bihar election would only bring them 16 more. Since the elections cannot cause any consequential structural change at the center, even the best case scenario for the BJP would not ease the passage of their legislation. \nCaste Politics \nWhile both parties continue to frame the political dialogue around Bihar’s developmental issues, they have intentionally failed to mention a key element to both their strategies. Caste politics undeniably tie into the campaign strategies of both coalitions. However, this strategy is not typical. While certainly pervasive in Bihar, caste politics is not a significant feature of national or other state campaigns. The uniqueness and importance of caste divisions in determining the Bihar election further prevents the generalization of Bihar’s results to the national scale \nBoth the Modi-led coalition and Kumar’s alliance deliberately chose their candidates according to a micro-level caste mapping of Bihar. According to this strategy, candidates of a certain caste are placed in constituencies dominated by people of the same caste. Kumar belongs to the Kurmi caste and has rallied the Kurmi community in the past. Accordingly, Kumar has decided to field Kurmi candidates in Kurmi dominated districts. The recent list of candidates Kumar released indicates his intention to do the same with candidates belonging to the Yadav caste. The incumbent’s decision to ally with his former arch-rival’s party, the RJD, was at least partially motivated by the vote bank of the Yadav caste that the alliance would bring to him. \nThis same list of candidates also revealed that 55 percent of the Kumar-led coalition’s candidates are of an OBC status, a collective term used by the central government to classify socially and educationally disadvantaged castes. The selection of these candidates seems like an attempt to steal votes from the Modi-led coalition’s leaders, especially targeting the Dalit and Mahadalit communities that fall under the OBC status. This large representation of OBC only adds weight to the case that Kumar’s strategy employs caste-based analytics. \nThis caste consideration is certainly present in the Modi-led coalition’s strategy as well. While Modi emphasizes the BJP’s agenda of good governance, BJP president Amit Shah has openly showboated his plan to counter Kumar’s arrangement. Like Kumar, the BJP already has an established vote bank —members of the Brahmins, Rajputs, Bhumiars and other upper castes. But the BJP’s new coalition with the traditionally lower-caste RLSP and HAM have enabled them to dip into the same communities to which Kumar is trying to reach out, the Dalit and Mahadalit. To tap further into Kumar’s pool, Shah has decided to place Kurmi candidates in Kurmi dominated areas, and Yadav candidates in Yadav dominated areas. This lining up of candidates by caste highlights the accepted wisdom of politics in Bihar—castes determine elections. Comparatively, caste politics play a much more muted role at the national level. \nModi At Ease \nSome people who acknowledge the unlikelihood that the Bihar elections will significantly impact the BJP’s dominant position in Indian politics still believe that the results could damage Modi’s standing within his own party. However, the prime minister’s unchanging popularity after his party’s crushing defeat in the nation’s capital earlier this year indicates that he should come out relatively unscathed. Even after Modi’s aggressive rallies , the BJP only secured a meager three out of 70 seats in Delhi, conceding heavy losses in a landslide to the Aam Aadmi Party. Nevertheless, just months later, a Bengaluru-based political analytics agency still polled the leader’s popularity at 74 percent . \nSome suggest that the Bihar elections are different because Modi is personally leading the charge. However, the prime minister’s active role is not unusual. The BJP unashamedly played off Modi’s popularity in all five state contests since the general elections of 2014. Not unlike in Delhi, Modi spoke at 11 campaign rallies in Haryana and 20 in Maharashtra. Furthermore, journalists widely credit his personal presence for the massive electoral gains in Jharkhand, Jammu, and Kashmir . \nIt only makes tactical sense for the BJP to play the Modi card. Projecting the prime minister and party figurehead as the face of the campaign instead of officially declaring a chief ministerial candidate has returned a 100 percent reelection rate for BJP officials since the last general election. Modi’s developmental rhetoric will find particularly fertile ground with the burgeoning young population of Bihar . Political commentators across the globe commend his ability to capture the imagination of the youth. But even if he fails, precedent dictates his political standing will hardly be scratched. \nWhile the Bihar election might not have far reaching implications, the deeply entrenched belief it does on either side promises to deliver a nail biting finish. The polls indicate that the race is too close to call at this point. As Election Day nears, the war cries will only get louder and the tactics will only get dirtier. Surely, the hyperbolic statements about the significance of the Bihar battleground will grow along with them. At least we now know what not to expect. \nImage source: Wikimedia // Narendra Modi", "external_links": [], "published": "2015-10-15T23:23:00.000+03:00", "crawled": "2015-10-16T04:59:46.869+03:00", "highlightTitle": ""}