{"organizations": [], "uuid": "018b7529be95bca152e0a8a3fc9284755269f68e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/42/a0/1ce99fe94d449d7f0384c1e55b36/151002-david-brock-ap-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/david-brock-responds-hillary-donors-214377", "country": "US", "title": "David Brock to Hillary Clinton 2016 donors: “Buck up and chill out”", "performance_score": 1, "site": "politico.com", "participants_count": 7, "title_full": "David Brock to Hillary Clinton 2016 donors: “Buck up and chill out” - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T09:37:00.000+03:00", "replies_count": 6, "uuid": "3423adaf2932733915508fd2bf84d4cca01f9af4"}, "author": "Kenneth P. Vogel", "url": "http://www.politico.com/story/2015/10/david-brock-responds-hillary-donors-214377#post-0", "ord_in_thread": 0, "title": "David Brock to Hillary Clinton 2016 donors: “Buck up and chill out”", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of Hillary Clinton’s leading liaisons to big-money Democrats on Thursday privately relayed a simple message to major donors who might be concerned about the struggles of their party’s leading presidential candidate: “buck up and chill out.” David Brock, the self-described former “ rightwing hitman”-turned-Clinton enforcer , in a Thursday afternoon donor conference call, asserted that the controversies buffeting Clinton’s campaign were predictable, exaggerated and sexist ― but can be easily diffused, according to a source familiar with the call.\n“We can’t let the garbage get in the way of electing the best candidate in this race and the first woman president,” Brock told donors, according to the source. Brock said at least some of the scrutiny of Clinton’s handling as Secretary of State of the 2011 attacks in Benghazi and her personal email use may be traced to “the impulse in our culture to keep the woman down,” said the source.\nBut he asserted the email controversy and “the whole Benghazi hoax” are “fizzling out.” Clinton is scheduled to testify before the House Benghazi committee later this month.\nBrock did not dispute this account of the call, but he declined to comment on its contents or participants.\nAccording to the source familiar with it, the call attracted dozens of top donors, ranging from Clinton loyalists to those less enthusiastic about Clinton, like tech entrepreneur Paul Egerman, an Elizabeth Warren confidant who is considered a bellwether among major liberal donors.\nClinton super PAC fundraisers are working to win over reluctant major donors, hoping to fill the coffers of super PACs that plan to saturate the airwaves with ads defending Clinton and savaging her opponents. While the main such super PAC, Priorities USA Action, recently revealed it has raised $40 million this year, it still lags significantly behind the super PAC backing GOP fundraising leader Jeb Bush. Clinton backers worry about whether they'll have enough money to rebut attacks from third-party conservative groups like those backed by the Koch brothers.\nBrock’s pro-Clinton political groups American Bridge, Correct the Record and Media Matters also have stepped up their 2016 fundraising in preparation. They organized Thursday’s call, which was ostensibly billed as a discussion of the Clinton-defense model articulated in Brock’s recently released book, “Killing the Messenger; The Right-Wing Plot to Derail Hillary and Hijack Your Government.”\nBut the source familiar with the call said it was equal parts pep rally and gripe session.\nDonald Trump, Hillary Clinton dominate Facebook in early states By Hadas Gold\nThere was some glee over recent boasts by House Majority Leader Kevin McCarthy (R-Calif.) that the House GOP’s investigation into Benghazi had hurt Clinton in the polls, which Democrats interpreted as an admission of political motivation.\nBut one donor still expressed frustration that Clinton’s message was being drowned out amid the email controversy, according to the source. Another urged Brock to sic his groups more aggressively against Clinton’s surging rival for the Democratic presidential nomination Sen. Bernie Sanders of Vermont, who has, in fact, been the subject of at least one opposition research hit pushed by Brock’s Correct the Record group. Notably, the source said, no donors expressed concern about the prospect that Vice President Joe Biden might join the race .\nFormer Michigan Gov. Jennifer Granholm, an advisor to Correct the Record who also participated in the call, sounded a cautionary note, according to the source. She warned donors to expect continued scrutiny of Clinton’s emails, partly because the State Department will continue releasing her emails over the course of the next several months, but she predicted Clinton should be able to move beyond the controversy by the time primary voting starts early next year.\n<div", "external_links": ["http://www.huffingtonpost.com/entry/hillary-clinton-bernie-sanders-jeremy-corbyn_55f73339e4b00e2cd5e79e11"], "published": "2015-10-02T09:37:00.000+03:00", "crawled": "2015-10-02T22:01:37.456+03:00", "highlightTitle": ""}