{"organizations": ["White House", "AP Photo/Jacquelyn Martin"], "uuid": "b5ce0b9ef5089f7b3c131b33e146ca9d97fd46fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "http://images.worldnow.com/AP/images/9068333_G.jpg", "site_section": "http://www.fox8live.com/category/13571/political-news?clienttype=rss", "section_title": "FOX 8 News WVUE-TV - Political - Headline", "url": "http://www.fox8live.com/story/30319616/bookended-by-tragedy-bidens-storied-career-nears-the-end", "country": "US", "title": "Bookended by tragedy, Biden's storied career nears the end", "performance_score": 0, "site": "fox8live.com", "participants_count": 0, "title_full": "Bookended by tragedy, Biden's storied career nears the end", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:16:00.000+03:00", "replies_count": 0, "uuid": "b5ce0b9ef5089f7b3c131b33e146ca9d97fd46fb"}, "author": "", "url": "http://www.fox8live.com/story/30319616/bookended-by-tragedy-bidens-storied-career-nears-the-end", "ord_in_thread": 0, "title": "Bookended by tragedy, Biden's storied career nears the end", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Biden", "Martin", "Barack Obama", "Jill Biden", "Biden", "JOSH LEDERMANAssociated Press"], "text": "Mobile Apps Bookended by tragedy, Biden's storied career nears the end (AP Photo/Jacquelyn Martin). Vice President Joe Biden, with his wife Dr. Jill Biden, and President Barack Obama walk toward the Rose Garden of the White House on Wednesday, Oct. 21, 2015, to announce that Biden will not run for the presidential nominat... (AP Photo/Jacquelyn Martin). President Barack Obama hugs Vice President Joe Biden as Biden waves at the end Biden's announcement in the Rose Garden of the White House in Washington, Wednesday, Oct. 21, 2015, that he will not run for the presidential no... (AP Photo/Jacquelyn Martin). President Barack Obama listens as Vice President Joe Biden speaks in the Rose Garden of the White House in Washington, Wednesday, Oct. 21, 2015, to announce that he will not run for the presidential nomination. By JOSH LEDERMANAssociated Press \nWASHINGTON (AP) - Joe Biden's storied political career will come to an end much the way it started nearly half a century ago: shaped by crushing personal tragedy that shook his deep-seated confidence in his own ability to lead. \nIn deciding not to run for president, Biden turned away from months of intensive preparations and countless hours that had put him on the verge of a third presidential campaign, with almost everything ready to go except the candidate himself. \n\"Unfortunately, I believe we're out of time - the time necessary to mount a winning campaign,\" Biden said, flanked by his wife and President Barack Obama in an extraordinary appearance in the Rose Garden. \nBiden's world ground to a halt in May when his son died of brain cancer. For the vice president, 46-year-old Beau Biden's death ended any possibility that the popular former Delaware attorney general would carry on his father's legacy, perhaps with a presidential campaign of his own. \nEven months later, when Biden began anew to seriously consider running, he steadfastly refused to be rushed, and said the decision hinged on whether he and his family had the emotional mettle to campaign while still roiled by grief. \nIn fact, Biden had predicted his denouement in September, when he said he might not be ready to make a decision before the realities of the campaign calendar would make the decision for him. \"If that's it, that's it,\" he said. \nBiden, who will turn 73 next month, will probably never again appear on a ballot. So his decision to forego another run for the White House sets him on a glide path toward the end of his long turn on the national political stage, which began in 1972 and will culminate when the Obama administration ends in early 2017. \nAlthough Biden hasn't said exactly what he'll do after leaving the White House, he has told friends he has no plans to retire in a traditional sense. He's previously discussed starting a foundation, launching an institute at the University of Delaware or becoming a special envoy if called upon by future administrations, said several friends and aides, who requested anonymity to disclose private conversations. \nAnd under a picturesque blue sky in the Rose Garden, Biden hinted at another venture in his future: a \"moonshot\" to cure cancer, sparing other families the profound loss that his has endured. \n\"I'm going to spend the next 15 months in this office pushing as hard as I can to accomplish this,\" Biden said, calling his son Beau \"our inspiration.\" \nYet in a bittersweet reminder that the job he's always wanted is the one he'll never attain, he added, \"If I could be anything, I would have wanted to be the president that ended cancer, because it's possible.\" \nFor Biden, the decision to bow out means his political career will have been bookended by heartbreak and adversity that robbed him of the people he loved most. \nThe scrappy lawyer from Scranton, Pennsylvania, was 27 years old when he was elected to county council harboring much greater aspirations. Yet a month after Biden was elected to the Senate at age 29, his wife and baby daughter died when their car collided with a tractor-trailer. \nBiden considered relinquishing his seat, but instead was sworn in at the hospital where his sons, Beau and Hunter, were recovering. \nOver six terms in the Senate, he rose in the ranks to chair the Senate's judiciary and foreign relations committees, developing broad expertise in global affairs and presiding over contentious Supreme Court confirmation hearings for Clarence Thomas and Robert Bork. He was perhaps most proud of his work authoring the Violence Against Women Act, which Biden still brings up regularly. \nWith a penchant for speaking his mind, Biden developed a reputation for a plainspoken, unpredictable approach to politics. Although it frequently got him in trouble, some Democrats suggested his freewheeling style was uniquely suited for this year's presidential campaign. \nBiden ran for president twice before; neither venture was successful. \nHis most recent attempt, in 2008, ended after he garnered less than 1 percent in the Iowa caucuses. His first run in 1987 ended even quicker, following allegations he plagiarized some speeches from a British politician. A few months later, he had a pair of surgeries for brain aneurysms, and said doctors had told him the campaign might have killed him. \nThrough it all, the sprawling Biden clan of siblings, kids and grandkids was at the center of his orbit, and his daily trips back home to Delaware on an Amtrak train became a thing of lore in Washington, where most lawmakers live nearly full time when Congress is in session. Not Biden. \n\"Our whole family - and this sounds corny - but we found purpose in public life,\" Biden said. \n___ \nFollow Josh Lederman on Twitter at: http://twitter.com/joshledermanAP Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-22T12:16:00.000+03:00", "crawled": "2015-10-22T12:24:47.781+03:00", "highlightTitle": ""}