{"organizations": [], "uuid": "6c2048f81cf8c6e737a7a47b5a94baba984e22f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fox8live.com", "main_image": "", "site_section": "http://www.fox8live.com/category/13571/political-news?clienttype=rss", "section_title": "FOX 8 News WVUE-TV - Political - Headline", "url": "http://www.fox8live.com/story/30163725/epa-issues-new-ozone-standard-setting-up-clash-with-gop", "country": "US", "title": "EPA issues new ozone standard, setting up clash with GOP", "performance_score": 0, "site": "fox8live.com", "participants_count": 0, "title_full": "EPA issues new ozone standard, setting up clash with GOP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T22:22:00.000+03:00", "replies_count": 0, "uuid": "6c2048f81cf8c6e737a7a47b5a94baba984e22f9"}, "author": "", "url": "http://www.fox8live.com/story/30163725/epa-issues-new-ozone-standard-setting-up-clash-with-gop", "ord_in_thread": 0, "title": "EPA issues new ozone standard, setting up clash with GOP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["MATTHEW DALYAssociated Press"], "text": "EPA issues new ozone standard, setting up clash with GOP By MATTHEW DALYAssociated Press \nWASHINGTON (AP) - The Obama administration set a new national ozone standard Thursday, tightening limits on the smog-forming pollution linked to asthma and respiratory illness. \nThe Environmental Protection Agency said the new standard of 70 parts per billion will reduce exposure to dangerous ozone pollution and prevent thousands of asthma attacks, emergency room visits and even premature deaths. \nThe new standard is below the current standard of 75 parts per billion but at the high end of a range announced by the EPA last fall. \nThe move fulfills a long-delayed campaign promise by President Barack Obama, but sets up a fresh confrontation with Republicans already angry about the administration's plans to curb carbon pollution from coal-fired power plants and regulate small streams and wetlands. \nBusiness groups said a new ozone standard is unnecessary and could jeopardize jobs. \nEnvironmental and public health groups also were unhappy. They said the new standard was a step in the right direction but did not go far enough. \nEPA Administrator Gina McCarthy said her job is to set science-backed standards that protect the health of the American people. \n\"Put simply, ozone pollution means it hurts to breathe for those most vulnerable: our kids, our elderly and those suffering from heart and lung ailments,\" McCarthy said. \"Today's action is one of the most important measures we can take for improving public health, reducing the costs of illness and protecting our children's health.\" \nHarold Wimmer, president and CEO of the American Lung Association, said the new standard \"simply does not reflect what the science shows is necessary to truly protect public health.\" \nThe lung association and other groups have pushed for an ozone limit of 60 parts per billion, saying it would have given Americans much greater health protections. \nThe updated standards will reduce exposure to dangerous ozone pollution and prevent thousands of asthma attacks, emergency room visits and even premature deaths, Janet McCabe, an acting assistant EPA administrator, said in an interview. \nPublic health benefits of the new standard are estimated at $2.9 billion to 5.9 billion annually as of 2025, compared with estimated annual costs of $1.4 billion, McCabe said. \nBusiness groups reacted harshly. The National Association of Manufacturers and other groups had lobbied the White House in recent months and spent millions on a TV ad campaign decrying the pending ozone rule as an overreach and a job killer. \n\"We know that this regulation could have been worse, but it still feels like a punch in the gut,\" said Tom Riordan, president and CEO of the Wisconsin-based Neenah Enterprises Inc. and task force leader for the manufacturers group. \n\"Manufacturers are tough and resilient, but when Washington puts politics above job creation, we still pay a price,\" Riordan said in a statement. \nManufacturers across the country, especially smaller companies, \"will be forced to choose between navigating this rule and hiring new workers, between complying with Washington's mandates and giving raises to their employees,\" he said. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-01T22:22:00.000+03:00", "crawled": "2015-10-01T22:29:50.343+03:00", "highlightTitle": ""}