{"organizations": [], "uuid": "247331e89d5b4505c30ede7e1a0e02d4f415e2ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/08/12/Interactivity/Images/crop_mobileWas8952122.jpg", "site_section": "http://www.washingtonpost.com/opinions", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/the-sanders-trump-magical-mystery-tour/2015/10/13/d9fdfc3e-71e9-11e5-8248-98e0f5a2e830_story.html", "country": "US", "title": "The Sanders-Trump magical mystery tour", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "The Sanders-Trump magical mystery tour - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "247331e89d5b4505c30ede7e1a0e02d4f415e2ff"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/the-sanders-trump-magical-mystery-tour/2015/10/13/d9fdfc3e-71e9-11e5-8248-98e0f5a2e830_story.html", "ord_in_thread": 0, "title": "The Sanders-Trump magical mystery tour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump (L) in Los Angeles in July and Bernie Sanders (R) in Washington in March. (-/Agence France-Presse via Getty Images) By Kathleen Parker Opinion writer October 13 at 7:55 PM Follow @kathleenparker Barrels of ink and galaxies of pixels have been sacrificed to solving the mystery of the spectacular rise of Bernie Sanders and Donald Trump.\nPeople are angry. We get it. But there’s more at work than mere frustration. We are at a philosophical hinge point that feels more acute than in elections past.\nKathleen Parker writes a twice-weekly column on politics and culture. She received the Pulitzer Prize for Commentary In 2010. View Archive Facebook RSS The equally irascible but otherwise antonymic Trump and Sanders personify these differing philosophies, which were clarified by Sanders during Sunday’s interview on NBC’s “Meet the Press.”\n“Are you a capitalist?” asked host Chuck Todd.\n“No,” said Sanders. “I’m a Democratic Socialist.”\nAll heads on the political panel, including my own, snapped to attention. Did he just say he’s not a capitalist?\nThat Sanders is a socialist is no secret. He has said so often enough, and his proposed policies aimed at worker- and consumer-owned economic institutions confirm as much.\nHis answer was shocking, nevertheless, because surely no one hoping to become president would dare admit wanting to fundamentally change the nation’s economic system. A few regulations here and there, sure. But wholesale socialism, albeit alongside a political democracy, however that works? Thus far, there’s no such model in the world, according to Sanders himself. But it sounds vaguely reminiscent of a 1960s-style commune where everybody was One and nobody was rich or poor and it was, like, far out. If somewhat odoriferous.\nSanders’s remark was refreshing, if also self-defeating. Most politicos would have said something like, “Of course I’m a capitalist, but I want to make sure everyone has a shot at reaping the rewards of a capitalist society. This requires some changes at the regulatory level.”\nFurther to Sanders’s truth-or-dare spirit, he turned the question on Todd: “When one of your Republican colleagues gets on the show, do you say, ‘Are you a capitalist?’ ”\nWell, no, because everyone else is capitalistic to varying degrees. Most people become capitalists when they start earning a paycheck and see how much of their earnings goes to taxes. Actually, this is when many become Republicans. Except for guilty trustafarians, students and their professors, most socialists are probably born of low wages — a thought for Republicans refusing to raise the minimum wage.\nOn the flip side, we find Trump — everywhere. The anti-Sanders, he’s Mag-na Capitalist. A boastful, bombastic billionaire, even his coif screams “money!”\nBut contrary to early characterizations, neither he nor Sanders is a sideshow to this presidential election. For now, or until Jeb and Hillary share a joint, they’re the Main Event. What wouldn’t one give to witness a debate between Trump and Sanders? Their entertainment value aside, both have provided a valuable service by putting a fine point on the essential question: What kind of country should we be — capitalist, socialist or somewhere in between?\nThe Republican answer is clear. Conservatives think families, towns, cities and nations function best when government stays out of the way as much as possible, allowing the marketplace to organically thrive, create, innovate, reward and expand.\nMost Democrats also believe in capitalism, just so long as nobody gets too rich or too poor (unless the former are Democrats). Finding ways to more equitably distribute wealth is the proper role of government, in their view, though the question, as always, is how.\nHow do we protect capitalist principles while also nurturing an environment that maximizes opportunity for all? Do we seek equal access or equal outcomes? Most savvy politicians decry the latter, but not Sanders. On this, he is also perfectly clear.\nLogic, of course, leads not to subsidizing but to capitalizing. Then, too, one must concede, logic doesn’t stop for turtles. Pure capitalism is heartless and leaves too many behind, while overregulated markets and industries stifle productivity and growth. What we seek is balance. Yet what we have are Sanders and Trump.\nThe gut understands their appeal. Sanders is everyone’s favorite college professor, an old hippie who never gave it up. If you’re a student carrying debt and looking at a dismal job market, who could be cooler than a grandfather who promises to bring down the establishment? To Trump’s fans, he’s the dream-weaver — the guy who made it BIG!!! and can make America GREAT!!! again, too.\nSomewhere in between these flatterers of outrage is an idea in search of a voice. The smart candidate will articulate the center point of these two and seize that vast middle ground where independents, centrists and moderates — the majority of voters — languish in despair.\nRead more from Kathleen Parker’s archive , follow her on Twitter or find her on Facebook .\nRead more here:\nKareem Abdul-Jabbar: This is the difference between Donald Trump and Bernie Sanders\nEugene Robinson: The rock-star appeal of Bernie Sanders\nHarold Meyerson: Donald Trump and Bernie Sanders, candidates in the age of anxiety\nMarc A. Thiessen: Too soon to write off Trump", "external_links": ["https://twitter.com/@kathleenparker", "http://www.nbcnews.com/meet-the-press/meet-press-transcript-october-11-2015-n442476", "https://www.facebook.com/kathleenparker", "http://www.facebook.com/kathleenparker", "https://twitter.com/kathleenparker"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T03:09:14.835+03:00", "highlightTitle": ""}