{"organizations": ["LinkedIn Pinterest Seattle council", "Seattle City Council", "Facebook Email Twitter Google", "Facebook Seattle council", "KING"], "uuid": "84a8b8fcd6c0e4c7696c491df45b987ed91660a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.king5.com", "main_image": "http://www.gannett-cdn.com/-mm-/489efad1142179deef9ce5ef3cf126cd99e1a3f1/r=x633&amp;c=1200x630/http/cdn.tegna-tv.com/-mm-/9a10d18443197ab9a2a837953a60ea6375b5467c/c=4-0-1916-1080/local/-/media/2015/10/13/NWGroup/KING/635803723559211775-jongrant.JPG", "site_section": "http://rssfeeds.nwcn.com/_/20/108603198/nwcn/politics", "section_title": "NWCN - Politics", "url": "http://www.king5.com/story/news/politics/city/2015/10/13/seattle-council-candidate-alleges-blackmail/73903820/", "country": "US", "title": "Seattle council candidate alleges 'blackmail'", "performance_score": 0, "site": "king5.com", "participants_count": 0, "title_full": "Seattle council candidate alleges 'blackmail'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T05:45:00.000+03:00", "replies_count": 0, "uuid": "84a8b8fcd6c0e4c7696c491df45b987ed91660a0"}, "author": "", "url": "http://www.king5.com/story/news/politics/city/2015/10/13/seattle-council-candidate-alleges-blackmail/73903820/", "ord_in_thread": 0, "title": "Seattle council candidate alleges 'blackmail'", "locations": ["SEATTLE", "Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jon Grant"], "text": "Facebook Email Twitter Google+ LinkedIn Pinterest Seattle council candidate alleges 'blackmail' SEATTLE -- Position 8 Seattle City Council candidate Jon Grant alleges he's the target of \"blackmail,\" three weeks ahead of Election Day. Post to Facebook Seattle council candidate alleges 'blackmail' SEATTLE -- Position 8 Seattle City Council candidate Jon Grant alleges he's the target of \"blackmail,\" three weeks ahead of Election Day.  //www.king5.com/story/news/politics/city/2015/10/13/seattle-council-candidate-alleges-blackmail/73903820/   Join the Conversation To   Seattle council candidate alleges 'blackmail' Seattle council candidate alleges 'blackmail' Natalie Brand, KING 5 Political Reporter 7:45 p.m. PDT October 13, 2015 Position 8 Seattle City Council candidate Jon Grant alleges he's the target of \"blackmail,\" three weeks ahead of Election Day. (Photo: KING) CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nSEATTLE -- Position 8 Seattle City Council candidate Jon Grant alleges he's the target of \"blackmail,\" three weeks ahead of Election Day. \nHe claims a local developer offered to \"make a $200,000 negative Independent Expenditure go away,\" if Grant helped them resolve a lawsuit involving the $400 million Civic Square project across from City Hall. \nGrant served as director of the Tenants Union when the suit was filed against Triad Capital Partners; the case remain in the appeals process. \nGrant left the Tenants Union to challenge Council President Tim Burgess for one of the at-large seats. Last week, an independent expenditure committee called \"Seattle Needs Ethical Leaders\" was filed. \nWhile a disclosure report on the Seattle Ethics and Elections website lists only an initial contribution of $250, campaign manager Jason Bennett told KING 5 the committee was formed in support of Burgess and against Jon Grant. \n\"The total budget will be around $200k,\" he said in an email. \nGrant says the IE against his campaign was referenced during a campaign event over the weekend, attended by Brett Allen of Triad Capital. \n\"There was an individual sitting amongst the volunteers, and he approaches me and introduces himself as the VP of Triad Capital, and I was like 'Are you going to be door knocking with us today?' It was kind of a confusing thing, and he took me aside and the conversation that we had was, um, 'You need to show leadership here and resolve this lawsuit,'\" Grant recalled during a news conference Tuesday. \nGrant said Allen urged him to sit down and negotiate the terms of lawsuit. \n\"He said to me, 'This could really be beneficial for you,' and I said, 'You know, I don't think that's appropriate, I'm not interested in undercutting the Tenants lawsuit by meeting with you, so I won't be doing that.' And he suggested, 'Well why don't we have a neutral mediator, someone you trust, like former Mayor Mike McGinn, come and mediate this conversation.' And again, I said I have no interest in meeting with you,\" Grant recalled. \nFormer Mayor McGinn confirmed receiving text messages to his phone from Brett Allen, which read in part: \"Hey Mike, it's Brett. Any luck in getting Grant to sit down? I realize 100% of his focus is on election—but nothing else he does today could translate into as many votes.\" \nThe message reads: \"Any deal would be contingent on the 200k IE going away. Please tell him that we're sincere in our desire to get this resolved before any major damage done.\" \nJon Grant's campaign released this image of the text message between Brett Allen and former Seattle Mayor Mike McGinn. (Photo: KING) \n\"The intention was to smear my name to get me to buckle. They don't know who I am. They don't understand that there's no scenario in which I was going to sit down and meet with them over their empty threats,\" said Grant of the situation. \n\"These downtown developers trying to push me as a candidate to get them to have a backroom deal, so they can have this 400 (million) dollar property go forward, and they're trying to threaten and intimidate me with a $200,000 independent expenditure group to try to smear my name in the community,\" he continued. \nIn a statement to KING 5, Brett Allen apologized for the text messages. \n\"I talked with Jon Grant for the purpose of settling a lawsuit against this project, nothing more. My text message to former Mayor McGinn was inappropriate,\" said Allen. \"There is no independent expenditure planned against Mr. Grant's campaign by Triad or John Goodman and I should never have mentioned it.\" \nAllen also added Triad is working with the city to build a project \"that will result in over $10 million to the city to be used for affordable housing.\" \nMeanwhile, the spokesman for the independent expenditure committee could not be reached on Tuesday. According to a disclosure report on the SEEC's website, the IE has only $250 to its name. \nSpokesman Bennett had told KING 5 he anticipated donors will include \"a mix of business, veterans' advocates, and parties who are concerned about Jon's activities while at the Tenants Union. \" \n\"I have no idea what he's talking about,\" said Grant, when asked what the \"concerns\" might be. \n\"They're going to try to pump out a bunch of misinformation and lies about me. I don't know what that is. I'm curious to find out, but I think it's important that political leaders stand up to that threat, because we should not be intimidated by their money,\" Grant continued. \nGrant's campaign manager Jon Wyble questions whether protocol was followed regarding the IE filed against his candidate. \n\"If someone pledges $200k, you're supposed to report that,\" Wyble \"Something's amiss there.\" \nIndependent expenditures do not have campaign contribution limits, but cannot coordinate with candidates, according to FEC regulations. \n\"The IE is actually coordinating with Jon Grant at this point, because they're going to a campaign when they're not supposed to coordinate with either side, and say it will either be 0 or $200k depending on our coordination. I think that's also a (SEEC) violation,\" said Wyble. Read or Share this story: http://www.king5.com/story/news/politics/city/2015/10/13/seattle-council-candidate-alleges-blackmail/73903820/ TOP VIDEOS", "external_links": [], "published": "2015-10-14T05:45:00.000+03:00", "crawled": "2015-10-14T05:52:12.881+03:00", "highlightTitle": ""}