{"organizations": [], "uuid": "f03439efccfa72655a80e5e476fca0afb24fb4f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/obama/2015/10/president-obama-announces-more-key-administration-posts-132-2474772.html", "country": "US", "title": "President Obama Announces More Key Administration Posts | Obama", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "President Obama Announces More Key Administration Posts | Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:15:00.000+03:00", "replies_count": 0, "uuid": "f03439efccfa72655a80e5e476fca0afb24fb4f5"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/obama/2015/10/president-obama-announces-more-key-administration-posts-132-2474772.html", "ord_in_thread": 0, "title": "President Obama Announces More Key Administration Posts | Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nWASHINGTON, DC – Today, President Barack Obama announced his intent to nominate the following individuals to key Administration posts:\n Linda Etim – Member, Board of Directors for the African Development Foundation Lisa M. Fairfax – Commissioner, Securities and Exchange Commission Jean Elizabeth Manes – Ambassador to the Republic of El Salvador, Department of State Scot Alan Marciel – Ambassador to the Union of Burma, Department of State Linda Swartz Taglialatela – Ambassador to Barbados, the Federation of Saint Kitts and Nevis, Saint Lucia, Antigua and Barbuda, the Commonwealth of Dominica, Grenada, and Saint Vincent and the Grenadines, Department of State President Obama said, “I am honored that these talented individuals have decided to serve our country. They bring their years of experience and expertise to this Administration, and I look forward to working with them.”\nPresident Obama announced his intent to nominate the following individuals to key Administration posts:\nLinda Etim , Member, Board of Directors for the African Development Foundation\nLinda Etim is Deputy Assistant Administrator of the Bureau for Africa at the United States Agency for International Development, a position she has held since 2012. From 2009 to 2012, Ms. Etim served on the National Security Council as the Director for African Affairs. From 2007 to 2009, Ms. Etim worked as a Senior Intelligence Officer for the Central Intelligence Agency. Prior to this, Ms. Etim worked at the Defense Intelligence Agency as an Intelligence Analyst from 2004 to 2007 and as an Intelligence Liaison from 2003 to 2004. She was an Intelligence Analyst for the Joint Staff from 2002 to 2003. Ms. Etim received a B.A. from the University of Wisconsin.\nLisa M. Fairfax, Commissioner, Securities and Exchange Commission\nLisa M. Fairfax is the Leroy Sorenson Merrifield Research Professor of Law and serves on the Executive Board and as Director for Programs for the George Washington Center for Law, Economics and Finance at the George Washington University Law School, positions she has held since 2009. Ms. Fairfax has also served as the Co-Chair of the DirectWomen Board Institute since 2012. In 2006 and 2014, Ms. Fairfax was a Visiting Professor at the Georgetown University Law Center. She also held various roles at the University of Maryland School of Law from 2000 to 2009. She served as a Professor and Director of the Business Law Program from 2006 to 2009, as an Associate Professor with tenure from 2004 to 2006, and as an Assistant Professor from 2002 to 2004. Between 1995 and 2000, Ms. Fairfax was an Associate at the law firm Ropes & Gray LLP. Ms. Fairfax has been a member of the Corporate Laws Committee of the Business Law Section of the American Bar Association from 2007 to 2012, Chair of the Securities Regulation Section of the Association of American Law Schools from 2013 to 2014, Chair of the Business Associations Section of the Association of American Law Schools from 2009 to 2010, a member of the National Adjudicatory Council of the Financial Industry Regulatory Authority from 2008 to 2011 and a member of its NASDAQ Market Regulation Committee from 2008 to 2012. Ms. Fairfax received an A.B. and a J.D. from Harvard University.\nJean Elizabeth Manes, Nominee for Ambassador to the Republic of El Salvador\nJean Elizabeth Manes, a career member of the Foreign Service, class of Counselor, serves as Principal Deputy Coordinator in the Bureau of International Information Programs at the Department of State, a position she has held since 2013. Prior to this, she served as Deputy Director of the Department’s Florida Regional Center in 2013 and as Counselor for Public Affairs at the U.S. Embassy in Kabul, Afghanistan from 2012 to 2013. Ms. Manes also served as Director of Resources in the Office of Policy, Planning, and Resources for Public Diplomacy and Public Affairs from 2010 to 2012, Cultural Affairs Officer at the U.S. Embassy in Brasilia, Brazil from 2009 to 2010, Principal Officer at the U.S. Consulate in Ponta Delgada-Azores, Portugal from 2006 to 2009, and Regional Program Officer in the Bureau of International Information Programs from 2003 to 2006. Her earlier assignments with the Department of State include postings in Argentina and Uruguay. Ms. Manes received a B.S. from Liberty University and an M.P.A. from American University.\nScot Alan Marciel, Nominee for Ambassador to the Union of Burma, Department of State\nScot Alan Marciel, a career member of the Foreign Service, class of Career Minister, serves as Principal Deputy Assistant Secretary of State for East Asian and Pacific Affairs, a position he has held since 2013. Prior to this, Mr. Marciel served as Ambassador to the Republic of Indonesia from 2010 to 2013. Mr. Marciel was Deputy Assistant Secretary in the Bureau of East Asian and Pacific Affairs and Ambassador to the Association of Southeast Asian Nations from 2007 to 2010. He also served as Director for the Office of Maritime Southeast Asia from 2006 to 2007, Director for the Office of Mainland Southeast Asia from 2005 to 2006, and Director for the Office of Southern European Affairs from 2004 to 2005. His earlier assignments with the Department of State include postings in Brazil, Hong Kong, the Philippines, Turkey, and Vietnam. Mr. Marciel received a B.A. from the University of California, Davis and an M.A. from Tufts University.\nLinda Swartz Taglialatela, Nominee for Ambassador to Barbados, the Federation of Saint Kitts and Nevis, Saint Lucia, Antigua and Barbuda, the Commonwealth of Dominica, Grenada, and Saint Vincent and the Grenadines, Department of State\nLinda Swartz Taglialatela serves as Deputy Assistant Secretary of State in the Bureau of Human Resources, a position she has held since 2002. Ms. Taglialatela served in the Office of Resource Management and Organization Analysis at the Department of State as Director from 1996 to 2001 and as Deputy Director from 1989 to 1996. Prior to that, she was Counselor for Administration at the U.S. Embassy in Bern, Switzerland from 1987 to 1989, Administrative Officer in the Bureau of International Communications and Information Policy from 1984 to 1987, and Audit Qualified Inspector/Special Assistant in the Office of the Inspector General from 1979 to 1984. Ms. Taglialatela received a B.A. from the State University of New York at Oneonta and an M.B.A from Virginia Polytechnic Institute and State University.", "external_links": [], "published": "2015-10-20T22:15:00.000+03:00", "crawled": "2015-10-21T01:12:49.894+03:00", "highlightTitle": ""}