{"organizations": ["Jubilee Alliance Party"], "uuid": "51176c9fbd30c459a0d476ce1ca4412be946fcec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nation.co.ke", "main_image": "\r\n    http://www.nation.co.ke/image/view/-/2917658/medRes/1149524/-/nu55i5/-/RUT+PIC.jpg", "site_section": "http://www.nation.co.ke/news/politics/Cord-begins-search-for-referendum-signatures/-/1064/2429002/-/view/asFeed/-/3vhj9h/-/index.xml", "section_title": "Daily Nation | Politics", "url": "http://www.nation.co.ke/news/politics/Ruto-taunts-opposition-on-2017--candidate/-/1064/2917472/-/jdabj3z/-/index.html", "country": "GB", "title": "Ruto taunts opposition on 2017 candidate", "performance_score": 0, "site": "nation.co.ke", "participants_count": 0, "title_full": "Ruto taunts opposition on 2017 candidate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:43:00.000+03:00", "replies_count": 0, "uuid": "51176c9fbd30c459a0d476ce1ca4412be946fcec"}, "author": "", "url": "http://www.nation.co.ke/news/politics/Ruto-taunts-opposition-on-2017--candidate/-/1064/2917472/-/jdabj3z/-/index.html", "ord_in_thread": 0, "title": "Ruto taunts opposition on 2017 candidate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JARED NYATAYA", "Ruto", "William Ruto"], "text": "Friday, October 16, 2015 Ruto taunts opposition on 2017 candidate Deputy President William Ruto. Mr Ruto has urged Cord to reveal their 2017 presidential candidate. PHOTO | JARED NYATAYA | NATION MEDIA GROUP In Summary The Deputy President said in 2013 Jubilee campaigned through a coalition of parties but in 2017 it will be under the Jubilee Alliance Party. He, however, urged leaders to slow down on political activities and concentrate on development. Advertisement More by this Author \nDeputy President William Ruto has urged Cord to reveal their 2017 presidential candidate. \nSpeaking Friday at Wahundura High School in Mathioya, Murang’a, Mr Ruto said Cord should put its house in order. \n“If you cannot decide on what party, or which leader, how can you decide the future of the country?” he asked. \nThe Deputy President said in 2013 Jubilee campaigned through a coalition of parties but in 2017 it will be under the Jubilee Alliance Party. \nMr Ruto said it had been agreed that President Uhuru Kenyatta will be the party’s candidate. “What remains is 2022 and I will deal with the situation then,” he said. \nThe DP urged people seeking leadership positions to be predictable.“We want predictable leaders, we don’t want leadership by guess work,” he said. \nMr Ruto said Jubilee leaders were united. \n“From governors, senators, MPs, MCAs, we are all servants of the people, our work is to serve Kenyans,” Mr Ruto said. \nFOCUS IN DEVELOPMENT He, however, urged leaders to slow down on political activities and concentrate on development. \n“Let’s keep politics aside at this moment and serve Kenyans. This is not the time for politics,” he noted. \nMr Ruto visited Kamacharia Secondary School where he opened the new divisional headquarters and a technical institute. He then went to Wahundura High School. \nMurang’a Senator Kembi Gitura, who accompanied Mr Ruto, said the International Criminal Court had no choice but to reject recanted evidence. \nMPs Irungu Kang’ata (Kiharu), Clement Wambugu (Mathioya) and Sabina Chege (Murang’a County Woman Representative) said they supported Gatundu South MP Moses Kuria in his mission to expose the people who fixed the Deputy President at the Hague-based court. \nThe DP later toured Othaya in Nyeri county.", "external_links": [], "published": "2015-10-16T20:43:00.000+03:00", "crawled": "2015-10-16T23:03:55.823+03:00", "highlightTitle": ""}