{"organizations": ["Kalamazoo Wings", "AP"], "uuid": "0685a219f12da40bafc86df0a67eb52c4be066c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/08/bf/2d/45b85bc64c144cd19064804d24768670-039c85f8235f4c96a3ff37d14b30ecda-0.jpg", "site_section": "http://www.whio.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.whio.com/ap/ap/top-news/cruz-nets-12-million-for-presidential-bid-rubio-6-/nnyQm/", "country": "US", "title": "Cruz nets $12 million for presidential bid, Rubio $6 million", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "Cruz nets $12 million for presidential bid, Rubio $6 million", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T06:11:00.000+03:00", "replies_count": 0, "uuid": "0685a219f12da40bafc86df0a67eb52c4be066c8"}, "author": "", "url": "http://www.whio.com/ap/ap/top-news/cruz-nets-12-million-for-presidential-bid-rubio-6-/nnyQm/", "ord_in_thread": 0, "title": "Cruz nets $12 million for presidential bid, Rubio $6 million", "locations": ["Kalamazoo", "Mich", "WASHINGTON", "Texas", "R-Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ted Cruz", "Osorio", "Cruz", "Rubio"], "text": "Updated: 11:11 p.m. Thursday, Oct. 8, 2015 | Posted: 11:11 p.m. Thursday, Oct. 8, 2015 Cruz nets $12 million for presidential bid, Rubio $6 million Related View Larger In this Oct. 5, 2015, photo, Republican presidential candidate Sen. Ted Cruz, R-Texas, addresses supporters at Kalamazoo Wings stadium in Kalamazoo, Mich. Cruz's presidential campaign is reporting a $12.2 million fundraising boost over the past three months. The Republican Texas senator's new fundraising, added to what he raised through the end of June, gives him a total of $26.5 million since he entered the race in late March. (AP Photo/Carlos Osorio) Sponsored Links The Associated Press WASHINGTON — \nTed Cruz raised $12.2 million in the past three months for his Republican presidential bid, about twice what competitor Marco Rubio collected in the same time period. \nThe new numbers are being circulated by the campaigns ahead of a deadline next week to report fundraising to federal regulators. The quarterly figures mark a practical and symbolic measure of strength for all presidential candidates, but they don't tell the whole story. \nCruz and Rubio both topped Rand Paul , whose presidential campaign said it had pulled in $2.5 million through the end of September. Several candidates struggled to raise money over the summer months, with celebrity real estate mogul Donald Trump commanding attention in what remains a 15-candidate fight for the nomination. \nSo far it appears that another political outsider, retired neurosurgeon Ben Carson, is leading in quarterly fundraising. His campaign said last week it raised $20 million between July 1 and Sept. 30. \nRubio's campaign briefed donors who have gathered at a retreat in Las Vegas. One attendee shared the fundraising information with the Associated Press on the condition of anonymity to share fundraising numbers before they're officially released by the campaign. \nCruz's figures were released by his campaign Thursday night. \nMost of the 2016 presidential candidates also benefit from allied super PACs and nonprofit groups that can raise and spend unlimited sums of money on their behalf. The campaigns are not legally allowed to coordinate with those groups, however. \nRubio's campaign started October with $11 million cash on hand, according to Thursday's donor briefing. That's about what Carson had in the bank after expenses, suggesting that Rubio's team is spending its resources more cautiously than some of his competitors. \nBoth Cruz's and Rubio's campaigns sought to project momentum heading into the fall. \nThe Cruz campaign noted it raised more than $1 million in the final 24 hours of September. \nThe attendee at Rubio's donor retreat said fundraising improved in September, when it raised $1 million in online donations alone. October, which wasn't included in the quarterly total, will be the campaign's best month so far, according to the briefing the Rubio donor attended. \n___ \nAP writer Julie Bykowicz contributed to this report. Copyright The Associated Press Sign up for our WHIO-TV Daily Headlines Newsletter Sign Up", "external_links": [], "published": "2015-10-09T06:11:00.000+03:00", "crawled": "2015-10-09T08:09:03.013+03:00", "highlightTitle": ""}