{"organizations": [], "uuid": "f2d7c016313117b6fb049cc50af1689264301690", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local21news.com", "main_image": "http://local21news.com///template/stories/2015/10/22/images/MGI1ODQ4MWI0MGRl.jpg", "site_section": "http://local21news.com/news/features/politics-and-government/rss.xml", "section_title": "whp Politics and Government", "url": "http://www.local21news.com/news/features/politics-and-government/stories/Budget-impasse-continues-treasury-holding-up-payment-to-charter-schools-222255.shtml", "country": "US", "title": "Budget impasse continues; treasury holding up payment to charter schools", "performance_score": 0, "site": "local21news.com", "participants_count": 0, "title_full": "Budget impasse continues; treasury holding up payment to charter schools", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T08:39:00.000+03:00", "replies_count": 0, "uuid": "f2d7c016313117b6fb049cc50af1689264301690"}, "author": "", "url": "http://www.local21news.com/news/features/politics-and-government/stories/Budget-impasse-continues-treasury-holding-up-payment-to-charter-schools-222255.shtml", "ord_in_thread": 0, "title": "Budget impasse continues; treasury holding up payment to charter schools", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Budget impasse continues; treasury holding up payment to charter schools \nUpdated: Thu, Oct 22 2015, 05:44 AM \nBy: Kyle Rogers \nHARRISBURG, Pa. -- The Pennsylvania Treasury Department will not divert payments to charter schools, for now. On Wednesday, treasury spokesman Scott Sloat said the agency will review the legality of diversions of dollars normally sent to public school districts. The announcement came as the Pennsylvania School Boards Association sued to ensure money is sent to school districts insisting that it is illegal to divert the cash to charter schools. However, Tim Eller, a spokesman for Keystone Alliance said it is illegal for schools to withhold the cash to charter schools due by the fifth of every month. “It’s creating a very difficult situation for charter schools across the commonwealth as this budget impasse drags on,” said Eller. Eller added charter schools rely on some federal dollars but also funds from school districts. Since some school districts are struggling themselves because of the 114-day-old budget impasse, funds are not coming in to the charter schools like before. Eller said teachers will have reduced or no pay and students will likely see shorter school days and longer vacations.“It’s putting charter schools in a position to either consider a worst case scenario of shutting down which I don’t think we’ll see anytime soon,” said Eller.Eller added teachers at Lincoln Charter School in York have seen their paychecks reduced in half. The dispute over the treasury releasing money comes during a nearly four-month-old budget stalemate which has held up billions in state aid to public schools. The Wolf administration wants to look at the legality of paying the schools directly. A spokesman said the administration is still determining the appropriate amounts to divert. -The Associated Press contributed to this report Related Stories", "external_links": [], "published": "2015-10-22T08:39:00.000+03:00", "crawled": "2015-10-23T11:42:42.252+03:00", "highlightTitle": ""}