{"organizations": [], "uuid": "75bdd9a123a386cd516e876c75a12d0205bd9d61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151025002520-hillary-clinton-jefferson-jackson-dinner-large-169.jpg", "site_section": "http://us.cnn.com/politics", "section_title": "Political News, Analysis and Opinion - CNNPolitics.com", "url": "http://www.cnn.com/2015/10/25/politics/iowa-democrats-jefferson-jackson-dinner/index.html", "country": "US", "title": "Hillary Clinton seeks to exorcise Iowa ghosts - CNNPolitics.com", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Hillary Clinton seeks to exorcise Iowa ghosts - CNNPolitics.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "75bdd9a123a386cd516e876c75a12d0205bd9d61"}, "author": "Stephen Collinson", "url": "http://www.cnn.com/2015/10/25/politics/iowa-democrats-jefferson-jackson-dinner/index.html", "ord_in_thread": 0, "title": "Hillary Clinton seeks to exorcise Iowa ghosts - CNNPolitics.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Clinton left nothing to chance at the Jefferson-Jackson dinner, because she knows the price of failure Her show of preparation was a clear sign she is determined not to be out-organized Des Moines, Iowa (CNN) Hillary Clinton came to Iowa to exorcise the ghost of a campaign past.\nBack where her last \"inevitable\" march to the White House began to unravel, she was out to prove she learns from history and is not doomed to repeat it, and told voters who rejected her last time that when she's knocked down, she just gets back up.\nAt the state Democratic Party's big Jefferson-Jackson dinner -- often a defining moment in the Iowa caucus race -- Clinton enlisted pop diva Katy Perry, dazzling in a white ballgown and Star-Spangled cape, to draw a pre-event crowd. She rolled out \"explainer-in-chief\" Bill Clinton for the first time this cycle, and packed Des Moines with young volunteers wearing \"fighting for her\" T-shirts ready to take names and addresses of potential caucus voters.\nOne hundred days before Iowa becomes the first state to cast votes for the next president, Clinton left nothing to chance, because she knows the price of failure.\nHer show of preparation was a clear sign she is determined not to be out-organized in a caucuses her aides often derided during her last campaign but which dealt her a blow from which she would never recover.\nRead More Clinton made her political longevity an asset, presented herself as a fighter and subtly told Iowa voters she'd learned from past mistakes. She also showed she knew her audience by taking swipes at Iowa's Republican governor, Terry Branstad.\n\"I have been at this effort to change and reform our country a long time and I haven't won every battle,\" Clinton said. \"I have learned from each one, and I have learned how to stand my ground and find common ground.\"\n\"I am just getting warmed up. I am listening to you, I am fighting for you, and with your support, Iowa, I am going to deliver.\"\nEight years ago, Clinton rode into the fabled dinner \"JJ dinner\" -- a mix between a political convention and a deafening student pep rally -- as a front-runner, convinced her mantra of experience and competence was paving the way to the Oval Office.\nBut in the fading light of that Iowa fall evening, her strategy was quickly exposed, as Barack and Michelle Obama danced in the streets on the way to the event venue, revealing for the first time the pent-up political energy, organizational muscle and potent brew of hope and change that would turn the campaign on its head.\nHours later, Obama trumped her wooden, uninspiring speech at the dinner. His adviser, David Axelrod, later described her effort as having all the spontaneity of a \"Politburo\" meeting.\n'A proud Democrat'\nThis time, her speech was more compact and polished than the awkward call and response routine she used in 2007 when she roared she would \"turn up the heat\" on Republicans.\nIn 2015, Clinton aligned herself tightly with Obama, bemoaned the GOP's \"failed\" policies on the economy and vowed to safeguard progress under the current administration.\n\"I am running as a proud Democrat,\" Clinton said in an apparent jab at her top rival, Bernie Sanders, who over a long career has identified himself as an independent.\nBut while Clinton's speech pleased her own supporters, who chanted \"I'm with her\" and waved blue light sticks in the darkened venue -- another sign of slick campaign organizing -- inspirational rhetoric has never been her strength.\nBut what she lacked in uplifting eloquence, she made up for in policy in her conversational address, which was apparently designed to please as many different Democratic micro-constituencies as possible.\nShe touched on heath care, education, climate change, women's rights, gay rights, Wall Street regulation, immigration reform, restoring campaign finance measures, voting rights, racial issues and gun violence.\nIt hardly matched the promise of a \"nation healed, a world repaired, an America that believes again\" from Obama at the same dinner in 2007. But that may not matter so much to Democrats any more.\nEight years on, many Obama veterans -- who radiated quiet contempt for the Clintons and their red meat, Republican-bashing back then -- now see the former secretary of state as the best chance to secure the president's legacy.\nWith exquisite timing, David Plouffe, the organizational wizard who did more than anyone else to rout Clinton in Iowa in 2008, declared he was fully behind her now , though would never have believed seven years ago he would be.\n\"Here's what I, and so many of my fellow Obama campaign veterans, have learned about Hillary: She doesn't quit. And there were times I wish she had!\" Plouffe wrote on Medium. \"But you have to deeply admire that strength and persistence.\"\nTom Harkin, a sage of Iowa politics who served the state in the U.S. Senate for 30 years, is convinced Clinton 2016 is unrecognizable from Clinton 2008.\n\"She's doing what she needs to do in Iowa every day; She's organizing; She has a great ground game in Iowa, unlike 2008,\" Harkin said in an interview.\n\"Right now it's about rounding up delegates and holding their hands and making sure they get to the caucus.\"\nJUST WATCHED Bill Clinton makes first 2016 campaign trail appearance Replay More Videos ... MUST WATCH\nBill Clinton makes first 2016 campaign trail appearance 02:41 Harkin, like many Democrats in her campaign and outside, believes Clinton has turned a corner after an error-addled summer and is capitalizing on strong performances in the CNN Democratic debate and in a Capitol Hill hearing on Thursday on Benghazi.\n\"I think she's erased any doubts that may have been out there about her abilities -- her ability to stand up and undergo withering fire if you will and come out looking like a winner,\" Harkin said.\nAnother challenge on her left flank\nBut Clinton did not have it all her own way on Saturday night.\nJust as in 2008, she is facing a pied piper of a rival, who is seeking to fire up young idealist voters and coming at her from her left on national security, and who also vows to build a grassroots army to buckle the Clinton political machine.\nThat man -- Vermont Sen. Bernie Sanders -- learned his own lessons from Obama's approach in 2007.\nHe held a dueling rally to Clinton's on Saturday afternoon and even sent a light plane, bearing a streamer \"Feel the Bern\" high over Clinton's party.\nThousands of Sanders supporters at the \"JJ dinner,\" pounding out their refrain of \"Bernie, Bernie,\" showed the Clinton campaign is right to be taking no chances in Iowa. The former secretary of state led Sanders only seven points in the latest Des Moines Register/Bloomberg Iowa caucus poll this week.\nHis speech included his most explicit swipes against Clinton so far -- on Iraq, gay rights and what he sees as her belated opposition to the Keystone XL Pipeline and the Trans-Pacific Partnership trade pact.\nHe implicitly suggesting she made decisions based on poll numbers and not principle and in his speech, which preceded hers, jabbed her over her defeat here in 2008.\n\"By the way, about eight years ago, all of the political experts talked about how another Democratic candidate for president just couldn't win, he was unelectable -- remember that guy -- what's his name? Oh, it's President Obama,\" Sanders said. \"Well Iowa, I think we're going to prove the pundits wrong again. I believe we will make history.\"\nShould Sanders make good on that promise -- and then capitalize on his strong position in New Hampshire -- he could revive all the old doubts about her qualities as a candidate and undermine her campaign.\nBut Clinton has one clear advantage over 2007 -- Sanders is no Obama.\nWhereas Obama was by the time of the Iowa dinner already viewed as a once-in-a-generation talent with historic potential, Sanders is a 74-year-old self-declared democratic socialist promising a \"revolution.\" He seems to lack the broader appeal among ethnically diverse voters of Obama, or even Clinton.\nSanders performed strongly at the dinner, striking themes on Wall Street and economic inequality that have delighted liberals all year.\nBut his address, like Clinton's, lacked the almost supernatural lift that Obama achieved to transcend the same event eight years ago.\nSo if the Jefferson-Jackson dinner changes the race this time around, it seems just as likely that it will be to solidify the position of the strengthening front-runner as to elevate the campaign of her upstart challenger.\nFollow @CNNpolitics", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/151024203245-bill-clinton-hillary-iowa-rally-sot-00000924-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151024203245-bill-clinton-hillary-iowa-rally-sot-00000924-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151024203245-bill-clinton-hillary-iowa-rally-sot-00000924-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151024203245-bill-clinton-hillary-iowa-rally-sot-00000924-super-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/151024203245-bill-clinton-hillary-iowa-rally-sot-00000924-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151024203245-bill-clinton-hillary-iowa-rally-sot-00000924-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/151024203245-bill-clinton-hillary-iowa-rally-sot-00000924-medium-plus-169.jpg", "https://twitter.com/CNNpolitics"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T09:24:07.264+02:00", "highlightTitle": ""}