{"organizations": [], "uuid": "86f44138d7caabcb494ac9e4327b14386898c2bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/0/n/r/1/b/image.related.afrArticleLead.620x365.gk19y5.png/1444005260993.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/economy/monetary-policy/job-ads-up-39pc-in-september-as-services-firms-gear-up-20151005-gk19y5", "country": "AU", "title": "Job ads up 3.9pc in September as services firms gear up", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Job ads up 3.9pc in September as services firms gear up | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:33:00.000+03:00", "replies_count": 0, "uuid": "86f44138d7caabcb494ac9e4327b14386898c2bc"}, "author": "Jacob Greber", "url": "http://www.afr.com/news/economy/monetary-policy/job-ads-up-39pc-in-september-as-services-firms-gear-up-20151005-gk19y5", "ord_in_thread": 0, "title": "Job ads up 3.9pc in September as services firms gear up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Hiring in the services sector also looks to have displayed some 'catch up' over the past year or so following unusually weak outcomes.\" Share on twitter by Jacob Greber Job ads jumped last month amid a rise in services hiring, suggesting the lower Australian dollar and low interest rates are spurring activity.\nNotices online and in print for jobs rose 3.9 per cent in September, adding to a 1.3 per cent gain in August, ANZ Bank said on Monday.\nInternet jobs grew 4 per cent in the month, to be 13.7 per cent higher than a year earlier. Newspaper notices, which account for 2 per cent of total job ads, were down 2.7 per cent.\n\"The positive trend in job advertising is a sign that the economy is so far adjusting relatively well to significant headwinds from falling commodity prices and mining investment,\" ANZ economist Warren Hogan said.\nWhile companies are still relatively reluctant to boost investment spending, demand for labour across a range of services industries has strengthened, he said.\n\"Activity in these industries has been supported by the sharp depreciation of the Australian dollar, which has redirected spending back towards the domestic economy, and by low interest rates, particularly through robust housing market activity and its flow on effects,\" Mr Hogan said.\n\"Hiring in the services sector also looks to have displayed some 'catch up' over the past year or so following unusually weak outcomes.\"\nDespite the solid momentum, ANZ Bank predicts the positive factors current driving employment growth will wane into next year.\n \"This is likely to prompt the Reserve Bank to provide a little more monetary policy support to prevent the unemployment rate from rising further.\"\nEmployment growth remains the Reserve Bank's most closely watched economic variable, with policy makers anticipating only a slow decline in the jobless rate.\nEconomists widely expect the Reserve Bank to keep the official interest rate steady at 2 per cent on Tuesday.", "external_links": ["https://twitter.com/jacobgreber"], "published": "2015-10-05T08:33:00.000+03:00", "crawled": "2015-10-05T09:02:44.112+03:00", "highlightTitle": ""}