{"organizations": [], "uuid": "8b82808b0cad89599d7421fbe9f214ea54024f5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef-1.bbci.co.uk/news/1024/cpsprodpb/161C3/production/_86136509_swinney_webcast640.gif", "site_section": "http://www.bbc.co.uk/news/politics", "section_title": "UK Politics - BBC News", "url": "http://www.bbc.com/news/uk-scotland-scotland-politics-34537559", "country": "US", "title": "SNP's Swinney says Scottish government 'unlikely' to reverse UK cuts", "performance_score": 0, "site": "bbc.com", "participants_count": 1, "title_full": "SNP's Swinney says Scottish government 'unlikely' to reverse UK cuts - BBC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "8b82808b0cad89599d7421fbe9f214ea54024f5d"}, "author": "BBC", "url": "http://www.bbc.com/news/uk-scotland-scotland-politics-34537559", "ord_in_thread": 0, "title": "SNP's Swinney says Scottish government 'unlikely' to reverse UK cuts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SNP's Swinney says Scottish government 'unlikely' to reverse UK cuts 15 October 2015 From the section Scotland politics Media caption John Swinney says it is \"highly unlikely\" that the SNP could afford to reverse the austerity cuts being implemented by the Conservatives Scotland's Finance Secretary John Swinney thinks it \"highly unlikely\" he would reverse the UK government's planned benefit cuts.\nIn a BBC webcast, the SNP MSP said the country needed to \"live within the resources that are available to us\".\nMr Swinney was speaking ahead of his party's conference in Aberdeen.\nThe Conservative government has plans to reduce the welfare cap, cut tax credits and change benefits linked to housing and disability.\nDuring the interview, hosted by BBC political editor Brian Taylor, the minister was asked if he would reverse the proposals.\nIf you are saying to me, can I find £6bn within the expenditure available to the Scottish government to reverse all of those decisions, I think that it is highly unlikely. John Swinney, Scotland's Finance Secretary Mr Swinney said: \"We must live within the resources that are available to us - we have had to wrestle with a reduction of expenditure in real terms of 10% since the 2010 general election.\"\nHe added: \"Essentially this comes down to a question of affordability. I estimate that the cumulative loss of tax and benefit changes will be of the order of about £6bn.\n\"If you are saying to me, can I find £6bn within the expenditure available to the Scottish government to reverse all of those decisions, I think that it is highly unlikely.\"\nMr Swinney, who is Scotland's deputy first minister, explained that his government had found ways to mitigate some of the deficit reduction measures, including funding the cost of the so-called \"bedroom tax\" and freezing council tax.\nHe said: \"We have been successfully in doing that and we will continue to do that.\"\nAffordable welfare system When Mr Swinney was asked if his government in an independent Scotland would reverse the Westminster cuts, he said it was important to run a \"sustainable budget\".\nHe added: \"What we would aim to do is put in place a welfare system that was affordable based on what we inherited when Scotland became an independent country.\"\nThe interview was based on questions sent in by BBC news website readers.\nThe topics he tackled included income tax changes, a second independence referendum and bus passes for pensioners.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T18:06:44.522+03:00", "highlightTitle": ""}