{"organizations": [], "uuid": "30cc390f7bac8fe8972711ed3637d87cbba61b6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/53/5b/JN_Facebook_Icon.png", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/top-news/indiana-house-majority-leader-resigns-after-apolog/nnrLK/", "country": "US", "title": "Indiana House majority leader resigns after apologetic text", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Indiana House majority leader resigns after apologetic text", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:25:00.000+03:00", "replies_count": 0, "uuid": "30cc390f7bac8fe8972711ed3637d87cbba61b6f"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/indiana-house-majority-leader-resigns-after-apolog/nnrLK/", "ord_in_thread": 0, "title": "Indiana House majority leader resigns after apologetic text", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: 4:25 p.m. Wednesday, Sept. 30, 2015 | Posted: 4:25 p.m. Wednesday, Sept. 30, 2015 Indiana House majority leader resigns after apologetic text By BRIAN SLODYSKO The Associated Press INDIANAPOLIS — \nA ranking Republican lawmaker has abruptly resigned from the Indiana House, conceding he made \"mistakes\" that resulted in him sending a text message apology to friends and acquaintances for \"anything offensive\" that may have been sent from his cellphone. \nHouse Majority Leader Jud McMillin of Brookville said in a Facebook post Wednesday that he was giving up his seat to \"remedy\" mistakes by focusing on his family. He officially resigned Tuesday. \nIn his Facebook post, he did not elaborate on what the mistakes were that he made. \nHis resignation came a week after he texted multiple people stating that his cellphone had been stolen and apologizing for messages they may have received from his number. Details about the content of those messages have not been revealed. \n\"My phone was stolen 24 hours ago in Canada. I have just been able to reactivate it under my control,\" reads the text, which was obtained by The Associated Press. \"Please disregard any messages you received recently. I am truly sorry for anything offensive you may have received.\" \nThe AP spoke to two people who received the text and obtained a copy of it from one of them. The two requested anonymity because it was a private message. \nIn Wednesday's Facebook post, McMillin also lashed out at critics who \"spew hatred,\" apparently directed at him. \n\"I make mistakes. When I do, regardless of how big or small they are, I do my best to admit them, own up to it, and then start doing my best to remedy them. That's what I am doing right now with my family,\" he wrote. \nMcMillin did not respond to requests for comment Wednesday. He did not answer calls from the AP to his cellphone and his voicemail was full. \nAfter McMillin resigned Tuesday, House Speaker Brian Bosma, R-Indianapolis, issued a statement thanking McMillin for his service and said the Republican Caucus supports McMillin's decision to focus on his family. Bosma said a new majority leader will be selected in the coming days. \nThis was not McMillin's first brush with ethics in public office. Ten years ago, a domestic violence victim said they had a sexual relationship while he was handling the case as an assistant prosecutor in Montgomery County, Ohio. He resigned that position in 2005, a matter of weeks after he withdrew from the domestic violence case, and the woman sued him for legal malpractice the following year. \nThat lawsuit was later withdrawn. \nMcMillin said in court documents that the relationship had been voluntary and that it didn't start until after he quit the prosecutor's staff. \nMcMillin was first elected to the Legislature in 2010 and quickly climbed the ranks to be named to the No. 2 position in the House last November. \nDuring this year's legislative session, he was a prominent supporter of the state's religious objections law and played a key role in efforts to shift authority away from Democratic state schools Superintendent Glenda Ritz. \nMcMillin represented a largely rural southeastern Indiana district. \n\"After five years of dedicated service I have decided the time is right for me to pass the torch and spend more time with my family,\" McMillin said in his resignation statement. \"I hope that the work I have done in Indianapolis and in Southeastern Indiana has made the state and the communities I represent a better place.\" \n___ \nAssociated Press writer Tom Davies contributed to this report. Copyright The Associated Press", "external_links": [], "published": "2015-09-30T23:25:00.000+03:00", "crawled": "2015-10-01T01:31:57.657+03:00", "highlightTitle": ""}