{"organizations": [], "uuid": "8fcfa90c25f989eb029ee8cf3e3cd9089c205b91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbsnews.com", "main_image": "http://cbsnews1.cbsistatic.com/hub/i/r/2015/10/10/bc1d152f-c5aa-4c9e-814f-01d9d3d2b466/thumbnail/620x350/7abeadfe90923aaf82fb85cbe052fab8/ben-carson.jpg", "site_section": "http://www.cbsnews.com/Politics/", "section_title": "Politics News, Headlines and Video - CBS News ", "url": "http://www.cbsnews.com/news/iowa-poll-shows-ben-carson-overtaking-donald-trump-for-the-first-time/", "country": "US", "title": "Election 2016: Iowa poll shows Ben Carson leading Donald Trump", "performance_score": 1, "site": "cbsnews.com", "participants_count": 7, "title_full": "Election 2016: Iowa poll shows Ben Carson leading Donald Trump - CBS News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:00:00.000+03:00", "replies_count": 6, "uuid": "8fcfa90c25f989eb029ee8cf3e3cd9089c205b91"}, "author": "CBS News", "url": "http://www.cbsnews.com/news/iowa-poll-shows-ben-carson-overtaking-donald-trump-for-the-first-time/", "ord_in_thread": 0, "title": "Election 2016: Iowa poll shows Ben Carson leading Donald Trump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Carson has overtaken Donald Trump in Iowa, 28 - 20 percent among likely Iowa Republican Caucus participants, according to a new Quinnipiac poll released Thursday morning.\nThis is the first time Trump has not been in the lead in the GOP field in Iowa since he entered the race. Carson has tied him twice before but has never led, CBS Senior Political Editor Steve Chaggaris noted.\nIn its last survey, Sept.11, the Quinnipiac poll found Trump leading the Republican field with 27 percent to Carson's 21 percent.\nCoverage of the 2016 presidential campaign Marco Rubio is in third, with 13 percent, followed by Ted Cruz, who attracted 10 percent support. Rand Paul has six percent and Jeb Bush is tied with Carly Fiorina - both have five percent.\nCarson's strength in this poll lies in his appeal to women, who chose Carson over Trump, 33 - 13 percent. Among men, the two are virtually tied, with 25 percent for Carson, compared to 24 percent for Trump.\nThirty percent of likely GOP caucus goers say there is no way they'd support Trump, followed by Bush, with 21 percent who said there's no way they'd support him.\nStill, Trump is thought to have strong leadership qualities, with 80 percent, compared to Carson's 76 percent.\nAnd even though Bush is trailing, 76 percent of poll respondents think he has the right kind of experience to be president, topping Cruz at 70 percent, Rubio at 69 percent, Carson at 57 percent, and Trump at 56 percent.\nFrom October 14 - 20, Quinnipiac University surveyed 574 likely Iowa Republican Caucus participants with a margin of error of +/- 4.1 percentage points. Live interviewers called land lines and cell phones.", "external_links": [], "published": "2015-10-22T15:00:00.000+03:00", "crawled": "2015-10-22T15:04:32.447+03:00", "highlightTitle": ""}