{"organizations": [], "uuid": "90078bbc4b2b4e792a7d07ebaf54d1f18e583e66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local21news.com", "main_image": "http://local21news.com///news/features/politics-and-government/images/politics_and_government_stopimg.jpg", "site_section": "http://local21news.com/news/features/politics-and-government/rss.xml", "section_title": "whp Politics and Government", "url": "http://www.local21news.com/news/features/politics-and-government/stories/A-viewers-39-guide-to-the-first-Democratic-debate-of-2016-race--218395.shtml", "country": "US", "title": "A viewers' guide to the first Democratic debate of 2016 race", "performance_score": 0, "site": "local21news.com", "participants_count": 0, "title_full": "A viewers' guide to the first Democratic debate of 2016 race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:11:00.000+03:00", "replies_count": 0, "uuid": "90078bbc4b2b4e792a7d07ebaf54d1f18e583e66"}, "author": "", "url": "http://www.local21news.com/news/features/politics-and-government/stories/A-viewers-39-guide-to-the-first-Democratic-debate-of-2016-race--218395.shtml", "ord_in_thread": 0, "title": "A viewers' guide to the first Democratic debate of 2016 race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A viewers' guide to the first Democratic debate of 2016 race \nUpdated: Tue, Oct 13 2015, 04:11 PM \nBy: Associated Press \nWASHINGTON -- Five Democrats vying to be President Barack Obama's successor meet Tuesday night for their first televised debate of the 2016 election, a confrontation between one of the best-known women on the planet and four men seeking to unseat her as the party's front-runner. \nBut that quartet of rivals may not be Hillary Rodham Clinton's most immediate challenge. Instead, it's whether she can change the focus from emails she sent and received over a private server as secretary of state to the policies she's proposed to close the gap between rich Americans and everyone else. \nHer chief rival for the Democratic nomination, Vermont independent Sen. Bernie Sanders, isn't likely to let her stand out on that point. Look for him to insist he's the authentic liberal, far ahead of Clinton on the issue of income inequality, as well as education and trade. \nHere are some things to watch for in the debate at the Wynn Las Vegas hotel and casino, with coverage beginning at 8:30 p.m. EDT on CNN. \n___ \nCLINTON VS CLINTON \nIf the emails come up — or, more likely, when they come up — look for Clinton to try to pivot from defending herself to explaining why she's running for president and what she would do as Obama's successor. She'll likely try to name issues on which she agrees with Obama, such as health care, while carefully noting where the two part ways, such as the Trans-Pacific Partnership trade deal. \nTwo recent developments could help Clinton deflect the email issue. \nThe first is House Majority Leader Kevin McCarthy's recent suggestion that the House committee investigating the deadly 2012 attack on the U.S. consulate in Benghazi, Libya, which has focused in recent months on Clinton's email, has paid off by damaging Clinton in the polls. \nWhile McCarthy apologized, his comment has fed Democratic arguments that the investigation was never truly about the deaths of four Americans. So, too, has the second development: accusations made this past weekend by a fired committee staff member that the panel is improperly focused on a partisan investigation of Clinton, rather than a definitive accounting of the attack. \n___ \nSANDERS VS CLINTON \nSanders has passion, while Clinton has experience in presidential primary debates. But don't look for the two to go after each other in dramatic fashion. Each needs the supporters of the other to win in a general election, and they're not likely to risk alienating them with open hostility. \nYet distinctions will be drawn. \nSanders has broadcast that he's not bothering with formal preparation for the debate. As a self-described democratic socialist, he's been advocating for middle- and lower-income Americans for years in the legislative arena. \nHe's likely to cast Clinton as a late-comer to efforts to make college more affordable, for example, and a flip-flopper on such issues as the Iraq War and trade. As a senator from New York, Clinton voted for the war, which she's since said she regrets. Last week, she reversed her support as secretary of state for the Pacific trade deal backed by Obama. \nClinton, meanwhile, is sure to suggest her proposals are more realistic than those offered by Sanders, including his call to make college tuition free for all Americans. \n___ \nTHE FRONT-RUNNERS VS THE REST \nClinton and Sanders are the unquestioned front-runners, but there will be three other candidates on stage — each sure to be searching for a breakout moment. \nExpect former Maryland Gov. Martin O'Malley to be the most aggressive. \"It's a very, very important opportunity for me to not only present my vision for where the country should head, but also 15 years of executive experience, actually accomplishing the progressive things some of the other candidates can only talk about,\" he said ahead of the debate. \nIt's a little bit of a mystery how former Virginia Sen. Jim Webb, a decorated Vietnam veteran, and Lincoln Chafee, a former governor and senator from Rhode Island, will engage with the rest of the field. \nNeither has campaigned as much as Clinton, Sanders and O'Malley up to this point, although both are critics of Clinton's vote for the Iraq War. \n___ \nTHE FIELD VS JOE BIDEN \nWill he or won't he? \nHovering over the debate will be Vice President Joe Biden, grieving father of son Beau, who is expected to announce within days whether he will make a late entry into the race. \nIf asked about the potential candidate who isn't at the debate, look for the candidates to offer up familiar responses about giving Biden time to mourn his son's death. \nWhile Biden's advisers have been talking to potential staff and donors, those familiar with his thinking say they don't expect him to upend the debate by revealing his plans before the candidates take the stage. \n___ \nTRUMP VS THE DEMOCRATS \nNever one to miss a chance at the spotlight, Republican front-runner Donald Trump said Tuesday that he planned to watch the debate and offer color commentary. \n\"At the request of many, and even though I expect it to be a very boring two hours, I will be covering the Democrat Debate live on twitter!\" Trump wrote in a tweet. Related Stories", "external_links": [], "published": "2015-10-13T19:11:00.000+03:00", "crawled": "2015-10-14T10:08:14.121+03:00", "highlightTitle": ""}