{"organizations": [], "uuid": "4006c72d0a1900600b3411630751ceaca5feb060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibabuzz.com", "main_image": "", "site_section": "http://www.ibabuzz.com/politics/comments/feed/", "section_title": "Comments for Political Blotter", "url": "http://www.ibabuzz.com/politics/2015/10/23/hillary-clinton-had-a-hell-of-a-good-week/comment-page-1/", "country": "US", "title": "Comment on Hillary Clinton had a hell of a good week. by Elwood", "performance_score": 0, "site": "ibabuzz.com", "participants_count": 1, "title_full": "Comment on Hillary Clinton had a hell of a good week. by Elwood", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T00:34:00.000+03:00", "replies_count": 0, "uuid": "4006c72d0a1900600b3411630751ceaca5feb060"}, "author": "Elwood", "url": "http://www.ibabuzz.com/politics/2015/10/23/hillary-clinton-had-a-hell-of-a-good-week/comment-page-1/", "ord_in_thread": 0, "title": "Comment on Hillary Clinton had a hell of a good week. by Elwood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Friday, October 23rd, 2015 at 9:24 am in 2016 presidential election , Hillary Clinton . \nAfter a summer of uneven, if not rather calamitous, performance on the campaign trail, Hillary Clinton had a hell of a good week. \nDemocratic also-rans Jim Webb and Lincoln Chafee dropped out – not that they’d made enough ground for Clinton to care, but their absence reduces some of the white noise from the race and from the second debate, scheduled for Nov. 6. \nVice President Joe Biden ended months of speculation Wednesday by announcing he won’t run – a huge boon for Clinton, as his path forward would’ve been to peel away her supporters and donors. \nAnd Thursday’s Benghazi hearing brought nothing new, even by chairman Trey Gowdy’s own admission – 11-plus hours without a solid punch landed, without a gaffe, without Clinton losing her cool. \nHouse Republicans long have wanted to pin Clinton with having ignored intelligence that an attack was coming, or with having stood in the way of sending aid during the attack; neither has been borne out by facts, so they’ve the cover-up narrative is what’s left. Thursday’s hearing probably cemented Republicans’ criticism that she wasn’t completely straight with the public in the days right after the September 2012 attack, but there are more than just political reasons why that might’ve been so. Might not a balance between intelligence, diplomacy and military action sometimes require not publicly tipping your whole hand right away, especially if some misdirection might provide time and space to identify and strike back against those responsible? And if the administration’s comments in the first few days after the attack were motivated only by presidential election politics, wouldn’t they have tried to maintain the charade longer, rather than acknowledging before that month’s end that the evidence supported a premeditated attack? Still, the information she and others put out in the first few days was wrong, and that’s been aired again. \nMeanwhile, Democratic primary voters saw an all day-marathon of Clinton looking calm, cool, collected and thoughtful, which is what most want in a presidential candidate. She’s not out of the woods yet – trustworthiness and transparency issues raised by her overall email situation will continue to plague her – but she’s on the path. \nClinton already was trending upward in the polls at this week’s start, based on her performance in last week’s Democratic debate. I expect to see a more dramatic increase next week, as she gains support from many who had been holding out for Biden and as the dust settles from Thursday’s hearing. \n[You can leave a response , or trackback from your own site.] JohnW \nThere’s that old expression, “Knock yourself out,” when someone is determined to do something that may not be such a good idea but you let them do it anyway. That seems to be what Gowdy’s Benghazi committee (the last of several Benghazi so-called “investigations”) did. Joe Scarborough (Morning Joe), not exactly a flaming liberal, called yesterday’s hearing spectacle a “TKO” for Hillary. Not because of punches landed by Hillary (although there were a few of those) but because of punches landed on the Republicans by themselves with their meandering lines of questioning (such as the obsession with Sidney Blumenthal). JohnW \nAfter these public remarks by Romney and his wife about Romneycare and Obamacare, I don’t think the GOP will be turning to Romney as an establishment alternative to stop Trump.", "external_links": [], "published": "2015-10-24T00:34:00.000+03:00", "crawled": "2015-10-24T17:03:53.761+03:00", "highlightTitle": ""}