{"organizations": [], "uuid": "e3ae11f24ab5970e50d8d6063af0e5d09a539ffe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://www.whatdoesitmean.com/osr1.png", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/war-and-conflict/2015/10/report-russia-authorizes-shootdown-of-american-planes-resupplying-isis-isil-2458692.html", "country": "US", "title": "Report: Russia Authorizes Shootdown of American Planes Resupplying ISIS - ISIL. | War and Conflict", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 4, "title_full": "Report: Russia Authorizes Shootdown of American Planes Resupplying ISIS - ISIL. | War and Conflict", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:05:00.000+03:00", "replies_count": 4, "uuid": "e3ae11f24ab5970e50d8d6063af0e5d09a539ffe"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/war-and-conflict/2015/10/report-russia-authorizes-shootdown-of-american-planes-resupplying-isis-isil-2458692.html", "ord_in_thread": 0, "title": "Report: Russia Authorizes Shootdown of American Planes Resupplying ISIS - ISIL. | War and Conflict", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nAngry Putin Authorizes Shootdown Of US Planes Over Syria\nNote the date ;- Oct 13 > Russian Revolution (1917) and Miracle at Fatima.(1917) ….same day.\nOctober 13, 2015\nAngry Putin Authorizes Shootdown\nOf US Planes Over Syria\n(blue-embedded links)\nThe Ministry of Defense ( MoD ) is reporting today that President Putin has authorized the immediate deployment to the Levant War Zone (Syria) of at least 30 additional Aerospace Forces air-to-air Sukhoi Su-30 fighter jets that have proven capable of defeating their most sophisticated counterparts used by the US Air Force.\nThe mission of these Sukhoi Su-30 fighter jets, this report explains, is to “ deter/target/destroy ” Obama regime forces aircraft that have illegally begun dropping war supplies to Islamic terrorists in Syria in violation of international law after Aerospace Forces have nearly obliterated all of ISIS/ISIL forces ammunition and heavy vehicles within this war zone.\nIn a public address earlier today castigating the Obama regime for arming these Islamic terrorists, this report says, President Putin further stated: “ Now they announced that they are supplying the Free Syrian Army with weapons, ammunition. Where is this Free Syrian Army? If they just unload and throw these arms, weapons and ammunition out of air, where is the guarantee that it would not fall into the hands of ISIL like it was during the preparation of another makeup of the Syrian army ?”\nThis report notes that the Obama regimes propaganda about the existence of a Free Syrian Army was proven to be a myth by one of America’s own mainstream news sources, NBC, who in examining these alleged fighters described them as: “ The Free Syrian Army is an army in name only. It is made up of hundreds of small units, some secular, some religious – whether mainstream or radical. Others are family gangs, or simply criminals .”\nForeign Minister Sergey Lavrov, this report further explains, who has “ no doubt ” these Obama regime weapons have fallen into Islamic terrorists hands , even asked his Obama regime counterpart, US Secretary of State John Kerry, to provide information about this “ fake ” army so that Russia might coordinate with them, a request to which Secretary Kerry did not even reply.\nWith the Obama regimes actions in regard to protecting their Islamic terrorists, this report continues, they have, also, become more insane by the day as aside from them now dropping war supplies to them, they have now begun assisting Turkey in bombing the Kurdish fighters in Iraq whom, likewise, had just been supplied with American arms and ammunition.\nUpon Turkey’s bombing of these Kurdish forces fighting against Islamic terrorists, this report says, President Putin held an urgent meeting with the Turkish ambassador to Moscow, Mr Ümit Yardim, wherein Russia’s leader told him: “ …tell your dictator president he can go to hell along with his ISIS terrorists and I shall make Syria to nothing but a ‘Big Stalingrad’, for Erdoğan and his Saudi allies are no less vicious than Adolf Hitler .”\nAlso, this report continues, President Putin delivered the same “ forceful ” message to Saudi Arabia’s defence minister Sheikh Mohammed bin Salman when they met this past weekend in response to Saudi clerics declaring war against Russia .\nPresident Putin’s “ verbal imagery ” comparing the Great Patriotic War (World War II) Battle of Stalingrad to what is now happening in Syria to both Turkey and Saudi Arabia, this report details, should not be lost in its fullest meeting as that strategic confrontation against Adolf Hitler’s Nazi Germany was over the oil resources in that region—and to which Hitler accurately described its critical importance by stating: “ If I do not get the oil of Maikop and Grozny then I must finish [liquidieren; \"kill off\", \"liquidate\"] this war .”\nAnd as Stalingrad was the “ linchpin ” which determined the fate of Russia against Nazi Germany in World War II, this report continues explaining, so is Syria today as the Obama regime and its Western allies continue to support the cruel, barbaric and despotic Islamic theocracies of Saudi Arabia and its Gulf State monarchies who remain so out of step of with the modern world their societies can only be described in the most medieval of terms.\nAs energy is the foundation of Russia, its economy, its government, and its political system , this report warns, the last few years has seen the threats to Russia’s energy industry from an increasingly desperate West led by the Obama regime multiply and intensify to such an extent that they now pose an existential threat to the industry—and therefore to the Russian economy—meaning Russia itself.\nTo what is fueling this conflict, this report further explains, are the pipelines (existing and proposed) transiting both Syria and Iraq which the West seeks to control, but which Russia is determined to never allow.\nWith the West knowing this fact that Russia’s very survival is at threat in this conflict, this report further warns, the Obama regime and its allies continue to spout propaganda lies to their people about what this war is about—and leading some commentators in America to wonder if President Obama is actually trying to start World War III .\nAnd with the US Senate now insanely proposing that Syrian refugees be used as human shields to protect these Islamic terrorists , this report grimly notes, even US Senator Rand Paul has had to warn his nation that such a move would lead to World War III .\nAnd with Russia being the world’s richest country when it comes to natural resources having a value of $75.7 trillion , and a paltry debt against it of only $246 billion , this report concludes, the United States total natural resources worth of $45 trillion is massively dwarfed by its staggering debt of $116 trillion ($18 trillion actual and $98 trillion in unfunded liabilities), thus showing clearly why the bankrupt Obama regime needs to destroy Russia.\nAfter all, a tyrannical empire ruling over an ignorant population is only as successful as the nations it can plunder—it remains highly doubtful that Russia is going to be one of them.\nOctober 13, 2015 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked back to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL .", "external_links": ["http://eng.mil.ru/", "http://sputniknews.com/middleeast/20151013/1028457170/us-syria-weapon-supplies-isil.html", "http://www.zerohedge.com/news/2015-09-10/competing-gas-pipelines-are-fueling-syrian-war-migrant-crisis", "http://247wallst.com/special-report/2012/04/18/the-worlds-most-resource-rich-countries/3/", "https://en.wikipedia.org/wiki/Sukhoi_Su-30", "http://www.whatdoesitmean.com/osr4.jpg", "http://www.infowars.com/us-senate-hearing-discusses-using-refugees-as-human-shields-in-syria/", "http://theaviationist.com/2014/06/18/su-30-beat-f-15-everytime/", "http://www.dailymail.co.uk/news/article-3270466/Saudi-Arabian-clerics-declare-jihad-against-Assad-Putin-s-forces-urging-Sunni-Muslims-join-rebels-shortly-rockets-fired-Russian-embassy-Syria.html", "http://www.whatdoesitmean.com/osr3.jpg", "http://www.whatdoesitmean.com/osr1.png", "http://www.zerohedge.com/news/2015-10-06/russia-plotting-bring-down-opec", "http://www.reuters.com/article/2015/10/13/us-mideast-crisis-syria-idUSKCN0S61LX20151013", "https://www.rt.com/news/318537-us-munitions-syria-rebels/", "http://www.infowars.com/is-barack-obama-actually-trying-to-start-world-war-iii/", "http://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "http://www.nationaldebtclocks.org/debtclock/russia", "https://en.wikipedia.org/wiki/Linchpin", "http://therealnews.com/t2/index.php?option=com_content&task=view&id=31&Itemid=74&jumival=10681", "http://www.usdebtclock.org/", "http://conservativepost.com/putin-to-muslim-turkish-ambassador-tell-your-dictator-president-he-can-go-to-hell-along-with/", "http://www.theguardian.com/world/2015/oct/11/vladimir-putin-saudi-defence-minister-syria-talks", "http://russia-insider.com/en/politics/lavrov-show-us-your-fake-free-syrian-army/ri10286", "https://www.rt.com/news/318545-isis-lose-ammunition-russia/", "http://www.whatdoesitmean.com/index1924.htm", "http://creativecommons.org/licenses/by-sa/2.0/", "https://www.washingtonpost.com/news/post-politics/wp/2015/10/07/rand-paul-no-fly-zone-in-syria-could-lead-to-world-war-iii/", "http://www.frontpagemag.com/point/203725/nbc-news-admits-free-syrian-army-myth-daniel-greenfield", "http://www.whatdoesitmean.com/osr2.jpg", "http://eng.mil.ru/en/structure/forces/type/vks.htm", "https://en.wikipedia.org/wiki/Levant", "https://en.wikipedia.org/wiki/Battle_of_Stalingrad", "http://www.whatdoesitmean.com/index1926.htm", "https://en.wikipedia.org/wiki/Battle_of_Stalingrad#Prelude"], "published": "2015-10-14T01:05:00.000+03:00", "crawled": "2015-10-14T06:35:51.753+03:00", "highlightTitle": ""}