{"organizations": [], "uuid": "ab63d46ce8ffeff7f7613de92b535631a6420409", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/rnc-2016/photo/2015/10/02/18883439-standard.jpg", "site_section": "http://www.cleveland.com/open/", "section_title": "Ohio Politics &amp; Election News | cleveland.com ", "url": "http://www.cleveland.com/rnc-2016/index.ssf/2015/10/rand_pauls_fundraising_dropped.html", "country": "US", "title": "Rand Paul's fundraising dropped to $2.5 million in last quarter: Rand Paul in the news", "performance_score": 0, "site": "cleveland.com", "participants_count": 3, "title_full": "Rand Paul's fundraising dropped to $2.5 million in last quarter: Rand Paul in the news | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:25:00.000+03:00", "replies_count": 2, "uuid": "ee37ce7ea3769c54107bf50a8aebd24043e67f8e"}, "author": "Sabrina Eaton, Northeast Ohio Media Group Washington Correspondent", "url": "http://www.cleveland.com/rnc-2016/index.ssf/2015/10/rand_pauls_fundraising_dropped.html#post-0", "ord_in_thread": 0, "title": "Rand Paul's fundraising dropped to $2.5 million in last quarter: Rand Paul in the news", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today's Rand Paul news: Kentucky GOP Sen. Rand Paul will report around $2.5 million in donations to his presidential campaign, a dip from his first quarter, though his campaign is emphasizing that more money started to roll in recently. \"Not only are we in for the long haul but we've seen an uptick in crowds and support,\" said Paul's spokesman Sergio Gor. \"Since the last debate we've raised $750,000.\" One of the first candidates to officially declare for the White House, Paul had raised close to $7 million from April through June. That was slightly more than his father, former Texas Congressman Ron Paul, raised in the comparable period of his 2012 bid. But in the next quarter of that campaign, Ron Paul raised $8 million: The Washington Post\nThe third-quarter haul is the smallest of any candidate who has announced so far. Republican Ben Carson on Wednesday said his campaign had raised $20 million, while Jeb Bush's campaign disclosed only that it had exceeded its second-quarter haul of $11.4 million. On the Democratic side, front-runner Hillary Clinton raised $28 million, edging out Bernie Sanders by just $2 million. As his fundraising struggles, Paul risks being relegated to the second-tier debate later this month. CNBC on Wednesday released its criteria for participation, and Paul barely qualifies for the primetime event as of the polls released so far. The final decision won't be made until after Oct. 21. Paul currently has 2.3% of support among Republican primary voters, according to a Real Clear Politics average of recent polls: The Wall Street Journal\nEarlier in the week, Ed Crane, who has been overseeing the Libertarian Purple PAC, said the group had stopped asking for cash for Paul until the 2016 candidate focuses more on his Libertarian leanings. \"I have stopped raising money for him until I see the campaign correct its problems,\" Crane told Politico. \"I wasn't going to raise money to spend on a futile crusade.\" The other super PACs supporting Paul, America's Liberty PAC and Concerned American Voters, released statements saying they were still on board with Paul and making good progress. Paul's campaign has had to fight speculation, too, that he is inching toward dropping out and shifting his focus toward keeping his Senate seat. This week, Paul held a pair of Washington, D.C., fundraisers for his Senate race: Politico\nFollow @sabrinaeaton", "external_links": ["http://blogs.wsj.com/washwire/2015/10/01/rand-paul-raised-2-5-million-in-third-quarter-as-campaign-founders/", "http://www.washingtonpost.com/news/post-politics/wp/2015/07/10/rand-pauls-presidential-campaign-raises-7-million/", "http://www.politico.com/story/2015/10/rand-paul-campaign-finance-third-quarter-fundraising-214340", "https://s0.2mdn.net/instream/video/client.js", "https://twitter.com/sabrinaeaton", "http://www.washingtonpost.com/news/post-politics/wp/2015/10/01/rand-paul-raises-2-5-million-in-second-quarter/"], "published": "2015-10-02T16:25:00.000+03:00", "crawled": "2015-10-02T18:58:24.488+03:00", "highlightTitle": ""}