{"organizations": [], "uuid": "f2991260f56942de8706c5a2800470e28ac5493a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.veteransnewsnow.com", "main_image": "", "site_section": "http://www.veteransnewsnow.com/category/government-and-politics/feed/", "section_title": "Veterans News Now » Politics Archive » Veterans News Now", "url": "http://www.veteransnewsnow.com/2015/10/20/522194the-tide-is-turning-against-zionist-extremism/", "country": "US", "title": "The tide is turning against Zionist extremism", "performance_score": 0, "site": "veteransnewsnow.com", "participants_count": 1, "title_full": "The tide is turning against Zionist extremism", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:50:00.000+03:00", "replies_count": 0, "uuid": "f2991260f56942de8706c5a2800470e28ac5493a"}, "author": "VNN", "url": "http://www.veteransnewsnow.com/2015/10/20/522194the-tide-is-turning-against-zionist-extremism/", "ord_in_thread": 0, "title": "The tide is turning against Zionist extremism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Veterans call for end to war in Afghanistan, condemn hospital bombing ‹ › Since 2011, VNN has operated as part of the Veterans Today Network ; a group that operates over 50 plus media, information and service online sites for U.S. Military Veterans. The tide is turning against Zionist extremism By VNN on October 20, 2015 These changing perceptions are the result of the rise of alternative forms of media, which have broken through the mainstream media’s imbalanced and inaccurate portrayal of the Israeli-Palestinian conflict. What the Zionist lobby fears most is free speech. (via Aljazeera) by Mark LeVine \nAl Jazeera, America \nPoor Sheldon Adelson. Even fellow billionaire Haim Saban has had enough. So toxic has the self-described pro-Israel conservative become that Saban, a major supporter of Democratic presidential candidate Hillary Clinton, can no longer bring himself to deposit his millions with Adelson, even when the goal is to combat the latest mortal threat to Israel’s existence (or, rather, unchallenged legitimacy): the boycott, divestment and sanctions (BDS) movement . Sheldon Adelson is a Republican and Haim Sabbah is a Democrat. \nSaban had reportedly pledged support for Adelson’s $50 million effort to oppose the growing BDS movement against the Israeli occupation at U.S. universities. The movement’s focus on academic and cultural activities directly challenges Israel’s portrayal of itself as a modern, liberal democracy. It has thus touched a raw nerve across academia and U.S. politics and has led many university administrations to adopt strong stands against it as a way of demonstrating their support for academic freedom. \nSaban won’t be donning a keffiyeh anytime soon, but it’s clear that the increasingly politically conservative mainstream American Jewish leadership bears closer resemblance to the current Republican presidential field than to the broad base of American Jewry, which remain among the most strongly liberal demographic groups in the country. American Jewish college students in particular tend to be progressive, which is why college campuses have become ground zero in the battle over Israel’s image. The tide is turning against Zionist extremism. \nFor decades, the one issue that has been the exception to the broadly progressive streak within American Judaism has been Israel. The Jewish state has received unchallenged support by most Jews despite its decades-long occupation of the West Bank and the pursuit of policies toward Palestinians that, were they practiced by any other country, would be overwhelmingly opposed by American Jews. \nThis support has rested on three conditions. First, American Jews have seen Israel as under a constant and mortal threat by the surrounding Arab and Muslim world. The 1948, 1956, 1967, 1973 and 1982 wars had to be successfully depicted as defensive and necessary to prevent the destruction of the Jewish state. \nIn 1948 the recent memory of the Holocaust naturally gave such threats particular salience. But the passing of the Holocaust generation and the ever-widening body of research challenging the argument that Israel’s wars have always with wars of no choice (in Hebrew, ein breira ) have gradually weakened the claim that Israel has always been the victim of others’ aggression. \nSecond, the occupation has been portrayed and understood as primarily about security. Most American Jews would not support an occupation based on conquest and displacement, while one based on security leaves open the possibility for a land-for-peace compromise once Israel’s legitimate security needs are met. Palestine being wiped off the Map by Israeli occupation and aggression \nBut it is increasingly clear that the occupation has never been about security — if it were, Israel could legally have maintained a military occupation without moving a single settler into the occupied territories. \nNow, with the majority of Israeli political elites openly declaring their desire to annex most of the West Bank and prevent the establishment of a Palestinian state under any circumstances, the security argument for maintaining the occupation no longer holds much water. \nThird, Palestinians have been portrayed as irrational, hate-filled others who cannot be reasoned with. As long as Palestinian anger and violence leave no partner for peace, then there is no reason to examine Israel’s policies too closely. Palestinian terrorism, whether by the Palestine Liberation Organization in the 1960s and 1970s or Hamas in the decades since, has legitimized this discourse. Anti-BDS initiatives are doomed to fail, particularly when they attempt to bully universities and even Jewish students into muting criticism. BDS – solidarity waves London \nHowever, the renunciation of violence by the PLO in 1988, the Palestinian participation in the Oslo peace process and the low level of Palestinian violence in recent years have all weakened this argument. Moreover, Israel’s response to Palestinian violence has been so disproportionate that even many of Israel’s supporters have questioned its motives. \nThese changing perceptions are the result of the rise of alternative forms of media, which have broken through the mainstream media’s imbalanced and inaccurate portrayal of the Israeli-Palestinian conflict. At the same time, a new generation of very assimilated, media-savvy young Arab-Americans has emerged on college campuses, often participating in the very same progressive activities and clubs as their Jewish-American peers. \nCoalitions bringing both groups of students into contact have become far more common, creating new relationships and deeper mutual understanding despite and ultimately in place of hostility and mutual recriminations. Even where conflicts have been particularly intense, professors and administrators have over time come together to create platforms, such as the Olive Tree Initiative , that have brought the two sides together on campuses and even in Israel and the Palestinian territories for open and critical discussions. BDS – The New York Campaign \nInto this mix has come the BDS movement against the occupation . Its growing popularity among many academic professional societies is matched by an increasing willingness among American Jewish students to discuss and openly support the movement. Groups such as Open Hillel and Jewish Voices for Peace — the fastest-growing Jewish group in the U.S., which openly supports full BDS — are pushing the boundaries of acceptable criticism of Israel on campuses and beyond. \nIt is precisely this dynamic that led conservative Jewish leaders such as Adelson and initially Saban to fund an opposition campaign. But such initiatives are doomed to fail, particularly when they attempt to bully universities and even Jewish students into muting criticism. Sen Dianne Feinstein along with her husband Richard Blum (left ) \nFor example, Richard Blum — an investment banker, a University of California regent and the husband of California Sen. Diane Feinstein — recently threatened the University of California with his wife’s wrath if it didn’t enact a new speech code that would silence most speech critical of Israel. No sooner had he made his threat than Jewish Voices for Peace and the Palestine Legal and the Center for Constitutional Rights released simultaneous reports that document a relentless and completely unethical campaign of attacks and intimidation of students and faculties across the country to suppress all serious criticism of Israel. \nEven a decade ago, such reports would have had a hard time reaching a wide audience, in or outside the Jewish community. Today they quickly go viral, becoming impossible to ignore. And their arguments are amplified by the almost daily videos from the occupied territories that show Israeli soldiers and settlers attacking , arresting and beating children, shooting Palestinians and even pouring concrete into homes . Sooner or later, the weight of reality becomes so overwhelming that any attempt to deny it only makes those in power look worse. I am sometimes asked if I have any regrets about publishing our book. As of today, my only regret is that it is not being published now. After the humiliations that Obama has endured at the hands of the Israel Lobby and the Hagel circus, we would sell even more copies and we would not face nearly as much ill-informed criticism. — Stephen Walt, co-author of the book. \nThis is the moment Israel and its supporters have reached, not just with the world at large but with an increasing number of American Jews as well. \nAs the inherent contradiction between Israel’s self-image as a modern, democratic and progressive country and the reality of a half-century-long brutal occupation become clear to all, the erosion of support for Israel by the emerging generation of American Jews will continue and likely increase, with profound consequences not just for Israel but also for the future of the American Jewish community. Mark LeVine , UC Irvine \nMark LeVine is a professor of history at the University of California at Irvine and a distinguished visiting professor at the Center for Middle Eastern Studies. \nHe is a co-editor, with Mathias Mossberg, of “ One Land, Two States: Israel and Palestine as Parallel States .”   VNN on October 20,   Corruption , Election 2016  ", "external_links": [], "published": "2015-10-20T22:50:00.000+03:00", "crawled": "2015-10-21T01:29:51.814+03:00", "highlightTitle": ""}