{"organizations": [], "uuid": "7c74a65f8f617f5edbd0cd1eb8cf24df598163a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/02/381664-russia-bombs-in-syria-pti.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/world/report-russia-bombs-syria-for-third-day-mainly-avoiding-isis-2131048", "country": "SG", "title": "Russia bombs Syria for third day, mainly avoiding ISIS", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "Russia bombs Syria for third day, mainly avoiding ISIS | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:15:00.000+03:00", "replies_count": 0, "uuid": "7c74a65f8f617f5edbd0cd1eb8cf24df598163a4"}, "author": "Reuters", "url": "http://www.dnaindia.com/world/report-russia-bombs-syria-for-third-day-mainly-avoiding-isis-2131048", "ord_in_thread": 0, "title": "Russia bombs Syria for third day, mainly avoiding ISIS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In this photo made from the footage taken from Russian Defense Ministry official web site on Thursday, Oct. 1, 2015 a bomb explosion is seen in Syria. PTI Russia bombed Syria for a third day on Friday, mainly hitting areas held by rival insurgent groups rather than the ISIS fighters it said it was targeting.\nWashington, which is leading its own air campaign against ISIS, says Moscow has been using its campaign as a pretext to hit other groups opposed to Russia's ally, President Bashar al-Assad. Some of the groups that have been hit are supported by countries which oppose both Assad and ISIS, including at least one group that received training from the CIA.\nMoscow said on Friday its latest strikes had hit 12 ISIS targets, but most of the areas it described were in parts of the country where the militant group has little or no sway.\nThe Russian Defence Ministry said its Sukhoi-34, Sukhoi-24M and Sukhoi-25 warplanes had flown 18 sorties, describing targets in western and northern Syria, including a command post and a communications centre in the province of Aleppo, a militant field camp in Idlib and a command post in Hama. The UK-based Syrian Observatory for Human Rights, which monitors the conflict with a network of sources on the ground, said ISIS had no presence in the western and northern areas that were struck.\nThe Observatory's head, Rami Abdulrahman, said one of the targets hit in the latest Russian air strikes, the town of Dar Tazzah in northwestern Aleppo province, was controlled by a number of insurgent groups including the al Qaeda-linked Nusra Front. Russia has however also struck ISIS areas in a small number of other attacks further east. The Observatory said 12 ISIS fighters were killed near Raqqa on Thursday, and planes believed to be Russian had also struck the ISIS-held city of Qarytayn.\nPresident Vladimir Putin's decision this week to launch air strikes on Syria marks a dramatic escalation of foreign involvement in a four-year-old civil war in which every major country in the region has a stake.\nLebanese sources say that hundreds of Iranian troops have also arrived in recent days in Syria to participate in a major ground offensive alongside government troops and their Lebanese and Iraqi Shi'ite militia allies.\nRussia's air campaign in a country already being bombed by a US-led coalition of Western and Arab countries means that the Cold War superpower foes Moscow and Washington are now flying combat missions over the same country for the first time since World War Two.\nA frame grab taken from video released by the Russian Defence Ministry October 1, 2015, shows Russian jets hitting a target in Syria, which the Kremlin says includes a list of well-known militant organizations and not only ISIS. Image Credit: Reuters\nCommon enemy, different friends The United States and Russia say they have a common enemy in ISIS, which has proclaimed a caliphate across swathes of Syria and Iraq. But they also have very different friends and opposing views of how to resolve a war that has killed at least 250,000 people and driven more than 10 million from their homes.\nWashington opposes both ISIS and Assad, blaming him for attacks on civilians that have radicalised the opposition and insisting that he has no place in a post-war settlement. Russia says Assad's government should be the centrepiece of international efforts to fight militants.\nThe campaign is the first time Moscow has sent forces into combat beyond the frontiers of the former Soviet Union since the disastrous Afghanistan campaign of the 1980s, a bold move by Putin to extend Russia's influence beyond its neighbourhood. It comes at a low point in Russia's relations with the West, a year after the United States and EU imposed financial sanctions on Moscow for annexing territory from Ukraine.\nAssad and his father before him were Moscow's close allies in the Middle East since the Cold War, and Russia maintains its only Mediterranean naval base on the Syrian coast.\nMoscow's intervention comes at a time when insurgents had been scoring major battlefield gains against government forces after years of stalemate in the war. Putin appears to be betting that by defending Assad he can increase Russia's influence in any post-war settlement, safeguard the naval base and counter the influence of regional rivals like NATO member Turkey. He may also intend to reinforce his image at home as a strong leader willing to challenge global rivals, first and foremost the United States.", "external_links": [], "published": "2015-10-02T16:15:00.000+03:00", "crawled": "2015-10-02T18:29:18.625+03:00", "highlightTitle": ""}