{"organizations": [], "uuid": "90d2f242595470c3f7323f9a0f2e0b18b0446920", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://www.magnifiedview.com/wp-content/uploads/2013/03/Predictions-2-Immigration-Path-To-Citizenship.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/immigration/2015/10/obama-destroying-american-for-dummies-2451866.html", "country": "US", "title": "Obama Destroying American - For Dummies | Immigration", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Obama Destroying American - For Dummies | Immigration", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:24:00.000+03:00", "replies_count": 0, "uuid": "90d2f242595470c3f7323f9a0f2e0b18b0446920"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/immigration/2015/10/obama-destroying-american-for-dummies-2451866.html", "ord_in_thread": 0, "title": "Obama Destroying American - For Dummies | Immigration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\n Please Share: Obama Transforming America to a Communist Caliphate.\nSan Diego, CA October, 2015 by Backpack and Janorama. Here is Obama’s playbook to transform America. The playbook here hasn’t been broadcast until today. Spoken by Democrat Governor of Colorado, Dick Lamm, in 2004 at an immigration conference meeting.\n AMERICAN SUICIDE\nWherever you stand, please take the time to\n read this; it ought to scare the pants off you!\n We know Dick Lamm as the former Governor of Colorado (Democrat). In that context his thoughts are particularly poignant. There was an immigration overpopulation conference in Washington, DC, filled to capacity by many of America’s finest minds and leaders. A brilliant college professor by the name of Victor Davis Hansen, talked about his latest book, “Mexifornia,” explaining how immigration – both legal and illegal was destroying the entire state of California. He said it would march across the country until it destroyed all vestiges of The American Dream.\n Moments later, former Colorado Governor Richard D. Lamm, stood up and gave a stunning speech on how to destroy America. The audience sat spellbound as he described eight methods for the destruction of the United States. He said, “If you believe that America is too smug, too self-satisfied, too rich, then let’s destroy America. It is not that hard to do.\nNo nation in history has survived the ravages of time. Arnold Toynbee observed that all great civilizations rise and fall and that ‘An autopsy of history would show that all great nations commit suicide.”\n ”Here is how they do it,” Lamm said:\n“First, to destroy America, turn America into a bilingual or multi-lingual and bicultural country.” History shows that no nation can survive the tension, conflict, and antagonism of two or more competing languages and cultures. It is a blessing for an individual to be bilingual; however, it is a curse for a society to be bilingual.\nThe historical schola r, Seymour Lipset, put it this way: “The histories of bilingual and bi-cultural societies that do not assimilate are histories of turmoil, tension, and tragedy.” Canada, Belgium, Malaysia, and Lebanon all face crises of national existence in which minorities press for autonomy, if not independence. Pakistan and Cyprus have divided. Nigeria suppressed an ethnic rebellion. France faces difficult times with Basques, Bretons, and Corsicans.”\nEd Note: “Mexican legal and illegals fiercely maintain their Mexican identity viewing assimilating to the U.S.A. in open contempt. They stubbornly insist on bringing their language, culture, religion, mores, and traditions to American cities”, said Backpack, “Mexican flags everywhere. La Raza, Reconcista and Mexican Mafia (EmE) ruling their barrios. 62 languages are spoken in the San Diego, CA school districts. “\nSecond, Lamm went on: to destroy America, “Invent ‘multiculturalism’ and encourage immigrants to maintain their culture. Make it an article of belief that all cultures are equal. That there are no cultural differences. Make it an article of faith that the Black and Hispanic dropout rates are due solely to prejudice and discrimination by the majority. Every other explanation is out of bounds.\nEd Note: 13M blacks equals 0.4% of the U.S. population. ”40,300,000 of the population are dis-incentivized through Obamanation’s enslavement through ’free stuff’ entitlements. 30M+ Mexican and Latinos equals 0.10% of the U.S. population maintaining barrios throughout the USA. Obama is adding a third layer of second class citizens who refuse to assimilate to our culture. Middle Eastern and North African Muslims are living a private Sharia life. Look at Dearborn, MI and St Paul, MN as exa mples of Islam enclaves. This totals combined these minorities make up approximately 12% of the U.S. population living disenfranchised from main stream America.\nThey inhabit Barrios and Government housing projects. Extensive surveys reveal cites that entire cities are taken over by illegal and legal minorities, through the Democratic elections process. Look at Los Angeles, third largest city in the U.S.A., where Caucasian citizens are now the minority. Diversity is the mantra of the Communist Common Core curriculum and teachers’ unions, belittling US History and our accomplishments.\nASTOUNDINGLY! Young black and Latino males or nominally 6% of the U.S. population accounting for approximately 60% of all city, county, state and federal jails and prisons incarceration. Please read it again and verify on your search engines.\n Third, “We could mak e the United States an ‘Hispanic Quebec’ without much effort. The key is to celebrate diversity rather than unity. As Benjamin Schwarz said in the Atlantic Monthly recently: ”The apparent success of our own multi-ethnic and multi-cultural experiment might have been achieved not by tolerance but by hegemony.\nWithout the dominance that once dictated ethnocentricity and what it meant to be an American , we are left with only tolerance and pluralism to hold us together.” Lamm said, “I would encourage all immigrants to keep their own language and culture. I would replace the melting pot metaphor with the salad bowl metaphor. It is important to ensure that we have various cultural subgroups living in America enforcing their d ifferences rather than as Americans, emphasizing their similarities.”\nEd. Note: 50+% high school drop out rates, no and low skill immigrants generations who refuse to learn a word of English or learn a trade tells a sad tale . These 2 minorities account for more than 60% of total federal prison incarcerations. Muslims living a Theocratic secluded lifestyle, prefuring Sharia Law, promoting a worldwide Caliphate in Dearborn, MI, Saint Paul, MN and elsewhere, practicing Sharia Law.\n“Fourth: I would make our fastest growing demographic group the least educated. I would add a second underclass, unassimilated, undereducated, and antagonistic to our population. I would have this second underclass have a 50% dropout rate from high school.”\nEd. Note: Blacks, and Latinos. Black lives matter, Black Panthers, Cartels, Cripts, Bloods MS13 and street gangs. Electing leadership the likes of Farrakhan, Jesse Jackson, Sharpton. Obama importing 100s of thousands of young Muslim males under fictitious political asylum. 18 U.S. city mayors have requested Obama import Muslims refugees to their cities on financial grants . 70+% of these refugees are young fit males. Obama is filtering out Christian refugees.\n ” My fifth point for destroying America would be to get big foundations and business to give these efforts lots of money. I would invest in ethnic identity, and I would establish the cult of ‘Victimology.’ I would get all minorities to think that their lack of success was the fault of the majority. I would start a grievance industry blaming all minority failure on the majority population. “\nEd. Note: I’m a victim – Blacks are victims – Latinos are victims – Muslims are victims – Wouldn’t you like to be a victim too? Obama’s war on Coppers, Armed Forces, Wall Street, Women, war on Caucasians and everyone except al Quaeda and ISIS. Soros, Hilary The Hun, and other ‘charitable’ foundations. Mainstream Media and Hollywood enslaved to the politically correct cause.\n“My Sixth plan for America’s downfall would include dual citizenship, and promote divided loyalties. I would celebrate diversity over unity. I would stress differences rather than similarities.\n Diverse people worldwide are mostly engaged in hating each other - that is, when they are not killing each other. A diverse, peaceful, or stable society is against most historical precedent.\n People undervalue the unity it takes to keep a nation together. Look at the ancient Greeks. The Greeks bel ieved that they belonged to the same race; they possessed a common Language and literature; and they worshipped the same Gods. All Greece took part in the Olympic games.\n A common enemy, Persia, threatened their liberty. ! Yet all these bonds were not strong enough to overcome two factors: local patriotism and geographical conditions that nurtured political divisions. Greece fell. “E. Pluribus Unum” — from many, one. In that historical reality, if we put the emphasis on the ‘Pluribus’ instead of the ‘Unum,’ we will balkanize America assuredly as Kosovo.”\nEd Note: Obama holds patriotism as passé. He apologizes for what he perceives as Imperialist A merica. Political correctness on steroids, his Communist Common Core Curicullum, promoting U.N. Agenda 21, non-national soverignty, The New World Order and 1 global currency, takeover as the only hope for humanity.\n ” Next to last , I would place all subjects off limits; make it taboo to talk about anything against the cult of ‘diversity.’ I would find a word similar to ‘heretic’ in the 16th century – that stopped discussion and paralyzed thinking. Words like ‘racist’ or ‘xenophobe’ halt discussion and debate.\nHaving made America a bi-lingual/bicultural country, having established multiculturalism, having the large foundations fund the doctrine of ‘victimology,’ I would next make it impossible to enforce our immigrat ion laws. I would develop a mantra: That because immigration has been good for America, it must always be good. I would make every individual immigrant symmetric and ignore the cumulative impact of millions of them. “ In the last minute of his speech, Governor Lamm wiped his brow. Profound silence followed. Finally he said:\n“Lastly, I would censor Victor Hanson Davis’s book “Mexifornia.” His book is dangerous. It exposes the plan to destroy America. If you feel America deserves to be destroyed, don’t read that book.”\nED Note: Do away with all loyalty oaths – Shred the 2nd amendment – Civil rights above rule of law – Media control - LGBT - eliminate the Constitution – Founding Fathers – Belittle US History and accomplishments – Discredit local law enforcement – Idealize and support violent protest – decimate our Armed Forces – emasculate our cops – Convert Christianity to Communism – Obama’s infatuation with the Muslim Brotherhood terrorist organization.\n There was no applause. A chilling fear quietly rose like an ominous cloud above every attendee at the conference. Every American in that room knew that everything Lamm enumerated was proceeding methodically, quietly, darkly, yet pervasively across the United States today. Discussion is being suppressed.\nOver 100 languages are ripping the foundation of our educational system and national cohesiveness . Even barbaric cultures that practice female genital mutilation are growing as we celebrate ‘diversity.’ American jobs are vanishing into the Third World as corporations create a Third World in America – take note of California and other states – to date, ten million illegal aliens and growing fast.\n It is reminiscent of George Orwell’s book “1984.” In that story, three slogans are engraved in the Ministry of Truth building: “War is peace,” “Freedom is slavery,” and\n ”Ignorance is s trength.”\n Governor Lamm walked back to his seat. It dawned on everyone at the conference that our nation and the future of this great democracy is deeply in trouble and worsening fast.\nIf we don’t get this immigration monster stopped within three years, it will rage like a California wildfire and destroy everything in its path especially The American Dream. If you care for and love our country as I do, take the time to pass this on just as I did for you.\n NOTHING is exactly what will happen if you don’t!\nPlease share with a friend or three.\nThank you Backpack – Janorama and the Magnified View Team.", "external_links": ["http://www.magnifiedview.com/wp-content/uploads/2012/09/Take-Away-Sign-3-300x216.jpg", "http://www.magnifiedview.com/wp-content/uploads/2014/04/Cartoon-Obama-Guns-300x232.jpg", "http://www.magnifiedview.com/wp-content/uploads/2013/03/Report-Card-1-300x221.png", "http://www.magnifiedview.com/wp-content/uploads/2013/03/Crimes-Committed-by-Illegal-Aliens.png", "http://www.magnifiedview.com/wp-content/uploads/2013/08/Predictions-2-Terrorism-Bullseye-On-Flag.jpg", "http://www.magnifiedview.com/wp-content/uploads/2015/04/Common-Core-Apple.jpg", "http://www.magnifiedview.com/wp-content/uploads/2014/06/Boston-Bombing-Map-300x204.jpg", "http://www.magnifiedview.com/wp-content/uploads/2013/01/Criminals-Gone-Wild-293x300.jpg", "http://www.magnifiedview.com/wp-content/uploads/2014/07/Illegal-Aliens-You-dont-need-papers-300x196.jpg", "http://www.magnifiedview.com/wp-content/uploads/2014/07/Illegal-Alien-Stop-Rally1-300x208.jpg", "http://www.magnifiedview.com/wp-content/uploads/2013/03/Predictions-2-Immigration-Path-To-Citizenship.jpg", "http://www.magnifiedview.com/wp-content/uploads/2015/09/Mexifornia-150x150.jpg", "http://www.magnifiedview.com/wp-content/uploads/2013/03/Predictions-2-Immigration-Employ-Americans.jpg", "http://www.magnifiedview.com/wp-content/uploads/2013/04/Gun-update-Part-5-Newsweek-Cover-229x300.jpg", "http://www.magnifiedview.com/wp-content/uploads/2014/06/Threat-Embassies-Closing-4.jpg"], "published": "2015-10-20T22:24:00.000+03:00", "crawled": "2015-10-21T00:58:30.187+03:00", "highlightTitle": ""}