{"organizations": ["OAP"], "uuid": "964be6817cf27804c17e1ce12e14af9b7b228e8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pistonheads.com", "main_image": "", "site_section": "http://pistonheads.com/gassing/rss_forum.asp?f=205&mid=0", "section_title": "News, Politics & Economics", "url": "http://www.pistonheads.com/gassing/topic.asp?t=1545931", "country": "IE", "title": "Cut old people's benefits, they'll die soon anyway", "performance_score": 0, "site": "pistonheads.com", "participants_count": 0, "title_full": "Cut old people's benefits, they'll die soon anyway", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:39:00.000+03:00", "replies_count": 0, "uuid": "964be6817cf27804c17e1ce12e14af9b7b228e8c"}, "author": "", "url": "http://www.pistonheads.com/gassing/topic.asp?t=1545931", "ord_in_thread": 0, "title": "Cut old people's benefits, they'll die soon anyway", "locations": ["Rottingdean", "Brighton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Derek Smith"], "text": "09:15 On top of that, my experience is that the old don't forget.The thing about the old is that they have a constant source of renewal. I'm not arguing whether bus passes and heating allowances are right or wrong, but there will always be pensioners, even if Wild get his wish fulfilled to kill them all off in cold weather, and they won't forget who took their concessions.I use my bus pass to get into Brighton because it is so anti-car. I wander in twice a month with my wife, around 11 ish. I go into Starbucks with my laptop and do a bit of writing. My wife goes off to give the debit card a bit of a bashing. We meet up after 90 mins and then go for a light lunch. About 30% of the crowd there are older than me. The vast majority of those who get on the bus show the yellow folder to the driver. In other words, old buggers like me bring money into the city, every day and at a time when only abscondees from the two universities bother the shopkeepers, and then mainly with a small latte that they get in a takeaway despite drinking in because it keeps warm longer. I normally buy a couple of drinks and a sticky bun. Without the yellow card I doubt I would bother to visit Brighton. Where I used to live there was what my wife and I called the 9.30 special, a bus that ran from Rottingdean into Brighton that contained the old biddies, about my age now, going into town to spend their hard earned pensions. It's a fair sized demographic and the high streets have customers during the day. As a member of the old biddies club now, I can see the benefits of the yellow card. It is a form of subsidy to the high street and to the bus companies. Take it away and they will require other funding to keep up the services and some shops will struggle. cirian75 said: That is what has me confused, so strange to been perceived as \"having a go\" usually loyal votersunless they are so confident of the majority that they have, and the crap pile Labour are in, that they feel the don't need the OAP vote to win the next election. which from what I see, is probably true. Not only that, but showing contempt for them is not a good idea either. The pensioner vote is massive. The threats to pensions and their income from labour is what makes most vote tory. The report of the death of the labour party may or may not be true. I've got doubts as it is the press suggesting it and they are mainly right of centre. However, centre politics is not dead. Never will be. A lurch to the right is not such a good idea. Edited by Derek Smith on Monday 5th October 09:19", "external_links": [], "published": "2015-10-05T17:39:00.000+03:00", "crawled": "2015-10-05T16:48:24.379+03:00", "highlightTitle": ""}