{"organizations": [], "uuid": "0a45f21760c4966c94493ee1d4160e2c25dcc578", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/02/df/90/491030500.JPG", "site_section": "http://www.palmbeachpost.com/s/floridanews/", "section_title": "Florida Politics and Legislative News | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/news/national/chick-fil-a-in-new-york-long-lines-quizzical-looks/nntpj/", "country": "US", "title": "Chick-fil-A in New York: Long lines, quizzical looks", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Chick-fil-A in New York: Long lines, quizzical looks | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T08:00:00.000+03:00", "replies_count": 0, "uuid": "0a45f21760c4966c94493ee1d4160e2c25dcc578"}, "author": "Leon Stafford", "url": "http://www.palmbeachpost.com/news/news/national/chick-fil-a-in-new-york-long-lines-quizzical-looks/nntpj/", "ord_in_thread": 0, "title": "Chick-fil-A in New York: Long lines, quizzical looks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — Chick-fil-A’s debut in the Big Apple on Saturday drew people willing to wait as long as 30 minutes in line, quizzical looks from others who didn’t get the hoopla over a fried chicken joint, and a protest from animal and gay rights activists.\n“It’s a monumental day,” an excited Jaimie Cranford, a New York transplant from South Carolina, said as she waited patiently in a line that snaked out the door and down the block. “It’s a little taste of home far away.”\nTina Fineberg SPECIAL TO THE ATLANTA JOURNAL CONSTITUTION- Lili Trenkova, left, and her wife Raffaella Ciavatta kiss outside the Chick-fil-A store in New York as they take part in a protest during the store's opening day Saturday Oct. 3, 2015. (AP Photo/Tina Fineberg) Mariah Reives, another transplant from North Carolina, agreed. “We didn’t even need a menu. I already knew what I wanted, a No. 1,” she said, referring to the chain’s classic fried chicken sandwich, waffle fries and a drink.\nThe opening had the feel of a festival, with fans taking selfies with a costumed mascot cow or talking frantically to friends on the phone about the opening. Tourists posed in front of the store at the corner of 6th Avenue and 37th Street.\nThose unfamiliar with chain were taken aback by sidewalks that were suddenly impassable.\nHIROKO MASUIKE Some of 1600 chicken sandwiches made to be given away in a promotion, at Chick-fil-A?s first location in New York, Sept. 23, 2015. Privately-held Chick-fil-A expects to post double-digit growth this year, but the chain remains unfamiliar to most in New York -- one of the toughest and unforgiving restaurant markets in the country. (Hiroko Masuike/The New York Times) “All this for fast-food,” one asked. “What’s a chick fill a?”\nNew York animal advocacy group Collectively Free began protesting in front of the store around 2 p.m., shouting “Chick-fil-A, take your store and go away.” The group of about 10 protesters, carrying pictures of animals such as pigs and chickens, tried to get into the store but were quickly ushered out by police hired to control crowds.\n>> Read more trending stories\nTina Fineberg SPECIAL TO THE ATLANTA JOURNAL CONSTITUTION- People read the menu as they wait on line outside the Chick-fil-A store in New York on the store's opening day Saturday Oct. 3, 2015. Signs indicating waiting times were posted at points along the sidewalk. (AP Photo/Tina Fineberg) Collectively Free accused the Atlanta-based chain of ignoring the rights of chickens and of hypocrisy over comments CEO Dan Cathy made three years ago opposing gay marriage.\n“They pick and choose how Christian to be,” Collective member Raffaella Ciavatta said as the group told customers that Jesus never said anything condemning homosexuality. As a protest, Ciavatta and her wife Lili Trenkova staged a kiss in front of the store before police put the group behind barricades.\nA counterprotester, preaching that homosexuality is a sin, battled for the crowd’s attention but declined to give his name or affiliation.\nPhotos: NYC lines up for Chick-fil-A opening Chick-fil-A spokeswoman Carrie Kurlander issued a statement, saying, “We are aware of the demonstrations. Grand opening day activities will continue as planned. We are excited about serving customers great food with remarkable service.”\nChick-fil-A opened the store in New York’s fashionable Garment District at 6 a.m. Saturday to business that grew exponentially throughout the day. What started out as 100 customers quickly grew into thousands, despite light rain, high winds and temperatures in the high 40s to low 50s.\nThe location, the first free-standing store in the city, is the chain’s biggest at three-stories and 5,000-square-feet. It’s the latest attempt by Chick-fil-A to broaden its reach from its traditional suburban stronghold to major cities such as Chicago and Boston. A location near Rockefeller Center also is in the works.\nAndrew Renneisen NEW YORK, NY - OCTOBER 2: New York Police Department officers have a meeting inside of Chick-Fil-A, a day before its opening, on 37th Street and 6th Avenue, on October 2, 2015 in New York City.. The fast food chicken restaurant is set to open its first store in Manhattan. (Photo by Andrew Renneisen/Getty Images) CEO Cathy has said if the transition to metropolitan stores works he wants to expand the chain internationally.\nThat was on no one’s mind in the line Saturday.\n“This is like a Southerner’s dream in New York,” Grayson Stadler, a New Yorker by way of Burlington, N.C., said as she waited.\nSome began lining up Friday afternoon to be among the first 100 in the store, who get a coveted meal a week free for 52 weeks. The promotion is so popular — attracting hundreds who camp out more than a day before new store openings — that Chick-fil-A has instituted a lottery to determine the winners.\nColin Smith, a transplant from Chesapeake, Va., spent the night in the store after the chain determined it was too cold and damp for fans to camp on the street.\n“It’s about time they’re getting one here,” said the longtime Chick-fil-A fan said as he huddled close to the store’s overhang to avoid the steady fall of light rain. “It’s so cold, but it’s worth it.”\nNative New Yorker Ian Sinovoi, 30, was introduced to the brand on family trips South when he was a teenager, but never got to try the chain’s famous biscuits or sweet tea on a regular basis. That changed Saturday.\n“I’m 10 blocks away, so that’s walkable for me,” said Sinovoi, who was third in line early Saturday morning.\nTrending on Facebook\nHusband weeps when he finds out wife is pregnant after 17 years of trying Body of teen missing since 2008 found in chimney Meet the teacher who made headlines walking his students home daily Hero Army vet Chris Mintz charges at Oregon gunman, shot trying to save classmates Why you're probably washing your clothes wrong More popular and trending stories\n</p", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/275/img/photos/2015/10/03/e3/72/100415_NYC_Chick_fil_a_reax_TF03.JPG", "http://www.ajc.com/gallery/business/nyc-lines-up-for-chick-fil-a/gCXLk/", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/02/33/8f/NY_CHICK_FIL_A_3.JPG", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/03/32/79/100415_NYC_Chick_fil_a_reax_TF15.JPG", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/03/32/1a/100415_NYC_Chick_fil_a_reax_TF08.JPG", "https://www.facebook.com/CMGNationalNews", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/10/02/2b/0f/491030508.JPG"], "published": "2015-10-05T08:00:00.000+03:00", "crawled": "2015-10-05T07:54:23.464+03:00", "highlightTitle": ""}