{"organizations": ["GOP"], "uuid": "43bd6bb8144423ef525d0d34c36b71301f039edc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.local10.com", "main_image": "http://www.local10.com/image/view/-/35976016/highRes/2/-/maxh/640/maxw/640/-/6xaq7gz/-/Bush-at-Hispanic-event-jpg.jpg", "site_section": "http://www.local10.com/Local-10-Mobile/16491990?format=rss_2.0&view=feed", "section_title": "Politics", "url": "http://www.local10.com/news/politics/jeb-bush-marvels-at-superhero-question/35975440", "country": "US", "title": "Jeb Bush: Supergirl is 'pretty hot'", "performance_score": 0, "site": "local10.com", "participants_count": 0, "title_full": "Jeb Bush: Supergirl is 'pretty hot'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T13:45:00.000+03:00", "replies_count": 0, "uuid": "43bd6bb8144423ef525d0d34c36b71301f039edc"}, "author": "", "url": "http://www.local10.com/news/politics/jeb-bush-marvels-at-superhero-question/35975440", "ord_in_thread": 0, "title": "Jeb Bush: Supergirl is 'pretty hot'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Clinton", "Jeb Bush"], "text": "Clinton sent GOP 2016ers copies of... \n\"I like watching the movies. I wish I owned Marvel, as someone that believes in capitalism,\" Bush said, speaking at the Libre Forum in North Las Vegas. \n\"I don't know, I'm kinda old school,\" he continued. \"I like the old school guys like Batman, a little dark these days.\" \nBut then he kept going, saying that he saw an ad for the new CBS show \"Supergirl\" featuring former \"Glee\" actress Melissa Benoist. \n\"I saw it when I was working out this morning,\" he said. \"She looked kinda ... she looked pretty hot. I don't know which channel it's on, but I'm looking forward to that.\" \nHe paused, letting the audience laugh, then added: \"That'll make news.\" \nSupergirl, it should be noted, is a character from Marvel's rival comic universe DC, as is Batman. \nReaching out to Hispanics \nIt was a moment of levity for the audience after listening to Bush talk about his plans to grow the economy and tackle complicated issues such as immigration, the debt, and foreign relations with Latin America. \nThe forum was sponsored by the Libre Initiative, an effort backed by David and Charles Koch and aimed to lure more Hispanics into the Republican column by promoting conservative principles. The group has previously held forums with Republican presidential candidates Marco Rubio and Rand Paul. \nBush opened up the event speaking in Spanish about how he studied Latin American affairs at the University of Texas. Then he switched to English to add: \"I had a Latin American affair. It was with my wife, Columba.\" \nHe highlighted his experiences living in Venezuela and Miami, as well as the bicultural family he started with his Mexican wife, to demonstrate his appeal to Hispanic voters. \nThough he has faced criticism from Donald Trump for speaking Spanish on the campaign trail, Bush has embraced his ties to the Hispanic community. It's an aspect of his campaign that he hopes will boost his electability and convince primary voters that he can win in a general election. \nDuring the \"Supergirl\" moment at the end, Daniel Graza, the group's executive director and a former member of the George W. Bush administration, was moderating the discussion and tried to move on to the next question as the audience was laughing. \nBut he kept laughing himself. \"I'm trying to move quickly,\" he said. \n\"Yeah you want to get me out of my hole I just dug?\" Bush joked. \n ", "external_links": [], "published": "2015-10-22T13:45:00.000+03:00", "crawled": "2015-10-22T15:01:31.043+03:00", "highlightTitle": ""}