{"organizations": [], "uuid": "f18c8ae46b094621df35166f929ac57ce6c71104", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "article.wn.com", "main_image": "http://i.ytimg.com/vi/dIxcMMwiVTA/0.jpg", "site_section": "http://rss.wn.com/English/keyword/politics", "section_title": "WN.com - Politics News", "url": "http://article.wn.com/view/2015/10/08/Topic_Consultation_on_Scotland_s_Census_2021_National_Record/", "country": "GB", "title": "Topic Consultation on Scotland’s Census 2021 (National Records of Scotland)", "performance_score": 0, "site": "wn.com", "participants_count": 1, "title_full": "Topic Consultation on Scotland’s Census 2021 (National Records of Scotland) - Worldnews.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "f18c8ae46b094621df35166f929ac57ce6c71104"}, "author": "wn.com", "url": "http://article.wn.com/view/2015/10/08/Topic_Consultation_on_Scotland_s_Census_2021_National_Record/", "ord_in_thread": 0, "title": "Topic Consultation on Scotland’s Census 2021 (National Records of Scotland)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Source: National Records of Scotland) National Records of Scotland seeks first views on Scotland's next census Planning for Scotland's Census 2021 starts today with the National Records of Scotland (NRS) asking for views on the topic areas that should be included. A consultation being launched today on the Scotland's Census website focuses on the broad topics the census will cover. The aim is to encourage discussion and help NRS build a strong case for the inclusion of new topics in the census. Discussion around particular questions or responses will be made through a programme of further consultation, research and testing that will involve the public and service users. This is the start of engagement that will take place between now and 2021 as NRS prepares for what will again be Scotland's largest survey of the population. The plans for this programme are currently being developed and will be published on Scotland's Census website in due course. In launching the consultation, Tim Ellis, the Registrar General for Scotland, said: 'We have run our own census in Scotland since 1861, and it has provided us with important insights into who we are, how we work, and how we have lived in Scotland over the last 150 years. Decisions are taken every day using census statistics, helping to plan and provide services the length and breadth of Scotland, and from the cradle to the grave. By law it must be completed by everyone in Scotland. So it is important that what we ask is what the people of Scotland need - and that we only ask what is really needed. 'Although 2021 may seem a long time away, we need to start working towards this now and NRS needs to hear from all users to get their view on the important topics that Scotland's Census in 2021 should ask about. 'This is the chance to get involved in shaping what we will ask everyone in Scotland in 2021.' Fiona Hyslop, Cabinet Secretary for Culture, Europe and External Affairs, said: 'Our government has always been clear how much we value high quality, independent evidence such as that delivered by the census. The uniqueness of the census is that it is the only survey to ask everyone in Scotland the same questions at the same time. Nothing else provides the richness and range of information that the census does to allow us to understand the issues and challenges faced on a national and local level. 'I welcome the consultation and encourage as many people as possible to take part and help define the broad topics which people think the census in 2021 should cover.' The consultation will build on the success of the census in 2011. The 2021 Census will be the 22nd to be taken in Scotland and will be designed and managed to best meet the needs of Scotland's Census users. distributed by This content was issued by National Records of Scotland on the 2015-10-08 and was initially posted on www.nrscotland.gov.uk. It was distributed, unedited and unaltered, by noodls on 2015-10-08 10:49:16 UTC. The original issuer is solely responsible for the accuracy of the information contained therein. (noodl: 30236117)", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:52:16.516+03:00", "highlightTitle": ""}