{"organizations": [], "uuid": "c67b3e9fbfc482d6e3c74fdbab09e74d77533fc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00331/big-businesses-save-costs-and-carbon.htm", "country": "US", "title": "Big businesses save costs and carbon", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Big businesses save costs and carbon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T06:06:00.000+03:00", "replies_count": 0, "uuid": "c67b3e9fbfc482d6e3c74fdbab09e74d77533fc0"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00331/big-businesses-save-costs-and-carbon.htm", "ord_in_thread": 0, "title": "Big businesses save costs and carbon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Big businesses save costs and carbon   4:06 pm Press Release: EECA \nBig businesses save costs and carbon \nImproved efficiency has helped some of New Zealand’s biggest energy-users slice a chunk off their energy bills, saving millions of dollars and thousands of tonnes of carbon. \nThe Energy Efficiency and Conservation Authority (EECA) says businesses saved 25,000 tonnes of CO2 and an estimated $12 million a year under its business programmes in its annual report for the 2014/15 financial year. \nEECA is a government agency that works closely with businesses to develop more efficient, competitive and lower-carbon businesses, as well as promoting energy efficiency in the residential and transport sectors. Its work with business focuses on New Zealand’s largest energy-users, which collectively consume 70 percent of non-transport energy in the sector. \nThirty-eight businesses – representing nearly a third of all New Zealand businesses energy use – signed long-term energy management partnerships with EECA during the last financial year. “Once these programmes have been implemented, we will potentially see combined annual energy savings of around $14 million and 30,000 tonnes of CO2 a year,” says Chief Executive Mike Underhill. \nBusinesses leading the charge with new agreements include Fonterra, Alliance Meats, Waterfront Auckland, insurance company IAG and Orora Packaging. \nIn addition, two programmes in the business sector identified significant opportunities to further reduce CO2 emissions. One, called Lower Carbon Meat and Dairy, aims to reduce the coal and gas energy used by the industry in processing. The other, Wood Energy South, helps Southland businesses switch their heating sources from fossil fuels to wood. “We’ve identified some exciting opportunities with both these projects and will work towards getting the best out of them in the coming year,” says Mr Underhill. \nThe business sector in New Zealand spends $8.4 billion a year on energy. Energy use by businesses (excluding transport) accounts for about 50 percent of New Zealand’s total energy use, and more than 40 percent of New Zealand’s energy-related CO2 emissions. \nInformation about EECA’s business, residential and transport programmes is published today in its Annual Report 2014/15. See www.eeca.govt.nz/assets/Resources-EECA/eeca-annual-report-2014-15.pdf \nHighlights from the EECA residential progamme: \n• 281,000 homes have been insulated under EECA’s Warm Up New Zealand programmes since 2009, including 21,500 homes in 2014/15 \n• 40,000 low-income, high health need homes have been insulated under the Warm Up New Zealand: Healthy Homes programme, a third of which were rental properties \n• The overall market share of ENERGY STAR qualified products (those with superior energy efficiency) has increased to 41%. \nENDS", "external_links": [], "published": "2015-10-20T06:06:00.000+03:00", "crawled": "2015-10-20T06:09:45.118+03:00", "highlightTitle": ""}