{"organizations": [], "uuid": "a88d6786c8acf4b2cb2dc22b58eaf9bd06d87cfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30294770/med-services-europe-launches-innovative-wheelchair-tire-cover", "country": "US", "title": "Med Services Europe Launches Innovative Wheelchair Tire Cover", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Med Services Europe Launches Innovative Wheelchair Tire Cover - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "a88d6786c8acf4b2cb2dc22b58eaf9bd06d87cfb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30294770/med-services-europe-launches-innovative-wheelchair-tire-cover", "ord_in_thread": 0, "title": "Med Services Europe Launches Innovative Wheelchair Tire Cover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Med Services Europe\nVILNIUS, Lithuania , October 19, 2015 /PRNewswire/ --\nWheelchair caster tire cover invention solves nasty problem for wheelchair users\nAn innovative product has been launched which solves a problem long faced by wheelchair users: how to prevent wheelchair tires from damaging or dirtying floors and carpets.\nMed Services Europe, a company based in Vilnius, Lithuania , has supplied wheelchair rear wheel covers, known as RehaDesign Wheelchair Slippers, for a decade. But until now, there have not been covers available for the small caster wheels at the front of the wheelchair, meaning that even while using Wheelchair Slippers on the rear tires, the front tires still leave difficult-to-clean dirt and marks on floors.\nThe risk that this problem presents to wheelchair users can be serious. Wheelchairs often roll through debris and animal droppings which can become embedded between the treads of the tire and be extremely difficult to remove. The wheelchair user then faces the daunting problem of how to prevent the filth and germs from spreading in the house. Brooklyn, New York Senator Marty Golden addressed this problem for people with disabilities in a press release from January 23, 2013 , in which he \"Urge(d) People to Pick Up After Their Dog\" http://www.nysenate.gov/press-release/disabled-resident-and-family-ask-senator-golden-urge-people-pick-after-their-dog\nCommenting on his latest RehaDesign invention, Dr Emmer said, \"For years, wheelchair users have asked about covers for caster wheels. I always said it was impossible due to the way that the caster is mounted and the small clearance between the caster wheel and the fork. But then I received an letter from a disappointed customer who wrote \"We are an Asian household with strict no shoe-wearing indoors. Unfortunately we will not be able to use the wheelchair both indoors and outdoors, now that we realize the tire covers only protect the larger wheels.\" This letter got me to rethink the problem. That night, the answer came to me. I got up and sketched out a design. After a few modifications, RehaDesign Wheelchair Socks were born.\"\nLike RehaDesign's Wheelchair Slippers, RehaDesign Wheelchair Socks feature a special inner lining that grips to the wheels and prevents slippage. Also, both Wheelchair Slippers and Wheelchair Socks can be attached to the wheels in seconds.\nWhen asked about the inspiration behind the names Wheelchair Slippers and Wheelchair Socks , Dr Emmer said: \"When people who don't use wheelchairs come home, they may change into slippers or socks to avoid bringing outside dirt into the house and damaging floors and carpets. Now wheelchair users can put on Wheelchair Slippers and Wheelchair Socks and accomplish the same thing.\"\nRehaDesign has also published videos demonstrating how to mount Wheelchair Socks on Youtube: https://www.youtube.com/watch?v=LtVDMaCUYMk\nAbout RehaDesign:\nRehaDesign is the brand name of a range of innovative wheelchair accessories distributed by Med Services Europe, a company based in Vilnius, Lithuania . RehaDesign Wheelchair Accessories are sold on the http://www.RehaDesign.com website, Amazon USA and Europe , as well as by a network of disability retailers around the world. Disability retailers interested in joining the RehaDesign Network are encouraged to contact Dr. Emmer for more information.\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201510193149&Transmission_Id=201510191100PR_NEWS_USPR_____enUK201510193149&DateId=20151019", "http://www.youtube.com/watch?v=LtVDMaCUYMk", "http://www.xmlnews.org/ns/", "http://www.nysenate.gov/press-release/disabled-resident-and-family-ask-senator-golden-urge-people-pick-after-their-dog"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T18:42:07.071+03:00", "highlightTitle": ""}