{"organizations": [], "uuid": "0bd6af7501df3842a3f2ab906dfd9dd32af4e73b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30325980/pepsico-and-frito-lay-mobilize-massive-volunteer-manpower-in-united-way-day-of-caring-event", "country": "US", "title": "PepsiCo and Frito-Lay mobilize Massive volunteer Manpower in United Way 'Day of Caring' Event", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "PepsiCo and Frito-Lay mobilize Massive volunteer Manpower in United Way 'Day of Caring' Event - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "0bd6af7501df3842a3f2ab906dfd9dd32af4e73b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30325980/pepsico-and-frito-lay-mobilize-massive-volunteer-manpower-in-united-way-day-of-caring-event", "ord_in_thread": 0, "title": "PepsiCo and Frito-Lay mobilize Massive volunteer Manpower in United Way 'Day of Caring' Event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Frito-Lay\nMore than 1,250 Employees to Contribute 5,000 Collective Volunteer Hours to Local Non-Profits\nDALLAS , Oct. 22, 2015 /PRNewswire/ -- Frito-Lay and other PepsiCo employees from offices throughout the Dallas/Fort-Worth Metroplex today will take part in the sixth annual PepsiCo United Way Day of Caring. In what stands as the largest corporate United Way Day of Caring event in North Texas , an estimated 1,250 Frito-Lay and PepsiCo volunteers will contribute approximately 5,000 hours of their time to 20 United Way service providers to help North Texans in need.\nVolunteers will blanket the area, working to paint and repair facilities, sort donations, and host fall festivals for children. All projects align with United Way's key focus areas of Education, Financial Stability, and Health. Over the past six years, Frito-Lay and other PepsiCo associates have contributed an estimated 29,000 volunteer hours to area non-profits through PepsiCo Day of Caring events .\n\"The PepsiCo United Way Day of Caring is a great opportunity for our associates to get out and volunteer in the community,\" said Chris Kuechenmeister , vice president communications, PepsiCo. \"The wide range of projects and volunteer opportunities allow our associates to truly make an impact and experience firsthand life-changing connections with the clients who benefit from United Way programs.\"\nPepsiCo and its Frito-Lay division have a long history of supporting United Way of Metropolitan Dallas. Each fall, Frito-Lay and other DFW-based PepsiCo associates participate in a fundraising campaign to show their commitment to the community, investing more than $39 million in United Way programs over the last 15 years. Support will help United Way reach its 10-year community goals: preparing at least 60 percent of kids to graduate ready to succeed, moving 250,000 people out of poverty permanently, and improving health across the region.\n\"We are incredibly grateful for PepsiCo's longstanding and generous support of United Way,\" said Jennifer Sampson , United Way of Metropolitan Dallas president and CEO. \"By giving their time, resources and collective heart power, employees are changing lives in North Texas forever, offering opportunity and secure futures for all who live and work here.\"\nVolunteers will support the following local organizations during this year's PepsiCo United Way Day of Caring event:\nCollin County Children's Advocacy Center Caldwell Elementary School ChildCareGroup Children's Health Dallas Furniture Bank Goodwill Industries Healthy Zone School- Hexter Elementary School Healthy Zone School – Kramer Elementary School Healthy Zone School- Price Elementary Healthy Zone School- Robert T. Hill MS Jubilee Park and Community Center Mesquite Social Services Mi Escuelita Mosaic Family Services Nexus Recovery Center Pedi Place REAL School Gardens- Lorenzo De Zavala Elementary School The Salvation Army The Family Place The Samaritan Inn The Senior Source Trinity River Mission Vogel Alcove About United Way of Metropolitan Dallas: United Way of Metropolitan Dallas brings people together to improve lives and create lasting change here in North Texas by focusing on education, income, and health -- the building blocks for strong families and thriving communities. We galvanize and connect all sectors of society – individuals, businesses, non-profits, and government – to create long-term change through investing in solutions that produce healthy, well-educated and financially stable individuals and families. We raise, invest and leverage over $50M annually in community-focused solutions serving Dallas , Collin , Rockwall and southern Denton counties. We do more than help one person beat the odds – we are changing the odds for entire communities. Together, we UNITE FOREVER. To learn more, please visit UnitedWayDallas.org .\nAbout PepsiCo: PepsiCo products are enjoyed by consumers one billion times a day in more than 200 countries and territories around the world. PepsiCo generated more than $66 billion in net revenue in 2014, driven by a complementary food and beverage portfolio that includes Frito-Lay, Gatorade, Pepsi-Cola, Quaker, and Tropicana. PepsiCo's product portfolio includes a wide range of enjoyable foods and beverages, including 22 brands that generate more than $1 billion each in estimated annual retail sales.\nAt the heart of PepsiCo is Performance with Purpose-our goal to deliver top-tier financial performance while creating sustainable growth and shareholder value. In practice, Performance with Purpose means providing a wide range of foods and beverages from treats to healthy eats; finding innovative ways to minimize our impact on the environment and reduce our operating costs; providing a safe and inclusive workplace for our employees globally; and respecting, supporting, and investing in the local communities where we operate. For more information, visit www.pepsico.com .\nFollow PepsiCo:\nTwitter (@PepsiCo) Facebook PepsiCo Press Releases PepsiCo Multimedia PepsiCo Videos To view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/pepsico-and-frito-lay-mobilize-massive-volunteer-manpower-in-united-way-day-of-caring-event-300164709.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://multimedia.pepsico.com/", "http://www.pepsico.com/", "http://twitter.com/pepsico", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY34658&Transmission_Id=201510221028PR_NEWS_USPR_____NY34658&DateId=20151022", "http://www.pepsico.com/media.html", "http://www.youtube.com/user/PepsiCoVideo", "http://unitedwaydallas.org/", "http://www.prnewswire.com/news-releases/pepsico-and-frito-lay-mobilize-massive-volunteer-manpower-in-united-way-day-of-caring-event-300164709.html", "http://www.facebook.com/pepsico"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T19:31:21.850+03:00", "highlightTitle": ""}