{"organizations": [], "uuid": "7e9a221cb9307e0c7f9c680c185e860778b2aa04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30330726/thurgood-marshall-college-fund-to-honor-cia-director-john-o-brennan-at-its-27th-annual-awards-gala", "country": "US", "title": "Thurgood Marshall College Fund to Honor CIA Director John O. Brennan at its 27th Annual Awards Gala", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Thurgood Marshall College Fund to Honor CIA Director John O. Brennan at its 27th Annual Awards Gala - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e9a221cb9307e0c7f9c680c185e860778b2aa04"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30330726/thurgood-marshall-college-fund-to-honor-cia-director-john-o-brennan-at-its-27th-annual-awards-gala", "ord_in_thread": 0, "title": "Thurgood Marshall College Fund to Honor CIA Director John O. Brennan at its 27th Annual Awards Gala", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Thurgood Marshall College Fund\nDaymond John, Samuel R. Allen, Dr. David Hall, and Thomas A. Cole Also to be Honored\nWASHINGTON , Oct. 22, 2015 /PRNewswire-USNewswire/ -- With over 1,500 of the nation's Who's Who in attendance, John O. Brennan , Central Intelligence Agency Director, will be honored with the National Hero Award at the Thurgood Marshall College Fund's (TMCF) 27th Annual Awards Gala on November 16, 2015 in Washington, DC at the historic Washington Hilton.\nOne year after his 2013 swearing in as Director of the Central Intelligence Agency, Brennan commissioned a comprehensive study, known as the Diversity in Leadership Study (DLS), to examine factors limiting diversity in senior leadership positions across the CIA. The DLS, lead by Vernon Jordan, Jr. , revealed cultural, management, and organizational issues that contributed to a lack of diversity in the Agency's leadership – for which Brennan courageously made public.\nBrennan, as the top official at the CIA, oversees intelligence collection, analysis, covert action, counterintelligence, and liaison relationships with foreign intelligence services. Prior to becoming CIA Director, Brennan served at the White House for four years as Assistant to the President for Homeland Security and Counterterrorism, advising the President on counterterrorism strategy and helped coordinate the US Government's approach to homeland security, including its policies for responding to terrorism, cyber attacks, natural disasters, and pandemics.\nAlongside Brennan, four other distinguished leaders will also be honored at TMCF's premier black-tie event to include Samuel R. Allen , Chairman and Chief Executive Officer of Deere & Company ; Dr. David Hall , President of the University of the Virgin Islands ; Daymond John , Shark on ABC's Emmy Award winning series, Shark Tank, and Founder of FUBU ; and, Thomas A. Cole , Partner and Former Chair of the Executive Committee of Sidley Austin LLP. Allen will receive the CEO of the Year Award; Hall will receive the Educational Leadership Award; John will receive the Breaking Barriers Award; and, Cole will receive the 'inaugural' Thurgood Marshall Legacy Award.\n\"Mr. Brennan's decades of public service and exemplary professional track record demonstrate the bravery and leadership qualities we instill in our scholars every day,\" said TMCF President & CEO Johnny C. Taylor, Jr. \"This year's Gala promises to be an amazing evening as we honor some of our country's foremost visionaries who have used their status to exhibit courage, support education and positively impact the lives of students attending Historically Black Colleges and Universities (HBCUs). We are proud to celebrate their life span of accomplishments.\"\nThemed \"Developing Minds ... Delivering Dreams\", the annual Gala will attract thousands of philanthropists, elected officials, and socialites from around the country. Proceeds from the event enable TMCF to continue its programmatic and capacity building work for the nation's HBCUs and the 300,000 students who attend these great institutions. Last year's Gala raised over $4.1 million and this year's goal is set at $5 million .\n\"Today, more and more HBCU students depend on TMCF to help them make their college dreams become a reality,\" continued Taylor. \"We rely on events like our Gala to raise the critical funds needed to continue meeting the needs of these students who are depending on us.\"\nTables and Seats for the Gala are still available. For more information about TMCF, the Gala or this year's honorees, please visit TMCF's website .\nNOTE: Members of the working press, who wish to cover this event, must obtain press credentials. To obtain credentials, contact Tangie Newborn at tangie.newborn@tmcf.org .\nABOUT THE THURGOOD MARSHALL COLLEGE FUND (TMCF)\nTMCF is named for the U.S. Supreme Court's first African-American Justice. Established in 1987, TMCF supports and represents nearly 300,000 students attending its 47 member-schools that include publicly supported Historically Black Colleges and Universities (HBCUs), medical schools and law schools. Through its scholarships and programs, TMCF plays a key role in preparing the leaders of tomorrow. For more information on TMCF, visit us at tmcf.org.\nPhoto - http://photos.prnewswire.com/prnh/20151022/279834\n releases/thurgood-marshall-college-fund-to-honor-cia-director-john-o-brennan-at-its-27th-annual-awards-gala-300165247.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/thurgood-marshall-college-fund-to-honor-cia-director-john-o-brennan-at-its-27th-annual-awards-gala-300165247.html", "http://10.86.178.43:2011/Users/Tangie/Documents/TMCF/Backup%2010-14/TMCF/TMCF%202015/Gala%20&%20LI/tmcf.org", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC36588&Transmission_Id=201510221951PR_NEWS_USPR_____DC36588&DateId=20151022", "https://photos.prnewswire.com/prnvar/20151022/279834", "http://photos.prnewswire.com/prnh/20151022/279834"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T03:24:21.379+03:00", "highlightTitle": ""}