{"organizations": [], "uuid": "e49551a6d6853f26fbfc865d12bc9cb026839616", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://tse3.mm.bing.net/th?id=OIP.M566c7627cff4f1b6f1e66c979403af4bo1&pid=15.1&P=0&w=300&h=300", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/breaking-us-arming-hezbollah-with-state-of-the-art-missiles-3063082.html", "country": "US", "title": "Breaking - US Arming Hezbollah With State-Of-The-Art Missiles | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Breaking - US Arming Hezbollah With State-Of-The-Art Missiles | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:33:00.000+03:00", "replies_count": 0, "uuid": "e49551a6d6853f26fbfc865d12bc9cb026839616"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/breaking-us-arming-hezbollah-with-state-of-the-art-missiles-3063082.html", "ord_in_thread": 0, "title": "Breaking - US Arming Hezbollah With State-Of-The-Art Missiles | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nThe U.S. delivered part of an $8.6 million military aid package to Lebanon today including laser-guided artillery shells and Hellfire air-to-surface missiles. This amounts to a doubling of military aid to Lebanon.\nThe story from the Obama Administration is that these munitions are to help Lebanon's military defend the country’s eastern border from what the State Department referred to as “violent extremists.”\nJust one thing…speaking of violent extremists, there's a peculiar thing about Lebanon's Army. Like the rest of Lebanon's military, it is now totally integrated with Hezbollah . And it has been for years.\nThe armaments the Obama Administration is giving Lebanon will thus be freely available to Hezbollah and used against Israel when the time comes.That's why the Israelis made a formal announcement that if they were attacked from Lebanon again, unlike the last time they would consider it an attack on Israel by Lebanon, not just Hezbollah.\nAnd it even gets worse than that.\nThose extremists the Obama Administration is blathering about?A reasonable person might think that would include Jaish al-Fatah, the Army of Conquest. These are the so-called 'moderates' funded, armed and trained by President Obama in conjunction with Turkey, Qatar and the Saudis. Jaish al-Fatah is primarily composed of 'moderates' like Ahrar ash-Sham, an officially designated terrorist group and the al-Qaeda offshoot al-Nusrah .And they're right on Lebanon's border in Idlib province.\nThese are the same wonderful folks the Obama administration is complaining about Vladimir Putin conducting air strikes on:\n“Greater than 90 percent of the strikes that we’ve seen them take to date have not been against ISIL or al Qaeda-affiliated terrorists,” said State Department spokesman John Kirby. “They’ve been largely against opposition groups that want a better future for Syria and don’t want to see the Assad regime stay in power.\nAl-Nusrah isn't affiliated with al-Qaedah? That's certainly not what they say. Read up on al-Nusrah and Ahrar ash-Sham. You'll quickly find out what kind of future these hard line Islamists want for Syria, and their differences with ISIS could basically be summed up by the phrase 'Who's going to be king of the mountain ?'\nThis is material aid to terrorism, something that is clearly against U.S. law except when President Obama does it. Even more, we're aiding both sides in this conflict who, whatever their differences hate us and have plenty of American blood on their hands.\nAt least Russia's Vladimir Putin seems to know whose side he's on. And he seems to be actually taking on those 'Sunni extremists' and 'al-Qada affiliated terrorists' John Kirby was talking about.\nAs for me, I have to confess something. When my tax dollars are going to a government that funds groups that would happily murder me and my family let alone my friends in Israel, it is definitely food for thought.\nhttp://s7.addthis.com/static/btn/v2/lg-bookmark-en.gif", "external_links": ["http://joshuapundit.blogspot.com/2011/03/hillary-clinton-shilling-for-us.html", "http://www.timesofisrael.com/us-delivers-missiles-to-lebanon-to-defend-syria-border/", "http://s7.addthis.com/static/btn/v2/lg-bookmark-en.gif", "http://syrianobserver.com/EN/News/29643/Army_Conquest_Recaptures_Villages_Near_Assad_Coastal_Heartland", "http://tse3.mm.bing.net/th?id=OIP.M566c7627cff4f1b6f1e66c979403af4bo1&#038;pid=15.1&#038;P=0&#038;w=300&#038;h=300"], "published": "2015-10-09T22:33:00.000+03:00", "crawled": "2015-10-10T02:00:15.380+03:00", "highlightTitle": ""}