{"organizations": [], "uuid": "eb25f0c8a33e141558be328d1d767b465de3b23f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.co.uk", "main_image": "http://i.huffpost.com/gen/3547142/images/o-NIGEL-FARAGE-GUN-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/uk-politics/index.xml", "section_title": "UK Politics - The Huffington Post", "url": "http://www.huffingtonpost.co.uk/2015/10/16/nigel-farage-lbc-gun-control_n_8310938.html", "country": "US", "title": "Nigel Farage Blasts Britain's Gun Control Laws As 'Repressive'", "performance_score": 0, "site": "huffingtonpost.co.uk", "participants_count": 1, "title_full": "Nigel Farage Blasts Britain's Gun Control Laws As 'Repressive'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T14:16:00.000+03:00", "replies_count": 0, "uuid": "eb25f0c8a33e141558be328d1d767b465de3b23f"}, "author": "Aubrey Allegretti", "url": "http://www.huffingtonpost.co.uk/2015/10/16/nigel-farage-lbc-gun-control_n_8310938.html", "ord_in_thread": 0, "title": "Nigel Farage Blasts Britain's Gun Control Laws As 'Repressive'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigel Farage Blasts Britain's Gun Control Laws As 'Repressive' The Huffington Post UK | By Aubrey Allegretti Updated: 4 minutes ago Ukip leader Nigel Farage looks at items being made in the wood craft room as he meets veterans and staff during a visit to the Futures for Heroes centre near Sandwich in Kent as he continues his campaign for the South Thanet seat at the General Election. | Gareth Fuller/PA Archive reddit \nUkip leader Nigel Farage has hit out at Britain's \"repressive\" gun laws, rubbishing restrictions on firearm rights as \"knee-jerk\". \nThe MEP, speaking today on LBC’s Nick Ferrari phone-in, hailed calls for a crackdown on weapons ownership in the United States but lamented his own country's ban. \nIn a move likely to fray relationships with the pro-Second Amendment 'Conservative Political Action Conference', Farage poured praise on Barack Obama for the American President's attempts to curb gun violence. \n\"I have to say, I think the USA gun laws are insane and I do actually think on this, Obama does actually makes quite a lot of sense,\" he told listeners this morning. \n\"The idea you don't have to prove who you are or have some basic background check before buying a 20-round repeating rifle strikes me as quite extraordinary.\" \nBut, addressing a question from caller 'David' from Guildford, the Ukip leader gave British law-makers a dressing-down, insisting that in spite of the \"appalling events\" of the 1996 Dunblane massacre that prompted significantly tighter restrictions being imposed on gun ownership, \"we have probably knee-jerked\". \n\"What happened at Dunblane was absolutely appalling, and as a result of that we have brought in the most repressive gun laws anywhere in the world,\" he mused. \nThen, in a marked departure from his often 'honest politician' manner, Farage side-stepped revealing his opinion on what Britain should do to relax gun control laws. \n\"It's very difficult to have this debate, David,\" he said. \"Because if I was to say to you that I thought that hand guns were fine if they were held by gun clubs, on those premises, on very very strict circumstances and that it would be more sensible for the British Olympic team to be able to practise in those circumstances, rather than have to go to Calais, I'd be condemned after this programme as being pro-handguns. \n\"So I'll leave leave that suggestion with you, that it may an argument one could make. I'm not going to make it myself, I just can't afford the aggro. \nEmails leaked from the Ukip leader's office in 2013 also linked an increase in gun ownership with a decrease in firearms-related crime , slammed by MPs and campaigners as \"inaccurate, unsubstantiated and upsetting drivel\". READ MORE:", "external_links": [], "published": "2015-10-16T14:16:00.000+03:00", "crawled": "2015-10-16T15:21:04.605+03:00", "highlightTitle": ""}