{"organizations": ["TSA", "FDA", "Northeast Fisheries Science Center", "NOAA", "National Oceanic and Atmospheric Administration"], "uuid": "99507ae00e4cac099ea891ea053c860a9eb2c1d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fosters.com", "main_image": "http://www.fosters.com/Global/images/head/nameplate/fosters_logo.png", "site_section": "http://www.fosters.com/news/politics-elections?template=rss&mime=xml", "section_title": "Politics & Elections - fosters.com", "url": "http://www.fosters.com/article/20151008/NEWS/151009371/14332?rssfeed=true", "country": "US", "title": "NOAA monitoring fee will kill fishing industry", "performance_score": 0, "site": "fosters.com", "participants_count": 0, "title_full": "NOAA monitoring fee will kill fishing industry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:23:00.000+03:00", "replies_count": 0, "uuid": "99507ae00e4cac099ea891ea053c860a9eb2c1d6"}, "author": "", "url": "http://www.fosters.com/article/20151008/NEWS/151009371/14332?rssfeed=true", "ord_in_thread": 0, "title": "NOAA monitoring fee will kill fishing industry", "locations": ["New Hampshire", "Hampton"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kelly Ayotte", "Teri Frady", "David Goethel", "Goethel"], "text": "NOAA monitoring fee will kill fishing industry fosters.com Posted Oct. 8, 2015 at 3:23 PM Updated at 3:23 PM Posted Oct. 8, 2015 at 3:23 PM Local fishermen say the looming cost of paying $700 per day for at-sea monitors could put them out of business by the end of the year. It's a threat that everyone should take seriously. “The day I really have to pay for this is the day I stop going fishing,” says David Goethel, a commercial fisherman from Hampton. Stringent federal catch limits have already crippled the 400-year-old fishing industry in New Hampshire to the point where there are now only nine active groundfishing boat operators. This additional expense, to make sure fishermen are following regulations put forward by the National Oceanic and Atmospheric Administration (NOAA), could be the final nail in the coffin. That's why we were pleased that last week NOAA delayed the downshifting of the costs to fishermen until Dec. 1. We urge NOAA and our congressional leaders to do what they can to ensure that the delay is permanent because it’s the right thing to do. NOAA has been footing the bill for the at-sea monitoring program for several years, and rightly so as it's the federal agency's responsibility to ensure that annual catch limits are not exceeded. At-sea monitors keep track of how vessels are meeting their groundfishing allocations set by NOAA to keep groundfish stocks like cod, haddock and flounder from being destroyed. NOAA's current rules state that at-sea monitoring costs were to be instituted in 2012. However, they have delayed implementation because of the \"continuing economic problems\" in the industry, according to Teri Frady, spokesperson for NOAA’s Northeast Fisheries Science Center. While the fishing industry is still in crisis, NOAA is now claiming it can't afford to foot the bill for the monitors. We find it hard, however, to believe that an agency with a billion dollar budget can't afford it. The real people who can’t afford it are the fishermen, who are already struggling to stay afloat due to the heavy regulations. The cost for at-sea monitors will likely be near $700 per day for each vessel, a figure based on what NOAA paid in fiscal year 2015. In an email to congressional staff, NOAA regulators admit the change would be “economically challenging” for many. Studies by NOAA show that as many as 60 percent of affected boats could be pushed out of profitability if they have to pay those fees. Sen. Kelly Ayotte was right to question whether this decision to downshift costs violates the law. By law, according to the National Standards of the Magnuson-Stevens Act, NOAA is directed to sustain both fish stocks and fishing communities. Forcing fishermen to pay for at-sea monitors may support sustainable fisheries but it will kill the local groundfishing industry. Hampton fishermen Goethel notes that other industries do not pay for their monitoring. \"The airlines do not pay for the TSA, agribusiness does not pay for meat inspection, and pharmaceutical companies do not pay for the FDA, to name a few,” Goethel said. “These are considered functions of government and so is catch monitoring.\" The bottom line is NOAA needs to continue to pay these costs. NOAA is the agency that developed these regulations and NOAA is the one that should pay to ensure they are being followed. We support our local fishermen and urge our congressional delegation to protect this profession that has influenced our region's identity for centuries. fosters.com", "external_links": [], "published": "2015-10-08T23:23:00.000+03:00", "crawled": "2015-10-09T04:16:07.083+03:00", "highlightTitle": ""}