{"organizations": [], "uuid": "faa6a4da980006fe06c9ff1b9fbe8daacb72006f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oximity.com", "main_image": "https://d3oilk4eevknv6.cloudfront.net/newsweb/mediatools/image/image/000/000/059/773_344x257_083253720_344x257.jpg", "site_section": "https://www.oximity.com/playlist/Human-Rights-Politics-13", "section_title": "Human Rights, Politics - Oximity", "url": "https://www.oximity.com/article/Kurdish-security-forces-unleash-wave-o-1", "country": "IE", "title": "Kurdish security forces unleash wave of terror on media", "performance_score": 0, "site": "oximity.com", "participants_count": 1, "title_full": "Kurdish security forces unleash wave of terror on media - Oximity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T16:59:00.000+03:00", "replies_count": 0, "uuid": "faa6a4da980006fe06c9ff1b9fbe8daacb72006f"}, "author": "Content Admin", "url": "https://www.oximity.com/article/Kurdish-security-forces-unleash-wave-o-1", "ord_in_thread": 0, "title": "Kurdish security forces unleash wave of terror on media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reporters Without Borders is alarmed to learn that many Kurdish media have been attacked in connection with a political crisis in the past few days in the autonomous region of Iraqi Kurdistan , where the security forces have closed media outlets in an attempt to suppress criticism of the government.\nThe crisis over President Masoud Barzani’s succession since his term ended in August has sparked many demonstrations since the start of October, especially in Sulaymaniyah , an opposition stronghold. Some have turned into riots, with protesters demanding the payment of salaries to government employees and calling on Barzani to stand down.\nTo limit news coverage of the demonstrations, the premises of several media outlets have been attacked by the security forces or in some cases by demonstrators. Access to Facebook was even blocked for a day, 10 October, in Erbil .\n“We condemn the attacks on the media and we call on the Kurdish authorities to respect the media’s work and to end the harassment to which they are being subjected with complete impunity,” said Alexandra El Khazen, the head of the Reporters Without Borders Middle East and Maghreb desk.\n“And amid the continuing political crisis, we urge journalists to act in an independent and professional manner and to refrain from fuelling political tension and disputes.”\nMedia offices attacked\nSecurity forces loyal to the Kurdistan Democratic Party (KDP), one of the two ruling coalition parties, raided Kurdish media outlets in the cities of Erbil, Dohuk and Soran on the evening of 10 October, threatening and evicting employees and badly damaging equipment. Two TV stations, NRT TV and KNN TV, were forcibly closed with no explanation being given.\nThe security forces also arrested six NRT TV reporters, photographers and technicians in Erbil, releasing them outside the province, near the Degala checkpoint and near Sulaymaniyah province. The NRT TV bureau in the city of Dohuk was also raided .\nKawa Abdulqader , a journalist who heads the NRT TV bureau in Erbil, said the security forces accused them of encouraging the chaos and supporting the opposition. A pro-KDP media outlet said the government had given orders for NRT TV to be reopened and for its employees – who it said had fled – to be allowed to return.\nThe offices of KNN TV, which supports the opposition party Gorran, were attacked in Erbil, Dohuk and Soran. Eleven or so of its employees in these cities were threatened and then detained, only to be released a few hours later outside the city limits.\nMost of these journalists were finally able to return home but not to go back to work because the Kurdish security forces were still surrounding their workplaces. According to our sources, Radio Gorran, which shares a building with KNN TV in Erbil, was also shut down.\nOn 10 October, demonstrators stoned the Sulaymaniyah office of Rudaw TV, which supports the PDK.\nReporters on the ground\nReporters Without Borders has registered many cases of journalists being attacked by security force or demonstrators while covering demonstrations since 8 October.\nJournalists were affected by teargas discharged by the security forces or were hit by stones thrown by demonstrators in several parts of Sulaymaniyah province. Some were deliberately targeted.\nThey included Kurdsatnews TV journalist Hawkar Abdulrahman , who was attacked by about 15 KDP supporters on 10 October as the police looked on without intervening. Rudaw TV reporter Shoman Mahmoud was injured by stones thrown by demonstrators in the town of Said Sadiq.\nRazhin Kama of Gali Kurdistan TV, a station affiliated to the Patriotic Union of Kurdistan (PUK), the other ruling coalition party, was hit by stones thrown by demonstrators while she and her crew were covering a demonstration in the city of Sulaymaniyah on 8 October.\nOther journalists have had their access to information restricted. A Kurdsatnews TV crew was turned back at a checkpoint on the road from Sulaymaniyah to Erbil on 12 October, when they wanted to cover the blocking of the Kurdish parliamentary speaker’s motorcade.\nCriticism about the presidential election has been tolerated less and less as tension has mounted, especially since June. Barzani, who has been president for the past ten years, may justify the need to extend his term for the second time since 2013 because of security concerns.", "external_links": ["http://www.jfoiraq.org/%D8%A7%D9%84%D8%A7%D9%85%D9%86-%D8%A7%D9%84%D9%83%D8%B1%D8%AF%D9%8A-%D9%8A%D8%BA%D9%84%D9%82-%D9%85%D9%83%D8%A7%D8%AA%D8%A8-%D9%82%D9%86%D8%A7%D8%A9-nrt-%D9%88%D9%8A%D8%AD%D8%AC%D8%A8-%D9%85%D9%88%D9%82%D8%B9-%D9%81%D9%8A%D8%B3%D8%A8%D9%88%D9%83", "http://www.ara.shafaaq.com/33088", "http://neurope.eu/article/iraq-political-tension-and-violence-in-the-kurdistan-region/", "http://www.nrttv.com/AR/media-video-detail.aspx?Cor=1&Jimare=2424", "http://www.lefigaro.fr/flash-actu/2015/10/12/97001-20151012FILWWW00065-irak-le-president-du-parlement-kurde-empeche-d-entrer-a-erbil.php"], "published": "2015-10-17T16:59:00.000+03:00", "crawled": "2015-10-18T00:17:44.826+03:00", "highlightTitle": ""}