{"organizations": [], "uuid": "8363b496fdf3420c7603ffe3cbc7c23839dc589f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nymag.com", "main_image": "http://pixel.nymag.com/imgs/fashion/daily/2015/10/08/08-kendall-jourdan-olivier-rousteing.w1200.h630.jpg", "site_section": "http://nymag.com/thecut/", "section_title": "The Cut – Fashion, Beauty, Politics, Sex and Celebrity", "url": "http://nymag.com/thecut/2015/10/did-a-chicago-woman-hack-hm-for-balmain-pics.html", "country": "US", "title": "Did a Chicago Woman Hack H&M for Balmain Pics?", "performance_score": 0, "site": "nymag.com", "participants_count": 1, "title_full": "Did a Chicago Woman Hack H&M for Balmain Pics? -- The Cut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:01:00.000+03:00", "replies_count": 0, "uuid": "8363b496fdf3420c7603ffe3cbc7c23839dc589f"}, "author": "Véronique Hyland", "url": "http://nymag.com/thecut/2015/10/did-a-chicago-woman-hack-hm-for-balmain-pics.html", "ord_in_thread": 0, "title": "Did a Chicago Woman Hack H&M for Balmain Pics?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Paul A. Hebert/Press Line/Splash/Corbis\nOlivier Rousteing has been super-selective about giving us tantalizing morsels of next month's Balmain x H&M collection (Jourdan and Kendall posing prettily! Gigi hopping the subway! ). Well, so much for that careful rollout. Instagram just hosted a flood of what purports to be advance shots of the line, as posted by Kathryn Swartz Rees, a Chicago-based writer/editor with (as of this writing) under 300 followers. Swartz Rees also tweeted \"Posted a ton of #HMBALMAINATION pics on Instagram. Lots of pieces in this collab.\" If the dramatic still-life images are legit, the collection features a red leather Thriller -style jacket and lots of the intricately embellished, '80s-flavored minidresses we've come to expect from Rousteing. At the very least, they've already caused members of the designer's vast international fan club to comment things like \"Goals\" and \"trop belle je veux,\" as one does.\nWe emailed Swartz Rees, who explained how she came across this trove, and clarified that it does not represent the full collection:\nThe images are the vast majority of the collection. There are some additional colorways — bandeau top in white and ring in clear for example — not pictured.\nThe real story is terribly unexciting: H&M's site was indexed by Google and I happened to search at the right time using the right parameters. All images were taken from that H&M URL. No surprise, that site is no longer live. A good note to web dev teams working on super hot designer collabs: stay in your sandbox!\nWe've also reached out to reps for H&M and Balmain for comment and will update this when we hear back.", "external_links": ["https://twitter.com/kathrynswartz/status/651549578668474368", "https://instagram.com/kswartz83/"], "published": "2015-10-09T03:01:00.000+03:00", "crawled": "2015-10-08T23:53:10.661+03:00", "highlightTitle": ""}