{"organizations": [], "uuid": "6bab370d4d7f683c2d106f4f7f7c1e8ed7809739", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/730x400-014874b956118a62ae4cc518f1e5a886.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/wall-street-smacks-drug-maker-under-federal-investigaton/article/2574612?custom_click=rss", "country": "US", "title": "Wall Street smacks drug maker under federal investigaton", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Wall Street smacks drug maker under federal investigaton | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:44:00.000+03:00", "replies_count": 0, "uuid": "6bab370d4d7f683c2d106f4f7f7c1e8ed7809739"}, "author": "Robert King", "url": "http://www.washingtonexaminer.com/wall-street-smacks-drug-maker-under-federal-investigaton/article/2574612?custom_click=rss", "ord_in_thread": 0, "title": "Wall Street smacks drug maker under federal investigaton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A controversial drug maker under federal investigation for high drug prices is in big trouble on Wall Street.\nTrading of Canadian drug maker Valeant Pharmaceuticals was halted on the New York Stock Exchange Wednesday. The halt came after the stock plummeted nearly 40 percent after the company was accused of financial chicanery, with an investment research firm calling the company the pharmaceutical version of Enron.\nValeant has been in hot water since federal prosecutors issued subpoenas over its pricing strategies for drugs, distribution and financial assistance programs.\nThe drug maker has been criticized by several lawmakers for raising the price of heart drugs Nitropress and Isuprel by up to 200 percent. However, it is not clear if those drugs are the subject of the subpoenas.\n  Border agent: Illegals 'know that they will be released' \"What we have right now is essentially a catch-and-release policy.\"\nBy Pete Kasperowicz • 10/21/15 1:30 PM Wednesday's stock plunge appears to be linked a damning report over the company's financial practices. A report from Citron Research issued Wednesday said the company created a network of pharmacies to inflate sales figures and avoid scrutiny from auditors.\n\"Citron Research has delivered the proof that something really stinks at Valeant and it goes beyond their egregious price hikes,\" the firm said.\nValeant categorically denied Citron's claims. It said that any shipments to the pharmacy network listed in the report called Phillidor aren't recorded in the company's consolidated revenue.\n\"Sales are recorded only when the product is dispensed,\" the company said.\nAlso from the Washington Examiner Treasury, IRS lay out tax rules for same-sex couples following court ruling With the rules, a marriage of two people of the same sex will also be recognized for federal tax purposes.\nBy Joseph Lawler • 10/21/15 5:22 PM Top Story GOP lawmakers: Has EPA fired anyone for toxic mine spill? Lawmakers pressed the agency on whether anyone has been held accountable for the 3-million-gallon spill.\nBy John Siciliano • 10/21/15 1:59 PM", "external_links": [], "published": "2015-10-21T17:44:00.000+03:00", "crawled": "2015-10-22T01:02:03.439+03:00", "highlightTitle": ""}