{"organizations": [], "uuid": "52a62aa36d1c6e8569fc7b71df5962a1cddf385a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-d222883a1c818fc730199ca596756602.jpg", "site_section": "http://feeds.feedburner.com/WashingtonexaminercomRss-Politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/trump-splits-conservatives-on-government-land-grabs/article/2573747?custom_click=rss", "country": "US", "title": "Trump splits conservatives on government land grabs", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Trump splits conservatives on government land grabs | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:01:00.000+03:00", "replies_count": 0, "uuid": "52a62aa36d1c6e8569fc7b71df5962a1cddf385a"}, "author": "T. Becket Adams", "url": "http://www.washingtonexaminer.com/trump-splits-conservatives-on-government-land-grabs/article/2573747?custom_click=rss", "ord_in_thread": 0, "title": "Trump splits conservatives on government land grabs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GOP front-runner Donald Trump is complicating the job of conservative pundits by supporting the government's use of eminent domain, the power by which it can seize private property for public use, and his stance on the issue is splitting the right-leaning press wildly.\nTrump praised government land grabs in a Fox News interview this week, even though it's a topic that usually gets the conservative press in an uproar.\nHe explained that most small government conservatives simply don't understand the complexities of the issue.\n\"I fully understand the conservative approach, but I don't think it was explained to most conservatives,\" Trump told Fox's Bret Baier. \"Nobody knows this better than I do, because I've built a lot of buildings in Manhattan and you'll have twelve sites and you'll get eleven and you'll have the one holdout, and you end up building around them. I know it better than anybody.\"\n  Sanders and Cummings 'sickened' over drug CEO Turing Pharmaceuticals' Martin Shkreli hasn't lowered the price of a drug that he jacked up 5,000 percent.\nBy Robert King • 10/09/15 12:44 PM He said later that eminent domain is \"wonderful,\" adding also that property owners targeted by the government can often benefit from it.\n\"The little guy sometimes gets a lot of money. Sometimes they'll get four or five times what their property is worth,\" he said.\nLike most of Trump's stated positions, his remarks have split conservative media.\nOn one side of the issue are pro-Trump right-wing talkers, including radio host Laura Ingraham and author Ann Coulter, who see his remarks as a big nothing.\nIngraham downplayed Trump's comments by noting on her radio show that former President George W. Bush in his private sector days used eminent domain to build the Texas Rangers' baseball stadium.\nAlso from the Washington Examiner Lawmaker wants birth control device off the market The Food and Drug Administration has received 5,000 safety reports about Bayer's Essure device.\nBy Robert King • 10/09/15 12:32 PM \"Eminent domain, and I know this winds people up real tight in the conservative movement,\" she said , \"well, one problem: George W. Bush … used eminent domain to actually build the stadium for the Texas Rangers — whoops!\"\nCoulter was equally dismissive of Trump's remarks, and suggested on social media that they're a distraction from the real issues.\nCoulter, who is also one of Trump's most ardent supporters, said sarcastically, \"Whew. Glad we have that settled. Now, can we talk about immigration?\"\nHer comments came in response to the Washington Examiner's Byron York saying, \"By the way, if anyone remembers how George W. Bush got rich — it was eminent domain.\"\nCoulter added later in an even more dismissive note , \"[W]hat's his position on eminent domain?? Gamergate? Salt!! There must be something we disagree with him on.\"\nAlso from the Washington Examiner 1 dead in shooting at Northern Arizona University One person is dead and three others are wounded after a shooting at Northern Arizona University.\nBy Kelly Cohen • 10/09/15 8:53 AM Her zeal for Trump's candidacy is matched only by Breitbart News , which also pushed back on conservative critics this week by giving the 2016 candidate a platform to explain once again that people simply don't understand his take on property rights.\nTrump offered \"a somewhat more nuanced understanding of eminent domain to Breitbart News, one that seems to acknowledge that using it for exclusively private gain is the wrong thing to do,\" the \"exclusive\" report declared.\nThe Breitbart News report goes on to suggest that his remarks likely don't matter anyway because he's polling so well. The story also suggests that supporters of Sen. Ted Cruz, R-Texas, many of whom align closely with Trump's base, needn't worry about the real estate mogul's support for government land grabs. Breitbart News also downplayed Trump's infamous attempt in 1993 to use eminent domain to evict a New Jersey woman from her home so that he could expand his hotel and casino.\nOn the opposite side of the issue are the more anti-Trump right-leaning media figures, including the Weekly Standard's Stephen Hayes and Glenn Beck, who see the former reality TV star's candidacy as anything but conservative.\n\"[Trump] called the people who won't give up their property 'holdouts,'\" Hayes said this week on Fox news. \"They're not holdouts, they're property owners.\"\n\"John Locke, the father of American political theory, believed there were three natural rights — life, liberty and property,\" he added.\nHot Air's Ed Morrisey explained in an article this week that conservatives are not opposed to all uses of eminent domain. They're simply opposed to abuses of that power, including the Supreme Court's Kelo decision, which gives \"permission for government to condemn private property to transfer it to another private owner.\"\n\"Conservatives don't oppose the use of eminent domain to build roads and other public facilities. The issue in Kelo, however, was that the government condemned the property because the owner wouldn't sell it to another private entity,\" he wrote. \"That's generally the kind of authoritarian control over property rights that conservatives oppose. It's redistributionism at its naked, raw worst, especially since in this case the city confiscated from the working class to give to the wealthy.\"\n\"[Trump's] dismissive taunts that homeowners just want to engage in 'extortion' when they refuse to sell, and his cheerful endorsement of government force to remove them from their properties under those circumstances to give access to private developers such as himself, should have conservatives asking whether this is the direction in which they want to move the Republican Party for the future,\" he added.\nGlenn Beck also weighed in on the issue this week, characterizing the supposedly widespread indifference to Trump's comments on the right as \"staggering.\"\n\"[O]nly 13 percent of his support comes from the Tea Party. But when will that 13 percent wake up and go, 'Wait a minute. Wait a minute. No, this is not constitutional,'\" he said on his radio program.\nAnd yet, even with these objections noted and explained thoroughly in several conservative media circles, Trump continues to poll extremely well with the Republican Party's supposedly conservative base.\nDaily Caller columnist Matt Lewis noted the curiosity.\n\"The big story is that the GOP front runner continues to proudly stand in opposition to much of what constitutes modern American conservative philosophy,\" he wrote. \"And it doesn't seem to matter.\"\nTop Story Rock bottom? No, things could get worse for House Republicans \"There   strategist.\nBy Byron York • 10/08/15 7:02 PM", "external_links": [], "published": "2015-10-09T03:01:00.000+03:00", "crawled": "2015-10-09T19:57:45.820+03:00", "highlightTitle": ""}