{"organizations": [], "uuid": "a318d9ff88341e288a4f9533e02a632d8f1356e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/media2.foxnews.com/2015/10/08/0/0/100815_ss_house.jpg?ve=1&tl=1", "site_section": "http://www.foxnews.com/politics/", "section_title": "Breaking Political News, Headlines &amp; Opinion | Politics | Fox News", "url": "http://www.foxnews.com/opinion/2015/10/13/my-fellow-republicans-its-time-to-seize-initiative.html", "country": "US", "title": "My fellow Republicans, it's time to seize the initiative", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "My fellow Republicans, it's time to seize the initiative | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "a318d9ff88341e288a4f9533e02a632d8f1356e5"}, "author": "Cal Thomas", "url": "http://www.foxnews.com/opinion/2015/10/13/my-fellow-republicans-its-time-to-seize-initiative.html", "ord_in_thread": 0, "title": "My fellow Republicans, it's time to seize the initiative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Cal Thomas\nPublished October 13, 2015 FoxNews.com livefyre Email Print\nWhen Rep. Kevin McCarthy (R-Calif.) walked into a Capitol Hill conference room to meet with his Republican colleagues last Thursday, he seemed a certain bet to be elected the next speaker of the House of Representatives. Subsequent reports revealed McCarthy already knew he didn't have enough votes to win, or if he did, it was barely enough, but an insufficient majority to rule the contentious GOP caucus. And so he shocked everyone when he emerged and announced his withdrawal as a candidate.\nThe website The Hill reported that Rep. Tom Rice (R-S.C.) and Rep. Louie Gohmert (R-Texas) confronted Speaker John Boehner over his apparently unilateral decision to postpone the election of a new speaker following McCarthy's withdrawal.\nSome conservative members reportedly accused Boehner of displaying the characteristics of a dictator in a banana republic. Among them was Rep. Jim Jordan (R-Ohio), who told me in a telephone interview of the deep frustration conservative Republicans feel about their leadership, which, he says, has stymied their attempt to reduce spending and reform government.\n\"Everything here is top-down,\" Jordan said. \"The steering committee runs everything. You can't get a bill or an amendment to the floor unless the steering committee approves, and the committee is made up of members appointed by Boehner, who as speaker gets more than one vote.\"\nThe way to restore \"order,\" the way to change the system and make it more democratic and fair, is to elect more members who hate the current system and vow to bend it to the will of voters.\nJordan says that gives Boehner dictatorial power over any bill or amendment he doesn't want to bring to a vote. Jordan and his conservative colleagues want to change the system so every member has a chance to introduce bills and to get amendments considered, debated and voted on. This, he says, \"will benefit everyone, including moderates and even Democrats. This way we can have a debate about ideas and whose are better.\"\nAccording to Jordan, leadership is afraid to entertain any bills it doesn't believe will pass the Senate, much less get to the president's desk. But he also says this kind of thinking angers voters who elected Republican majorities in both houses and who want their representatives to fight for their principles.\nJordan says he would have demanded that Planned Parenthood stop receiving federal funds on the first day undercover videos were released that allegedly depicted employees discussing the sale of fetal body parts in ways to maximize profits. If the videos had been shown during the congressional testimony of Planned Parenthood president Cecile Richards, he says, they might have changed the dynamic in favor of those who want to defund the organization.\nJordan says he understands why \"60 percent of Republicans -- not conservatives, not Tea Party members, but 60 percent of (all) Republicans -- think we have betrayed them.\"\nMany within the political establishment, including some in the major media, are using the word \"chaos\" to describe the last few days in Washington. But just as it is difficult to remove a stain embedded in a fabric for a long time, so too is it difficult to change a system that has benefitted career politicians, lobbyists, lawyers and big donors for decades.\nThe way to restore \"order,\" the way to change the system and make it more democratic and fair, is to elect more members who hate the current system and vow to bend it to the will of voters. This will require Republicans to seize the initiative and explain to voters who don't pay enough attention that the current leadership in both parties is mortgaging the future with higher taxes, astronomical debt and possible bankruptcy.\nJordan's candidate for speaker is Rep. Daniel Webster (R-Fla.), \"but we will talk to others,\" Jordan said. Those others presumably include Rep. Paul Ryan (R-Wis.), who has repeatedly said he doesn't want the job but reportedly will be discussing it with his family over the 10-day congressional recess. About Ryan, Jordan will only say \"he's a good man.\"\nAnger is not a policy, so if voters want a change of direction, they can have it in November by electing more people like Jordan. The Founders made it that easy, but it's up to us to make it happen.\nCal Thomas is America's most widely syndicated op-ed columnist. He joined Fox News Channel in 1997 as a political contributor. His latest book is \" What Works: Common Sense Solutions for a Stronger America \" is available in bookstores now. Readers may email Cal Thomas at tcaeditors@tribune.com.\n+ Follow FoxNewsOpinion on Facebook", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/0310339464", "https://www.facebook.com/FoxNewsOpinion"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T17:20:19.525+03:00", "highlightTitle": ""}