{"organizations": [], "uuid": "8a9da6cf1e2e4c6625fbeb27b109ddf8c0c7d5cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.startribune.com", "main_image": "http://stmedia.stimg.co/ows_144201465429781.jpg?h=630&amp;w=1200&amp;fit=crop&amp;bg=999&amp;crop=faces", "site_section": "http://www.startribune.com/politics/index.rss2", "section_title": "Politics", "url": "http://www.startribune.com/ucare-makes-medicare-push/331828591/", "country": "US", "title": "UCare makes Medicare push", "performance_score": 0, "site": "startribune.com", "participants_count": 1, "title_full": "UCare makes Medicare push - StarTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T01:46:00.000+03:00", "replies_count": 0, "uuid": "8a9da6cf1e2e4c6625fbeb27b109ddf8c0c7d5cf"}, "author": "Christopher Snowbeck", "url": "http://www.startribune.com/ucare-makes-medicare-push/331828591/", "ord_in_thread": 0, "title": "UCare makes Medicare push", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Medicare can be a tough business for smaller insurers to turn a profit, yet the market is looking more important than ever for UCare.\nOn Friday, the Minneapolis-based HMO announced it is withdrawing a lawsuit over the state’s decision to drop UCare next year as an option for most in the Medical Assistance and MinnesotaCare health insurance programs.\nThe state contract accounted for about half of UCare’s $3 billion in revenue during 2014, so the contract loss puts hundreds of jobs in jeopardy.\nEven so, UCare is still providing health insurance in other markets, and company officials are particularly focused on reassuring seniors that UCare continues in the Medicare program.\nThe commitment to the market shows, UCare officials say, with the announcement of a new Medicare plan option for 2016 in conjunction with Duluth-based Essentia Health.\n“Medicare was always very important for UCare,” said Ghita Worcester, the insurer’s senior vice president of public affairs and marketing. “It has more energy and attention that is going into it now, given all the other things occurring in the market.”\nThere are roughly 900,000 Medicare beneficiaries in Minnesota, including about 480,000 who opt to receive their benefits through private health insurers such as UCare, according to a report this summer from the California-based Kaiser Family Foundation.\nAs of March, Eagan-based Blue Cross and Blue Shield of Minnesota had the largest piece of the market with a 35 percent share, according to the report, followed by a 26 percent share for Minnetonka-based Medica and a 20 percent share for UCare.\nCurrent market\nMarketing for the annual open enrollment period in Medicare started Oct. 1, and beneficiaries can select health plans starting Oct. 15. The sign-up period ends Dec. 7.\nWhile there was news about big premium increases in Minnesota’s market for people who buy individual policies, the jumps don’t apply to Medicare.\nFor 2016, there aren’t a lot of changes in the lineup of Medicare health plans across the state, said Jean Wood, executive director of the Minnesota Board on Aging. One of the few examples, she said, is UCare’s new product in 10 counties across north and central Minnesota.\nCalled EssentiaCare, the new plan is a partnership between UCare and Essentia Health, a large operator of hospitals and clinics in the region. Enrollees will pay lower premiums in exchange for being somewhat limited in their choice of hospitals and doctors.\nPatients with the coverage will be encouraged to seek care from providers at Essentia Health, or from specialists at the Mayo Clinic in Rochester for certain rare or complex conditions. They’ll retain the option of getting care from out-of-network doctors, specialists and hospitals, but enrollees would typically have to pay more to do so.\nThe partnership between UCare and Essentia Health is an example of the new generation of contracts between health plans and providers, where hospitals and doctors have some financial risk when care costs exceed budgets. At the same time, the contracts promise some of the savings to health care providers when care costs are low.\nIt’s a shift from traditional “fee-for-service” contracts, where doctors and hospitals are paid for each service provided — a system that some say leads to inefficient care. Essentia Health expects to partner with UCare on the product for at least three years, said Dr. Michael Van Scoy, medical director of population care management at Essentia Health.\n“This is a big step, because we’re trying to offer a very competitive, consumer-friendly, low-cost option, which really puts the pressure on us to perform,” Van Scoy said.\nUCare says the goal is to provide good quality at a lower cost by making sure enrollees have a medical home that provides preventive and coordinated care.\n“We believe this new and highly collaborative plan is a model for the delivery of high-quality and cost-effective care in the future,” UCare Chief Executive Jim Eppel said in a statement.\nGrowth, and pruning\nNot all the Medicare news at UCare is about growth.\nThe insurer is dropping its Medicare health plan in 26 counties in western Wisconsin, where the HMO currently has about 8,200 enrollees, said Worcester, the insurer’s senior vice president. Payment rates to the insurer have been too low in those counties, Worcester said, saying that UCare decided to drop out of the Wisconsin market this spring — before the state announced changes to vendors in the public health insurance programs.\nIn Minnesota, UCare has about 90,000 enrollees in Medicare plans, and has generated operating income in five of the past six years. In Wisconsin, the business has been a money loser for several years, including a $10.6 million operating loss for 2014.\nAllan Baumgarten, an independent health care analyst in St. Louis Park, said the Wisconsin decision shows how it’s become increasingly difficult for smaller insurers to make money with what are called Medicare Advantage plans. Baumgarten noted that in recent years, UCare has generated a much larger share of it operating income from the state’s public health insurance programs.\nOver the past six years, UCare saw operating income of $23.4 million from Medicare plans, vs. $267.4 million in operating income from the state’s Medical Assistance and MinnesotaCare public health insurance programs.\n“Medicare Advantage is central for UCare — it’s their only large line of business,” Baumgarten wrote in an e-mail. “But it is a line of business where UCare has found it increasingly difficult to be profitable.”\nTwitter: @chrissnowbeck", "external_links": [], "published": "2015-10-11T01:46:00.000+03:00", "crawled": "2015-10-11T05:07:34.607+03:00", "highlightTitle": ""}