{"organizations": [], "uuid": "a7f2f4ae2d6d0b6c1d1adc388414cbc45d1cdbfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.2081101.1443745171!/httpImage/image.jpg_gen/derivatives/16x9_1180/tp-saad-gaya-sentencing-sketch.jpg", "site_section": "http://rss.cbc.ca/lineup/politics.xml", "section_title": "CBC | Politics News", "url": "http://www.cbc.ca/news/politics/saad-gaya-citizenship-revocation-terrorism-1.3253043?cmp=rss", "country": "IL", "title": "Ottawa moves to revoke citizenship of Canadian-born convicted terrorist", "performance_score": 1, "site": "cbc.ca", "participants_count": 1, "title_full": "Ottawa moves to revoke citizenship of Canadian-born convicted terrorist", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:28:00.000+03:00", "replies_count": 0, "uuid": "a7f2f4ae2d6d0b6c1d1adc388414cbc45d1cdbfc"}, "author": "Alison Crawford,Susana Mas", "url": "http://www.cbc.ca/news/politics/saad-gaya-citizenship-revocation-terrorism-1.3253043?cmp=rss", "ord_in_thread": 0, "title": "Ottawa moves to revoke citizenship of Canadian-born convicted terrorist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Toronto 18's Zakaria Amara among 1st to lose citizenship under Bill C-24 \nA convicted terrorist who was born and raised in Canada is asking a court to quash the federal government's attempt to strip him of his Canadian citizenship. \nIn an application to the Federal Court, Saad Gaya says revoking his Canadian citizenship would constitute \"cruel and unusual treatment.\" Toronto 18's Zakaria Amara among 1st to lose citizenship under Bill C-24 \nGaya, who is serving an 18-year sentence for his role in the Toronto 18 bomb plot, is one of at least four men convicted of terrorism who have received notices from the government saying it intends to strip them of their citizenship. \nBut Gaya is the only one who was born in Canada. Retroactive Pakistani citizenship? \nThe Conservatives' substantial changes to the Citizenship Act, which included expanding the grounds for the revocation of citizenship, came into effect in May . \nUnder the newly revamped act, the government can strip the citizenship of dual nationals, but not if it renders them stateless. \nGaya was born in Montreal to Pakistani immigrants who came to Canada over 30 years ago. His parents lost their Pakistani citizenship when they became Canadian citizens. \nBut in documents filed in Federal Court on Sept. 18, the federal government is alleging that Gaya's parents had their Pakistani citizenship retroactively restored in 2014. \nBased on that claim, the government says that stripping Gaya of his citizenship would not render him stateless because he retroactively became a dual national the moment his parents did. \n\"I think that's going to be a tough argument to defend,\" said Carissima Mathen, an associate professor of law at the University of Ottawa. \n\"This case really shows how arbitrary the application of the law is, and it's really through a pure accident of birth that someone is a dual citizen,\" she said in an interview with CBC News. 'Double punishment' \nGaya's lawyer is arguing in court that \"the act imposes an unfair onus on the individual to establish that revocation would not render them stateless.\" \nIn an interview with CBC News, Lorne Waldman said, \"It's really just double punishment. There's no other justification for it.\" \nWaldman argues in court documents that Gaya \"has never applied for Pakistani citizenship\" and denies that he has it. \nConservative Parm Gill, who appeared on CBC News Network's Power & Politics , said he was \"absolutely unaware\" of the government's efforts to strip Gaya of his citizenship. \nGaya received the notice on Aug. 6, according to court documents. \nThe government has recently stripped the citizenship of Zakaria Amara for his role in the Toronto 18 bomb plot. Asad Ansari and Saad Khalid , two other members of the Toronto 18 group, were also informed by letter the government intends to strip them of their citizenship. \nMisbahuddin Ahmed , a convicted terrorist and former Ottawa hospital technician, is asking a court to halt the government's attempt to revoke his citizenship.", "external_links": [], "published": "2015-10-02T03:28:00.000+03:00", "crawled": "2015-10-02T03:54:36.949+03:00", "highlightTitle": ""}