{"organizations": [], "uuid": "f6d3314734cc4007c139b0a511ba187bae649f86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/11/384142-tamil-actress-manorama.jpeg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/entertainment/report-legendary-tamil-actress-aachi-manorama-passes-away-at-78-2133527", "country": "SG", "title": "Legendary Tamil actress 'Aachi' Manorama passes away at 78", "performance_score": 0, "site": "dnaindia.com", "participants_count": 2, "title_full": "Legendary Tamil actress 'Aachi' Manorama passes away at 78 | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T16:27:00.000+03:00", "replies_count": 1, "uuid": "afceacceb1feb68141ed0c2261d1f68238038588"}, "author": "PTI", "url": "http://www.dnaindia.com/entertainment/report-legendary-tamil-actress-aachi-manorama-passes-away-at-78-2133527#post-0", "ord_in_thread": 0, "title": "Legendary Tamil actress 'Aachi' Manorama passes away at 78", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Affectionately called 'Aachi' (mother), she began her career as a stage artiste and acted in several hundreds of dramas. Legendary Tamil actress Manorama died at a private hospital here tonight following a heart attack, family sources said. She was 78. She is survived by her son Boopathi. \"She passed away due to heart attack, my world has fallen apart,\" Boopathi told PTI. The actress died at around 12.05 AM.\nA versatile actress, Manorama had acted in over 1,200 Tamil films, rubbing shoulders with top stars like MGR and Sivaji Ganesan in a brilliant career spanning over six decades. She holds a Guinness World Record for acting in more than 1,000 films.\nManorama also holds the unique distinction of having been in plays and films with five chief ministers.\nShe played the female lead in the plays written, directed and acted in by former Tamil Nadu chief minister CN Annadurai besides appearing in plays with another chief minister M Karunanidhi.\nPeople pay their last respects to late Tamil Actor Manorama who passed away in Chennai last night. pic.twitter.com/So4tJT1dFx\n— ANI (@ANI_news) October 11, 2015\nShe also acted in films with MG Ramachandran and Jayalalithaa, both of whom later became chief ministers.\nManorama also acted in Telugu films with NT Rama Rao, who went on to become chief minister of the erstwhile undivided Andhra Pradesh.\nAffectionately called Aachi (mother), she began her career as a stage artiste and acted in several hundreds of dramas.\nBorn Gopishantha to Kasi Kilakudaiyar and Ramamirtham at Mannargudi in Thanjavur district of Tamil Nadu, she started her acting career on stage at age 12.\nShe was rechristened Manorama by drama director Thiruvengadam and harmonist Thiyagarajan and migrated from dramas to the silver screen with the role of a heroine in the 1958 Tamil film Maalayitta Mangai .\nShe also sang several songs for films.\nAlthough she acted mainly in Tamil films since 1958, Manorama also essayed roles in Telugu, Hindi, Malayalam and Kannada movies.\nHer performance in the 1968 Tamil movie Thillana Mohanambal was widely appreciated and is considered a milestone in her career. She held her own against stalwarts like Sivaji Ganesan and Padmini in the film.\nHer on-screen pairing with comedian Nagesh, 'Cho' Ramaswamy and later with Thengai Srinivasan in the late 70s and 80s was very popular with the masses.\nShe was awarded the Padma Shri in 2002 and also won the National Film Award for Best Supporting Actress for Pudhiya Pathai in 1989.", "external_links": ["https://twitter.com/ANI_news/status/653037514110840832", "http://t.co/So4tJT1dFx"], "published": "2015-10-11T16:27:00.000+03:00", "crawled": "2015-10-12T04:37:05.072+03:00", "highlightTitle": ""}