{"organizations": [], "uuid": "39bac5c39c8f67b42ffe069e358f376d12f2f145", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30327881/two-gojo-employees-honored-as-summit-of-sustainability-changemakers", "country": "US", "title": "Two GOJO Employees Honored As Summit of Sustainability Changemakers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Two GOJO Employees Honored As Summit of Sustainability Changemakers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "39bac5c39c8f67b42ffe069e358f376d12f2f145"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30327881/two-gojo-employees-honored-as-summit-of-sustainability-changemakers", "ord_in_thread": 0, "title": "Two GOJO Employees Honored As Summit of Sustainability Changemakers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " GOJO Industries\nNicole Koharik and Tom Marting are recognized for their dedication to furthering the company's commitment to sustainability and innovation.\nAKRON, Ohio , Oct. 22, 2015 /PRNewswire/ -- GOJO, a global leader in hand hygiene and healthy skin, announced today that two of the company's team members received the first-ever Sustainability Changemaker award from Keep Akron Beautiful and the Summit of Sustainability.\nNicole Koharik , Global Sustainability Marketing Director, and Tom Marting , Facilities and Resource Management Director, were each recognized as a Sustainable Changemaker, a person who is a driving force for leading an organization to make sustainable changes that are of value to not only the organization, but to the community as well. Koharik, Marting and the other area recipients were nominated by their peers, supervisors and sustainability experts in Summit County .\nSustainability is central to the GOJO Purpose: Saving Lives and Making Life Better through Well-Being Solutions. At GOJO, sustainability is an integral part of the company and is reflected in its Sustainable Ways of Working (SWOW SM ), which is the GOJO approach to implementing sustainable practices and solutions while continuously expanding its knowledge and commitment to finding better ones. Koharik and Marting's accomplishments are a testament to this approach.\nKoharik's focus at GOJO includes corporate sustainability strategy, policies, goals and stakeholder engagement. Since taking on her role in sustainability marketing, she has worked with the executive team at GOJO to implement new initiatives, develop programs to improve processes and has strived to make sustainability a driver of innovation.\n\"At GOJO, we see sustainability as a journey requiring leadership, innovation and continuous improvement, and this award is a reflection of the progress we have made,\" she said. \"It is an honor to receive this award. Sustainability is everyone's responsibility at GOJO, and I am happy to be a part of leading the charge.\"\nMarting's commitment to delivering sustainable solutions through GOJO product innovation led him to develop a packaging solution for the hand sanitizing wipes found in grocery stores that reduces both packaging waste and labor, while still providing the sanitary solution customers need in their stores. In addition, he has played large roles on Life Cycle Analysis programs and in integrating sustainability into the GOJO new product development process.\n\"This award means so much to me because of its recognition of the great things we are doing at GOJO,\" he said. \"I am fortunate to work for a company that offers me a chance to create sustainable value through my role. To be recognized by my peers for doing what I truly enjoy, is very rewarding.\"\nTo learn more about the sustainability commitment of GOJO, visit www.GOJO.com/sustainability .\nAbout GOJO\nGOJO Industries is the inventor of PURELL 速 Advanced Instant Hand Sanitizer and the leading global producer and marketer of skin health and hygiene solutions for away-from-home settings. The broad GOJO product portfolio includes hand cleaning, handwashing, hand sanitizing and skin care formulas under the GOJO 速 , PURELL 速 and PROVON 速 brand names. GOJO formulations use the latest advances in the science of skin care and sustainability. GOJO is known for state-of-the-art dispensing systems, engineered with attention to design, sustainability and functionality. GOJO programs promote healthy behaviors for hand hygiene, skin care and compliance in critical environments. GOJO is a privately held corporation headquartered in Akron, Ohio , with operations in the United Kingdom , France , Australia , Canada , Mexico , Japan and Brazil .\nLogo - http://photos.prnewswire.com/prnh/20140430/82508\n releases/two-gojo-employees-honored-as-summit-of-sustainability-changemakers-300164872.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/two-gojo-employees-honored-as-summit-of-sustainability-changemakers-300164872.html", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY35973&Transmission_Id=201510221410PR_NEWS_USPR_____NY35973&DateId=20151022", "http://photos.prnewswire.com/prnh/20140430/82508", "http://photos.prnewswire.com/prnvar/20140430/82508", "http://www.gojo.com/sustainability"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T21:56:46.376+03:00", "highlightTitle": ""}