{"organizations": [], "uuid": "5c91ea66ca35cd460cfef0222345c5f4947060bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/90dc2ef0-53a0-4e2d-888a-087f1590983f.img", "site_section": "http://www.ft.com/rss/world/uk/politics", "section_title": "Politics & Policy - latest UK politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/d7533be2-7316-11e5-bdb1-e6e4767162cc.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Social care ‘in crisis’, warn charities", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Social care ‘in crisis’, warn charities", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:44:00.000+03:00", "replies_count": 0, "uuid": "5c91ea66ca35cd460cfef0222345c5f4947060bc"}, "author": "", "url": "http://www.ft.com/cms/s/0/d7533be2-7316-11e5-bdb1-e6e4767162cc.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Social care ‘in crisis’, warn charities", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarah Neville"], "text": "UK social care ‘in crisis’, warn charities Sarah Neville, Public Policy Editor ©Getty \nMore than 80 leading charities have warned that social care is in “crisis”, following a damning report by the sector’s regulator that found more than four-in-10 care providers in England were rated as “inadequate” or “requiring improvement”. \nThe “state of care” report from the Care Quality Commission also sounded the alarm over safety across the wider care sector, including the NHS, discovering that more than one-in-10 hospitals and a similar proportion of adult social care providers were not meeting safety standards. More Labour rebels let Osborne charter pass \nThe Care and Support Alliance, an umbrella body, said the government should make a “significant investment” in social care at the spending review next month. \nThe findings by the CQC have brought into focus the dilemma facing the Treasury, as it decides how much of the promised additional NHS spending — an extra £8bn a year by 2020 — will be allocated in the early part of the five-year spending settlement and the impact on the social care budget of more steep cuts to local government spending. \nVicky McDermott, who chairs the CSA, said the chancellor should use next month’s Comprehensive Spending Review to address the chronic underfunding of social care. Councils had been forced to reduce what they paid to care providers and this had had a direct impact on services, Ms McDermott added. \nThe CQC ratings, which cover the period up until the end of May this year, show more than 80 per cent of GP practices are rated either good or outstanding. In adult social care, nearly six out of 10 services secured that rating, along with only 38 per cent of hospitals and trusts, including mental health facilities. \nThe commission said its inspections had identified strong leadership as a crucial factor among those providers rated as either good or outstanding.", "external_links": [], "published": "2015-10-15T13:44:00.000+03:00", "crawled": "2015-10-15T14:07:00.691+03:00", "highlightTitle": ""}