{"organizations": [], "uuid": "4d128462755ada6c5c00d2abf96bffc4546962a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/6bbe7b89d4d159beb084f277c6d7a9530d946a82/0_87_4393_2637/master/4393.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=764008ff32b2c85fcc7dc3d1640708f4", "site_section": "http://feeds.guardian.co.uk/theguardian/politics/rss", "section_title": "Politics | The Guardian", "url": "http://www.theguardian.com/politics/2015/oct/05/corbynmania-almost-makes-election-loss-worth-it-claims-union-boss", "country": "US", "title": "Corbynmania almost makes election loss worth it, claims union boss | Politics", "performance_score": 0, "site": "theguardian.com", "participants_count": 20, "title_full": "Corbynmania almost makes election loss worth it, claims union boss | Politics | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 50, "uuid": "b04944c974272da0c59ad477bf98a0c55f8b2784"}, "author": "Helen Pidd", "url": "http://www.theguardian.com/politics/2015/oct/05/corbynmania-almost-makes-election-loss-worth-it-claims-union-boss#post-0", "ord_in_thread": 0, "title": "Corbynmania almost makes election loss worth it, claims union boss | Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A senior trade unionist has appalled some Labour MPs by suggesting Labour’s election defeat was a good thing because it allowed Jeremy Corbyn to ascend to the party leadership.\nAddressing a rally in Manchester alongside Corbyn to coincide with the Conservative party conference, Terry Pullinger, deputy general secretary of Communication Workers’ Union (CWU), said Corbynmania “almost makes you want to celebrate the fact Labour lost the election”.\nHis comments were immediately greeted with dismay by Corbyn’s Labour party colleagues. “How depressing,” tweeted Rachel Reeves, former shadow work and pensions secretary, who refused to serve with Corbyn. Wes Streeting, the new MP for Ilford North wrote on Twitte r: “Tell that to woman who wept in my surgery last week because of tax credit cuts. My words aren’t suitable for Twitter.”\nAddressing a CWU-organised rally at Manchester cathedral that was so oversubscribed that thousands spilled out in front of a second stage outside, Pullinger told those inside the church: “It’s unacceptable that the political debate has got so narrow.\n“Since Thatcher, that conventional wisdom says it has to be the free market, there has to be competition and there’s no other way – and anyone who says different is barmy, or non intelligent.\n“We’ve been desperate to see that conventional wisdom blown apart and we have by Jeremy Corbyn.” \nHe added: “Actually now it makes you want to celebrate the fact that Labour lost the election.”\nSpeaking to the overspill group, former postman Pullinger suggested the general election loss was good because it “widened the political debate”. He added: “It has blown it wide open and is one of the greatest things I have seen in all my years in a trade union.”\nHe was followed by Corbyn, who was greeted with wild applause as he insisted he was determined to beat the Conservatives.\nRelated: 'They all know his name': Corbyn reawakens Labour loyalties in Yorkshire \n“Our party is committed to doing things in a very different way. I want us to win an election as soon as it comes. We may have to wait until 2020 to do that but I’ll tell you this, the election victory of 2020 won’t be won in the three or four weeks leading up to that election date itself. It will be won by winning the ideas, the imagination, the hope, the optimism, the brains, the hearts and minds of every ordinary person in this country,” he said, prompting whoops and loud applause.\n“Look around you, here outside the cathedral in Manchester. We are all basically normal, decent, ordinary human beings who want to see a society and a world that actually does care for all. That is the fundamental principle of what the Labour party is all about.”\nHe added: “It’s my pride and pleasure to be able to work with you in this campaign. Because every campaign excites more people, more people get involved, more people open their eyes to the possibility of the kind of world we can live in. We are going to win on this one, I know that. We’re going to be strong on this one. We’re going to be brave on this one.”", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-06T08:16:52.362+03:00", "highlightTitle": ""}