{"organizations": [], "uuid": "4fb4a051cd60d2094e791cc17d9b058588625aca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arktimes.com", "main_image": "http://media2.fdncms.com/arktimes/imager/u/slideshow/4130308/img_20151017_131919.jpg", "site_section": "http://www.arktimes.com/arkansas/Rss.xml", "section_title": "Arkansas news, politics, opinion, restaurants, music, movies and art, Arkansas Times", "url": "http://www.arktimes.com/EatArkansas/archives/2015/10/19/for-the-love-of-frybread", "country": "US", "title": "For the love of frybread", "performance_score": 0, "site": "arktimes.com", "participants_count": 1, "title_full": "For the love of frybread", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T21:42:00.000+03:00", "replies_count": 0, "uuid": "4fb4a051cd60d2094e791cc17d9b058588625aca"}, "author": "Michael Roberts", "url": "http://www.arktimes.com/EatArkansas/archives/2015/10/19/for-the-love-of-frybread", "ord_in_thread": 0, "title": "For the love of frybread", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read this For the love of frybread Posted By Michael Roberts on Mon, Oct 19, 2015 at 1:42 PM click to enlarge Well, another year of the Arkansas State Fair is in the books, and we really lucked out with the weather this year. I was out of town for the opening weekend, but I did manage to get down to the fairgrounds on the final Saturday to take a look at all the livestock, get hollered at by carnies and watch people who are both younger and braver than I get thrown around on all manner of rides. And, of course, I ate. When I talked to Kat Robinson last week about all things fair food related , she mentioned really loving frybread tacos, and so I decided that this would be the item I hunted down to try. I've made frybread at home for years, and although the sheer unhealthiness of eating what amounts to fried dough make it something I don't allow myself very often...It's the fair, y'all, so I decided to live a little. My first trip up and down the fairway proved fruitless until I realized that what I was searching for wasn't called a \"frybread\" taco at all—it was known by the far less PC name of \"Indian Taco.\" I suppose that makes sense—after all, frybread as we know it was invented by Native Americans on reservations being forced to come up with something to eat made from limited government subsidies of flour, salt and oil. So, taco in hand, I managed to score a coveted spot at one of the picnic tables to dig in. The results were mixed. The frybread itself was excellent. Fluffy, golden brown, perfectly fried and delightfully greasy. The toppings were quite forgettable—cafeteria-grade meat, lettuce, cheese and beans—it made me wish I had just gotten a piece of bread and been done with it. The other result, though, is that I think Kat is onto something: this dish needs to be part of some restaurant's menu. Up the quality of toppings and the result would be a messy, delicious dish different from a taco, different from a sope—it would be its own thing. So if you're a taco maker looking for the next big thing, try adding a frybread taco to your menu. I will personally vouch for how good they are, and I bet you'll find other people will, too.", "external_links": [], "published": "2015-10-19T21:42:00.000+03:00", "crawled": "2015-10-19T22:24:53.856+03:00", "highlightTitle": ""}