{"organizations": [], "uuid": "b7d31c6d0c35108683cf84f67cfad871882ff186", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://beforeitsnews.com/mediadrop/uploads/2015/43/d031aae5e3b59b25e99accbb74f79a9ad2c0531f.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-liberal/2015/10/hillary-ideas-vs-bernie-ideas-2515848.html", "country": "US", "title": "Hillary Ideas vs Bernie Ideas | Opinion - Liberal", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Hillary Ideas vs Bernie Ideas | Opinion - Liberal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T04:07:00.000+02:00", "replies_count": 0, "uuid": "b7d31c6d0c35108683cf84f67cfad871882ff186"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-liberal/2015/10/hillary-ideas-vs-bernie-ideas-2515848.html", "ord_in_thread": 0, "title": "Hillary Ideas vs Bernie Ideas | Opinion - Liberal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nIt's not always the easiest thing to assign motivation to a politician for their votes, although it helps when they're consistent and when they tell their constituents why. Otherwise you have to guess a lot of the time. Earlier today we were looking at the one Democrat– Minnesota Blue Dog Collin Peterson– who voted with the Republicans to take health insurance away from 11 million people under the Affordable Care Act and to defund Planned Parenthood– and the 7 Republicans who voted with the Democrats against the bill. Peterson is an anti-Choice fanatic and in an electorally vulnerable position in an R+6 district where Obama only got 44% of the vote last year. Not that hard to figure out. With the Republicans it was more difficult. Richard Hanna is one of the only pro-Choice Republicans left. Bob Dold is in a pro-Choice district and in a fight for his life. Walter Jones is a libertarian and his votes are unpredictable– although he's very much anti-Choice– but in this particular instance he's in a tough reelection primary battle against Taylor Griffin who ran against him last year and held him down to a narrow 2,500 vote victory (50.9%). Meanwhile 4 of the most extreme right-wing fanatics– Ken Buck (CO), Matt Salmon (AZ), Mark Walker (NC) and Mark Meadows (NC)– voted NO. Why? The bill didn't go far enough for them. Everyone has their own reason for voting the way they did and some of the reasons were antithetical to each other.\nProgressives have been excited and happy each time Hillary Clinton has taken even a tepid little step towards the kinds of policies that differentiate “real” Democrats (liberals, progressives) from corporate Democrats. Heavily funded by corporate interests and Wall Street and overly cautious not to appear “too liberal,” it's been celebrated in certain left-leaningish circles when she backed a little raise in the minimum wage and a so-so plan to help working class kids with higher education costs and when she finally came out against building the Keystone Pipeline and did a 180 on her opposition to marriage equality and when she finally said she would stop taking campaign cash from the private prison industry. She even put out a report about regulating Wall Street a little tiny bit . All these things are pale imitations of the real thing that is on offer from Bernie (and from Elizabeth Warren), neither of whom is taking policy positions based on focus groups, polling data or the exigencies of an electoral campaign.\nDid it surprise anyone today when David Plouffe, Obama's former campaign manager, endorsed Hillary ? See that meme up top? I'd much rather Hillary not take campaign cash from the private prison industry, as she's now announced she no longer will… but I'd be even happier if she knew it was a terrible thing to do and never did it in the first place. In his HuffPo piece about where the 2016 candidates get their campaign money , Paul Blumenthal makes the case that Hillary– just like Jeb Bush and Chris Christie– is being financed by wealthy elites with special interests, while Bernie, as well as Ben Carson, have campaigns being supported by immense numbers of small donors.\nThe fundraising difference among the Democratic candidates– or at least between the top two candidates– looks even more dramatic [than the difference among the Republicans]. Clinton has raised large sums from donors giving $2,700 or more, while Sanders has pulled in strikingly little from max-out contributors.\nSanders received almost all of his money from small donors, including those giving more than $200. Out of his $26 million third-quarter haul, just $305,734 came from donors giving $2,700 or more. Small donors giving less than $200 combined to contribute $20 million, or 77 percent of his total, which is the highest percentage of any of the 17 candidates examined.\nClinton raised $16 million from max-out donors, or 53 percent of her total. Unlike the Republicans who leaned most heavily on big donors, the former secretary of state received significant sums from small donors as well. Her campaign pulled in $5.2 million from donors giving under $200. She has also cultivated a base of repeat donors making numerous small donations.\nAnd then when it comes to SuperPACs, there's another $20,291,679 that's ready to be deployed on her behalf, $15,654,458 of which comes from Priorities USA. $3,100,000 of that comes right from Wall Street and another $750,000 from drug companies. Him Saban, Israel's chief Democratic lobbyist– the way Adelson is Israel's chief GOP lobbyist– has already given then $2,000,000. Her second biggest SuperPAC, ReadyPAC, has raised $3,180,593 and over $400,000 has come from Wall Street. And what about Bernie? He doesn't have a SuperPAC. Something call the Collective Actions PAC is raising money to use to help him, but so far they've only raised $8,795, all from small donors.\nIf reforming Wall Street and cutting back on the influence of plutocrats in our political system are priorities for you, Hillary is… better than a Republican. But, very much not part of the Elizabeth Warren-Bernie Sanders wing of the Democratic Party . If reforming Wall Street and cutting back on the influence of plutocrats in our political system are priorities for you, click on this link go directly to Bernie's ActBlue page . Today, Sarah Silverman told the L.A. Times that “Bernie is the only politician not for sale. Look, I love Hillary too, but Goldman-Sachs owns her. She might as well be wearing race car driver [logos]… Everybody’s for sale, and here’s this guy who’s been a senator for a million years from Vermont who is just simply not for sale.”\nYesterday, Bernie's campaign sent a note to his supporters that asserted that “a presidential campaign should be about the issues. Bernie's been right on the issues, early and often .” And these pictures came too:\n“When fascism comes to America, it will be wrapped in the flag and carrying the cross.” — Sinclair Lewis", "external_links": ["http://www.huffingtonpost.com/entry/2016-election-small-donors_5621583de4b02f6a900c501d?ncid=tweetlnkushpmg00000016&#038;section=politics", "http://downwithtyranny.blogspot.com//feeds/posts/https://secure.actblue.com/contribute/page/bernie2016?refcode=dwt&#038;recurring=12", "http://www.latimes.com/entertainment/movies/la-et-mn-sarah-silverman-i-smile-back-20151023-story.html", "http://downwithtyranny.blogspot.com//feeds/posts/https://medium.com/hillary-for-america/why-i-m-endorsing-hillary-clinton-for-president-1d15ad738c65#.rcet3aqu3", "http://downwithtyranny.blogspot.com/2015/10/gop-dcccs-bluedog-collin-peterson-vote.html", "http://www.huffingtonpost.com/entry/elizabeth-warren-bernie-sanders-puerto-rico_56294d37e4b0aac0b8fc4a02", "http://downwithtyranny.blogspot.com/2015/10/gowdys-silly-benghazi-committee-will.html"], "published": "2015-10-25T04:07:00.000+02:00", "crawled": "2015-10-25T07:34:11.029+02:00", "highlightTitle": ""}