{"organizations": [], "uuid": "685a973d81b19bf8e6985e91e0fdf549530349eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jpupdates.com", "main_image": "", "site_section": "http://jpupdates.com/feed/", "section_title": "JP Updates | Breaking News NYC, Jewish Political News & Updates", "url": "http://jpupdates.com/2015/10/07/republicans-defend-house-benghazi-panel-democrat-seeks-review/", "country": "US", "title": "Republicans Defend House Benghazi Panel; Democrat Seeks Review", "performance_score": 0, "site": "jpupdates.com", "participants_count": 1, "title_full": "Republicans Defend House Benghazi Panel; Democrat Seeks Review", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:24:00.000+03:00", "replies_count": 0, "uuid": "685a973d81b19bf8e6985e91e0fdf549530349eb"}, "author": "JP Newsroom", "url": "http://jpupdates.com/2015/10/07/republicans-defend-house-benghazi-panel-democrat-seeks-review/", "ord_in_thread": 0, "title": "Republicans Defend House Benghazi Panel; Democrat Seeks Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share \n( Reuters ).U.S. House Republicans on Wednesday defended the special committee investigating the 2012 attack in Benghazi, Libya, while one Democrat filed a complaint seeking an internal review of potential ethics violations. \nThe political wrangling followed remarks by U.S. House Republican Majority Leader Kevin McCarthy in a television interview last week that the taxpayer-funded investigation had hurt Democrat Hillary Clinton as she seeks her party’s presidential nomination. \nMcCarthy later said he did not mean to suggest the committee’s purpose was to harm the former secretary of state’s political prospects and on Wednesday told reporters he misspoke in the Sept. 29 interview on Fox News. \n“Let’s be very clear. Benghazi is not political,” McCarthy said after a closed-door meeting of House Republicans. “It was created for one purpose and one purpose only: to find the truth on behalf of the families of the four dead Americans.” \nDemocratic U.S. Representative Alan Grayson of Florida filed an ethics complaint on Wednesday against McCarthy and the committee’s chairman, Trey Gowdy, saying that federal funds for the Benghazi committee were being used for political purposes. \nClinton, the top U.S. diplomat at the time of the Benghazi attack in 2012, and fellow Democrats have seized on McCarthy’s comments as proof that this was a politically motivated investigation focusing on the candidate rather than the incident, in which U.S. Ambassador Chris Stevens and three other Americans were killed. \nHer campaign this week released a new ad featuring McCarthy’s remarks in an attempt to rally her supporters ahead of her Oct. 22 testimony before the committee. \nGowdy defended the committee’s work on Wednesday, noting that McCarthy has apologized. \n“Kevin screwed up,” Gowdy told MSNBC. “Our interest in her is because she was secretary of state at the time.” \nMcCarthy’s comments could affect his bid to become House speaker when John Boehner steps down this month. McCarthy is seen as the favorite, but House Oversight Committee Chairman Jason Chaffetz and RepresentativeDaniel Webster also are running. \nClinton stopped short of calling for the Benghazi committee to be disbanded this week, but other Democrats, including House Minority Leader Nancy Pelosi, have said the panel may have violated ethics rules and should dissolve. \nMcCarthy’s blunder prompted a mild jibe from White House spokesman Josh Earnest, who said he would take the congressman “at his word.” \nEarnest said this was the eighth panel to investigate Benghazi and that “legitimate questions have been raised about the true purpose of this committee.”", "external_links": [], "published": "2015-10-08T05:24:00.000+03:00", "crawled": "2015-10-08T05:55:09.266+03:00", "highlightTitle": ""}