{"organizations": [], "uuid": "f9dfa5761fbf9a7cb035c2673aab754a4c5326bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/09/Editorial-Opinion/Images/Was8970645.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/a-gun-owners-plea-for-gun-control/2015/10/09/4ea9c716-6dcb-11e5-aa5b-f78a98956699_story.html", "country": "US", "title": "I’m a gun owner. The NRA doesn’t speak for me.", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "I’m a gun owner. The NRA doesn’t speak for me. - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "f9dfa5761fbf9a7cb035c2673aab754a4c5326bd"}, "author": "Colbert I. King", "url": "http://www.washingtonpost.com/opinions/a-gun-owners-plea-for-gun-control/2015/10/09/4ea9c716-6dcb-11e5-aa5b-f78a98956699_story.html", "ord_in_thread": 0, "title": "I’m a gun owner. The NRA doesn’t speak for me.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Demonstrators for sensible gun laws in front of the White House on Monday. (Mandel Ngan/AFP/Getty Images) By Colbert I. King Opinion writer October 9 at 7:38 PM We got guns for Christmas.\nMy brother and I also got guns during the year if we could make a good trade in the neighborhood or if our father came across a good bargain.\nColbert I. “Colby” King writes a column -- sometimes about D.C., sometimes about politics -- on that runs on Saturdays. In 2003, he won the Pulitzer Prize for Commentary. King joined the Post’s editorial board in 1990 and served as deputy editorial page editor from 2000 to 2007. View Archive The guns were toys.\nOne memorable Christmas morning, each of us found two-gun, fast-draw holster sets under the tree. Another Christmas, we got striking replicas of Army rifles, making us the envy of kids in the West End.\nOur childhoods were filled with games of cops and robbers in which one side ended up dead, or in a heated argument: “I shot you first.” “No you didn’t!”\nWe played Army, pretending we were soldiers fighting an imaginary enemy from overseas.\nSaturdays we could be found at the neighborhood theater matinee, eyes glued to the screen watching the likes of the Durango Kid, Red Ryder, Roy Rogers, Hopalong Cassidy, Johnny Mack Brown, Sunset Carson (who wore his gun butt forward) and Eddie Dean, shooting and killing bad guys with neither a trace of remorse nor breaking a sweat.\nFictional weapons and Westerns were the stuff of growing up.\nSeveral years later, I graduated to real guns, enrolling in ROTC to become an Army officer, which entailed a summer training course using firearms with live ammunition. Some time after that, my world of live weapons expanded to include a .38 Special and later a .357 Magnum as training for protective assignments as a special agent with the State Department.\nSince 1988, I have been a registered gun owner in the District, and thus, according to Newsweek , among the 22 percent of Americans who own a firearm. In 2013, the Pew Research Center put ownership at 24 percent.\nIn truth, nobody knows how many gun owners there are in the United States. Likewise, there are no hard numbers on the number of guns in this country. Pew cites various estimates putting the total between 270 million and 310 million.\nOne thing is for sure: We have the highest per capita rate of firearm-related murders of all developed countries. The Centers for Disease Control and Prevention counted 33,636 firearms deaths in 2013.\nAnd as The Post reported , the number of police shootings and arrest-related deaths is unknown.\nThus far in 2015, according to the nonprofit Gun Violence Archive , there have been more than 40,000 incidents of gun violence resulting in more than 10,000 deaths and 20,000 injuries.\nAmong those numbers, there have been more than 2,000 youths, ages 12 to 17, killed or wounded, as well as 560 children under 12.\nAnd the year’s not over.\nWhat to do, what to do?\nGun violence is a scourge on America.\nBut what kind of gun violence are we talking about?\nThe only variety that seem to stir emotion are the mass shootings that occurred in Roseburg, Ore., at Sandy Hook Elementary School in Newtown, Conn., at a movie theater in Aurora, Colo., at Texas’s Fort Hood, in Tucson, and in Blacksburg, Va.\nThey are the attention-getters that spark cries for gun-law reform.\nThe National Rifle Association doesn’t speak for this gun owner. Bring on the controls.\nExpand background checks for all gun sales and close gun-show loopholes. Come down hard on “straw purchasers” who legally acquire guns only to pass them on to people prohibited from owning weapons. Why do hunters — or households, for that matter — need a military-style assault weapon? Ban them, says this gun owner. And if mental-health services will help address the problem, provide that, too.\nBut the response shouldn’t be limited to mass murders, which don’t take the greatest toll.\nSince the start of the year, the District has had 120 homicides — that’s 11 times the gun deaths in Roseburg, and more than four times the number of victims murdered at Sandy Hook.\nSadly, these individual deaths seem to draw only brief media attention, after the weather and traffic.\nBut whether it is the District, Chicago, Baltimore or a college campus in the far Northwest, we’re talking about a willingness to pull the trigger on the defenseless and end another person’s life.\nMost of us, thankfully, cringe at the thought. Not true for the mass murderer, armed carjacker or gang member. Is one any less deranged than the other?\nTheir motives may differ. The consequences of their actions do not.\nThey are the extreme ends of the gun culture that permeates our social fabric. Therein lies the challenge.\nDrill down deeper on gun violence.\nWe know how and with what weapons killers kill.\nWe need to know more about the why, and how to deal with this public health crisis, which is of our own making.\nRead more from Colbert King’s archive .\nRead more here:\nE.J. Dionne Jr.: It’s time to hold America’s gunmakers accountable\nFred Hiatt: A gun-free society\nCharles Krauthammer: Another massacre, another charade\nMichael Gerson: Obama’s tantrums won’t end gun violence", "external_links": ["http://mpdc.dc.gov/page/district-crime-data-glance", "http://www.pewresearch.org/fact-tank/2013/06/04/a-minority-of-americans-own-guns-but-just-how-many-is-unclear/", "http://www.cdc.gov/nchs/fastats/injury.htm", "http://www.newsweek.com/us-gun-ownership-declines-312822", "http://www.gunviolencearchive.org/"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T03:00:12.566+03:00", "highlightTitle": ""}