{"organizations": [], "uuid": "195c2bf06c159dd650a016811ff0f59f27a25169", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "jpupdates.com", "main_image": "", "site_section": "http://jpupdates.com/feed/", "section_title": "JP Updates | Breaking News NYC, Jewish Political News & Updates", "url": "http://jpupdates.com/2015/10/21/justice-scalia-death-penalty-might-be-ruled-unconstitutional/", "country": "US", "title": "Justice Scalia: Death Penalty Might be Ruled Unconstitutional", "performance_score": 0, "site": "jpupdates.com", "participants_count": 1, "title_full": "Justice Scalia: Death Penalty Might be Ruled Unconstitutional", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:30:00.000+03:00", "replies_count": 0, "uuid": "195c2bf06c159dd650a016811ff0f59f27a25169"}, "author": "Ryan Haas", "url": "http://jpupdates.com/2015/10/21/justice-scalia-death-penalty-might-be-ruled-unconstitutional/", "ord_in_thread": 0, "title": "Justice Scalia: Death Penalty Might be Ruled Unconstitutional", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Share Photo credit: Wikipedia \nSupreme Court Justice Antonin Scalia said Tuesday that he wouldn’t be surprised if his colleagues invalidate the death penalty on constitutional grounds in the future. \nScalia addressed capital punishment to a group of law students at the University of Minnesota Law School. The death penalty came up, as Scalia referred to the Constitution as an “enduring” document that shouldn’t be open to broad interpretation — while sharing frustration that his liberal colleagues too readily find flexibility in it. \nScalia said death penalty decisions from the court have made it “practically impossible to impose it but we have not formally held it to be unconstitutional.” Scalia also said “it wouldn’t surprise me if [the death penalty] did” get banned. \nAlthough 31 states have the death penalty, only 12 states still enforce the death penalty. Even Oklahoma, who has the second most executions since the Supreme Court resumed the death penalty, put a stay on any executions since an execution was botched up in 2014. \nScalia said the Supreme Court has increasingly made it difficult for states to enforce the death penalty. He said rulings have added mitigating circumstances that must be considered or made it impermissible to automatically sentence people to death for certain crimes, such as killing a police officer. \nIn 2002, the Supreme Court banned capital punishments for the mentally retarded. In 2005, the high court banned the death penalty for anyone less than 18 years of age. In 2008, the same court banned the death penalty for child rape. \nThe Supreme Court this month began its latest term and has already heard one death penalty challenge out of Kansas. The court also intends to consider a case from Florida that questions whether judges, rather than juries, can impose a death sentence, especially when the jury is not unanimous in recommending death.", "external_links": [], "published": "2015-10-21T19:30:00.000+03:00", "crawled": "2015-10-21T19:30:07.742+03:00", "highlightTitle": ""}