{"organizations": [], "uuid": "112082f606e10757e0a1f9b9e268dfb48154fea6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-019bc488ca410a681b8d91e90486b8b8.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/demi-lovato-lobbies-congress-for-mental-health-reform/article/2573523?custom_click=rss", "country": "US", "title": "Demi Lovato lobbies Congress for mental health reform", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Demi Lovato lobbies Congress for mental health reform | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T18:38:00.000+03:00", "replies_count": 0, "uuid": "112082f606e10757e0a1f9b9e268dfb48154fea6"}, "author": "Joshua Axelrod", "url": "http://www.washingtonexaminer.com/demi-lovato-lobbies-congress-for-mental-health-reform/article/2573523?custom_click=rss", "ord_in_thread": 0, "title": "Demi Lovato lobbies Congress for mental health reform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Singer Demi Lovato appeared on Capitol Hill Tuesday to fight for mental health reform as part of the National Council for Behavioral Health's Hill Day.\nSen. John Cornyn, R-Texas, tweeted out his admiration for Lovato and the cause she is championing:\nThank you Senator for taking the time to discuss the importance of mental health care in America https://t.co/8Z7Ooh6ehu — Demi Lovato (@ddlovato) October 6, 2015 \nThe singer became a spokeswoman for \"Be Vocal: Speak Up for Mental Health\" initiative after admitting four years ago that she suffers from bipolar disorder.\n  Trump on eminent domain: 'It's wonderful' 'It's called economic development,' Trump says of eminent domain.\nBy Gabby Morrongiello • 10/06/15 7:08 PM Lovato urged her Twitter followers to join the movement earlier Tuesday:\nNow it's your turn to #BeVocalSpeakUp ! How will you speak up for #mentalhealth ? Get started here: http://t.co/ayJRUkmUZV — Demi Lovato (@ddlovato) October 6, 2015 \nShe stopped by \"MSNBC Live with Tamron Hall\" on Monday to discuss her battle with mental health and her goals for her congressional appearance.\n\"What I would like to see is comprehensive mental health reform in our government, and I think it's really important that mental health treatment is more accessible than it is,\" she told Hall.\nThe issue of mental healthcare in the U.S. was thrust back into the spotlight again after last week's shootings at Umpqua Community College in Oregon that left nine people dead. Lovato made a point to remind Hall that incidents like that which involve someone suffering from a mental illness are far from the norm.\nAlso from the Washington Examiner Trump warns of bigger threat to U.S. than immigration The billionaire candidate decries currency manipulation and the Trans-Pacific Partnership.\nBy Gabby Morrongiello • 10/06/15 6:46 PM \"Well, unfortuantely we've had several instances where mental health has been brought to the attention by the media because of these tragedies,\" she said. \"I think it's really important to remember that actually, people with mental illness are more likely to inflict harm on themselves and become the victim rather than be the perpetrators.\"\nAccording to Lovato, it takes about 10 years for most people, regardless of age, to be properly diagnosed and receive the treatment they need.\n\"It's actually four out of 10 people with mental illness are getting the treatment that they need, which leaves you to think of how many people aren't getting treatment,\" she said. \"It's leading to so many problems.\"\nLovato also opened up about her own struggle with mental illness.\n\"Yes, I suffered from bits of mania and also bipolar depression,\" she confessed. \"That was the main thing that really got me. I was lonely and sad and miserable and I couldn't figure out why because I was on top of the world, it felt like. I was struggling with it and I want to do whatever I can to help others.\"\nAlso from the Washington Examiner Sanders works to peel union support away from Clinton Sanders has positioned himself as a champion of union workers.\nBy Ariel Cohen • 10/06/15 6:34 PM She reiterated that the most important things someone can do to combat mental diseases are to acknowledge they might have a problem and go seek help.\n\"I think there were tons of signs missed by the people around me [about my mental state], but I didn't also vocalize it,\" Lovato said. \"That's why it's so important. That's why I'm involved with this campaign for mental health … I think that the more you're vocal for yourself, and also others, the more people can help you. That's why it's so important that you speak up.\"\n ", "external_links": [], "published": "2015-10-06T18:38:00.000+03:00", "crawled": "2015-10-07T02:17:04.187+03:00", "highlightTitle": ""}