{"organizations": [], "uuid": "6c99411869e8d7d56c41fc7bec4879220fb647a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/b6/9f78fa2a9774cbbb0ecbb6fc5b506d/media:253ba528635d42308bbc8a240682dd08APTOPIXAfghanistan.JPEG", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/world/articles/2015/10/15/apnewsbreak-us-spec-ops-knew-afghan-site-was-hospital", "country": "US", "title": "APNewsBreak: US analysts knew Afghan site was hospital", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "APNewsBreak: US analysts knew Afghan site was hospital - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "6c99411869e8d7d56c41fc7bec4879220fb647a2"}, "author": "USNews", "url": "http://www.usnews.com/news/world/articles/2015/10/15/apnewsbreak-us-spec-ops-knew-afghan-site-was-hospital", "ord_in_thread": 0, "title": "APNewsBreak: US analysts knew Afghan site was hospital", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By KEN DILANIAN, AP Intelligence Writer\nWASHINGTON (AP) — Days before the Oct. 3 U.S. air attack on a hospital in Afghanistan, American special operations analysts were gathering intelligence on the facility — which they knew was a protected medical site — because they believed it was being used by a Pakistani operative to coordinate Taliban activity, The Associated Press has learned.\nIt's unclear whether commanders who unleashed the AC-130 gunship on the hospital — killing at least 22 patients and hospital staff — were aware that the site was a hospital or knew about the allegations of possible enemy activity. The Pentagon initially said the attack was to protect U.S. troops engaged in a firefight and has since said it was a mistake.\nThe special operations analysts had assembled a dossier that included maps with the hospital circled, along with indications that intelligence agencies were tracking the location of the Pakistani operative and activity reports based on overhead surveillance, according to a former intelligence official familiar with the material. The intelligence suggested the hospital was being used as a Taliban command and control center and may have housed heavy weapons.\nAfter the attack — which came amidst a battle to retake the northern Afghan city of Kunduz from the Taliban — some U.S. analysts assessed that the strike had been justified, the former officer says. They concluded that the Pakistani, believed to have been working for his country's Inter-Service Intelligence directorate, had been killed.\nNo evidence has surfaced publicly to support those conclusions about the Pakistani's connections or his demise. The former intelligence official was not authorized to comment publicly and spoke only on condition of anonymity.\nThe top U.S. officer in Afghanistan, Gen. John Campbell, has said the strike was a mistake, but he has not explained exactly how it happened or who granted final approval. He also told Congress he was ordering all personnel in Afghanistan to be retrained on the rules governing the circumstances under which strikes are acceptable.\nThe new details about the military's suspicions that the hospital was being misused complicate an already murky picture and add to the unanswered questions about one of the worst civilian casualty incidents of the Afghan war. They also raise the possibility of a breakdown in intelligence sharing and communication across the military chain of command.\nPentagon officials declined comment.\nThe international humanitarian agency that ran the facility, Doctors without Borders, has condemned the bombing as a war crime. The organization says the strike killed 12 hospital staff and 10 patients, and that death toll may rise. It insists that no gunmen, weapons or ammunition were in the building. The U.S. and Afghan governments have launched three separate investigations. President Barack Obama has apologized, but Doctors without Borders is calling for an international probe.\nDoctors without Borders officials say the U.S. airplane made five separate strafing runs over an hour, directing heavy fire on the main hospital building, which contained the emergency room and intensive care unit. Surrounding buildings were not struck, they said.\nTypically, pilots flying air support missions would have maps showing protected sites such as hospitals and mosques. If commanders concluded that enemies were operating from a protected site, they would follow procedures designed to minimize civilian casualties. That would generally mean surrounding a building with troops, not blowing it to bits from the air.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T21:18:44.071+03:00", "highlightTitle": ""}