{"organizations": ["GE Free Report"], "uuid": "9bfe91abe4e74b83630e3a43bafed05eca04c3d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00402/ge-free-report-gets-backing-from-anti-vivisection-group.htm", "country": "US", "title": "GE Free Report gets backing from Anti-Vivisection group", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "GE Free Report gets backing from Anti-Vivisection group", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:43:00.000+03:00", "replies_count": 0, "uuid": "9bfe91abe4e74b83630e3a43bafed05eca04c3d5"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00402/ge-free-report-gets-backing-from-anti-vivisection-group.htm", "ord_in_thread": 0, "title": "GE Free Report gets backing from Anti-Vivisection group", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GE Free Report gets backing from Anti-Vivisection group Friday, 23 October 2015, 10:43 am Press Release: GE Free NZ \nGE Free Report gets backing from Anti-Vivisection group \nA report released today by GE Free NZ highlights the many faults with 15 years of research on the genetic engineering of animals in NZ. The New Zealand Anti-Vivisection Society (NZAVS) are applauding the report as it shows how animal based research is unnecessary, failing and is the wrong direction for any true developments in human health. \n“The success rates of GE experiments on animals in NZ is profoundly low. In one experiment to produce goats that lactated a human protein researchers transferred 150 genetically modified embryos into females. Less than 3% of these successfully provided offspring that produced the desired protein. The research methods clearly aren’t working here” said NZAVS Executive Director Stephen Manson. \n“Not only do the methods an extraordinarily high failure rate at producing the product but when it can be produced it has failed in human clinical trials. As the report mentions, recently when human proteins produced in this manner reached the stage of being given to people the trials have had to end early as they produced lung distress and severe wheezing in people.” \nThe report states that there are already non-animal methods for getting the proteins that researchers have been trying to obtain via genetically engineering animals. As well as not requiring the use of animals these methods have the advantage of already being in commercial use. \n“Not only is this research failing miserably but it is also completely unnecessary due to the non-animal methods able to be used. There are many other fields of research that tax payer money could be better spent on that would actually produce something that will help people. This is fifteen years of research with nothing to show for it. It is long past time that they cut their losses and stopped.” Mr Manson added. \nRead the full report here – http://www.gefree.org.nz/assets/pdf/GE-Animals-in-New-Zealand.pdfends \nends", "external_links": [], "published": "2015-10-23T00:43:00.000+03:00", "crawled": "2015-10-23T03:36:46.368+03:00", "highlightTitle": ""}