{"organizations": [], "uuid": "7dd76a440159624a35f81660038bf61a684498f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/current-events/50981-deadly-fraud-american-exceptionalism.html", "country": "US", "title": "The Deadly Fraud of \"American Exceptionalism\"", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "The Deadly Fraud of \"American Exceptionalism\"", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T02:36:00.000+03:00", "replies_count": 0, "uuid": "7dd76a440159624a35f81660038bf61a684498f5"}, "author": "LongWinded", "url": "http://defendingthetruth.com/current-events/50981-deadly-fraud-american-exceptionalism.html", "ord_in_thread": 0, "title": "The Deadly Fraud of \"American Exceptionalism\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Deadly Fraud of \"American Exceptionalism\" User Name Current Events Current Events Forum - Latest political news and events 2 Thanks Quote: . . . For its part, the US said it wasn't us, then said it might have been us, then said the hospital was a nest of Taliban fighters - a claim the doctors dispute vehemently - before saying Afghan officials asked us to do it. Yesterday, President Obama personally apologized to Dr. Joanne Liu, the organization's international president, for the attack. Doctors Without Borders is not having it, and is not mincing words. Immediately after the attack, the organization's General Director, Christopher Stokes, said, \"We reiterate that the main hospital building, where medical personnel were caring for patients, was repeatedly and very precisely hit during each aerial raid, while the rest of the compound was left mostly untouched. We condemn this attack, which constitutes a grave violation of International Humanitarian Law.\" The organization's Executive Director, Jason Cone, described it as the \"darkest couple of days in our organization's history,\" before going on to call the attack a \"war crime.\" After the apology, Dr. Liu demanded an independent investigation into the incident. Never fear, however: The Authorities are on the case. The Pentagon is going to investigate the Pentagon to see if the Pentagon obliterated a hospital in Afghanistan by bombing it with precision munitions fired from a massive gunship for more than an hour, incinerating civilians, children and doctors. Sounds legit. American Exceptionalism in full effect. Speaking of which, the 247th mass shooting in the United States during this current calendar year took place in Room 15 of Snyder Hall at Umpqua Community College in Oregon on October 1st. The man who did it shot down a roomful of students, including a professor and a woman using a wheelchair. A lady in the next classroom over with gray hair using a cane went to investigate when the noise began, and staggered back moments later covered in blood with part of her arm blasted away. \"Don't go in there,\" she said before collapsing. An Army veteran named Chris Mintz attempted to thwart the attack and was shot five times, on his son's sixth birthday. He survived his service and his deployments overseas intact, only to come home to a rain of gunfire in the 45th school shooting incident this year alone. . . . Nothing exceptional about Americans..we live by the sword, we die by the sword. Any fucking idiot can do that.", "external_links": [], "published": "2015-10-11T02:36:00.000+03:00", "crawled": "2015-10-11T13:36:25.167+03:00", "highlightTitle": ""}