{"organizations": [], "uuid": "52801d61399b2dcc74e499e57682e7cb87ca2aae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "defendingthetruth.com", "main_image": "", "site_section": "http://defendingthetruth.com/external.php?type=RSS2", "section_title": "Defending The Truth Political Forum", "url": "http://defendingthetruth.com/money-finance/51010-irs-doesn-t-give-damn.html", "country": "US", "title": "IRS doesn't give a damn.", "performance_score": 0, "site": "defendingthetruth.com", "participants_count": 1, "title_full": "IRS doesn't give a damn.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:39:00.000+03:00", "replies_count": 0, "uuid": "52801d61399b2dcc74e499e57682e7cb87ca2aae"}, "author": "roastpork", "url": "http://defendingthetruth.com/money-finance/51010-irs-doesn-t-give-damn.html", "ord_in_thread": 0, "title": "IRS doesn't give a damn.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The GOP's Campaign to Make You Hate The IRS Is Kind of Genius Quote: But people have even more reason to despise encounters with the agency these days, thanks to a concerted effort by Republicans in Congress to slash the tax collector's budget. From the front page of today's Washington Post: Since 2010, Republicans on Capitol Hill have slashed the IRS budget by $1.2 billion, or about 17 percent, adjusting for inflation. Just this fiscal year, $346 million was cut. ADVERTISEMENT By contrast, cuts across the rest of the government have been far more modest and concentrated. Between 2012 and 2014, automatic spending reductions shrank non-defense spending, as adjusted for inflation, by 1.3 percent, while IRS spending was chopped 5.6 percent, according to Scott Lilly, a budget expert at the Center for American Progress. Those budget cuts have made dealing with the IRS this tax season a true pain in the ass. As the Washington Post details, just four in ten callers to the IRS's help line are actually able to get assistance from a real human, while the number of unintentional hang-ups from an overworked phone system have ballooned. And the cuts are actually costing the government: thanks to a 5,000-person reduction in the agency's staff over the past four years, tax cheats can more easily skate by. Attacking the IRS is one of the simplest lines a politician can roll out. It's a favorite rhetorical turn for presidential candidate and senator Ted Cruz, who's said he'd like to \"abolish the IRS, take all 125,000 IRS agents and put them on our southern border,\" to applause at this year's CPAC. No IRS, the rich can do what they want....and they have a ready group of knee jerking emotional Pavlov dogs to cheer them on. Thanks from Camelot and Lyzza", "external_links": [], "published": "2015-10-13T00:39:00.000+03:00", "crawled": "2015-10-13T06:51:06.386+03:00", "highlightTitle": ""}