{"organizations": [], "uuid": "ab4e99a0169978298fa8b92552fb50d89736ca38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "https://larouchepac.com/sites/default/files/obama-poss-II.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/politics/2015/10/larouchepac-says-obama-can-and-must-be-ousted-this-week-2750886.html", "country": "US", "title": "LaRouchePAC says Obama can and must be ousted this week | Politics", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 3, "title_full": "LaRouchePAC says Obama can and must be ousted this week | Politics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:59:00.000+03:00", "replies_count": 2, "uuid": "ab4e99a0169978298fa8b92552fb50d89736ca38"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/politics/2015/10/larouchepac-says-obama-can-and-must-be-ousted-this-week-2750886.html", "ord_in_thread": 0, "title": "LaRouchePAC says Obama can and must be ousted this week | Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nObama Can and Must be Ousted This Week | LaRouchePAC\nThe situation is suddenly very ripe for President Obama’s immediate removal from office. In that same context, with her Benghazi testimony scheduled for Thursday, Oct. 22 before the House Select Committee, it is also to be expected that Hillary Clinton will soon be dumped as well.\nOver the weekend, President Obama was stung by four devastating attacks on his crimes in office. Most dramatically, new details continue to emerge from the Drone Papers , the leaked documents that show that President Obama, from his earliest days in office, was in charge of a global assassination program, run out of the White House Situation Room, in which thousands of people were targeted for assassination in Afghanistan, Pakistan, Yemen and Somalia, under Obama’s drone-kill program. An estimated 90 percent of the victims of this mass murder program were not even on the target lists, personally signed by Obama. They were, however, immediately classified as terrorists and enemy combatants to cover up the magnitude of the Obama crimes.\nThe Drone Papers were only first made public on Thursday, but already, Amnesty International has demanded a thorough Congressional investigation. More to the point, Lyndon LaRouche demanded over the weekend that Obama be immediately removed from office, either through impeachment or the invoking of the 25th Amendment—and then put on trial before a criminal court for mass murder.\nOn Sunday, the New York Times Magazine published a lengthy reprise of Seymour Hersh’s May 2015 expose of the fraud behind the Obama White House account of the murder of Osama bin Laden in 2011. Obama, then-White House counterterrorism advisor John Brennan, and others in the Obama inner circle, blatantly lied about the circumstances surrounding the killing of bin Laden , all to boost Obama’s re-election prospects at the expense of the truth. Obama and his team fabricated an elaborate Hollywood-style fable about the raid in Abbottabod, Pakistan, touting the CIA’s sleuth work, when the key information all came from a Pakistani officer who walked in with the precise location of the Al Qaeda leader—in return for the $25 million reward. The White House, typically, covered up the role of the Saudis, who paid for years for bin Laden’s safe keeping under the watchful eye of Pakistan’s ISI. The New York Times Magazine, while not fully corroborating the Hersh account, gave the first prominent American media coverage of the real story.\nThe highly-respected international organization Doctors Without Borders (MSF) escalated their campaign against Obama by issuing new charges and new evidence over the weekend that the US willfully bombed their hospital in Kunduz, Afghanistan, and then sent in heavy vehicles to plow over the evidence. An unnamed Pentagon source confirmed that MSF had “done everything right,” in documenting the location of the hospital so it was placed on an off limits list, made up of hospitals, schools and mosques that were never to be attacked, even if there was evidence of Al Qaeda or Taliban fighters in the immediate vicinity. This was another Obama mass kill operation, and it may be relevant that the bombing in Kunduz came at a point that MSF vowed to fight to defeat Obama’s signature Trans-Pacific Partnership deal, because it would deny life-saving generic drugs to half a billion poor people around the world.\nWith the Hillary Clinton testimony coming up, ABC News on Sunday morning aired a documentary expose of Obama, Clinton, Victoria Nuland and Ben Rhodes, for lying to the American people and covering up the Al Qaeda assault on the US compound in Benghazi, Libya on Sept. 11, 2012, where US ambassador Christopher Stevens and three other American officials were killed. The ABC broadcast mirrored Lyndon LaRouche and Jeffrey Steinberg’s Dec. 2012 National Press Club briefing, proving that Obama and Clinton knew, as the attacks were underway, that it was a premeditated, heavily armed Al Qaeda attack, conducted by the AQIM affiliated Ansar al-Sharia terrorist group. Nuland, Obama, Clinton and Rhodes, along with Susan Rice, were all implicated in the ABC story in the crafting of the lies about the Benghazi attack, knowing full well that the attack had nothing to do with any “spontaneous demonstrations” about the slandering of the Prophet Mohammed.\nThe second part of the same ABC broadcast featured an interview with former Rep. Peter Hoekstra, who chaired the House Intelligence Committee, and charged that Obama had betrayed Libyan leader Qadaffi, who had become a leading ally in the war against Islamist terrorists, and that the Obama Administration had trained and armed the very terrorists who had carried out the 9/11/12 Benghazi slaughter.\nThe Drone Papers alone constitute a clear criminal bill of indictment against Obama that goes far beyond the “high crimes and misdemeanors” standard for impeachment. Obama’s immediate removal from office is now the sanity test for the US Congress.\nThere is an opportunity, this week, to dump Obama and begin the process of restoring the United States to proper Constitutional rule, something that has been steadily eroded over the past 15 years of Bush and Obama. There is nothing more important to be acted upon, starting right now.", "external_links": ["http://feeds.feedburner.com//blogspot/https://larouchepac.com/20150513/seymour-hersh-article-screws-obama-saudis-bin-laden-death", "http://www.nytimes.com/2015/10/18/magazine/what-do-we-really-know-about-osama-bin-ladens-death.html", "http://www.youtube.com/watch?v=Tp34FuT-Rt4", "http://feeds.feedburner.com//blogspot/https://theintercept.com/drone-papers", "http://feeds.feedburner.com//blogspot/https://larouchepac.com/20151018/obama-can-and-must-be-ousted-week", "http://feeds.feedburner.com/~r/blogspot/zklEV/~4/Pjv0JJueGCk", "http://www.youtube.com/watch?v=f9QhZBf7kuY", "https://larouchepac.com/sites/default/files/obama-poss-II.jpg"], "published": "2015-10-20T21:59:00.000+03:00", "crawled": "2015-10-21T01:09:18.513+03:00", "highlightTitle": ""}