{"organizations": [], "uuid": "3a8b4221001f54e73decaeb57fc4396a13cd70b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scoop.co.nz", "main_image": "http://img.scoop.co.nz/stories/images/1509/scoop_placeholder.jpg", "site_section": "http://www.scoop.co.nz/storyindex/index.rss?s.c=PO", "section_title": "Scoop NZ - Politics", "url": "http://www.scoop.co.nz/stories/PO1510/S00208/connecting-the-dots-on-community-housing.htm", "country": "US", "title": "Connecting the dots on community housing", "performance_score": 0, "site": "scoop.co.nz", "participants_count": 0, "title_full": "Connecting the dots on community housing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:44:00.000+03:00", "replies_count": 0, "uuid": "3a8b4221001f54e73decaeb57fc4396a13cd70b4"}, "author": "", "url": "http://www.scoop.co.nz/stories/PO1510/S00208/connecting-the-dots-on-community-housing.htm", "ord_in_thread": 0, "title": "Connecting the dots on community housing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Connecting the dots on community housing Tuesday, 13 October 2015, 1:44 pm Press Release: Community Housing Aotearoa \nConnecting the dots on community housing \nCommunity housing providers are converging on Wellington next week to put a plan before the Government to get more Kiwis into warm, dry, affordable homes. \nThe meeting of 160 delegates from Government, local government, community housing organisations, commercial partners and tenant groups will happen at the Community Housing Aotearoa-Impact conference running from October 21 to 23. \nCHA Director Scott Figenshow says it is an opportunity to work together and find solutions to New Zealand’s housing crisis. \n“We are looking forward to seeing innovative solutions and a way forward in community housing delivery in this country. It is an opportunity for all interested parties to work together and connect the dots.” \nMinister of Social Housing Paula Bennett will open the conference and the closing address will be given by Minister of Finance, Bill English. Wellington Mayor, Celia Wade-Brown, will open the Friday 23 October sessions and joined by Auckland Deputy Mayor, Penny Hulse. \n“Every New Zealander has a right to warm, dry, safe, affordable and adequate housing – we are all working on ways to achieve this. The community housing sector is well placed to make sure New Zealanders are delivered this basic human right – we just need all the tools in place to do this,” Mr Figenshow says. \nPresenters include international social housing expert Sam Tsemberis, known as the ‘father of Housing First’, an innovative model to address homelessness. \nThe Australasian Housing Institute Awards for best practice will be presented in the evening of 22 October, showcasing this year’s award winning projects and people. \nThere will be forums on Pasifika housing and a Māori housing forum will be provided in association with CHA’s partner, Te Matapihi. \nScott Figenshow says one focus of the conference will be a discussion of the sector’s strategy – Our Place – which outlines the approach needed to provide homes for 50,000 more people by 2020. The Minister of Finance will be presented with this strategy before he closes the Conference. \n“It’s clear the Government is going through a learning process, and we want them to learn a lot faster, so we are finding ways to help them do this,” he says. \nHe says not-for-profit community housing providers are ideally placed to meet the different needs of New Zealanders. “We need to be looking at homes for people sleeping rough, and those needing extra support, right through to those able to pay market rent and those aspiring to home ownership.” \nScott Figenshow says the bottom line is New Zealand needs more affordable homes now and this conference is about pulling all the tools together that will achieve that goal. \nAreas of interest at the conference include: \n• The innovative New Zealand Housing Bond programme, including its initial implementation in Auckland. \n• The ghettoising of the poor and a generation of renters which has been sparked by unaffordable housing.Shamubeel Equab, an experienced economist, author, media commentator and a thought-provoking public speaker, will be offering his thoughts on the big fixes that are needed to boost community housing. \n• The pros and cons of addressing homelessness through a Housing First model, which moves people into permanent homes and then provides additional support to address why they are homeless. The father of this model, Sam Tsemberis, will talk about how this could be applied in New Zealand. \nCHA acknowledges the sponsorship of the following businesses and organisations: \nPlatinum sponsors: Absolutely Wellington City Council Me Heke Ki Poneke (principal sponsor); The Treasury; Ministry of Social Development; Ministry of Business, Innovation and Employment, Lifewise Trust. \nGold sponsor: Westpac and Bronze sponsors: Trusthouse, Property Group, BNZ, Beca , HNZCorporation and the NZ Coalition to end Homelessness. \n[ends] Community Housing Aotearoa \nOpening doorways to Community Housing \nCommunity Housing Aotearoa (CHA) is an Incorporated Society, which was established in 2004/5 as the national umbrella group for New Zealand's community housing sector. CHA provides information and training resources for members as well as advocacy for the sector as a whole. CHA and its member groups are intent on growing the capacity of the Community Housing sector and increasing the provision of housing options for those on low to moderate incomes in New Zealand. The New Zealand Housing Bonds programme has been introduced by CHA to facilitate housing delivery by registered community housing organisations at a low price point that works with the Income Related Rent Subsidy. CONTACT COMMUNITY HOUSING AOTEAROA Phone - +64 4 385 8722 Postal Address - PO Box 11543 Wellington 6142 Physical Address - Level 1, 203 Willis Street, Wellington", "external_links": [], "published": "2015-10-13T03:44:00.000+03:00", "crawled": "2015-10-13T13:03:37.375+03:00", "highlightTitle": ""}