{"organizations": [], "uuid": "461ef5f1a19b92ed829eed29d6c30772c68f37e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "wrvo.org", "main_image": "http://mediad.publicbroadcasting.net/p/wrvo/files/styles/medium/public/201502/Capitol_Side_stgermh.jpg", "site_section": "http://www.wrvo.org/podcasts/term/10/rss.xml", "section_title": "WRVO-FM: Politics and Government : NPR", "url": "http://wrvo.org/post/one-dollar-land-deal-raises-questions", "country": "US", "title": "One dollar land deal raises questions", "performance_score": 0, "site": "wrvo.org", "participants_count": 1, "title_full": "One dollar land deal raises questions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T10:52:00.000+03:00", "replies_count": 0, "uuid": "461ef5f1a19b92ed829eed29d6c30772c68f37e6"}, "author": "Karen DeWitt", "url": "http://wrvo.org/post/one-dollar-land-deal-raises-questions", "ord_in_thread": 0, "title": "One dollar land deal raises questions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "/ 3:52 \nQuestions continue about economic development practices by Gov. Andrew Cuomo’s administration, including the proposed sale of valuable piece of land from one state agency to another state entity for a dollar . \nU.S. Attorney Preet Bharara is reported to be probing contracts awarded as part of Cuomo’s Buffalo Billion project, with questions over the timing of campaign contributions to the governor, as well as criteria used to choose the vendors. \nThe investigation has led to new scrutiny of a deal that would allow the state’s energy agency to transfer a nearly 300 acre parcel of land in Saratoga County, in a high tech park, for $1 to the State University of New York’s Polytechnic Institute, using a third party entity known as Fuller Road Management. The market value of the land is estimated at $9 million. \nAs first reported in Politico New York, some of the board members of the New York State Energy Development Authority, or NYSERDA, objected. Board member Kenneth Daley, who is the head of the utility company National Grid, said he’d like an independent legal opinion before signing off on the deal. \n“Given the sensitivity of having a $9 million valued asset that will be transferred with no economic benefit back to NYERDA, and given some on going audits in, let’s just call it, the business, not related to NYSERDA, is it worth having an independent opinion on this particular issue?” Daley asked fellow board members. “I don’t have a view, but I think it’s a fair question that we should ask.” \nThe audits Daley is referring to are the ongoing federal probe of the Buffalo Billion contracts. Daley says he completely agrees with the strategy to further high tech economic development, but says the transfer raises a red flag. \nThere’s no indication that the federal investigation is in any way focused on dealings between the state energy authority and SUNY Polytechnic, although SUNY Poly has been subpoenaed as part of the Buffalo Billion probe. \nThe board decided to table the motion to sell the land. \nA spokesman for SUNY Polytechnic criticized Daley, saying he should have known that the deal was legitimate. The governor’s budget office had already allocated millions of dollars in state aid for SUNY Poly, and transferring the $9 million parcel of land for one dollar was part of that original deal. SUNY Polytechnic did not return a request for additional comment. \nMichael Farrar, with the independent Authorities Budget Office, says Daley did the right thing. \n“It is a board member’s responsibility to withhold making a decision until they feel they have enough information,” Farrar said. \nFarrar says he is not passing judgment on whether or not the one dollar land sale is appropriate or not. \nBlair Horner, with the New York Public Interest Research Group, says in general, there’s been “excessive secrecy” surrounding the Cuomo administration’s economic development projects. \n“Why is it run the way it is, why can’t the state just dole out these contracts,” Horner asked. “Why do you have to create these quasi governmental entities through which the money can flow?” \nHorner says the transactions use taxpayer money and should be set up in an “open and transparent way.\" \nHe says the public still is not clear on the financing of the massive rebuilding of the Thruway's Tappan Zee Bridge in the Hudson Valley, and whether tolls will rise. \nNYPIRG and other reform groups are calling for a review of the $1 land sale. \nCuomo was asked about the on going federal probe of the Buffalo Billion project, and says he “doesn’t know much about it.\" \n“Any questions should go to the U.S. attorney,” Cuomo said. \nBut Cuomo has defended the Buffalo Billion and other on going economic development projects, calling them a “phenomenal success.\" Related Program:", "external_links": [], "published": "2015-10-05T10:52:00.000+03:00", "crawled": "2015-10-05T19:47:06.716+03:00", "highlightTitle": ""}