{"organizations": [], "uuid": "184a2f43d7506bbaed1e1849c8b2cd7d51a5e49b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30318406/new-york-nonprofit-advancing-the-mission-of-people-with-disabilities-in-the-workplace", "country": "US", "title": "New York Nonprofit Advancing the Mission of People With Disabilities in the Workplace", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New York Nonprofit Advancing the Mission of People With Disabilities in the Workplace - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "184a2f43d7506bbaed1e1849c8b2cd7d51a5e49b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30318406/new-york-nonprofit-advancing-the-mission-of-people-with-disabilities-in-the-workplace", "ord_in_thread": 0, "title": "New York Nonprofit Advancing the Mission of People With Disabilities in the Workplace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Special Citizens\nSpecial Citizens, a New York City non-profit organization that has been supporting adults and children with Autism for over forty years, has become a leader in providing the individuals they support with an opportunity to join the workforce.\nNEW YORK , Oct. 21, 2015 /PRNewswire/ -- The fight for equality in the workplace among Americans with disabilities took a giant leap forward with the help of a Presidential Proclamation. President Barack Obama proclaimed October 2015 as National Disability Employment Awareness Month.\nPhoto - http://photos.prnewswire.com/prnh/20151021/279192\nThere has been a struggle in the past few decades for inclusion in the workplace for Americans with disabilities. Special Citizens , a New York City non-profit organization that has been supporting adults and children with Autism for over forty years, has become a leader in providing the individuals they support with an opportunity to join the workforce.\nSpecial Citizens is excited about having the President support this agenda. \"I think it is one of the most innovative things this administration has done for people with developmental and intellectual disabilities. It shows a level of innovation and commitment that will shape how employers include people with disabilities in their workforce and how people with disabilities benefit from being competitively employed.\" says Jessica Zufall , Chief Executive Officer of Special Citizens.\nSpecial Citizens provides day services for people with Autism including: Day habilitation, Pre-Vocation and Supported Employment. An individual can start in Day Habilitation, move on to Pre-Vocation and then to Supported Employment, if they choose to do so. While in Supported Employment individuals are connected with a job coach, and the job coach helps them to build relationships, build their resume and improve interview skills. If there is an employment opportunity, the job coach will shadow the individual, with the ultimate goal of long-term placement.\n\"I think anyone who has a desire to work, should work. Someone being able to work and contribute to their community and receive a paycheck greatly contributes to the quality of life for that person,\" says Zufall.\nHelping individuals with disabilities find and maintain employment requires work on both sides, from both the employers and agencies that support individuals with disabilities. \"I think employers need to be more aware of the abilities that people with disabilities have and what they can do to benefit their companies,\" says Katrina Potter , Pre-Vocation/Supported Employment Supervisor.\nPotter has a positive reflection on her involvement as a job coach: \"This has been a very eye-opening experience as to what they can do, how they interact with co-workers and their supervisor.\"\nAs more Americans with disabilities are eager to join the workforce, it is very beneficial for companies to educate themselves on the benefits of hiring adults with disabilities. \"On a business side, a for profit business gets certain tax incentives for hiring people with disabilities, so it would behoove them to be knowledgeable about those tax incentives and about providing a level of inclusion for someone who might not have had it before,\" says Zufall.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-york-nonprofit-advancing-the-mission-of-people-with-disabilities-in-the-workplace-300163958.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20151021/279192", "http://www.specialcitizens.org/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY34634&Transmission_Id=201510211446PR_NEWS_USPR_____NY34634&DateId=20151021", "http://www.prnewswire.com/news-releases/new-york-nonprofit-advancing-the-mission-of-people-with-disabilities-in-the-workplace-300163958.html"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T00:29:30.499+03:00", "highlightTitle": ""}