{"organizations": [], "uuid": "2b4ebcfee1675498816c796511a8e0b431818d10", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mlive.com", "main_image": "http://imgick.mlive.com/home/mlive-media/width620/img/lansing/photo/2015/09/18/18779716-large.jpg", "site_section": "http://feeds.feedburner.com/michigan-elections", "section_title": "Michigan Politics & Elections", "url": "http://www.mlive.com/news/kalamazoo/index.ssf/2015/10/ousted_rep_cindy_gamrat_6_othe.html", "country": "IL", "title": "Ousted Rep. Cindy Gamrat, 6 others set for candidates forum", "performance_score": 0, "site": "mlive.com", "participants_count": 1, "title_full": "Ousted Rep. Cindy Gamrat, 6 others set for candidates forum", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:49:00.000+03:00", "replies_count": 0, "uuid": "2b4ebcfee1675498816c796511a8e0b431818d10"}, "author": "Al Jones | ajones5@mlive.com", "url": "http://www.mlive.com/news/kalamazoo/index.ssf/2015/10/ousted_rep_cindy_gamrat_6_othe.html", "ord_in_thread": 0, "title": "Ousted Rep. Cindy Gamrat, 6 others set for candidates forum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nFENNVILLE, MI – A full house is expected to hear former Michigan Rep. Cindy Gamrat and six other candidates for 80th District representative at the Allegan County Republican Party's candidates forum Tuesday at 7 p.m. at Fennville High School. \nOusted lawmaker Gamrat is campaigning to regain her seat in the state Legislature by becoming the Republican Party nominee after a sex-and-coverup scandal that attracted national headlines. \nThe scandal resulted in her being expelled from the Michigan Legislature on Sept. 11 by an overwhelming vote of House members. \nGamrat, a Tea Party Republican who ran in 2014 emphasizing a stance on family values, had an extramarital affair with then-Rep. Todd Courser, a Republican from Lapeer. Their botched attempts to cover up their affair attracted a lot of attention. \nCourser resigned his seat in September. But, like Gamrat, is seeking re-election. \n\"We anticipate a full house,\" Allegan County GOP Chair Steve McNeal said Monday, referring to the 400-seat Fennville High School auditorium. \nThe chambers of Fennville's City Hall were packed on Sept. 8 when Gamrat had her first public gathering with constituents after news of the scandal circulated in August. \nOther candidates seeking election in the Republican primary Nov. 3 include Mary Whiteford, Eric De Witt, Bill Sage, James Siver, Jim Story and Kevin Travis. Shannon Szukala has bowed out of the race. \nAllegan County Commissioner Jim Storey and Mary Whiteford, who is vice president of the Allegan County Republican Party and was runner-up to Gamrat in the 2014 primary, are other well-known candidates in the race. \nThose attending the candidates forum will hear the executive committee of the Allegan County GOP pose questions to the seven candidates. \nThe winner of the primary will represent the party in the general election in March, running against Democrat David Gernant, a Plainwell retiree who is a former trial judge in Portland, Ore. \nAllegan County GOP Chairman Steve McNeal said the event will start with candidates providing 90-second opening statements that he said explain \"Who are you and why do you want to be our rep?\" \nThey will then be asked a series of 10 \"yes\" or \"no\" questions to let the party know their standing. That is to be followed by questions on current issues, he said, \"including a wide range of topics -- taxes, roads, immigration and those sorts of things.\" \nCandidates will also face other questions specific to their candidacy, McNeal said, before they each get 90 seconds to say why they should be the Republican nominee. \nThe forum is free and open to the public. Kalamazoo Gazette/MLive writer Al Jones may be contacted at ajones5@mlive.com . Follow me on Twitter at ajones5_al", "external_links": [], "published": "2015-10-12T20:49:00.000+03:00", "crawled": "2015-10-13T00:13:38.010+03:00", "highlightTitle": ""}