{"organizations": [], "uuid": "899d7d56ec56a45ec6db1b13aa3a5950d1325b99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "politicaloutcast.com", "main_image": "http://cdn2.politicaloutcast.com/wp-content/uploads/2014/12/jeb-bush.jpg", "site_section": "http://politicaloutcast.com/feed/", "section_title": "Political Outcast", "url": "http://politicaloutcast.com/2015/10/jeb-bush-is-the-end-near/", "country": "US", "title": "Jeb Bush--Is the End Near?", "performance_score": 0, "site": "politicaloutcast.com", "participants_count": 1, "title_full": "Jeb Bush--Is the End Near?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T07:07:00.000+02:00", "replies_count": 0, "uuid": "899d7d56ec56a45ec6db1b13aa3a5950d1325b99"}, "author": "Mack Stetson", "url": "http://politicaloutcast.com/2015/10/jeb-bush-is-the-end-near/", "ord_in_thread": 0, "title": "Jeb Bush--Is the End Near?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jeb Bush--Is the End Near? Posted 0 \nIt is hard not to think \"dynasty\" when you hear the Bush name in reference to a run for the White House. After Jeb Bush's dad and his brother served as president, it is not hard to imagine another Bush in the White House, whether or not you like Jeb (or any of the Bushes). \nBut the media has been buzzing with the news that Jeb Bush is cutting spending on his presidential campaign, including slashing salaries of staffers from top to bottom. With a little less than 100 days left until the first major Campaign event at Iowa, it seems Jeb Bush's campaign is trying to regain some ground. \nBloomberg.com reports: Bush's advisers, under pressure from their donors and from falling and stagnant poll numbers, have been discussing ways to retool the campaign in recent days, and came to the conclusion that a course correction was essential. While recent tangles with Donald Trump have energized the campaign, Bush's senior team recognized a more fundamental set of changes was required that didn't involve dealing directly with the party's surprising—and surprisingly durable—front-runner. \"The circumstances when we started the election were different,\" Bush told Pat Robertson in an interview at Regent University hours after news of the shakeup broke. \"I have not met a person that thought that Donald Trump would be the front running candidate at this point. God bless him for his success in that regard, we’ll see how long that lasts. But you have to adapt.” He said his new \"lean and mean\" campaign will allow him to do that. \"Every dollar we can save in overhead is a dollar that goes on television, goes on radio, goes on media, goes on voter outreach,\" Bush added. \nDoes this restructuring of campaign staff mean that the race is over for Jeb Bush? It is probably too early to tell, but he has gone from being frontrunner to being in fifth place. Tim will tell if the slashes to the campaign budget will turn things around for Bush.", "external_links": [], "published": "2015-10-26T07:07:00.000+02:00", "crawled": "2015-10-26T07:38:10.388+02:00", "highlightTitle": ""}