{"organizations": [], "uuid": "55b429db7c8b5e4b97271037bcdbe912b2192edc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30326492/flas-housing-market-shows-strength-in-september-2015", "country": "US", "title": "Fla.'s Housing Market Shows Strength in September 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Fla.'s Housing Market Shows Strength in September 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "55b429db7c8b5e4b97271037bcdbe912b2192edc"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30326492/flas-housing-market-shows-strength-in-september-2015", "ord_in_thread": 0, "title": "Fla.'s Housing Market Shows Strength in September 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Florida Realtors\nORLANDO, Fla. , Oct. 22, 2015 /PRNewswire/ -- Florida's housing sector continued its momentum with more sales, rising median prices and a tight inventory of homes for sale in September, according to the latest housing data released by Florida Realtors®. Closed sales of existing single-family homes statewide totaled 23,574 last month, up 13.4 percent over September 2014 .\n\" Florida's housing sector continues to show strength with more closed sales and an uptick in new listings,\" said 2015 Florida Realtors President Andrew Barbar , a broker with Keller Williams Realty Services in Boca Raton . \"September marked the 46 th month that statewide median sales prices increased year-over-year for both single-family homes and townhouse-condo properties. Sellers received a higher percentage of their original list price, with single-family homes getting on average 94.3 percent and townhome-condos getting 93.2 percent on average. It also took less time to make the sale in September: a median of 46 days for single-family homes and 53 days for townhouse-condos.\n\"Sellers should take advantage of the strong market conditions with rising median prices, while would-be buyers can benefit from interest rates that currently remain at historically low levels and greater access to mortgage financing.\"\nThe statewide median sales price for single-family existing homes last month was $199,900 , up 11.1 percent from the previous year, according to data from Florida Realtors Industry Data and Analysis department in partnership with local Realtor boards/associations. The statewide median price for townhouse-condo properties in August was $150,000 , up 5.1 percent over the year-ago figure. The median is the midpoint; half the homes sold for more, half for less.\nAccording to the National Association of Realtors® (NAR), the national median sales price for existing single-family homes in August 2015 was $230,200 , up 5.1 percent from the previous year; the national median existing condo price was $217,400 . In California, the statewide median sales price for single-family existing homes in August was $493,420 ; in Massachusetts , it was $365,000 ; in Maryland , it was $270,956 ; and in New York , it was $252,500 .\nLooking at Florida's townhouse-condo market, statewide closed sales rose last month with a total of 9,348, up 8.4 percent compared to September 2014 . The closed sales data reflected fewer short sales in August: Short sales for townhouse-condo properties declined 43 percent while short sales for single-family homes dropped 36 percent. Closed sales typically occur 30 to 90 days after sales contracts are written.\n\"The Florida real estate market continues to hum along,\" said Florida Realtors Chief Economist Dr. John Tuccillo . \"We're seeing increases in both sales and prices in virtually every metropolitan statistical area (MSA) and in both single-family homes and townhouses and condos. Inventory continues to decline and those declines have now reached homes at the $250,000 level.\n\"However, with pending sales down, mortgage accessibility increasing and interest rates due to rise, we think the market will even out as we go forward into 2016.\"\nInventory continues to tighten, with a 4.4-months' supply in September for single-family homes and a 5.2-months' supply for townhouse-condo properties, according to Florida Realtors. Most analysts consider a 6-month supply of inventory as the benchmark for a balanced market between buyers and sellers.\nAccording to Freddie Mac, the interest rate for a 30-year fixed-rate mortgage averaged 3.89 percent in September 2015 , down from the 4.16 percent average recorded during the same month a year earlier.\nTo see the full statewide housing activity reports, go to Florida Realtors Media Center at http://media.floridarealtors.org/ and look under Latest Releases, or download the September 2015 data report PDFs under Market Data at: http://media.floridarealtors.org/market-data\nFlorida Realtors ® , formerly known as the Florida Association of Realtors ® , serves as the voice for real estate in Florida . It provides programs, services, continuing education, research and legislative representation to its 140,000 members in 58 boards/associations. Florida Realtors ® Media Center website is available at http://media.floridarealtors.org .\nLogo - http://photos.prnewswire.com/prnh/20150302/178818LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/flas-housing-market-shows-strength-in-september-2015-300164102.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DC35032&Transmission_Id=201510221105PR_NEWS_USPR_____DC35032&DateId=20151022", "http://photos.prnewswire.com/prnh/20150302/178818LOGO", "http://www.xmlnews.org/ns/", "http://media.floridarealtors.org/market-data", "http://media.floridarealtors.org/", "http://www.prnewswire.com/news-releases/flas-housing-market-shows-strength-in-september-2015-300164102.html", "http://photos.prnewswire.com/prnvar/20150302/178818LOGO"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T19:28:12.515+03:00", "highlightTitle": ""}