{"organizations": [], "uuid": "f97bc0f3d6e17170462fa362628b4a5b34ea6981", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/78/697a9603c36994f3e827fea365bf9f/46618WideModern_InterestRates_130828.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://money.usnews.com/money/personal-finance/mutual-funds/articles/2015/10/09/4-ways-rising-interest-rates-will-affect-your-investments", "country": "US", "title": "4 Ways Rising Interest Rates Will Affect Your Investments", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "4 Ways Rising Interest Rates Will Affect Your Investments - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "f97bc0f3d6e17170462fa362628b4a5b34ea6981"}, "author": "USNews", "url": "http://money.usnews.com/money/personal-finance/mutual-funds/articles/2015/10/09/4-ways-rising-interest-rates-will-affect-your-investments", "ord_in_thread": 0, "title": "4 Ways Rising Interest Rates Will Affect Your Investments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "4 Ways Rising Interest Rates Will Affect Your Investments Stocks will continue to gain, but investors should be more choosy. And savings accounts will benefit. While stock investors don't necessarily need to fear rising interest rates, they should keep in mind that some sectors could fare better than others.\nBy Kira Brecht Oct. 9, 2015 | 9:00 a.m. EDT + More Brace yourself: Higher interest rates are on the way at some point this year or in early 2016. The $64,000 question, of course, is when will the Federal Reserve start the first cycle of interest rate hikes since 2006?\nInvestors have become accustomed to an environment of low interest rates. The Fed has kept its official interest rate near zero since December 2008 to support economic growth and bolster the U.S. economy in the wake of the global financial crisis.\nNow, the labor market has improved significantly, with the jobless rate at 5.1 percent in September. The central bank broadcast its intentions to start hiking rates this year in an attempt to move interest rates toward a more historically normal level. The Fed could increase rates at its December meeting or in early 2016.\nHigher interest rates can affect investors and consumers in a variety of ways, from simple bank savings accounts to home mortgages. Here is what you need to know about how higher interest rates will affect your pocketbook and portfolio:\nCash will earn higher returns. Savings accounts at banks and certificate of deposit returns have been negligible in recent years as the Fed's near-zero interest rate policy has punished savers. That trend is about to change. While bank and CD returns will likely move higher at a measured pace, savers will be able to generate a little more return on their cash. \"When rates go up, there are going to be winners and losers. Winners will be savers – people who invest in bank CDs and money market accounts. The losers will be borrowers, because the cost of borrowing will go up,\" says Ted Peters, CEO of Bluestone Financial Institutions Fund in Wayne, Pennsylvania, and a former board member at the Federal Reserve Bank of Philadelphia.\nLonger-dated bond holdings could be hurt . Some investors have stretched out to longer duration fixed-income securities in an attempt to lock in a higher yield in the current low-rate environment. Once the Fed begins raising rates, this could affect longer-dated bonds . \"Losers will be people who bought 30-year, fixed-rate bonds, because those values will go down,\" Peters says.\nInvestors may want to consider a shift in their bond maturities. \"An average bond maturity of 20-plus years will see about a 13 percent drop in price if rates increase from 3 percent to 4 percent,\" says Greg Ghodsi, managing director of investments at 360 Wealth Management Group of Raymond James in Tampa, Florida. \"For the past couple of years, we have become very defensive in our bond portfolios. You get defensive by buying shorter maturities. Shorter maturity equals lowers price volatility to interest rate changes. Our average bond maturities are usually eight to 10 years, but for the last few years we've moved to a one- to three-year average.\"\nStocks can continue to gain, but investors may need to be choosy . Stock investors don't necessarily need to fear rising interest rates, but some sectors could fare better than others. \"While there may be some near-term volatility when the Fed raises rates, it is usually a sign the economy is functioning reasonably well,\" says Scott Kim, director of research at Kellner Capital in New York. \"In the previous prolonged cycle of interest rate hikes from June 30, 2004, to June 29, 2006, the total return for the [Standard & Poor's 500 index] was 15.5 percent.\"\nRising rates will help bank stocks , especially community banks and those with a small capitalization, Peters says. \"One of the reasons we are bullish on small banks is because when rates rise, banks will make more money because they will have more core deposits, which are very relationship-oriented. Two stocks in that space that we like are Legacy Texas Financial Group (ticker: LTXB) because it is an asset-sensitive bank, and the Bank of the Ozarks (OZRK),\" Peters says.\nOther sectors can also benefit from rising interest rates. \"We are looking at the banking, energy, consumer discretionary and the technology sectors since they can do well in this type of market. In addition, we would recommend considering investments in physical commodities and real estate, since they should also perform well in a rising rate environment,\" Ghodsi says.\nHigher rates can hurt other sectors that are sensitive to rising rates. \"Utilities, consumer staples and some real estate investment trusts will not do well in a rising interest-rate environment,\" Ghodsi says.\nBorrowing costs will rise . Consumers will be faced with higher borrowing costs when the Fed begins to hike rates. For homebuyers considering a fixed- or floating-rate mortgage , it is important to understand how rising rates can affect these choices. The most immediate impact of a Fed rate hike will be on loans tied to short-term or floating-rate debt, says Brian Rehling, the St. Louis-based co-head of global fixed income strategy at Wells Fargo Investment Institute.\nInvestors would be wise to take the time now to examine their portfolios and loans to consider appropriate shifts with the shifting winds in the interest rate environment.\nTAGS: investing money Federal Reserve interest rates mortgages bonds", "external_links": ["https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe0fq2%3Fsrc=usn_gp", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZe0fq2%3Fsrc=usn_fb", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZe0fq2%3Fsrc=usn_li&title=4%20Ways%20Rising%20Interest%20Rates%20Will%20Affect%20Your%20Investments&summary=Stocks%20will%20continue%20to%20gain%2C%20but%20investors%20should%20be%20more%20choosy.%20And%20savings%20accounts%20will%20benefit.&source=U.%20S.%20News", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZe0fq2%3Fsrc=usn_tw&via=usnews&text=4%20Ways%20Rising%20Interest%20Rates%20Will%20Affect%20Your%20Investments", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZe0fq2%3Fsrc=usn_rd&title=4%20Ways%20Rising%20Interest%20Rates%20Will%20Affect%20Your%20Investments", "http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZe0fq2%3Fsrc=usn_su"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T16:30:23.801+03:00", "highlightTitle": ""}