{"organizations": [], "uuid": "238411fa749409ef462ad6d895e192facf32df41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/politics", "section_title": "Politics | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/13/small-business-sme/govt-extends-sme-contract-protections", "country": "US", "title": "Govt extends SME contract protections", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "Govt extends SME contract protections | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:18:00.000+03:00", "replies_count": 0, "uuid": "238411fa749409ef462ad6d895e192facf32df41"}, "author": "Michael Roddan", "url": "https://www.businessspectator.com.au/news/2015/10/13/small-business-sme/govt-extends-sme-contract-protections", "ord_in_thread": 0, "title": "Govt extends SME contract protections", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Turnbull government has agreed to amendments for the extension of unfair contract term protections to small businesses and will provide $1.4 million to the consumer watchdog to support businesses transitioning to the new arrangements.\nThe bill, which passed the senate earlier this month with a number of changes, will help protect small business with less than 20 employees from unfair contracts with bigger corporations, extending protections that have applied to consumers.\nThe changes mean businesses will be protected under the provisions if the upfront price of the contract is less than $300,000, up from the previously proposed threshold of $100,000, for contracts shorter than a year or under $1 million for contracts longer than 12 months.\n“Small businesses have often faced the same vulnerabilities as consumers and under this new change will receive protections when offered ‘take it or leave it’ contracts,” Minister for Small Business and Assistant Treasurer Kelly O'Dwyer said today.\n\"This is a government that wants to get off the back of small business and ensure small businesses can grow and succeed as they contribute to the economy and create local jobs.\"\nThe Council of Small Business Australia chief executive Peter Strong said the decision \"will be received with joy by many, many small businesses who have been at the mercy of some appalling practices from a small number of big businesses\".\n\"The fact that we need these changes shows that a destructive culture has developed in the largest landlords and particularly the largest retailers, which now must change,\" he said.\nMs O'Dwyer said the government was also providing the Australian Competition and Consumer Commission with $1.4 million to support businesses to transition to these new protections over a twelve month period.\n“As a result of these changes, Australia’s two million small businesses will have more time and more resources to invest in their business’ success, instead of navigating a confusing maze of standard form contract terms,\" Ms O'Dwyer said.", "external_links": [], "published": "2015-10-14T00:18:00.000+03:00", "crawled": "2015-10-13T08:31:47.724+03:00", "highlightTitle": ""}