{"organizations": [], "uuid": "cbd41b6750f604751c70e1a2d7f858cd9f39f812", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.vice.com", "main_image": "https://news-images.vice.com/images/articles/meta/2015/10/01/netanyahu-says-its-deja-vu-all-over-again-for-israel-at-the-united-nations-1443740864.jpg?crop=0.6920077972709552xw:1xh;0.14814814814814814xw,0xh", "site_section": "https://news.vice.com/topic/politics/page/0", "section_title": "Politics | VICE News", "url": "https://news.vice.com/article/netanyahu-says-its-deja-vu-all-over-again-for-israel-at-the-united-nations", "country": "US", "title": "Netanyahu Says It's 'Deja Vu All Over Again' for Israel at the United Nations", "performance_score": 0, "site": "vice.com", "participants_count": 1, "title_full": "Netanyahu Says It's 'Deja Vu All Over Again' for Israel at the United Nations | VICE News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "cbd41b6750f604751c70e1a2d7f858cd9f39f812"}, "author": "Samuel Oakford", "url": "https://news.vice.com/article/netanyahu-says-its-deja-vu-all-over-again-for-israel-at-the-united-nations", "ord_in_thread": 0, "title": "Netanyahu Says It's 'Deja Vu All Over Again' for Israel at the United Nations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Israeli Prime Minister Benjamin Netanyahu delivered a typically blistering and sardonic speech at the United Nations on Thursday, a day after the Palestinian flag was raised in front of the organization's New York headquarters and Palestinian President Mahmoud Abbas declared to world leaders that he no longer felt bound to observe the Oslo Accords.\nNetanyahu, who began by recalling his time three decades ago as Israel's ambassador to the UN, spent much of his lengthy speech to the General Assembly lambasting member states for their support of the Iran nuclear deal.\n\"This deal doesn't make peace more likely,\" he said. \"By fueling Iran's aggressions with billions of dollars in sanctions relief, it makes war more likely.\"\n\"This deal will treat Iran like a normal country even if it remains a dark theocracy that conquers its neighbors, sponsors terrorism worldwide, and chants 'Death to Israel,' 'Death to America,' \" he added.\nCiting various examples of Iran's belligerence toward Israel, at one point the prime minister paused for what seemed like a full minute, staring out at representatives that he accused of remaining silent.\n\"Iran's rulers promise to destroy my country. Murder my people. And the response from this body, the response from nearly every one of the governments represented here, has been absolutely nothing!\" he declared. \"Utter silence! Deafening silence.\"\nThe speech came after nearly a week of remarks from officials from other countries applauding the Iran nuclear detente, which was reached between Tehran and the five permanent members of the Security Council — China, France, Russia, the United Kingdom, and the United States — as well as Germany. Even Pope Francis lent his support in remarks he delivered before the General Assembly late last week.\nRelated: Palestine Leader Scraps Oslo Accords with Israel as Flag Goes Up at the UN\nOn Wednesday, Abbas said that he no longer felt obligated to adhere to the Oslo Accords, which outlined a peace process that would affirm Palestinian independence and end the Israeli occupation of Palestinian territory. Abbas blamed Israeli intransigence and an unwillingness to abide by the principles of the accords, which had originally aimed to reach a peace agreement by 1999.\n\"We declare that as long as Israel refuses to commit to the agreements signed with us, which render us an authority without real powers, and as long as Israel refuses to cease settlement activities… they leave us no choice but to insist that we will not remain the only ones committed to the implementation of these agreements, while Israel continuously violates them,\" Abbas told world leaders.\nOn Thursday, Netanyahu leveled almost the same accusation at Abbas after insisting that Israel remains committed to achieving peace with the Palestinians.\n\"Despite the best efforts of six Israeli prime ministers — Rabin, Peres, Barak, Sharon, Olmert, and myself — the Palestinians have consistently refused to end the conflict and make peace with Israel,\" said Netanyahu. \"How can Israel make peace with a partner who refuses to even sit at the negotiating table?\"\nThe Israeli prime minister made waves earlier this year when he disavowed a commitment to establishing a Palestinian state while campaigning for reelection, and has drawn international criticism for increasing settlement activity in the West Bank. But at the UN he said that he remained committed \"to a vision of peace of two states for two peoples in which a demilitarized Palestinian state recognizes the Jewish state.\"\nThough Netanyahu said that Israel \"deeply appreciates\" US President Barack Obama's continued military assistance and described their differences on the Iran deal as \"a disagreement within the family,\" his intense focus on this schism in his speech belied this sentiment. Obama insists that Israel remains America's closest ally in the Middle East but has grown increasingly frustrated with Netanyahu, particularly after the Israeli leader gave a speech before Congress earlier this year lambasting the Iran deal shortly before a framework for an agreement was reached.\nNetanahyu also criticized what he called the disproportionate focus of member states on Israel's alleged transgressions in Gaza and the West Bank over those committed elsewhere in the world. Quoting former New York Yankees catcher Yogi Berra, he said it was \"deja vu all over again\" at the UN when it came to Israel.\nIn a lighter moment, the prime minister highlighted how Israeli know-how is seen across sectors like medicine and telecommunications.\n\"It's even on your plate, when you eat the delicious cherry tomato,\" he said. \"That too was perfected in Israel, in case you didn't know.\"\nBut there were no great developments in the speech, and for the most part Netanyahu simply offered another take on familiar themes.\nWhen asked for his reaction to the speech, Palestine's UN Ambassador Riyad Mansour replied, \"I didn't listen to it. What did he say?\"\nFollow Samuel Oakford on Twitter: @samueloakford", "external_links": ["https://twitter.com/samueloakford"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T06:28:26.155+03:00", "highlightTitle": ""}