{"organizations": [], "uuid": "2085cf07daaee09cb788428c7586bf569fa8a02c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/1003819325_1012_nv_lvrj_cli_0.jpg", "site_section": "http://www.reviewjournal.com/politics/slash-politics", "section_title": "Slash Politics | Las Vegas Review-Journal", "url": "http://www.reviewjournal.com/politics/slash-politics/5-things-expect-the-first-democratic-debate", "country": "US", "title": "5 things to expect at the first Democratic debate", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 23, "title_full": "5 things to expect at the first Democratic debate | Las Vegas Review-Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T22:56:00.000+03:00", "replies_count": 31, "uuid": "2085cf07daaee09cb788428c7586bf569fa8a02c"}, "author": "Steve Sebelius", "url": "http://www.reviewjournal.com/politics/slash-politics/5-things-expect-the-first-democratic-debate", "ord_in_thread": 0, "title": "5 things to expect at the first Democratic debate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At last, it's the Democrats' turn.\nAfter two formal Republican clashes, and some low-key sniping between candidates and their supporters, Democrats will get a chance to stand on the same stage to trade barbs and policy ideas at the CNN-sponsored debate at the Wynn Las Vegas Tuesday.\nHere's a quick roundup of Things To Expect at the First Democratic Debate:\n1. Hillary Clinton will come across as cool, competent and in control.\nThe author of that one book who hates Clinton wrote recently in the newspaper published by that other guy who hates Clinton that the former secretary of state is full of rage and ready to explode. The subtext is that Clinton allegedly believed she'd simply walk into the nomination while Republicans engaged in a flesh-tearing cannibal fest worthy of The Walking Dead . But that belies the fact that Clinton has been around politics long enough to know the road to the White House is nothing if not difficult. She may not have expected the level of support for her adversaries, both announced (Vermont Sen. Bernie Sanders ) and unannounced (potentially Vice President Joe Biden ), but she knew it wouldn't be a cakewalk. Now, she has to show the world she's ready for the job, even as she gets jabbed from her left by Sanders and former Maryland Gov. Martin O'Malley and her right by pretty much all the Republicans.\n2. Bernie Sanders will show the world what a democratic socialist looks like.\nSanders has never shied away from the word socialist, but more to the point, he's never shied away from the ideas behind the word, either. Sanders said in an uncharacteristically policy-laden interview on Meet the Press Sunday that he would contrast his consistency in supporting liberal policies with Clinton's shifting stances on some of the them . It will be interesting to hear how Clinton will respond, for example, when asked about the repeal and/or restoration of the Glass-Steagall Act, which her husband signed into law in 1999 over Sanders' objections. Or Clinton's vigorous defense of free trade in light of Sanders' objections to the job losses that result from those policies. It will be equally interesting to watch Sanders defend the high cost of his Medicare-for-all, single-payer health care system from the expected objection that it's just too expensive.\n3. Yes, there is such a person as Martin O'Malley, and yes, he is running for president.\nThe guitar-strumming former governor is hovering at around 1 percent in the polls, which is too bad, since his policy proposals for issues are some of the most detailed of any candidate in either party. Like Sanders, O'Malley is a progressive. Unlike Sanders, O'Malley hasn't found a way to connect with voters, inspire overflow crowds at rallies around the country or land talk time on the national Sunday interview shows. But when he does – for example, on this weekend's PoliticsNOW on 8NewsNow – he gives solid, well-considered answers to questions. Doing that before a national audience for the first time might change the numbers.\n4. There's no Trump.\nOn the Republican side, many viewers tuned in to see Donald Trump 's act, because one never knows what the real estate developer might say, who he's going to insult next, or what secrets of the political-industrial complex he might unveil. But comparisons between Trump and Sanders are overwrought; Sanders has been saying the same things not just for the entire campaign, but for an entire career in politics. His convictions have been a part of his political identity for decades; Trump only recently acquired a political identity. And while both candidates appeal to voters who are sick of the same old tired, polished, poll-tested answers to questions, there's light-years of difference between them. (Take capitalism, for example. Trump personifies it, while Sanders in that Meet the Press interview eschews it. Sanders' answer apparently shocked the delicate establishmentarian sensibilities of the Washington Post's Chris Cillizza, who declared Sanders' candidacy dead . Instead, let's hope a knee-jerk defense of the conventional wisdom that glosses over real questions about how economics sometimes treats American citizens with savage indifference dies instead.)\n5. We will hear more about policy than we did during the Republican debates.\nBecause the disagreements among the candidates comes down to significant differences over policy – trade policy, the appropriate times and circumstances that justify the use of military force, Wall Street reforms – there will be plenty of time to wonk out. That's what's going to make the Democratic debate more interesting (if less entertaining, ratings-wise) than the Republican contests of late. It might have been even more interesting had CNN elected to repeat what they did with the Republican debate by including right-wing radio talk show host Hugh Hewitt among the questioners. But we won't get to hear what would surely be sharp-edged, tough questions from the likes of Democracy Now host Amy Goodman , Truthdiggers Chris Hedges or Robert Scheer , linguist Howard Zinn or even MSNBC host Rachel Maddow . Scheduled to moderate are Anderson Cooper , CNN anchor Don Lemon , reporter Dana Bash and CNN en Espanol anchor Juan Carlos Lopez . Why no rabid left winger, CNN? Was Hewitt included to deflect anticipated criticism about bias in questions from right-wing viewers? Say it isn't so! But on the left, this is a thing .\n6. You can find out more about all candidates appearing in Tuesday's debate here:\nHillary Clinton\nBernie Sanders\nMartin O'Malley\nFormer U.S. Sen. Jim Webb, D-Va.\nFormer Gov. Lincoln Chaffee, D-R.I.\n7. And you can keep track of all the debate action on Tuesday by following me on Twitter (I'll be live-tweeting during the debate) and by checking back on SlashPolitics once the debate is over (I'll have an up-to-the-minute blog after the debate wraps, assuming I survive the \"spin room\"!) And don't forget to tune in to \"PoliticsNOW\" on 8NewsNow at 5:30 p.m. Sunday for more reactions and all the week's political news.\n10 takeaways from the first... Collins says he's running... Comment section guidelines The below comment section contains thoughts and opinions from users that in no way represent the views of the Las Vegas Review-Journal or GateHouse Media. This public platform is intended to provide a forum for users of reviewjournal.com to share ideas, express thoughtful opinions and carry the conversation beyond the article. Users must follow the guidelines under our Commenting Policy and are encouraged to use the moderation tools to help maintain civility and keep discussions on topic.\n ", "external_links": ["http://www.jameswebb.com/", "http://www.huffingtonpost.com/entry/anderson-cooper-cnn-debate-moderator_56152be9e4b0fad1591a2a4c", "http://www.lasvegasnow.com/news/politics", "https://martinomalley.com/", "http://www.chafee2016.com/", "http://newsbusters.org/blogs/nb/tim-graham/2015/10/12/leftists-demand-unapologetic-progressive-moderator-cnn-debate-anti", "http://www.truthdig.com/", "https://www.washingtonpost.com/news/the-fix/wp/2015/10/12/why-bernie-sanders-isnt-going-to-be-president-in-5-words/?postshare=6461444657992452", "https://www.hillaryclinton.com/", "http://nypost.com/2015/10/10/hillary-clintons-camp-she-could-have-a-serious-melt-down/", "https://berniesanders.com/", "http://www.nbcnews.com/meet-the-press/bernie-sanders-voters-will-contrast-my-consistency-hillary-clinton-n442411", "http://lasvegasreviewjournal.disqus.com/?url=http%3A%2F%2Fwww.reviewjournal.com%2Fpolitics%2Fslash-politics%2F5-things-expect-the-first-democratic-debate"], "published": "2015-10-12T22:56:00.000+03:00", "crawled": "2015-10-15T23:09:13.345+03:00", "highlightTitle": ""}