{"organizations": [], "uuid": "8fb9989641f1c6e996a55a1449fc926d29840b79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/169585/ap-political-news-video", "section_title": "AP Political Video - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30260643/family-of-man-aboard-sunken-freighter-files-100m-lawsuit", "country": "US", "title": "Family of man aboard sunken freighter files $100M lawsuit", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Family of man aboard sunken freighter files $100M lawsuit - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "8fb9989641f1c6e996a55a1449fc926d29840b79"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30260643/family-of-man-aboard-sunken-freighter-files-100m-lawsuit", "ord_in_thread": 0, "title": "Family of man aboard sunken freighter files $100M lawsuit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JASON DEAREN\nAssociated Press GAINESVILLE, Fla. (AP) - The family of a sailor aboard the cargo ship that sunk in roiling seas whipped up by Hurricane Joaquin filed a $100 million lawsuit Wednesday against the vessel's owner and captain.\nWillie Gary, a Jacksonville attorney representing the family of El Faro crew member Lonnie Jordan, filed the suit in Duval County Court.\nJordan was among the 33 men and women aboard the freighter that sunk Oct. 1 in 15,000 feet of water east of the Bahamas. The ship was carrying cars and other cargo en route to Puerto Rico when it lost engine power and the ability to steer away from the approaching Category 4 storm.\n\"Thirty-three people didn't have to die. Lonnie didn't have to die,\" said Gary, surrounded by Jordan's parents and friends in front of the courthouse.\nThe suit alleges that Tote Maritime and its captain, Michael Davidson, were negligent in choosing to sail a 41-year-old cargo ship into dangerous weather. Gary said Tote needs to place more emphasis on employee safety and less on profits.\nMichael Hanson, a spokesman for Tote, said the company refused to discuss individual lawsuits.\n\"The company remains fully focused on supporting the families and their loved ones,\" he said in a statement.\nThe lawsuit claims the decades-old ship was not fit to sail into rough seas.\nThe El Faro was scheduled for retirement from Caribbean duty and for new retrofitting for service between the West Coast and Alaska, company officials have said. Both the El Faro and its sister ship were slated to be replaced by two new ships.\n\"This case is about the oldest sin known to man, and that's greed,\" Gary said. \"You could've waited, the ship was not seaworthy and (Tote) should've known that, but you had to deliver cargo to get the green. And we won't stand for it,\" Gary said.\nThe National Transportation Safety Board has launched its investigation into the sinking, and is currently attempting to work with the U.S. Navy to retrieve the vessel's data recorder.\n ", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T21:10:18.545+03:00", "highlightTitle": ""}