{"organizations": [], "uuid": "c3eb0ede41c3f871df0d71ea58edbe01729c56dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30227326/save-the-children-appeals-for-help-to-assist-families-impacted-by-flooding-in-south-carolina", "country": "US", "title": "Save the Children Appeals for Help to Assist Families Impacted by Flooding in South Carolina", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Save the Children Appeals for Help to Assist Families Impacted by Flooding in South Carolina - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "c3eb0ede41c3f871df0d71ea58edbe01729c56dd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30227326/save-the-children-appeals-for-help-to-assist-families-impacted-by-flooding-in-south-carolina", "ord_in_thread": 0, "title": "Save the Children Appeals for Help to Assist Families Impacted by Flooding in South Carolina", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Save the Children\nCOLUMBIA, S.C. , Oct. 9, 2015 /PRNewswire-USNewswire/ -- Save the Children, which has been working in South Carolina since 2003, is seeking public support to expand its emergency response operations in the state and assist more than 2,000 children impacted by severe flooding, including several hundred children that have been forced from their homes.\nSave the Children currently manages early childhood development and school-based literacy programs in five counties, serving over 4,800 children, and many of its programs have been impacted by the severe flooding. Save the Children has brought additional emergency response experts to the state to assist its state staff and has set up an emergency operations center outside of Columbia to coordinate its response efforts.\n\"We are currently helping address the needs of families and children in shelters and child care centers in many of the state's hardest hit counties, and we are preparing to expanding our response to the additional areas along the coast that may be flooded this weekend should the need arise, and we are asking for additional support so we can expand our current efforts in the affected areas\" said Anna Hardway , the emergency response team leader in South Carolina .\nThe agency plan to reach 3,150 people, including 2,000 children in 50 day care centers, 200 children in shelters and 700 homeless youth. In addition, Save the Children has opened a child-friendly space at a large, school-based shelter in Clarendon County so that children there have a safe place to play and are supported by trained adults as they deal with stress and uncertainty.\n\"We also anticipate offering aid to 250 adults in shelters, including displaced families, single mothers and grandparents caring for young children,\" said Hardway. \"Our staff experts are on the scene today, distributing relief supplies and continuing to conduct rapid needs assessments in hard-hit areas. Based on these assessments, we are seeking a minimum of $500,000 in new support to scale up our immediate relief work and our longer-term recovery programs.\"\nHardway said the agency has pre-positioned supplies to affected areas to help create at least seven additional child-friendly spaces at shelters as shelter populations are relocated from schools to other sites and needs are identified. Many more shelters are now being assessed, prioritizing the high-need areas of Richland , Orangeburg , Charleston , Clarendon and Sumter .\nSave the Children is also encouraging parents and care-givers to help their children cope with the crisis. Here is a link on what parents and caregivers can do now to help their children cope.\nhttp://www.savethechildren.org/site/c.8rKLIXMGIpI4E/b.8479773/k.2264/How_to_Help_Children_Cope_with_a_Crisis.htm\nAttention media: Please include Save the Children on your list of organizations in South Carolina actively working to help children and families impacted by the severe flooding in the state.\nDedicated Web Address: http://www.savethechildren.org/carolinaflood\nDonation phone number : 1-800-728-3843\nFor more information, please contact: Mike Kiernan at 202-412-7579 or via email at mkiernan.media@gmail.com .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/save-the-children-appeals-for-help-to-assist-families-impacted-by-flooding-in-south-carolina-300157416.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DC24945&Transmission_Id=201510091523PR_NEWS_USPR_____DC24945&DateId=20151009", "http://www.savethechildren.org/carolinaflood", "http://www.savethechildren.org/site/c.8rKLIXMGIpI4E/b.8479773/k.2264/How_to_Help_Children_Cope_with_a_Crisis.htm", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/save-the-children-appeals-for-help-to-assist-families-impacted-by-flooding-in-south-carolina-300157416.html"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T23:06:12.763+03:00", "highlightTitle": ""}