{"organizations": [], "uuid": "d98fdb033845673576b5ee32e307702db8107226", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/qvm8pcb55j_mrdanielbugrenaabu.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/649030/1/northern-region-neglected-by-the-president-naabu.html", "country": "US", "title": "Northern Region neglected by the President-Naabu", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Northern Region neglected by the President-Naabu", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:00:00.000+03:00", "replies_count": 0, "uuid": "d98fdb033845673576b5ee32e307702db8107226"}, "author": "", "url": "http://www.modernghana.com/news/649030/1/northern-region-neglected-by-the-president-naabu.html", "ord_in_thread": 0, "title": "Northern Region neglected by the President-Naabu", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Politics | 13 October 2015 17:00 CET Northern Region neglected by the President-Naabu By GNA \nBole, Oct. 13, GNA - Mr Daniel Bugre Naabu, Northern Regional Chairman of the New Patriotic Party, has accused the President, Mr John Dramani Mahama, for neglecting the people in the region since he assumed the administration of the country, saying 'we have been neglected by our own brother.' \nHe said the region continued to wallop in abject poverty with no meaningful development taking place since the assumption of office by the President, stressing that there were no jobs for the teeming youths, water was a difficult commodity for many, yet the President felt adamant. \nMr Naabu who was addressing some youth groups in the Bole-Bamboi constituency said the NDC was not developing any place as always claimed, and alleged that what the NDC knew best was to siphon the resources of country into their private accounts, to the detriment of the ordinary Ghanaian. \nThe NPP Chairman had toured the constituency to interact with party officials and some youth groups as part of efforts to strategize towards the upcoming general elections. \nAt the Bole market, Mr Naabu expressed dismay at the scene of the market, noting that its deplorable nature did not befit a market for the hometown of the sitting president, and called for a change in the leadership of the country. \nHe advised people from the Northern Region, especially those from the Gonjaland, to eschew tribal politics and cronyism in the 2016 general elections, and vote massively for the NPP for competent leadership with a track record that could transform the nation. \nMr Naabu stated that the NDC government had deceived Ghanaians for far too long, and that it was time for the people to expose their lies and teach them a lesson by voting them out of power in the 2016 general elections. \nHe attributed the current economic crisis in the country to mismanagement of the economy and administrative incompetence, and urged the NDC to always listen to the wisdom and teachings of Dr. Mahamudu Bawumia, the Vice Presidential candidate of the NPP on matters of the economy. \nMr Naabu also accused the NDC for infiltrating into the NPP, causing internal wrangling and disunity, but urged the electorate to remain calm since the NPP would bounce back stronger to expose those moles. \nGNA", "external_links": [], "published": "2015-10-13T19:00:00.000+03:00", "crawled": "2015-10-13T18:12:04.329+03:00", "highlightTitle": ""}