{"organizations": [], "uuid": "81e49366f276a8db63f152c9ea86c0abd10d9da1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/46/20/fb3bef234d7dbc2d29b33b71d4f1/150914-nancy-pelosi-gty-629.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/house-democrats-budget-entitlements-214862", "country": "US", "title": "Democrats rule out entitlement changes in budget talks", "performance_score": 1, "site": "politico.com", "participants_count": 1, "title_full": "Democrats rule out entitlement changes in budget talks - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:05:00.000+03:00", "replies_count": 0, "uuid": "81e49366f276a8db63f152c9ea86c0abd10d9da1"}, "author": "Glenn Thrush", "url": "http://www.politico.com/story/2015/10/house-democrats-budget-entitlements-214862", "ord_in_thread": 0, "title": "Democrats rule out entitlement changes in budget talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Democrats are drawing an early line in the sand for this fall's budget negotiations, saying they will reject any effort to make changes to entitlement programs as part of the talks, according to a source familiar with the discussions. The declaration effectively limits the scope of the budget talks to a small-ball deal to fund the government for one year, possibly two. Republican senators said in a series of interviews they're more likely to agree to higher funding levels if they can slow down mandatory spending on Social Security and Medicare.\nBut congressional Democrats are making clear that there will be no changes to those benefits as part of a deal intended to eliminate the threat of a government shutdown from the presidential primary season, as well as stave off budget cuts from sequestration, which are restricting both military and domestic spending.\nDemocrats do not believe there is a realistic scenario to find more than about $80 billion in new spending for the military and domestic programs, potentially restricting budget negotiators to a deal that does not last through the election. That would mean lawmakers would have to strike another spending deal in the fall of 2016.\nCongressional Republicans want budget cuts or fee increases to pay for any increases in spending, and wringing billions out of the budget for a spending bill is always a difficult exercise. Republicans said they were still optimistic there might be a broader deal.\n“We’re not ready to throw in the towel and still believe there are smarter ways to reduce the deficit while providing multi-year certainty for defense planning,” said a senior GOP aide.\nThe budget talks are being conducted almost entirely at the staff level, including representatives from Senate Majority Leader Mitch McConnell (R-Ky.), Senate Minority Leader Harry Reid (D-Nev.), House Speaker John Boehner (R-Ohio) and House Minority Leader Nancy Pelosi (D-Calif.).\nThe high-flying Carson campaign By Katie Glueck\nThe negotiations have been complicated by Boehner’s impending resignation as speaker and have now been mostly decoupled from the battle to raise the debt ceiling. The current funding bill runs out on Dec. 11, but the debt ceiling must be lifted by Nov. 3, according to the Treasury Department. That makes it very likely that the spending package and debt limit increase will move independently of each other.\nAs part of a possible budget deal, Republicans had floated cost-of-living adjustments for Social Security and raising Medicare eligibility, which was first reported by CNN. But Democrats say that’s outside the bailiwick of the talks.\n“If there’s going to be any cuts and savings in Social Security it will be kept in Social Security so that the program will last longer,” said Senate Minority Whip Dick Durbin (D-Ill.). “It isn’t as if we are going to transfer money out of Social Security to cover our budget needs.”\nCongress finally agreed on a permanent change to Medicare payments to doctors in the spring after such an agreement eluded them since the 90s, raising hopes among Republicans that entitlements would again be on the table this fall. And, for the budding budget talks, the problem with avoiding entitlements is it creates much less incentive for fiscal conservatives to go along with a budget deal, Republican senators said.\n“We’ve got to get into mandatory spending, those are the cuts, the savings that stick. And most of us would trade higher discretionary spending to do it,” said Sen. Jeff Flake (R-Ariz.).\nInstead Democrats are open to revenue raisers like spectrum sales or the grab bag of money in the Senate-passed highway bill. But Republicans said Thursday that they were unlikely to raid the carefully crafted transportation bill to pay for other domestic spending.\n<div", "external_links": ["http://www.cnn.com/2015/10/13/politics/mitch-mcconnell-entitlement-changes-fiscal-talks/"], "published": "2015-10-15T15:05:00.000+03:00", "crawled": "2015-10-16T03:05:05.841+03:00", "highlightTitle": ""}