{"organizations": [], "uuid": "84e0e79e39f062527a357fbdc53e31431f59bb3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/pr/images/2015/Imaege_2015_10_18.jpg", "site_section": "http://www.zawya.com/rssfeeds/economy_politics.xml", "section_title": "Zawya.com - Economy & Politics News", "url": "http://www.zawya.com/story/Dubai_Now_first_unified_hub_for_smart_govt-ZAWYA20151018131138/", "country": "AE", "title": "'Dubai Now' first unified hub for smart govt", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "'Dubai Now' first unified hub for smart govt", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T16:51:00.000+03:00", "replies_count": 0, "uuid": "84e0e79e39f062527a357fbdc53e31431f59bb3f"}, "author": "", "url": "http://www.zawya.com/story/Dubai_Now_first_unified_hub_for_smart_govt-ZAWYA20151018131138/", "ord_in_thread": 0, "title": "'Dubai Now' first unified hub for smart govt", "locations": ["Dubai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gitex 2015 app has improved features \nDUBAI, UAE, 18 October 2015His Highness Sheikh Hamdan Bin Mohammed Bin Rashid Al Maktoum, Dubai Crown Prince and Chairman of Dubai Executive Council, launched Dubai Now: the first of its kind unified hub for smart government services on the first day of Gitex Technology Week 2015. Dubai Now enables customers to access multiple government services and conduct all transactions, through their smartphones. \nDubai Now was designed with active customer engagement at DSG's Customer Experience (CX) Lab. It is a very comprehensive hub for the public to communicate and interact with Dubai government entities, considering that it combines 22 government entity services under one app. All customers who have existing accounts with mPay app or MyID will be able to use their login to access Dubai Now easily and take maximum advantage of an array of the service packages that have been created based on customers' interests. These service packages are classified under 11 categories: payments and bills; housing and public transport; security and justice; health; driving; visas; educational services; Islamic services; business; and public services. \nDubai Now contains an interactive, smart dashboard that can be customized to have most used services in one place. It can then analyze the transactions and provide timely reminders and notifications, among other useful settings. Dubai Now contains most commonly used services such as paying traffic fines, Salik, Nol, Etisalat, Du, DEWA, some of Dubai Municipality and Dubai Customs services, donating to Al Jalila Foundation and Dubai Cares, getting flight information, booking taxis, accessing health services, searching for the closest pharmacy, obtaining GDRFA visa services, religious services including prayer timings and mosque locations; RERA rental increase calculator, knowing types of business activities, inquiring about and renewing trade licences, booking trade names, accessing emergency and business services, inquiring about public services including weather reports and postal services and getting familiar with educational services; among others. \nH.E. Ahmad Bin Humaidan, DSG Director General, said: \"The launch of this unified hub comes as part of our efforts to implement the initiative of HH Sheikh Mohammed Bin Rashid Al Maktoum, Vice President and Prime Minister of the UAE and Ruler of Dubai, to shift to smart government and ensure that Dubai becomes the smartest city in the world. It is also based on the directives of HH Sheikh Hamdan Bin Mohammed Bin Rashid Al Maktoum, Crown Prince of Dubai and Chairman of Dubai Executive Council; to provide a single interface and a single sign on for more comfort and convenience to customers.\" Bin Humaidan added: \"In line with DSG's strategy, which seeks to ease the lives of people and enable them to access services easily at any time, and as we work as a connected and collaborative government to meet the needs of our customers and ensure that our services and policies conform to their requirements; we are pleased to announce the launch of Dubai Now. This one hub will spare much of the time and effort of those dealing with Dubai government entities, thereby enhancing satisfaction and happiness in their daily lives.\" \n-Ends- \nFor further information, please contact:Orient Planet PR & Marketing CommunicationsP.O. Box: 500266", "external_links": [], "published": "2015-10-18T16:51:00.000+03:00", "crawled": "2015-10-18T17:06:37.056+03:00", "highlightTitle": ""}