{"organizations": [], "uuid": "bf52ed7600221cebb162973411a7e6d94f0e0a9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "http://d1u4oo4rb13yy8.cloudfront.net/facebook-zttkxtwhpz-1445685522.jpeg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/764553/in-the-mountain-shadow-shantaram-moves-from-mercenary-to-mercy", "country": "SG", "title": "In ‘The Mountain Shadow’, Shantaram moves from mercenary to mercy", "performance_score": 0, "site": "scroll.in", "participants_count": 1, "title_full": "In ‘The Mountain Shadow’, Shantaram moves from mercenary to mercy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T19:30:00.000+02:00", "replies_count": 0, "uuid": "bf52ed7600221cebb162973411a7e6d94f0e0a9e"}, "author": "Chandrima Pal", "url": "http://Scroll.in/article/764553/in-the-mountain-shadow-shantaram-moves-from-mercenary-to-mercy", "ord_in_thread": 0, "title": "In ‘The Mountain Shadow’, Shantaram moves from mercenary to mercy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In ‘The Mountain Shadow’, Shantaram moves from mercenary to mercy Those who were expecting a rerun of ‘Shantaram’ will be disappointed. Chandrima Pal · Today · 05:30 pm It is impossible to be objective about Gregory David Roberts’s work if you have ever lived and loved in the city he writes about. Bombay, not Mumbai, was the protagonist in his best-selling Shantaram , introduced, as in the many kitschy Hindi films he alludes to in his work, with a blast of screeching trumpets, drum roll, outlandish costumes and punch lines that get front benchers on their feet.Ten years later, in The Mountain Shadow , the drum rolls and trumpets have given way to the quiet of contemplative dusk on nameless hills on the fringes of the city. The front benchers, waiting anxiously for a rerun of the potboiler, are told that they are in the wrong theatre. Many things have changed Put aside the popcorn and the cola. Get out your incense and yantras, prayer mats and praying beads instead. The lovable Australian fugitive, who took the world on a never-ending ride around the never-ending Bollywood film that is Bombay while he kept running away from himself, is home. And he is not interested in running anymore, though he is obsessive about his bike.One of the biggest draws of Shantaram was its narrator – an enigmatic and charismatic protagonist whose life and story flirted with what was fictional and what wasn’t. Around the time of the launch of Shantaram , characters featured in his book were traced down by journalists – cabbies, slum dwellers, friends from the streets he called his home, frenemies. He had obviously taken artistic liberties with people, places. Roberts continues to do so in his keenly anticipated sequel. Though TMS has taken 10 years in the making, the sequel picks up the strand after two years in the narrative.But time is just what happens to Lin Baba when he is busy doing other things. So years whizz past in a second and the world around him changes so much in two weeks that he barely recognises it. By design? We can never tell.Just as one can never tell when the narrator is talking about the elusive writer Gregory David Roberts, and when he is writing about an Australian fugitive and freelance gangster on redemption road. It is a game. This cat and mouse. A game that Lin Baba/Shantaram’s loyal friends and enemies play with him all the time. Even his girlfriend and raison de étre, Karla. They set him up, exploit him, try to kill him, betray him, keep secrets from him and try to turn him into a murderous weapon.And yet, he manages to outsmart, outwit and outlove all of them. He is Shantaram after all, a Gandhian who will not say so in as many words. An incurable romantic who will live and die for his love, and a compassionate human being who will not kill the man who puts a reward on his head. He will simply maim him and set him free, growling: “Leave me alone.” Too good to be true Charming, yes? But the wholesome goodness that sugars The Mountain Shadow – despite the body count, arson, blood, gore, drugs, bikes, criminal conspiracies – can get a bit too saccharine at times. Maybe one is being too cynical, but when you look at how almost half of the 871-pager is devoted to Shantaram forgiving all those who wrong him, letting go and soul searching, and his rag-tag bunch of loyalists who are always willing to take a bullet for him, you wonder whether any of these people are for real.According to media reports, the author had rented out a suite in a South Bombay five-star for over a year, and restyled it to remind him of the slum where he spent his impressionable months in the city. In the book, the gangster, who is now an aspiring writer, rents an entire floor in an old South Bombay hotel, and restyles it to make himself at home. He even invites his friends and his girlfriend to take up adjoining rooms, creating a kind of a hippie commune.That’s when it hits you. One of the most endearing qualities of Shantaram was his compassion. Despite his scars, his wounds, his professional criminality, he was and remains an incorrigibly old-school do-gooder. And his hard-nosed peers, who respect him, mock him for what they think is his tragic flaw. But Shantaram, very early on in the book, decides to set his own heart free by refusing to fight other people’s battles. He is no longer a mercenary. But doles out mercy, metaphors and money from his Santa bag as if every day was the last day of Christmas. The Mountain Shadow moves like a glacier, carrying the moraine of wisdom accumulated over time and terrains. Shantaram’s world in the sequel has shrunk. The farthest he ventures from the microcosm of South Bombay is Khar and the Sanjay Gandhi National Park. There is also a seemingly pointless excursion to Sri Lanka on a quick, compromised mission. But his mind has travelled far from the first glimpse of Bombay when he arrived from Australia.Very early on in TMS he admits that when he first arrived in the city he was a stranger in the jungle. Now he was a beast of the jungle, sort of a modern-day Mowgli, who was nurtured by the creatures the forest, a band of brothers sworn to love and protect him.Unlike Shantaram that paid rich and honest tributes to Bombay, TMS is already looking outward and inward. There is of course the Bombay spirit, the Bombay sea, the Bombay heat and the Bombay songs. But the narrator speaks of communal tensions, politics and religion flirting in the back alleys and on bar tables of power, and the cosmopolitan fabric of the city wearing thinner by the day. Self-styled godmen and philosophers crowd his world, as do media tycoons and gangsters.The more he begins to see the light of goodness shine through the poorest of the poor, the lowlies and the scums of this Dickensian world, the more is his disenchantment with his immediate world. And so begins to shut out the extraneous noise, creating his own cocoon in Hotel Amritsar. It helps of course that the love that had eluded him for all these years returns to his arms in the form of Karla.Roberts’ publishers say he has retired from public life. He is rarely or never seen in social circles, has refused to give interviews to the media or even promote his book. Coincidence?At some point the book, Linbaba asks himself, “What do you want from me India?” From the looks of it, both the writer and his alter ego have found the answer already.Shantaram , Gregory Davies Roberts, Little, Brown.", "external_links": [], "published": "2015-10-25T19:30:00.000+02:00", "crawled": "2015-10-25T14:55:23.734+02:00", "highlightTitle": ""}