{"organizations": [], "uuid": "ea9cc3eb8ea29f8e6bc63c403497642aa4d8f212", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-68d4c3ab5ed97d2c863bbe5d617806b9.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/obama-wants-full-accounting-of-afghan-hospital-bombing/article/2573433?custom_click=rss", "country": "US", "title": "Obama wants 'full accounting' of Afghan hospital bombing", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Obama wants 'full accounting' of Afghan hospital bombing | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:40:00.000+03:00", "replies_count": 0, "uuid": "ea9cc3eb8ea29f8e6bc63c403497642aa4d8f212"}, "author": "Nicole Duran", "url": "http://www.washingtonexaminer.com/obama-wants-full-accounting-of-afghan-hospital-bombing/article/2573433?custom_click=rss", "ord_in_thread": 0, "title": "Obama wants 'full accounting' of Afghan hospital bombing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "President Obama is pushing the Pentagon for a full accounting of how the U.S. came to bomb a Doctors Without Borders clinic in Afghanistan over the weekend, which killed 22 medical personnel and civilians.\n\"The president expects a full accounting,\" White House spokesman Josh Earnest said. \"Details will not be whitewashed.\"\nThere are now three separate investigations into how the event occurred. NATO, which is leading the international military campaign there, will look into the tragedy as will the Pentagon and a joint U.S.-Afghan military team, Earnest said.\nGen. John Campbell, who leads U.S. and coalition forces in Afghanistan, said on Monday that U.S. planes were responding to an airstrike request from Afghan forces, which said they were under fire from Taliban fighters.\n  Report: Obama to meet families of Oregon victims Last week after the shooting took place, the president repeated his call for gun control.\nBy Daniel Chaitin • 10/05/15 10:01 PM \"An airstrike was then called to eliminate the Taliban threat and several civilians were accidentally struck,\" Campbell said Monday morning. \"This is different from the initial reports which indicated that U.S. forces were threatened and that the airstrike was called on their behalf.\"\nThe Defense Department's lead investigator, Brig. Gen. Richard Kim, will head up the Pentagon's investigation, Earnest said.\nAll three investigations are aimed at getting \"as much accuracy as possible around the details of what transpired\" in Kunduz in northern Afghanistan, Earnest said. He also stressed that the U.S. military does more than any other to avoid civilian casualties, in contrast to groups such as the Taliban that seek civilian targets.\nEarnest said he could not confirm President Obama will leave 5,000 additional troops in Afghanistan when he leaves office.\nObama will look at the \"longer term trajectory\" of success in Afghanistan in deciding whether to leave more troops than currently planned, Earnest said.\nAlso from the Washington Examiner Reid: Republicans 'puppets' of the NRA The minority leader urged his colleagues Monday to pass legislation to require mandatory background checks.\nBy Daniel Chaitin • 10/05/15 9:14 PM  ", "external_links": [], "published": "2015-10-05T17:40:00.000+03:00", "crawled": "2015-10-06T05:52:32.609+03:00", "highlightTitle": ""}