{"organizations": [], "uuid": "dc99b1874d30aeaba6a07b2065bb33cb388fc493", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dnaindia.com", "main_image": "http://static.dnaindia.com/sites/default/files/2015/10/03/381736-indrani1.jpg", "site_section": "http://www.dnaindia.com/", "section_title": "DNA India | Latest News, Live Breaking News on India, Politics, World, Business, Sports, Bollywood", "url": "http://www.dnaindia.com/india/report-indrani-mukerjea-attempts-suicide-inside-byculla-jail-condition-critical-but-stable-2131112", "country": "SG", "title": "Indrani Mukerjea attempts suicide inside Byculla jail, condition critical but stable", "performance_score": 0, "site": "dnaindia.com", "participants_count": 1, "title_full": "Indrani Mukerjea attempts suicide inside Byculla jail, condition critical but stable | Latest News & Updates at Daily News & Analysis", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T14:30:00.000+03:00", "replies_count": 0, "uuid": "dc99b1874d30aeaba6a07b2065bb33cb388fc493"}, "author": "dna | From the print edition", "url": "http://www.dnaindia.com/india/report-indrani-mukerjea-attempts-suicide-inside-byculla-jail-condition-critical-but-stable-2131112", "ord_in_thread": 0, "title": "Indrani Mukerjea attempts suicide inside Byculla jail, condition critical but stable", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indrani Mukerjea Former television honcho Indrani Mukerjea, the prime accused in the Sheena Bora murder case, allegedly attempted suicide by excessively consuming pills inside the Byculla women's prison, according to doctors at Sir JJ hospital, where she was admitted on Friday afternoon.\n\"Indrani was brought to the hospital at 2 pm. She was unconscious. We are treating her for poisoning,\" said Dr TP Lahane, the dean of Sir JJ group of hospitals. He confirmed that Indrani was on anti-epileptic pills since September 11. \"We are not sure if she had consumed all the pills together. The stomach wash has been sent to Kalina FSL for forensic analysis,\" said Dr Lahane.\nHe said that Indrani is still unconscious and admitted in the critical care unit under the medicine department. \"We have done her brain MRI, which is normal. Her vital parameters like body temperature, blood pressure, pulse (heart rate), and breathing rate (respiratory rate) are stable. She only has a problem in breathing. We are closely monitoring her condition,\" said Dr Lahane.\nAccording to medical experts, over dosage of anti-epileptic drugs (20-30 tablets) can lead to cardiac complications and create an emergency situation. Indrani, who had been remanded to judicial custody in the first week of September, is lodged at the women's prison in Byculla.\nBipin Kumar Singh, Inspector General (Prisons), said: \"On Friday afternoon, Indrani fainted and collapsed. She was rushed to the hospital and we are awaiting the reports from the hospital. There were some medicines that she was taking on the prescription of the doctors. But as per my knowledge, that medicine was stopped a few days back\". The jail authorities suspect that instead of taking her medicine daily, Indrani was hoarding them and finally had it at one go on Friday afternoon.\nA few days ago, Indrani's mother, Durga Rani Bora, who was 82 years old, passed away in Guwahati. It is not known whether the news of her mother's demise was communicated to Indrani. Durga Rani was bed-ridden for the past two years. Indrani's father Upendra Kumar Bora is also ailing.\nIndrani was arrested in first week of September, along with her ex-husband Sanjeev Khanna and driver Shyam Rai, in connection with the murder of her own daughter Sheena Bora in 2012. Indrani, a former media mogul, was arrested after her driver Rai, who was arrested under the Arms Act, spilled the beans about the sensational murder. According to the Mumbai police, Sheena was allegedly kidnapped from National College in Khar (West) by Indrani, Khanna and Rai and was allegedly strangulated to death inside a car in 2012. The trio then allegedly dumped Sheena's body at Pen and set it afire. Recently, the Maharashtra government transferred the case to the Central Bureau of Investigation.", "external_links": ["https://apis.google.com/js/platform.js", "https://plus.google.com/u/1/+somitapal"], "published": "2015-10-03T14:30:00.000+03:00", "crawled": "2015-10-03T04:22:44.136+03:00", "highlightTitle": ""}