{"organizations": [], "uuid": "200f3a98e7eb77921661150f7252bf86135768ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/politics/", "section_title": "Politics | ArcaMax Publishing", "url": "http://www.arcamax.com/politics/opeds/s-1738974?fs", "country": "US", "title": "Gina Barreca: 'Wanna bet?' Puts the future on the line | Op Eds", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "Gina Barreca: 'Wanna bet?' Puts the future on the line | Op Eds | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "200f3a98e7eb77921661150f7252bf86135768ad"}, "author": "arcamax.com", "url": "http://www.arcamax.com/politics/opeds/s-1738974?fs", "ord_in_thread": 0, "title": "Gina Barreca: 'Wanna bet?' Puts the future on the line | Op Eds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I don't gamble, but I make a lot of bets. Last week, on the day of my 24th wedding anniversary, I lost a bet to my husband.\nOur wager had nothing to do with the relationship (neither of us would bet against the house) but with the foliage: Michael declared the trees in our yard would not be nearly as vivid as they were two dozen years ago.\nMy husband watches the Weather Channel and mows the lawn, so that makes him an expert on climate change and privy to various subtle environmental clues invisible to the rest of us. He's originally from Union City, N.J.\nIn response to Michael's conviction concerning the exact hour maples would turn red, my own deep-rooted connection to the Earth began to emerge. Despite never going into nature any further than the back deck, I nevertheless decided I am One With The Seasons and knew better than he did. I'm originally from Brooklyn, N.Y.\nI find myself saying, \"You'll see. The yard will look exactly the way it did in our wedding pictures.\"\nHe smiles and says, \"Want to bet?\" I smile and nod. And so it begins.\nI grew up hearing and saying, \"Wanna bet?\" so often I thought it was one word.\nIt was a way the people in my family and neighborhood indicated polite yet informed disagreement. It wasn't a joke, either: It offered a challenge as profound and irrevocable as a knight flinging down a gauntlet to engage the worthiest of his opponents in a match.\nIt wasn't the prize, great or small, that was of value; it was the sheer triumph of getting it right that made the conflict worth the price of entry.\nHere are the kinds of things we would bet on: Would Uncle Nick tell Uncle Bill he took up the whole driveway with his lousy parking (5-1 odds)? How long would it take Grandma to say, \"How come you're not eating?\" once the immediate family of 117 sat down for the weekly Sunday dinner (3-1 it'd happen in under three minutes)? Would Johnny's wife finally get up when the other women started to clear the table or would she continue just to sit? (High-stakes; recommended for professionals only because the phrase \"I bet she's the kind who'll never pick up a plate\" whispered among the aunts was heavy with gravitas, as well as gravy.)\nIs it a surprise, then, that as a small child I started to make bets with myself?\nI'd bet myself that I could sneak down the staircase and watch TV without being caught. If I lost, sure I'd get punished, but if I won, I'd get to see Gene Barry in \"Burke's Law.\" It was worth a shot. It also taught me useful, if rudimentary, skills concerning stealth and regulated impassivity.\nI'd bet myself I wouldn't cry if my parents argued (more lessons about regulating impassivity) and I'd bet myself I could clean my room in 10 minutes, which at least got me started.\nWhen the first boy I fell for in high school broke up with me, I bet a friend $20 -- which was a hefty payoff in those days, given that I was making under a $1 an hour to baby-sit -- that I wouldn't pick up the phone to call him no matter how desperate I became.\nIt cost me $40 to realize I couldn't afford to be miserable. It was worth every dime.\nSo why is it more satisfying to trap a speculation inside the cage of bet than simply to disagree, allow the question to go free-range and see what happens?\nMy bet is that it gives us a sense of control over our otherwise chaotic lives. We pretend, even briefly, that we can predict and therefore control the future.\nAs a game, it enlivens ordinary moments by turning trivial incidents into competitions and transforms everyday experiences into ceremonial events.\nMy husband and I bet on each other and won; I bet on the color of the leaves and lost, but only a little. The winner chose fish for dinner, which I happily cooked.\nIt wasn't a gamble because I know he's the kind who picks up a plate.\nAbout The Writer\nGina Barreca is an English professor at the University of Connecticut, a feminist scholar who has written eight books, and a columnist for the Hartford Courant. She can be reached through her www.ginabarreca.com.\n(c)2015 The Hartford Courant\nVisit The Hartford Courant at www.courant.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["https://plus.google.com/share?url=http://www.arcamax.com/politics/opeds/s-1738974", "http://twitter.com/share?url=http://www.arcamax.com/politics/opeds/s-1738974&hashtags=ArcaMax", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/politics/opeds/s-1738974&h=Gina+Barreca%3A+%27Wanna+bet%3F%27+Puts+the+future+on+the+line"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-18T05:53:47.145+03:00", "highlightTitle": ""}