{"organizations": [], "uuid": "ff5fe4dbe3f7b18d35246d7ec30229de517f46d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/hlc5fsqeey_829784650_116797.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/648949/1/zanetor-rawlings-lauds-prez-mahama.html", "country": "US", "title": "Zanetor Rawlings Lauds Prez Mahama...", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Zanetor Rawlings Lauds Prez Mahama...", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T16:49:00.000+03:00", "replies_count": 0, "uuid": "ff5fe4dbe3f7b18d35246d7ec30229de517f46d0"}, "author": "", "url": "http://www.modernghana.com/news/648949/1/zanetor-rawlings-lauds-prez-mahama.html", "ord_in_thread": 0, "title": "Zanetor Rawlings Lauds Prez Mahama...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Politics | 13 October 2015 14:49 CET Zanetor Rawlings Lauds Prez Mahama... By citifmonline. com/Ghana \nDr. Zanetor Rawlings, daughter of Ghana’s former President, Jerry John Rawlings has praised President John Mahama for his stance on the judicial corruption scandal. \nPresident John Mahama after being petitioned by the journalist behind the investigative piece, Anas Aremayaw Anas, gave the Chief Justice the green light to deal with matter. \nAccording to her, to have allowed the showing of the Anas Aremeyaw Anas video, which captured some judges allegedly taking bribes, to the public, is a bold step. \nShe explained that the move shows that the Mahama-led administration has the political will to address the issues of corruption in the judiciary as compared to previous governments. \nSpeaking in an interview with Bernard Avle on The Ghana Report on Viasat One on Monday, the Klottey Korle Constituency parliamentary hopeful, indicated that “it takes a government that dares, to allow for a programme like that to be made public.” \n“It takes a willingness to address the issues that are affecting society to actually make something like that to be made public because there could have been easily some kind of an injunction placed on the showing of that,” she added. \nZanetor said “I think it’s in the bold step. If someone has done a wrong and it has been exposed then the right thing is to make sure that the correct channels are used to make sure that” they are dealt with in accordance with the provisions of the law. \n34 high and lower court judges are currently being queried following an investigative piece done by Anas and his Tigereye PI team. \nSo far, 22 and 7 of the lower and higher court judges respectively have been suspended.", "external_links": [], "published": "2015-10-13T16:49:00.000+03:00", "crawled": "2015-10-13T16:24:40.439+03:00", "highlightTitle": ""}