{"organizations": [], "uuid": "46b363bd6ef82aac106502798e6c5649edb404b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.voxy.co.nz", "main_image": "", "site_section": "http://voxy.co.nz//politics/feed", "section_title": "Voxy.co.nz - Politics", "url": "http://www.voxy.co.nz/politics/parents-feel-squeeze-school-funding-shortfall-hipkins/5/233920", "country": "US", "title": "Parents feel squeeze from school funding shortfall - Hipkins", "performance_score": 0, "site": "voxy.co.nz", "participants_count": 1, "title_full": "Parents feel squeeze from school funding shortfall - Hipkins", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T21:04:00.000+03:00", "replies_count": 0, "uuid": "46b363bd6ef82aac106502798e6c5649edb404b2"}, "author": "Fuseworks Media", "url": "http://www.voxy.co.nz/politics/parents-feel-squeeze-school-funding-shortfall-hipkins/5/233920", "ord_in_thread": 0, "title": "Parents feel squeeze from school funding shortfall - Hipkins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuseworks Media Friday, 9 October, 2015 - 06:04 \nParents are being forced to shell out more and more for their kids’ education as government underfunding really starts to bite, Labour’s Education spokesperson Chris Hipkins says. \n\"A survey released today confirmed what we already know, the vast majority of parents are struggling to cover the increasing cost involved in giving their kids a solid start in life. \n\"When in opposition, Bill English lambasted the then Labour government for underfunding schooling and putting more of the cost onto parents. In the 7 years he has been Minister of Finance he has made the problem worse. \n\"Government funding to schools simply isn’t keeping up with rising costs and increasing student needs. That means parents are increasingly being asked to dip into their pockets to help out. \n\"Parents have always contributed to their kids schooling, but the pressure to do so now is intense. When one in five parents report they are working two jobs to pay for their kids’ education, that’s got to be a wake-up call. \n\"It’s all a question of priorities. The National government is willing to throw millions of dollars at their charter school experiment, but they aren’t willing to adequately fund the state schools the vast majority of Kiwi kids attend. \n\"By law, New Zealand children are guaranteed a free school education. It’s time the government made good on that promise,\" Chris Hipkins said. \nAll articles and comments on Voxy.co.nz have been submitted by our community of users. Please notify us through our contact form if you believe an item on this site breaches our community guidelines .", "external_links": [], "published": "2015-10-08T21:04:00.000+03:00", "crawled": "2015-10-09T01:50:44.201+03:00", "highlightTitle": ""}