{"organizations": [], "uuid": "eb7ca298e57011286b2aafff7b28f7ba5c148592", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theverge.com", "main_image": "https://cdn0.vox-cdn.com/thumbor/DnywzgwiwiwDqbNQd3J-rKLiZGE=/38x0:1235x673/1600x900/cdn0.vox-cdn.com/uploads/chorus_image/image/47483219/Screen_Shot_2015-10-21_at_12.03.35_PM.0.0.png", "site_section": "http://www.theverge.com/tag/politics", "section_title": "Politics | The Verge", "url": "http://www.theverge.com/2015/10/23/9583838/joanna-newsom-divers-review", "country": "US", "title": "Joanna Newsom ​says​ goodbye to New York, one annotation at a time", "performance_score": 2, "site": "theverge.com", "participants_count": 1, "title_full": "Joanna Newsom ​says​ goodbye to New York, one annotation at a time | The Verge", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T18:00:00.000+03:00", "replies_count": 0, "uuid": "eb7ca298e57011286b2aafff7b28f7ba5c148592"}, "author": "Chris Plante", "url": "http://www.theverge.com/2015/10/23/9583838/joanna-newsom-divers-review", "ord_in_thread": 0, "title": "Joanna Newsom ​says​ goodbye to New York, one annotation at a time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I first heard Joanna Newsom in a telecom ad . Like most telecom ads, it had nothing to do with telecoms. Over recreated footage from the 2003 New York City blackout, Newsom sings: \"And the city that turns, turns protracted and slow / And I find myself toeing the embarcadero / And I find myself knowing the things that I knew / Which is all that you can know on this side of the blue.\" The camera drifts from one New Yorker to the next. They look like ghosts caught playing in the street by the last human's flashlight.\nI was 18, and I didn't understand a word of the song, just the way an 18-year-old art student likes their art. The commercial arrived the year following the 2003 blackout, my first year in New York City, and that song — and the rest of the tracks on Newsom's first album, The Milk-Eyed Mender — were my soundtrack. Divers , released today, is Newsom's fourth album and first since 2010's Have One on Me , a sprawling epic about love lost. Divers is a shorter album, but about more: love gained, time lost, and of course, New York.\nNew York University didn't have a campus when I attended, nor does it now. The official line of enrollment counselors is \"the city is the campus,\" but that's bullshit. The city treats students with the indifference it shows everyone. The closest New York University has to the college experience is Washington Square Park, a rectangle of land two avenues wide and three streets tall in the middle of Greenwich Village. Ensconced by a handful of NYU dormitories and the Silver Center, a joyless factory converted into joyless classrooms, it's like a quad, if a quad was shared by tourists, adults on their smoke break, dozens of runners, a collective of chess players, weed dealers, cops pretending to be weed dealers, performance artists, and a Ben Folds-type who plays the same Phillip Glass songs on the piano every day of every month of every year, forever and ever amen.\nWashington Square Park wasn't part of my college experience, enrollment office be damned. After spending fall nights freshman year laying on a bath towel in the dried out fountain, listening to Joanna Newsom on an iPod, the park became NYU's big college promise revoked. In my sophomore year, a multi-year project began, its purpose to move the massive cement fountain a few inches to align with the iconic arch on the north side of the park. Construction moved slowly, officially because expensive projects that overlap government and private universities take time, and unofficially because Washington Square Park is a notorious potter's field, an unmarked grave of over 20,000 indigent locals. Laws pertaining to the preservation of historical objects, I was told by an adjunct professor who spoke with the authority of a 24-year-old grad student, slows progress in cities like these, every accidental discovery inviting a half-dozen archeologists to scope out the site. I never saw this happen, but I also avoided the park, because it was so loud and ugly. The park's mysteries, for me, remained concealed.\nThe story beneath Washington Square\nNow Newsom, who kept me company on nights in the Washington Square fountain, is exhuming the bodies beneath it, just one noteworthy dig on an archaeological reckoning of the northeastern United States. Newsom is small, her voice is light, but her words have more power than all the bulldozers and backhoes in Manhattan, and for the first time, I understand them in these precious early listens.\nGenius, neé Rap Genius , is a lyrics website that allows user to write and upvote annotations. Originally designed for the rapidly spit, linguistically dense lyrics of hip-hop, it's a perfect match for Newsom, whose lyrics, like those of great rappers, are poetry set to music.\nHere's the first verse and a half of \"Sapokanikan,\" the album's first single:\n\"The cause is Ozymandian\nThe map of Sapokanikan\nIs sanded and bevelled\nThe land lone and levelled\nBy some unrecorded and powerful hand\nWhich plays along the monument\nAnd drums upon a plastic bag\"\nAnd here's an excerpt from the current annotation from Genius:\n\"She first references the famous poem \"Ozymandias\",whose cause is to remind readers that all of man's legacies fade over time. This ties into the song-long theme of Native American names and places, the first being the titular Sapokanikan. [...] Standing where the famous artist enclave Greenwich Village is now located, the land was cleared in the 1630s, described in an internal bout of alliteration reminiscent of Ys's \"Only Skin\". Shelley's poem \"Ozymandias\" concerns a monument of the once great pharaoh, now in ruins. While calling to mind the statue from Shelley, this is also referring to the arch standing today in Washington Square Park (and alluded to again later). The passage links the ancient indigenous village to the current occupants of the same space, noting that the same \"powerful hand\" that leveled the creations of history still plays its tune on our modern creations, too. In the song's video, Joanna is sitting in Washington Square Park during this section of the song.\"\nShe is. See for yourself.\nThat annotation is for a song from an album that isn't yet released, and it's more thoughtful, informed, and concise than any essay I wrote at NYU with the support of the massive Bobst Library, which sits on the south side of Washington Square Park and has its own relationships with ghoulish deaths conveniently erased by history. The annotation has't even begun to analyze the instrumentals, which change direction and scope by the breath. Most musicians write in beats per minute; Newsom writes in songs per minute.\nThe sheer abundance of music to hear and thoughts to digest would be overwhelming if not for Newsom's high, sing-songy voice that is a cross between your mother humming a lullaby and the voice of death telling you, \"Exhale; it's okay to go.\" To describe Newsom's sound is to pile up what must sound like backhanded compliments, but traditional praise fails her. She turns a single stanza into a graduate thesis on existence and love. From the title track Divers, Newsom sing:\nAnd in an infinite regress\nTell me why is the pain of birth\nLighter borne than the pain of death?\nI can't claim that I loved you first\nBut I loved you best\nNewsom's lyrics are mysterious without becoming a gimmick\nBy pairing the two — our trajectory through life, our truest love — you feel their inseparability. Newsom's music isn't some Lost -style mystery or lame ARG. Complexity is mandatory, because the ideas in Newsom's music would be too unwieldy otherwise.\nWith her music, every listen I feel new, and every moment I feel change. I am both comfortable, but never allowed to sit down and rest in this music. Take for example \"Anecdotes,\" which is like sets from different musicals being raised and lowered, faster and faster, never crashing into another but always coming close. And sometimes it's just her, the curtain warmer, singing softly and flawlessly. So many stories to tell, whispers this album, and so little time to live. So much shouldn't fit in so little time, and damned if Newsom doesn't argue against as much within the first minute of the first song:\nAnd Time, in our camp, is moving\nAs you'd anticipate it to\nBut what is this sample proving?\nAnecdotes cannot say what Time may do\nToday I turn 30. Like Newsom notes in \"Leaving the City,\" I too have left New York for something warmer, something slower, somewhere with cheaper rent. Washington Square, its history, and my shared history are — when I am not there — just a memory. One day, both the land and the memory will both be forgotten, which is sad and happy and terrifying and awesome. That mix makes Newsom's music irresistible.\nLike compass, Divers provides the listener the vaguest sense of place in the cosmos, but finding meaning and direction, that's up to us devotees, annotating lyrics on the internet to better appreciate life away from it. For some that may sound like a waste of time, but time, as Newsom sings, is merely what we make of it.\nI guess that telecom ad had a point. We are those New Yorkers wandering through the city without light: scared and anxious of what could happen next, wild and joyful to be in the present.\nDivers is now available.", "external_links": ["http://genius.com/7615704", "https://www.youtube.com/embed/3N3Va9B1RBE", "http://www.youtube.com/watch?v=8Z5UuGgf_ec", "https://www.youtube.com/embed/keke7BGzJPI?list=RDky9Ro9pP2gc"], "published": "2015-10-23T18:00:00.000+03:00", "crawled": "2015-10-23T17:09:43.439+03:00", "highlightTitle": ""}