{"organizations": [], "uuid": "c514b940e290cec3f2fae96617fac9dd8304557f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ketv.com", "main_image": "http://www.ketv.com/image/view/-/35719896/highRes/2/-/maxh/630/maxw/1200/-/15i9i5nz/-/Boehner-podium.jpg", "site_section": "http://www.ketv.com/9675468?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.ketv.com/politics/how-republicans-will-choose-the-next-speaker/35719714", "country": "US", "title": "How Republicans will choose the next speaker", "performance_score": 0, "site": "ketv.com", "participants_count": 0, "title_full": "How Republicans will choose the next speaker", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:31:00.000+03:00", "replies_count": 0, "uuid": "c514b940e290cec3f2fae96617fac9dd8304557f"}, "author": "", "url": "http://www.ketv.com/politics/how-republicans-will-choose-the-next-speaker/35719714", "ord_in_thread": 0, "title": "How Republicans will choose the next speaker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Deirdre Walsh"], "text": "By Deirdre Walsh CNN Senior Congressional Producer How Republicans will choose the next speaker UPDATED 5:31 AM CDT Oct 08, 2015 \nThe House Freedom Caucus, an influential group of conservatives, will back Florida Rep. Daniel Webster for speaker, several lawmakers said following a Wednesday afternoon meeting -- a blow to Rep. Kevin McCarthy in his bid for the position. \nThe decis... Chaffetz: I don't expect to win speakership \nUtah Republican Rep. Jason Chaffetz is running for House speaker -- but even he doesn't think he'll win in a key vote later this week. \n\"I want to fight to win, but at the same time, it's clear that Kevin McCarthy has the majority of support within our... Chaffetz challenges McCarthy for speaker \nRep. Jason Chaffetz on Sunday officially entered the race to replace House Speaker John Boehner. \nChaffetz, the Utah Republican who chairs the House Oversight and Government Reform Committee, is taking on his party's current No. 2 -- Kevin McCarthy. \nC... \nKevin McCarthy, the leading candidate to succeed John Boehner as House speaker, tried to walk back on Thursday controversial comments he made about a congressional investigation into the 2012 Benghazi terror attack. \nEarlier this week, McCarthy had pra... Leadership void has Hill Republicans worried \nThe tumult in the Republican Party -- with a presidential race growing increasingly nasty, chaos engulfing the House GOP and a fall full of legislative crises -- is fueling concern among party officials that they could blow their chance at 2016 if th... More \nReps. Kevin McCarthy, R-California, Jason Chaffetz, R-Utah, and Daniel Webster, R-Florida, are the three candidates vying for the post, and the winner becomes the favorite to become second in line to succeed the President of the United States. \nBut Thursday's vote inside the House GOP conference is just the first step. The candidate who gets the Republican party's internal nod still has to be approved by the full House of Representatives on October 29. And that's where things can get tricky. \nIf the Republican nominee can't garner 218 votes on the House floor, then Boehner will remain the speaker. And the potential for multiple rounds of votes on the House floor could open up the election to other candidates beyond the three that are in the race now. It would also prolong the deeply divisive and public process for House Republicans, who are hoping to chart a new path forward and prove they can make the dysfunctional Capitol work. \nHere's are the steps: \nCandidate Forum \nThe three candidates will make their pitch to GOP colleagues at a \"candidate forum\" on Thursday morning in a conference room in the basement of the Capitol. Each gets three minutes to make a speech before answering questions from members. \nHouse GOP Conference Secret Ballot \nAt noon, the 247 members of the House Republican conference gather in the ornate Ways and Means Committee room to vote. \nUnder the House GOP conference rules, the three candidates are not allowed to make their own speeches. Instead each can designate one supporter to make a three-minute address nominating them for the post. Then up to two additional supporters can speak for another minute each on the candidate's behalf. \nTo win the GOP nomination, a candidate needs a simple majority of all House Republicans -- or 125 votes. (That number could change if any House Republicans are absent or opts not to vote in the election.) \nBoehner is eligible to vote, but is unlikely to participate in Thursday's election. The delegate from American Samoa, Amata Radewagen, who doesn't get a vote on the House floor, does get to cast a vote for speaker inside the conference meeting. \nThree members serve as \"tally clerks\" and collect the ballots and count how many votes each candidate receives. \nOnce all the ballots are counted, a representative of the conference will announce the results, along with the vote totals. \nIf no candidate gets a majority of the conference on the first vote, a second ballot circulates with the names of the top two vote-getters, and a winner is announced after those ballots are counted. \nElection on the House Floor -- October 29 \nThe new speaker can't take the gavel from Boehner until the full House of Representatives votes. \nUnlike the private contest on Thursday, the floor vote is covered live by C-SPAN's television cameras inside the House chamber. \nEach member of Congress is called on in alphabetical order to stand and announce their choice for speaker. The winner must win the votes of a majority -- 218, if everyone in the House is present -- in order to win. \nThe vast majority of House Democrats are expected for to vote for former Speaker and current Minority Leader Nancy Pelosi. \nHouse Republican conference rules require that GOP members support their party's nominee on the floor, but many conservatives have ignored that rule in recent elections. That's where any drama will occur. \nIf the GOP nominee fails to reach get a majority, the contest on the House floor could go to multiple ballots. Boehner will remain the speaker until a majority of the House votes to elect a new candidate. \nThe last time it took more than one ballot to elect a speaker was in 1923 when it took nine ballots over the course of three days. \nAnd you don't need to be in the House to get the job. The Constitution does not require that the speaker be someone currently serving in Congress, but all who have been elected to the post have been House members. Former Secretary of State Colin Powell, Sen. Rand Paul and Sen. Jeff Sessions received votes in the January 2015 election. And two years earlier, David Walker, the former head of the General Accounting Office, received one vote.", "external_links": [], "published": "2015-10-08T13:31:00.000+03:00", "crawled": "2015-10-08T14:06:44.721+03:00", "highlightTitle": ""}