{"organizations": [], "uuid": "16472d0f9f7ef1877d30b84a1964e483bf10e294", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arcamax.com", "main_image": "http://www.arcamax.com/apple-touch-icon.png", "site_section": "http://www.arcamax.com/politics/", "section_title": "Politics | ArcaMax Publishing", "url": "http://www.arcamax.com/politics/opeds/s-1738975?fs", "country": "US", "title": "A Playmate's lament: No nudity? Say it ain't so, Hef | Op Eds", "performance_score": 0, "site": "arcamax.com", "participants_count": 1, "title_full": "A Playmate's lament: No nudity? Say it ain't so, Hef | Op Eds | ArcaMax Publishing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "16472d0f9f7ef1877d30b84a1964e483bf10e294"}, "author": "arcamax.com", "url": "http://www.arcamax.com/politics/opeds/s-1738975?fs", "ord_in_thread": 0, "title": "A Playmate's lament: No nudity? Say it ain't so, Hef | Op Eds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I was a Playboy centerfold in December 1979, the magazine's monthly circulation was around 5.6 million. Today, that has dropped to 800,000. Last year, the Playboy website dumped nudity. Clearly, something isn't working.\nBut I think Playboy founder Hugh Hefner's recent decision to drop nudity and only publish photos that are \"PG-13\" is patently the wrong thing to do. I don't think it's the direction Hef would take if he weren't being guided by his editors.\nI was around when Playboy changed its editorial concept and embraced full frontal nudity to compete with Penthouse. The pictures were down and dirty -- but that wasn't Hef's taste. His original concept, the nude \"girl next door,\" was what made the magazine great.\nThe early Playmates were not actresses or models, just very attractive women. They were accessible, friendly, smiling and sexy. I loved the golden years of Playboy in the '70s, when the girls were enticingly photographed in the nude.\nIf Playboy's plan is to run photos that are \"more like the racier sections of Instagram,\" as The New York Times reported, then count me out as a fan. I find it incredible that Playboy is following the herd mentality inspired by this social media platform.\nAnyone can snap an Instagram photo. It's much more difficult to photograph a woman and make her look like the images created by classic Playboy photographers Richard Fegley, Pompeo Posar and Arny Freytag.\nThis is all about the bottom line. Nudity was omitted from Playboy's website in 2014 to make the content \"safe\" for sharing on social media. As a result, according to the Times, the average age of the Playboy site's reader \"dropped from 47 to just over 30, and its web traffic jumped to about 16 million from about 4 million unique users per month.\"\nI'm not sure what to make of this.\nI know my fans are still out there because when I post my vintage Playboy photos, I receive a great response. I know there are still Playboy followers out there who appreciate Hef's original centerfold concept.\nI realize you have to change with the times. I understand the need for a magazine revamp. I just wish it wasn't at the expense of the glamorous, iconic Playboy Playmate image.\nSelfishly, I should be thankful. This means there will be a finite number of Playboy centerfolds and an even smaller number of Playmates who were Playboy Bunnies like me.\nAnd then she smiled.\nAbout The Writer\nCandace Jordan is a ChicagoNow blogger and authors the Candid Candace column in the Sunday edition of the Chicago Tribune, for whom this was written.\n(c)2015 Chicago Tribune\nVisit the Chicago Tribune at www.chicagotribune.com\nDistributed by Tribune Content Agency, LLC.\nShare Comment", "external_links": ["https://plus.google.com/share?url=http://www.arcamax.com/politics/opeds/s-1738975", "http://www.facebook.com/sharer.php?u=http://www.arcamax.com/politics/opeds/s-1738975&h=A+Playmate%27s+lament%3A+No+nudity%3F+Say+it+ain%27t+so%2C+Hef", "http://twitter.com/share?url=http://www.arcamax.com/politics/opeds/s-1738975&hashtags=ArcaMax"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-18T05:50:07.729+03:00", "highlightTitle": ""}