{"organizations": [], "uuid": "b1bda1ad4661cd72106d6964d5493a01ce065c15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/b27iam4yxs_9506829011926_9908924044316.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=51", "section_title": "Politics", "url": "http://www.modernghana.com/news/646954/1/i-pray-for-mahama-dr-bawumia.html", "country": "US", "title": "I pray for Mahama - Dr. Bawumia", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "I pray for Mahama - Dr. Bawumia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T22:36:00.000+03:00", "replies_count": 0, "uuid": "b1bda1ad4661cd72106d6964d5493a01ce065c15"}, "author": "", "url": "http://www.modernghana.com/news/646954/1/i-pray-for-mahama-dr-bawumia.html", "ord_in_thread": 0, "title": "I pray for Mahama - Dr. Bawumia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mahama"], "text": "Politics | 4 October 2015 20:36 CET I pray for Mahama - Dr. Bawumia By Myjoyonline.com \nRunning mate of NPP flagbearer Dr. Mahamudu Bawumia says he prays for the entire country and specifically for president John Dramani Mahama, a man he is determined to help unseat in the 2016 general elections. \nAlhaji Dr. Bawumia who returned from Mecca Saturday evening after performing the fifth pillar of the Islamic faith told Joy News' Latif Iddris at his residence that Ghanaians need to cultivate the habit of supporting each other to develop the nation. \nDr. Bawumia who performed the Hajj with his wife was received at the Kotoka International Airport by hundreds of party supporters and family members. \nPresent was the former MP for Ayawaso constituency, Sheikh I.C. Quaye \nThe running mate of the largest opposition party who survived the harrowing experience of the stampede that killed more than seven hundred people said, he has come back spiritually renewed and his approach to politics would be influenced by the hajj experience. \nAlhaji Dr. Bawumia recalled the stamped caused huge disruption to the pilgrimage. “It was unbelievable what happened. We didn’t know who was involved and it was a very frightening experience,” he said. \nDr. Bawumia said a short prayer for the country and also for those who lost their lives during the stampede. \nSheikh I.C. Quaye told Joy News he is hopeful the NPP overcome the current wrangling in the party and be united going into the 2016 elections. Politics Follow Us The beautiful ones are born in December, the premature come to existence almost always in July. By: Adwoa Ayamba", "external_links": [], "published": "2015-10-04T22:36:00.000+03:00", "crawled": "2015-10-05T06:42:53.967+03:00", "highlightTitle": ""}