{"organizations": [], "uuid": "32ba4584cf0f50d999bffac3b31c2e798198a861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4345350/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13876886.STURGEON_SAYS__TRUST_ME__I_M_A_SOCIAL_DEMOCRAT_NOT_A_FLAGS_AND_ANTHEMS_NATIONALIST/", "country": "GB", "title": "STURGEON SAYS: TRUST ME, I'M A SOCIAL DEMOCRAT NOT A FLAGS AND ANTHEMS NATIONALIST", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 7, "title_full": "STURGEON SAYS: TRUST ME, I'M A SOCIAL DEMOCRAT NOT A FLAGS AND ANTHEMS NATIONALIST (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T07:13:00.000+03:00", "replies_count": 7, "uuid": "32ba4584cf0f50d999bffac3b31c2e798198a861"}, "author": "Iain Macwhirter", "url": "http://www.heraldscotland.com/politics/13876886.STURGEON_SAYS__TRUST_ME__I_M_A_SOCIAL_DEMOCRAT_NOT_A_FLAGS_AND_ANTHEMS_NATIONALIST/", "ord_in_thread": 0, "title": "STURGEON SAYS: TRUST ME, I'M A SOCIAL DEMOCRAT NOT A FLAGS AND ANTHEMS NATIONALIST", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trust. It's a perishable commodity in politics. In fact, it's hard to think of another politician in Britain right now who could get away with asking for it - other than the SNP leader, Nicola Sturgeon, most politicians today are regarded as corrupt until proven otherwise.\nBut why did the SNP leader need to appeal to the people of Scotland to trust her – she said it seven times in her conference speech - so soon after they had expressed their faith by awarding her party the greatest election landslide in history?\nNormally politicians make such personal appeals when their backs are to the wall and their government on the rocks. Trust me, they say. Whatever it is, I’ll sort it out. There will be no whitewash in the White House, as Richard Nixon said during Watergate.\nOf course, there have been the sleaze headlines in the press following the resignation of the SNP’s business spokeswoman Michelle Thomson MP and the cronyism charges over the awarding of public money to T-in-the -Park. But these scandals, if such they are, have had zero impact on the SNP’s popularity in the opinion polls and barely surfaced at the Aberdeen conference.\nPromoted stories So why call for trust when it is already there? Well, in part because of the very size of the SNP mandate. The opposition has been eviscerated, with Labour losing all but one of its Scottish MPs in the general election. The Liberal Democrats have been wiped off the mainland of Scotland, and the Tories – as always – are nowhere.\nThis has led to claims that Scotland is becoming a one party state – a nonsensical description of one of the most democratic countries in the world. There are at least five major parties in contention for next year’s Holyrood elections which will be elected, unlike Westminster, on a form of proportional representation.\nNevertheless, with the SNP in line for another landslide people naturally worry that it has too much power, might be getting a little too big for its boots. There was an almost unreal display of party unity at their epic party rally in Aberdeen.\nYes, there were modest rebellions from the party conference floor on fracking and on land reform. Delegates made abundantly clear to the well-heeled lobbyists from Ineos and other energy companies, that whatever ministers may be saying privately, the SNP membership want fracking and unconventional gas extraction banned.\nSimilarly, the party wants the tepid proposals in the government's land reform bill heated up, and Scottish land ownership made fully transparent and brought into the tax system. But these bonsai rebellions hardly represent serious challenges to the party high command. Indeed, when Alex Salmond heard about the rebellion on land reform he said: “Good”.\nOn the key issues this week, Nicola Sturgeon had an easy ride. The response to her speech effectively ruling out an early referendum was remarkable. Delegates went around insisting that no one had never wanted an early referendum. That it had all been got up by the mainstream press.\nYet it is only a matter of months since just about every nationalist with a “45” on their twitter account was echoing the former SNP deputy leader Jim Sillars' call for an early referendum. To “strike while the iron is hot”.\nThe influential SNP blogger, James Kelly, argued that the Scottish government should heed the lessons of the 1995 Quebec referendum on independence and go for a repeat within five years. “[Quebec nationalists] passed up that chance because it was “too soon”,” he wrote. “Five years later the political seasons had changed, as they will for even the most popular party.”\nOf course, Nicola Sturgeon hasn't ruled out an early referendum if there is a clamour for it from the Scottish people – independence remains her ultimate objective. But she made abundantly clear that she has other priorities right now.\nAnd this is the other dimension to the trust challenge. The First Minister insisted yesterday that she is leading a “left of centre social democratic party...and that's what we always will be”. She has been stung by criticism from the broader nationalist movement that the SNP is becoming an establishment and is losing its radical edge.\nShe also realises that Labour's best chance of an electoral recovery is the perception that the SNP is just like every other party that gets into power and rests on its electoral laurels. Scottish voters are highly sceptical of politicians and their promises, and they are only too aware that power corrupts.\nIf she is to win her first mandate in Holyrood by a landslide in May, Nicola Sturgeon will need to convince Scottish voters that she can and will use the existing powers of the Scottish parliament to address issues like poverty, the attainment gap in education, missed waiting time targets in A&E.\nShe knows that the SNP needs to do more than just congratulate itself for keeping higher education free, abolishing prescription charges and extending free child care. The SNP’s star MP, Mhairi Black, won huge applause for her assault on “cruel” Conservative benefit cuts. The First Minister said yesterday that cuts to tax credits would \"leave 200,000 working families £3000 worse off”.\nBut her finance secretary, John Swinney, has already made clear that it is “highly unlikely” that he will be able to significantly reverse these tax credit cuts. The devolution of tax powers under the Scotland Act will give Holyrood more fiscal responsibility but precious little additional revenue.\nLabour say that cutting business rates is not going to do much about what Swinney called the “obscenity of poverty”. Health spending in Scotland has been growing more slowly than south of the border and social services are under acute strain in Scottish local authorities. They say the SNP talks left, acts right and drapes itself in the flag instead of honouring its promises.\nWell, Nicola Sturgeon answered that by insisting: “Our ambition for this country is not about flags and anthems” it is about making “our schools and hospitals the best in the world”. She means it, but does her party?\nIt was noticeable that the conference only really got to its feet yesterday when she celebrated Scotland's historic achievements and said that independence is “the only real and lasting alternative to Tory government”.\nNicola Sturgeon was right to ramp down expectations that SNP delegates can go back to their constituencies and prepare for independence. The referendum moment has passed and politics has moved on.\nShare article But the SNP party faithful are now going back to their constituencies to prepare for the hardest task in politics: turning modest initiatives on elective surgery and flexible child care into crowd pleasers and election winners. It’s the nuts and bolts of a “better nation”, but it doesn’t sound as heroic as “a nation once again”.\n“Scotland has found her voice” said Nicola Sturgeon. She has found her voice too. Trust her: she's a social democrat and she's going to prove it.", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-18T07:13:00.000+03:00", "crawled": "2015-10-18T05:54:27.558+03:00", "highlightTitle": ""}