{"organizations": [], "uuid": "831ea9f3a559b145c4d7107a7228b43869baf1cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "http://www.washingtonpost.com/blogs/the-fix/files/2015/10/Glen-Ford.png", "site_section": "http://feeds.feedburner.com/washingtonpost/hAWD", "section_title": "Politics", "url": "https://www.washingtonpost.com/news/the-fix/wp/2015/10/15/asdf/", "country": "US", "title": "Race, justice and the death penalty: Louisiana plays host next week to the biggest local election of 2015", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Race, justice and the death penalty: Louisiana plays host next week to the biggest local election of 2015 - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "831ea9f3a559b145c4d7107a7228b43869baf1cf"}, "author": "John Woodrow Cox", "url": "https://www.washingtonpost.com/news/the-fix/wp/2015/10/15/asdf/", "ord_in_thread": 0, "title": "Race, justice and the death penalty: Louisiana plays host next week to the biggest local election of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Janell Ross October 16 at 12:09 PM Follow @janellross \nGlenn Ford left the Louisiana State Penitentiary in Angola, La., in 2014. His conviction in a murder case was vacated after he spent 30 years in jail and on death row. (Associated Press) District attorney races are often fiercely competitive.\nFor starters, the candidates are lawyers, temperamentally inclined enjoy a good bout of non-lethal combat. And chief prosecutor jobs (most of which are elected) don't come open all that often . That's part of the reason that, in major metropolises and tiny rural hamlets alike, the DA's name is often one that a lot of people know.\nBut in Caddo Parish, La. (population: 253,00, biggest city: Shreveport), there is a district attorney's race that seems utterly suited for something straight out of a Jim Crow period piece about justice, bias and Southern politics. And although this might sound like an oxymoron, this could also be a relatively gripping story about campaign finance.\nWhat's happening in Caddo centers around Glen Ford, a black man convicted of murder, sentenced to die then locked away in solitary confinement for 30 years before a court declared him innocent and set him free. There would have to be a mention of the fact that the until-recently predominantly white Caddo sentences more people to death, per capita, than any other place in the country. And 77 percent of those who have been so condemned over the last 40 years were black.\nAny retelling would spend some time -- probably too much time if produced by Hollywood -- on a white and deeply apologetic junior prosecutor who now admits, decades later, that ambition and narcissism helped produce a horrific miscarriage of justice. He also staked the jury with white members and knocked blacks out of contention. He has asked the state bar for punishment.\nOne of the remaining central characters would have to be Dale Cox, Caddo's interim DA, appointed after the parish's elected prosecutor was discovered dead in a Shreveport hotel room. (No foul play is suspected.) Cox, who is white and in possession of a central-casting kind of Southern drawl and an affinity for the death penalty, is resolute that Ford's case does not indicate a single ill in Caddo Parish.\nCox believes the state owes Ford nothing. Nothing at all. To hear Cox tell it, nothing illegal happened. Nothing immoral happened. In fact, the system worked. Cox doesn't know why that junior prosecutor has even apologized. Louisiana should, according to Cox, execute more people. And hey, at least Ford made it out of prison alive.\nThis is all precisely what Cox has said publicly, most recently on last weekend's \"60 Minutes.\"\nBut Cox has already (i.e. before \"60 Minutes\" but shortly after the New York Times ran a story titled, \" The Prosecutor Who Says Louisiana Should 'Kill More People' \") bowed out of a special election scheduled for Oct. 24. So six people are seeking Caddo's DA seat.\n\nHungarian-American financier George Soros looks on during a session at the World Economic Forum annual meeting on January 27, 2011 in Davos, Switzerland. (FABRICE COFFRINI/AFP/Getty Images) Now, enter the final character. That would be George Soros, a Hungarian-American known for his support of liberal causes and concern about race-related injustice.\nSoros is another white hero or a villain here, depending on your notion of fairness, your politics and your feelings about campaign finance law. Soros already ranks among the county's biggest billionaire federal campaign financiers . And on Oct. 5, he dropped $256,000 into a Louisiana super PAC that promptly put ads on the air in support of one of the Caddo DA candidates . Soros appears to be the super PAC's only donor. \nNow, picture some tense courtroom scenes, corridors and offices. The super PAC's ad (see below) has started working to support a black judge and Democrat named James Stewart. Stewart retired from the bench in September after a somewhat shadowy source financed billboards encouraging him to run for Caddo DA. A local lawyer filed a suit against Stewart saying Stewart had to resign if he was going to run.\nOn Oct. 2, at Stewart's request, a court instead sanctioned that local lawyer, describing his suit as politically motivated and possibly nothing more than a publicity stunt since the court did not have jurisdiction to rule on the legal questions raised. The lawyer knew this, the court ruled, because he has done something similar before. So, the court ordered Stewart's would-be foil to pay court costs and take 10 hours of training in ethics and professionalism.\nEven before the Soros donation to that super PAC, Stewart seemed to have some advantages over other candidates. Stewart might have entered the race last, but he worked as a junior and then senior prosecutor in Caddo Parish before he was elected to the bench in the early 1990s. Both his older brothers are lawyers. One, a Clinton appointee, is chief judge of the U.S. Fifth Court of Appeals.\nSo Stewart knows the local justice system and has broader contacts too. There's some expectation that if elected DA, he would be far less interested than Cox in sending people -- an overwhelming majority of them being black -- to death row.\n\nSource: Louisiana Ethics Administration The New Yorker magazine and the aforementioned New York Times and \"60 Minutes\" have all come to town. The Washington Post wrote about the case, too .\nAnd partisan outlets have weighed in, too, in about the ways you'd expect. The conservative Washington Free Beacon said Soros is trying to \"buy\" the election for Stewart, in contrast to the objections that Soros and many other Democrats often raise about the corrupting influence of big money in politics.\nAll that drama has been compounded by a personal story of the man involved that is nothing short of tragic.\nThe day Ford was released from jail, the state did give him a $20 gift card. He used it to by fried chicken, iced tea and french fries. He emerged with $4 and some change. Two weeks later, Ford was diagnosed with an advanced form of lung cancer and has since died, just more than a year after his release. The Louisiana Innocence Project announced his late-June death on July 4. Donors covered the cost of his funeral, as Ford was penniless.\nThe state still hasn't paid Ford or his heirs anything, even though a state law indicates he's eligible for about $330,000. Cox insists Ford knew the robbery which lead to the murder was going to happen and did not inform police and thus isn't entitled to the payout. Ford has never been charged in connection with Cox's allegation or convicted. But Cox says it's true and that, according to Cox, is good enough reason for taxpayers to avoid a $330,000 bill.\nIn the end, an innocent man spent 30 years on death row. The local interim prosecutor is bordering on proud . Some members of the local press seem perplexed about the national outrage and suggestions that racism may have something to do with all that's gone on.\nMostly, the consensus concern seems to be the \" bad press \" interim DA Cox has brought to Caddo. Now, big outside campaign cash and a special election have made what would otherwise be a local race into a national story involving race, death, wrongful convictions and partisan politics.\nWe'll find out next weekend -- Oct. 24 -- what the next chapter holds.", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T23:27:17.942+03:00", "highlightTitle": ""}