{"organizations": [], "uuid": "d229b4ebd79562a0d4a000dc28f67178dc114436", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/3835742/", "site_section": "http://www.heraldscotland.com/politics/", "section_title": "Politics | Herald Scotland", "url": "http://www.heraldscotland.com/politics/13892215.Willie_Rennie_urges_independence_supports_to_back_Scottish_Lib_Dems/", "country": "GB", "title": "Willie Rennie urges independence supports to back Scottish Lib Dems", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 16, "title_full": "Willie Rennie urges independence supports to back Scottish Lib Dems (From Herald Scotland)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:10:00.000+03:00", "replies_count": 17, "uuid": "d229b4ebd79562a0d4a000dc28f67178dc114436"}, "author": "heraldscotland.com", "url": "http://www.heraldscotland.com/politics/13892215.Willie_Rennie_urges_independence_supports_to_back_Scottish_Lib_Dems/", "ord_in_thread": 0, "title": "Willie Rennie urges independence supports to back Scottish Lib Dems", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scottish Liberal Democrat leader Willie Rennie will make a direct appeal to independence supporters to back his party at next year's Scottish Parliament election.\nMr Rennie will make the plea when he addresses the Lib Dem conference in Dunfermline, Fife, on Saturday.\nHe says some of those who back the SNP's cause of independence feel \"let down\" by the party's record in government.\nThe Lib Dems, who hold five seats at Holyrood, will set out plans to boost services and support public-sector workers, according to Mr Rennie.\nHis party faces a battle with Labour, the Conservatives and the Greens for regional list seats in May, with polls predicting the SNP will dominate the constituency vote.\nMr Rennie is expected to say: \"My commitment to the United Kingdom remains as strong as ever.\n\"No-one should ever doubt that. But I recognise that many liberal-minded people have supported independence.\n\"As a consequence, many then felt compelled to back the nationalists even if they were unhappy about the performance of the SNP in government.\n\"I want them to know they now have another option.\n\"I want to make a direct plea to supporters of independence today - if you want to fix the problems facing your local GP surgery, if you want to end industrial-scale stop and search on our streets, if you want to put the treatment of mental ill-health on an equal footing with physical health, if you want all these things, then try out the Liberal Democrats.\nShare article \"That is the choice. Five years for health. Five years for education. Five years for freedom and liberties with the Liberal Democrats.\n\"Or five years of another referendum campaign with the nationalists.\"", "external_links": ["https://twitter.com/share?url=", "https://www.facebook.com/sharer/sharer.php?u="], "published": "2015-10-23T19:10:00.000+03:00", "crawled": "2015-10-23T15:13:02.502+03:00", "highlightTitle": ""}