{"organizations": ["Facebook Seattle", "KING"], "uuid": "8a6b7560bac91ae7a768848f697d79b087ee888e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.king5.com", "main_image": "http://cdn.tegna-tv.com/-mm-/e2a62e279b08edc40e3ff364b384684560472d01/c=4-0-1916-1080&amp;r=x633&amp;c=1200x630/local/-/media/2015/10/15/NWGroup/KING/635805446622098605-womeninpolitics2.JPG", "site_section": "http://rssfeeds.nwcn.com/_/20/106266438/nwcn/politics", "section_title": "NWCN - Politics", "url": "http://www.king5.com/story/news/politics/city/2015/10/15/seattle-could-have-first-female-majority-council-since-1990s/74027990/", "country": "US", "title": "Seattle could have first female majority council since 1990s", "performance_score": 0, "site": "king5.com", "participants_count": 0, "title_full": "Seattle could have first female majority council since 1990s", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T05:25:00.000+03:00", "replies_count": 0, "uuid": "8a6b7560bac91ae7a768848f697d79b087ee888e"}, "author": "", "url": "http://www.king5.com/story/news/politics/city/2015/10/15/seattle-could-have-first-female-majority-council-since-1990s/74027990/", "ord_in_thread": 0, "title": "Seattle could have first female majority council since 1990s", "locations": ["Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Natalie Brand"], "text": "Seattle could have first female majority council since 1990s Seattle could have first female majority council since 1990s Post to Facebook Seattle could have first female majority council since 1990s Seattle could have first female majority council since 1990s  //www.king5.com/story/news/politics/city/2015/10/15/seattle-could-have-first-female-majority-council-since-1990s/74027990/   Join the Conversation To   Seattle could have first female majority council since 1990s Natalie Brand, KING 5 Political Reporter 7:25 p.m. PDT October 15, 2015 . CONNECT TWEET LINKEDIN COMMENT EMAIL MORE \nSEATTLE -- The halls of Seattle City Hall tell the history from the first all-male council of 1889 to the first majority female council in 1994, a trend which continued through the late 1990s. \nHowever, for the past 15 years, men have held a majority on council, but that could change this November. Of the 18 council candidates, 10 are women. All female candidates are running in districts 1, 3 and 7, and the female candidates in district 5 and 9 were the top vote getters in the August primary. \n\"What excites me the most is it will be a younger council, more diverse and with more women,\" said Liz Berry, president of the National Women's Political Caucus of Washington State. \nBerry had a hand in encouraging the current field of female candidates. Her organization recruits and trains women in politics. \n\"Unlike men, they do not get up in the morning and look at themselves and think they're qualified to run for office, so we often find we have to ask women over and over again to run,\" described Berry. \n\"Being a candidate is a very tough job, and you do have to ask for money,\" said Councilmember Jean Godden. \n\"As hard as it is to ask for money, I think what's even worse to tell people how good you. I know that was a difficult thing for me. You're raised to be modest and you don't want to say I'm the best for this job and yet at the same time you have to tell people that you're good,\" Godden continued. \nGodden recalled joining Seattle City Council in 2002 when she was one of two women. Prior to entering politics, she was a female pioneer in journalism, as one of the Seattle P-I's early female staffers. \nHer experiences back then shaped her views on the importance of pay equity, which has become her signature issue today. \n\"Women have not been paid equally with men, even when you were in the union,\" Godden, who currently chairs the committee on Parks, Libraries and Gender Pay Equity. \n\"I would say the generation that's coming on, men as well as women seem to be very concerned with those issues that matter to families. Things like gender equity, because if you don't have women paid as much, families very often suffer.\" \nWhile Godden says she doesn't necessarily believe female politicians legislate differently, she believes they take a more \"holistic\" approach to solving city issues. \nLooking back after 12 years, Councilmember Godden, finishing out her last term, urges female candidates to \"go for it.\" \nShe and Berry agree much of it comes down to mindset. \n\"Politics is the ultimate competition. You win or you lose, and for women who seem to be less risk adverse at times, it's not a fun game,\" said Berry. \nDespite the challenges of campaigning, she urges women to run and run again. \n\"We need your voice in government and politics.\" Read or Share this story: http://www.king5.com/story/news/politics/city/2015/10/15/seattle-could-have-first-female-majority-council-since-1990s/74027990/ TOP VIDEOS", "external_links": [], "published": "2015-10-16T05:25:00.000+03:00", "crawled": "2015-10-16T05:35:42.391+03:00", "highlightTitle": ""}