{"organizations": ["NRG"], "uuid": "81c9bbc657fd1ba3450543d40b8e166a83666eb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.buffalonews.com", "main_image": "http://www.buffalonews.com/images/BNSocialShareLG.jpg", "site_section": "http://www.buffalonews.com/section/rssGen?profileID=1026&profileName=Politics", "section_title": "The Buffalo News - Politics", "url": "http://www.buffalonews.com/city-region/rally-held-in-dunkirk-for-repowering-of-nrg-plant-20151017", "country": "US", "title": "Rally held in Dunkirk for repowering of NRG plant", "performance_score": 0, "site": "buffalonews.com", "participants_count": 0, "title_full": "Rally held in Dunkirk for repowering of NRG plant", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:37:00.000+03:00", "replies_count": 0, "uuid": "81c9bbc657fd1ba3450543d40b8e166a83666eb6"}, "author": "", "url": "http://www.buffalonews.com/city-region/rally-held-in-dunkirk-for-repowering-of-nrg-plant-20151017", "ord_in_thread": 0, "title": "Rally held in Dunkirk for repowering of NRG plant", "locations": ["Dunkirk"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rally held in Dunkirk for repowering of NRG plant on October 17, 2015 - 8:37 PM Tweet ADVERTISEMENT \nDUNKIRK – Surrounded by a strong showing of community support, State Sen. Catharine Young, R-Olean, Saturday led a rally at the Dunkirk Pier in support of the repowering project at NRG’s Dunkirk plant. \n“With everyone’s help, we can make sure we send a loud and clear message that we resoundingly support repowering the NRG plant because it is so vital to our economy,” Young said. “The loss of NRG would be devastating to taxpayers across the region.” \nThough the Public Service Commission (PSC) has approved converting the coal-fired plant into a natural gas facility. progress has been slowed because of a lawsuit by a rival corporation. And currently, the state’s Independent System Operator has been directed by the PSC to conduct two studies on reliability and congestion concerns. \nAlso at the rally were State Assemblyman Andy Goodell, R-Chautauqua; Chautauqua County Executive Vince Horrigan; Dunkirk Mayor A.J. Dolce; Willie Rosas, mayor-elect for Dunkirk; Doug Stock, president of Dunkirk Central Labor Council; Dave Wilkinson, president of the Jamestown Central Labor Council and IBEW Local 106; Ted Skerpon, president and business manager for Local 97; Todd Tranum, president of the Chautauqua County Chamber of Commerce and the Manufacturers Association of the Southern Tier; Nancy Baker, president of the Dunkirk Teachers Association; and SUNY Fredonia President Dr. Virginia Horvath. \nThe Buffalo News works to promote civil conversation in the comments section below. Please review the user guidelines before commenting. \nHaving trouble posting a comment? Visit The News' commenting troubleshooting page .", "external_links": [], "published": "2015-10-18T03:37:00.000+03:00", "crawled": "2015-10-18T05:39:08.266+03:00", "highlightTitle": ""}