{"organizations": [], "uuid": "30ac447108e226d4fb5fb7ee1db462d8edf45524", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://www.fixthisnation.com/wp-content/uploads/2015/10/clinton-guns-150x150.jpg?a43101", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/u-s-politics/2015/10/clinton-ready-to-trample-2nd-amendment-2489654.html", "country": "US", "title": "Clinton Ready to Trample 2nd Amendment | U. S. Politics", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Clinton Ready to Trample 2nd Amendment | U. S. Politics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T18:51:00.000+03:00", "replies_count": 0, "uuid": "30ac447108e226d4fb5fb7ee1db462d8edf45524"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/u-s-politics/2015/10/clinton-ready-to-trample-2nd-amendment-2489654.html", "ord_in_thread": 0, "title": "Clinton Ready to Trample 2nd Amendment | U. S. Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nFor more great articles like this visit http://www.fixthisnation.com\nWhen Donald Trump said he would try to undo automatic birthright citizenship for anchor babies, his opponents across the aisle couldn’t believe their ears. You can’t do that! It’s-it’s in the Constitution!\nBut while it’s a matter of some debate whether illegal immigrants have the right to exploit the law for their own cynical gains, no one on the left seems upset about Hillary Clinton’s unconstitutional promises on gun control. They roasted Kim Davis over an open flame, telling her she couldn’t pick and choose which parts of the law to follow. But when it comes to the Second Amendment, suddenly the whole thing is up for debate. Because they believe that the Founders would not have approved of America’s gun violence stats, the words “shall not be infringed” can then be viewed as advisory.\nSince this is the one issue where she can swing to the left of Bernie Sanders, Clinton is ready and willing to prove herself to the liberal extremists in her party. Asked about handguns at a town hall meeting at Keene State College, Clinton said this week that she would be open to some extraordinarily frightening legislation.\n“Australia recently managed to take away tens of thousands–even millions–of handguns, and in one year they were all gone,” said a woman in the audience. “Can we do that? And if we can’t, why can’t we?”\nInstead of patiently explaining that our country was founded on a set of inalienable rights that had been wisely enshrined in our founding document, Clinton joyously entertained the notion of a giant constitutional bonfire.\n“You know, Australia’s a good example, Canada’s a good example, the UK’s a good example,” said Clinton. “Why? Because each of them had mass killings. Australia had a huge mass killing about 20 or 25 years ago. Canada did as well, so did the UK. In reaction, they passed much stricter gun laws. In the Australian example, as I recall, that was a buyback program. The Australian government as part of trying to clamp down on the availability of weapons offered a good price for buying hundreds of thousands of guns and basically clamped down going forward, in terms of having more of a background check approach–more of a permitting approach.”\nGiven a pause where she could have easily explained why a mandatory buyback wasn’t going to work in the U.S., Clinton chose to give the idea some credence. “It would be worth considering doing it on the national level,” she said.\nThe majority of Americans are not on board with the kind of strict gun control propositions coming from the Democrats, but that doesn’t mean public opinion won’t change. Republicans had better sharpen their skills when it comes to defending our nation’s right to bear arms because “stuff happens” is a good way to turn allies into enemies. And if Democrats get control of the White House and Congress again, there’s no telling how far they’ll go in pursuit of disarming the people.\nFor more great articles like this visit http://www.fixthisnation.com", "external_links": ["http://www.fixthisnation.com/wp-content/uploads/2015/10/clinton-guns-150x150.jpg?a43101"], "published": "2015-10-18T18:51:00.000+03:00", "crawled": "2015-10-18T21:33:52.217+03:00", "highlightTitle": ""}