{"organizations": [], "uuid": "99eb3a90acbc97e21e0cbaff8b10462d43d07d7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30304771/policy-director-in-the-office-of-the-national-coordinator-for-health-information-technology-jodi-g-daniel-joins-crowell-moring", "country": "US", "title": "Policy Director in the Office of the National Coordinator for Health Information Technology Jodi G. Daniel Joins Crowell & Moring", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Policy Director in the Office of the National Coordinator for Health Information Technology Jodi G. Daniel Joins Crowell & Moring - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "99eb3a90acbc97e21e0cbaff8b10462d43d07d7a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30304771/policy-director-in-the-office-of-the-national-coordinator-for-health-information-technology-jodi-g-daniel-joins-crowell-moring", "ord_in_thread": 0, "title": "Policy Director in the Office of the National Coordinator for Health Information Technology Jodi G. Daniel Joins Crowell & Moring", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Crowell & Moring LLP\nWASHINGTON , Oct. 20, 2015 /PRNewswire-USNewswire/ -- Crowell & Moring LLP today announced that Jodi G. Daniel , the former director of the Office of Policy in the Office of the National Coordinator for Health Information Technology (ONC), U.S. Department of Health and Human Services (HHS), joined the firm as a partner in its Health Care Group. Daniel served for a decade as the director at the ONC and 15 years at HHS, where she helped spearhead important changes in health information privacy and health information technology to improve health care for consumers nationwide.\nBased in the firm's Washington, D.C. office, Daniel will provide strategic advice to clients navigating the legal and regulatory environments related to technology in the health care sector.\nFor more than 10 years, Daniel has been responsible for thought leadership, policy development, and identifying policy drivers for health IT activities within the federal government, and ultimately established the HHS' national health IT policy. As former director at the ONC, Daniel addressed privacy and security issues to ensure that there was clear guidance on how the initial Health Insurance Portability and Accountability Act of 1996 (HIPAA) rules applied to health IT. She set the strategic direction and set policy on consumer e-health and health IT safety. She is also credited with establishing the ONC's regulatory capacity and led the development of all ONC regulations on health IT standards and certification.\n\"Jodi literally wrote the book-and all the rules-governing health information technology, including the complex HIPAA privacy and enforcement rules,\" said John T. Brennan, Jr. , chair of the firm's Health Care Group. \"Her experience in setting the regulatory framework and policies for both technology providers and adopters has supported innovation in areas including mobile health, remote devices and telehealth, and that insight will be of enormous value to our clients as they operate in this highly regulated space.\"\n\"Technology is changing the face of health care and health care delivery,\" said Daniel. \"To meet this growing need, the private sector and the government must continue to work together from a legal and policy perspective. I look forward to building on Crowell & Moring's deep bench in the health care arena, and to incorporate health IT into the firm and counsel clients as they forge a path into this highly regulated space.\"\nAs the first senior counsel for health information technology in the Office of the General Counsel (OGC) of HHS, Daniel developed HHS's foundational legal strategies and coordinated all legal advice regarding health IT for HHS. She founded and chaired the health information technology practice group within OGC and worked closely with the Centers for Medicare and Medicaid Services in the development of the e-prescribing standards regulations and the Stark and anti-kickback rules regarding e-prescribing and electronic health records.\nDaniel earned her J.D., magna cum laude , Order of the Coif, from Georgetown University , her M.P.H. from Johns Hopkins University , and her B.A., cum laude , from Tufts University . She is admitted to practice in the District of Columbia and New York .\nCrowell & Moring LLP is an international law firm with approximately 500 lawyers representing clients in litigation and arbitration, regulatory, and transactional matters. The firm is internationally recognized for its representation of Fortune 500 companies in high-stakes litigation, as well as its ongoing commitment to pro bono service and diversity. The firm has offices in Washington, D.C. , New York , Los Angeles , San Francisco , Orange County , Anchorage, London , and Brussels . Visit Crowell & Moring online at http://www.crowell.com .\nContact:\nAn Pham\n202.508.8740\napham@crowell.com\nLogo - http://photos.prnewswire.com/prnh/20150211/175008LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/policy-director-in-the-office-of-the-national-coordinator-for-health-information-technology-jodi-g-daniel-joins-crowell--moring-300162357.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.crowell.com/", "http://photos.prnewswire.com/prnh/20150211/175008LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC32506&Transmission_Id=201510200900PR_NEWS_USPR_____DC32506&DateId=20151020", "http://www.prnewswire.com/news-releases/policy-director-in-the-office-of-the-national-coordinator-for-health-information-technology-jodi-g-daniel-joins-crowell--moring-300162357.html", "http://photos.prnewswire.com/prnvar/20150211/175008LOGO", "https://www.crowell.com/Professionals/John-Brennan"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T18:18:54.677+03:00", "highlightTitle": ""}