{"organizations": ["Congress", "Ghulam Nabi Azad BJP"], "uuid": "3e200afec386fb6c712ead0c00bd66da19dc28b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indiatvnews.com", "main_image": "http://images.indiatvnews.com/politicsnational/IndiaTv6e2ce0_Azad_final.jpg", "site_section": "http://www.indiatvnews.com/rssfeed/politics_national_news.xml", "section_title": "Politics >> National News", "url": "http://www.indiatvnews.com/politics/national/union-ministers-spreading-communalism-ghulam-nabi-azad-33203.html", "country": "SG", "title": "Union ministers spreading communalism: Ghulam Nabi Azad", "performance_score": 0, "site": "indiatvnews.com", "participants_count": 0, "title_full": "Union ministers spreading communalism: Ghulam Nabi Azad", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:48:00.000+03:00", "replies_count": 0, "uuid": "3e200afec386fb6c712ead0c00bd66da19dc28b9"}, "author": "", "url": "http://www.indiatvnews.com/politics/national/union-ministers-spreading-communalism-ghulam-nabi-azad-33203.html", "ord_in_thread": 0, "title": "Union ministers spreading communalism: Ghulam Nabi Azad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BJP raking up 'Hindu terror' issue to polarise country: Congress \nHyderabad: Congress leader Ghulam Nabi Azad today alleged that Union ministers were spreading communalism and expressed \"fear\" amidst the hue and cry over claims of rising of intolerance in the country. \n\"Fencing is erected to protect the crop from being eaten away by animals. If the fencing itself eats away the crop, where do we go? That is the fear. The ministers of the Union Government spread communalism today. They give such statements.\" \n\"Now, it is in the open. Because, the party president had to call them yesterday and say stop this,\" Azad said referring to BJP chief Amit Shah's reprimand to several top party leaders who made controversial comments over the Dadri lynching and beef row. \nAzad was speaking at the historic Charminar here after receiving Rajiv 'Sadbhavana Award' presented to him to commemorate a 'Sadbhavana Yatra' undertaken from the same place by late Rajiv Gandhi in 1990. Read Also: Beef ban sensitive issue, react responsibly: Ghulam Nabi Azad \nNoting that India has always been a secular country, the Leader of Opposition in Rajya Sabha alleged that attempts are being made to \"communalise\" the people. \nExpressing that he \"salutes\" those returning awards in protest against alleged growing intolerance in the country, he said 99 per cent of such writers belong to the majority community. \nReferring to the letter reportedly written by a UP Minister to the United Nations for \"saving Muslims\", he said the majority community which is secular would protect the minorities. \n\"For people like me and crores of secular Hindus, Muslims, Sikhs and Christians, the head rises when all Hindu writers, intellectuals and those transform the society are returning their awards one after another. This is our victory,\" he said. \n ", "external_links": [], "published": "2015-10-20T01:48:00.000+03:00", "crawled": "2015-10-20T02:51:51.228+03:00", "highlightTitle": ""}