{"organizations": ["Ivy League", "Legislature", "Fallbrook Brewing Co.", "Dartmouth College", "Associated Press", "Southwest Airlines", "Big Apple", "Southwest"], "uuid": "aecf12d7860b3106d19815bf86549081bf46706c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wxow.com", "main_image": "http://images.worldnow.com/AP/images/8995105_G.jpg", "site_section": "http://www.wxow.com/Global/category.asp?C=13571&clienttype=rss", "section_title": "WXOW.com - Political - Headline", "url": "http://www.wxow.com/story/30236911/no-surprise-lukashenko-wins-belarus-presidential-race", "country": "US", "title": "No surprise: Lukashenko wins Belarus presidential race", "performance_score": 0, "site": "wxow.com", "participants_count": 0, "title_full": "No surprise: Lukashenko wins Belarus presidential race", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T11:47:00.000+03:00", "replies_count": 0, "uuid": "aecf12d7860b3106d19815bf86549081bf46706c"}, "author": "", "url": "http://www.wxow.com/story/30236911/no-surprise-lukashenko-wins-belarus-presidential-race", "ord_in_thread": 0, "title": "No surprise: Lukashenko wins Belarus presidential race", "locations": ["New Hampshire", "United States", "California", "Belarus", "New York", "Southern California", "Belarusian", "Nashville", "Minsk", "Memphis"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lukashenko", "Alexander Lukashenko", "Liz Rose", "Alexander Lukashenk"], "text": "No surprise: Lukashenko wins Belarus presidential race - WXOW News 19 La Crosse, WI – News, Weather and Sports | Member Center: Shows on WXOW No surprise: Lukashenko wins Belarus presidential race (AP Photo/Sergei Grits). Belarusian President Alexander Lukashenko is seen on a large screen, speaking to media at a polling station after voting during presidential elections in Minsk, Belarus, late Sunday, Oct. 11, 2015. President Alexander Lukashenk... Southwest warns Monday travelers to plan ahead after delays Southwest Airlines is asking travelers to arrive at least two hours before their scheduled departures as technical issues are forcing it to process customers manually. More >> Southwest Airlines said hundreds of flights have been delayed by technical issues and warned passengers flying Monday to arrive two hours early and print boarding passes before coming to the airport. More >> California craft beer brewers balance drafts and drought California craft brewers are scrambling to deal with water restrictions imposed by the state to relieve drought conditions. More >> Amid severe drought, the water board in this Southern California town imposed restrictions on Fallbrook Brewing Co., just as the tiny brewer doubled capacity to meet demand for its craft beers. More >> California may allow inmate firefighters with violent pasts California officials are considering allowing inmates with violent backgrounds to work outside prison walls fighting wildfires, and the idea is generating concerns about public safety. More >> California officials are considering allowing inmates with violent backgrounds to work outside prison walls fighting wildfires, and the idea is generating concerns about public safety. More >> Some want to swap ad hoc victim tributes for lasting shrines Teddy bear shrines and other makeshift memorials to violent crime victims are part of the landscape in tough neighborhoods across the United States. More >> On what would have been his friend's 18th birthday, a solemn teenager stared at a slumping display of helium balloons and a giant stuffed doll tied to a tree. More >> That New York twang: Nashville calls on Big Apple schools As the Bronx middle schoolers harmonized in their auditorium and plucked out basic chords on ukuleles and guitars, in walked their music instructor, Liz Rose - a Grammy-award winning country songwriter from Nashville. More >> As the Bronx middle schoolers harmonized in their auditorium and plucked out basic chords on ukuleles and guitars, in walked their music instructor, Liz Rose - a Grammy-award winning country songwriter from Nashville. More >> SOS via SMS: Help for suicidal teens is a text message away With younger generations using cellphones less for actual conversation and more for text messaging, suicide prevention organizations are setting up ways that let distraught youths seek help that way. More >> With younger generations using cellphones less for actual conversation and more for text messaging, suicide prevention organizations are setting up ways that let distraught youths seek help that way. More >> Old gift to Dartmouth College leads to a new investigation A state lawmaker who questions whether Dartmouth College has sufficiently repaid the state for its generosity more than a century ago is drafting three bills aimed at holding the Ivy League school accountable. More >> Frustrated by a lack of response from Dartmouth College, a state lawmaker hopes the Legislature will force the Ivy League school to explain how it has repaid New Hampshire for its generosity more than a century ago. More >> More cities are recognizing Native Americans on Columbus Day More cities are recognizing Native Americans on Columbus Day this year as they revive a movement to change the name of the holiday to celebrate the history and contributions of indigenous cultures around the country. More >> More cities are recognizing Native Americans on Columbus Day this year as they revive a movement to change the name of the holiday to celebrate the history and contributions of indigenous cultures around the country. More >> Off-duty officer in Memphis fatally shot; suspect in custody An off-duty Memphis police officer who died after being shot multiple times had been on the force for little more than a year and had a fiancee who is four months pregnant, authorities said. More >> An off-duty Memphis police officer who died after being shot multiple times had been on the force for little more than a year and had a fiancee who is four months pregnant, authorities said. More >> Data show criminal activity among inmate firefighters By The Associated Press A 10-year tally on criminal behavior by inmates assigned to firefighting camps shows firefighters are not immune to the violent behavior found in higher-security prisons,... More >> By The Associated Press A 10-year tally on criminal behavior by inmates assigned to firefighting camps shows firefighters are not immune to the violent behavior found in higher-security prisons, though... More >>", "external_links": [], "published": "2015-10-12T11:47:00.000+03:00", "crawled": "2015-10-12T12:39:22.402+03:00", "highlightTitle": ""}