{"organizations": [], "uuid": "520425a242f1f489f418181828822bd6fdeae83d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.npr.org", "main_image": "http://media.npr.org/assets/img/2015/10/02/ap_16278826202_wide-715c3a98d1b266e535c30c41d0b6554e4eb8c158.jpg?s=1400", "site_section": "http://www.npr.org/rss/rss.php?id=1012", "section_title": "Politics : NPR", "url": "http://www.npr.org/sections/itsallpolitics/2015/10/02/445312778/the-last-thing-bernie-sanders-needs-right-now-is-a-conversation-about-guns", "country": "US", "title": "The Last Thing Bernie Sanders Needs Right Now Is A Conversation About Guns : It's All Politics", "performance_score": 4, "site": "npr.org", "participants_count": 38, "title_full": "The Last Thing Bernie Sanders Needs Right Now Is A Conversation About Guns : It's All Politics : NPR", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:02:00.000+03:00", "replies_count": 91, "uuid": "4c5ec130d0a0570e7f98bc44d1a2a7c3e9458851"}, "author": "Bernie Sanders to NPR's David Greene", "url": "http://www.npr.org/sections/itsallpolitics/2015/10/02/445312778/the-last-thing-bernie-sanders-needs-right-now-is-a-conversation-about-guns#post-0", "ord_in_thread": 0, "title": "The Last Thing Bernie Sanders Needs Right Now Is A Conversation About Guns : It's All Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "i Vermont Independent Sen. Bernie Sanders could face renewed scrutiny over his positions on gun control after yet another mass shooting. Charlie Neibergall/AP hide caption\ni toggle caption Charlie Neibergall/AP Vermont Independent Sen. Bernie Sanders could face renewed scrutiny over his positions on gun control after yet another mass shooting.\nCharlie Neibergall/AP President Obama passionately pleaded for stricter gun laws in the aftermath of yet another mass shooting Thursday. Democratic candidates Hillary Clinton, Bernie Sanders and others renewed their calls for stricter gun control measures.\nBut it's the more liberal Sanders who could find himself having to uncomfortably explain his past positions on gun control. Even though the progressive socialist is to the left of Clinton and his other primary competitors on nearly every issue, he's walked a delicate line as a lawmaker from Vermont, where 2nd Amendment rights are popular.\nSanders has had a mixed voting record on guns. He voted in favor of the 2013 universal background check bill and assault-weapons ban following the Sandy Hook Elementary school massacre, and he's backed ending the so-called \"gun-show loophole.\"\nHe has also voted to allow guns on Amtrak, against the Brady Bill and against legislation that would have allowed lawsuits against gun companies. In fact, the NRA even helped Sanders win his first race for Congress.\nIn June, just after the race-motivated shooting at Mother Emanuel AME Church in Charleston, S.C., Sanders continued to sound a more muted tone on gun control reform than many of his Democratic colleagues were calling for.\n\"I think guns and gun control is an issue that needs to be discussed,\" Sanders said in an interview with NPR's David Greene . \"Let me add to that, I think that urban America has got to respect what rural America is about, where 99 percent of the people in my state who hunt are law-abiding people.\"\nI think that urban America has got to respect what rural America is about, where 99 percent of the people in my state who hunt are law-abiding people.\nBernie Sanders to NPR's David Greene\nJune 24, 2015\n\"I can understand if some Democrats or Republicans represent an urban area where people don't hunt, don't do target practice, they're not into guns,\" Sanders continued. \"But in my state, people go hunting and do target practice. Talking about cultural divides in this country, you know, it is important for people in urban America to understand that families go out together and kids go out together and they hunt and enjoy the outdoors, and that is a lifestyle that should not be condemned.\"\nOn MSNBC Thursday night, just after the latest mass shooting, Sanders sounded a stronger tone at first.\n\"Condolences are not enough. We've got to do something. We have to stop shooting at each other. We need sensible gun-control legislation. And by the way, we need to significantly improve mental health services in the United States of America,\" Sanders said on All In with Chris Hayes . \"And I pledge to do everything that I can in both of those areas.\"\nBut when pressed about his past opposition to some tougher gun laws, Sanders underscored that he had backed closing loopholes and instant background checks. He also said to have any progress on the issue, there does have to be some common ground — a stark difference from the way Obama laid out his case earlier in the day.\n\"You can sit there and say I think we should do this and do that. But you've got a whole lot of states in this country where people want virtually no gun control at all. And if we are going to have some success, we are going to have to start talking to each other,\" Sanders said. \"And here's what I think is the good news, that I think there is a consensus for serious gun control including among people who own guns. And I think that's what we have to bring about.\"\nIn a way, Sanders' position is probably closer to that of many Americans. With a divided Congress and White House, the probability of any type of real reform is slim.\nSanders' more pragmatic position given such a polarized electorate on the issue may actually play well in a general election, but not in a Democratic primary. The Vermont senator is showing renewed momentum — topping Clinton in polls in New Hampshire and pulling in an impressive $26 million in the third quarter from a record number of small donors.\nHis rise has been on the backs of his message of economic populism and restoring inequality. He benefits over Clinton, and even Biden if he gets in, as being the outsider and fresh face, even at age 74. But if the conversation in the Democratic primary turns to renewed pushes for sweeping gun control measures, it's bad news for Sanders. He's going to have to explain every time he voted against some very popular restrictions, and so far in major interviews, he has not proven very adept at doing so.\nAnd if the vice president does jump into the presidential race, zapping some of Sanders' momentum, he can remind voters of his tough positions on gun control, including being the White House's point person to try to negotiate a universal background check bill after Newtown.\nIf there is one weakness in Sanders' appeal to progressives, it's gun control. And it's one that is being shoved into the spotlight again, to his possible political peril.\nbernie sanders gun control Hillary Clinton", "external_links": ["http://www.washingtonpost.com/politics/how-the-nra-helped-put-bernie-sanders-in-congress/2015/07/19/ed1be26c-2bfe-11e5-bd33-395c05608059_story.html?wpmm=1&wpisrc=nl_daily202", "http://www.politico.com/story/2015/06/bernie-sanders-awkward-history-with-guns-in-america-119185.html"], "published": "2015-10-02T22:02:00.000+03:00", "crawled": "2015-10-02T23:19:41.967+03:00", "highlightTitle": ""}