{"organizations": [], "uuid": "cfc389de643c2bf010619a481ac7f1d3c64b8496", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kcra.com", "main_image": "http://www.kcra.com/image/view/-/35878166/highRes/2/-/maxh/630/maxw/1200/-/jrq6xsz/-/Donald-Trump-Jeb-Bush-Justin-Sullivan-Getty-Images-jpg.jpg", "site_section": "http://www.kcra.com/11798346?format=rss_2.0&view=feed", "section_title": "Political News", "url": "http://www.kcra.com/politics/bush-ridicules-trumps-fitness-to-lead-military-in-new-attack-ad/35901690", "country": "US", "title": "Bush ridicules Trump's fitness to lead military in new video", "performance_score": 0, "site": "kcra.com", "participants_count": 0, "title_full": "Bush ridicules Trump's fitness to lead military in new video", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T01:56:00.000+03:00", "replies_count": 0, "uuid": "cfc389de643c2bf010619a481ac7f1d3c64b8496"}, "author": "", "url": "http://www.kcra.com/politics/bush-ridicules-trumps-fitness-to-lead-military-in-new-attack-ad/35901690", "ord_in_thread": 0, "title": "Bush ridicules Trump's fitness to lead military in new video", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Trump", "Bush"], "text": "Bush ridicules Trump's fitness to lead military in new video Clip questions his knowledge of foreign affairs UPDATED 3:56 PM PDT Oct 17, 2015 Photos Justin Sullivan Getty Images \nThe long-running feud between Jeb Bush and Donald Trump escalated yet again Saturday, with the former Florida governor releasing a two-minute video on social media mocking the billionaire's fitness to be commander-in-chief. \nAccording to Donald Trump, there's a new rumor that Vanity Fair editor Graydon Carter is about to be ousted. \nTrump tweeted the same rumor a year and a half ago, and it hasn't come true yet. \nThis time, in a tweet on Friday evening, he said \"rumor has i... Will Donald Trump appear on 'SNL?'... \n\".@RealDonaldTrump's absurd comments again raise questions on whether he possesses the judgment to be President,\" Bush tweeted. \nThe clip, set to the tune of circus music, is a collage of comments from Trump that have called into question his grasp of military matters. Many of Trump's most notable gaffes are highlighted: from his questioning of John McCain's status as a war hero to his inability to name prominent terrorists. \nThe clip also points out that Trump -- who is shown in the clip claiming that \"there's nobody bigger or better at the military than I am\" -- received deferments to avoid military service during the Vietnam War. There's also a snippet of a 2007 interview with CNN's Wolf Blitzer in which he says Hillary Clinton \"would do a good job\" negotiating a nuclear deal with Iran. \nMeanwhile, the video is interspersed with politicians and pundits discussing gaps in Trump's knowledge of foreign affairs. \nThe video ends with two Trump quotes -- \"I will be so good at the military, your head will spin\" and \"Let me tell you, I'm a really smart guy\" -- before concluding with a title card that simply says, \"Stumped.\" \nIn a statement, Bush campaign spokeswoman Allie Brandenburger said the video raised \"questions on whether (Trump) possesses the judgment to be Commander-in-Chief.\" \n\"The American people are fed up with President Obama's lack of strategy for addressing the grave threat of ISIS and radical Islamic terrorists. Governor Bush is the only candidate in this race with the proven executive record and leadership skills needed to restore America's role in the world,\" Brandenburger added. \nThe Trump campaign did not immediately respond to a request for comment. \nSaturday's clip was the latest salvo in the Bush-Trump rivalry that has often been marked by bitter and personal exchanges between the two prominent Republican presidential candidates. On Friday, Trump suggested Bush's brother, former President George W. Bush, shared in the blame for the 9/11 terrorist attacks because they occurred during his presidency. \nBush angrily responded, calling the remark \"pathetic.\" \nTrump ducked questions about the comments when pressed by CNN Friday night, but later attacked Bush on Twitter. \n\"No @JebBush, you're pathetic for saying nothing happened during your brother's term when the World Trade Center was attacked and came down,\" Trump tweeted. \n\".@JebBush, like it or not, our country needs more energy and spirit than you can provide! #MakeAmericaGreatAgain,\" Trump added. \nBush's video Saturday was also evocative of clips Trump has deployed to rip other presidential candidates. The real estate mogul slammed Bernie Sanders' ability to stand up to global threats in a video released this week that was also set to the soundtrack of circus music. \nAnd in August, he bashed Bush -- as well as his brother and father, former President George H.W. Bush -- in a social media video as well, saying that \"Enough is Enough- no more Bushes!\"", "external_links": [], "published": "2015-10-18T01:56:00.000+03:00", "crawled": "2015-10-18T01:59:12.305+03:00", "highlightTitle": ""}