{"organizations": [], "uuid": "d37ac2d3998c7c2ef8812e1190a9d9c7762a345f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.isthmus.com", "main_image": "http://www.isthmus.com/downloads/35295/download/SavageLove-DownThere-Tease-10152015.jpg?cb=16ebbca4794f4f4468d792789c443354", "site_section": "http://www.thedailypage.com/daily/rss.php", "section_title": "Isthmus : Madison, Wisconsin : News, Politics, Music, Movies, Restaurants, Calendar of Events", "url": "http://www.isthmus.com/opinion/savage-love/down-there/", "country": "US", "title": "Down there", "performance_score": 0, "site": "isthmus.com", "participants_count": 1, "title_full": "Down there", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:00:00.000+03:00", "replies_count": 0, "uuid": "d37ac2d3998c7c2ef8812e1190a9d9c7762a345f"}, "author": "Dan Savage", "url": "http://www.isthmus.com/opinion/savage-love/down-there/", "ord_in_thread": 0, "title": "Down there", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expand Craig Winzer I am a cis woman in my mid-20s. I get a pang or a spasm of pain in a place deep in my clit/urethra area. I can’t pinpoint which part exactly. It takes me by surprise every time it happens, so I jerk around and press my crotch for a hot second — which doesn’t help, but it’s about the only thing I can do. This obviously does not look cool in public, and regardless of when it happens, the episode irritates me. Around four or five convulsions happen and then quickly it’s over. There’s no pattern — it happens at random times and anywhere from one to four times daily. It started about a week ago. It doesn’t hurt when I pee, apply pressure to the area, work out, masturbate or orgasm. I wonder if my lady spasms are associated with stress. I started a new job in September that I love, but it’s very demanding of my time, which has taken a toll on my mental and physical health (i.e., doing work things all fucking day, having no “me” time). What’s going on down there? What’s the solution? (P.S. I’m a lesbian if that detail is helpful.) \nSuper Perplexed About Spasms Mostly \nI shared your letter with Dr. Lori Brotto, an associate professor in the Department of Gynecology at the University of British Columbia. Dr. Brotto has done extensive research on vaginal/vulval pain and is a recognized expert on this subject and lot of others. Brotto shared your letter with Dr. Jonathan Huber, an Ottawa-based gynecologist with expertise in treating genital pain. “SPASM definitely needs to see a physician as soon as possible to have her vulva and vagina examined,” Dr. Brotto and Dr. Huber write in a joint response. “The collection of symptoms she describes does not map perfectly onto any single diagnosis, so these ideas below are best guesses.” \nBefore we get to those best guesses, a word of warning for the hypochondriacs in my readership: If you’re the kind of person who can’t read about mysterious symptoms and their possible causes without immediately developing those symptoms — particularly vagina-having hypochondriacs — you might want to skip the rest of this response. Okay, back to the good doctors.... \n“Sudden onset, intermittent genital pain can be caused by a number of simple things, such as abrasions, an infection, an allergic reaction, buildup of smegma, dermatosis, etc.,” Brotto and Huber continue. “Although these things are unlikely to be the cause of her pain, they’re easy to rule out and treat, if necessary.” (“Wait just a minute,” I hear some of you crying. “Women don’t have problems with smegma — that’s just a dudes-with-foreskins* problem.” Dr. Brotto responds: “Women get smegma, too. We don’t hear about smegma in women because yeast infections get a lot more attention. But smegma in women is the same as smegma in men: a harmless buildup of skin cells and oils.”) \n“SPASM’s symptoms most closely map onto a condition called ‘interstitial cystitis’ (IC) or bladder pain syndrome,” they explain. “IC is diagnosed when there is chronic bladder or urethral pain in the absence of a known cause. It’s typically described as having the symptoms or sensations of a bladder infection, without actually having an infection. Although IC usually has a gradual onset and presents with pressure more often than pain, some women do describe a sudden onset, with pain as the most prominent symptom as opposed to pressure. Since IC often coexists with vulvodynia (vulval pain), dysmenorrhea (painful periods), and endometriosis (when endometrial tissue grows outside the uterus), if this individual has any of these other diagnoses, then IC may be more likely to account for her pain.” \nHow can you determine if it’s IC? “IC is best assessed by a urologist, who may choose to do further urine tests, like examination of urine under a microscope, and even a cystoscopy — putting a narrow camera through the urethra into the bladder to take a look.” \nAnother possible cause: a urethral diverticulum. “It’s like an outpouching along the tube of the urethra,” Brotto and Huber write. “This is kind of like a dead-ended cave where urine and other debris can collect, which can possibly lead to infection and pain.” A gynecologist might be able to diagnose a diverticulum during a normal exam — just by feeling around — but you’ll most likely need to have a tiny camera stuffed up your urethra to diagnose this one too, SPASM. Moving on.... \n“Some of her symptoms also sound like the beginnings of persistent genital arousal disorder (PGAD), a condition of unwanted genital sensations and arousal in the absence of sexual desire. PGAD can be triggered by stress and temporarily relieved with orgasms. For some women with PGAD, it is related to starting or stopping a medication (especially antidepressants).” \nThe good news: You don’t need to cram a selfie stick up your urethra to determine whether you’ve recently stopped taking antidepressants. More good news: There are treatments for all of these conditions. \n* For the record, quickly, before Tumblr explodes: Some women have penises! Some women with penises are uncut! A tiny percentage of uncut-penis-having women have poor personal hygiene practices and consequently have smegma under their foreskins! #TheMoreYouKnow. \nEmail Dan at mail@savagelove.net or find him on Twitter at @fakedansavage. Tags", "external_links": [], "published": "2015-10-14T20:00:00.000+03:00", "crawled": "2015-10-15T01:57:38.277+03:00", "highlightTitle": ""}