{"organizations": [], "uuid": "b63e75c8d4ca6d8249a0910aaac3a1a62674da46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30185416/gilbane-building-company-sponsors-ace-in-houston-and-across-the-us", "country": "US", "title": "Gilbane Building Company sponsors ACE in Houston and across the US", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Gilbane Building Company sponsors ACE in Houston and across the US - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "b63e75c8d4ca6d8249a0910aaac3a1a62674da46"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30185416/gilbane-building-company-sponsors-ace-in-houston-and-across-the-us", "ord_in_thread": 0, "title": "Gilbane Building Company sponsors ACE in Houston and across the US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Gilbane Building Company\nOrganization poised for increase in student involvement, more mentors needed\nHOUSTON , Oct. 5, 2015 /PRNewswire/ -- Gilbane is a proud sponsor and participant in the ACE (Architecture, Construction, Engineering) Mentor Program of America, America's top workforce development organization encouraging youth to pursue STEM-related careers. Angela Cotie of Gilbane, who is the Chairman of the Board for the ACE Mentor Houston Affiliate, says the group is poised to enroll and mentor even more students during the 2015 - 2016 school year. This is the 21st year of ACE offering opportunities for students to prepare them for college and beyond and ACE is in the midst of making exciting new changes. ACE has launched a re-designed website, hired a new President and CEO, added new national sponsors, welcomes a new affiliate in Utah and is supported by the broadest group of distinguished design and construction firm leadership to-date.\n\"The ACE Mentor Program attracts students to its 35-40-hour after-school program who want to reach beyond textbooks and understand real world applications of their studies,\" stated Thomas Gilbane, Jr. , Chairman of the Board, ACE Mentor Program, and Chairman & CEO, Gilbane, Inc.\nAccording to Jack Kalavritinos , named President & CEO of ACE in January, quantitative results from two 2015 ACE studies show that:\n63% of ACE seniors were minority students vs. the national average of 44.3% 98.6% of ACE high school seniors graduate from high school vs. the national average of 80% 92% of ACE seniors entered college directly from high school vs. the national average of 66% 70% of college-bound ACE seniors major in architecture, engineering or construction management \"The goal of the ACE Mentor Program in Houston is to provide students as many opportunities as possible to find a career in the industry,\" stated Angela Cotie , ACE Chairman of the Board for the Houston Affiliate, and Sr. Project Manager for Gilbane Building Company. \"There are countless openings in a city of this size for a young person to find their unique path. The mentors of ACE are there to help them find their way and follow their dreams.\"\nACE Houston is also very active in the community and has an event planned for November 21, 2015 called Build It Forward. Community Service is an important component of developing young leaders. You can learn more about this event by visiting www.acementorhouston.org .\nTo register for the ACE program - or to become a mentor – you can visit www.acementor.org .\nAbout Gilbane Building Company\nGilbane provides a full slate of construction and facilities-related services – from pre-construction planning and integrated consulting capabilities to comprehensive construction management, close-out and facility management services – for clients across various markets. Founded in 1873 and still a privately held, family-owned company, Gilbane has more than 50 office locations around the world. For more information, visit www.gilbaneco.com .\nMedia Contact:\nGinaRenee Autrey\nGilbane Building Company\ngautrey@gilbaneco.com\n713-209-1850\nPhoto - http://photos.prnewswire.com/prnh/20151002/273461\n releases/gilbane-building-company-sponsors-ace-in-houston-and-across-the-us-300153646.html\n ", "external_links": ["http://www.gilbaneco.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/gilbane-building-company-sponsors-ace-in-houston-and-across-the-us-300153646.html", "https://photos.prnewswire.com/prnvar/20151002/273461", "http://www.acementorhouston.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NE18603&Transmission_Id=201510050800PR_NEWS_USPR_____NE18603&DateId=20151005", "http://www.acementor.org/", "http://photos.prnewswire.com/prnh/20151002/273461"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T16:49:42.899+03:00", "highlightTitle": ""}