{"organizations": [], "uuid": "bb4bb28438992bb2ced3da8e0b6e792404ca26db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wnd.com", "main_image": "http://www.wnd.com/files/2015/10/JoeKennedy.png", "site_section": "http://www.wnd.com/category/front-page/politics/feed/#", "section_title": "WND » Politics", "url": "http://www.wnd.com/2015/10/washington-coach-says-hell-pray-despite-school-ban/", "country": "US", "title": "Washington coach says he'll pray, despite school ban", "performance_score": 0, "site": "wnd.com", "participants_count": 1, "title_full": "Washington coach says he'll pray, despite school ban", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:54:00.000+03:00", "replies_count": 0, "uuid": "bb4bb28438992bb2ced3da8e0b6e792404ca26db"}, "author": "Cheryl Chumley", "url": "http://www.wnd.com/2015/10/washington-coach-says-hell-pray-despite-school-ban/", "ord_in_thread": 0, "title": "Washington coach says he'll pray, despite school ban", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington coach says he'll pray, despite school ban Joe Kennedy: 'I'm strong in my faith' Published: 1 hour ago Cheryl Chumley About | Email | Archive Cheryl K. Chumley is a staff writer for WND and author of \"Police State USA: How Orwell's Nightmare is Becoming our Reality.\" Formerly with the Washington Times, she is a journalism fellow with The Phillips Foundation in Washington, D.C., where she spent a year researching and writing about private property rights. Text smaller Text bigger Joe Kennedy, Bremerton High School football coach in Washington, is standing strong on his right to pray. (Image credit: Liberty Institute) \nJoe Kennedy, football coach for Bremerton High School in Washington, told a Fox & Friends Thursday morning audience he was going to go forward with his 50-yard line end-game public prayer, despite administrators’ orders to stop. \n“It’s something that I kind of made an agreement with, my personal faith in God, that this is something I was going to do – give Him the glory after every single game and do it on the 50 ,and I’m kind of a guy of my word,” he said, during the national broadcast. “I’m going to go through with what I’ve always done.” \nKennedy for years has said a before- and after-game prayer on the 50-yard line at both home and away games, asking God for the safety of the players and that the game go forth in a fair manner. Students and players have joined him over the years – and not just from Bremerton. \n“The Death of Free Speech: How Our Broken National Dialogue Has Killed the Truth and Divided America” examines how the news media has created arbitrary, biased and illogical rules for determining what can and cannot be said in the public arena. \n“It’s actually become a really interesting thing,” he said, on Fox, “the whole entire team coming out there joining us, voluntarily. … and then it spread from there to the other teams. Now everybody in the league, the opposing teams, doesn’t matter if it’s a home or away game, have joined us out there on the 50.” \nBut the school district just recently sent Kennedy a three-page letter demanding he cease and desist the prayer. \nAnd on that, Kennedy in a previous interview with Fox , said: “I spent 20 years in the military defending the Constitution and the freedoms that everybody has. All of a sudden, I realized that people who work for the public schools don’t have the same constitutional rights that everyone else has.” \nSpecifically, the Bremerton School District took offense with Kennedy’s pre-game locker room prayer, and with his after-game inspirational messages on the 50-yard line. \nBut Kennedy isn’t going to stop. \nHiram Sasser, deputy chief counsel of litigation with the Liberty Institute, appeared with Kennedy on Fox News to say: The school’s cease and desist demand isn’t constitutional. The Liberty Institute is defending his cause and has issued a demand letter of its own, on Kennedy’s behalf, to the school, saying he has every right to continue his post-game prayers. \nWND’s acclaimed Whistleblower magazine shows in its powerfully moving April issue, “PERSECUTION RISING,” how today’s treatment of Christians in many nations is disturbingly reminiscent of the brutal persecution of the early followers of Christ. \n“Obviously, the pre-game prayer is coming to an end,” Sasser said. “But on the 50 yard line after the game has concluded, after the fight song when everybody’s free to come out on the field, the coach has a right as a citizen to go out there and pray and he doesn’t have a duty to flee the scene if other kids happened to come along.” \nSasser said the Supreme Court of the United States has already recognized people who join such prayers are acting in their own individual capacities and are not being forced to participate. \nKennedy said he’s learned a lot in recent months about his constitutional rights, and while he’s adjusted to conform to the school’s wishes on the pre-game prayers, he won’t back down on his post-game faith activities – even if he faces the threat of firing. He’s going to pray on the 50-yard line at the conclusion of Friday’s game, no matter what comes. \n“I’m strong in my faith and I really don’t believe I’ll be fired for what I am going to do,” he said. “I have a higher power that I answer to and I understand where the school district is coming from … [but] my lawyers have said I’m well within my rights.”", "external_links": [], "published": "2015-10-15T15:54:00.000+03:00", "crawled": "2015-10-15T17:14:21.451+03:00", "highlightTitle": ""}