{"organizations": [], "uuid": "08adc6e70b8651e3e2600ec2efed3f2fc4e4afdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30276125/hastings-hastings-cautions-on-the-inadvertent-misuse-of-hand-sanitizers", "country": "US", "title": "Hastings & Hastings Cautions on the Inadvertent Misuse of Hand Sanitizers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hastings & Hastings Cautions on the Inadvertent Misuse of Hand Sanitizers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "08adc6e70b8651e3e2600ec2efed3f2fc4e4afdb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30276125/hastings-hastings-cautions-on-the-inadvertent-misuse-of-hand-sanitizers", "ord_in_thread": 0, "title": "Hastings & Hastings Cautions on the Inadvertent Misuse of Hand Sanitizers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hastings & Hastings\nFall is coming, school is back in session, and it is likely that households are seeing a dramatic rise in sniffles, sneezes, and tissue use. With the increase of flu and allergy like symptoms, there is also an increase in the use of hand sanitizers. Hastings & Hastings wants everyone to remain as healthy as possible.\nPHOENIX , Oct. 16, 2015 /PRNewswire/ -- As part of that mission, Hastings & Hastings would like to inform individuals about the deadly rise in the consumption of hand sanitizer among children.\nLogo - http://photos.prnewswire.com/prnh/20151012/276184LOGO\nHand sanitizer contains one primary active ingredient, alcohol. The amount of alcohol in hand sanitizer is not negligible, in fact, hand sanitizer contains more alcohol per volume than beer, wine, and even some liquors! It is not unusual for a hand sanitizer product to contain anywhere from 45% to 95% alcohol per volume.\nThe Georgia Poison Center recently ran a study that showed that hand sanitizer consumption by children below the age of 12 has risen by 400 percent since 2010. The consumption of hand sanitizer by children can be extremely deadly. Recently, a six-year-old name Nhaijah Russell consumed approximately 3-4 squirts of strawberry scented hand sanitizer. She was later Quote: d as saying she did it because it tasted \"like candy.\" Russell had to be rushed to the emergency room for treatment for severe alcohol poisoning. Her blood-alcohol level was reported to be .179, well over twice the legal limit for adults.\nMs. Russell was lucky to escape with her life. The consumption of hand sanitizer is very hazardous. Hastings & Hastings encourages parents to keep hand sanitizer out of the reach of children. Children may not understand that they are dealing with a potentially deadly substance.\nWhile many children consume hand sanitizer without knowing about the dangerous side effects, other children are beginning to consume hand sanitizer willingly, because they know about the side effects. Hastings & Hastings believes that the best course of action for preventing the willful misuse of hand sanitizer, is to provide education for children and young adults. Parents should sit down and have a conversation with their children about the dangers of abusing hand sanitizer. Even consuming a few pumps could have long lasting negative side effects. In 2014, there were 16,117 report cases of hand sanitizer abuse. Hastings & Hastings would like to see this number reduced to zero.\nAbout Hastings & Hastings\nHastings & Hastings is an Arizona consumer law firm. We are an experienced trial law firm that represents personal injury and wrongful death victims at a Discount Fee.\nContact Information\nKristy Guell\n(480) 706-1100\nkristy.guell@hastingsandhastings.com\nhttp://hastingsandhastings.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/hastings--hastings-cautions-on-the-inadvertent-misuse-of-hand-sanitizers-300158609.html\n ", "external_links": ["http://hastingsandhastings.com/", "http://photos.prnewswire.com/prnh/20151012/276184LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY26190&Transmission_Id=201510160700PR_NEWS_USPR_____NY26190&DateId=20151016", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/hastings--hastings-cautions-on-the-inadvertent-misuse-of-hand-sanitizers-300158609.html"], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T16:18:34.621+03:00", "highlightTitle": ""}