{"organizations": [], "uuid": "b3031a89a2f6a151acd4ebac21ac88768943ac08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtontimes.com", "main_image": "", "site_section": "http://www.washingtontimes.com/atom/headlines/news/politics/", "section_title": "www.washingtontimes.com stories: Politics", "url": "http://www.washingtontimes.com/news/2015/oct/18/analysis-making-headlines-no-guarantee-of-election/", "country": "US", "title": "Analysis: Making headlines no guarantee of election success", "performance_score": 0, "site": "washingtontimes.com", "participants_count": 1, "title_full": "Analysis: Making headlines no guarantee of election success", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:01:00.000+03:00", "replies_count": 0, "uuid": "b3031a89a2f6a151acd4ebac21ac88768943ac08"}, "author": "EMILY WAGSTER PETTUS", "url": "http://www.washingtontimes.com/news/2015/oct/18/analysis-making-headlines-no-guarantee-of-election/", "ord_in_thread": 0, "title": "Analysis: Making headlines no guarantee of election success", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Analysis: Making headlines no guarantee of election success By EMILY WAGSTER PETTUS - Associated Press - Sunday, October 18, 2015 \nJACKSON, Miss. (AP) - Two state senators with proposals that grabbed headlines and divided their colleagues are not returning to the Mississippi Capitol next term. \nSens. Nancy Adams Collins of Tupelo and Phillip Gandy of Waynesboro were both defeated in the Republican primary in August. Their defeat raises questions about whether it’s a successful long-term strategy to appeal to the most conservative elements of the GOP, even in Republican-dominated Mississippi. Trying to appeal to the most liberal elements of the Democratic Party has long been a no-win strategy for most candidates in the state. \nIn 2014, Gandy sponsored Senate Bill 2681 (http://bit.ly/1hheTXI ), known as the Mississippi Religious Freedom Restoration Act. It said state and local governments cannot put a substantial burden on religious practices. \nThe bill was sharply criticized by the representatives of the American Civil Liberties Union and a gay-rights group, Human Rights Campaign, who said it could lead to anti-gay discrimination by businesses. \nGandy, a Baptist minister, said his bill mirrored a federal law signed by President Bill Clinton more than 20 years ago - one that the craft-store chain Hobby Lobby used to support its arguments against providing contraception coverage under a federal health overhaul signed by President Barack Obama. \nRepublican Gov. Phil Bryant signed the bill in a private ceremony attended by a few elected officials, lobbyists for the state’s influential Southern Baptist Convention and Tony Perkins, president of Family Research Council. It became law July 1, 2014. \nThis year, Collins sponsored Senate Bill 2807 (http://bit.ly/1Afrl69 ), known as the Iran Divestment Act. It would have prohibited state and local governments from doing business with any firm that sells at least $20 million of goods or services to Iran’s oil and gas sector. Collins said she introduced the bill at the request of Israeli Prime Minister Benjamin Netanyahu after she and Bryant visited Israel. \nWhile several other states have enacted similar bans, some Mississippi lawmakers raised concerns that Collins’ original proposal could hurt the state’s working relationship with Toyota Motor Corp. or its subsidiaries. Critics also questioned whether debating foreign policy was a good use of time by state legislators whose primary responsibilities are for budget and policy questions in the land mass bordered by Louisiana, Arkansas, Tennessee, Alabama and the Gulf of Mexico. \n“This is another example of out-of-state interest group legislation that has not been fully thought out, and after scrutiny, turns out to be bad for Mississippi,” Sen. David Blount, D-Jackson, said in February. \nCollins’ bill died in the Senate, but similar measure, House Bill 1127 (http://bit.ly/1AJmRhR ), made it through both chambers and was signed by Bryant. It became law July 1. \nCollins was elected to the Senate from Lee and Pontotoc counties in January 2011 to fill a vacancy after fellow Republican Alan Nunnelee of Tupelo moved up to the U.S. House. For the four-year term that started in January 2012, Republican Lt. Gov. Tate Reeves named Collins chairwoman of the Senate Accountability, Efficiency and Transparency Committee. \nAfter Nunnelee died of cancer early this year, Collins ran unsuccessfully in a special election to fill his congressional seat. Then, in the Aug. 4 Republican primary, she lost the state Senate seat to Chad McMahan, an alderman in Guntown. He is unopposed in the Nov. 3 general election and will start a four-year term in January. \nGandy was elected in November 2011 in a district in George, Greene, Stone and Wayne counties. Reeves appointed the freshman senator as chairman of the Senate Ethics Committee. \nFirst-term state Rep. Dennis DeBar of Leakesville defeated Gandy in this year’s Republican primary, and DeBar faces Democrat Towana A. Wright in the general election. \n____", "external_links": [], "published": "2015-10-19T00:01:00.000+03:00", "crawled": "2015-10-19T01:00:02.045+03:00", "highlightTitle": ""}