{"organizations": [], "uuid": "ad5ec86b71de7e4b5a805d814f0434b0cdb22a86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newswise.com", "main_image": "", "site_section": "http://www.newswise.com/legacy/feed/channels.php?channel=22", "section_title": "Newswise Breaking News Channel: U.S. Politics", "url": "http://www.newswise.com/articles/view/641862/?sc=c22", "country": "US", "title": "BGSU Poll: Celebrity Endorsements May Hurt Candidates More Than They Help", "performance_score": 0, "site": "newswise.com", "participants_count": 1, "title_full": "BGSU Poll: Celebrity Endorsements May Hurt Candidates More Than They Help", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:05:00.000+03:00", "replies_count": 0, "uuid": "ad5ec86b71de7e4b5a805d814f0434b0cdb22a86"}, "author": "Bowling Green State University", "url": "http://www.newswise.com/articles/view/641862/?sc=c22", "ord_in_thread": 0, "title": "BGSU Poll: Celebrity Endorsements May Hurt Candidates More Than They Help", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BGSU Poll: Celebrity Endorsements May Hurt Candidates More Than They Help Released: 22-Oct-2015 10:05 AM   \nNewswise — BOWLING GREEN, O.—Do endorsements, both traditional ones like newspapers and interest groups, but also non-traditional ones like celebrity endorsements, help or hurt candidates? \nA recent poll commissioned by Bowling Green State University and conducted by Zogby Analytics asked 804 likely 2016 general election voters in Ohio if a particular celebrity, interest group, or newspaper endorsed a candidate for President, would it make the voter more likely or less likely to vote for that candidate. The poll was conducted Oct. 16 and 17 and the results have a margin of error of plus or minus 3.5 percentage points. \nThe results are presented below: Endorser 24.3 -19.9 \nThe only endorsers that would bring a net gain to a Presidential candidate are the Cleveland Plain Dealer, The New York Times, and the UAW. All other endorsers are likely to repel more voters than they attract. This is especially true among celebrity endorsers. Musicians Beyoncé and Ted Nugent and actresses Lena Dunham and Eva Longoria are all “underwater” as celebrity endorsers by double digits, and Oprah Winfrey and country star Trace Adkins don’t do much better. \n“Traditionally we have thought of celebrity endorsements in mostly positive terms,” said Dr. David J. Jackson, professor of political science at Bowling Green State University. “But there is a downside, with polarizing celebrities potentially taking away as much electoral support as they bring.” \nShould candidates now start avoiding celebrity endorsements rather than courting them? “Perhaps not, but they should choose their endorsers carefully and deploy them selectively,” Jackson said. \nAmong all likely voters, country star Trace Adkins is a net drag on a presidential candidate to the tune of almost 9 points. However, among those who say country music is their favorite, this flips to 14.6 percent being more likely to support the candidate and only 7.3 percent being less likely, a net positive of 7.3 points. \nWhile Ted Nugent is a 13.4 point drag overall, among those sympathetic to the Tea Party, 29.4 percent would be positively influenced by Nugent’s endorsement, while about half that (15.3 percent) would be negatively influenced. \nOprah Winfrey is a 5.2 point drain on a candidate among voters overall, among African Americans she is a net positive of 20.7 points. \n“While the celebrities may not help among voters overall, they may help bring out support among key constituencies, and their popularity may help energize a campaign and add to fundraising,” said Jackson. \nThe BGSU poll explores attitudes on critical issues facing the citizens of Ohio and supports the research interests of the University’s faculty and students. The first set of results that break down candidate traits and who leads Ohio among primary voters, can be found here .", "external_links": [], "published": "2015-10-22T18:05:00.000+03:00", "crawled": "2015-10-24T12:35:50.036+03:00", "highlightTitle": ""}