{"organizations": [], "uuid": "b234ce50332aaa582970fa6714853590579494bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.westernmorningnews.co.uk", "main_image": "http://www.westernmorningnews.co.uk/images/localworld/ugc-images/276272/Article/images/27958240/11126745.jpg", "site_section": "http://www.westernmorningnews.co.uk/politics.rss", "section_title": "Western Morning News Politics RSS feed", "url": "http://www.westernmorningnews.co.uk/Chancellor-Lord-Geoffrey-Howe-dies-aged-88/story-27958240-detail/story.html", "country": "US", "title": "Former Chancellor Lord Geoffrey Howe dies aged 88", "performance_score": 0, "site": "westernmorningnews.co.uk", "participants_count": 1, "title_full": "Former Chancellor Lord Geoffrey Howe dies aged 88", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T15:35:00.000+03:00", "replies_count": 0, "uuid": "b234ce50332aaa582970fa6714853590579494bf"}, "author": "Western Morning News", "url": "http://www.westernmorningnews.co.uk/Chancellor-Lord-Geoffrey-Howe-dies-aged-88/story-27958240-detail/story.html", "ord_in_thread": 0, "title": "Former Chancellor Lord Geoffrey Howe dies aged 88", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments (0) \nGeoffrey Howe, the minister whose devastating resignation speech effectively ended Margaret Thatcher’s premiership, has died aged 88. \nTributes have been paid to the former chancellor from across the political spectrum after he suffered a suspected heart attack last night. \nLord Howe was Baroness Thatcher’s longest-serving Cabinet minister and their close partnership was crucial to many of her economic reforms. \nBut tensions over Europe eventually drove him to quit the government in November 1990, famously deploying a cricketing simile in his parting shot in the House of Commons. \nAccusing the prime minister of undermining economic and monetary union policies that were backed by her colleagues and the governor of the Bank of England, he declared: “It is rather like sending your opening batsmen to the crease, only for them to find, as the first balls are being bowled, that their bats have been broken before the game by the team captain.” \nLady Thatcher was herself forced to resign shortly after the verbal assault - contradicting Denis Healey’s memorable 1978 jibe that coming under fire from Howe was like being “savaged by a dead sheep”. \nDavid Cameron described Lord Howe as a “kind, gentle and deeply thoughtful man” who had “never stopped giving strong and sound advice”. \n“Geoffrey Howe was a kind, gentle and deeply thoughtful man – but at the same time he had huge courage and resolve,” the Prime Minister said. \n“His time as chancellor of the Exchequer was vital in turning the fortunes of our country around, cutting borrowing, lowering tax rates and conquering inflation. \n“Lifting exchange controls may seem obvious now, but it was revolutionary back then. He was the quiet hero of the first Thatcher government. \n“He loved his politics and never stopped giving strong and sound advice. George Osborne and I benefited greatly from his wisdom and determination to improve the state of the country. The Conservative family has lost one of its greats.” \nChancellor George Osborne said: “I will miss Geoffrey Howe. He was a great source of advice to me; a quietly-spoken radical, whose bitterly contested budgets rescued Britain.” \nFormer chancellor Lord Lamont said he was “deeply saddened” by the news. \n“He was a truly brilliant chancellor of the Exchequer. Behind the quiet unassuming demeanour there was steely determination, dogged consistency and a sense of direction,” he told Press Association. \n“He also had an impish sense of humour. Although he later fell out with Mrs Thatcher, they were for a long period a highly effective partnership, and she could not have succeeded without him. \n“He was a Tory with a social conscience, who wanted opportunity for all. He was also a great friend and mentor to me for over 50 years.” \nAnother ex-chancellor, Kenneth Clarke, recalled serving as parliamentary private secretary to Lord Howe in the 1970s Heath government. \nHe told the BBC: “I have regarded myself as an acolyte of Geoffrey Howe throughout my career – free market economics, a special conscience, internationalism, pro-European – and I always admired his pleasant demeanour, his unflappability as well as his steely resolve and his very, very good mind.” \nA statement issued by Lord Howe’s family said: “It is with deep sadness that the Howe family today announced that Geoffrey Howe died suddenly late yesterday evening, aged 88, at his home in Warwickshire, of a suspected heart attack, after enjoying a local jazz concert with his wife Elspeth. \n“There will be a private family funeral, followed by a memorial service in due course. The family would be grateful for privacy at this time.” \nLiberal Democrat leader Tim Farron described Lord Howe as a “kind, decent and honourable man”, while Labour frontbencher Chris Bryant praised his “gentle spirit, enquiring mind and internationalist outlook”.", "external_links": [], "published": "2015-10-10T15:35:00.000+03:00", "crawled": "2015-10-11T18:09:37.637+03:00", "highlightTitle": ""}