{"organizations": [], "uuid": "790b922749530431fa1b34a93350f5de5c8c6b5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-08/04/full/1438683116-7626.jpg", "site_section": "http://www.business-standard.com//rss/politics-155.rss#", "section_title": "Politics", "url": "http://www.business-standard.com/article/politics/nitish-can-t-develop-bihar-by-carrying-lalu-congress-shah-115100400498_1.html", "country": "IN", "title": "Nitish can't develop Bihar by carrying Lalu, Congress: Shah", "performance_score": 0, "site": "business-standard.com", "participants_count": 2, "title_full": "Nitish can't develop Bihar by carrying Lalu, Congress: Shah | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 1, "uuid": "32ad7678100961ac640cb916817296c424865431"}, "author": "Press Trust of India", "url": "http://www.business-standard.com/article/politics/nitish-can-t-develop-bihar-by-carrying-lalu-congress-shah-115100400498_1.html#post-0", "ord_in_thread": 0, "title": "Nitish can't develop Bihar by carrying Lalu, Congress: Shah", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BJP national president Amit Shah today said chief minister Nitish Kumar won’t be able to bring development to Bihar by carrying two allies, Congress and RJD, on his shoulders.\n\n“The Congress had presided over scam to the tune of Rs 12 lakh crore during the UPA rule at the Centre and the RJD had presided over ‘jungle raj’ during its 15-year rule... how can Nitish Kumar bring development to Bihar by carrying these two allies on his shoulders,” Shah told party workers at Nehru Stadium in Muzaffarpur town.\n\nUrging the electorate of Bihar not to get swayed by the bluff of the senior JD(U) leader, Shah warned that Bihar would end up with ‘jungle raj - 2’ in the event of the grand secular alliance coming to power.\n\nIn a broadside at the JD(U) leader, the BJP national president accused him of being a master of ‘politics of betrayal’ saying that he will not remain faithful to Bihar and its people given his penchant of betraying the socialist icons, namely Ram Manohar Lohia and Jai Prakash Narayan, BJP and lastly Jitan Ram Manjhi.\n\nALSO READ:  'Glorious' Bihar now in tatters because of 'jungle raj': Amit Shah \nKumar broke alliance with the BJP and betrayed the mandate from the people for his “sheer greed” for the post of prime minister and joined hands with the RJD supremo against whom he had fought all his life and later had no remorse in co-opting Congress against whom the socialist icons, Ram Manohar Lohia and Jai Prakash Narayan, had stood for all their lives, Shah said.\n\nDescribing Kumar as a habitual betrayer, Shah said the former took no time in becoming chief minister on the shoulders of the RJD supremo after junking the BJP despite the fact that the BJP workers had toiled hard against the RJD’s ‘jungle raj’ and made him the chief minister of Bihar in 2005.\n\nShah held the RJD supremo and the JD(U) leader collectively responsible for backwardness of Bihar by ignoring development in pursuit of caste politics and dynasty rule and promised that the BJP-led coalition will retrieve old glories of the state in the event of being elected to power at the hustings.", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T19:15:14.316+03:00", "highlightTitle": ""}