{"organizations": ["USA Today"], "uuid": "f7393e1b635fbdf82a03b83806c745be70de0211", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kgw.com", "main_image": "http://cdn.tegna-tv.com/-mm-/167e7c71488857ba10742c4e4f9c8ca95e59cc36/r=x1683&amp;c=3200x1680/http/www.gannett-cdn.com/-mm-/6ec3e2270262c8441c080e929e6a4fa3c73ae76f/c=7-0-3257-1836/local/-/media/2015/05/04/KGW/KGW/635663674566289022-20150429-122350.jpg", "site_section": "http://rssfeeds.kgw.com/_/20/108973500/kgw/politics", "section_title": "KGW - Politics", "url": "http://www.kgw.com/story/news/investigations/2015/09/10/multnomah-county-gets-nearly-2m-test-rape-kits/72012484/", "country": "US", "title": "Portland, Mult. Co. get nearly $4M to test rape kits", "performance_score": 0, "site": "kgw.com", "participants_count": 0, "title_full": "Portland, Mult. Co. get nearly $4M to test rape kits", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:23:00.000+03:00", "replies_count": 0, "uuid": "f7393e1b635fbdf82a03b83806c745be70de0211"}, "author": "", "url": "http://www.kgw.com/story/news/investigations/2015/09/10/multnomah-county-gets-nearly-2m-test-rape-kits/72012484/", "ord_in_thread": 0, "title": "Portland, Mult. Co. get nearly $4M to test rape kits", "locations": ["Manhattan", "Facebook Portland", "Portland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Biden", "Steve Reilly", "Cyrus Vance Jr"], "text": "Portland, Mult. Co. get nearly $4M to test rape kits Vice President Joe Biden and Manhattan District Attorney Cyrus Vance Jr. Post to Facebook Portland, Mult. Co. get nearly $4M to test rape kits Vice President Joe Biden and Manhattan District Attorney Cyrus Vance Jr.  //on.kgw.com/1UJDk0l   Portland, Mult. Co. get nearly $4M to test rape kits Portland’s back logged rape kits to be tested Steve Reilly, USA Today, and KGW Staff 3:23 p.m. PDT October 14, 2015 Rape kit documents CONNECT 10 TWEET LINKEDIN COMMENT EMAIL MORE \nVice President Joe Biden and Manhattan District Attorney Cyrus Vance Jr. on Thursday announced they will devote a combined $79 million to combat the accumulation of untested sexual assault kits held by police agencies across the country, including nearly $2 million for Multnomah County. \nThe combined grants from the Manhattan DA and the U.S. Justice Department will provide funds to more than 40 law enforcement jurisdictions coast to coast to pay for crime-lab processing of some of the nation's tens of thousands of untested sexual assault evidence kits. Among the recipients of funding: city police departments in Tallahassee, Fla., Austin, Tex., and Flint, Mich., as well as statewide law enforcement agencies in Ohio, Kentucky, Wisconsin and California, among many others . \nMultnomah County received one of the highest awards given with $1,995,453 in funds . It was the only Oregon county to receive money from the U.S. Justice Department to test kits. \nPortland also received a separate $1.19 million grant from the Bureau of Justice Assistance to test its backlog of 1,931 rape kits that have never been sent to a crime lab. \n\"The money will go to clear our entire inventory,\" said Portland police Sgt. Pete Simpson. Nearly 2,000 rape kits untested in Portland \n\"This is great news,\" said Danielle Tudor, a victim of Portland's \"Jogger Rapist\" and an advocate for clearing the rape kits backlog. \"It's such an important message to future rape victims: We care.\" \nVance characterized the combined grants as \"the single largest contribution toward ending the rape kit backlog that has ever been made.” At a typical processing cost of about $1,000 per rape kit, the money distributed to police agencies on Thursday could pay for the processing of untested evidence in nearly 40,000 sexual assault cases if it is used solely for the purpose of testing kits. \nAt least 70,000 rape test kits collected by more than 1,000 law enforcement agencies have not been sent to crime labs for testing, a USA TODAY Media Network investigation published in July found . While some law enforcement agencies test every sexual assault kit booked into evidence, others test as few as two in 10 due to inconsistent laws and policies between jurisdictions, and the lack of national protocols for handling the evidence. \nAcross the nation's 18,000 law enforcement agencies, the count of untested kits likely reaches into the hundreds of thousands. Testing costs approximately $1,000 per kit and money was among the reasons cited by some police agencies for why not all the sexual assault evidence is sent to crime labs. Thousands of rape kits in Portland, U.S. untested \n“Right now, it’s estimated there are hundreds of thousands of untested rape kits sitting in police storage facilities nationwide,\" Vance said. \"What stands in the way of testing them is money and the will to get the job done.” \nIn November 2014, Vance announced that his office would award up to $35 million to address the nation's accumulation of untested sexual assault kits, but increased his contribution by several million dollars on Thursday. In March, Biden announced that $41 million in funding to help eliminate the backlog of untested evidence. \nThe two funding streams targeted specifically toward alleviating rape kits backlogs are separate from broader annual allocations to the Justice Department for DNA testing. Attorney General Loretta Lynch joined Biden and Vance to announce the awards at a news conference in New York City. \nSexual assault kits contain forensic evidence collected from survivors of sex crimes through a painstaking process that can lead to valuable DNA evidence through crime lab testing. While testing the kits has proven to be effective in helping identify perpetrators through DNA matching in some sexual assault cases, tens of thousands of sexual assault kits remain untested in law enforcement evidence rooms across the country.", "external_links": [], "published": "2015-10-15T01:23:00.000+03:00", "crawled": "2015-10-15T01:48:18.113+03:00", "highlightTitle": ""}