{"organizations": [], "uuid": "bacac8b910cda0f2ae8028462ca1e5ffd20cccb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/0a/e6/f1e198d54a4da7dd9d578733e61a/151021-1-rand-paul-mitch-mcconnell-gty-1160.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/mitch-mcconnell-rand-paul-senate-bid-215097", "country": "US", "title": "McConnell presses Paul to focus on Senate bid", "performance_score": 3, "site": "politico.com", "participants_count": 2, "title_full": "McConnell presses Paul to focus on Senate bid - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T13:11:00.000+03:00", "replies_count": 2, "uuid": "bacac8b910cda0f2ae8028462ca1e5ffd20cccb7"}, "author": "Todd S. Purdum", "url": "http://www.politico.com/story/2015/10/mitch-mcconnell-rand-paul-senate-bid-215097", "ord_in_thread": 0, "title": "McConnell presses Paul to focus on Senate bid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senate Majority Leader Mitch McConnell and his allies are quietly ratcheting up pressure on Rand Paul to pay more attention to his Senate reelection next year — and less to his flagging 2016 presidential candidacy. So far, those efforts have stopped short of urging the Kentucky senator, whose presidential bid McConnell has formally endorsed, to outright abandon his national campaign. But there are growing concerns that Paul, as a senator still in his first term in office, is courting trouble by dividing his time between the two races, raising the prospect that a rock-ribbed Republican seat could be put into play and jeopardize McConnell’s fragile 54-seat GOP majority.\nMcConnell and Paul themselves have spoken about the issue with increasingly regularity in recent weeks, according to people familiar with their conversations. And last month, one of the top lieutenants charged with protecting the Senate Republican majority called Doug Stafford, the chief strategist for Paul’s presidential campaign, to the headquarters of the National Republican Senatorial Committee for a one-on-one meeting.\nThere, Ward Baker, a blunt-spoken former Marine and the NRSC’s executive director, told Stafford that Paul’s dual campaigns were coming with a cost. Baker laid out recent polling the NRSC had commissioned on Paul’s standing in his home state and the results were bleak, according to multiple Republicans briefed on the survey. Baker told him that it was time for Paul, whose presidential campaign has dipped in the polls and flat-lined at fundraising, to refocus on his reelection.\nThe meeting, confirmed to POLITICO by three people briefed on the conversation, represented a key moment in the quiet push to get Paul and his team to realize that, come next summer, the junior senator from Kentucky is far more likely to be campaigning for reelection in Louisville than crowned as the GOP nominee in Cleveland.\n“We don’t have unlimited patience,” said a top Senate Republican operative of Paul’s presidential candidacy.\nThere is fresh urgency after Paul’s third-quarter Senate report, filed on Wednesday, showed he had raised a paltry $156,590 for his reelection in the last quarter, a small sum for a House candidate, let alone a nationally known Senate incumbent.\n“His reelection to the Senate is not a forgone conclusion,” warned Ted Jackson, a veteran Republican political strategist in Kentucky.\nSince the Stafford-Baker meeting, Paul has upped his Washington fundraising for the Senate, held a briefing for Kentucky-tied politicos in Washington and promised to bulk up his Senate operation, announcing that respected strategist Chris LaCivita, widely credited with saving Kansas Sen. Pat Roberts’ floundering campaign last cycle, would work on Paul’s Senate race, in addition to the presidential campaign.\nPaul denied to POLITICO that either McConnell, or the NRSC has urged him to concentrate on his Senate race. “No,” he said, “No.”\nCongress\nThe fragile marriage of Ryan and the Freedom Caucus By Lauren French\n“I’m running for president and that’s the answer. It’s pretty simple,” Paul said. He downplayed any talk of trouble in Kentucky. “I have no opponent and I probably have the highest poll numbers in the state.”\nPaul began the year as one of the top-tier 2016 contenders but has plummeted to the bottom of the pack, placing eighth in the most recent Real Clear Politics national polling average. He raised $2.5 million last quarter, ninth most in the presidential field.\nPaul blames the media for repeated questions about his future. “You guys come up with conclusions you want to write about, but it’s not true,” Paul complained. “How many stories do you think that are online saying that: ‘Oh, he’s struggling in Kentucky and needs to get out of the race.’ Those are conclusions, and that’s someone’s opinion. Those are op-eds. They’re not accurate.”\nIt’s true that Paul is in no immediate danger of losing reelection. The concern appears to be more that McConnell doesn’t want to spend any of his limited resources — his time or the NRSC’s money — on Kentucky’s Senate seat in 2016.\nThe McConnell-Paul relationship has been one of Washington’s — and Kentucky’s — most mutually beneficial and fascinating in recent years. McConnell has stood behind Paul since endorsing him last fall, returning the favor after Paul endorsed him against a 2014 tea-party challenger. Earlier this year, McConnell supported Paul’s push for Kentucky to convert its 2016 primary to a caucus, allowing Paul to run for both offices simultaneously. And when Paul raided his Senate account for $1.4 million to jump-start his presidential bid back in April, McConnell kept quiet.\nBut as donors and activists in Kentucky grumble about Paul’s absence from the state — he noticeably skipped the state’s signature political event known as Fancy Farm this summer — Senate leadership is firing off warning shots in Paul’s direction.\nFew of the more than a dozen operatives, lobbyists and activists interviewed for this story would speak on the record as most, both in Washington and Kentucky, remain supportive of Paul’s reelection and don’t want to be seen as crossing or criticizing a sitting senator.\nJackson, the Kentucky GOP strategist, said the challenge is that Paul, a first-term senator, “doesn’t have a long political history in Kentucky.”\n2016\n5 takeaways from Clinton's marathon Benghazi testimony By Glenn Thrush and Gabriel Debenedetti\n“He’s new to politics. He doesn’t have deep personal relationships even among the Republican hierarchy throughout the state. That’s very important to understand. Those are real liabilities,” Jackson said. “If you have those deep party relationships, you have more latitude,” he added. And Paul doesn’t. “He needs to decide pretty damn soon what his intentions are.”\nStill, there is no agreed-upon timeline for Paul to act. Bill Stone, a former chairman of Jefferson County Republican Party in Kentucky, said Paul has “built up a lot of goodwill among Republican voters” and is getting a pass on running for two offices from most Kentucky activists, at least through the early 2016 contests.\n“At the end of the New Hampshire primary, if he’s down in the polls, I think most Kentuckians would say it’s time to close it out,” Stone said.\nBoth Baker and Stafford, who are close and talk regularly, declined to speak about their September meeting. But Stafford said in an email Paul would continue his dual-track campaigns, noting that Paul has maintained a solid voting record in the Senate throughout 2015.\n“He believes the taxpayers of Kentucky are deserving of this effort and he gives it,” Stafford said. “He ran a full-time solo medical practice while running for Senate the first time so this is nothing new for him.”\nNRSC Communications Director Andrea Bozek said, “We meet with Senate campaign teams everyday and we do not discuss our internal conversations publicly.”\nMcConnell’s office declined to comment for this story.\nStafford appears to have gotten the message. By late September, he was making a round of calls to many top Republicans on K Street with a plea for help. The third-quarter Federal Election Commission deadline was looming and Paul needed to raise some cash — and fast. Paul would soon report burning through $1.86 for every $1 it raised that quarter for his presidential campaign, by far the worst figure for any candidate on the top-tier debate stage. But Stafford wasn’t dialing for presidential dollars. He was scrounging up Senate funds.\n“It was a panic call,” said one person on the receiving end of Stafford’s request. Paul spent the final day of September attending a Senate fundraising lunch at a Capitol Hill townhouse.\nThe latest Senate fundraising report shows why: Aside from his anemic $156,000 haul, Paul spent nearly that much on operating expenses, and transferred another $149,000 to the Republican Party of Kentucky to pay for next year’s presidential caucuses. Paul ended the quarter with $1.4 million cash on hand — less than he had at the start of the quarter. By contrast, neighboring Republican Sen. Rob Portman of Ohio had $11.1 million.\nOf late, McConnell has joined Paul at some events, providing him with some additional star power to attract K Street money. At one event, as Paul spoke about the state of his Senate race, he mispronounced the name of the Rowan County, where County Clerk Kim Davis drew national attention over her recent arrest for refusing to issue gay-marriage licenses. Those in the crowd familiar with Kentucky grimaced.\n“It was just one of those moments where you were like, he doesn’t have a connection,” said one attendee.\nPaul and Stafford have been telling donors that they will not transfer any additional money from his Senate race to presidential campaign — one Paul supporter explained that lobbyists had been “pissed” that he transferred money from his Senate account to his presidential campaign. [While they want to help aide the Kentucky Republican in his reelection bid many are backing other GOP presidential contenders, the supporter said.]\nThe 13 top moments from Clinton's Benghazi testimony By Nick Gass\nPaul doesn’t just have Senate money woes. His presidential campaign dramatically cut back on its spending pace in the third quarter, a POLITICO analysis of federal records shows. Paul spent $2.95 million in July, $982,445 in August, and only $610,648 in September. His “online advertising” budget, for instance, plummeted from $446,000 in July to $0 in September (though Paul’s campaign does owe undated debts for more than $60,000 of online advertising).\nThe idea that Paul is gasping for air in presidential race — or even at risk in the Senate race — is a source of great aggravation to Paul’s team. His camp pushes back aggressively on the “false narrative,” as they called it in a memo last week, that the senator is “on the ropes.” Paul finished in fifth place in a recent CNN poll and qualified for the main stage at the third debate, they point out. He also has won some recent straw polls that measure organizational muscle. And his advisers insist that any concern over the Senate race is especially overwrought, as Democrats don’t even have a challenger yet.\n“There’s nothing but an imagined candidate that exists right now,” said LaCivita, the senior Paul adviser.\nKentucky Democratic State Auditor Adam Edelen, a respected but relatively untested political talent, is widely rumored to be considering a run, but he must first win reelection next month.\n“Adam is maybe the best speaker among major political figures in Kentucky,” said Trey Grayson, president of the Northern Kentucky Chamber of Commerce and the former Republican secretary of state who lost to Paul in the Senate Republican primary in 2010.\nPerhaps the most telling sign of Paul’s current circumstances is a conversation that is not happening: Who would replace him on the ballot for Senate in Kentucky in the event his presidential bid catches fire. The caucuses held next March are only a temporary workaround for the Kentucky law that forbids a candidate from appearing on the same ballot twice.\nSteve Robertson, the chairman of the Kentucky Republican Party, said Republicans either need another candidate to file for Senate in January — some kind of straw candidate who could step aside if Paul dropped out of the presidential campaign and run only if Paul won the nomination — or fight it out in the courts.\nBut Republican officials in Washington and Kentucky say there has been precious little talk about either scenario because a Paul nomination now seems so unlikely.\n“At the end of the day, Sen. Paul has got to first make a determination of where he’s headed and that’s a question only he can answer,” Robertson said. “If we get to the bridge, we will cross it.\nBurgess Everett and Theodoric Meyer contributed to this report.\n<div", "external_links": [], "published": "2015-10-23T13:11:00.000+03:00", "crawled": "2015-10-23T14:03:33.839+03:00", "highlightTitle": ""}