{"organizations": [], "uuid": "3c21f06539e5aa92dadd167bc4d9627ee34f8e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.necn.com", "main_image": "http://media.necn.com/images/1200*675/biden-GettyImages-493591496.jpg", "site_section": "http://www.necn.com/news/politics/?rss=y&embedThumb=y&summary=y", "section_title": "NECN - Politics", "url": "http://www.necn.com/news/politics/New-Hampshire-Voters-Weigh-in-on-Bidens-Decision-Not-to-Run-335298541.html", "country": "US", "title": "NH Voters Weigh in on Biden's Decision", "performance_score": 0, "site": "necn.com", "participants_count": 1, "title_full": "NH Voters Weigh in on Biden's Decision", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T01:47:00.000+03:00", "replies_count": 0, "uuid": "3c21f06539e5aa92dadd167bc4d9627ee34f8e71"}, "author": "KATHERINE UNDERWOOD", "url": "http://www.necn.com/news/politics/New-Hampshire-Voters-Weigh-in-on-Bidens-Decision-Not-to-Run-335298541.html", "ord_in_thread": 0, "title": "NH Voters Weigh in on Biden's Decision", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The latest news from around the state New Hampshire Voters Weigh in on Biden's Decision Not to Run New Hampshire Voters Weigh in on Biden's... Link Close Embed this video <script type=\"text/javascript\" charset=\"UTF-8\" src=\"http://www.necn.com/portableplayer/?cmsID=335278091&videoID=iKBJjXxrPWx0&origin=necn.com&sec=news&subsec=politics&width=600&height=360\"></script> More videos (1 of 9) « » Residents in the first-in-the-nation primary state are weighing in on Vice President Joe Biden's decision not to run for president. (Published Wednesday, Oct. 21, 2015) Residents in New Hampshire are weighing in on Vice President Joe Biden's decision not to run for president. Many voters who spoke to necn Wednesday agree with Biden, saying he missed the window of opportunity to throw his hat into the ring. Some say they're glad they can now focus on the field of candidates and not speculation. Inside the Airport Diner in Manchester, there was a lot of talk about Biden. Med School Professor Accused of Taking Pics of Woman in Bathroom \"I was happy he bowed out at the time he did so it leaves it open for other candidates,\" said Hudson resident Richard Burt. \"I think he should just ride off into the sunset,\" said Mark Stearns of Goffstown. \"I never cared for him, anyway.\" PD: Man Tried to Dump $10K in Crack, Heroin Down Sink Even though Biden is not running for president, he's still impacting the race, according to political analyst Scott Spradling. \"I think this is best possible news for Hillary Clinton,\" said political analyst Scott Spradling. \"His entrance into the race was most likely going to pull away her supporters.\" Updated Fire Lt. on Leave After Alleged Threat to Teacher Instead, Clinton is gaining in the polls. For the first time in several months, Clinton has taken the lead over Vermont Senator Bernie Sanders in the first-in-the-nation primary state. Farm Stands Burglarized in Massachusetts In a WBUR poll released Wednesday morning, Clinton tops Sanders 38 to 34 percent among likely primary voters. \"She did excellent in the debate and got her opinion across and I was hoping for that,\" said Janice Burt of Hudson. Driver Charged in On-Camera Motorcycle Crash After a side-by-side comparison at the first and only democratic debate thus far, Spradling says this race appears to be more about personality than policy. \"We saw Hillary Clinton look presidential, give strong answers, stay within herself, and most importantly, not make any major errors,\" Spradling said. Voters in the first in the nation primary state know the polls aren't a promise. Video High School Football Team Suspended Over Raunchy Chat And they say that's especially true this time around. \"We've never seen a field this big, we've never seen outsiders do so well this late into the game, and so yes, anything can happen,\" Spradling said. \"I think people have to wait and see how it all turns out.\" said June Craig of Manchester. Several national polls have Clinton leading Sanders by more than 20 points. Spradling says that gap will widen now that Biden is out of the conversation. Published at 6:47 PM EDT on Oct 21, 2015", "external_links": [], "published": "2015-10-22T01:47:00.000+03:00", "crawled": "2015-10-22T11:46:22.923+03:00", "highlightTitle": ""}