{"organizations": ["Congress ATLANTA"], "uuid": "d0294161f4e6181ca2a849eeb7fc48f6d260e924", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s2.reutersmedia.net/resources/r/?m=02&d=20151005&t=2&i=1084746064&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB940GD", "site_section": "http://feeds.reuters.com/reuters/politicsNews/", "section_title": "Reuters: Politics", "url": "http://www.reuters.com/article/2015/10/05/us-trade-tpp-idUSKCN0RZ0ZV20151005?feedType=RSS&feedName=politicsNews", "country": "US", "title": "Historic Pacific trade deal faces skeptics in Congress", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Historic Pacific trade deal faces skeptics in Congress", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T02:09:00.000+03:00", "replies_count": 0, "uuid": "d0294161f4e6181ca2a849eeb7fc48f6d260e924"}, "author": "", "url": "http://www.reuters.com/article/2015/10/05/us-trade-tpp-idUSKCN0RZ0ZV20151005?feedType=RSS&feedName=politicsNews", "ord_in_thread": 0, "title": "Historic Pacific trade deal faces skeptics in Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Krista Hughes", "Kevin Krolicki"], "text": "ATLANTA | By Krista Hughes and Kevin Krolicki \nATLANTA Twelve Pacific Rim countries on Monday reached the most ambitious trade pact in a generation, aiming to liberalize commerce in 40 percent of the world's economy in a deal that faces skepticism from U.S. lawmakers. \nThe Trans-Pacific Partnership (TPP) pact struck in Atlanta after marathon talks could reshape industries, change the cost of products from cheese to cancer treatments and have repercussions for drug companies and automakers. \nTired negotiators worked round the clock over the weekend to settle tough issues such as monopoly rights for new biotech drugs. New Zealand's demand for greater access for its dairy exports was only settled at 5 a.m. EDT on Monday. \nIf approved, the TPP pact would cut trade barriers and set common standards for a region stretching from Vietnam to Canada. It would also furnish a legacy-shaping victory for U.S. President Barack Obama, who will further promote the agreement on Tuesday in remarks to business leaders in Washington. \nThe Obama administration hopes the pact will help the United States increase its influence in East Asia and help counter the rise of China, which is not one of the TPP nations. \nLawmakers in the United States and other TPP countries must approve the deal. Five years in the making, it would reduce or eliminate tariffs on almost 18,000 categories of goods. \nInitial reaction from U.S. Congress members, including Democrats and Republicans, ranged from cautious to skeptical. \nVermont Senator Bernie Sanders, a Democratic presidential candidate, warned the pact would cost jobs and hurt consumers. \"In the Senate, I will do all that I can to defeat the TPP agreement,\" he tweeted. \nMany of Obama's Democrats, as well as labor groups, fear the TPP will cost manufacturing jobs and weaken environmental laws. \nSenator Orrin Hatch, a powerful Republican who heads the Senate Finance Committee, was wary. \"I am afraid this deal appears to fall woefully short,\" said Hatch, who had urged the administration to hold the line on intellectual property protections, including for drugs. \nU.S. lawmakers have the power to review the agreement and cast an up-or-down vote, but not amend it. \n\"This is really a 2016 issue for Congress to consider, not a 2015 issue,\" U.S. Trade Representative Michael Froman said. \nCURRENCY, DRUG, DAIRY, AUTO POLICIES \nMinisters said the agreement will include a forum for finance ministers from participating countries to discuss currency policy principles. This takes into account, in part, concerns among U.S. manufacturers and critics who suggest Japan has unfairly driven the yen lower to the benefit of its car exporters and other companies. \nBut Democratic Representative Debbie Dingell from Michigan, home of the U.S. auto industry, said currency has not been fully dealt with. \"Nothing that we have heard indicates negotiators sufficiently addressed these issues,\" she said in a statement. \nThe United States and Australia negotiated a compromise on the minimum period of protection to the rights for data used to make biologic drugs. Companies such as Pfizer Inc, Roche Group’s Genentech and Japan's Takeda Pharmaceutical Co could be affected. \nNegotiators agreed on terms short of what the United States had sought. Under the deal, countries would give drugmakers at least five years of exclusive access to the clinical data used to win approval for new drugs. An additional several years of regulatory review would likely mean drug companies would have an effective monopoly for about eight years before facing lower-cost, generic competition, officials said. \nPolitically charged dairy farming issues were addressed in the final hours of talks, officials said. New Zealand, home to the world's biggest dairy exporter, Fonterra, wanted increased access to U.S., Canadian and Japanese markets. \nNew Zealand Prime Minister John Key said the deal would cut tariffs on 93 percent of New Zealand's exports to the United States, Japan, Canada, Mexico and Peru. “We’re disappointed there wasn’t agreement to eliminate all dairy tariffs but overall it’s a very good deal for New Zealand,” Key said. \nThe United States, Mexico, Canada and Japan agreed to auto trade rules on how much of a vehicle must be made within the TPP region to qualify for duty-free status. \nThe TPP would give Japan's automakers, led by Toyota MotorCorp, a freer hand to buy parts from Asia for vehicles sold in the United States, but sets long phase-out periods for U.S. tariffs on Japanese cars and light trucks. \nThe deal between Australia, Brunei, Canada, Chile, Japan, Malaysia, Mexico, New Zealand, Peru, Singapore, the United States and Vietnam also sets minimum standards on issues ranging from workers' rights to environmental protection. \nTrade ministers said the TPP would be open to other countries in the future, including potentially China. \n\"There is a real opportunity for China to be a part of this,\" Malaysian Trade Minister Mustapa Mohamed said. \n(Writing by Alistair Bell ; Additional reporting by Richard Cowan in Washington, Ana Isabel Martinez in Mexico City and Cecile Lefort in Wellington; Editing by Kevin Drawbaugh and Meredith Mazzilli) Trade ministers from a dozen Pacific nations in Trans-Pacific Partnership Ministers meeting post in TPP Ministers 'Family Photo' in Atlanta, Georgia October 1, 2015. Reuters/USTR Press Office/Handout 1 of 2 right A woman from the Muong ethnic tribe works on her green tea hills which produce black tea for export in Tan Son, outside Hanoi, October 4, 2015. Reuters/Kham", "external_links": [], "published": "2015-10-06T02:09:00.000+03:00", "crawled": "2015-10-06T02:46:10.912+03:00", "highlightTitle": ""}