{"organizations": [], "uuid": "74be71047cb4a73d25221e05b1d956abc00278a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/c", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30232359/foresters-kaboom-and-volunteers-bring-families-together-with-new-playground-at-imagine-desert-west", "country": "US", "title": "Foresters, KaBOOM! and volunteers bring families together with new playground at Imagine Desert West", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Foresters, KaBOOM! and volunteers bring families together with new playground at Imagine Desert West - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "74be71047cb4a73d25221e05b1d956abc00278a6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30232359/foresters-kaboom-and-volunteers-bring-families-together-with-new-playground-at-imagine-desert-west", "ord_in_thread": 0, "title": "Foresters, KaBOOM! and volunteers bring families together with new playground at Imagine Desert West", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Foresters\nPlayground will enhance family and community well-being\nPHOENIX , Oct. 10, 2015 /PRNewswire/ - The Phoenix community was revitalized today thanks to a new playground built at Imagine Desert West. In less than eight hours, more than 200 volunteers from Foresters™, Imagine Desert West and non-profit KaBOOM! created the new play space, which will serve more than 300,000 children and their families in the local community for years to come.\n\"A community's well-being starts with a child's well-being,\" said Anthony M. Garcia , President and CEO, Foresters. \"Playgrounds are important to communities, providing an open space where children can play safely. We believe that an investment in a playground is an investment in family well-being, and we are happy to provide the Phoenix community with a place that families can enjoy for years to come.\"\nThe design for the new playground is based on drawings created by neighborhood children at a special Design Day event held in August when community members met with organizers from KaBOOM! and Foresters to design their dream playground. The drawings inspired the final playground design.\nSince 2006, Foresters, an international financial services provider, has invested over $10 million with KaBOOM! to build over 120 playgrounds across the US and Canada by the end of 2015. Over their 15-year lifespan, these playgrounds will provide more than 4 million children and their families with an opportunity to spend quality time together and enhance family well-being.\n\"Imagine Schools is grateful to receive this brand new playspace,\" said Jason Bryant , CEO and President, Imagine Schools, Inc. \"It's thanks to partners like Foresters and KaBOOM! that we can help children and their families create opportunities to spend quality time together and enhance their well-being.\"\nGreen spaces and safe play structures where children and families can enjoy and spend time together are sparse in many high density communities. Playing outdoors is an important part of every child's healthy development and the creation of this new playground will allow thousands of children to play safely and be active in their community.\nForesters is a founding member of the KaBOOM! Leadership Circle – a group of organizations providing long-term guidance and support to KaBOOM! and its mission. Since 1996, KaBOOM! has been dedicated to the bold goal of ensuring that all children get the balance of active play they need to become healthy and successful adults because #playmatters.\nAbout Imagine Desert West\nAs a national family of public charter school campuses, Imagine Schools partners with parents and guardians in the education of their children by providing high quality schools that prepare students for lives of leadership, accomplishment, and exemplary character. Imagine Schools' vision is for every student to reach his or her full potential and discover the pathways for lifelong success.\nAbout Foresters\nFor more than 140 years, Foresters™, an international financial services provider, has fulfilled its purpose to enhance family well-being for its members and the communities where they live. A fraternal benefit society, Foresters offers quality life insurance and investment products, unique member benefits and inspiring community activities. Foresters shares its financial strength with over one million members in Canada , the United States and the United Kingdom. For more information, visit foresters.com .\nForesters™ is the trade name and a trademark of The Independent Order of Foresters, a fraternal benefit society, 789 Don Mills Road, Toronto, Canada M3C 1T9; its subsidiaries are licensed to use this mark.\nAbout KaBOOM!\nKaBOOM! is the national non-profit dedicated to giving all kids – particularly those growing up in poverty in America – the childhood they deserve filled with balanced and active play, so they can thrive. Since 1996, KaBOOM! has collaborated with partners to build, open or improve nearly 16,300 playgrounds, engaged more than one million volunteers and served 8.1 million kids. KaBOOM! creates great places to play, inspires communities to promote and support play, and works to drive the national discussion about the importance of play in fostering healthy and productive lives. To learn why #playmatters: visit kaboom.org or join the conversation at twitter.com/kaboom or facebook.com/kaboom .\nFun Facts Sheet: http://files.newswire.ca/1431/Phoenix.pdf\n ", "external_links": ["http://www.foresters.com/us-en/Pages/default.aspx#.VSw2wfnF9Zs", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=TO24622&Transmission_Id=201510101800PR_NEWS_USPR_____TO24622&DateId=20151010", "http://kaboom.org/", "http://www.facebook.com/kaboom", "http://files.newswire.ca/1431/Phoenix.pdf", "http://twitter.com/kaboom"], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-11T01:38:02.641+03:00", "highlightTitle": ""}