{"organizations": ["Tory"], "uuid": "3d9c09b5ae74cdfd993e39ea998d09f0d7da37fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.heraldscotland.com", "main_image": "http://www.heraldscotland.com/resources/images/4366643/", "site_section": "http://www.heraldscotland.com/politics/political_news/rss/", "section_title": "Herald Scotland | Other Political News", "url": "http://www.heraldscotland.com/politics/political_news/13895232.Pressure_on_Tory_ministers_as_analysis_suggests_Trident_costs_have_grown_to___167bn/?ref=rss", "country": "", "title": "Pressure on Tory ministers as analysis suggests Trident costs have grown to £167bn", "performance_score": 0, "site": "heraldscotland.com", "participants_count": 0, "title_full": "Pressure on Tory ministers as analysis suggests Trident costs have grown to £167bn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:08:00.000+02:00", "replies_count": 0, "uuid": "3d9c09b5ae74cdfd993e39ea998d09f0d7da37fa"}, "author": "", "url": "http://www.heraldscotland.com/politics/political_news/13895232.Pressure_on_Tory_ministers_as_analysis_suggests_Trident_costs_have_grown_to___167bn/?ref=rss", "ord_in_thread": 0, "title": "Pressure on Tory ministers as analysis suggests Trident costs have grown to £167bn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pressure on Tory ministers as analysis suggests Trident costs have grown to £167bn Crispin Blunt 8 comments \nTHE cost of replacing Britain's nuclear deterrent has ballooned to £167 billion, according to new analysis which has sparked a wave of criticism and fresh calls for renewal plans to be scrapped. \nThe new figure suggests the pricetag for Trident will be significantly higher than the £100bn previously estimated and SNP and Tory politicians questioned how UK ministers could be planning to spend an \"unthinkable\" sum just as the welfare system is facing budget cuts. \nThe senior Conservative MP behind the analysis also said £167bn was too high a cost to be \"rational or sensible\" as David Cameron's government came under increasing pressure to set out the price of replacing Trident. \nLoading article content \nSNP Deputy Leader Stewart Hosie said: “This is truly an unthinkable and indefensible sum of money to spend on the renewal of an unwanted and unusable nuclear weapons system while thousands of people across the UK are struggling to afford basics like food as a result of the Tories’ obsession with austerity. \n“The UK Government is facing a United Nations probe over its cuts to support for disabled people and yet the Government’s own figures reveal that they are prepared to spend an astronomical £167 billion dumping four new Trident submarines on the Clyde.” \nOpponents argue it is wrong to spend billions replacing a weapons system that will never be used at a time of swingeing public spending and welfare cuts. \nBut Tory ministers insist a like-for-like replacement is needed to secure the UK’s defences in an unsafe world. \nThe new calculation was released just days before a crunch vote on Trident is expected at Scottish Labour’s annual conference in Perth. Promoted stories \nThe result could leave the party in Scotland calling for the abolition of the UK’s nuclear deterrent, while backing its replacement south of the border. \nMPs are expected to vote on the future of the ageing deterrent on the Clyde next year. \nEarlier this week defence minister Philip Dunne revealed in a written parliamentary answer to Mr Blunt that the cost of acquiring the planned four new submarines would be £25bn. \nCrispin Blunt, the chairman of the Commons Foreign Affairs Select Committee, said his analysis suggested that the pricetag would be significantly higher than the £100bn previously estimated. \nMr Blunt, who was a special adviser to Malcolm Rifkind when he was Defence Secretary, said: \"My office's calculation based on an in-service date of 2028 and a missile extension until 2060 ... the total cost is £167bn.\" \nHe added: \"The successor Trident programme is going to consume more than double the proportion of the defence budget of its predecessor ... The price required, both from the UK taxpayer and our conventional forces, is now too high to be rational or sensible.\" \nThe figure is in part based on the Conservative’s pledge to spend two percent of gross domestic product (GDP) on defence and ‘in service’ costs of around six per cent of GDP. \nA Ministry of Defence spokesman said ministers had published a review which demonstrated “that no alternative system is as capable, or as cost-effective, as a Trident-based deterrent\". \nHe added: \"At around six per cent of the annual defence budget, the in-service costs of the UK's national deterrent ... are affordable and represent an investment in a capability which plays an important role in ensuring the UK's national security.\" \nEarlier this month Jon Thompson, the top civil servant at the Ministry of Defence, described the programme to replace the nuclear deterrent as a \"monster\" and said it was extremely difficult to estimate what the future costs. \nMr Hosie added: “It was already ludicrous to consider the renewal of Trident when the cost was £100 billion but these figures show just how dangerous the Tories’ obsession with nuclear really is. \n“How can Tory MPs expect to be able to look their constituents in the eye when on the one hand they are taking thousands of pounds from hard-working low income families who rely on tax credits and with the other they plan to pour money into brand new weapons of mass destruction?\" \nScottish Liberal Democrat leader Willie Rennie MSP said: \"These staggering new cost estimates confirm what we already knew. A like-for-like replacement for Trident is absolutely the wrong option.\" \nLast week David Cameron told MPs it was “right” to maintain the UK’s independent nuclear deterrent “and anyone who has any doubts of it only has to look at the dangers and uncertainty in our world\". Share article \nLabour leader Jeremy Corbyn, who is stridently opposed to Trident renewal, is due to miss Scottish Labour’s vote on the issue if it goes ahead as expected on Sunday. \nWhile Mr Corbyn will attend the Scottish Labour conference he is due to leave Perth before the debate begins. Promoted Stories", "external_links": [], "published": "2015-10-26T02:08:00.000+02:00", "crawled": "2015-10-26T05:24:43.259+02:00", "highlightTitle": ""}