{"organizations": [], "uuid": "52745399107bacc1036eb7571134c8386c905225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chinatopix.com", "main_image": "http://images.chinatopix.com/data/images/full/61154/uranium-is-being-used-for-creating-a-bomb.jpg", "site_section": "http://www.chinatopix.com/politics", "section_title": "Politics : Chinatopix", "url": "http://www.chinatopix.com/articles/66645/20151007/nuclear-smuggled-bomb.htm", "country": "US", "title": "Nuclear Smuggled To Bomb the US : Politics", "performance_score": 0, "site": "chinatopix.com", "participants_count": 1, "title_full": "Nuclear Smuggled To Bomb the US : Politics : Chinatopix", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T08:59:00.000+03:00", "replies_count": 0, "uuid": "52745399107bacc1036eb7571134c8386c905225"}, "author": "Darlene Tverdohleb", "url": "http://www.chinatopix.com/articles/66645/20151007/nuclear-smuggled-bomb.htm", "ord_in_thread": 0, "title": "Nuclear Smuggled To Bomb the US : Politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "7 2 (Photo : Youtube) Uranium is being used for creating a bomb.\nIn Chisinau, Moldova, which borders Romania, two men were plotting their deal as the arms smuggler made his pitch to a client with 2.5 million euros, which is enough for radioactive cesium to contaminate several blocks of a city.\nLike Us on Facebook\nValentin Grossu, the smuggler, said to the client that the latter can make a dirty bomb that is perfect for the Islamic State and that if the latter has a connection with the group, then the business would go smoothly.\nHowever, Grossu did not know if the client was for real and was worried. He was right about his gut because the client was an informant, and it was a sting operation that made the smuggler land in jail, as stated by Chicago Tribune .\nThe first known case of selling bomb-grade uranium to a Middle East real buyer, who is suspected to have ties with Russian networks in selling radioactive material to the extremist group via Moldova, was uncovered. There were at least four attempts of investigation within five years.\nThat one with Moldova operation showed that a middleman for the gang has ranted repeatedly regarding his hatred for the U.S. as he smuggled the essential material for a nuclear bomb and blueprints for a dirty bomb to a Middle Eastern buyer. Wiretaps, video tapes and interviews with investigators were done.\nIn addition, a thriving nuclear black market has emerged in the Eastern Europe to peddle radioactive materials repeatedly, particularly in Moldova, which is a former Soviet Union nation. Nevertheless, Moldovan police as well as judicial authorities said that smugglers are finding ways to move parts of Russia's vast store of radioactive materials to bomb the U.S.\nIn line with this, Huffington Post also reported that operations built were partnered between FBI and the Moldovan investigators. The latter are well aware of the lethal consequences of just one slip-up operation.\nConversations that were wiretapped exposed plots that target the U.S. in which at one point the middleman told an informant who was posing as a buyer that it is important to smuggle uranium to Arab countries.\nTag: nuclear bomb nuclear smuggler black market Russian arsenal Islamic State ", "external_links": ["https://www.youtube.com/embed/oYITZgW96zg", "https://www.facebook.com/Chinatopix", "http://trends.revcontent.com/serve.js.php?w=3369&t=", "http://www.chicagotribune.com/news/nationworld/ct-nuclear-smugglers-islamic-state-terrorists-20151006-story.html", "http://www.huffingtonpost.com/entry/nuclear-smugglers-shopped-radioactive-material-to-isis-terrorists_561470c1e4b021e856d2cfa0"], "published": "2015-10-07T08:59:00.000+03:00", "crawled": "2015-10-08T04:30:48.849+03:00", "highlightTitle": ""}