{"organizations": [], "uuid": "6d7b0a9e2f649b4ae2b69bef2bd1d9768bc9d9c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.journal-news.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/10/08/e5/90/5926406673b047a7a34f1177e01014da-eb0931d729d841f19231bb75dbfeb060-0.jpg", "site_section": "http://www.journal-news.com/feeds/categories/political/", "section_title": "News | Political", "url": "http://www.journal-news.com/ap/ap/top-news/anonymous-donors-send-millions-to-pro-rubio-group/nnxq4/", "country": "US", "title": "Anonymous donors send millions to pro-Rubio group", "performance_score": 0, "site": "journal-news.com", "participants_count": 0, "title_full": "Anonymous donors send millions to pro-Rubio group", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T10:58:00.000+03:00", "replies_count": 0, "uuid": "6d7b0a9e2f649b4ae2b69bef2bd1d9768bc9d9c0"}, "author": "", "url": "http://www.journal-news.com/ap/ap/top-news/anonymous-donors-send-millions-to-pro-rubio-group/nnxq4/", "ord_in_thread": 0, "title": "Anonymous donors send millions to pro-Rubio group", "locations": ["N.H.", "Bedford", "Florida", "R-Fla."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Marco Rubio", "JULIE BYKOWICZ", "Rubio"], "text": "Updated: 3:58 a.m. Thursday, Oct. 8, 2015 | Posted: 3:58 a.m. Thursday, Oct. 8, 2015 Anonymous donors send millions to pro-Rubio group Related View Larger In this Oct. 6, 2015, photo, Republican presidential candidate Sen. Marco Rubio, R-Fla.,listens to a question during a house party campaign stop in Bedford, N.H. Voters are beginning to learn about Rubio but what they’re not learning, however, is who is paying to promote his candidacy. The Florida senator is benefiting in unprecedented ways from a nonprofit group funded by anonymous donors. While other presidential candidates also have ties to secret-money groups, the Rubio arrangement is the boldest. (AP Photo/Jim Cole) By JULIE BYKOWICZ \nVoters are beginning to learn about Republican presidential hopeful Marco Rubio . \nWhat they're not learning, however, is who is paying to promote his candidacy. \nThe Florida senator is benefiting in unprecedented ways from a nonprofit group funded by anonymous donors. While other presidential candidates also have ties to secret-money groups, the Rubio arrangement is the boldest. \nEvery pro-Rubio television commercial so far in the early primary states of Iowa, New Hampshire and South Carolina has been paid for not by his campaign or even by a super PAC that identifies its donors, but instead by a nonprofit called Conservative Solutions Project. It's also sending Rubio-boosting mail to voters in those same states. \nRubio is legally prohibited from directing the group's spending, and he has said he has nothing to do with it. But there's little doubt that Conservative Solutions Project is picking up the tab for critical expenses that the campaign itself might struggle to afford. \nAlthough Rubio is rising in national polls, his fundraising has so far been dwarfed by that of former Florida Gov. Jeb Bush , Texas Sen. Ted Cruz and retired neurosurgeon Ben Carson. By the end of June, Bush and his super PAC had amassed $114 million — more than quadruple what Rubio and his super PAC collected. \nAhead of what is expected to be a new and disappointing fundraising report next week, Rubio's aides have stressed that their thriftiness gives them a competitive advantage over campaigns with more money. \nLeft unsaid was that a secret-money group is giving him at least an $8 million assist, according to information provided by advertising tracker Kantar Media's CMAG. \nThe candidate has presented himself as being opposed to such unaccountable money. \n\"I believe that — as long as it's being disclosed — that people have a right to participate in our political process,\" Rubio said in June at a voter forum in New Hampshire when asked about \"the corrupting influence\" of money in politics. \nConservative Solutions Project does not disclose its donors. \nIts latest commercial shows Rubio, 44, speaking at the Iowa State Fair. \"New ideas for a new age,\" a narrator says before ticking through a list of Rubio priorities: \"throw out the tax code, overhaul higher education, repeal and replace Obamacare.\" \nConservative Solutions Project has put $2.3 million into the 30-second ad over the past three weeks and is on deck to spend close to another $1 million keeping it on the air next week, according to CMAG information about advertising placements on broadcast, cable and satellite television. \nThat follows a $3 million summertime ad campaign by the same group that promoted Rubio's strong opposition to a deal the White House and other countries struck with Iran on nuclear weapons. Conservative Solutions Project also has reserved nearly $2 million in additional satellite TV advertising space through Feb. 16, according to the advertising tracker. \nAlthough numerous candidates may ultimately benefit from allied nonprofits, so far it appears that only the entities helping Rubio and Louisiana Gov. Bobby Jindal are advertising in the presidential race. America Next has spent about $380,000 boosting Jindal on TV, CMAG said. Bush also has a secret-money group in his corner, but it hasn't yet directly communicated with voters. \nNonprofits are the edgier cousins of super PACs. Both can accept unlimited amounts of money from wealthy donors, corporations and unions, but only nonprofits can keep those names a secret. \nIn exchange for that privilege, nonprofits are barred from making political activity their primary purpose. But gray area abounds. The two regulating agencies, the Federal Election Commission and the Internal Revenue Service, have been less than aggressive in pursuing potential violators. \nThe Campaign Legal Center in Washington is suing the FEC for failing to require a nonprofit that was active during the 2012 presidential election to file finance reports. \n\"Congress, the Supreme Court and the public have all recognized that voters have a right to know who is spending money to try to influence them on Election Day,\" said Paul S. Ryan, the center's senior counsel. \"Transparency is how we hold politicians accountable and make sure they're not in the pocket of their benefactors.\" \nThat's in line with public opinion: Seventy-five percent of voters, an equal share of Democrats and Republicans, said contributors to unaffiliated groups should be disclosed, according to a CBS News/New York Times poll in June. \nThe Conservative Solutions Project declined to say who gave it the $16 million it claims to have. \nAlthough it shares a name and key personnel with the Rubio-focused super PAC, Conservative Solutions PAC, its mutual spokesman, Jeff Sadosky, said the two are \"very separate and distinct groups.\" \nHe said the nonprofit's work goes well beyond Rubio's presidential ambitions, pointing to a detailed study it did last year of voter behavior, which was made available on its website. Additionally, Sadosky said, Conservative Solutions Project highlights on its website the work of other conservative leaders, including Illinois Sen. Mark Kirk and Arkansas Sen. Tom Cotton. \nBut its bent toward Rubio is apparent even there: Visitors to the site are immediately routed to a video of the Florida senator speaking, the same footage on television in early primary states. \n___ \nFollow Julie Bykowicz on Twitter at: http://twitter.com/bykowicz Copyright The Associated Press", "external_links": [], "published": "2015-10-08T10:58:00.000+03:00", "crawled": "2015-10-08T18:34:32.671+03:00", "highlightTitle": ""}