{"organizations": [], "uuid": "36dce7f2cf8fa269fe1dcec3d4c9dccbb4e25bf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.politico.com", "main_image": "http://static.politico.com/e8/fa/560dd7244946814f7a6d437a6db7/ben-carson-gty-629.jpg", "site_section": "http://www.politico.com/", "section_title": "Politics, Policy, Political News - POLITICO", "url": "http://www.politico.com/story/2015/10/ben-carson-book-tour-214839", "country": "US", "title": "Carson's not-so-crazy book tour", "performance_score": 0, "site": "politico.com", "participants_count": 4, "title_full": "Carson's not-so-crazy book tour - POLITICO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:08:00.000+03:00", "replies_count": 3, "uuid": "36dce7f2cf8fa269fe1dcec3d4c9dccbb4e25bf6"}, "author": "Katie Glueck", "url": "http://www.politico.com/story/2015/10/ben-carson-book-tour-214839", "ord_in_thread": 0, "title": "Carson's not-so-crazy book tour", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ben Carson is taking weeks off from his presidential campaign to promote his book, with profits going to his pocket, and seasoned Republicans are incredulous. But the Republican candidate's book tour strategy isn't as crazy as it sounds, and early-state activists — even those baffled by his strategy — say it's unlikely to seriously impact his poll numbers, at least for now.\nWith the exception of Nebraska, every state that Carson visits to promote his book votes by March 15. Carson, already a best-selling author from previous books, is drawing big crowds and free media. And the tour helps him boost his name identification against Donald Trump, who currently leads GOP polls, in part because his name ID is so strong.\n\"If he does it right, it can just enhance the campaign,\" said former House Speaker Newt Gingrich, who ran a book tour while campaigning in the last presidential cycle, a move that didn't appear to hurt him at the time, though he ultimately was defeated.\nThe key, he said, is to structure book stops as an extension of the campaign: \"You've got to put them together so they reinforce each other. Don't go to a great book town [if it doesn't help the campaign,]\" Gingrich said.\nWhile Carson plans to hawk books in some liberal cities, like Austin, the broader calendar makes sense.\nThe high-flying Carson campaign By Katie Glueck\nCarson's latest book, \"A More Perfect Union,\" came out earlier this month, and he has upcoming stops slated in Texas, Iowa, Florida, Kansas, Oklahoma, Nebraska and Missouri to promote it, with the tour wrapping up on Nov. 5. He already has held book events in South Carolina, Georgia, Tennessee and Washington, D.C. Many Southern states plus Texas vote on March 1— part of the so-called SEC primary. Iowa and South Carolina, of course, are carve-out states, and Kansas, Missouri and Washington all have delegates (and in Washington, national press coverage) up for grabs before the major March 15 Florida primary. Carson currently lives in West Palm Beach.\nThe Carson campaign is not planning to publicly capitalize on these stops or organize around them (they are legally required to keep some distance) beyond fundraisers, a missed opportunity four months from when the first votes are cast. But Carson does benefit from free coverage in those early-voting media markets, and he is attracting sizable crowds. In Tennessee over the weekend, for example, hundreds turned out at multiple stops.\nEarly-state activists would much rather see Carson spend time at town halls and meet-and-greets instead of autographing books and doing photo ops at signings, where he has little opportunity to meaningfully interact with voters. But they say it's not a fatal decision, and in fact, could be helpful with getting on the radar of voters at a time when many still haven't tuned in.\n\"Part of his issue is name-brand recognition, he still isn't a household name,\" said Craig Williams, chairman of the Carroll County GOP in conservative Northwest Iowa. \"He needs to do that, he needs a lot more name-brand recognition, obviously Trump has huge name recognition. I don't think [the book tour] really hurts him that much, he just needs to get out there.\"\nBut the book tour could do damage, said Ann Trimble-Ray, a plugged-in Iowa conservative who is close to Rep. Steve King (R-Iowa), with the small but influential slice of undecided party activists who are closely following the race and won't organize for Carson if he doesn't come across as a serious candidate. The book tour this late in the campaign, she said, raises questions about whether he understands what it means to run a presidential campaign.\n\"Carson has followers who are passionate and committed to him, but I don't believe he's going to gain new followers with a book tour, and [we] look with some skepticism and measuring for those of us still weighing who to support,\" she said. \"It's a book tour, it's capitalism, Republicans are all about capitalism, but it's still odd to divide your loyalties between White House aspirations and a book tour.\"\nBush deploys 'look over here' strategy ahead of fundraising figures By Kyle Cheney\nOnly one day of the tour is reserved for Iowa, according to the book's website. He will make four stops across the state on Oct. 24. But the abbreviated book stop is OK because he's already spent considerable time in Iowa and will be back often, so additional time there might have been \"redundant,\" said Bob Vander Plaats, a prominent Iowa social conservative leader.\n\"He may be thinking this helps him with publicity, helps him get the message out, he has that asset, so why not use it?\" Vander Plaats said. \"... I don't see a hurt for him unless he allows guys like Cruz and Rubio and Huckabee to start picking up his space while he's out of the state of Iowa. ... To anybody, I'd say, Iowans are very much 'out of sight, out of mind.' If they haven't seen you for awhile, they just don't think about you.\"\nCarson has not had a public campaign event since Oct. 2 — and won't again until Oct. 28, the next GOP presidential debate, though his campaign noted that he is busy fundraising and will have another big rally the day after the debate in Colorado. The dearth of official campaign events also has not detracted from his heavy media appearance schedule.\n\"To say he's not campaigning for three weeks is just not true,\" Carson campaign manager Barry Bennett said. \"He's just not doing any rallies. We don't have time to focus on that and raising money,\" and though he raised $20 million last quarter, the campaign is dedicating October to fundraising.\nCampaign spending reports out Thursday also show that Carson, who spent $14 million of that haul, put considerable funds toward publishers who put out his books.\nAccording to the latest fundraising report, out Thursday, the campaign spent $1,412 on books from Random House, home to the imprint that published \"A More Perfect Union.\" They also spent about $48,000 on books from Harper Collins, which has published other books by Carson. In the second quarter of the year, the campaign spent $64,000 on printing fees from Harper Collins, which the campaign said at the time went to making abridged copies of another Carson book, \"Gifted Hands,\" to give to donors who chipped in $20.\nJamie Johnson, an influential Iowa minister who is well-connected in grass-roots conservative circles, said Carson is doing well enough in Iowa that he can afford to slip away for a book tour for a bit — but the longer it goes, the riskier it gets.\n\"Iowans want you to run for president if you're running for president,\" Johnson said. \"If you're going to sell books, it might be something neat where [voters] can show up, they might buy a book, get an autograph, take a photo, but they're not going to come out a second time.\"\nHe went on to add, \"Iowans want you to either run for president or not run for president. They don't want you selling books if you're running for president.\"\n<div", "external_links": ["http://abcnews.go.com/Politics/ben-carson-puts-public-campaign-events-hold-weeks/story?id=34481847", "http://www.nytimes.com/2011/12/09/us/politics/gingrich-the-front-runner-is-still-selling-books.html?_r=0"], "published": "2015-10-15T18:08:00.000+03:00", "crawled": "2015-10-16T05:56:50.394+03:00", "highlightTitle": ""}