{"organizations": [], "uuid": "145d3f446f61e5072026b7e02c7998333fedde3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theconversation.com", "main_image": "http://cdn.theconversation.com/files/97852/width1356x668/image-20151008-22415-1lwmeht.jpg", "site_section": "http://theconversation.com/au/politics", "section_title": "Politics + Society – Views &amp; Research – The Conversation", "url": "http://theconversation.com/could-the-peace-deal-in-colombia-be-a-model-for-other-conflicts-48564", "country": "US", "title": "Could the peace deal in Colombia be a model for other conflicts?", "performance_score": 0, "site": "theconversation.com", "participants_count": 3, "title_full": "Could the peace deal in Colombia be a model for other conflicts?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:20:00.000+03:00", "replies_count": 2, "uuid": "18e20dbe88712fd48da617367c1a9549ed104176"}, "author": "theconversation.com", "url": "http://theconversation.com/could-the-peace-deal-in-colombia-be-a-model-for-other-conflicts-48564#post-0", "ord_in_thread": 0, "title": "Could the peace deal in Colombia be a model for other conflicts?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On September 23 2015, the Colombian government made a major breakthrough in its negotiations with the Fuerzas Armadas Revolucionarias de Colombia (FARC) to end 50 years of conflict.\nAfter three years of talks, Colombian president Juan Manuel Santos and FARC leader Rodrigo “Timochenko” Londoño agreed on a plan for comprehensive transitional justice in Colombia.\nThe negotiators set a deadline of six months to finish the final peace accord. After 60 more days, the FARC will lay down its arms, setting the stage for the end to the conflict by mid-2016.\nThis is good news for Colombians, of course. But the peace agreement is also worthy of wider attention because it represents new thinking on how to end old conflicts.\nAs part of the larger project analyzing models of peacemaking under consideration in Colombia, our research team at Georgia State University conducted a series of public opinion surveys this year and last to gauge public attitudes about post-conflict truth and justice mechanisms.\nOur team also took stock of the recently proposed transitional justice program in Colombia and evaluated it as a possible model for other countries emerging out of protracted conflict.\nNew standards The agreement is precedent-setting in several ways.\nIt will be the first negotiated end to a civil conflict in the world under the new international standards of the 2002 Rome Statutes to hold accountable armed combatants who commit grave human rights abuses such as genocide, crimes against humanity and war crimes.\nIt will also be the first peace process to have included victims at the negotiating table.\nFinally, it will be the first end to a civil war that does not rely primarily on amnesty for all sides, but instead provides new forms of restorative justice. This is a compromise effort to reach peace while also holding perpetrators of human rights abuses accountable.\nStill, important questions remain.\nWill the agreement be accepted by a skeptical Colombian public who routinely favors jail time and opposes future political office for FARC members?\nDoes it go far enough to satisfy the International Criminal Court (ICC) charged with ensuring that national governments hold accountable those who commit crimes against humanity, genocide, war crimes and crimes of aggression?\nIn other words, is Colombia developing a new model that other countries could adopt to satisfy both the higher global demands for accountability for human rights crimes while also helping countries in conflict achieve a lasting peace?\nAppropriate punishments A Colombian man shows his support for peace negotiations. John Vizcaino/REUTERS\nThe basic outlines of the deal include the right to run for political office and amnesty for crimes committed during the course of the conflict that are connected to political rebellion. Drug crimes may become eligible for amnesty. But sanctions would be imposed for grave human rights crimes defined in international humanitarian law like sexual crimes, kidnapping, torture, forced displacement and extrajudicial killing. These crimes will be processed under the new “Special Jurisdiction for Peace” tribunal that the peace accords established.\nCombatants on both sides who are guilty of grave human rights crimes and have decided to confess would be eligible for a reduced sentence of up to 8 years of restricted liberty and community labor to repair damages to victims. Those who do not comply with these conditions will face a special court and prison sentences up to 20 years.\nThe accords also established a Commission for the Clarification of Truth, Coexistence, and Non-Repetition to uncover the causes of abuses and document atrocities.\nThe innovative nature of this alternative, restorative justice is that it focuses on the victims by proposing punishments such as community service and restitution, rather than simply putting perpetrators in prison. More than 7.6 million Colombians have been forced from their homes or lost loved ones in the course of the long war.\nAt the same time, it attempts to bring armed combatants back into society. That may help avoid what has happened in the past – in both Colombia and elsewhere – when former combatants were unable to find new job skills or build homes and returned to organized violence.\nWhether the Colombian public will accept and endorse the compromises remains to be seen.\nEducation is key Our research gives some insight into this question. Our survey of more than 3,000 Colombian citizens showed that those who voted against President Santos and his peace platform in the last election, or those who abstained from voting at all, could be persuaded to support the peace process and specific transitional justice proposals.\nOur research also shows that efforts to educate the public could boost the popular legitimacy of the peace process. Specifically, respondents who said they most understood the negotiations were also more likely to support the talks. Public education on all the elements of the peace deal will be essential to gaining popular legitimacy of the proposal, which is essential if the peace is to become durable and sustainable.\nOther countries would be well served to take such a broad view of justice that centers on victims, and not only on perpetrators of violence.\nA hard sell The reduced and alternative sentences model is, nevertheless, a controversial compromise that may not work in other deeply divided societies, such as Kenya, Uganda, the Democratic Republic of Congo, and under the increasingly sharp gaze of the international justice community.\nWhile the initial reaction of the ICC to the language of the accord was positive , the court has yet to embark on a comprehensive assessment of the justice provisions. It is not at all clear that the final accord will survive ICC scrutiny in its current form. In fact, both Human Rights Watch and Amnesty International expressed early disappointment with the lenient punishment for serious offenses and questioned how the peace agreement will be in compliance with the ICC.\nAs with all new institutions, the effectiveness and success of the peace agreement should be judged by the tangible results it can deliver. In Colombia, we can hope for durable and sustainable peace, nonrepetition of violence, and full reintegration of former combatants.\nFARC Colombia Peacemaking You might also like Colombians marching for peace. Reuters/John Vizcaino Colombia’s deal with the FARC could bring peace – or create a power vacuum", "external_links": ["http://www.icc-cpi.int/en_menus/icc/press%20and%20media/press%20releases/Pages/otp_stat_24-09-2015.aspx", "https://www.hrw.org/news/2015/09/28/colombia-dealing-away-justice", "https://62e528761d0685343e1c-f3d1b99a743ffa4142d9d7f1978d9686.ssl.cf2.rackcdn.com/files/97277/width1012x668/image-20151005-28786-ok29uv.jpg", "https://62e528761d0685343e1c-f3d1b99a743ffa4142d9d7f1978d9686.ssl.cf2.rackcdn.com/files/97854/width668/image-20151008-9643-1k3fycx.jpg", "http://www.amnestyusa.org/news/press-releases/colombia-agreement-must-guarantee-justice-for-the-millions-of-victims-of-the-armed-conflict", "http://www.washingtonpost.com/blogs/monkey-cage/wp/2014/08/28/pitfalls-abound-in-colombia-farc-peace-talks/", "http://wp.presidencia.gov.co/Noticias/2015/Septiembre/Paginas/20150923_03-Comunicado-conjunto-N-60-sobre-el-Acuerdo-de-creacion-de-una-Jurisdiccion-Especial-para-la-Paz.aspx", "http://www.as-coa.org/articles/colombia-update-facing-public-opinion-farc-peace-talks", "https://www.opendemocracy.net/openglobalrights/ryan-e-carlin-jennifer-l-mccoy-jelena-subotic/paying-for-human-rights-violations-pe", "http://www.bbc.com/news/world-latin-america-28822683"], "published": "2015-10-09T18:20:00.000+03:00", "crawled": "2015-10-11T12:15:28.942+03:00", "highlightTitle": ""}