{"organizations": [], "uuid": "c3f8ed6e523f138ff0ee4a3ae805157536e89e8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nymag.com", "main_image": "http://pixel.nymag.com/imgs/fashion/daily/2015/10/09/09-witches-candles.w1200.h630.jpg", "site_section": "http://nymag.com/thecut/", "section_title": "The Cut – Fashion, Beauty, Politics, Sex and Celebrity", "url": "http://nymag.com/thecut/2015/10/powerful-unlikely-appeal-of-witchcraft.html", "country": "US", "title": "The Powerful, Unlikely Appeal of Witchcraft", "performance_score": 0, "site": "nymag.com", "participants_count": 1, "title_full": "The Powerful, Unlikely Appeal of Witchcraft -- The Cut", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T08:30:00.000+03:00", "replies_count": 0, "uuid": "c3f8ed6e523f138ff0ee4a3ae805157536e89e8b"}, "author": "Alex Mar", "url": "http://nymag.com/thecut/2015/10/powerful-unlikely-appeal-of-witchcraft.html", "ord_in_thread": 0, "title": "The Powerful, Unlikely Appeal of Witchcraft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Zoonar RF/Getty Images\nIn Witches of America , Alex Mar explores the world of contemporary Pagans — and finds herself drawn to their practices. The following excerpt finds her preparing to participate in a weekend-long gathering.\nBefore the gathering, we each received a packet over e-mail outlining the weekend (it continues to amaze me how much oath-bound witchcraft is made possible by the Internet and Yahoo Groups). In reading it over a few times, I was struck by a defining quality of most rituals I’ve taken part in: the setting of expectations, and the role those expectations play in the group’s experience. The packet included a request for four volunteers to “tend the circle” during Saturday night’s particularly high- energy ritual, “keeping a Witch Eye open for uninvited guests” (i.e., unwelcome spirits), and an additional six to act as “spotters” or “tenders” for the newcomers.\nIn another note, under “Ritual Etiquette” — a section reminding us that our rituals “are not ‘celebratory’ ” but instead “have deep purpose” — Quote: :\nBoth the Friday and Saturday Night rituals will be Very Intense. You will need to use every ounce of Life Force you have and all you can contain to withstand these Rites. You will see things, feel things and experience things unfamiliar to you. You may become overwhelmed. You may feel ill. Let your Tender know. They are there to help you. This is expected to those new to these energies. There is no shame. That said, we will not hold back the Powers in order to make it comfortable. So . . . [she pauses for effect]\nconsider yourselves forewarned.\nIn other words, we’ve been told way in advance that the ritual will, undoubtedly, blow us away, and we’ve been asked to help prevent fallout from such powerful magic. It’s not that I believe Karina is being consciously manipulative, but you can’t deny the power of suggestion — as when she writes that “possessory experiences are an expected result” of the Saturday ritual; or that it “is expected” that newcomers “may become overwhelmed” and need help.\nI think of Leon Festinger’s handy theory of cognitive dissonance, in which he pinpointed that people change their opinions or stories about an event in order to avoid conflicting with their group or devaluing something in which they’ve invested a great deal. In other words: most humans, once they get in deep enough, will dig in their heels and commit to the value of an experience, because to change their minds and become, instead, openly critical involves a cutting off , a loss, that’s more than most of us want to bear. And that loss is calculable: the loss of the bond, the group contract, created when all of us study with the same teacher; the effort and cost to be here (about $450 before travel), and to study (about $100 per month, plus tools and supplies), in order to have an ecstatic magical experience. There’s pressure not to disappoint the group or ourselves, and it colors our individual results, the stories we’ll later tell of circling together. We’re each here, in part, out of a desire to share secrets with the tiniest of in-groups, and if none of this — this specific tradition, or magic in general — is real, then we , the participants, have just forfeited a shot at being special. And we’ve spent valuable time on a “practice” that’s undeserving of it. And, taking it a step further, everyone in this coven is a wackjob, or at least doing a great impression of one. All religious communities, to some degree, function in this way, bolstered by the collective’s dream of specialness — a specialness spun out of practices whose value can never be verified in the practical world.\nWhile people finish up dinner, Karina announces that we should “make kala,” because the opening circle will begin shortly. Soon all twenty-odd of us, at the kitchen table or perched on stools or retired to corners of the house, are gripping our glasses of filtered water, breathing breathing breathing, raising the glasses to our foreheads, and then exhaling! suddenly! like a burst of air, and guzzling the liquid, turned bright and glowing in the mind’s eye.\nI do this along with the rest, of course — but once I’ve drunk from my glass, I find myself staring at the others. I see a desperation in their focus, the intensity with which they clutch their glasses or water bottles. And for a flash of a moment, this coven looks cultish to me. Something about how we’re all grasping this technique — the only tools required being water and a glass, ridiculously mundane — as if our lives depended on it. Something to do with how so many of the faces around me look either inexplicably serene or pinched with the barely concealed pain of someone who needs this so much . (Then again, how is this different from being surrounded by people repeatedly making the sign of the cross? Any discomfort I feel must not be with Feri, specifically, but with an all-in subscription to any system.) I can’t yet tell if these are expressions of an impressive lack of self-consciousness — the ability to throw yourself completely into the “technology,” give yourself over to magic — or the polar opposite, a nagging awareness of being in close quarters with your witch-teacher and covenmates and what they expect of you.\nOnce the powerful puffs of exhalation have died down — the sound of so many individuals blowing imaginary feathers upward (to the Godsoul!) — people wander across the hall into the ritual room. Just a couple of hours ago, this was the living room of a conservative New England family, complete with grand piano, love seat, and plush Oriental carpet— but all that’s been moved aside for our intended use of the space this weekend. With the space cleared, we remove our shoes and, in bare feet or socks or stockings, form a witches’ circle. Someone turns the lights way down. Karina has requested that this opening circle be “low-energy,” Feri Lite, since we’ve traveled today. But regardless — in spite of my doubts, and in one of the many sudden emotional shifts that will define my weekend — my pulse picks up tempo in anticipation: my very first private Feri circle. My first time circling with the coven.\nWe breathe in and out repeatedly, deeply and loudly, building up a group rhythm; I immediately notice Shen-tat, who moves a lot during ritual, swaying and weaving his hands in and out. Tonight, our first night together, Karina takes the lead. As the group continues to breathe and sway, she casts the circle; and I realize that this is the moment, right now, when she will call the Guardians by name, names whose secrecy so many Feri witches have fought over, through poisonous disagreements and “witch wars.” We’re surrounded by our own moaning and heavy breathing and chanting, inviting all seven in one by one, these ancient intelligences out there in the universe who, for whatever reason, are driven to teach humans magic. If an outsider really wants to find their names, she can; but I waited to learn them the old way, through the mouth of my teacher, and I won’t repeat them here. They are shockingly simple, child-simple, like names in a folktale; and each is invoked with the right gestures and tone of voice, conjuring up that spirit’s spirit. One is of the earth, dark; her territory is deep knowledge, and in calling her into the circle our voices grow low and sexual. Another is pure receptivity, and we reach her through a groping for the stars above our heads in a childlike, tippy-toe way, in a blissed-out baby-voice of amazement, with a lack of self-censorship that I’ve only felt during the most out-there acting exercises.\nThat’s what this is like, the embarrassing wide-openness that witchcraft requires: a movement or voice or improv class, in which the actor is expected, required by her work, to throw herself all the way in. To make a flailing mess of herself as the only route to truer performance. (Meisner called it “living truthfully under imaginary circumstances.”) As a student, full of angst and confusion about my prospects, I was able to throw myself into theater productions, propelled by a powerful desire to leave my own body, my own life, to disconnect from my world and be somewhere else, a place of escape — and the more depressed and adrift I was, the more convincing my performances. I was good onstage — until I started to enjoy living in my own skin. Maybe the past several months, since beginning my training, have been a search to see if I’ve still got that in me, that part of me willing to walk away from my high-functioning, socialized self in order to connect with something bigger. Willing to tap into my personal chaos, to let buckle my scaffolding, in order to get at whatever’s behind the panels of that silver box inside my chest. Not much more happens to night, mostly the inauguration of the weekend — and also this: Karina takes a moment to point us out, the “newbies.” As she called the guardians, she now calls us each by name: Katie, Kiya, Daniel, Stephanie, Alex.\nIn this way, she marks the beginning of something.\nExcerpted from WITCHES OF AMERICA by Alex Mar, published in October 2015 by Sarah Crichton Books / Farrar, Straus and Giroux, LLC. Copyright © 2015 by Alex Mar. All rights reserved.", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/0374291373"], "published": "2015-10-12T08:30:00.000+03:00", "crawled": "2015-10-12T05:27:25.043+03:00", "highlightTitle": ""}