{"organizations": [], "uuid": "124ca01ed181a67b94ab1fafd00f5ccfe2e9cdb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/6a391f6e42fba3c128e6781b227cdab6acdbd210/0_163_3888_2334/master/3888.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=0be14b9013f719a0f577753801b41ee5", "site_section": "http://feeds.theguardian.com/theguardian/politics/rss", "section_title": "Politics | The Guardian", "url": "http://www.theguardian.com/commentisfree/2015/oct/20/poll-tax-moment-tories-tax-credit-cuts-osborne", "country": "US", "title": "This isn’t a poll tax moment, and the Tories know it | Polly Toynbee", "performance_score": 2, "site": "theguardian.com", "participants_count": 1, "title_full": "This isn’t a poll tax moment, and the Tories know it | Polly Toynbee", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:00:00.000+03:00", "replies_count": 0, "uuid": "124ca01ed181a67b94ab1fafd00f5ccfe2e9cdb9"}, "author": "Polly Toynbee", "url": "http://www.theguardian.com/commentisfree/2015/oct/20/poll-tax-moment-tories-tax-credit-cuts-osborne", "ord_in_thread": 0, "title": "This isn’t a poll tax moment, and the Tories know it | Polly Toynbee", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pinterest ‘The bedroom tax was highly unpopular, a rare cut that did touch the hearts of the public – but so what? They still voted Tory.’ Photograph: Guy Corbishley/Demotix/Corbis \nIf not the Commons, then rebellion in the House of Lords next Monday may force some change, but the Lords would not dare demand anything to cover the monumental £4.5bn losses. Tax credits, with their £30bn bill, were always detested by the Tories, as the chief engine of redistribution. With great precision, whenever credits rise, poverty falls and vice versa. Poverty will soar now, says the Institute for Fiscal Studies (IFS) . That’s why the government will stop measuring poverty from now on. \nOsborne gives his MPs things to say: a low-tax, low-welfare, high-pay nation sounds good. Don’t bother with figures showing only a quarter of those losing out gain from a higher minimum wage, or that those who do gain a bit only win back a quarter of their loss. Step back, he urges, just be shocked by the colossal welfare bill: he never says tax credits rise because so many more people are low paid. Or that rising numbers of pensioners take the lion’s share of the social security bill. Or that soaring rents cause the sky-rocketing housing benefit bill. He trusts the public to simply wonder at the welfare total. This isn’t really taking off, except in the echo chamber of social media – that’s Osborne’s gamble Ben Page, Ipsos Mori \nOsborne is battle-hardened from previous cuts. The bedroom tax was highly unpopular, a rare cut that did touch the hearts of the public – but so what? They still voted Tory. Even 27% of those wholly reliant on state benefits voted Tory, says Ben Page of Ipsos Mori. He is rightly wary of mercurial shifts in public opinion, but he thinks tax credits are too difficult for non-recipients to understand. \nIs this Osborne’s poll tax? Not really, as everyone paid that and understood the injustice of the duke paying the same as the dustman. “This isn’t really taking off, except in the echo chamber of social media – that’s Osborne’s gamble,” says Page. What’s to fear, Osborne will be calculating, when Jeremy Corbyn polls lower than Michael Foot and after boundary changes , Labour needs a phenomenal 13% swing to win in 2020. \nAnyway, if it all did go belly-up and the public rose up in disgust, there is budget after budget to put it right, with some leeway for bribes and sweeteners pre-2020. What better time than now to inflict all the pain on those least likely to protest? \nRelated: Labour launches drive to register voters as boundaries get redrawn \nIndividual families struggling alone at home are not members of organised groups, unlike junior doctors. They will suffer in silence, as they have through all Osborne’s previous cuts. This isn’t even the harshest: taking all benefits from third and subsequent children will inflict even greater hardship, says Paul Johnson of the IFS. That will put higher numbers into the (unmeasured) child poverty figures. Osborne feels he has nothing to fear by gouging that £12bn from benefits as it was in the manifesto, popular even with Labour voters. Let Labour bleat: the more indignant its protests, the deeper it sinks into quicksand as the welfare party. \nOsborne is free now to drive his chariot on towards his planned permanent smallest ever government – at just 35% of GDP, that’s a smaller state even than the US. If not now, with every favourable wind in his sails, then when? This is the Cameron-Osborne goal, to finish what Margaret Thatcher began, to end the 1945 settlement and demolish most of what’s left of the welfare state. \nOn the horizon he has only one enemy to fear – his own hubris. It may be politically impossible to reach that goal. His spending review will spell out the road but it will be “horrific”, Johnson warns, with every department, except the few protected, cut by another quarter. The maximum effects will be felt in three or four years’ time, though Osborne will use devolution to hand down the blame and to make cuts less transparent for the likes of the IFS to track. \nMeanwhile public sector pay will have fallen further behind private sector pay than any time since records began: if junior doctors are up in arms now, expect far worse to come, while shortages of vital staff grow. \nHowever, riding out these benefit cuts may give Osborne a false sense of invincibility as he stores up future trouble, with storms in the public sector that it will be too late to quell. Too clever by half or not quite clever enough, he may forever be personally tainted by these unjust cuts. His ultimate punishment may be that this axeman chancellor will be too unpopular ever to become prime minister.", "external_links": [], "published": "2015-10-20T08:00:00.000+03:00", "crawled": "2015-10-20T08:16:11.186+03:00", "highlightTitle": ""}