{"organizations": ["EC", "BJP"], "uuid": "70a6f1129435d46d810794d30a1712c6e1181152", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.indiatvnews.com", "main_image": "http://images.indiatvnews.com/politicsnational/IndiaTv9457b7_Amit-final.jpg", "site_section": "http://www.indiatvnews.com/rssfeed/politics_national_news.xml", "section_title": "Politics >> National News", "url": "http://www.indiatvnews.com/politics/national/bihar-polls-bjp-moves-ec-to-have-fir-against-amit-shah-withdrawn-32944.html", "country": "SG", "title": "Bihar polls: BJP moves EC to have FIR against Amit Shah withdrawn", "performance_score": 0, "site": "indiatvnews.com", "participants_count": 0, "title_full": "Bihar polls: BJP moves EC to have FIR against Amit Shah withdrawn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:50:00.000+03:00", "replies_count": 0, "uuid": "70a6f1129435d46d810794d30a1712c6e1181152"}, "author": "", "url": "http://www.indiatvnews.com/politics/national/bihar-polls-bjp-moves-ec-to-have-fir-against-amit-shah-withdrawn-32944.html", "ord_in_thread": 0, "title": "Bihar polls: BJP moves EC to have FIR against Amit Shah withdrawn", "locations": ["Bihar"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nitish Kumar", "Amit Shah", "Modi"], "text": "You Are Here : Home » Politics » National » Bihar polls: BJP moves EC to have FIR against Amit Shah withdrawn Bihar polls: BJP moves EC to have FIR against Amit Shah withdrawn PTI [ Updated 08 Oct 2015, 22:50:33 ] Bihar polls: Nitish Kumar accuses PM Modi of brazen attempt to add communal colour to elections \nNew Delhi: BJP today approached the Election Commission seeking immediate withdrawal of an FIR against its chief Amit Shah for his \" Chara chor \"(fodder thief) remarks against RJD chief Lalu Prasad and demanded action against officials working \"under pressure\" of the state government. \nA delegation of party leaders, led by Union Minister M Venkaiah Naidu, drew EC's attention to alleged hate speeches of Prasad and AIMIM chief Asaduddin Owaisi and sought strong action against them for their remarks. \n\"In Bihar, an unnecessary FIR has been registered against BJP President Amit Shah. We feel it is done under pressure from the local government... \"An FIR has been registered against the president of a national party. It is very objectionable. We have brought it to the notice of EC and pur forth the facts and requested EC that they should hold an immediate inquiry and this FIR should be withdrawn,\" Naidu told reporters after the meeting with EC. \n\"We have also asked EC to probe the action of all those officers working under the pressure of the state government. We have requested them for taking action against them,\" he said, adding that the Chief Election Commissioner and Election Commissioners have assured the delegation of looking into the matter. Read Also: Lalu Yadav, Amit Shah booked for use of 'abusive' words \nNaidu said Shah has in general talked about 'chara chor' and referred to only what the court has done and he did not say anything new. Prasad has been convicted and \"it is a fact and it is true that it is a court verdict,\" he said. \nNaidu said the delegation has also brought to the notice of EC that while on one hand FIR has been registered against Shah, on the other leaders like Lalu Prasad and Owaisi are making \"hate\" speeches that are aimed at allegedly communalising the Bihar assembly elections and no action is being taken against them. \n\"Everyday, objectionable, communal, offensive and defamatory statements are being made against our party, our leaders, our Prime Minister, our party President and no action is taken against them,\" he said. \nNaidu was accompanied by Union Ministers Mukhtar Abbas Naqvi and Nirmala Sitharaman, besides other BJP leaders. \n  Related Tags:", "external_links": [], "published": "2015-10-09T01:50:00.000+03:00", "crawled": "2015-10-08T20:55:30.264+03:00", "highlightTitle": ""}