{"organizations": [], "uuid": "5b03165c61faaa8576cafe04723370f73454bb92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "neurope.eu", "main_image": "http://neurope.eu/wp-content/uploads/2015/10/Opium-Cultivation-Afghanistan-720x540.jpg", "site_section": "http://neurope.eu/category/politics/", "section_title": "New Europe Politics", "url": "http://neurope.eu/article/afghanistan-opium-poppy-cultivation-declines/", "country": "", "title": "Afghanistan: Opium poppy cultivation declines", "performance_score": 0, "site": "neurope.eu", "participants_count": 1, "title_full": "Afghanistan: Opium poppy cultivation declines", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:57:00.000+03:00", "replies_count": 0, "uuid": "5b03165c61faaa8576cafe04723370f73454bb92"}, "author": "Dan Alexe", "url": "http://neurope.eu/article/afghanistan-opium-poppy-cultivation-declines/", "ord_in_thread": 0, "title": "Afghanistan: Opium poppy cultivation declines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Opium poppy cultivation declines in Afghanistan, according to the latest figures released by the Afghan Ministry of Counter Narcotics and UNODC. The figures indicate that opium poppy cultivation decreased by 19 per cent in 2015, compared with last year.\nThe findings show that the area under opium poppy cultivation in 2015 is around 183,000 hectares (ha), compared with 224,000 ha in 2014, while the cultivation area has decreased for the first time since 2009.\n“I hope the survey will serve to inform policies and efforts to build on these hard-won achievements,” said UNODC’s Executive Director Yury Fedotov in a press release, adding that sustaining progress “depends on the resolve of the Afghan Government, and on the international community, which must devote the needed resources and make a long-term commitment to addressing a threat that imperils all our societies.”\nThe survey further notes that in 2015, potential opium production in Afghanistan amounts to 3,300 tons, a decrease of 48 per cent from its 2014 level (6,400 tons). Despite the drop in the opium poppy cultivation, the number of poppy-free provinces in Afghanistan fell in 2015.\nThe UN highlighted that as in previous years, the available technology used to conduct the crop monitoring and assessment between 2014 and 2015 has again been refined and sharpened, leading to greater accuracy of estimates but which may have an impact on the extent of year-on-year changes.\nAccording to the survey, the low production can be attributed to a reduction in area under cultivation, but more importantly to a drop in opium yield per hectare. This yield decreased in all main opium poppy cultivating regions, led by the southern region, with a 45 per cent decrease, followed by the western region (20 per cent) and the eastern region (eight per cent).\nIn terms of eradication, efforts across the country led by the various provincial governments increased a collective 40 per cent, compared to last year, or from around 2,700 ha to 3,760 ha. During the latest eradication campaign, there were fewer casualties reported than the previous year: in 2015, five lives were lost and 18 persons were injured compared to 2014, when 13 lives were lost and 26 persons injured.\n ", "external_links": [], "published": "2015-10-15T15:57:00.000+03:00", "crawled": "2015-10-15T21:53:12.625+03:00", "highlightTitle": ""}