{"organizations": [], "uuid": "f12dca89780f1c16ac224a4d4a288b9aa9e9969b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48533/political-campaigns", "section_title": "Political Campaigns - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30348048/ul-receives-grant-supporting-the-fire-investigation-community", "country": "US", "title": "UL Receives Grant Supporting the Fire Investigation Community", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "UL Receives Grant Supporting the Fire Investigation Community - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "f12dca89780f1c16ac224a4d4a288b9aa9e9969b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30348048/ul-receives-grant-supporting-the-fire-investigation-community", "ord_in_thread": 0, "title": "UL Receives Grant Supporting the Fire Investigation Community", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " UL\nNational Institute of Justice Funding Supports Research to Improve Ways to Detect and Analyze Evidence at Fire Scenes\nNORTHBROOK, Ill. , Oct. 26, 2015 /PRNewswire/ -- UL, a global safety science organization, announced that its Firefighter Safety Research Institute (FSRI) has received nearly $1 million in grant funding from the National Institute of Justice (NIJ).\nThe NIJ addresses the needs of the fire and explosion investigation community by funding research to better understand fire dynamics and improve ways to detect and analyze evidence at fire scenes. As UL's first grant received for research supporting the fire investigation community, the funding will support a two-year study examining how ventilation impacts fire patterns and electrical system damage in homes that incorporate modern construction practices.\n\"This is the first time we have received funding from the National Institute of Justice, and we are appreciative of their support,\" said Steve Kerber , Director of FSRI. \"We're thrilled to expand into an important area of fire research and safety to contribute to the fire investigator community's knowledge base. As home design and furnishings continue to change, we will need scientific research to keep up with these developments and help both fight and investigate fires.\"\nOver the past 30 years, the evolution of home construction design and contents has compounded how ventilation influences fires. Modern construction practices, such as open-floor plans, great rooms, and synthetic materials have resulted in faster-burning fires. The manner in which a fire receives oxygen also greatly impacts the fire. For example, a door left open by a fleeing occupant or a failing window could greatly impact the spread of a fire and related home damage. Fire investigators must understand fire dynamics to properly identify the origin and cause of a fire.\nUL has conducted fire research to assist firefighting tactics under Department of Homeland Security grants for the past 10 years; and, in 2015, various government and other grant programs have awarded FSRI nearly $3 million in funding. The NIJ research project will draw from and enhance past research sponsored by the Department of Homeland Security's Assistance to Firefighters grants addressing the impact of horizontal ventilation through doors and windows and the impact of vertical ventilation through roofs.\nResearch outcomes will provide a baseline for future trainings and the modification of reference materials, such as the National Fire Protection Association's Guide for Fire and Explosion Investigations . It will also provide the fire investigation community with scientific-based comparisons of the types of ventilation that occur in fires.\nUL hopes this is the first step in many toward using laboratory environments to analyze basic investigation practices and provide support for the approach of determining the cause and origin.\nAbout UL's Firefighter Safety Research Institute (FSRI)\nUL's FSRI is dedicated to increasing firefighter knowledge to reduce injuries and deaths in the fire service and the communities they serve. Working in partnership with the fire service, research departments and agencies, FSRI executes cutting-edge firefighter research and makes the results widely available to the global fire community. With a team of pioneering experts and access to UL's leading infrastructure, equipment and vast knowledge and insights, FSRI conducts and disseminates cutting-edge research and training programs that focus on the changing dynamics of residential, commercial and industrial fires, and the impact they have on the fire service tactics and strategies.\nAbout UL\nUL is a premier global independent safety science company that has championed progress for more than 120 years. Its nearly 11,000 professionals are guided by the UL mission to promote safe working and living environments for all people via two distinct entities: Underwriters Laboratories Inc., a 501(c)3 public charity, and UL LLC. UL uses research and standards to continually advance and meet ever-evolving safety needs. We partner with businesses, manufacturers, trade associations and international regulatory authorities to bring solutions to a more complex global supply chain. For more information, visit http://www.UL.com.\nMEDIA CONTACT:\nBrooke Higginbotham\nUL\nPhone: (847) 664.1298\nE-mail : Brooke.Higginbotham@ul.com\nLogo - http://photos.prnewswire.com/prnh/20140721/129100\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/ul-receives-grant-supporting-the-fire-investigation-community-300165495.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CG37051&Transmission_Id=201510260800PR_NEWS_USPR_____CG37051&DateId=20151026", "http://photos.prnewswire.com/prnvar/20140721/129100", "http://www.xmlnews.org/ns/", "http://www.ul.com/", "http://www.prnewswire.com/news-releases/ul-receives-grant-supporting-the-fire-investigation-community-300165495.html", "http://photos.prnewswire.com/prnh/20140721/129100"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T15:22:05.591+02:00", "highlightTitle": ""}