{"organizations": ["Green Investment Bank"], "uuid": "5d0d498560e4caf27a8ef60ef7fca97f3a3c207d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/ecc89f1b-539f-4238-b4ed-c005ceec22f8.img", "site_section": "http://www.ft.com/rss/world/uk/politics", "section_title": "Politics & Policy - latest UK politics news headlines - FT.com", "url": "http://www.ft.com/cms/s/0/0ae876b8-74d7-11e5-8564-b4bb9a521c63.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "country": "US", "title": "Scots resist Green Investment Bank sale", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Scots resist Green Investment Bank sale", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:33:00.000+03:00", "replies_count": 0, "uuid": "5d0d498560e4caf27a8ef60ef7fca97f3a3c207d"}, "author": "", "url": "http://www.ft.com/cms/s/0/0ae876b8-74d7-11e5-8564-b4bb9a521c63.html?ftcamp=published_links%2Frss%2Fworld_uk_politics%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Scots resist Green Investment Bank sale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hammond"], "text": "Xi Jinping welcome defended by Hammond \nMr Swinney said planned Conservative legislative changes threatened the institution’s focus on green projects and could turn it into “an investment bank like all the other investment banks”. \nHe told a fringe meeting at the Scottish National party conference in Aberdeen last week he believed the UK government would need “legislative consent” from Scotland to remove public sector controls on the bank, set up to invest in environmentally friendly infrastructure. \nSuch consent is required when UK legislation has an impact on areas of devolved law. Mr Swinney said he had ordered officials to examine assertions it would not be needed in the case of the GIB. “I cannot see how this does not require our legislative consent,” he said. \nSajid Javid, UK business secretary, announced legal amendments last week to ensure that a privately invested GIB’s operations would no longer affect public sector net debt, which he called a “key objective in moving the company into the private sector”. \nBut Mr Swinney said he had not been consulted and criticised the business secretary’s decision to table an amendment without public consultation at the late stages of the Enterprise bill. “This is a big issue,” he said. \nGeorge Kerevan, an SNP member of the Treasury committee, said he understood from the GIB’s management that a sovereign wealth fund had been identified as the preferred bidder for an initial stake, but added he was “adamant” any change to the bank’s status should be blocked. \nThe GIB declined to comment on whether Scottish legislative consent was needed but said no preferred investors had been identified. “The sales process has not yet started, but we have been very pleased with early interest shown by a wide range of potential investors following the announcement of the planned capital-raising in June,” a spokesperson said. \nThe GIB was set up by the coalition government with cross-party support to address a gap in the market for funding of green infrastructure projects — and that need remained, Mr Kerevan said. In depth \nClimate change \nThe latest news and analysis on the world’s changing climate and the political moves afoot to tackle the problem \n“Everyone agreed it was necessary and the Green Bank has proved it can do that and turn a profit. There is no need to change the model,” added Mr Kerevan. \nMr Swinney’s warning will add to pressure on the UK government to find a way to ensure the GIB remains focused on green projects and continues to have its headquarters in Scotland after it comes under private control. \nMr Javid has said privatisation will give the bank access to more capital and is backed by the institution and its board. “The government also wants and expects a privately owned GIB to continue this clear focus on green sectors,” he has said. \nBut E3G, a think-tank that advised on the original plans for a green bank, said it seemed destined to compete with, rather than multiply, private investment. \nSepi Golzari-Munro, E3G senior policy adviser, said: “It was created to help address market failures and to open up major new investment opportunities for private investors in the UK’s low-carbon economy. It remains a mystery how the GIB will fulfil this function under the plans set out.” \nThe GIB has already been accused by some investors of acting too much like a typical commercial lender. \nThe business department declined to comment on Mr Swinney’s warning but UK officials are understood to believe Scottish consent is not needed for the law change. \nHowever, Aileen McHarg, professor of public law at Strathclyde university, said it was “incontrovertible‎” that the green purposes included in the legislation related to devolved matters. \n‎Scottish consent would be required for any change that might “have implications for future investment in green technologies”, she added. Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-10-20T15:33:00.000+03:00", "crawled": "2015-10-20T15:59:40.071+03:00", "highlightTitle": ""}