{"organizations": ["State House"], "uuid": "79f01bffd08213242be152d4bf79b053d5e5582f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nation.co.ke", "main_image": "\r\n    http://www.nation.co.ke/image/view/-/2899956/medRes/1138798/-/uc2n9xz/-/dnuhuru0510e.jpg", "site_section": "http://www.nation.co.ke/news/politics/Cord-begins-search-for-referendum-signatures/-/1064/2429002/-/view/asFeed/-/3vhj9h/-/index.xml", "section_title": "Daily Nation | Politics", "url": "http://www.nation.co.ke/news/politics/Kenya--Tanzania-to-jointly-fight-terrorism/-/1064/2899934/-/t57x7o/-/index.html", "country": "GB", "title": "Kenya, Tanzania to jointly fight terrorism, drug trafficking and poaching", "performance_score": 0, "site": "nation.co.ke", "participants_count": 0, "title_full": "Kenya, Tanzania to jointly fight terrorism, drug trafficking and poaching", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:35:00.000+03:00", "replies_count": 0, "uuid": "79f01bffd08213242be152d4bf79b053d5e5582f"}, "author": "", "url": "http://www.nation.co.ke/news/politics/Kenya--Tanzania-to-jointly-fight-terrorism/-/1064/2899934/-/t57x7o/-/index.html", "ord_in_thread": 0, "title": "Kenya, Tanzania to jointly fight terrorism, drug trafficking and poaching", "locations": ["Nairobi", "Tanzania", "Kenya", "Uhuru Kenyatta"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jakaya Kikwete"], "text": "Monday, October 5, 2015 Kenya, Tanzania to jointly fight terrorism, drug trafficking and poaching President Uhuru Kenyatta receives Tanzanian President Jakaya Kikwete on arrival at State House, Nairobi. PHOTO | PSCU Advertisement More by this Author \nKenya and Tanzania have agreed to scale up cooperation in the war against terrorism, drug trafficking and poaching. \nSpeaking on Monday during bilateral talks at State House, Nairobi, President Uhuru Kenyatta and Tanzanian President Jakaya Kikwete affirmed their commitment to fight the vices. \nThe leaders also resolved to forge closer trade and development ties. \nOn terrorism, President Kenyatta said as neighbours with strong bonds of friendship, the two countries must continue working together in a coordinated manner in the fight against the global menace. \n“Your country has in the past suffered, just like Kenya, at the hands of these merciless individuals. We must use the strongest possible action to stop the unnecessary violence that threatens the safety, security and prosperity of our peoples,” said President Kenyatta. \nAs the two countries improve their counter-terrorism efforts, President Kenyatta said they must address the factors that provide fodder for radicalisation of children and the youth. \nHe cited job creation for the youth, education, ensuring equity in the distribution of national wealth and public participation in decision making as some of the initiatives that would help to eliminate terrorism. \nPresident Kenyatta said the two governments should also remain steadfast in curbing drug trafficking and drug abuse, which have become thorny issues. \n“We need to consolidate efforts within our borders through heightened surveillance intelligence to stem drug trafficking,” said President Kenyatta. \nENDING POACHING \nFor his part, President Kikwete said time has come for the two countries to deal firmly with proponents of radicalisation and drug trafficking. \n“We must ensure that we close all the avenues that lead to the radicalisation of our youths. We must also step up mechanisms that would make it difficult for drug barons to peddle their wares,” he said. \nHe emphasised that by working jointly, Kenya and Tanzania stand a better chance of ending poaching, which is a major threat to wildlife in both countries. \nPresident Kenyatta thanked President Kikwete for undertaking the State visit. He said the visit, coming at a time when he is about to end his tenure as the President of Tanzania, reaffirms the existing mutually beneficial ties between the two countries. \n“Our two countries are eternally bound by a common destiny in which our citizens aspire to enjoy the promise of a region endowed with endless possibilities and opportunities. \n“Our strategic partnership and close collaboration has been and continues to be the foundation of our stability in the region, thus providing the much-needed momentum for growth and development,” said President Kenyatta. \nThe two leaders said that Kenya and Tanzania continue to make progress within the framework of the Joint Commission for Cooperation. The countries have worked together to enhance cooperation in areas of mutual benefit including in immigration, security, public service, infrastructure, agriculture, environment, trade and investment, health and education.", "external_links": [], "published": "2015-10-05T18:35:00.000+03:00", "crawled": "2015-10-06T00:18:41.847+03:00", "highlightTitle": ""}