{"organizations": [], "uuid": "65ebe476d5770d401e560d6361c1adfef52ce92d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://images.worldnow.com/AP/images/8914132_G.jpg", "site_section": "http://www.cbs8.com/category/13571/political-news", "section_title": "Political News - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30154713/kasich-touts-record-and-dance-skills-in-iowa", "country": "US", "title": "Kasich touts record _ and dance skills _ in Iowa", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Kasich touts record _ and dance skills _ in Iowa - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "65ebe476d5770d401e560d6361c1adfef52ce92d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30154713/kasich-touts-record-and-dance-skills-in-iowa", "ord_in_thread": 0, "title": "Kasich touts record _ and dance skills _ in Iowa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By CATHERINE LUCEY\nAssociated Press DAVENPORT, Iowa (AP) - John Kasich is intensifying his presidential campaign in Iowa, touting his fiscal record - and his dance moves - as he vies for support from Republicans who haven't picked a candidate in the crowded GOP field.\nIn Davenport, Iowa, Wednesday, the Ohio governor described himself as a budget dealmaker who would be tough against Islamic State militants and would seek a path to citizenship for people in the country illegally who have not otherwise broken any laws. The visit to the caucus leadoff state was Kasich's second in a week as he battles other candidates, such as New Jersey Gov. Chris Christie, in a place that has grown more competitive since Wisconsin Gov. Scott Walker exited the race.\n\"My strategy is to do as well as I can. We've been ramping up,\" Kasich said, noting that he has only been in the race for two months. \"Obviously we're spending more time here.\"\nDuring a question-and-answer session, Kasich talked about his budget work in Congress and his efforts to grow jobs and improve fiscal stability in Ohio. Kasich stressed his ability to work across the aisle, saying he knows \"how to get Republicans and Democrats to work together,\" though many Iowa Republicans who will influence the caucuses next year are hardcore partisans.\nOn foreign policy, Kasich said he would do \"everything I can to lead a coalition of countries to destroy ISIS, including boots on the ground.\"\nKasich, who served in Congress for 18 years, criticized the failed effort by some Republicans to strip Planned Parenthood of federal funding as a condition of passing a budget.\n\"You just don't go willy-nilly shutting government down if you're not going to get a decent result,\" Kasich said.\nKasich's appearance drew positive reviews from Ken Donnelly, 74, of West Liberty, who said he planned to caucus for him. He acknowledged that Kasich had more work to do, but said he could grow support with more campaigning in the state.\n\"He needs to come back a few more times,\" Donnelly said. \"Certainly the people I was sitting with on both sides were favorable.\"\nKasich's event swung from serious to playful. He boasted about a recent video of him dancing to the song \"Shut Up and Dance\" at an event. The moves - posted on YouTube by a Democratic political action committee - were reported by a number of news outlets.\nKasich pointed out that he had been praised by Cosmopolitan magazine online. He quipped, \"You want to talk about caucusing for somebody, go for the Cosmo guy.\"\n ", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T05:37:27.279+03:00", "highlightTitle": ""}