{"organizations": [], "uuid": "0f0f3b155b2e201578852222aea96aacd7731da6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "scroll.in", "main_image": "https://d1u4oo4rb13yy8.cloudfront.net/c3fc72b4-39c7-424b-9bc5-5b7bc295b7a0.jpg", "site_section": "http://trunkapi.scroll.in/feeds/newshunt.rss", "section_title": "Scroll.in - News. Politics. Culture.", "url": "http://Scroll.in/article/763684/jk-clashes-are-yet-another-reminder-of-the-contradictions-in-the-pdp-bjp-ruling-coalition", "country": "SG", "title": "J&K clashes are yet another reminder of the contradictions in the PDP-BJP ruling coalition", "performance_score": 0, "site": "scroll.in", "participants_count": 1, "title_full": "J&K clashes are yet another reminder of the contradictions in the PDP-BJP ruling coalition", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T17:30:00.000+03:00", "replies_count": 0, "uuid": "0f0f3b155b2e201578852222aea96aacd7731da6"}, "author": "Fahad Shah", "url": "http://Scroll.in/article/763684/jk-clashes-are-yet-another-reminder-of-the-contradictions-in-the-pdp-bjp-ruling-coalition", "ord_in_thread": 0, "title": "J&K clashes are yet another reminder of the contradictions in the PDP-BJP ruling coalition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "J&K clashes are yet another reminder of the contradictions in the PDP-BJP ruling coalition With protests over trucker's death, gap between Hindu-dominated Jammu and Muslim-dominated Kashmir grows wider. · Today · 02:30 pm Photo Credit: IANS Monday’s shutdown in Jammu and Kashmir to protest the murder of a trucker by a mob incensed by rumours of cow slaughter served as another reminder of the contradictions in the ruling coalition of the Peoples Democratic Party and the Bharatiya Janata Party.When the PDP decided in February to form an alliance with the BJP, it said that the move would help close the gap between Hindu-dominated Jammu and Muslim-majority Kashmir. Instead, the coalition government has only polarised the region further. Many of the political issues that the PDP has raised have been openly opposed by the BJP.The latest flashpoint is the debate over whether beef should be banned in the state, a controversy that erupted last month when the state High Court ordered that an 80-year-old rule prohibiting cattle slaughter should be strictly implemented. Though another bench of High Court later vacated the order, the row has intensified conflict between the state’s major communities.This was apparent on Monday, when separatists called for a general strike after a trucker from Kashmir succumbed to burn injuries in a Delhi hospital on Sunday, ten days after he was attacked by a Hindu mob in Jammu’s Udhampur.Zahid Rasool Bhat, 20, received 60% burn injuries in a petrol bomb attack on October 9 when his Srinagar-bound truck was parked on the national highway connecting Jammu with Kashmir. The Hindus in the area were protesting rumors of cow slaughter that later turned out to be false. Clashes reported On Monday, Kashmir valley was completely shut down amid protests and clashes. Most of the major towns and several districts of the Jammu division also protested, including Doda and Kishtwar. People in Banihal town burnt tyres on the Jammu-Srinagar national highway, which was closed to traffic.The recent violence echoes the mass protests in 2008 when the state government transferred forest land in the valley to the Amarnath shrine. At that time, too, Hindutva organisations threatened of a similar economic blockade by stalling traffic headed to the Valley through Jammu.The 2008 land agitation helped the BJP to improve its performance in the assembly elections. In 2002, BJP had won only one assembly seat and in 2008 it won 11. Now in 2014, the party won 25 seats and became part of the coalition government. The current political wrangles over beef and many other issues based on religion strengthen the BJP’s position in the state. In reality, the people in Kashmir are more scared of that development than about whether they are allowed to eat beef.After the trucker’s death, the Chief Minister Mufti Sayeed blamed the incident on the “politics of hate and intolerance” but remained silent on the BJP’s responsibility for raising the pitch by campaigning for beef bans across the country.Former chief minister Omar Abdullah questioned Sayeed’s “politics of hate” comment. “Earlier it was ‘enemies of peace.’ Why can't the man call a spade a spade?” Abdullah tweeted. “Another needless death in the name of beef ban for which the BJP and its affiliates including allies are directly responsible.” Ink attack Sayeed was, however, less ambiguous in his denunciation of the ink attack on Rashid Engineer, the independent lawmaker from North Kashmir’s Langate constituency. As he addressed the media in Delhi’s Press Club on Monday about the trucker’s death, three men attacked Engineer with ink and oil.The chief minister condemned the attack in no uncertain terms. In a vibrant democracy like India, “we need to have courage to respect dissent and provide space to different points of view”, he said. “The spate in unpleasant incidents such as this is most disturbing.”In this, though, Sayeed was contradicting the position of his own government, which has not allowed any dissent in Kashmir over beef ban row or any other issue. The Internet was banned for three days in September, and his government in the legislative assembly last month killed anti-beef ban bills.This notion that the PDP is more pro-BJP than pro-Kashmir has dented Sayeed’s stature as well as that of his party. We welcome your comments at letters@scroll.in", "external_links": [], "published": "2015-10-20T17:30:00.000+03:00", "crawled": "2015-10-20T13:07:06.097+03:00", "highlightTitle": ""}