{"organizations": [], "uuid": "1c8de2b54a8b57fc3020e940f7771f1e6da31d16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-08/05/full/1438759691-8367.jpg", "site_section": "http://www.business-standard.com//rss/politics-155.rss#", "section_title": "Politics", "url": "http://www.business-standard.com/article/politics/make-people-s-lives-smart-first-arvind-kejriwal-115101800314_1.html", "country": "IN", "title": "Make people's lives 'smart' first: Arvind Kejriwal News", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Make people's lives 'smart' first: Arvind Kejriwal | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "1c8de2b54a8b57fc3020e940f7771f1e6da31d16"}, "author": "Press Trust of India", "url": "http://www.business-standard.com/article/politics/make-people-s-lives-smart-first-arvind-kejriwal-115101800314_1.html", "ord_in_thread": 0, "title": "Make people's lives 'smart' first: Arvind Kejriwal News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Taking a jibe at the Centre for its 'Smart Cities' project, Delhi Chief Minister Arvind Kejriwal today said it is \"impossible\" to achieve it when common people remain poor, unemployed and starve for even basic facilities like drinking water.\n\n\"New Delhi Municipal Council (NDMC) is going to become a Smart City. I think, no city will become smart only because of good roads. It will become smart when people's lives also become smart. We have to make the people's lives smart first,\" Kejriwal said after inaugurating a Public Convenience facility near Traffic Training Park under the jurisdiction of NDMC.\n\nThe Chief Minister insisted that poor segment of populace must be the first to enjoy fruits of Smart Cities.\n\nALSO READ:  Talk less and work more on Swachh Bharat mission: Arvind Kejriwal \n\"Common people remain poor and unemployed. There is not even proper water supply in areas where they reside and we talk about a city becoming smart. It is impossible,\" he stressed.\n\nListing out issues which governments need to pay immediate attention to, the AAP leader expressed concern that quality of education in Delhi schools is going down and also stressed upon the need to concentrate more on providing good health facilities.\n\n\"There is 24-hour water supply in VIP areas, but in areas where common people reside water crisis is witnessed everyday,\" he added.\n\nHe also reached out to other parties, saying \"we all need to work together\" for bringing development.\n\n\"We had played politics and fought each other before elections. But after the formation of government, we need to work together. I appeal to all political parties to work jointly,\" he said.\n\nThe NDMC was listed in the Centre's Smart City plan under the Smart Cities Mission earlier this year.", "external_links": [], "published": "2015-10-18T03:00:00.000+03:00", "crawled": "2015-10-18T17:07:45.356+03:00", "highlightTitle": ""}