{"organizations": [], "uuid": "7100c0f685dc98d21302cdb03f01dacccbf9346a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usnews.com", "main_image": "http://www.usnews.com/cmsmedia/94/29/5707657f4cc5a3bc87e55a0db306/151022-biden-editorial.jpg", "site_section": "http://www.usnews.com/", "section_title": "U.S. News &amp; World Report: News, Rankings and Analysis on Politics, Education, Healthcare and More", "url": "http://www.usnews.com/news/articles/2015/10/22/biden-calls-for-4-years-of-free-college", "country": "US", "title": "Biden Calls for 4 Years of Free College", "performance_score": 0, "site": "usnews.com", "participants_count": 1, "title_full": "Biden Calls for 4 Years of Free College - US News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "7100c0f685dc98d21302cdb03f01dacccbf9346a"}, "author": "USNews", "url": "http://www.usnews.com/news/articles/2015/10/22/biden-calls-for-4-years-of-free-college", "ord_in_thread": 0, "title": "Biden Calls for 4 Years of Free College", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Biden Calls for 4 Years of Free College Vice President Joe Biden called for four years of free college, two more than the president has. \"We need to commit to 16 years of free public education for all our children,\" Vice President Joe Biden said yesterday in a speech at the White House.\nBy Lauren Camera Oct. 22, 2015 | 10:21 a.m. EDT + More When Vice President Joe Biden announced Wednesday that he will not run for president, his speech in the White House Rose Garden, flanked by President Barack Obama and his wife, Jill Biden, sounded more like a campaign stump than anything else.\nAmong the many lofty goals he said Democrats should prioritize during the 2016 election is a fresh look at the public education system, from kindergarten through grade 12 to pre-K through college.\nRELATED\nJoe Biden Didn't Run Because He Couldn't Win \"I believe we have to level the playing field for the American people,\" Biden said. \"And that's going to take access to education and opportunity to work.\"\n\"We need to commit to 16 years of free public education for all our children,\" he said, adding two years to the president's previous proposal of free community college for all.\n\"We all know that 12 years of public education is not enough,\" Biden continued. \"As a nation, let's make the same commitment to a college education today that we made to a high school education a hundred years ago.\"\nIn Obama's 2016 budget proposal , he requested $60 billion for two years of free community college for low-income students. And while higher education has been a focal point of many Democratic presidential candidates, it's barely nicked the radar of the Republican contenders.\nDemocratic presidential frontrunners, former Secretary of State Hillary Clinton and Sen. Bernie Sanders, the independent from Vermont, have proposed their own paths to making higher education more affordable.\nClinton's sweeping $350 billion proposal is aimed at eliminating college debt and calls for simplifying the federal student aid application, allowing borrowers to refinance student loans at market rates, making permanent the American Opportunity Tax credit, and pushing states to prevent students from graduating with debt.\nMeanwhile, Sanders' $70 plan would be a partnership between the federal government and states to provide four years worth of tuition to public colleges and universities.\nOPINION\nObama's Free Community College Plan Won't Work in a Broken System Biden's speech energized some in the Democratic base, including those who've spent years calling for better policies to help students with the surging price of tuition.\n\"The Democratic Party needs to stand for big ideas, and Joe Biden did the country a great service by pushing 2016 candidates to treat four years of college education as a prerequisite for success just like K-12 education,\" said Stephanie Taylor, the co-founder of the Progressive Change Campaign Committee.\n\"All top Democratic candidates have embraced the 'Warren wing' goal of debt-free college, and now they are debating how big to invest, which college costs should be free, and the specifics of how to get there,\" Taylor said, speaking of Massachusetts Sen. Elizabeth Warren's constant push to allow students to refinance their student loan debt. \"That is a great place for the debate to be.\"\nBiden also spoke Wednesday about early childhood education and the affordability of childcare for working parents.\n\"We need, as the President proposed, to triple the child care tax credit,\" Biden said, about the federal program that provides working parents up to $3,000 for use on day care for one child and up to $6,000 for two children.\n\"That alone will lead to a dramatic increase in the number of women able to be in the workforce and will raise our economic standards,\" he said.\nTAGS: Biden, Joe education education policy community colleges", "external_links": ["http://www.stumbleupon.com/badge/?url=http%3A%2F%2Ft.usnews.com%2FZefs7z%3Fsrc=usn_su", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Ft.usnews.com%2FZefs7z%3Fsrc=usn_li&title=Biden%20Calls%20for%204%20Years%20of%20Free%20College&summary=Vice%20President%20Joe%26nbsp%3BBiden%20called%20for%20four%20years%20of%20free%20college%2C%20two%20more%20than%20the%20president%20has.&source=U.%20S.%20News", "http://www.sanders.senate.gov/download/collegeforallsummary/?inline=file", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Ft.usnews.com%2FZefs7z%3Fsrc=usn_fb", "https://www.hillaryclinton.com/p/briefing/factsheets/2015/08/10/college-compact-debt/", "http://www.reddit.com/submit?url=http%3A%2F%2Ft.usnews.com%2FZefs7z%3Fsrc=usn_rd&title=Biden%20Calls%20for%204%20Years%20of%20Free%20College", "https://plus.google.com/share?url=http%3A%2F%2Ft.usnews.com%2FZefs7z%3Fsrc=usn_gp", "https://twitter.com/share?url=http%3A%2F%2Ft.usnews.com%2FZefs7z%3Fsrc=usn_tw&via=usnews&text=Biden%20Calls%20for%204%20Years%20of%20Free%20College"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T23:52:45.274+03:00", "highlightTitle": ""}