{"organizations": ["New Hampshire", "Congress", "New Hampshire Union", "Facebook", "Democrats Vermont"], "uuid": "7a3c0d7b57af164c7f3bb630d98a93d6497645de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/141106064728-rose-mcgowan-october-2014-t3-entertainment.jpg", "site_section": "http://rss.cnn.com/rss/cnn_allpolitics", "section_title": "CNN.com - Politics", "url": "http://edition.cnn.com/2015/10/12/politics/rose-mcgowan-no-labels-conference-hijack/index.html?eref=rss_politics", "country": "US", "title": "Actress 'hijacks' political dinner in New Hampshire", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Actress 'hijacks' political dinner in New Hampshire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T16:09:00.000+03:00", "replies_count": 0, "uuid": "7a3c0d7b57af164c7f3bb630d98a93d6497645de"}, "author": "", "url": "http://edition.cnn.com/2015/10/12/politics/rose-mcgowan-no-labels-conference-hijack/index.html?eref=rss_politics", "ord_in_thread": 0, "title": "Actress 'hijacks' political dinner in New Hampshire", "locations": ["New Hampshire", "Caucasian", "America", "Utah", "Manchester"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bernie Sanders", "Donald Trump", "Jon Huntsman", "Dean Norris", "Richard Kind", "Rose McGowan", "Clancy", "Lindsey Graham", "John Kasich", "McGowan", "Ryan Clancy", "Graham", "George Pataki", "McQuaid", "Joe Lieberman", "Jim Webb", "Wayne Knight", "Joe McQuaid", "Chris Christie", "Martin O'Malley"], "text": "CNN.com <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Actress Rose McGowan 'hijacks' political dinner in New Hampshire Updated 1403 GMT (2103 HKT) October 12, 2015 Manchester, New Hampshire (CNN) Actress Rose McGowan \"hijacked\" a political dinner Sunday night in New Hampshire that was focused on encouraging bipartisan leadership, saying the crowd lacked diversity and didn't represent real America. The group, No Labels, hosted the dinner ahead of its \"Problem Solver Convention\" on Monday in the first-in-the-nation state. Eight presidential candidates from both political parties are scheduled to speak. \"I am completely hijacking this,\" said the actress, known for her roles in \"Charmed\" and \"Jawbreaker.\" \"I do see non-partisanship, but I've heard this stuff for years.\" She went on to describe the predominantly Caucasian audience, as a \"very, very white room.\" \"Maybe you don't actually integrate with my America,\" McGowan said. Read More Sunday's dinner was designed to be a respectful exchange of ideas. Organizers instructed the group to speak openly about the status of the American electorate and make predictions about the 2016 race but were encouraged to do so without criticizing parties or candidates. As the dinner wound to a close, audience members were asked to recognize a number of celebrities in attendance, including McGowan, Richard Kind and Wayne Knight. That's when McGowan took the opportunity to speak. \"I would say to you, one, get out of my body; two, equal pay for women; Three, integrate,\" McGowan said. \"You cannot make laws for America without knowing it.\" \"I know real America. I am not from Hollywood,\" McGowan said, as she noted that she owns homes in four countries. One attendee, publisher for the New Hampshire Union Leader Joe McQuaid, was not impressed with McGowan's performance. \"She spent the night on her phone. Clearly had her agenda. Not interested in #nolabels. \"Newman\" was way better,\" McQuaid tweeted, referencing the actor Knight from \"Seinfeld\" who was also at the dinner. Monday's lineup includes Republicans Donald Trump, Gov. Chris Christie, Sen. Lindsey Graham, Gov. John Kasich, former Gov. George Pataki, as well as Democrats Vermont Senator Bernie Sanders, former Gov. Martin O'Malley and former Sen. Jim Webb. Attendees at Sunday's dinner included No Labels co-chairs, former Sen. Joe Lieberman and former Utah Gov. Jon Huntsman, members of Congress -- including Graham -- and local New Hampshire activists. Staffers for a number of presidential campaigns and their supporting super PACs attended as well. After the event, McGowan took to Twitter and Facebook to explain her disruption. \"I just fully hijacked a gala dinner & f---ing gave it to them. I represent America. I am an American and I have a right to speak,\" McGowan tweeted. She said after \"two hours of listening to old privileged white men discuss what Americans want without being integrated with an America I know\" she decided to speak. While event organizers could be heard angrily discussed McGowan's outburst after the dinner, No Labels was more subdued in its official statement. \"One of our invited guests wanted to make sure we heard her point of view,\" No Labels spokesman Ryan Clancy said in a statement. \"Members of the No Labels movement welcome people from across the political spectrum with strong views on a lot of issues.\" McGowan was originally invited to talk on a panel Monday with other actors focused on how storytelling can apply to politics. Clancy told CNN that after Sunday night's \"little incident\" No Labels \"subsequently decided to not include her.\" The panel will still be held with other actors, including Knight and Dean Norris from \"Breaking Bad.\"", "external_links": [], "published": "2015-10-12T16:09:00.000+03:00", "crawled": "2015-10-12T16:35:05.279+03:00", "highlightTitle": ""}