{"organizations": [], "uuid": "c0e77c0fde23d085d4d381c5ceb4b5e60e76f9da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "beforeitsnews.com", "main_image": "http://www.standupamericaus.org/sua/wp-content/uploads/2015/10/JCPOA-300x168.jpg", "site_section": "http://beforeitsnews.com/home/featuredlist/top_politics.html", "section_title": "Politics | Featured List ", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/iran-deal-is-illegal-u-s-officials-conclude-3063074.html", "country": "US", "title": "Iran Deal is Illegal U.S. Officials Conclude | Opinion - Conservative", "performance_score": 0, "site": "beforeitsnews.com", "participants_count": 1, "title_full": "Iran Deal is Illegal U.S. Officials Conclude | Opinion - Conservative", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T22:22:00.000+03:00", "replies_count": 0, "uuid": "c0e77c0fde23d085d4d381c5ceb4b5e60e76f9da"}, "author": "beforeitsnews.com", "url": "http://beforeitsnews.com/opinion-conservative/2015/10/iran-deal-is-illegal-u-s-officials-conclude-3063074.html", "ord_in_thread": 0, "title": "Iran Deal is Illegal U.S. Officials Conclude | Opinion - Conservative", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Before It's News)\nEditor’s Note – The rule-of-law is once again cast aside by the Obama Administration, this time concerning Iran and they had to know they were breaking the law. With all the talks over such a long period, the lawyers had to know the deal concerning sanctions relief was just flatly ignored.\nThe worst deal in US history is also illegal and senior US officials have concluded this fact as they begin implementation of the deal. With all the turmoil over the Speaker of the House, we hope folks do not lose sight of this important fact. Unfortunately, it seems little will be done to stop the deal.\nScore another win for Iran and it deepens the abject failure for the USA by the Obama/Kerry/Clinton cabal of fools.\nU.S. officials conclude Iran deal violates federal law\nBy James Rosen – Fox News Exclusive\nSome senior U.S. officials involved in the implementation of the Iran nuclear deal have privately concluded that a key sanctions relief provision – a concession to Iran that will open the doors to tens of billions of dollars in U.S.-backed commerce with the Islamic regime – conflicts with existing federal statutes and cannot be implemented without violating those laws, Fox News has learned.\nAt issue is a passage tucked away in ancillary paperwork attached to the Joint Comprehensive Plan of Action , or JCPOA, as the Iran nuclear deal is formally known. Specifically, Section 5.1.2 of Annex II provides that in exchange for Iranian compliance with the terms of the deal, the U.S. “shall…license non-U.S. entities that are owned or controlled by a U.S. person to engage in activities with Iran that are consistent with this JCPOA.”\nOn July 14th, the P5+1 countries and Iran signed a Joint Comprehensive Plan of Action (JCPOA)\nIn short, this means that foreign subsidiaries of U.S. parent companies will, under certain conditions, be allowed to do business with Iran. The problem is that the Iran Threat Reduction and Syria Human Rights Act (ITRA) , signed into law by President Obama in August 2012, was explicit in closing the so-called “foreign sub” loophole.\nIndeed, ITRA also stipulated, in Section 218, that when it comes to doing business with Iran, foreign subsidiaries of U.S. parent firms shall in all cases be treated exactly the same as U.S. firms: namely, what is prohibited for U.S. parent firms has to be prohibited for foreign subsidiaries, and what is allowed for foreign subsidiaries has to be allowed for U.S. parent firms.\nWhat’s more, ITRA contains language, in Section 605, requiring that the terms spelled out in Section 218 shall remain in effect until the president of the United States certifies two things to Congress: first, that Iran has been removed from the State Department’s list of nations that sponsor terrorism, and second, that Iran has ceased the pursuit, acquisition, and development of weapons of mass destruction.\nAdditional executive orders and statutes signed by President Obama, such as the Iran Nuclear Agreement Review Act , have reaffirmed that all prior federal statutes relating to sanctions on Iran shall remain in full effect.\nFor example, the review act – sponsored by Sens. Bob Corker (R-Tennessee) and Ben Cardin (D-Maryland), the chairman and ranking member, respectively, of the Foreign Relations Committee, and signed into law by President Obama in May – stated that “any measure of statutory sanctions relief” afforded to Iran under the terms of the nuclear deal may only be “taken consistent with existing statutory requirements for such action.” The continued presence of Iran on the State Department’s terror list means that “existing statutory requirements” that were set forth in ITRA, in 2012, have not been met for Iran to receive the sanctions relief spelled out in the JCPOA.\nAs the Iran deal is an “executive agreement” and not a treaty – and has moreover received no vote of ratification from the Congress, explicit or symbolic – legal analysts inside and outside of the Obama administration have concluded that the JCPOA is vulnerable to challenge in the courts, where federal case law had held that U.S. statutes trump executive agreements in force of law.\nIran’s Foreign Minister Mohammad Javad Zarif (L) shakes hands with UN Secretary-General Ban Ki Moon\nAdministration sources told Fox News it is the intention of Secretary of State John Kerry, who negotiated the nuclear deal with Iran’s foreign minister and five other world powers, that the re-opening of the “foreign sub” loophole by the JCPOA is to be construed as broadly as possible by lawyers for the State Department, the Treasury Department and other agencies involved in the deal’s implementation.\nBut the apparent conflict between the re-opening of the loophole and existing U.S. law leaves the Obama administration with only two options going forward.\nThe first option is to violate ITRA, and allow foreign subsidiaries to be treated differently than U.S. parent firms. The second option is to treat both categories the same, as ITRA mandated – but still violate the section of ITRA that required Iran’s removal from the State Department terror list as a pre-condition of any such licensing.\nIt would also renege on the many promises of senior U.S. officials to keep the broad array of American sanctions on Iran in place. Chris Backemeyer, who served as Iran director for the National Security Council from 2012 to 2014 and is now the State Department’s deputy coordinator for sanctions policy, told POLITICO last month “there will be no real sanctions relief of our primary embargo….We are still going to have sanctions on Iran that prevent most Americans from…engaging in most commercial activities.”\nLikewise, in a speech at the Washington Institute for Near East Policy last month, Adam Szubin, the acting under secretary of Treasury for terrorism and financial crimes, described Iran as “the world’s foremost sponsor of terrorism” and said existing U.S. sanctions on the regime “will continue to be enforced….U.S. investment in Iran will be prohibited across the board.”\nNominated to succeed his predecessor at Treasury, Szubin appeared before the Senate Banking Committee for a confirmation hearing the day after his speech to the Washington Institute. At the hearing, Sen. Tom Cotton (R-Arkansas) asked the nominee where the Obama administration finds the “legal underpinnings” for using the JCPOA to re-open the “foreign sub” loophole.\nSzubin said the foreign subsidiaries licensed to do business with Iran will have to meet “some very difficult conditions,” and he specifically cited ITRA, saying the 2012 law “contains the licensing authority that Treasury would anticipate using…to allow for certain categories of activity for those foreign subsidiaries.”\nElsewhere, in documents obtained by Fox News, Szubin has maintained that a different passage of ITRA, Section 601, contains explicit reference to an earlier law – the International Emergency Economic Powers Act , or IEEPA, on the books since 1977 – and states that the president “may exercise all authorities” embedded in IEEPA, which includes licensing authority for the president.\nHowever, Section 601 is also explicit on the point that the president must use his authorities from IEEPA to “carry out” the terms and provisions of ITRA itself, including Section 218 – which mandated that, before this form of sanctions relief can be granted, Iran must be removed from the State Department’s terror list. Nothing in the Congressional Record indicates that, during debate and passage of ITRA, members of Congress intended for the chief executive to use Section 601 to overturn, rather than “carry out,” the key provisions of his own law.\nOne administration lawyer contacted by Fox News said the re-opening of the loophole reflects circular logic with no valid legal foundation. “It would be Alice-in-Wonderland bootstrapping to say that [Section] 601 gives the president the authority to restore the foreign subsidiary loophole – the exact opposite of what the statute ordered,” said the attorney, who requested anonymity to discuss sensitive internal deliberations over implementation of the Iran deal.\nAt the State Department on Thursday, spokesman John Kirby told reporters Secretary Kerry is “confident” that the administration “has the authority to follow through on” the commitment to re-open the foreign subsidiary loophole.\n“Under the International Emergency Economic Powers Act, the president has broad authorities, which have been delegated to the secretary of the Treasury, to license activities under our various sanctions regimes, and the Iran sanctions program is no different,” Kirby said.\nSen. Ted Cruz (R-Texas), the G.O.P. presidential candidate who is a Harvard-trained lawyer and ardent critic of the Iran deal, said the re-opening of the loophole fits a pattern of the Obama administration enforcing federal laws selectively.\n“It’s a problem that the president doesn’t have the ability wave a magic wand and make go away,” Cruz told Fox News in an interview. “Any U.S. company that follows through on this, that allows their foreign-owned subsidiaries to do business with Iran, will very likely face substantial civil liability, litigation and potentially even criminal prosecution. The obligation to follow federal law doesn’t go away simply because we have a lawless president who refuses to acknowledge or follow federal law.”\nA spokesman for the Senate Banking Committee could not offer any time frame as to when the committee will vote on Szubin’s nomination.", "external_links": ["http://www.standupamericaus.org/sua/wp-content/uploads/2015/10/BanKiMoon.IranFM-300x169.jpg", "http://www.politico.com/agenda/story/2015/09/the-debrief-whats-next-for-the-iranian-sanctions-000259", "http://www.state.gov/documents/organization/245320.pdf", "http://feeds.feedburner.com//https://www.congress.gov/bill/114th-congress/senate-bill/615/cosponsors", "http://www.state.gov/e/eb/tfs/spi/iran/jcpoa/", "http://www.c-span.org/video/?328135-1/treasury-undersecretary-nominee-adam-szubin-confirmation-hearing", "http://www.banking.senate.gov/public/", "http://feeds.feedburner.com//https://www.govtrack.us/congress/bills/112/hr1905/text", "http://www.foxnews.com/politics/2015/10/09/exclusive-us-officials-conclude-iran-deal-violates-federal-law/?intcmp=hpbt2", "http://www.washingtoninstitute.org/policy-analysis/view/beyond-the-vote-implications-of-the-iran-nuclear-agreement", "http://www.treasury.gov/resource-center/sanctions/Documents/ieepa.pdf", "http://www.standupamericaus.org/sua/wp-content/uploads/2015/10/JCPOA-300x168.jpg"], "published": "2015-10-09T22:22:00.000+03:00", "crawled": "2015-10-10T01:54:35.977+03:00", "highlightTitle": ""}