{"organizations": [], "uuid": "2a175f007a7efe4a77be1314e6cc27a65eb21c31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/10/12/Interactivity/Images/150990596.jpg", "site_section": "http://www.washingtonpost.com/opinions/left-leaning", "section_title": "Opinions: Washington Post Opinion, Editorial, Op Ed, Politics Editorials - The Washington Post", "url": "http://www.washingtonpost.com/opinions/repeat-after-paul-ryan-i-cannot-and-will-not-give-up-my-family-time/2015/10/22/ef34bf2a-78ce-11e5-b9c1-f03c48c96ac2_story.html", "country": "US", "title": "Women, repeat after Paul Ryan: ‘I cannot and will not give up my family time.’", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Women, repeat after Paul Ryan: ‘I cannot and will not give up my family time.’ - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "2a175f007a7efe4a77be1314e6cc27a65eb21c31"}, "author": "John Woodrow Cox", "url": "http://www.washingtonpost.com/opinions/repeat-after-paul-ryan-i-cannot-and-will-not-give-up-my-family-time/2015/10/22/ef34bf2a-78ce-11e5-b9c1-f03c48c96ac2_story.html", "ord_in_thread": 0, "title": "Women, repeat after Paul Ryan: ‘I cannot and will not give up my family time.’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rep. Paul Ryan (R-Wis.) with his family in 2012. (Mark Wilson/Getty Images) By Amanda Bennett October 22 at 8:33 PM Amanda Bennett is a contributing columnist for The Post.\nW omen, take heed.\nPaul Ryan, the Wisconsin congressman making a run for the House speaker’s chair, is driving a hard bargain. He wants the Hatfields and McCoys within his party to put down their arms and unite behind him. He wants to make it harder for his colleagues to fire him.\nAnd he wants to get home for dinner.\n“ I cannot and will not give up my family time ,” he announced as a condition of his candidacy.\nWomen: Take that sentence. When you’re alone, read it out loud to yourself a couple of times. Get comfortable with it. Memorize it. Learn to say it with conviction. And then go out and use it.\nI know, I know. It’s tough out there. There still are many — way too many — barriers preventing families and, let’s be honest, still mostly women from doing their jobs well while doing a great job raising their families. Child care is still too expensive — prohibitively so for low-income families. Family leave is capped at 12 weeks, and even then it’s unpaid and required only at bigger companies. The United States is one of two out of 185 countries sampled by the United Nations that doesn’t require at least some paid leave. Indeed, we can thank the good congressman himself for his role in helping keep the status quo: For one thing, he voted against giving federal workers four weeks of paid leave for childbirth or adoption.\nYet unless we are lobbyists, activists, congresswomen or, say, president of the United States, making these changes is beyond our control. Even if we all were to agree that the United States should emulate Sweden and offer 480 days of paid parental leave, when do we think that is going to happen? Tomorrow? Next month? Next year?\nNo? Well, what do you plan to do in the meantime?\nHere’s a thought: Use the power you already have. We all have more power than we are brave enough to use. There is more leave time to be had. There are more flexible arrangements. More conference calls from home. More ability to attend the 4 p.m. game and finish the report after dinner. More opportunity to say, as Ryan says, “I cannot and will not give up my family time.” And still be an excellent worker.\nWomen often confuse the assertion that they have power with the notion that they are to blame. That’s rubbish. That’s wasteful. Remember that old Bob Newhart psychiatry skit ? I’m saying the same thing his character does: Stop it! Do not waste your own power fretting over blame. Power is a wonderful thing. Seize it.\nYes, I know. It’s completely true that many of us, way too many of us, are truly powerless. Many of us have absolutely no control over our schedules. No control over our lives. But I’ll say it again: There are more of us who have power right now than are brave enough to use it. That’s why it’s even more important that those of us who do have power that we aren’t using — and we are more numerous than we think — make our workplaces adjust themselves, even ever so slightly, to us. That’s how we get things to change, not just for ourselves but for everyone.\nIt’s a risk, of course. Yet there are thousands, maybe hundreds of thousands, maybe millions all around the world who over the past half-century took similar or even bigger risks. Those who were the first to walk, pregnant, into a mostly male workplace. Those who were the first to take maternity leaves — and then confound all expectations by returning. Those who demanded a place to pump. Or a work-from-home schedule. Those who stood up for equal pay, or even sued for it. Even those of us who took a deep breath, walked out at 5 p.m. and figured out how to get the work done nonetheless.\nHistory tells us that fighting for individual rights is one of the ways we hasten the spread of collective rights.\n“I cannot and will not give up my family time.” Just say it.\nYou will tell me that no woman can say that sentence. Only a man, and maybe only a powerful man like a congressman, can utter a sentence like that and expect to be taken seriously. Yet men, especially powerful men (or would-be powerful men), would disagree. Powerful people may have more, well, power. They also have more to lose. (So do powerful women. Just ask actress Jennifer Lawrence, who recently spoke out about her discovery that she was paid less than her male co-stars.) Even where paternity leave is available, studies show that a man taking advantage of it may be penalized even more than a similarly placed woman. He’s not seen as committed enough. Not a team player. Not manly enough.\nDo it anyway.\nFor those women with male partners, do them, and yourselves, a favor. After you have memorized Congressman Ryan’s sentence, hand it over to your partner.\n“I cannot and will not give up my family time.”\nThen both of you go use it. The more people who say it and expect to get it, the more things will change and the more it will become normal, not strange.\nTake your power. Use your power. Push the edges. Push to have the system changed, but also work to change things for yourselves.\nHow else will things get done?\nRead more about this topic:\nCatherine Rampell: Paid family leave is no pipe dream\nDana Milbank: Can Paul Ryan keep his dignity?\nE.J. Dionne Jr.: Family values hypocrisy\nHarold Meyerson: The U.S.’s exceptionally bad support for parental leave\nThe Post’s View: Making the House Republicans behave", "external_links": ["https://vimeo.com/97370236", "http://www.dol.gov/whd/fmla/", "http://www.ontheissues.org/HouseVote/Party_2009-H310.htm", "http://ilo.org/wcmsp5/groups/public/---dgreports/---dcomm/---publ/documents/publication/wcms_242615.pdf", "http://www.politifact.com/truth-o-meter/statements/2015/jan/21/barack-obama/barack-obama-says-united-states-only-developed-cou/", "http://www.rci.rutgers.edu/~rudman/Rudman%20%26%20Mescher%20Femininity%20Stigma_in%20press.pdf", "https://sweden.se/quick-facts/parental-leave/", "http://www.amazon.com/exec/obidos/ASIN/1610393260"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T04:22:22.018+03:00", "highlightTitle": ""}