{"organizations": [], "uuid": "09c6914fd458e78d65a10b6083ba1b0e27de5c78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-bda9f39b716b7480413b55589f8dab03.jpg", "site_section": "http://washingtonexaminer.com/rss/politics", "section_title": "WashingtonExaminer.com RSS - politics", "url": "http://www.washingtonexaminer.com/netanyahu-u.s.-wrong-force-not-excessive/article/2574200?custom_click=rss", "country": "US", "title": "Netanyahu: U.S. wrong, force not 'excessive'", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Netanyahu: U.S. wrong, force not 'excessive' | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:28:00.000+03:00", "replies_count": 0, "uuid": "09c6914fd458e78d65a10b6083ba1b0e27de5c78"}, "author": "Curt Mills", "url": "http://www.washingtonexaminer.com/netanyahu-u.s.-wrong-force-not-excessive/article/2574200?custom_click=rss", "ord_in_thread": 0, "title": "Netanyahu: U.S. wrong, force not 'excessive'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Israeli Prime Minister Benjamin Netanyahu on Thursday rejected the Obama administration's assertion that Israel is using \"excessive\" force in some cases as it fights back against violence from Palestinians.\nA day earlier, State Department spokesman John Kirby said Israel has the right to protect its citizens from the rising number of attacks, but said in some cases, Israel has gone too far.\n\"Now, we have seen some ... I wouldn't call the checkpoints this, but we've certainly seen some reports of what many would consider excessive use of force,\" Kirby said. \"Obviously, we don't like to see that, and we want to see restrictions that are elevated in this time of violence to be as temporary as possible if they have to be enacted.\"\nBut Netanyahu reacted by rejecting that, and dismissing Palestinian claims that Israeli forces killed Ahmed Manashra.\n  Bush and Rubio squabble while Trump runs away with it After Bush announced his fundraising total, his campaign started a spat with Rubio over who did better.\nBy Byron York • 10/16/15 6:19 AM Related Story: http://www.washingtonexaminer.com/article/2574118/ \"First of all, he isn't dead, he's alive, and he isn't innocent, he tried to kill a 13-year-old riding a bike, who was the true innocent,\" Netanyahu said in a press conference today. \"He's now being be treated at Haddasah hospital in Israel.\"\n\"We expect fair-minded observers to see that use of force is justified, given that knife and ax wielders are on streets,\" Netanyahu said in response, according to the Jerusalem Post .\nNetanyahu's frosty comments came in the wake of rising criticism of Israel as it defends itself from random attacks on its streets, which Israel says are being encouraged by Palestinian leaders. Still, many in the press have focused on the death of Palestinians at the hands of Israel.\nSecretary of State John Kerry said he would soon travel to Israel to help \"calm things down.\" Netanyahu said he's willing to meet with both Kerry and Palestinian Authority President Mahmoud Abbas, but said he believes the world is unfairly making excuses for violence perpetrated by Palestinians.\n\"The international community has given Abbas a pass,\" Netanyahu said. \"When someone gives him a pass to incite violence he will continue to incite to violence.\"\nAlso from the Washington Examiner Boehner's bucket list: Find a speaker, solve fiscal train wreck The current House speaker had hoped he could retire on Oct. 30.\nBy Susan Ferrechio • 10/16/15 12:01 AM Top Story RNC chair: Republicans are 'cooked' if defeated in 2016 The Republican Party has become a \"a midterm party\" that struggles with the presidential elections.\nBy Al Weaver • 10/16/15 12:01 AM", "external_links": [], "published": "2015-10-15T17:28:00.000+03:00", "crawled": "2015-10-16T14:31:59.662+03:00", "highlightTitle": ""}