{"organizations": [], "uuid": "19e8a40c859c6088fa17a3ca5ad104a0366696c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tctmagazine.com", "main_image": "http://www.tctmagazine.com/downloads/7284/download/hybrid-manufacturing.jpg?cb=a84ecf3c778a0820dda5e4dc6e48e765", "site_section": "http://www.tctmagazine.com/api/rss/content.rss", "section_title": "TCT Magazine | 3D Printer & 3D Printing News | Additive Manufacturing | Product Development Technology", "url": "http://www.tctmagazine.com/tct-show-3D-printing-exhibition/traditional-manufacturing-reborn-hybrid-technologies/", "country": "US", "title": "Traditional manufacturing reborn", "performance_score": 0, "site": "tctmagazine.com", "participants_count": 1, "title_full": "Traditional manufacturing reborn", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:40:00.000+03:00", "replies_count": 0, "uuid": "19e8a40c859c6088fa17a3ca5ad104a0366696c3"}, "author": "Laura Griffiths", "url": "http://www.tctmagazine.com/tct-show-3D-printing-exhibition/traditional-manufacturing-reborn-hybrid-technologies/", "ord_in_thread": 0, "title": "Traditional manufacturing reborn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expand Additive technologies are great for many applications. They offer a universal set of advantages that are transforming production lines in all corners of industry, all over the world. Yet in its current state, additive cannot exist on its own and even with on-going improvements in speeds and materials, there is still a need for pre and post-additive techniques to be applied in order to truly reap the benefits. In some cases, traditional techniques are still outplaying the process altogether. \nTaking the best of traditional manufacturing and the opportunities within additive technologies, hybrid manufacturing has been making its way onto the scene, boasting benefits of both processes. One of those additive technologies was demonstrated for the first time at TCT Show + Personalize in the UK earlier this month in the form of an up-scaled 1997 machine tool exhibited by Hybrid Manufacturing Technologies . \nFounded in 2012 by Dr. Jason Jones and Peter Coates following an initial R&D project and De Montfort University’s Additive Manufacturing and 3D printing research laboratory and a four-year Innovate UK supported research initiative, RECLAIM, Hybrid is dedicated to combining subtractive and additive technologies. \nSpeaking with Dr. Jason Jones at TCT Show, he describes hybrid as the next “natural step” for manufacturing and stresses that it is most definitely not a case of choosing between one or the other but rather benefitting from the unique positives of both. \nJason commented: “Normally in a machine tool environment, you’ve got a variety of different cutting tools and you choose what you want for what you’re doing. In additive we’ve never had that luxury.” × Expand \nHybrid toolheads. \nThat commodity now has the opportunity to become normality with Hybrid’s AMBIT multi-task system, a series of toolheads and docking systems which can turn almost any CNC machine into an additive system using a simple tool change. This means that component manufacture, various material compositions, finishing and inspection can be achieved in a single setup \n“I feel like that message has been understated in the selling of the metal systems,” Jason explained. “There’s a lot of synergy between machining and additive and yet they’ve never made the leap from ‘businesses to businesses’ to ‘business to customer’ that additive has. So for industry to see this product and use it inside a machine tool is like a revelation.” \nThe technology can be fitted to most CNC machine configurations and robotic platforms with relative ease. This requires integration including a docking mechanism and the addition of a laser safe door. Then it is a matter of which tool heads and laser the user wants to apply to the system which depending on optics and laser size can cost upwards of $100,000. In addition, as technology advances and more tool heads become available, users have the option to upgrade their machines to the specifications they need. As Jason points out, in an industry where the initial layout for single additive system can be an extreme investment, for many companies, a hybrid machine could provide a more effective solution. \n“Here you can take an old machine tool and you use the additive function as much as it makes sense and where it doesn’t make sense, you use machining. It’s like a technology pivot but its not just changing to a new technology, you have the whole spectrum.” \nThe hybrid system on display at TCT Show certainly had people excited, particularly by the possibility of being able to update a popular machine that’s almost 20 years old. In the wider additive manufacturing community, awareness and interest has continued to grow after the AMBIT was granted the 2015 International Additive Manufacturing Award earlier this year, a $100,000 prize that highlights technological innovation in the 3D printing sector. \nThis hybrid solution emphasises the reality that additive isn’t about being a replacement to traditional techniques but rather a complementary tool in the box. It gives manufacturers the choice to switch between the two and integrate new technology into a familiar environment, allowing new avenues to be explored and old processes to be reborn. Tags", "external_links": [], "published": "2015-10-13T12:40:00.000+03:00", "crawled": "2015-10-13T18:59:11.266+03:00", "highlightTitle": ""}