{"organizations": [], "uuid": "04c3fc1bec1d191daf3733561242b2cc2afdec05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/patrickralla.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-patrick-rall-passion-entanglement.html", "country": "US", "title": "Patrick Rall: A passion for entanglement", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Patrick Rall: A passion for entanglement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T13:40:00.000+03:00", "replies_count": 0, "uuid": "04c3fc1bec1d191daf3733561242b2cc2afdec05"}, "author": "", "url": "http://phys.org/news/2015-10-patrick-rall-passion-entanglement.html", "ord_in_thread": 0, "title": "Patrick Rall: A passion for entanglement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Patrick Rall", "Seth Hansen", "Rod Pyle Caltech"], "text": "Patrick Rall: A passion for entanglement October 14, 2015 by Rod Pyle Caltech undergraduate Patrick Rall worked on quantum information science during last summer's SURF session. Credit: Seth Hansen \nFor senior Patrick Rall, a native of Munich, Germany, the summer offers one of the year's few chances to visit home. But for the last two summers, Rall, a Caltech physics major, has been spending his summers on campus, drawn by another opportunity—the chance to conduct cutting-edge research while being mentored by John Preskill, the Richard P. Feynman Professor of Theoretical Physics, as part of the Institute's Summer Undergraduate Research Fellowships (SURF) program. Last year, Rall worked in the laser lab of Assistant Professor of Physics David Hsieh on a condensed matter physics experiment. This summer, he switched his attention to quantum information science, a new field that seeks to exploit quantum mechanical effects to create next-generation computers that will be faster and more secure than those currently available. \nA key idea in quantum mechanics is superposition of states. Subatomic particles like electrons can be described as having multiple positions, or more than one speed or energy level. This is illustrated by the thought experiment developed in 1935 by Austrian physicist Edwin Schrödinger. In it, a cat is placed into an imaginary box containing a bottle of poison, radioactive material, and a radiation detector. If a radioactive particle decays and radiation is detected inside the box, the poison is released and the cat is killed. But according to quantum mechanics, the cat could be simultaneously alive and dead. Yet if one were to open the lid of the box, the cat would become alive or dead. By opening the box, we have destroyed the quantum nature of the state; that is to say, the observation itself affects the outcome, and yet that outcome is randomly determined. \n\"Where this gets really interesting is when more than one cat gets involved,\" Rall says. \"Then we can have states where looking at one cat determines the outcome of looking at the other, even if they are on different continents or even different planets. For example, I cannot know if I will see a live or a dead cat upon opening either box, but I can know that the cats are either both alive or both dead.\" \nThis \"spooky action at a distance\"—as Einstein phrased it—is called entanglement, and an entangled state, physicists say, can store information. \"When looking at systems with many cats, the amount of entanglement information is much larger than what I can obtain by looking at the cats individually,\" Rall says. \"To harness the sheer quantity of information stored in these so-called many-body systems, we must better understand the structure of these spooky correlations. This is what I worked on this summer.\" \nQuantum many-body systems are difficult to simulate on a computer, but by looking at small-enough systems and using mathematical tools, researchers can study complex entangled quantum states. Physicists have been studying many-body entanglement for a long time because of its importance in understanding certain semiconductors. \n\"This summer, I had the privilege to work under Professor Preskill, and that was an incredible experience,\" Rall says. A central interest of Preskill's lab is to design schemes for quantum computation. Modern computers use classical bits—ones and zeroes—to store data. A quantum computer would use quantum bits—or qubits—and use their superposition and entanglement to perform computation. Quantum computers, while still in the experimental stage (with heavy investment from companies like IBM, Microsoft, and Google), have been touted for their potential to generate unbreakable codes and to efficiently simulate many complex systems, with implications for computational chemistry and biology. \n\"The most interesting thing about the quantum computer is that we have no idea what it could be capable of,\" says Rall. \"We know some quantum algorithms that are faster than the best-known classical algorithms. But what are the limits? Nobody knows.\"", "external_links": [], "published": "2015-10-14T13:40:00.000+03:00", "crawled": "2015-10-14T13:39:14.863+03:00", "highlightTitle": ""}