{"organizations": ["Associated Press"], "uuid": "dc6c1fa38707fc21e7a8358b2b6c8647a808fcbf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "mynorthwest.com", "main_image": "http://mynorthwest.com/emedia/seattle/13/1379/137935.jpg", "site_section": "http://www.mynorthwest.com/xml/23.xml", "section_title": "MyNorthwest.com - Technology", "url": "http://mynorthwest.com/23/2825626/Angus-Deaton-wins-Nobel-economics-prize-for-work-on-poverty", "country": "US", "title": "Angus Deaton wins Nobel economics prize for work on poverty", "performance_score": 0, "site": "mynorthwest.com", "participants_count": 0, "title_full": "Angus Deaton wins Nobel economics prize for work on poverty", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:56:00.000+03:00", "replies_count": 0, "uuid": "dc6c1fa38707fc21e7a8358b2b6c8647a808fcbf"}, "author": "", "url": "http://mynorthwest.com/23/2825626/Angus-Deaton-wins-Nobel-economics-prize-for-work-on-poverty", "ord_in_thread": 0, "title": "Angus Deaton wins Nobel economics prize for work on poverty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Angus Deaton"], "text": "Angus Deaton wins Nobel economics prize for work on poverty By Associated Press | October 12, 2015 @ 6:56 am Share \nSTOCKHOLM (AP) -- Princeton University's Angus Deaton won the Nobel prize in economics Monday for his wide ranging work on consumption that's helped redefine the way poverty is measured around the world, notably in India. \nDeaton, 69, won the 8 million Swedish kronor (about $975,000) prize from the Royal Swedish Academy of Sciences for work that the award committee says has had \"immense importance for human welfare, not least in poor countries.\" \nThe secretary of the award committee Torsten Persson said Deaton's research has \"really shown other researchers and international organizations like the World Bank how to go about understanding poverty at the very basic level so that's perhaps the finest and most important contribution he has made.\" \nPersson singled out Deaton's work in showing how individual behavior affects the wider economy and that \"we cannot understand the whole without understanding what is happening in the miniature economy of our daily choices.\" \nDeaton, who was born in Edinburgh, Scotland and holds U.S. and British dual citizenship, said he was delighted to have won the prize and was pleased that the committee decided to award work that concerns the poor people of the world. \nIn a press conference following the announcement, Deaton said he expects extreme poverty in the world to continue decreasing but that he isn't \"blindly optimistic.\" \nHe said there are \"tremendous health problems among adults and children in India, where there has been a lot of progress.\" He noted that half of the children in the country are \"still malnourished\" and \"for many people in the world, things are very bad indeed.\" \nThe prize committee said Deaton's work revolves around three central questions: How do consumers distribute their spending among different goods; how much of society's income is spent and how much is saved; and how do we best measure and analyze welfare and poverty? \nCommittee member Jakob Svensson said Deaton introduced the \"Almost Ideal Demand System,\" which has become a standard tool used by governments to study what effect a change in economic policy -- such as an increase in sales taxes on food -- will have on different social groups and how large the subsequent gains or losses will be. \nThe Royal Swedish Academy of Sciences also highlighted the model that has become known as the Deaton Paradox, in which he laid bare a contradiction between earlier theory and data on consumer behavior. \nIngvild Almas, associate professor at the Norwegian School of Economics, said the Indian government has changed its methodology for measuring poverty thanks to research from the likes of Deaton and that has affected poverty-reduction policies. \n\"For instance, Deaton found that there were a lot more poor people in rural areas of India than previously thought,\" she said. \"In practice, that has affected India's subsidy system for the poor, which allows them to buy necessities. Households that were not defined as poor before can now be reached with these policies, and that is a direct result of Deaton's research.\" \nLast year, French economist Jean Tirole won the prestigious award for research on market power and regulation. \nThe economics award is not a Nobel Prize in the same sense as the others, which were created by Swedish industrialist Alfred Nobel in 1895. Sweden's central bank added the economics prize in 1968 as a memorial to Nobel. \nMonday's announcement concludes this year's presentations of Nobel winners. \nThe medicine prize went to three scientists from Japan, the U.S. and China who discovered drugs to fight malaria and other tropical diseases. Japanese and Canadian scientists won the physics prize for discovering that tiny particles called neutrinos have mass and scientists from Sweden, the U.S. and Turkey won the chemistry prize for their research into the way cells repair damaged DNA. \nBelarusian investigative journalist Svetlana Alexievich won the literature award while the peace prize went to The National Dialogue Quartet in Tunisia for its contribution to building democracy in Tunisia following the 2011 Jasmine Revolution. \nThe awards will be handed out on Dec. 10, the anniversary of prize founder Alfred Nobel's death in 1896, at lavish ceremonies in Stockholm and Oslo. \nCopyright © The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-10-12T17:56:00.000+03:00", "crawled": "2015-10-12T17:12:09.846+03:00", "highlightTitle": ""}