{"organizations": [], "uuid": "1f35d2817bb83c5cb413b134b93b41843b1d6280", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Hutchison-China-MediTech-Limited-Files-Registration-Statement-for-Potential-Nasdaq-Stock-Market-Listing-49020-1/", "country": "US", "title": "Hutchison China MediTech Limited Files Registration Statement for Potential Nasdaq Stock Market Listing", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Hutchison China MediTech Limited Files Registration Statement for Potential Nasdaq Stock Market Listing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:04:00.000+03:00", "replies_count": 0, "uuid": "1f35d2817bb83c5cb413b134b93b41843b1d6280"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Hutchison-China-MediTech-Limited-Files-Registration-Statement-for-Potential-Nasdaq-Stock-Market-Listing-49020-1/", "ord_in_thread": 0, "title": "Hutchison China MediTech Limited Files Registration Statement for Potential Nasdaq Stock Market Listing", "locations": ["Hutchison China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Date:10/16/2015 \nLONDON , October 16, 2015 /PRNewswire/ -- \nHutchison China MediTech Limited (\"Chi-Med\") (AIM: HCM) announces that it has publicly filed today a registration statement on Form F-1 (the \"Registration Statement\") with the United States Securities and Exchange Commission (the \"SEC\") in relation to a potential listing of American depositary shares (\"ADSs\") representing its ordinary shares on the Nasdaq Stock Market (the \"Offering\"). As of the date of this press release, Chi-Med has not yet set a definite timetable or decided on further details of the potential Offering, and there can be no assurance that the potential Offering will be completed. Accordingly, the number of ADSs which may be offered and the offering price of the potential Offering have not yet been determined. The directors of Chi-Med will assess various factors, including market conditions, in considering whether to formally launch the transaction. \nBank of America Merrill Lynch and Deutsche Bank Securities (in alphabetical order) are acting as joint global coordinators and joint bookrunners for the potential Offering. \nThe Registration Statement relating to the ADSs has been filed with the SEC but has not yet become effective. The ADSs may not be sold, nor may offers to buy be accepted, prior to the time the Registration Statement becomes effective. The Registration Statement and all subsequent amendments may be accessed through the SEC's website at http://www.sec.gov . \nThe Offering, if it does proceed, will be made only by means of a prospectus that will form part of the effective Registration Statement. Copies of the preliminary prospectus, when available, may be obtained from (in alphabetical order) (i) Bank of America Merrill Lynch, Attn: Prospectus Department, 222 Broadway, New York, NY 10038, or by email at dg.prospectus_requests@baml.com , or (ii) Deutsche Bank Securities Inc., Attn: Prospectus Group, 60 Wall Street, New York, NY 10005, or by email at prospectus.cpdg@db.com . \nThis press release does not constitute an offer to sell or the solicitation of an offer to buy ADSs or any other securities, nor shall there be any sale of ADSs in any state or jurisdiction in which such an offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. \nShareholders and potential investors should note that the potential Offering may or may not proceed, and accordingly are advised to exercise caution when dealing in the securities of Chi-Med. \nAbout Chi-Med \nChi-Med is a China -based globally-focused healthcare group which researches, develops, manufactures and sells pharmaceuticals and health-related consumer products. Its Innovation Platform focuses on discovering and developing innovative therapeutics in oncology and autoimmune diseases for the global market. Its Commercial Platform manufactures, markets, and distributes prescription drugs and consumer health products in China . \nForward-looking statements \nThis press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, that involve risks and uncertainties, including statements regarding the proposed Offering. Actual results may differ materially from those projected or implied. More information about potential factors that could affect Chi-Med's business and financial results is contained in the Registration Statement filed with the SEC. Any forward-looking statement made by Chi-Med herein, or elsewhere, speaks only as of the date on which such statement is made. Chi-Med does not intend, and undertakes no duty, to update any forward-looking statements after the date hereof to reflect future events or circumstances. \nEnquiries", "external_links": [], "published": "2015-10-16T17:04:00.000+03:00", "crawled": "2015-10-16T17:45:38.014+03:00", "highlightTitle": ""}