{"organizations": [], "uuid": "140ab3f40cc23792c6c83932be1cfbaac3b8b40a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141832/french-hospital-enhances-complex-kidney-cancer-surgery-planning-stratasys-color-multi-", "country": "US", "title": "French Hospital Enhances Complex Kidney Cancer Surgery Planning with Stratasys Color Multi-Material 3D Printing", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "French Hospital Enhances Complex Kidney Cancer Surgery Planning with Stratasys Color Multi-Material 3D Printing", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T11:00:00.000+03:00", "replies_count": 0, "uuid": "140ab3f40cc23792c6c83932be1cfbaac3b8b40a"}, "author": "admin", "url": "http://www.freshnews.com/news/1141832/french-hospital-enhances-complex-kidney-cancer-surgery-planning-stratasys-color-multi-", "ord_in_thread": 0, "title": "French Hospital Enhances Complex Kidney Cancer Surgery Planning with Stratasys Color Multi-Material 3D Printing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/19/2015 @ 1:00 AM   Stratasys Ltd. \nMINNEAPOLIS & REHOVOT, Israel -- (BUSINESS WIRE) -- Stratasys Ltd . (Nasdaq:SSYS), the 3D printing and additive manufacturing solutions company, today announced that its color, multi-material technology is being successfully deployed to aid cancer surgeons in treating patients. Physicians use the models during pre-surgery planning of complicated kidney tumor removal, helping to perform precise and successful kidney-sparing surgery and improving patient outcomes. The 3D printed models are also used to improve surgeon training, as well as enhancing the explanatory process towards patients. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20151019005020/en/ Using Stratasys' transparent VeroClear material enables Dr Bernhard to see inside the kidney and estimate the specific location and depth at which the tumor resides. (Photo: Stratasys) \nThe advanced surgical process, which utilizes transparent and color 3D printed models produced on Stratasys’ color, multi-material 3D Printer, the Objet500 Connex3 , is being pioneered by the Department of Urology and Kidney Transplantation at the University Hospital (CHU) de Bordeaux, in France. According to CHU surgeon Dr Jean-Christophe Bernhard, this is currently the only hospital in France – and one of the first in the world – to deploy Stratasys’ multi-color, multi-material 3D printing technology for complex kidney tumor removal cases. \n“Having a 3D printed model comprising the patient’s kidney tumor, main arteries and vessels – each in a different color – provides an accurate picture of what we will see during operations,” says Dr Bernhard. \n“Importantly, the ability to visualize the specific location of a tumor in relation to these other elements, all in three dimensions, greatly facilitates our task and is not something that is easily achievable from a 2D scan,” he adds. \nIncreasing the opportunity for kidney-sparing surgery According to Dr Bernhard, the clearer view offered by the 3D printed model may increase the ability to perform precise and successful kidney-sparing surgery. The pre-surgery planning aids in identifying and avoiding damage to the delicate nearby arteries and vessels which can result in complete kidney removal. Sparing the patient’s kidney is important because it reduces the chance of subsequently suffering from chronic kidney disease. \n“3D printing technology has effectively heralded a new dawn,” continues Dr Bernhard. “A scan gives us good information, but it’s in 2D. This relies on the surgeon to mentally reconstruct the tumor volume in 3D and estimate its location inside of the total volume of the kidney. The same process has to be done to clearly understand the relations between the tumor, the vessels (arteries and veins) and the collecting system. As you can imagine, this is difficult and time-consuming for the surgeon. \n“Conversely, having a 3D printed kidney model in your hands that corresponds specifically to that of the patient you’re going to operate on quite literally offers me a view from a new perspective. The only thing more accurate than that is the patient himself,” he adds. \nThe CHU de Bordeaux uses three Stratasys PolyJet materials: transparent VeroClear to show the volume mass of the kidney itself, red for the arteries and yellow for the excretory tract. The red and yellow is then mixed on-the-fly – unique to Stratasys multi-material capabilities – to produce the all-important orange color of the tumor. \n“The Stratasys transparent material is of fundamental importance as it allows us to see inside and estimate the depth at which the tumor resides,” explains Dr Bernhard. “It enables us to see the arteries and the cavities that collect urine, so we can see if any of the arteries are touching the tumor. We need to remove the tumor, but not at the expense of the other vital elements that together enable the kidney to do its job. Finding that balance is much easier to achieve thanks to 3D printing.” \nDr Bernhard also believes that use of 3D printed models will not be restricted to kidney surgery, and sees them being equally useful for any organ sparing surgeries. \nTraining the surgeons of tomorrow Stratasys 3D printing solutions also significantly strengthens the CHU’s capabilities from an instructional standpoint. For Dr Bernhard, this is a fundamental benefit of 3D printing and one that he sees making a big impact within the medical sector long-term. \n“I think this technology will be a big driver in terms of shaping the future of teaching and surgical training,” he says. “Having access to a 3D printed model that is completely accurate to the one that you’re going to operate, not only enables you to train yourself on the operation, but it also greatly improves our ability to more accurately convey surgical procedures to students – who of course are the surgeons of tomorrow.” \nReassurance by improved patient understanding Another major benefit for the CHU of Bordeaux and Dr Bernhard is the ability to use the 3D printed models to more easily explain procedures to patients prior to surgery, thereby offering increased reassurance. \n“Describing kidney tumor removal with 2D scan or a diagram will invariably leave most patients somewhat bewildered,” he explains. “Presenting them with a 3D printed model that clearly shows the tumor puts them at ease and enables the patient to grasp exactly what we’re going to do. Indeed, research from patient questionnaires shows that having 3D printed models increases their understanding of the surgery by more than 50%, so it’s a considerable benefit in terms of overall patient care.” (1) \nCommenting on the use of 3D printing technology at the hospital, Scott Rader, General Manager of Medical Solutions at Stratasys, says, “By putting exactly what the surgeon needs to see right in his hands, the pioneering use of Stratasys color multi-material 3D printing technology at the CHU de Bordeaux demonstrates its capability to improve medical operations by decreasing complexities to make the surgeon’s role easier. Moreover, by enhancing procedures in this way, the prospect of organ-conserving surgery is increased, resulting in a far more favorable outcome for patients.” (1) Bernhard JC, Isotani S, Matsugasumi T, et al. Personalized 3D printed model of kidney and tumor anatomy: a useful tool for patient education. World J Urol. 2015 Jul 11. \nFor more than 25 years, Stratasys Ltd. (NASDAQ:SSYS) has been a defining force and dominant player in 3D printing and additive manufacturing – shaping the way things are made. Headquartered in Minneapolis, Minnesota and Rehovot, Israel, the company empowers customers across a broad range of vertical markets by enabling new paradigms for design and manufacturing. The company’s solutions provide customers with unmatched design freedom and manufacturing flexibility – reducing time-to-market and lowering development costs, while improving designs and communications. Stratasys subsidiaries include MakerBot and Solidscape and the Stratasys ecosystem includes 3D printers producing prototypes and parts; a wide range of 3D printing materials; parts on-demand via Stratasys Direct Manufacturing; strategic consulting and professional services; and Thingiverse/GrabCAD communities with 5+ million free design components, printable files. With 3,000 employees and 800 granted or pending additive manufacturing patents, Stratasys has received more than 30 technology and leadership awards. Visit us online at: www.stratasys.com or http://blog.stratasys.com \nStratasys and Objet are registered trademarks and PolyJet, Connex, Objet500 and VeroClear are trademarks of Stratasys Ltd. and/or its subsidiaries or affiliates. \nAttention Editors, if you publish reader-contact information, please use: USA +1-877-489-9449", "external_links": [], "published": "2015-10-19T11:00:00.000+03:00", "crawled": "2015-10-19T12:06:02.336+03:00", "highlightTitle": ""}