{"organizations": ["California HealthCare Foundation and Kaiser Family Foundation Join Forces to Produce California Healthline California HealthCare Foundation and Kaiser Family Foundation Join Forces to Produce California Healthline"], "uuid": "d342bd3af708504418ea45ffd6f143ca0102db47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/09/8259004.htm", "country": "US", "title": "California HealthCare Foundation and Kaiser Family Foundation Join Forces to Produce California Healthline", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "California HealthCare Foundation and Kaiser Family Foundation Join Forces to Produce California Healthline", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T16:32:00.000+03:00", "replies_count": 0, "uuid": "d342bd3af708504418ea45ffd6f143ca0102db47"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/09/8259004.htm", "ord_in_thread": 0, "title": "California HealthCare Foundation and Kaiser Family Foundation Join Forces to Produce California Healthline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "California HealthCare Foundation and Kaiser Family Foundation Join Forces to Produce California Healthline [October 09, 2015] Tweet \nThe California HealthCare Foundation and the Henry J. Kaiser Family Foundation have agreed to establish a new partnership that will take over daily publication of California Healthline (CHL) beginning in late January 2016. CHL is the California HealthCare Foundation's free, daily digest of health care policy news and opinion for our nation's largest state. CHL will be produced by the Kaiser Family Foundation's editorially independent nonprofit news service, Kaiser Health News (KHN), which will be responsible for the publication's editorial content. KHN is the nation's leading source for in-depth news on health care policy and politics. With support from the California HealthCare Foundation, Kaiser Health News will expand CHL's editorial staff and hire additional journalists based in California. The goal is to provide useful and informative coverage of the state's health care system. \nThis partnership continues the California HealthCare Foundation's longstanding support of health care journalism and its commitment to providing timely, relevant information to policymakers in California's health policy community. This new partnership ensures that CHL will continue to serve its core audiences in government, industry, academia, and the media by distributing digests and original content through CHL and on californiahealthline.org . The partnership enables CHL to expand its readership and statewide footprint by producing more original reporting and disseminating content through KHN's California andnational media partners and through social media. All original CHL content will be created and edited by Kaiser Health News and made freely available for republishing. Many syndication options will be available for media outlets. \n\"This partnership begins an exciting new era for California Healthline,\" said Sandra R. Hernández, president and CEO of the California HealthCare Foundation. \"Over the past 16 years, CHL has developed a loyal following within California, helping public and private sector health policy leaders stay informed with timely, accurate information about the constantly changing health care landscape. We are confident our readers will be well served by the Kaiser Health News team's unwavering commitment to the highest journalistic standards and its impressive distribution channels.\" \n\"This is a great opportunity to add a larger California dimension to KHN and form an exciting new partnership with the California HealthCare Foundation, which shares our commitment to providing the best possible health policy information to the public,\" said Kaiser Family Foundation President and CEO Drew Altman. \nBased in the Kaiser Family Foundation's office in Washington, D.C., Kaiser Health News has expanded its reporting capacity beyond the Capital Beltway through partnerships with National Public Radio and its member stations, regional and national news organizations, the PBS NewsHour, CNN, and several California health care foundations. The CHL partnership will expand Kaiser Health News's West Coast reporting capacity and highlight California's outsized influence on the nation's health care system. The project will help the California HealthCare Foundation and Kaiser Family Foundation achieve their goals of producing and disseminating information to help policymakers, health industry leaders, and the public to understand and improve the health care system. Stay tuned for announcements regarding this new initiative early next year. \nThis partnership agreement does not include iHealthBeat, CHL's sister newsletter on health information technology. The California HealthCare Foundation is investigating arrangements to enable iHealthBeat's continued publication. \nFor more on the partners, visit the California HealthCare Foundation at www.chcf.org , Kaiser Family Foundation at www.kff.org , and Kaiser Health News at www.khn.org . View source version on businesswire.com: http://www.businesswire.com/news/home/20151009005130/en/", "external_links": [], "published": "2015-10-09T16:32:00.000+03:00", "crawled": "2015-10-09T23:19:01.392+03:00", "highlightTitle": ""}