{"organizations": [], "uuid": "79da94b62202c7928fbec7abc98762d0858816aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theatlantic.com", "main_image": "http://cdn.theatlantic.com/assets/media/img/mt/2015/10/19157088441_4fe185ce01_o_1/facebook.jpg?1444321706", "site_section": "http://www.theatlantic.com/writers/", "section_title": "The Atlantic — News and analysis on politics, business, culture, technology, national, international, and life – TheAtlantic.com", "url": "http://www.theatlantic.com/politics/archive/2015/10/americans-pessimism-future/409564/", "country": "US", "title": "Why Americans Are Becoming More Pessimistic", "performance_score": 1, "site": "theatlantic.com", "participants_count": 3, "title_full": "Why Americans Are Becoming More Pessimistic - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:30:00.000+03:00", "replies_count": 2, "uuid": "db427cde3dd6df048db566beb4328bb14b033f7d"}, "author": "Ronald Brownstein", "url": "http://www.theatlantic.com/politics/archive/2015/10/americans-pessimism-future/409564/#post-0", "ord_in_thread": 0, "title": "Why Americans Are Becoming More Pessimistic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When Americans look to the future, two mega-trends evoke the most optimism about the nation’s long-term trajectory, the latest Allstate/ National Journal Heartland Monitor Poll has found.\nMore From What Would Americans Do With An Extra Couple Hundred Bucks? Black Workers Really Do Need to Be Twice as Good What Makes D.C.’s Universal Leave Plan So Special? One of these trends, the onset of the digital revolution, evokes optimism in every major segment of society. But the second one, the nation’s growing racial and ethnic diversity, divides Americans along lines of race, generation, and, above all, partisanship, thereby illuminating some of the fault lines in modern American life.\nThe new poll asked respondents to consider whether six of the social and economic dynamics that are crucial to the nation’s future make them “more optimistic or more pessimistic about the direction the country is headed.” Only two of the six trends made a majority of respondents feel more optimistic. A resounding 78 percent said “continuing advances in computer and communications technology” made them feel better about the nation’s future; only 17 percent said they felt worse. As for “America’s increasing racial and ethnic diversity,” a less emphatic but still solid 57 percent said it made them cheerier about the country’s future, while 32 percent said it heightened their pessimism.", "external_links": [], "published": "2015-10-10T16:30:00.000+03:00", "crawled": "2015-10-10T15:44:20.010+03:00", "highlightTitle": ""}