{"organizations": [], "uuid": "8e9e83c48945fe8ad588e0ceca44803440acbd31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/e273636279ab429fed8a29f046d991b1960deb03/0_0_3952_2371/master/3952.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=caac45c0ab86e283489d511d9bbf3643", "site_section": "http://www.theguardian.com/technology/all", "section_title": "Technology | The Guardian", "url": "http://www.theguardian.com/global-development-professionals-network/2015/oct/13/energy-access-innovation-renewable", "country": "GB", "title": "Nine ideas to spark innovation in the energy sector | Global Development Professionals Network", "performance_score": 1, "site": "theguardian.com", "participants_count": 2, "title_full": "Nine ideas to spark innovation in the energy sector | Global Development Professionals Network | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T23:18:00.000+03:00", "replies_count": 1, "uuid": "8e9e83c48945fe8ad588e0ceca44803440acbd31"}, "author": "Anna Leach", "url": "http://www.theguardian.com/global-development-professionals-network/2015/oct/13/energy-access-innovation-renewable", "ord_in_thread": 0, "title": "Nine ideas to spark innovation in the energy sector | Global Development Professionals Network", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1. Invest public money in research and development At a very macro-level, the public sector spends way too little on R&D. We made great strides with public investment in R&D on energy in the ‘60s, but have tapered off, and this is not unique to the US. Yet this is where we need bigger breakthroughs. Ilmi Granoff, head of green growth, the Overseas Development Institute , London, UK, @theilmatic\n— Bibi van der Zee (@bibivanderzee) October 8, 2015 Public investment in energy R&D is @ $10-20bn but energy sector is @ 10% of $50tn global economy. http://t.co/gfZ8xzlVlr #globaldevlive\n2. Support grassroots innovators A lot of research in traditional environments is wasteful. Most practical innovations take place in garages, dorm rooms and co-working spaces. These agents of crowd-sourced innovation deserve more support both from the public and private sectors. I’m a strong proponent (naturally) of the incubator model. It is lean, it allows innovators to fail forward - succeed in the face of failure. It scales quicker, and not mired in laboratory politics of academia. It’s an incredible model that can be entirely private-sector driven (with pockets of angel investors) instead of waiting for the government. Michael O. Oluwagbemi, co-founder/director, Wennovation Hub , Lagos, Nigeria, @busanga\n3. Trust in humanity to adapt In this discussion it is important to have a positive view on the future of humanity. Resources are not infinite but our ability to adapt and find out solutions to big problems is demonstrated in history. The true energy is just this attitude. Marco Giani, head of project portfolio and new business models, innovation and sustainability department, Enel , Rome, Italy, @EnelGroup\nTo make energy tangible we need to involve different disciplines... to write stories, empower people or design games\n4. Get out of the nerd corner\nA way forward is to get people excited about our energy future, to get this topic out of the nerd corner and craft conversations that are compelling to everyone. The challenge here is the fact that for a long time this topic was left for engineers and politicians to solve. But to make energy tangible, we need to involve different disciplines. We need people that are good at writing stories, empowering people or at designing games. There are a few great success stories out there such as green utopias written by the growing “ solarpunk ” community, or an acclaimed little app called The Path to Luma asking players to think about the wheres and whys of energy consumption. Klara Lindner, customer experience lead, Mobisol GmbH , Berlin, Germany, @klaralindner\n5. Remove subsidies on fossil fuels One of the most important things we can do to promote innovation and investment in sustainable energy is the removal of subsidies on fossil fuels which the OECD has recently estimated have reached around $200bn per annum globally . Removal of subsidies on fossil fuels would provide a huge incentive to promote new innovation in the energy sector. John O’Brien, regional technical adviser on climate change, UNDP , Istanbul, Turkey, @johnobrien98\nRelated: Eight ways to reach 100% renewable in developing countries\n6. Challenge traditional thinking about utility companies The biggest innovation that needs to take place right now in the energy sector is how public utilities are structured. That’s a public policy innovation that has to respond to a very different set of physical technologies that are now available. Ilmi Granoff\n7. Prizes help to incentivise, but not to scale Prizes are important in screening potential innovations for subsequent investors. Once an innovation wins a prize, or gets to a final round, they are much more likely to gain investors to take the company to the next stage. There is a vetting benefit but also a networking one.\nThe old-fashioned version of innovation prizes, such as that for a device that could calculate longitude in the 1700s, had a much more ambitious goal. Once the prize was won, the innovator got their reward and the innovation was in the public domain. We don’t do that with prizes now. Instead they get patented and become 20-year monopolies. Good for incentive to invent but bad for widespread adoption. Gregory Nemet, professor of public affairs and environmental studies, Nelson Institute for Environmental Studies, University of Wisconsin, Madison, USA\nRelated: Race to renewable: five developing countries ditching fossil fuels\n8. Learn from cookstove innovation One could learn a lot from looking at the evolution of clean cookstove programmes. Much of the original efforts were on design for efficiency, and then cost. But what really worked was taking into account users (how and what people cook), so they could be modified for local conditions. A big challenge then is how to get the benefits of scale while customising for local conditions. Lots of failures in that example, but also some lessons. Gregory Nemet\n9. Take risks The challenge to encouraging innovation is how risk averse our approach to development challenges is. Innovation requires both an expectation of frequent failure (trial and error) and a longer view. When we want every development dollar to count for an immediate impact, it becomes very constraining on our ability to re-think our approach to problems. That risk aversion makes it hard to finance the big-risk/big-reward nature of innovation. Ilmi Granoff\nRead the full Q&A here .\nIs there anything that we’ve left out? Leave your thoughts in the comments below.\nJoin our community of development professionals and humanitarians. Follow @GuardianGDP on Twitter. Join the conversation with the hashtag #EnergyAccess .", "external_links": ["https://twitter.com/theilmatic", "https://twitter.com/bibivanderzee/status/652100114690015233", "https://twitter.com/hashtag/globaldevlive?src=hash", "https://play.google.com/store/apps/details?id=com.NRG.PathToLuma&hl=en_GB", "http://www.oecd.org/environment/support-to-fossil-fuels-remains-high-and-the-time-is-ripe-for-change.htm", "http://www.odi.org/", "http://www.undp.org/", "http://www.plugintheworld.com/mobisol/", "http://t.co/gfZ8xzlVlr", "http://www.wennovationhub.org/", "https://twitter.com/EnelGroup", "https://twitter.com/johnobrien98", "https://www.enel.com/en-gb", "https://twitter.com/bibivanderzee/statuses/652100114690015233", "http://www.abc.net.au/environment/articles/2014/11/10/4122309.htm", "https://twitter.com/search?src=typd&q=%23EnergyAccess", "https://twitter.com/busanga", "https://twitter.com/klaralindner", "https://twitter.com/GuardianGDP"], "published": "2015-10-13T23:18:00.000+03:00", "crawled": "2015-10-13T21:46:59.814+03:00", "highlightTitle": ""}