{"organizations": [], "uuid": "6d31e200da99733bc42e64e37725b91862985126", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://www.sfgate.com/img/pages/article/opengraph_default.png", "site_section": "http://sfgate.com//rss/feed/Business-and-Technology-News-448.php", "section_title": "Business and Technology News", "url": "http://www.sfgate.com/business/article/Airline-service-workers-entitled-to-breaks-6574719.php", "country": "US", "title": "Airline service workers entitled to breaks, appeals court rules", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Airline service workers entitled to breaks, appeals court rules - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:19:00.000+03:00", "replies_count": 0, "uuid": "6d31e200da99733bc42e64e37725b91862985126"}, "author": "sfgate.com", "url": "http://www.sfgate.com/business/article/Airline-service-workers-entitled-to-breaks-6574719.php", "ord_in_thread": 0, "title": "Airline service workers entitled to breaks, appeals court rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The federal Airline Deregulation Act doesn’t exempt companies that provide services to airlines — like security for in-flight food catering — from California’s labor laws, a state appeals court ruled Friday.\nThe Second District Court of Appeal in Los Angeles reinstated a former employee’s proposed class-action suit against SCIS Air Security Corp., which does security checks on catering equipment for incoming and outgoing planes. Employees search the food for weapons, seal food carts before flights, and conduct their inspections whenever planes arrive or are about to leave, causing some fluctuations in schedules because of flight delays.\nAmanda Valencia, a security coordinator for SCIS in Los Angeles from 2007 to 2009, said in her suit that the company violated state laws that entitle workers to 30-minute meal breaks after five hours of work, and to 10-minute rest breaks every four hours. She said the company requires employees to stay in their work areas and be on call at all times, including breaks. She also accused SCIS of failing to pay minimum wages or overtime and of requiring her to work off the clock both before and after her scheduled shifts.\nSCIS denied violating state laws but argued that it was exempted from the meal and rest-break requirements by the Airline Deregulation Act, a 1978 federal law that prohibits states from enforcing their own laws that are “related to a price, route or service of an air carrier.” A Superior Court judge agreed and dismissed the suit but was overruled by the appeals court, which said recent state and federal court rulings have shown that states can still enforce labor laws against transportation companies.\nFor example, the state Supreme Court ruled last year that truck drivers could sue a company that had reclassified them as independent contractors instead of employees, reducing their benefits under state law. The court rejected the company’s argument that state laws drive up their costs and thus affect both their prices and their services, which are also protected from state regulation under federal law. The Ninth U.S. Circuit Court of Appeals in San Francisco reached the same conclusion in another case last year that allowed truck drivers to sue a company over meal and rest breaks.\nCalifornia’s labor laws “apply to all industries, not just airlines,” Justice Jeffrey Johnson said in Friday’s 3-0 ruling. \n“Whether SCIS provides meal and rest breaks to its employees is independent of the price, route or service that airlines provide to (their) customers,” Johnson said. He said there was no evidence that Congress had passed the 1978 deregulation law “to allow companies to avoid state meal and break laws.”\nValencia’s lawyer, Louis Benowitz , said the ruling “protects the rights of workers in California to basic wage and hour protection.”\nA representative of SCIS was not immediately available for comment. The company could appeal the ruling to the state Supreme Court.\nBob Egelko is a San Francisco Chronicle staff writer. E-mail: begelko@sfchronicle.com Twitter: @egelko", "external_links": [], "published": "2015-10-16T17:19:00.000+03:00", "crawled": "2015-10-17T10:01:55.784+03:00", "highlightTitle": ""}