{"organizations": [], "uuid": "da6953cf24fe9fa9b6327842a8c9bedfcb753b3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "", "site_section": "http://feeds.feedburner.com/TechnologyOrgLifeSciencesTechnologiesNews", "section_title": "Technology Org » Life sciences & technologies news", "url": "http://www.technology.org/2015/10/09/living-red-zone-good-football-not-good-terms-radon/", "country": "", "title": "Living in the red zone: good for football, not good in terms of radon", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Living in the red zone: good for football, not good in terms of radon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T13:20:00.000+03:00", "replies_count": 0, "uuid": "da6953cf24fe9fa9b6327842a8c9bedfcb753b3f"}, "author": "Raminta Šulskutė", "url": "http://www.technology.org/2015/10/09/living-red-zone-good-football-not-good-terms-radon/", "ord_in_thread": 0, "title": "Living in the red zone: good for football, not good in terms of radon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Living in the red zone: good for football, not good in terms of radon Posted Today \nMore than 80 percent of homes in a rural northwest Iowa community tested positive for radon levels significantly higher than the cap recommended by the Environmental Protection Agency, results doctors and University of Iowa researchers say are indicative of what the entire state is facing. \nIowa has the highest average indoor concentrations of radon in the United States. Radon is an odorless, colorless radioactive gas created by natural uranium in the earth and is the second-leading cause of lung cancer in the U.S. \nThe Environmental Protection Agency has recommended that homes with levels higher than 4 picoCuries per liter (pCi/L) of radon have mitigation systems installed to reduce levels. \n“Iowa is entirely a red zone, which means the predicted average indoor radon level in Iowa is above that 4 picoCuries per liter (pCi/L) (recommended by the EPA),” says Barcey T. Levy, M.D., Ph.D., professor of family medicine and epidemiology and director of the Iowa Research Network in the University of Iowa Carver College of Medicine. “There are places in the country that have some red, but we are all red, with very high predicted levels, and it’s a known carcinogen.” \nIn a study published in September in the Journal of the American Board of Family Medicine , Levy and co-author Cynthia Wolff, M.D., of the Akron/Mercy Family Medical Clinic in Akron, Iowa, report finding more than 80 percent of homes tested for radon in the Akron area showed levels higher than the EPA recommendations. Some homes had levels 10 to 20 times the recommended levels, and one test showed a home to have 120 pCi/L—30 times the highest level recommended by the EPA. \nThe homes were tested in 2013 after Wolff attended a seminar on radon presented by the Iowa Cancer Consortium. \n“I was shocked; I’ve been a physician here for 20 years and I didn’t know the radon risks in Iowa,” Wolff says. “This is kind of a silent killer that people just didn’t know about. We had young people in our community die of lung cancer and they didn’t smoke, and we didn’t know why.” \nWolff talked with Levy at the meeting, and the two decided to collaborate on the study. Using a $5,000 grant from the Iowa Cancer Consortium and the Iowa Department of Public Health to purchase radon test kits, Wolff and her colleagues passed out the kits purchased using grant funds and conducted a number of community education programs in the Akron area. In addition, those taking the kits were given a numbered questionnaire asking anonymous demographic information, such as age and style of the home, total household income, and how many years the residents had been in the home. Kits were numbered to correspond with the questionnaires. \nLevy, who is also the Iowa Academy of Family Physicians Endowed Chair of Rural Medicine, and her colleagues at the University of Iowa analyzed the data from the kits. \nIn 746 of the kits handed out, Levy and her team identified 378 valid results, 351 of which had corresponding questionnaires turned in. Readings of 4 pCi/L or higher of radon were found in 81 percent of those homes, with the average radon reading at 10 pCi/L. \n“What really kind of surprised us was that we found the age of the home didn’t really matter,” Wolff says. “These results didn’t correlate to how old the house was, how good of shape it was in, or where the house was located. What correlated was that we lived in northwest Iowa, or in Iowa in general.” \nWolff said she tested her own home, which she and her husband built in 2000, and found it to have a radon reading of 38 pCi/L. \nWith so many homes testing so high for radon, many banks in the Akron area began offering low-interest loans for mitigation systems. \n“People were really afraid to look at this, to look at how they were going to be able to afford the mitigation,” Wolff said. “But the fact is, people are dying. We have to get these homes mitigated. Once people started to understand the risks involved and how big of a problem this is, they were willing to find ways to pay for the mitigation.” \nLevy says she hopes this study will inspire new laws in Iowa requiring radon testing for new construction and for the sales of homes and properties. \n“So many people in the general public don’t know about radon unless they know someone who has died of lung cancer who hasn’t smoked,” she says. “In our study we were only testing homes in northwest Iowa because that was the scope of the work. I don’t think we’d get any different results anywhere in Iowa.”", "external_links": [], "published": "2015-10-09T13:20:00.000+03:00", "crawled": "2015-10-09T13:33:27.641+03:00", "highlightTitle": ""}