{"organizations": ["ARUP", "Regional Medical Center", "ARUP Laboratories", "Common Stock and Warrants", "Walgreens", "U.S. Southwest", "American Dental Association", "University of ...", "Medical Center", "ContraVir Pharmaceuticals, Inc", "FDA Warns Users About Faulty Components", "Monarch Landing", "Portland State Researchers Discover Possible One-Pill Cure For Malaria", "Amazon", "PA"], "uuid": "c98d750beee98518e779392ffdfa68ce92f6866f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-medical-technology", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/ContraVir-Pharmaceuticals--Inc--Announces-Proposed-Public-Offering-of-Common-Stock-and-Warrants-to-Purchase-Common-Stock-48663-1/", "country": "US", "title": "ContraVir Pharmaceuticals, Inc. Announces Proposed Public Offering of Common Stock and Warrants to Purchase Common Stock", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "ContraVir Pharmaceuticals, Inc. Announces Proposed Public Offering of Common Stock and Warrants to Purchase Common Stock", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T11:18:00.000+03:00", "replies_count": 0, "uuid": "c98d750beee98518e779392ffdfa68ce92f6866f"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/ContraVir-Pharmaceuticals--Inc--Announces-Proposed-Public-Offering-of-Common-Stock-and-Warrants-to-Purchase-Common-Stock-48663-1/", "ord_in_thread": 0, "title": "ContraVir Pharmaceuticals, Inc. Announces Proposed Public Offering of Common Stock and Warrants to Purchase Common Stock", "locations": ["United States", "Ariz.", "N.M.", "Colo.", "Jr.", "Portland", "China", "Plano"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dennis Gable", "Rich", "Henry Raroque", "Castellano"], "text": "* Comment: * Email: (Date:  Despite slackened ... remains a source of tremendous demand for ... that includes non invasive prenatal tests. The healthcare ... recently been approved by government regulators and ... offers comprehensive subject reports that variously treat ...   -- FamilyWize, a community service partnership focused on improving the ... announced it is working with Walgreens to help distribute ... those who cannot afford the vaccine at events throughout ... the list of event dates and locations. The vouchers ... first come, first served basis at each event, and ... [ 0 ] Kalorama: Noninvasive Prenatal Sequencing Succeeds in China   FamilyWize Collaborates with Walgreens to Help Distribute Thousands of Free Flu Shot Vouchers Across the Country ... 27 Due to rising patient responsibility for ... state laws requiring disclosure of information on hospital charges, ... estimates for healthcare services. Competitive hospitals also realize they ... accountability to key stakeholders, protect against compliance risks, focus ... ... , , ... 280,000 external defibrillators used worldwide in health care facilities, public places, or in the home ... Drug Administration warned today. , , , ... , , , ... Craneware Shares Patient Estimation Revenue Integrity Insights FDA Warns Users About Faulty Components in 14 External Defibrillator Models (Date:10/6/2015)... OR   (Portland, ... cure for malaria that could be administered orally in a single pill. , The ... The researchers’ results, recently published in the Journal of Medicinal Chemistry, show that the   ... \"When I was on crutches, I was unable to walk to the living room with ... \"I live alone, so I had nobody around to help me. This inspired me to ... He created a prototype for the BUTLER to enable an individual on crutches to transport     He suits ... shift. He loves his work, which he takes very seriously. And he’s ... is a three-year old German shepherd, chocolate lab and golden retriever mix, who works     Dr. Castellano’s book “ We Guarantee We ... the top 100 of Amazon’s main list and on the top 10 in its non-fiction ... the main list on Friday and #2 on the non-fiction list. , During the week   PA   Are ... patent-pending IR FOOT MASSAGE. , The IR FOOT MASSAGE provides a massaging and therapeutic ... swelling. As a result, it enhances comfort. The invention features an effective design that ... [ 0 ] Portland State Researchers Discover Possible One-Pill Cure For Malaria [ 0 ] Inventor and InventHelp Client Develops Meal Transporter for Crutches Users (KSC-1008) [ 0 ] Man’s (And Woman’s) Best Friend at Monarch Landing [ 0 ] Dr. Rich “The Smile Dr.” Castellano lands on the Wall Street Journal Best-Seller List [ 0 ] Modified Foot Massager Invented by InventHelp Client (IPL-209) ... Corners region of the United States (where Ariz., N.M., Colo. ... outbreak this year than in 2005//, say scientists at Johns ... ,They also warn that parts of southern Colo. and ... Corners region--are at increased risk in 2006. ,The ... ... body's arteries, veins and capillaries become diseased, patients can ... of stroke and heart attack.// Dennis Gable, M.D., a ... Medical Center at Plano, provides information about three of ... ,Varicose veins are large, twisted, swollen blood vessels ... ... trouble falling or staying asleep, you're not alone. The ... 10 Americans say they frequently// have problems getting a ... concern, says Henry Raroque, Jr., M.D., a board-certified neurologist ... Regional Medical Center at Grapevine. ,A long-term ... ... Medicine has isolated a new source of adult stem cells, ... If the cells show no allergic reactions in human ... it is possible to meet the needs of an individual ... disease, Parkinson's disease, and spinal cord injury. ,\"We ... ... up call to get the duvets washed and clean. Research has ... in six months, and these could// be the most happening places ... survey conducted in many households revealed that two in five Britons ... dust mites and filth are potential health hazards that can trigger ... ... to the American Dental Association, has cautioned that the wearing ... smile but they// could also be very damaging to the ... like the 'grills' or 'fronts' that fit over the teeth ... younger so called 'hip-hop' generations. These dental fixtures are often ... Increased Risk of Hantavirus Forecast for U.S. Southwest Vascular Disease 101: Discovering and Treating Common Diseases of the Veins Medical Sleep Studies Can Help Correct Common Sleep Disorders Varied Applications of Adult Stem Cells to Treat Host of Disorders in Human Sleep in' dirty – Unwashed duvets become a hotbed for mite Dental Grills harmful For Users ... is a national reference laboratory and a ... development. ARUP offers an extensive test menu ... in clinical and anatomic pathology. Owned by ... include more than half of the nation's ... ... reference laboratory and a worldwide leader in ... an extensive test menu of highly complex ... anatomic pathology. Owned by the University of ... half of the nation's university teaching hospitals ... ... is a national reference laboratory and a ... development. ARUP offers an extensive test menu ... in clinical and anatomic pathology. Owned by ... include more than half of the nation's ... ... ARUP Laboratories is a national reference ... laboratory research and development. ARUP offers an ... unique medical tests in clinical and anatomic ... ARUP Laboratories' clients include more than half ...", "external_links": [], "published": "2015-10-06T11:18:00.000+03:00", "crawled": "2015-10-06T23:52:53.957+03:00", "highlightTitle": ""}