{"organizations": ["Eskom"], "uuid": "c46d90ea3fe726d906a676967f98ad1d6bf47f46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za/polopoly_fs/copy-of-ct-sola2-done-1.1606081!/image/2380757437.jpg_gen/derivatives/box_600/2380757437.jpg", "site_section": "http://www.iol.co.za/cmlink/science-technology-business-rss-1.847516", "section_title": "Science Technology Business RSS", "url": "http://www.iol.co.za/eskom-must-adapt-or-die-1.1927541", "country": "US", "title": "Eskom must adapt or die", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "Eskom must adapt or die", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T09:00:00.000+03:00", "replies_count": 0, "uuid": "c46d90ea3fe726d906a676967f98ad1d6bf47f46"}, "author": "", "url": "http://www.iol.co.za/eskom-must-adapt-or-die-1.1927541", "ord_in_thread": 0, "title": "Eskom must adapt or die", "locations": ["Kalkbult"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Craig Dodds"], "text": "Eskom must adapt or die October 11 2015 at 08:00am By Craig Dodds Comment on this story SUPPLIED SUN POWER: Kalkbult solar PV power station in the Northern Cape will feed electricity into Eskom's grid. Picture: SCARTEC SOLAR \nWhen South Africa experienced its first episode of load shedding for several months in June, Eskom offered an unusual explanation as part of the reason: cloud cover over the Northern Cape had cut 300MW of generating capacity from solar installations there. \nOn the one hand, this tells us something about the extent to which the growing share of renewables in the national energy mix saves our bacon whenever the sun shines and the wind blows. \nA CSIR study has shown, for example, that renewables delivered a net benefit to the economy of R4bn in the first half of this year, when the cost of that renewable energy was weighed against the sum Eskom would have spent on coal and diesel to deliver the same number of terawatt-hours (TWh) and the costs associated with load shedding avoided thanks to renewables. \nOn the other hand, the incident announced for the first time how reliant we already are on renewables - a reliance that is set to grow exponentially in future. \nOf the 17 800MW allocated to renewables in the current 20-year energy blueprint – a figure Energy Minister Tina Joemat-Pettersson has indicated she is open to expanding – only 1 900MW has been connected to the grid to date. \nBut if load shedding thanks to cloud cover seems like a precursor of worse to come as renewables take a greater share of total capacity, the opposite is true, according to Independent Power Producers Procurement Office head Karen Breytenbach. \nThe problem, for now, is not too much renewable energy in the mix, but too little. \nAs more solar and wind plants – with other renewables like biomass, geothermal and hydro – are built over a wider area of the country, the impact of capacity lost in one area will be greatly reduced by the combined capacity in other areas. \nThis highlights a critical advantage of an interconnected grid, like this country’s, over mass installation of dispersed renewable energy options like rooftop solar photovoltaics not connected to the grid: if the sun is shining in Cape Town, but not in Durban, the excess energy from a homeowner’s rooftop panels in one city, if connected to the grid, could supply the deficit of another homeowner on the opposite coast. \nThat South Africa stretches over such a wide area laterally gives it the added advantage of sunshine for more hours in a day, according to Dr Tobias Bischof-Niemz, chief engineer: R&D Core (energy) at the CSIR. \nBeing connected to a grid, even on a local scale, helped reduce the costs of investing in renewables. \nAn individual homeowner wanting to go “off-grid” would have to buy an oversized solar PV module - to ensure sufficient output even on cloudy days – and an equally oversized battery system to store the excess. \nSuch a system costs about R100 000 today. \nBut if two neighbours invested together and connected their houses they would each spend less because they could balance each other’s shortfall. \nTaken to the national level, the cost would be even lower as economies of scale – and the wider geographic spread of resources linked to the grid - came into play. \n“To be interconnected has huge value,” said Bischof-Niemz at a session on storage options for renewable energy at the SA International Renewable Energy Conference in Cape Town this week. \n“I understand that, especially in South Africa, because of developments in the last year (load shedding), we don’t like that because it relates to the utility, but it is a very good thing and it will help us all arrive at a least-cost renewable energy power system.” \nWhile it might be tempting for individual homeowners who could afford it to go “off grid” by investing in solar and battery systems, it was the “worst thing that could happen” from the national point of view as it would increase the cost to the country of switching to renewables and retard the process. \nIf the disruptive potential of renewables can be managed through the grid, with the help of storage technology like pumped hydro, thermal storage and batteries, it is proving to be disruptive in another sense, rapidly shifting the ground under the feet of large power utilities all over the world. \nEon, Germany’s biggest utility by market capitalisation, posted a record annual loss of €3.2bn in the past financial year as that country’s renewable energy transition - known as the Energiewende – ate into its revenue. \nIt now plans to sell off its fossil fuel and nuclear generation plants and embrace the renewable future. \nIn the US, a National Renewable Energy Laboratory study found that country could achieve an 80 percent renewable energy share by 2050, posing enormous challenges to power utilities across the country that rely on fossil fuel and nuclear stations to earn revenue. \nAustralia, on the other hand, recently slashed its renewable energy targets by 20 percent in a bid to protect its coal mining industry. \nJust as mobile telephony swept through the telecommunications industry in the past two decades, wiping out large fixed-line utilities that failed to adapt, the mass availability of small-scale renewable energy options at prices many consumers can afford today – and set to continue falling – challenges the energy industry to adapt or die. \n“This technology phenomenon is upon us,” Eskom general manager for research, testing and development Barry MacColl told Independent Newspapers. \n“It’s not a case of agreeing with it, disagreeing with it or trying to stop it – it’s here.” \nEskom would have to rethink its business model to survive. \nNumerous possibilities presented themselves - from Eskom leasing renewable energy solutions to customers who couldn’t finance them on their own, to limiting its role to maintaining and operating the grid while charging independent power producers for the service of wheeling electricity to their customers, to supplying only subsidised power to poorer households while private customers paid an energy tax to pay for the subsidy. \n“You have to adapt or die,” MacColl said. \n“The adaptation is we have to become part of this wave, rather than let this wave happen to us.” \nWhatever business model was chosen for Eskom, it would be better if it were managed as a national programme guided by the state, instead of it happening on its own. \n“It requires some kind of architecture, some kind of grand scheme, and if we don’t have that grand scheme and it just happens naturally, I think it will happen a lot slower, you would accelerate it if you had a national rollout programme rather than if every time someone could afford it they bought it. \n“But also, you lose the opportunity of having tax incentives and cross-subsidisation mechanisms and the state and Eskom just start to lose customers and there’s nothing they can do about it. \n“That might lead to the end of Eskom, which is OK, but it could also lead to the end of the state, because the poor would end up having no energy,” MacColl said. Related Stories", "external_links": [], "published": "2015-10-11T09:00:00.000+03:00", "crawled": "2015-10-11T18:19:37.215+03:00", "highlightTitle": ""}