{"organizations": [], "uuid": "d69404ba0e3f15b38f6839de5b79c3bfca07c301", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNF7bP0zUxKFLVRx_FFJ4vU0CWirxA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778960663321&ei=BTcOVsCaDNbFaMTSpvgO&url=http://www.baynews9.com/content/news/baynews9/news/article.html/content/news/articles/bn9/2015/10/1/new_credit_card_chip.html", "country": "IL", "title": "New credit card chip technology goes live - Bay News 9", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "New credit card chip technology goes live - Bay News 9", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T23:48:00.000+03:00", "replies_count": 0, "uuid": "d69404ba0e3f15b38f6839de5b79c3bfca07c301"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNF7bP0zUxKFLVRx_FFJ4vU0CWirxA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778960663321&ei=BTcOVsCaDNbFaMTSpvgO&url=http://www.baynews9.com/content/news/baynews9/news/article.html/content/news/articles/bn9/2015/10/1/new_credit_card_chip.html", "ord_in_thread": 0, "title": "New credit card chip technology goes live - Bay News 9", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Klystron"], "text": "WEATHER ON THE GO: Get the Bay News 9+ app with Klystron 9 on the go! New credit card chip technology goes live \nThe chips in the cards are harder to counterfeit than the magnetic stripes on millions of cards, but they require new card readers and software to process transactions. By Fallon Silcox and Greg Pallone, Team Coverage Last Updated: Thursday, October 01, 2015, 4:54 PM INDIALANTIC -- \nThursday marked a big day for credit card users and businesses that take them, all involving a small computer chip designed to make your transactions more secure. \nOct. 1 was the deadline for businesses that accept credit cards to be prepared to handle transactions with new chip-embedded cards, or find themselves paying the bill in the event of fraud. \nThe new card standard is called EMV. The acronym stands for Europay, MasterCard and Visa, the three companies that created the standard. \nInstead of swiping your card, an EMV card is inserted into a card reader at checkout. The card reader uses the information on the card's computer chip to authenticate it with the user's bank, making sure it's legitimate. \nEach card's chip has a unique code per transaction, making it tough for crooks to copy the card information. But experts say it still doesn't guarantee fraud protection. Computerworld FAQ: What you need to know about chip-embedded credit cards \nOn deadline day to accept the new technology, the sandwiches were being assembled for the lunchtime rush at Jersey Mike's in Indialantic. Most customers slid their debit and credit cards to pay for their meals, but Michelle Demetres used her chip card to buy her lunch Thursday. \n\"I got it about three months ago. It came in the mail,\" Demetres said. \nDemetres added she felt relatively safe about the new payment method, especially after losing hundreds of dollars as a one-time credit card fraud victim. \n\"But my bank did reimburse me for that,\" Demetres said. \nAs of Thursday, however, retailers and small businesses which haven't upgraded their payment system to accept the new EMV cards would be liable for any fraud. \nBryan Price, who owns the Indialantic Jersey Mike's and several other locations in Brevard County, said his corporate office saw this mandate coming and upgraded all his stores' systems more than a year ago, a key move for a place where most transactions involved credit and debit cards. \n\"Especially in today's world, where it's one side trying to stay ahead of the other, and we update the software and technology, and the other side that's trying to hack into it,\" Price said. \nExperts say only 40 percent of Americans currently have a chip card, but for Demetres, who also works in retail, every little bit helps trying to crack down on the ever-growing problem of credit card fraud. \n\"I don't know if we ever really will have our information safe,\" Demetres worried. \nWhile the deadline for retailers and small businesses was Thursday, gas stations have until 2017 to replace their card readers at the pumps. \nThe new technology costs merchants about $500. \nSri Sridharan, chief operating officer of the University of South Florida Center for Cybersecurity, said while this is a step in the right direction, the new EMV cards don't mean you're completely protected. \n\"This is the beginning,\" Sridharan said. \"This will be a transition phase until we have these gadgets where you enter a PIN, along with the chip card that you insert into the little slot. Until you take that step, you are not really fully authenticated.\" \nHowever, little is expected to change on Thursday at many small businesses. A number of banks and other card issuers still haven't sent the new cards to their customers, who will continue to use their magnetic stripe cards. \nIt's expected millions of the older cards will still be in use going into 2016, and at least for the time being, it's not expected thieves will have figured out how to copy the information on the chips.", "external_links": [], "published": "2015-10-01T23:48:00.000+03:00", "crawled": "2015-10-02T10:50:29.073+03:00", "highlightTitle": ""}