{"organizations": ["Center for Biomedical Engineering", "Brown Institute for Brain Science", "Nanowerk News", "MicroTissues Inc.", "Brown University"], "uuid": "7404a7533db3a5efad8ad9f218db5d903fc7154b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nanowerk.com", "main_image": "http://www.nanowerk.com/images/NWlogo.gif", "site_section": "http://feeds.nanowerk.com/NanowerkEmergingTechnologiesNews", "section_title": "Nanowerk Emerging Technologies News", "url": "http://www.nanowerk.com/news2/biotech/newsid=41489.php", "country": "US", "title": "An accessible approach to making a mini-brain", "performance_score": 0, "site": "nanowerk.com", "participants_count": 0, "title_full": "An accessible approach to making a mini-brain", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T17:13:00.000+03:00", "replies_count": 0, "uuid": "7404a7533db3a5efad8ad9f218db5d903fc7154b"}, "author": "", "url": "http://www.nanowerk.com/news2/biotech/newsid=41489.php", "ord_in_thread": 0, "title": "An accessible approach to making a mini-brain", "locations": ["Providence", "Brown"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hoffman-Kim", "Morgan", "Jeffrey Morgan", "Eric Darling", "Boutin", "Molly Boutin", "Yu-Ting Dingle", "Julie Kauer", "Diane Hoffman-Kim", "Brown"], "text": "The latest news about biotechnologies, biomechanics synthetic biology, genomics, biomediacl engineering... Posted: Oct 01, 2015 An accessible approach to making a mini-brain ( Nanowerk News ) If you need a working miniature brain -- say for drug testing, to test neural tissue transplants, or to experiment with how stem cells work -- a new paper describes how to build one with what the Brown University authors say is relative ease and low expense. The little balls of brain aren't performing any cogitation, but they produce electrical signals and form their own neural connections -- synapses -- making them readily producible testbeds for neuroscience research, the authors said. \"We think of this as a way to have a better in vitro [lab] model that can maybe reduce animal use,\" said graduate student Molly Boutin, co-lead author of the new paper in the journal Tissue Engineering: Part C ( \"3D Neural Spheroid Culture: An In Vitro Model for Cortical Studies\" ). \"A lot of the work that's done right now is in two-dimensional culture, but this is an alternative that is much more relevant to the in vivo [living] scenario.\" A bundle of neurons. A bioengineering team at Brown University can grow mini-brains of neurons and supporting cells that form networks and are electrically active. (Image: Hoffman-Kim lab/Brown University) Just a small sample of living tissue from a single rodent can make thousands of mini-brains, the researchers said. The recipe involves isolating and concentrating the desired cells with some centrifuge steps and using that refined sample to seed the cell culture in medium in an agarose spherical mold. The mini-brains, about a third of a millimeter in diameter, are not the first or the most sophisticated working cell cultures of a central nervous system, the researchers acknowledged, but they require fewer steps to make and they use more readily available materials. \"The materials are easy to get and the mini-brains are simple to make,\" said co-lead author Yu-Ting Dingle, who earned her Ph.D. at Brown in May 2015. She compared them to retail 3-D printers which have proliferated in recent years, bringing that once-rare technology to more of a mass market. \"We could allow all kinds of labs to do this research.\" The spheres of brain tissue begin to form within a day after the cultures are seeded and have formed complex 3-D neural networks within two to three weeks, the paper shows. 25-cent mini-brains There are fixed costs, of course, but an approximate cost for each new mini-brain is on the order of $0.25, said study senior author Diane Hoffman-Kim, associate professor of molecular pharmacology, physiology and biotechnology and associate professor of engineering at Brown. \"We knew it was a relatively high-throughput system, but even we were surprised at the low cost per mini-brain when we computed it,\" Hoffman-Kim said. Hoffman-Kim's lab collaborated with fellow biologists and bioengineers at Brown -- faculty colleagues Julie Kauer, Jeffrey Morgan, and Eric Darling are all co-authors -- to build the mini-brains. She wanted to develop a testbed for her lab's basic biomedical research. She was interested, for example, in developing a model to test aspects of neural cell transplantation, as has been proposed to treat Parkinson's disease. Boutin was interested in building working 3-D cell cultures to study how adult neural stem cells develop. Morgan's Providence startup company, MicroTissues Inc., makes the 3-D tissue engineering molds used in the study. The method they developed yields mini-brains with several important properties: Diverse cell types: The cultures contain both inhibitory and excitatory neurons and several varieties of essential neural support cells called glia. Electrically active: the neurons fire and spike and form synaptic connections, producing complex networks. 3-D: Cells connect and communicate within a realistic geometry, rather than merely across a flat plane as in a 2-D culture. Natural density: Experiments showed that the mini-brains have a density of a few hundred thousand cells per cubic millimeter, which is similar to a natural rodent brain. Physical structure: Cells in the mini-brain produce their own extracellular matrix, producing a tissue with the same mechanical properties (squishiness) as natural tissue. The cultures also don't rely on foreign materials such as scaffolds of collagen. Longevity: In testing, cultured tissues live for at least a month. Hoffman-Kim, who is affiliated with the Brown Institute for Brain Science and the Center for Biomedical Engineering, said she hopes the mini-brains might proliferate to many different labs, including those of researchers who have questions about neural tissue but not necessarily the degree of neuroscience and cell culture equipment required of other methods. \"If you are that person in that lab, we think you shouldn't have to equip yourself with a microelectronics facility, and you shouldn't have to do embryonic dissections in order to generate an in vitro model of the brain,\" Hoffman-Kim said. Source: Brown University If you liked this article, please give it a quick review on reddit or StumbleUpon . Thanks! Check out these other trending stories on Nanowerk:", "external_links": [], "published": "2015-10-01T17:13:00.000+03:00", "crawled": "2015-10-02T07:10:38.331+03:00", "highlightTitle": ""}