{"organizations": [], "uuid": "c0dd445d5af6c657358dabfcb368c372568ceb17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/05/8256142.htm", "country": "US", "title": "OpenLegacy Announces Version 3.0 Secure Cloud Platform for Easy Integration of Back End Systems to the Cloud via APIs", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "OpenLegacy Announces Version 3.0 Secure Cloud Platform for Easy Integration of Back End Systems to the Cloud via APIs", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:58:00.000+03:00", "replies_count": 0, "uuid": "c0dd445d5af6c657358dabfcb368c372568ceb17"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/05/8256142.htm", "ord_in_thread": 0, "title": "OpenLegacy Announces Version 3.0 Secure Cloud Platform for Easy Integration of Back End Systems to the Cloud via APIs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OpenLegacy Announces Version 3.0 Secure Cloud Platform for Easy Integration of Back End Systems to the Cloud via APIs [October 05, 2015] OpenLegacy Announces Version 3.0 Secure Cloud Platform for Easy Integration of Back End Systems to the Cloud via APIs Tweet \nGARTNER SYMPOSIUM/ITxpo, ORLANDO, Florida , October 5, 2015 /PRNewswire/ -- \nOpenLegacy today announced its new Cloud Solution, version 3.0 of its platform, for rapid, secure integration and delivery of back-end systems to the cloud. \n\"With this new version of OpenLegacy's platform, it is easier than ever for companies to offer digitally delivered services quickly, securely and with all of the management features they need,\" said Romi Stein , CEO of OpenLegacy. \n\"IT teams have invested years and budgets in their Enterprise Service Bus (ESB) architectures to connect back-end systems to each other and the rest of the world, but these systems are not necessarily cloud ready,\" said Zeev Avidan , Vice President of Product Management for OpenLegacy. \"Some of these architectures, even those recently implemented, are already considered 'legacy,' since they are not API based or cloud enabled. Our goal with the Cloud Solution is to enable back-end systems of all types - from mainframes to web services platforms - to be able to provide secure, managed, scalable and robust cloud APIs and to deploy within an extremely short timeframe. By combining application integration and delivery capabilities with an automated approach, we believe that we've achieved exactly that goal.\" \nWith OpenLegacy's new Cloud Solution, enterprises can move to the cloud quickly, easily, and securely, gaining lightweight integration with standard APIs. It offers all the necessary components for both integration and delivery on one platform, dramatically speeding time-to-market by eliminating the need for complicated, expensive integration platforms. Benefits of the solution include: \nFlexible Integration - Enterprises can determine the best method to integrate their back-end systems whether through the user interface, business logic, services layer, databases or even custom connectors. \nRapid Implementation and Testing - Dramatically reduces implementation time since OpenLegacy automatically analyzes back-end system assets and generates APIs. APIs can then be verified, enhanced and tested with OpenLegacy's user-friendly editors and testing tools. \nMeet and Exceed Performance Needs - Best-of-breed standards for server clustering, workload balancing and disaster recovery are integral to the solution. Using one-click deployment to Docker-based cloud containers, OpenLegacy's integration can be easily scaled to fit any performance needs. Deep caching algorithms ensure top level performance for the least amount of actual workload, avoiding poor performance due to unexpected load on the back-end. \nNo Changes to Back-end Systems - By exteding mission critical back-end systems with reusable OpenLegacy APIs, nothing needs to be changed on any of the systems of record. \nBuilt-in Security and Management - OpenLegacy provides out-of-the-box security and management that deliver worry-free deployment, enabling access control to services, user- and role-management, restriction of access to specific API fields and data content filtering. For example, a back-end CRM system may contain much more information than one would typically provide to third-party mobile app developer, and OpenLegacy can filter this. \nDeployment Freedom - Deployment to any on-premise or cloud environment can be done with a single click. Users can create hybrid cloud solutions to bring the entire IT infrastructure together or take advantage of OpenLegacy Cloud Containers to easily deploy and redeploy on multiple cloud environments. \n\"Extending to the cloud is a natural next step in the evolution of the OpenLegacy platform,\" Avidan continued. \"Our ability to rapidly integrate back-end applications to the API paradigm has enabled our customers to achieve quick and sustainable wins in extending their legacy architecture to the modern 'on-demand' world.\" \nOpenLegacy a \" Cool Vendor \" in Integration \nOpenLegacy was recognized by Gartner, the world's leading information technology research and advisory company, as a Cool Vendor in Integration in the report \" Cool Vendors in Integration, 2015 ,\" authored by Gartner analysts Eric Thoo , Massimo Pezzini , and Kimihiko Iijima , 15 April 2015 . \n\"Transformation of enterprises into digital businesses demands flexibility on how integration capabilities are achieved. Directors of integration can take advantage of innovative approaches from vendors to support emerging requirements,\" the report states. \nMassimo Pezzini further states in his analysis: \"Directors of integration or other IT leaders involved in legacy modernization or legacy integration initiatives and projects should look at open-source for their low cost of entry, flexibility and, potentially, available skills pool. These products are especially suitable for time-constrained and low-budget adaptive integration projects (for example, mobile app developments and API initiatives).\" \nOpenLegacy at Gartner Symposium/ITxpo \nOpenLegacy is exhibiting at Gartner Symposium/ITxpo in the Emerging Technologies pavilion, booth #ET41 . \nIn addition, Hans Otharsson, OpenLegacy's Chief Operating Officer, will be presenting \"Tame the Integration Beast with Agile API integration,\" Monday October 5 , 7:15 pm , in the Emerging Technologies Pavilion Theater (Located in between Atlantic and Pacific Hall), Session ID ET5. \nGartner Disclaimer \nGartner does not endorse any vendor, product or service depicted in its research publications, and does not advise technology users to select only those vendors with the highest ratings or other designation. Gartner research publications consist of the opinions of Gartner's research organization and should not be construed as statements of fact. Gartner disclaims all warranties, expressed or implied, with respect to this research, including any warranties of merchantability or fitness for a particular purpose. \nAbout Gartner Symposium/ITxpo \nGartner Symposium/ITxpo is the world's most important gathering of CIOs and senior IT executives. This event delivers independent and objective content with the authority and weight of the world's leading IT research and advisory organization, and provides access to the latest solutions from key technology providers. Gartner's annual Symposium/ITxpo events are key components of attendees' annual planning efforts. IT executives rely on Gartner Symposium/ITxpo to gain insight into how their organizations can use IT to address business challenges and improve operational efficiency. For more information, please visit http://www.gartner.com/us/symposium . \nAbout OpenLegacy \nOpenLegacy enables enterprises to quickly and securely extend and transform legacy and on premise systems such as IBM i (aka AS/400), mainframes and databases to the Web, mobile and cloud. An open-standards development platform, OpenLegacy lets organizations solve high impact business problems quickly, giving enterprises a newfound agility and opening the door to creative, new, cost-effective solutions. For more information, visit http://openlegacy.com . \nMedia Contact", "external_links": [], "published": "2015-10-05T17:58:00.000+03:00", "crawled": "2015-10-05T20:33:26.954+03:00", "highlightTitle": ""}