{"organizations": ["NASA"], "uuid": "dde45f6ad3ebfedc391a0322372c454bdb30772d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/6ca5a0fab7ca52df4b4a2c07d12b2bb2", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_tech_506.xml", "section_title": "NEWS.com.au | Technology News", "url": "http://www.news.com.au/technology/project-blue-beam-conspiracy-theory-suggests-nasa-has-secret-plans-to-create-new-world-order/story-e6frfrnr-1227581131784?from=public_rss", "country": "IL", "title": "Is NASA planning to create new world order?", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Is NASA planning to create new world order?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T12:17:00.000+03:00", "replies_count": 0, "uuid": "dde45f6ad3ebfedc391a0322372c454bdb30772d"}, "author": "", "url": "http://www.news.com.au/technology/project-blue-beam-conspiracy-theory-suggests-nasa-has-secret-plans-to-create-new-world-order/story-e6frfrnr-1227581131784?from=public_rss", "ord_in_thread": 0, "title": "Is NASA planning to create new world order?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "While scientists were quick to dismiss the occurrence as a mirage, not all agreed. \nIn the days after the event, one particular conspiracy theory started to gather serious momentum — the belief the sighting was the result of a secret NASA mission known as Project Blue Beam. \nCanadian journalist and conspiracy theorist Serge Monast first developed the theory in 1994, before publishing his beliefs in a book entitled Project Blue Beam . \nThe theory suggests NASA and the United Nations are planning to create a new world order by using technologically simulated mind control to shape a global New Age religion. \nMr Monast believed generating a global New Age religion was the only thing that would make a worldwide dictatorship possible. \nSpeaking at a presentation in 1994 , he speculated that Project Blue Beam would be carried out in four different steps. \nSTEP 1: The breakdown of all archaeological knowledge \nMr Monast detailed his belief that NASA would aim to discredit all existing religions through the breakdown of all archaeological knowledge. \n“[Step 1] deals with the setup of earthquakes at certain precise locations of the planet where supposedly new discoveries will suddenly explain the wrong meaning of all major religions’ basic doctrines,” he said. \nThe theory suggests that by providing evidence to falsify the teachings of all major religions, people will be more likely to accept the New Age religion when it is formed. \nSTEP 2: A gigantic space with 3D holographic laser projections \nMr Monast said the second stage in creating a new world order would be using a gigantic space show with 3D holographic images, lasers and sounds to seduce people into believing in the new god. \n“The show will consist of laser projection of multiple holographic images to different parts of the world, each receiving a different message according to predominating regional/national religious faith,” he said. \n“From the depths of space, astonished followers of the various creeds will witness their own returned messiah in spectacularly convincing lifelike realness.” \nMr Monast said all of these depictions of the messiah would then merge into one. \n“This one god will in fact be the anti-Christ who will explain the various scriptures have been misunderstood, that the religions of all are responsible for turning brother against brother, nation against nation; therefore the world’s religions must be abolished to make way for the Golden Age,” he said. Jesus is coming from the sky to explain your religious beliefs are wrong. \nSTEP 3: Telepathic two-way communication \nThis is where things start to get really creepy. \nIt is believed NASA will use low frequency radio waves to telepathically communicate with humans in an attempt to shape their beliefs to match those taught by the New Age religion. \nMr Monast said the telepathic communication would be used as a form of mind control to trick people into thinking their god is delivering them messages directly. \n“[The message will be sent from a] device that can deliver audible signals directly to an individual while they remain undetectable by anyone else,” he said. \n“The microwave beam generated by the device is moderated at audio frequencies and can broadcast voices directly into the brain.” \nSTEP 4: Universal supernatural manifestations using electronic means \nThe final step of Project Blue Beam is to create chaotic event that will leave people willing or desperate enough to accept the new world order. \nMr Monast said this could occur with up to three different orientations. \n“One is to make mankind belief that an alien invasion is about to strike down on each major city of the earth,” he said. \n“The second is to make the Christians believe to a major rapture with the supposedly divine intervention of an alleged good alien force coming to save the people from a brutal satanic attack. \n“The third orientation in the fourth step is a mixture of electronic and supernatural forces … the goal of this one deals with global Satanic ghosts all around the world in order to push all population on the edge to drown into a wave of suicide, killing and permanent psychological disorder.” Nothing like staging an alien invasion to send the world into panic. \nIs there any evidence to suggest the theory? \nAs you would expect with such a highly contentious topic, there are strong beliefs supporting and discrediting the conspiracy theory. \nEach of the four stages has evidence suggesting they are under way, although it is possible these things are just a coincidence. \nThe largest supporting evidence for stage one occurred in 2012 when 39 earthquakes rocked the Earth in just two days. \nFollowing the event, leading seismologist Gheorghe Marmureanu said he was puzzled. \n“There is no doubt that something is seriously wrong. There have been too many strong earthquakes. The quakes are a surprise that cannot be easily explained by current scientific knowledge,” he told The Watchers . \nThe recent discovery of what some believe to be Jesus Christ’s tomb and skeleton remains also gives merit to this stage. \nStage two has the most prolific evidence, with endless sightings of holograms in the sky reported. \nIn addition to the recent city appearing in the clouds over China, there has been video evidence of a Jesus crucifix and a transparent humanoid both appearing in the sky. \nWhile stage three is harder to prove, there has been a whole US government department working to allow communication without the use of vocalised speech through analysis of neural signals. Having already taken control of monkeys limbs through telepathy suggests this may not be far off. \nStage four also lacks substantial evidence, although there has been a number of cases of paranormal investigators discovering ghosts using electronic voice phenomenon recording devices . \nIf all these factors aren’t enough to convince you, then maybe the suspicious heart-attack death of Monast two years after he began trying to expose Project Blue Beam might sway your opinion. \nThen again, this whole concept could be one crazy idea that snowballed out of control. \nTell us what you think of Project Blue Beam in the comments below or on Twitter @mattydunn11 and @newscomauHQ", "external_links": [], "published": "2015-10-24T12:17:00.000+03:00", "crawled": "2015-10-24T13:24:25.599+03:00", "highlightTitle": ""}