{"organizations": ["Brooks Hays Adelaide"], "uuid": "98643fb3563ef54b294cdc65d11f88bf1c8bb2fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/mercury-hg-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/Orange_peels_to_combat_mercury_contamination_999.html", "country": "US", "title": "Orange peels to combat mercury contamination", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "Orange peels to combat mercury contamination", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:56:00.000+03:00", "replies_count": 0, "uuid": "98643fb3563ef54b294cdc65d11f88bf1c8bb2fb"}, "author": "", "url": "http://www.terradaily.com/reports/Orange_peels_to_combat_mercury_contamination_999.html", "ord_in_thread": 0, "title": "Orange peels to combat mercury contamination", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Orange peels to combat mercury contamination by Brooks Hays Adelaide, Australia (UPI) Oct 23, 2015 disclaimer: image is for illustration purposes only \nResearchers at the Australia's Flinders University have come up with a novel solution to the problem of mercury pollution -- a polymer made of industrial waste. \nScientists have found a way to clean up waste with waste. \nThe polymer is made of sulphur and limonene. Millions of tons of sulphur are produced by the oil and gas industry every year, while thousands of tons of limonene (highly concentrated in orange peels) are produced by the citrus industry. \n\"Not only is this new polymer good for solving the problem of mercury pollution,\" material scientist Justin Chalker said, \"but it also has the added environmental bonus of putting this waste material to good use while converting them into a form that is much easier to store so that once the material is 'full' it can easily be removed and replaced.\" \nThe polymer is cheap to make and efficiently removes mercury and other heavy metals from water. It could be used to line wastewater pipes or deployed in larger bodies of water to combat spills. And because it turns yellow when mercury is absorbed, it can be used to test for mercury contamination. \nMercury is one of the most troublesome contaminants in the environment. It's heavy and quite toxic. Mercury from coal plants and mining operations leaches into the soil and sea, accumulating in fish and plants, larger and larger amounts working their way up the food chain. \nEasily absorbed through the skin, humans can become exposed to mercury by simply being in polluted environments, breathing polluted air or eating contaminated meat. Mercury poisoning can damage the brain, kidneys, lungs and nervous system. Pregnant women and children are especially vulnerable to mercury's negative health effects. \n\"Mercury contamination plagues many areas of the world, affecting both food and water supplies and creating a serious need for an efficient and cost effective method to trap this mercury,\" Chalker added. \"Until now, there has been no such method, but the new sulphur-limonene polysulfide addresses this urgent need.\" \nThe new polymer is detailed in the journal Angewandte Chemie International Edition. .", "external_links": [], "published": "2015-10-25T01:56:00.000+03:00", "crawled": "2015-10-25T02:58:48.366+02:00", "highlightTitle": ""}