{"organizations": [], "uuid": "368a22bf7e8d1efa2b04a163dfc01e1571a9c380", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/tortoise-400x233.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrgGeoscienceEnvironmentNews", "section_title": "Technology Org » Geoscience & Environment news", "url": "http://www.technology.org/2015/10/22/yale-team-identifies-new-giant-tortoise-species-galapagos/", "country": "", "title": "Yale team identifies new giant tortoise species in Galapagos", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Yale team identifies new giant tortoise species in Galapagos", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T08:30:00.000+03:00", "replies_count": 0, "uuid": "368a22bf7e8d1efa2b04a163dfc01e1571a9c380"}, "author": "Raminta Šulskutė", "url": "http://www.technology.org/2015/10/22/yale-team-identifies-new-giant-tortoise-species-galapagos/", "ord_in_thread": 0, "title": "Yale team identifies new giant tortoise species in Galapagos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yale team identifies new giant tortoise species in Galapagos Posted Today \nA few hundred giant tortoises living on one side of Santa Cruz Island in the Galapagos actually are a separate species from a second, larger population living less than 10 kilometers away, a new Yale-led genetic analysis has revealed. Eastern Santa Cruz tortoise. Image credit: Washington Tapia \nThe recognition of the Eastern Santa Cruz tortoise as a distinct species provides new insight into the history of these evolutionary icons that live on the island chain that inspired Charles Darwin. \nWhile the larger western population on the island numbers about 2,000 and lives mostly in a protected national park, the smaller number of Eastern Santa Cruz tortoises may need more protection, said Adalgisa “Gisella” Caccone, senior research scientist in the Department of Ecology and Evolutionary Biology and senior author of the research published Oct. 21 in the journal PLOS ONE. \n“Naming a new species elevates its status and enables more resources to be devoted to protecting its range,” Caccone said. \nResearchers had noted differences in the shells, or carapaces, of the two populations of giant tortoises but had assumed these were simply variations within the same species. However, a close genetic analysis revealed they were in fact as genetically distinct as species living on different islands. \n“The story tells us something about patterns of divergence in the giant tortoises in the Galapagos and how colonization of the archipelago did not follow a simple linear model,’’ Caccone said. \nThe study was conducted by an international group, which included researchers from the University of Crete, British Columbia and researchers from several U.S.-based universities and foundations.", "external_links": [], "published": "2015-10-22T08:30:00.000+03:00", "crawled": "2015-10-22T09:38:23.383+03:00", "highlightTitle": ""}