{"organizations": [], "uuid": "d82cae0324fafee20dc9d66f652f08006095f819", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150915125959&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10803505/humana-products-now-available-on-the-plansource-benefits-platform", "country": "US", "title": "Humana Products Now Available on the PlanSource Benefits Platform", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "Humana Products Now Available on the PlanSource Benefits Platform", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "d82cae0324fafee20dc9d66f652f08006095f819"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10803505/humana-products-now-available-on-the-plansource-benefits-platform", "ord_in_thread": 0, "title": "Humana Products Now Available on the PlanSource Benefits Platform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ORLANDO, Fla. Consumers have a new, simplified way to shop for health and wellness solutions with the formation of a partnership between PlanSource, a leading provider of cloud-based health exchange and benefits administration technology, and Humana Inc . (NYSE: HUM), one of the nation's leading health and well-being companies.\nPlanSource now distributes Humana's portfolio of products through its highly configurable benefits engagement system, which can be administered by employers or set up as a public or private exchange. Through the PlanSource platform, consumers have access to all Humana employee benefit product lines, including voluntary benefits such as Accident, Critical Illness and Hospital Indemnity.\nPlanSource's flexible and intuitive cloud-based platform is used by thousands of employers for employee benefits shopping, enrollment, billing, compliance and administration.\nEmployees are offered step-by-step guidance and personalized plan recommendations during the shopping and enrollment process. Content such as videos, documents, tools and messages can be personalized depending on consumer demographics, geographic location, family status and benefit elections, providing unique opportunities for consumer education and promoting products and services.\n\"This partnership is a natural blend of innovative technology and industry-leading benefits,\" said Beth Bierbower , President of Humana's Group Segment. \"The PlanSource platform gives Humana an ideal way to distribute our products. It simplifies the consumer shopping and enrollment experience and gives employers tools to efficiently manage and administer employee benefits.\"\n\"Humana's deep commitment to improving health and well-being has made it a leader in the industry,\" said Scott Carver , President of PlanSource. \"Their products are helping thousands of people get the care they need and live better lives. We are honored to work with them and provide technology that educates consumers on their benefits options and gets them covered quickly and easily.\"\nIn addition, PlanSource offers a solution that ensures employers are compliant with the reporting requirements under the Affordable Care Act (ACA).\nAbout PlanSource\nPlanSource provides the industry's most flexible and extensible health exchange and benefits engagement platform in the cloud. More than 8000 employers and 3.5 million consumers use the PlanSource Platform for benefits shopping, enrollment, billing and ongoing administration. PlanSource partners with leading insurance carriers, brokers and government entities to provide both exchange and non-exchange solutions to companies of all sizes.\nPlanSource – One Source. Many Benefits. Learn more at www.plansource.com .\nAbout Humana\nHumana Inc., headquartered in Louisville, Ky. , is a leading health and well-being company focused on making it easy for people to achieve their best health with clinical excellence through coordinated care. The company's strategy integrates care delivery, the member experience, and clinical and consumer insights to encourage engagement, behavior change, proactive clinical outreach and wellness for the millions of people we serve across the country.\nMore information regarding Humana is available to investors via the Investor Relations page of the company's web site at www.humana.com , including copies of:\nAnnual reports to stockholders; Securities and Exchange Commission filings; Most recent investor conference presentations; Quarterly earnings news releases; Replays of most recent earnings release conference calls; Calendar of events; and Corporate Governance information. Copyright (c) 2015 PlanSource, Inc. All rights reserved. PlanSource is a registered trademark of PlanSource, Inc., and PlanSource owns other registered and unregistered trademarks. Other names used herein may be trademarks of their respective owners.\nLogo- http://photos.prnewswire.com/prnh/20150805/256115LOGO\n releases/humana-products-now-available-on-the-plansource-benefits-platform-300142876.html\nSOURCE PlanSource", "external_links": ["http://photos.prnewswire.com/prnh/20150805/256115LOGO", "http://www.plansource.com/", "http://www.prnewswire.com/news-releases/humana-products-now-available-on-the-plansource-benefits-platform-300142876.html", "http://www.humana.com/", "http://photos.prnewswire.com/prnvar/20150805/256115LOGO"], "published": "2015-09-15T03:00:00.000+03:00", "crawled": "2015-10-12T05:23:43.049+03:00", "highlightTitle": ""}