{"organizations": [], "uuid": "2d2a9bc2c8d2a9cc641399209d0968def87ff6fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za$link.buildImageURL($articleImgId, ", "site_section": "http://www.iol.co.za/cmlink/science-technology-business-rss-1.847516", "section_title": "Science Technology Business RSS", "url": "http://www.iol.co.za/youtube-rolls-out-paid-for-service-1.1933965", "country": "US", "title": "YouTube rolls out paid-for service", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "YouTube rolls out paid-for service", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T11:12:00.000+03:00", "replies_count": 0, "uuid": "2d2a9bc2c8d2a9cc641399209d0968def87ff6fc"}, "author": "", "url": "http://www.iol.co.za/youtube-rolls-out-paid-for-service-1.1933965", "ord_in_thread": 0, "title": "YouTube rolls out paid-for service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jack Clark", "Lucas Shaw"], "text": "YouTube rolls out paid-for service October 22 2015 at 10:12am By Jack Clark, Lucas Shaw \nSan Francisco – Google's YouTube unveiled a paid version of its video-sharing service, a new source of revenue for parent company Alphabet as the Internet giant tries to make the website more profitable and fend off competition from other premium content sites. \nThe new service, called YouTube Red, will cost $9.99 a month and is available beginning October 28, the company said Wednesday in a blog post. Google will try to persuade people to pay for a service they already get for free by eliminating advertisements and permitting subscribers to save videos for offline viewing. \nWringing more money out of YouTube is crucial to the success of the larger Alphabet group, said Jitendra Waral, an analyst at Bloomberg Intelligence. YouTube Red differentiates YouTube from ad-supported rivals like Facebook, and brings Google more directly into competition with paid streaming services from Netflix and Hulu. Google is tapping into a network of homegrown stars such as PewDiePie, who attained their fame on the platform and have loyal audiences there. \n“YouTube is one of the three pillars of Alphabet,” said Waral, citing the economics of ads viewed on mobile devices and new cost controls being introduced by Chief Financial Officer Ruth Porat. A streaming service will be “an additional revenue stream, rather than a surrogate revenue stream,” he said. \nThe music industry has been particularly vocal in advocating a subscription version of YouTube, as part of a broader push to get people to pay for music they already watch or listen to for free. YouTube is the most popular access point for music in the world, but record companies collect far less revenue from ad-supported streaming services than they do from paid services run by Spotify and Deezer, according to a recent report by the International Federation of the Phonographic Industry. \nA new music app, YouTube Music, also was announced Wednesday. Users can get more features with a subscription to YouTube Red, the company said in its blog post. \nGoogle, via its Google Play store, already operates a subscription music service via its that has a lot of overlap with YouTube Red. “If you pay for Google Play Music you get all of YouTube Red music in your subscription,” Robert Kyncl, YouTube's chief business officer, said at an event announcing the service. “You don't have to change anything, you get it all.” \nYouTube, the undisputed king of the ad-supported Web video market for most of its existence, has spent the past couple of years combating more vigorous competition. It introduced a new gaming app after Amazon.com Inc. acquired Twitch, a popular video-game streaming site. YouTube is also funding original series for stars that have licensed shows or made series for rivals Vessel Inc., Go90 and Spotify. Some of those series will be exclusively available to subscribers of YouTube Red. \n“The YouTube that you know and love continues to thrive,” Kyncl said. “YouTube Red marks an evolution in our desire to give fans more choice and features that they love.”– Bloomberg", "external_links": [], "published": "2015-10-22T11:12:00.000+03:00", "crawled": "2015-10-22T13:13:49.577+03:00", "highlightTitle": ""}