{"organizations": ["EMEA", "NGOs", "Communications Technology", "CCTV", "Vizocom", "Cisco", "Airbus Defence & Space Satellite Communications", "ICT", "Abu Dhabi International Petroleum Exhibition & Conference", "Airbus", "VSAT", "ADIPEC"], "uuid": "092864d06c51b0e3fe7cbd3b2de4fa2101720ae0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C12/", "section_title": "Press Releases - Enterprise Technology", "url": "http://news.scoopasia.com/index.php/news/vizocom_exhibits_in_adipec_2015/", "country": "US", "title": "Vizocom Exhibits in ADIPEC 2015", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Vizocom Exhibits in ADIPEC 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T01:27:00.000+03:00", "replies_count": 0, "uuid": "092864d06c51b0e3fe7cbd3b2de4fa2101720ae0"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/vizocom_exhibits_in_adipec_2015/", "ord_in_thread": 0, "title": "Vizocom Exhibits in ADIPEC 2015", "locations": ["UAE", "Abu Dhabi", "Africa", "Dubai", "Malayalam", "Urdu", "Asia", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Winegard", "Vizocom", "Mukundan Paravasthu", "Ganesh Malpute"], "text": "Vizocom Exhibits in ADIPEC 2015 , 9 October 2015 -- Vizocom will be exhibiting in the 31st Abu Dhabi International Petroleum Exhibition & Conference (ADIPEC) in Abu Dhabi, UAE this 9th to 12th of November, 2015.Dubai, UAE, October 09, 2015 -- Vizocom will be exhibiting in the 31st Abu Dhabi International Petroleum Exhibition & Conference (ADIPEC) in Abu Dhabi, UAE this 9th to 12th of November, 2015. ADIPEC is a premier global presentation and the most important platform for the Oil and Gas industry in the Middle East. Last year's event attracted 1,868 exhibitors, 76,240 attendees from 112 countries, 20 international pavilions, 18 NOCs, 17 IOCs, and six UAE government bodies. The event will be the hub for key players in the Oil and Gas industry in the Middle East, attracting the leading oil, gas, and petroleum companies from around the world. This years' theme is \"Innovation & Sustainability in a New Energy World.\" Vizocom is participating in this important event along with its strategic partners Cisco, Airbus, Exterity, OSN, and Winegard. The event will provide Vizocom and its partners with an opportunity to showcase their latest product and service offering, giving participants the chance to see our Satellite Communications, ICT, and ELV (CCTV, CATV, IPTV, PAGA, Access Control, and Building Management Systems) solutions in the region. While we continue to strengthen our current partnerships to empower our client base with a complete portfolio of solutions, Vizocom are always open to establish new partnerships to broaden our product and service offering. For more information, visit http://www.vizocom.com | http://www.vizocomsat.com To arrange a meeting, please contact: Ganesh Malpute, Senior Business Development Manager Email: Phone: +971 55 990 6298 Mukundan Paravasthu - Regional Sales Manager - EMEA Email: Phone: +971 50 70 89379 About Vizocom: Vizocom is a leading Information and Communications Technology company with special focus and expertise on providing internet and VSAT services, IT infrastructure solutions and integration in remote regions throughout the world. Vizocom caters to Fortune 1000 companies with a focus on the O&G, mining and construction markets as well as governments, NGOs, and security companies. While Vizocom’s Satellite Services are global, it focuses on the emerging markets in Africa and Asia. About Airbus: Airbus Defence & Space Satellite Communications is the world leader in satcom-enabled solutions for maritime, enterprise, and aero customers, providing the most extensive portfolio of satellite-enabled communication services. About Cisco: Cisco is a worldwide leader in IT, providing highly secure network foundations with a variety of technologies and operational tools, techniques, and solutions that has transformed how people connect, communicate, and collaborate. About Exterity: Exterity is a global leader in enterprise IP video technology, and is the only vendor to deliver truly end-to-end IPTV solutions that help organizations to harness the power of video to communicate, collaborate, educate, and entertain. About OSN: OSN is the ultimate destination for the widest choice of brand new and premium Western, Arabic, South Asian (Hindi, Urdu, Bengali, Malayalam and Tamil) and Filipino TV entertainment in the Middle East and Africa, with nearly 140 channels filled with great value entertainment. About Winegard: Winegard is an industry leader in the design and manufacturing of quality signal reception equipment, and is globally recognized for rugged, reliable, antenna solutions. Winegard has extensive engineering expertise that provides innovative solutions for communication applications. Contact:", "external_links": [], "published": "2015-10-09T01:27:00.000+03:00", "crawled": "2015-10-09T11:07:35.609+03:00", "highlightTitle": ""}