{"organizations": [], "uuid": "dbe01600913bfb8b1c8b6f77c50f3594c4132f79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/news-by-category/189", "section_title": "Technology: Software Press Releases and News - PR.com", "url": "http://www.pr.com/press-release/641203", "country": "US", "title": "Maxoptra Distribution Summer Release", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Maxoptra Distribution Summer Release - PR.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "dbe01600913bfb8b1c8b6f77c50f3594c4132f79"}, "author": "PR.com", "url": "http://www.pr.com/press-release/641203", "ord_in_thread": 0, "title": "Maxoptra Distribution Summer Release", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Maxoptra Distribution Summer Release\nLondon, United Kingdom, October 11, 2015 --( PR.com )-- Magenta Technology’s latest update of the Maxoptra dynamic scheduling and route optimization software platform solution for Distribution focuses on making it as simple as possible to use.\nMaxoptra is a SaaS solution that lets a user view and manage orders more easily. It can either give you hints for ideal planning or build routes for you automatically. Our dynamic scheduling system also calculates ETAs and can automatically send email or SMS notifications to your clients.\nThe latest iteration has an improved procedure for SMS resending to a client in case of failure. Maxoptra will now automatically make three attempts to resend the SMS every minute to ensure it is received. The platform automatically revises the ETA calculation if a driver violates the planned order sequence by the time of the first stop.\nAnother added benefit is that you can now select several orders on the map at once. Just press the CMD button (for Apple Macintosh) or the CTRL button (for Windows) and select all the orders you want to assign. This will save time and reduce the risk of human error.\nAll in all, this latest release has been designed to make Maxoptra easier to use and understand.\nAbout Maxoptra\nMaxoptra is a dynamic scheduling and route optimization software platform designed to enable fast and efficient decision-making, in real-time, within ever-changing operational environments, particularly service management, supply chain, distribution and home delivery.\nEasy to use, affordable and highly customizable, Maxoptra helps companies to do more business with the same resources at a lower operational cost and having an open API is an ideal complement to any telematics, WMS and CRM solution. As a subscription-based SaaS solution, Maxoptra is accessible 24/7 from any web browser worldwide, meaning every new release of functionality is immediately available to subscribers with no additional charge or upgrade cost.\nOur scheduling solutions manage over 10,000 fleet vehicles worldwide every day. Customers include Gist, Avis Car Rental, Snap On, Serviceline, Walkers Transport, Champion Timber and many others.\nFor more information visit maxoptra.com\nMaxoptra is a division of Magenta Technology.\nAbout Magenta Technology\nMagenta Technology is a leading provider of dynamic real time scheduling system for logistics companies.\nMagenta has developed a multi-agent system to solve complex and unique transport and logistics scheduling problems in real time. This has led to the successful development and delivery of long-lasting solutions for such global players as Avis, Addison Lee, Gist, Greentomatocars, Transdev and AirBus.", "external_links": [], "published": "2015-10-11T03:00:00.000+03:00", "crawled": "2015-10-22T20:55:47.714+03:00", "highlightTitle": ""}