{"organizations": ["Device Logistics Achieves Apple"], "uuid": "98ebfb39bd2b374af700415713556df1092b01ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151014005940/en/Tangoe-Enhances-MatrixMobile-Device-Logistics", "country": "US", "title": "Tangoe Enhances MatrixMobile Device Logistics", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Tangoe Enhances MatrixMobile Device Logistics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:34:00.000+03:00", "replies_count": 0, "uuid": "98ebfb39bd2b374af700415713556df1092b01ac"}, "author": "", "url": "http://www.businesswire.com/news/home/20151014005940/en/Tangoe-Enhances-MatrixMobile-Device-Logistics", "ord_in_thread": 0, "title": "Tangoe Enhances MatrixMobile Device Logistics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tangoe Enhances MatrixMobile Device Logistics Achieves Apple’s Device Enrollment Program Certification October 14, 2015 09:34 AM Eastern Daylight Time \nORANGE, Conn.--( BUSINESS WIRE )-- Tangoe, Inc. (NASDAQ: TNGO), a leading global provider of Connection Lifecycle Management (CLM) software and related services, today announced that it has enhanced its MatrixMobile Device Logistics services with certification in the Apple Device Enrollment Program (DEP). With the inclusion in Apple’s DEP program, Tangoe further deepens its forward and reverse logistics capabilities, making it possible for enterprises to completely outsource their device logistics needs. \nThrough its relationships with global carriers, as well as extensive partnerships with leading mobile device management (MDM) providers in the industry, including MobileIron and AirWatch , among others, Tangoe is able to provide logistics support to virtually every enterprise – leveraging any device and operating system. \nToday’s demands of the connected workforce are proving the value of Tangoe’s MatrixMobile Device Logistics where customers are outsourcing forward and reverse logistics management, supporting the entire lifecycle of a device from procurement and activation to end-of-life recycling, refurbishing, repair and replacement. Recently, a top five insurance company leveraged Tangoe to help evaluate the migration of over 5,700 mobile devices for employees. MatrixMobile Device Logistics scales this process to ensure a new device enters the company with not only MDM applications installed, but all corporately owned and built applications needed as well. \n“We’re seeing a proliferation of new tablet and mobile devices entering the enterprise every day, and while MDM can be a daunting task for organizations, it doesn’t have to be,” said Jim Carroll, senior vice president of managed mobility, Tangoe. “With MatrixMobile Device Logistics, and our new role in Apple’s DEP program, we can help companies manage the entire logistics process, regardless of the MDM provider, from device procurement and program and application loading to device kitting, staging and testing, all the way through large scale group migrations, simplifying how companies manage the mobile enterprise.” \nTangoe has tripled its MatrixMobile Device Logistics business in the last year, with a number of major customer wins in the healthcare, consumer products, and government industries. The multi-billion dollar MDM market is driven by the strain on enterprise IT resources managing the impacts of mobile device growth and the consumerization of IT in the workplace. By outsourcing their device logistics needs to Tangoe, enterprise CIOs and IT teams are able to provide employees with the support they need. \nTo learn more about MatrixMobile Device Logistics, and Tangoe’s other enterprise mobility management solutions, please visit: https://www.tangoe.com/Products-Services/Managed-Mobility-Services-MatrixMobile.aspx . \nAbout Tangoe \nTangoe (NASDAQ: TNGO) is a leading global provider of Connection Lifecycle Management software and services to a wide range of global enterprises and service providers. The company's Connection Lifecycle Management technology, Matrix, is an on-demand suite of software and services designed to turn on, track, manage, secure, and support various connections in an enterprise's connection lifecycle, including mobile, fixed, machine-to-machine, cloud software and services, enterprise social, and IT connections. Additional information about Tangoe can be found at www.tangoe.com . \nTangoe is a registered trademark of Tangoe, Inc. Contacts", "external_links": [], "published": "2015-10-14T16:34:00.000+03:00", "crawled": "2015-10-14T16:51:14.722+03:00", "highlightTitle": ""}