{"organizations": [], "uuid": "427007ea1f9d3a21fd88415ce37a4d46d56af573", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/Schiaparelli_separating_from_Trace_Gas_Orbiter_node_full_image_2.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrgSpaceAstronomyNews", "section_title": "Technology Org » Space & Astronomy news", "url": "http://www.technology.org/2015/10/19/exomars-heads-to-the-red-planet-in-2016/", "country": "", "title": "ExoMars Heads to the Red Planet in 2016", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "ExoMars Heads to the Red Planet in 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T13:45:00.000+03:00", "replies_count": 0, "uuid": "427007ea1f9d3a21fd88415ce37a4d46d56af573"}, "author": "Alius Noreika", "url": "http://www.technology.org/2015/10/19/exomars-heads-to-the-red-planet-in-2016/", "ord_in_thread": 0, "title": "ExoMars Heads to the Red Planet in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ExoMars Heads to the Red Planet in 2016 Posted Today \nThe 2016 launch window for Mars missions is fast approaching along with opposition, and ESA is refining its target window for ExoMars . Mars launch season offers the optimal time to make the trip from Earth to Mars, as missions prepare to break the surly bonds and head towards the Red Planet next spring. NASA’s InSight lander will also make the trip. An artist’s concept of the Schiaparelli EDM Lander separating from the ExoMars Trace Gas Orbiter en route to the Red Planet. Image Credit: ESA \nExoMars is the first joint European Space Agency (ESA) Roscosmos mission to the Red Planet. The ExoMars Trace Gas Orbiter is under contract to Thales Alenia Space, and the EDM stationary lander dubbed Schiaparelli after the 19th century Italian astronomer is being constructed by Airbus Defense and Space. This would be Russia’s first successful Mars lander mission for over a dozen tries if successful. The ExoMars Trace Gas Orbiter in the lab. Image credit: ESA \nThe ExoMars project is a two-part mission, and will culminate in an ExoMars rover in 2018. The key objective for the Trace Gas Orbiter, lander and rover to follow in 2018 is to seek out the controversial source of methane on Mars. A product of biology—think bovine flatulence—on Earth, researchers have proposed various sources—inorganic and otherwise—as a source of the anomalous methane seen in the Martian atmosphere. The Trace Gas Orbiter will remain on-station in orbit through 2018 to relay communications from the ExoMars rover. The Entry, Descent and Landing Demonstrator Module Schiaparelli will demonstrate key technologies for landing, including a hybrid Buck Rodgers fins-first style retro-rocket landing reminiscent of Viking, along with a deformable underside meant to absorb impact. The landing sequence for the EDL Lander. Image credit: ESA \nThe landing with be a dramatic one on Meridiani Planum at the expected height of dust storm season, and we may get some interesting footage from the onboard descent camera. Along with weather and atmospheric measurements, the EDM Lander will also make the first electrical field measurements from the surface of Mars. The landing ellipse for EDL. Note that its very close to the NASA rover Opportunity. Image credit: MOLA Science Team and NASA/JPL/Arizona State University \nUnfortunately, EDM’s life will be short; Roscosmos originally intended to supply a 100-watt plutonium-powered RTG for the lander, but later opted due to export control to use an on-board battery. The EDM’s lifespan will be measured in a few days, at best. \nHeading to Mars in 2016 \nAn issue related to two propulsion system sensors aboard the EDM Lander recently prompted mission planners to opt for a launch for ExoMars at the end of the window next year, with liftoff set for March 14 th atop a Proton rocket from the Baikonur Cosmodrome in Kazakhstan instead of January, as originally intended. NASA’s Mars InSight will depart Earth for the Red Planet just ten days earlier on March 4 th from Vandenberg AFB in a rare dramatic night shot of an Atlas 5 rocket deploying an interplanetary mission from the US West Coast. InSight’s primary objective is to study seismic activity and the Martian interior, and will land in one of four selected sites (1 primary and 3 backup) in Elysium Planitia on September 28 th , 2016. \nNaturally, ESA and Roscomos are taking every precaution to assure the success of ExoMars and EDM. The 2011 failure of Phobos-Grunt highlighted the perils of tempting the ‘Great Martian Ghoul’ with more tasty spacecraft. Space is hard, and landing on Mars even more so. \nOpposition 2016 for Mars occurs on May 22 nd , 2016. Mars is always high in the early morning sky a few months prior to opposition, presenting an optimal window to send spacecraft to the Red Planet on the most efficient in trajectory in terms of fuel and time. This 3-month wide window comes around every 26 months leading up to opposition season. Oppositions of Mars are now getting more favorable, and the next opposition after 2016 in 2018 will be nearly as favorable as the historic 2003 event. Typical Earth to Mars launch trajectories, in this case, for NASA’s twin Mars Exploration Rovers. Image credit: NASA/JPL \nOur robots are swiftly colonizing Mars on our behalf. Here’s a Who’s Who scorecard of functioning spacecraft. On the surface: NASA’s Opportunity and Mars Curiosity rovers. In orbit: Mars Odyssey, (Since 2001!) Mars Express, HiRISE, India’s Mars Orbiter, and MAVEN. Add the ExoMars 2016 and 2018 missions, InSight and the Mars 2020 rover for NASA, and we’ve truly established a redundant sort of ‘telepresence’ on and around Mars. An artist’s conception of the ExoMars 2018 rover on the Red Planet. Image credit: ESA \nWill the EDM Lander become the first successful non-NASA lander to approach the Red Planet? Keep an eye on the Insight and the first of two ExoMars missions, as Earth invades Mars in 2016! \nSource: Universe Today , written by David Dickinson Related Topics:", "external_links": [], "published": "2015-10-19T13:45:00.000+03:00", "crawled": "2015-10-19T14:16:02.995+03:00", "highlightTitle": ""}