{"organizations": ["Stanford", "Boomerang Commerce", "Competitor Data", "Walmart", "MIT", "Amazon", "Apple Watches", "McKinsey"], "uuid": "59559a5e2fd59666836f5771bd384b9f5d6a4c6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/subcat-technology.xml", "section_title": "BusinessWire India.com - Technology", "url": "http://businesswireindia.com/news/news-details/boomerang-commerces-retail-app-watchos-brings-merchants-future-retail/45558", "country": "US", "title": "Boomerang Commerce’s Retail App for watchOS Brings Merchants the Future of Retail", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Boomerang Commerce’s Retail App for watchOS Brings Merchants the Future of Retail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:44:00.000+03:00", "replies_count": 0, "uuid": "59559a5e2fd59666836f5771bd384b9f5d6a4c6c"}, "author": "", "url": "http://businesswireindia.com/news/news-details/boomerang-commerces-retail-app-watchos-brings-merchants-future-retail/45558", "ord_in_thread": 0, "title": "Boomerang Commerce’s Retail App for watchOS Brings Merchants the Future of Retail", "locations": ["United States", "Philadelphia", "Amazon", "Near-Real-Time"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hariharan"], "text": "Monday, October 5, 2015 6:14PM IST (12:44PM GMT) (BW)(CA-BOOMERANG-COMMERCE) Boomerang Commerce’s Retail App for watchOS Brings Merchants the Future of Retail Apple Watch App Analyzes Customer and Competitor Data in Near-Real-Time, Enables Immediate Action and Turns Merchants Into Retail Ninjas Philadelphia, United States SHOP.ORG 2015 DIGITAL SUMMIT – Boomerang Commerce today releases the first watchOS application to monitor retailers’ most popular products, provide alerts on their Apple Watches and enable them to make data-driven merchandising decisions in near-real-time. Designed for omni-channel merchants, the Boomerang Commerce Retail App for watchOS is an enterprise mobile application that delivers the operational excellence needed to stay ahead of competitors during the holiday shopping season. The app is included in Boomerang Commerce’s Retail Solutions Suite, and it provides retailers the ability to quickly act on competitors’ pricing, promotions and assortment changes. Visit Boomerang Commerce at booth #516 during the Shop.org 2015 Digital Summit in Philadelphia October 5-7 for a demonstration. TWEET THIS : .@boomerangcommer Retail watchOS App delivers future of #retail via real-time #AppleWatch alerts for merchandisers http://ctt.ec/vIdbo+ By 2017 American millennials are expected to own $200 billion in annual spending power. In 2015 alone, this age demographic represents over $2 trillion in global spending. Millennials make their generationally unique spending decisions based on various online retailers’ prices, customer reviews and peer suggestions via social and other media channels. Merchants must be able to apply data science and make decisions in near-real-time to adjust to this changing consumer behavior. Retailers must closely monitor their prices, assortment, inventory and other parameters, as well as those of their competitors’, to make the right product, style and quantity decisions or lose out on market share and margins. The shifting retail landscape means merchants must combine their right-brained, creative ideas and their left-brained, analytical strategies for a more holistic approach to merchandising decisions. Boomerang Commerce lets retailers analyze large quantities of data and act in near-real-time on recommendations based on competitor and proprietary assortment, inventory and pricing information. This allows merchants to respond to competitors’ product offerings and promotions quickly, which is the key to maintaining relevance during the busy holiday season. Currently in beta, the Retail App for watchOS is fully integrated with Boomerang Commerce’s Retail Solutions Suite. It alerts merchants about the following: Competitor price changes : Alerts merchants when a competitor changes prices on popular products in the merchant’s product portfolio; provides an estimate on the amount of revenue at risk; and recommends an immediate “right price” action to counter competitor behavior Out-of-stock: Alerts merchants when a top-selling item is out of stock and enables them to initiate order replenishments New popular products: Alerts merchants when a competitor introduces “hot products” and enables them to route the orders to procurement “The future of retail lies in data-driven decisions in real-time,” says Guru Hariharan, CEO and founder of Boomerang Commerce. “Best of breed retailers like Amazon and Walmart are investing billions of dollars to build capabilities that allow them to make intelligent decisions more quickly than their competitors. Retailers that don’t invest in the future of retail technology today stand to lose market share and die. The Boomerang Commerce Retail Apple Watch App empowers forward-thinking merchants with alerts and actions that turn them into retail ninjas.” About Boomerang Commerce Founded in 2012, Boomerang Commerce offers the first prescriptive analytics suite for omni-channel retailers. Seven of the top 50 retailers rely on its Retail Solutions Suite, which delivers decision recommendations that enable retailers to proactively compete and boost profits at scale. Built by a team from Amazon, McKinsey, MIT and Stanford, Boomerang applies machine learning and big data analytics to massive data quantities across digital and brick-and-mortar channels, and it derives superior insights and actionable business recommendations to transform business decision makers into retail ninjas. For more detail, please visit www.boomerangcommerce.com . All product and company names herein are trademarks of their registered owners.", "external_links": [], "published": "2015-10-05T15:44:00.000+03:00", "crawled": "2015-10-05T16:53:04.169+03:00", "highlightTitle": ""}