{"organizations": ["US Coast Guard", "Gulf of Mexico"], "uuid": "d55f7675fc419fd4d8cb78c0fcd52019f5672ee3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/hires/2015/draftrestora.jpg", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-gulf-mexico-disaster.html", "country": "US", "title": "Draft restoration plans for Gulf of Mexico following 2010 disaster", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Draft restoration plans for Gulf of Mexico following 2010 disaster", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T17:50:00.000+03:00", "replies_count": 0, "uuid": "d55f7675fc419fd4d8cb78c0fcd52019f5672ee3"}, "author": "", "url": "http://phys.org/news/2015-10-gulf-mexico-disaster.html", "ord_in_thread": 0, "title": "Draft restoration plans for Gulf of Mexico following 2010 disaster", "locations": ["United States", "Macondo", "Gulf of Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Draft restoration plans for Gulf of Mexico following 2010 disaster October 6, 2015 The BP Macondo Deepwater Horizon oil rig exploded on April 20, 2010. Approximately 3.19 million barrels (134 million gallons) of oil were released into the Gulf of Mexico, making it by far the largest offshore oil spill in United States history. Credit: US Coast Guard \nNOAA and the other Deepwater Horizon Natural Resource Trustees today released 15-year comprehensive, integrated environmental ecosystem restoration plans for the Gulf of Mexico in response to the April 20, 2010 Deepwater Horizon oil rig explosion and spill. Implementing the plan will cost up to $8.8 billion. The explosion killed 11 rig workers and the subsequent spill lasted 87 days and impacted both human and natural resources across the Gulf. \nThe Draft Deepwater Horizon Oil Spill Draft Programmatic Damage Assessment and Restoration Plan and Draft Programmatic Environmental Impact Statement allocates Natural Resource Damage Assessment monies that are part of a comprehensive settlement agreement in principle among BP, the U.S. Department of Justice on behalf of federal agencies, and the five affected Gulf States announced on July 2, 2015. The Department of Justice lodged today in U.S. District Court a consent decree as part of the more than $20 billion dollar settlement. \nIn the draft plan, the Trustees provide documentation detailing impacts from the Deepwater Horizon oil spill to: wildlife, including fish, oysters, plankton, birds, sea turtles, and marine mammals across the Gulf habitat, including marshes, beaches, floating seaweed habitats, water column, submerged aquatic vegetation, and ocean-bottom habitats recreational activities including boating, fishing, and going to the beach \nThe Trustees determined that \"overall, the ecological scope of impacts from the Deepwater Horizon spill was unprecedented, with injuries affecting a wide array of linked resources across the northern Gulf ecosystem.\" As a result of the wide scope of impacts identified, the Trustees \"have determined that the best method for addressing the injuries is a comprehensive, integrated, ecosystem restoration plan .\" \nBoth the consent decree and the draft plan are available for 60 days of public comment. The Trustees will address public comment in adopting a final plan. For the consent decree, once public comment is taken into account the court will be asked to make it final. \nPublic comments on the draft plan will be accepted at eight public meetings to be held between October 19 and November 18 in each of the impacted states and in Washington, DC. Comments will also be accepted online and by mail sent to: U.S. Fish and Wildlife Service, P.O. Box 49567, Atlanta, GA 30345. The public comment period will end on December 4, 2015. Bottlenose dolphins, who had to swim through heavily oiled waters, suffered serious reproductive and adverse health effects from the oil., some of which are still being determined. Credit: NOAA \nThe Trustees are proposing to accept this settlement, which includes, among other components, an amount to address natural resource damages of $8.1 billion for restoration and up to $700 million for addressing unknown impacts or for adaptive management. These amounts include the $1 billion in early restoration funds which BP has already committed. \n\"NOAA scientists were on the scene from day one as the Deepwater spill and its impacts unfolded. NOAA and the Trustees have gathered thousands of samples and conducted millions of analyses to understand the impacts of this spill,\" said Kathryn D. Sullivan, Ph.D., undersecretary of commerce for oceans and atmosphere and NOAA administrator. \"The scientific assessment concluded that there was grave injury to a wide range of natural resources and loss of the benefits they provide. Restoring the environment and compensating for the lost use of those resources is best achieved by a broad-based ecosystem approach to restore this vitally important part of our nation's environmental, cultural and economic heritage.\" \nNOAA led the development of the 1,400 page draft damage assessment and restoration plan, with accompanying environmental impact statement, in coordination with all of the natural resource Trustees. The draft plan is designed to provide a programmatic analysis of the type and magnitude of the natural resources injuries that have been identified through a Natural Resource Damage Assessment conducted as required by the Oil Pollution Act of 1990 and a programmatic restoration plan to address those injuries. Alternatives approaches to restoration are evaluated in the plan under the Oil Pollution Act and the National Environmental Policy Act. \nSpecific projects are not identified in this plan, but will be proposed in future project-specific restoration proposals. The Trustees will ensure that the public is involved in their development through public notice of proposed restoration plans, opportunities for public meetings, and consideration of all comments received. \nThe draft plan has an array of restoration types that address a broad range of impacts at both regional and local scales. It allocates funds to meet five restoration goals, and 13 restoration types designed to meet these goals. \nThe five overarching goals of the proposed plan are to: restore and conserve habitat replenish and protect living coastal and marine resources provide and enhance human use recreational activities provide for long term monitoring, adaptive management, and administrative oversight of restoration efforts. \nThe 13 proposed restoration activities are: Restoration of wetlands, coastal, and nearshore habitats Habitat projects on federally managed lands Nutrient reduction Fish and water column invertebrates Sturgeon", "external_links": [], "published": "2015-10-06T17:50:00.000+03:00", "crawled": "2015-10-06T17:53:16.680+03:00", "highlightTitle": ""}