{"organizations": [], "uuid": "b05c8ecb68fb518f28debfee3f17336bf02b7e3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151021005785/en/Bitdefender-Mobile-Security-Launches-Snap-Photo-Stop", "country": "US", "title": "Bitdefender Mobile Security Launches Snap Photo to Stop Snoops, Smart Unlock to Make Life Simpler", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Bitdefender Mobile Security Launches Snap Photo to Stop Snoops, Smart Unlock to Make Life Simpler", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:34:00.000+03:00", "replies_count": 0, "uuid": "b05c8ecb68fb518f28debfee3f17336bf02b7e3a"}, "author": "", "url": "http://www.businesswire.com/news/home/20151021005785/en/Bitdefender-Mobile-Security-Launches-Snap-Photo-Stop", "ord_in_thread": 0, "title": "Bitdefender Mobile Security Launches Snap Photo to Stop Snoops, Smart Unlock to Make Life Simpler", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bitdefender Mobile Security Launches Snap Photo to Stop Snoops, Smart Unlock to Make Life Simpler \nNew features take pics of thieves in the act, allow easier app access October 21, 2015 08:34 AM Eastern Daylight Time \nBUCHAREST, Romania--( BUSINESS WIRE )--Bitdefender, the creator of innovative online security software, has upgraded its award-winning Bitdefender Mobile Security & Antivirus by giving it the power to photograph snoops and thieves in the act and allowing you to more easily access your apps when on a trusted network. \nWith the new Snap Photo feature, your device will automatically take a mugshot of anybody trying to access your apps without the PIN numbers, nailing the snoop’s identity as well as the time and date of the failed access. \nSmart Unlock, meanwhile, makes your life a little bit simpler by disabling PIN codes when you are on a trusted network, such as at home, eliminating a cumbersome step currently needed to access your apps. \n“We approached this latest upgrade to Bitdefender Mobile Security with the intention of further enhancing its strongest features – ironclad security and seamless ease of use,” said Bitdefender's Chief Security Strategist Catalin Cosoi. “The world’s strongest and most user-friendly mobile security software is now even stronger and friendlier. \nSmart Unlock and Snap Photo add to an already powerful array of capabilities in Bitdefender Mobile Security, such as Privacy Advisor, which shows you how your apps handle your privacy, App Lock that allows you to decide who can access your private information and, of course, the world’s best antivirus, rated Best Protection by independent analysis firm AV-TEST in September, 2015. \nThe New Bitdefender Mobile Security maintains the ultra-low battery impact that has been a cornerstone of the company’s software for mobile devices since it was first created, meaning it has virtually no effect on battery life. \nThe sleek interface also makes it easier for users to enjoy features such as the remote-locking Anti-Theft, WearON that works with a smart watch to make your phone scream when it’s out of sight, and Web Security that ensures safe browsing. \nAbout Bitdefender \nBitdefender is a global security technology company that delivers solutions in more than 100 countries through a network of value-added alliances, distributors and reseller partners. Since 2001, Bitdefender has consistently produced award-winning business and consumer security technology, and is a leading security provider in virtualization and cloud technologies. Through R&D, alliances and partnership teams, Bitdefender has elevated the highest standards of security excellence in both its number-one-ranked technology and its strategic alliances with the world’s leading virtualization and cloud technology providers. More information is available at http://www.bitdefender.com/ . Contacts", "external_links": [], "published": "2015-10-21T15:34:00.000+03:00", "crawled": "2015-10-21T15:48:00.503+03:00", "highlightTitle": ""}