{"organizations": [], "uuid": "b8eec1e8a441b09efe62acc4582687af5f03a303", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143243/bo-dietl-reflects-u-s-sailors-learning-navigate-stars-again", "country": "US", "title": "Bo Dietl Reflects on U.S. Sailors Learning to Navigate by the Stars Again", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Bo Dietl Reflects on U.S. Sailors Learning to Navigate by the Stars Again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T00:32:00.000+03:00", "replies_count": 0, "uuid": "b8eec1e8a441b09efe62acc4582687af5f03a303"}, "author": "admin", "url": "http://www.freshnews.com/news/1143243/bo-dietl-reflects-u-s-sailors-learning-navigate-stars-again", "ord_in_thread": 0, "title": "Bo Dietl Reflects on U.S. Sailors Learning to Navigate by the Stars Again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Beau Dietl & Associates \nNEW YORK, Oct. 20, 2015 /PRNewswire-iReach/ -- Beau Dietl & Associates is one of the leading NY private investigator firms. The company assists private clients, corporations and attorneys with high-stakes investigations related to financial fraud, asset searches, employee background screening and other surveillance services. \nPhoto - http://photos.prnewswire.com/prnh/20151020/278697LOGO \nThese days it seems that cybersecurity and the fear of hackers is at an all time high. This fear has caused many official institutions to revert to old techniques that don't require high tech equipment. For example, a couple of years ago local news outlets reported that a security force that guards high-ranking Russian officials reverted to using typewriters after revelations about U.S. digital spying capabilities. It is now being revealed that the U.S. Navy is rebuilding a celestial navigation training program for all enlisted ranks. \nThe Naval Academy cut celestial navigation training nearly 20 years ago, and the practice ended at large in about 2006. The Navy was mostly focusing on computer navigation, simply because it was much easier and much more efficient. However, due to the growing fear of cyber attacks, the Navy is bringing back celestial navigation training. \nBringing back this old technique is a fail-safe for the U.S. Navy. Computers will obviously not be taken out of the equation; rather they are looking for ways to integrate both the old and the new practices. Being knowledgeable on celestial navigation is important for the Navy because computers are always vulnerable to hackers and to breaking down. While computer navigation can still be the primary practice, celestial navigation is a great back up if/when computers fail or fall victim to cyber attacks. \nBeau Dietl & Associates is a premier private investigation company based in New York City with offices in New Jersey, Florida and California. With more than 30 years of service in the private investigations and security sector, our company differentiates itself from others by one word--experience. \nOur goal is to provide the most comprehensive and thorough investigations, along with personalized service to exceed clients' needs. As an internationally recognized firm, Beau Dietl & Associates maintains a global network of investigative and security-based resources. \nBDA has been retained by countless law firms throughout the country, and has assisted these firms and their clients in a variety of cases including asset searches, lifestyle profiles, matrimonial disputes, process service, interviews, witness location and more. Beau Dietl & Associates will strive to provide you with the same quality of excellence on which we have built our brand. \nMedia Contact: Jaclyn Dietl, Beau Dietl & Associates, (212) 557-3334, jaclyn@investigations.com \nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com \nSOURCE Beau Dietl & Associates", "external_links": [], "published": "2015-10-21T00:32:00.000+03:00", "crawled": "2015-10-21T09:07:04.858+03:00", "highlightTitle": ""}