{"organizations": [], "uuid": "798d3ddc19ba0c25bbd81d1faef1e5c6a004c71d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135326/cea-airbnb-deserves-home-d-c-", "country": "US", "title": "CEA: Airbnb Deserves a Home in D.C.", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "CEA: Airbnb Deserves a Home in D.C.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T18:04:00.000+03:00", "replies_count": 0, "uuid": "798d3ddc19ba0c25bbd81d1faef1e5c6a004c71d"}, "author": "admin", "url": "http://www.freshnews.com/news/1135326/cea-airbnb-deserves-home-d-c-", "ord_in_thread": 0, "title": "CEA: Airbnb Deserves a Home in D.C.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Consumer Electronics Association (CEA) \nARLINGTON, Va. -- (BUSINESS WIRE) -- The following statement is attributed to Gary Shapiro, president and CEO, Consumer Electronics Association (CEA)®, regarding the D.C. City Council's proposals to heavily regulate Airbnb: \n\"Airbnb helps D.C. visitors find affordable accommodations, while allowing D.C. citizens to earn supplemental income while sharing their love of this city. These ill-considered proposals will stifle innovation and prevent necessary competition in the hospitality industry. Legislating higher prices and fewer choices for D.C. citizens and visitors is atrocious public policy and will harm D.C.'s hard-won reputation as a tech-friendly, pro-business city. On behalf of our 150 Washington-area employees and our 2,000-plus corporate members who rely on a variety of accommodations when they come to town, we ask to embrace - not stifle - new business platforms such as Airbnb.\" \nIn 2014, the D.C. City Council approved ridesharing services such as Uber and Lyft, earning D.C. a top tier ranking in CEA's Innovation Scorecard, which reflects states' evolving policies toward innovation. The complete Scorecard, featuring category rankings, state-by-state profiles and an explanation of CEA's methodology can be found at CE.org/scorecard . \nAbout CEA: \nThe Consumer Electronics Association (CEA) is the technology trade association representing the $285 billion U.S. consumer electronics industry. More than 2,000 companies enjoy the benefits of CEA membership, including legislative and regulatory advocacy, market research, technical training and education, industry promotion, standards development and the fostering of business and strategic relationships. CEA also owns and produces CES – The Global Stage for Innovation. All profits from CES are reinvested into CEA’s industry services. Find CEA online at CE.org , InnovationMovement.com and on social . \nUPCOMING EVENTS", "external_links": [], "published": "2015-10-01T18:04:00.000+03:00", "crawled": "2015-10-01T19:36:50.851+03:00", "highlightTitle": ""}