{"organizations": ["Clinical Trial Management and Electronic Data Collection", "SCDM", "Society for Clinical Data Management", "EDC", "Google", "Crucial Life Sciences Data Solutions"], "uuid": "847c7a6b88e0660835eab47901cce980e2ad1fd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/Clinical-Studio-Wins-Prestigious-Technology-Innovation-Award-at-SCDM-Conference-2015-34340-1/", "country": "US", "title": "Clinical Studio Wins Prestigious Technology Innovation Award at SCDM Conference 2015", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Clinical Studio Wins Prestigious Technology Innovation Award at SCDM Conference 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:05:00.000+03:00", "replies_count": 0, "uuid": "847c7a6b88e0660835eab47901cce980e2ad1fd6"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/Clinical-Studio-Wins-Prestigious-Technology-Innovation-Award-at-SCDM-Conference-2015-34340-1/", "ord_in_thread": 0, "title": "Clinical Studio Wins Prestigious Technology Innovation Award at SCDM Conference 2015", "locations": ["D.C", "Washington", "Washington D.C."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Reno", "Paul Grady"], "text": "Date:10/14/2015 Washington D.C. (PRWEB) October 14, 2015 Clinical Studio, a Clinical Trial Management and Electronic Data Collection system developed by Crucial Life Sciences Data Solutions (CLSDS), has won the annual Society for Clinical Data Management (SCDM) NextGen Technology Innovation (TIA) Award, presented as part of SCDM’s 2015 annual conference in Washington, D.C. The SCDM Award recognizes breakthrough innovations which use advanced technologies or processes and provide real-life application for use in clinical research. CLSDS is dedicated to empowering Clinical Professionals with sophisticated yet affordable and accessible EDC functionality. CLSDS has developed mobile apps for both the iOS and Android platforms that can be used to collect data and conduct entire clinical research studies with mobile phones and tablets. Clinical Studio allows novice users to create complex case report forms that are accessible from 98% of the smart phones and tablets in the world via the free Clinical Studio app downloaded from either the Apple Store or Google Play. By utilizing this ultra-modern technology, Clinical Professionals can conduct far more efficient studies resulting in significant cost savings and greatly reduced study duration. Paul Grady, CEO of Crucial Life Sciences Data Solutions, commented about winning the Society for Clinical Data Management (SCDM) NextGen Technology Innovation (TIA) Award: “The potential reduction in Clinical Research costs can be as high as 80%, while getting your product to market in half the time. Companies who adopt this technology will not only be more competitive, but also provide society a great service, as healthcare will become more available to those who need it most. We all have the right to be healthy and this type of technology gets us closer to the goal of providing healthcare for all. This technology is the future. The only question for companies is: Do you want to integrate this technology proactively or wait for your competition and then implement it reactively?” “Clinical Studio is the only product that is conducting 100% paperless studies. These studies capture all data at its source, eliminating a very time consuming and extremely expensive process known as Source Document Verification. In addition, when anomalies show up in the data, the system delivers communications via push notification technology to Data Managers and other Clinical Professionals. This is the future of clinical research and it is available today.” About Clinical Studio: A proven product of Crucial Life Sciences Data Solutions, Clinical Studio fully supports all phases of clinical research studies. The platform also represents a new paradigm in access to electronic data capture and management. Its cloud-based, software-as-a-service format enables users to access the system tools and functionality quickly and on a monthly subscription basis. Offering both instructional-only and commercial use of the software, Clinical Studio is dedicated to increasing quality, reducing costs, and increasing EDC usage for sponsors, CROs, academic institutions, independent investigators, and more. The company openly posts its price schedule for direct, web-based purchase of the Clinical Studio software. Moreover, free evaluative and/or small pilot study subscriptions, plus free training opportunities throughout the process, empower data managers to hone their skills continually and directly influence the clinical research strategy and implementation. Contact: 888-753-4777; http://www.clinicalstudio.com ; info(at)clinicalstudio(dot)com 9190 Double Diamond Parkway, Suite 113, Reno, NV 89521 \nRead the full story at http://www.prweb.com/releases/2015/10/prweb13018246.htm . '/>\"/>", "external_links": [], "published": "2015-10-14T22:05:00.000+03:00", "crawled": "2015-10-14T16:19:46.594+03:00", "highlightTitle": ""}