{"organizations": [], "uuid": "0d1591130021b09babf70e91a3335b7bc5398964", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30307410/crowd-companies-2015-awards-recognize-excellence-in-the-collaborative-economy", "country": "US", "title": "Crowd Companies 2015 Awards Recognize Excellence in the Collaborative Economy", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Crowd Companies 2015 Awards Recognize Excellence in the Collaborative Economy - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:11:00.000+03:00", "replies_count": 0, "uuid": "0d1591130021b09babf70e91a3335b7bc5398964"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30307410/crowd-companies-2015-awards-recognize-excellence-in-the-collaborative-economy", "ord_in_thread": 0, "title": "Crowd Companies 2015 Awards Recognize Excellence in the Collaborative Economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Winning brands include Autodesk, BMW, Intuit, Swisscom, and Whole Foods, in the areas of on-demand integration, crowd collaboration, brand innovation, and enablement of makers and sharing marketplaces.\nSan Francisco, California\nCrowd Companies, an innovation council focused on the collaborative economy movement, hosted the inaugural Crowd Companies Awards on Oct. 6, 2015, in San Francisco as part of The Main Event 2015. The Crowd Companies Awards honors council members that have surmounted challenges and exhibited excellence in collaborative economy program deployment.\nThe 2015 Crowd Companies Awards recipients are: Autodesk (Maker Enablement Award); BMW (Brand Innovation Award); Intuit (Marketplace Enablement Award); Swisscom (Crowd Collaboration Award); and Whole Foods Market (On-Demand Integration Award). Award winners must have proven business results from collaborative economy program deployment and have a current Crowd Companies council membership.\n2015 CROWD COMPANIES AWARDS RECIPIENTS\nAutodesk: Maker Enablement Award. The Maker Enablement Award recognizes Autodesk’s empowering the Maker Movement through offering access to its design software, tools, and programs to the creative masses. Through providing free software and curriculum to schools, educators, and students; offering 17 personal design and creativity apps; inspiring maker communities through Instructables and Creative Market; and offering an artist-in-residence program at its San Francisco workshop, Autodesk has showcased its commitment to furthering the power of makers to design, build, and innovate.\nBMW: Brand Innovation Award with DriveNow Car Sharing Program. The Brand Innovation Award recognizes BMW’s provision of car-sharing services through its DriveNow program. Members of BMW DriveNow use the brand’s mobile app or website to locate BMWs (fueled and electric) available for on-demand rental at nearby dealership locations in San Francisco, Vienna, London, and many German cities. By actively becoming a supportive member of the Collaborative Economy, BMW has publicly indicated that the German DriveNow car-sharing program is profitable.\nIntuit: Marketplace Enablement Award. The Marketplace Enablement Award recognizes Intuit’s commitment to the rapidly expanding marketplace of freelancers and independent contractors within the Collaborative Economy. Its launch of QuickBooks Online Self-Employed enables contractors to manage business and personal finances, handle taxes throughout the year, and easily meet compliance requirements.\nSwisscom: Crowd Collaboration Award with Swisscom Friends. The Crowd Collaboration Award recognizes Swisscom’s utilization of the crowd to bolster its customer service efforts in a free online community. Swisscom Friends, run on Mila, solves customer needs by connecting them with nearby tech-savvy professionals to provide support for small product/installation issues. In a public interview, the company announced results from Swisscom Friends, including: offloaded support requests from traditional customer service department, enhanced self-care, increased customer satisfaction, and the potential for low-pressure sales upgrades.\nWhole Foods Market: On-Demand Integration Award. The On-Demand Integration Award recognizes Whole Foods’ partnership with the Instacart marketplace to provide on-demand grocery delivery services to its customers in 15 U.S. cities. Through this partnership, Whole Foods Market offers its customers the convenience of online grocery shopping, delivery, and pickup without having to handle the logistics themselves. Whole Foods’ partnership with Instacart has resulted in more than $50 million in sales from 160 stores nationwide, and in-store Instacart ads have created a higher lift of product sales.\nCOLLABORATIVE ECONOMY PROGRAM SUBMISSION FOR THE 2016 CROWD COMPANIES AWARDS\nCompanies and organizations interested in submitting their collaborative economy programs for consideration in 2016’s Crowd Companies Awards must fulfill the following criteria: 1. Be a current member of the Crowd Companies innovation council, 2. Have deployed a program in the collaborative economy, and 3. Proven ROI as a result of their program or initiative. Interested companies can visit CrowdCompanies.com for more information on membership.\nABOUT CROWD COMPANIES\nCrowd Companies, launched December 2013 by Jeremiah Owyang, is a members association that connects large companies to leaders, startups, and communities in the collaborative economy, sharing economy, and maker movement. For more information, visit: http://crowdcompanies.com/ .\n //www.prweb.com/releases/2015/10/prweb13031171.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13031171.htm", "http://crowdcompanies.com/"], "published": "2015-10-20T21:11:00.000+03:00", "crawled": "2015-10-20T23:17:34.814+03:00", "highlightTitle": ""}