{"organizations": [], "uuid": "d4d5d4d23d5da23635580e05f8aad39af19d3436", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.sky.com", "main_image": "http://media.skynews.com/media/images/generated/2014/10/8/340680/default/v1/452347587-1-1600x900.jpg", "site_section": "http://news.sky.com/sky-news/rss/technology/rss.xml", "section_title": "Tech News - Latest Technology and Gadget News | Sky News", "url": "http://news.sky.com/story/1572348/amazon-rejects-tough-workplace-culture-claim", "country": "IL", "title": "Amazon Rejects Tough Workplace Culture Claim", "performance_score": 1, "site": "sky.com", "participants_count": 1, "title_full": "Amazon Rejects Tough Workplace Culture Claim", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:32:00.000+03:00", "replies_count": 0, "uuid": "d4d5d4d23d5da23635580e05f8aad39af19d3436"}, "author": "news.sky", "url": "http://news.sky.com/story/1572348/amazon-rejects-tough-workplace-culture-claim", "ord_in_thread": 0, "title": "Amazon Rejects Tough Workplace Culture Claim", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon has hit back at The New York Times after it published a scathing front-page article saying employees are treated so badly that they cry at their desks. Bizarrely, it has taken the internet giant two months to respond publicly to the broadsheet's report that it was \"conducting an experiment in how far it can push white-collar workers\".\nOne of the most shocking lines in the original report was the claim from a former employee that \"nearly every person I worked with, I saw cry at their desk\".\nBut in a 1,300-word rebuttal Amazon says the employee who made the claim had previously been forced out after an attempt to defraud vendors was discovered.\nIt said another staff member who claimed to have been \"strafed\" by the company's employee feedback tools had only received three pieces of feedback during her time at the company - all of which included positives.\nIt said a third staff member who claimed he had been berated in a performance review had actually been sent a report beginning with the words: \"Overall, you did an outstanding job this past performance year.\"\nThe response was written by Jay Carney, a senior vice president at Amazon and former White House press secretary.\nHe added: \"It's worth noting that (The New York Times has) now twice in less than a year been called out by their own public editor for bias and hype in their coverage of Amazon.\"\nHe concluded: \"What we do know is, had the reporters checked their facts, the story they published would have been a lot less sensational, a lot more balanced, and, let's be honest, a lot more boring.\"\nAmazon said it had attempted to have some of the claims in the Times' original article corrected, but said when the paper did not do so it decided to publish its own response.\nSky News has contacted The New York Times for a response.", "external_links": [], "published": "2015-10-19T19:32:00.000+03:00", "crawled": "2015-10-19T18:44:38.232+03:00", "highlightTitle": ""}