{"organizations": [], "uuid": "798851612309a89fd6905f49b6283e57ecbd74cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-6ac178bba08bbb4c8736e7624c9c3e59.jpg", "site_section": "http://washingtonexaminer.com/rss/technology", "section_title": "WashingtonExaminer.com RSS - technology", "url": "http://www.washingtonexaminer.com/dear-facebook-user-youre-being-hacked/article/2574545?custom_click=rss", "country": "US", "title": "Dear Facebook user: You're being hacked", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Dear Facebook user: You're being hacked | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:14:00.000+03:00", "replies_count": 0, "uuid": "798851612309a89fd6905f49b6283e57ecbd74cb"}, "author": "Rudy Takala", "url": "http://www.washingtonexaminer.com/dear-facebook-user-youre-being-hacked/article/2574545?custom_click=rss", "ord_in_thread": 0, "title": "Dear Facebook user: You're being hacked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook has begun notifying users when foreign governments are trying to hack them.\n\"Starting today, we will notify you if we believe your account has been targeted or compromised by an attacker suspected of working on behalf of a nation-state,\" the company wrote in an Oct. 16 blog post.\n\"While we have always taken steps to secure accounts that we believe to have been compromised, we decided to show this additional warning if we have a strong suspicion that an attack could be government-sponsored,\" the message said. \"We do this because these types of attacks tend to be more advanced and dangerous than others, and we strongly encourage affected people to take the actions necessary to secure all of their online accounts.\"\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ The social networking site didn't say what prompted the new policy. However, after a breach of the Office of Personnel Management linked to the Chinese government resulted in the theft of classified personnel files on more than 20 million people, cybersecurity experts have been concerned that the next step would be to begin targeting social media accounts.\nMore from the Washington Examiner Press defends Bush from Trump's 9/11 tweak \"It is grotesquely wrong to suggest that George W. Bush is in any way to blame for the 9/11 attacks.\"\nBy Eddie Scarry • 10/21/15 12:01 AM If the data that was stolen from the OPM didn't provide a foreign actor with the information they sought about a target's personal life, they could still use that information to leverage their way into social media accounts on a massive scale. The 126-page SF-86 form contained in the database not only includes personal information on those who filled it out, it also contains information on all of their family members and many of their associates, all of whom are at risk of being targeted as a result.\nAs part of an awareness campaign called \"raise your shield,\" the National Counterintelligence and Security Center is spending October emphasizing the vulnerabilities faced by social media users.\n\"To protect the integrity of our methods and processes, we often won't be able to explain how we attribute certain attacks to suspected attackers. That said, we plan to use this warning only in situations where the evidence strongly supports our conclusion,\" Facebook concluded.\n ", "external_links": [], "published": "2015-10-20T22:14:00.000+03:00", "crawled": "2015-10-21T08:46:11.020+03:00", "highlightTitle": ""}