{"organizations": [], "uuid": "b8712daf85359f4680d100e0f571117fc92db99b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mb.com.ph", "main_image": "http://www.mb.com.ph/wp-content/themes/city-desk/images/fb-image_200x200.jpg", "site_section": "http://www.mb.com.ph/category/technews/technology-news/", "section_title": "mb.com.ph | Philippine News | Archive | Technology", "url": "http://www.mb.com.ph/sengled-bringing-life-to-light/", "country": "CA", "title": "Sengled: Bringing life to light", "performance_score": 0, "site": "mb.com.ph", "participants_count": 1, "title_full": "Sengled: Bringing life to light | mb.com.ph | Philippine News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "b8712daf85359f4680d100e0f571117fc92db99b"}, "author": "October 12, 2015", "url": "http://www.mb.com.ph/sengled-bringing-life-to-light/", "ord_in_thread": 0, "title": "Sengled: Bringing life to light", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 12, 2015 Sengled is among the top LED lighting, pioneering research, development and manufacturing in smart lighting to create bright new ideas that make consumers’lives a little easier. By integrating consumer electronics with energy-saving LED smart bulbs, Sengled provides consumers with app-controlled, intuitive and ecofriendly products that bring smarthome capabilities to every room.\nBased in Shanghai with operations in Europe and North America, Sengled integrates consumer electronics with energy-saving LED lighting, creating products to that reduce clutter and expand smart home capabilities to every room. Sengled is the global leader in intelligent illumination, producing a full range of app-controlled, intuitive, eco-friendly products.\nWith a strong focus on the daily lives of people, Sengled is dedicated to the idea that the light bulb can be continuously reinvented to make life better. Sengled constantly innovates; the company currently holds nearly 200 patents and has more than 10 years of experience in the LED illumination research, development and manufacturing sector.\nPulse Solo works similarly to Pulse, but functions independently, without any additional satellites. You can still enjoy the energy efficiency of a dimmable LED light combined with the high-quality audio of a JBL Bluetooth speaker, and adjust both lighting and sound from our app on an iOS or Android device.\nIt combines dual 3-watt speakers to provide stereo sound effect and ideal for desk or night stand lamps. It is available in multiple socket and voltage options just twist into any light socket for a built-in power source. Pulse Solo can be purchased in all Globe GEN 3 Stores nationwide.", "external_links": ["http://i.po.st/static/v3/post-widget.js#publisherKey=4qcr4d26tnrf260rqrda&retina=true"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-11T20:56:20.104+03:00", "highlightTitle": ""}