{"organizations": [], "uuid": "f8735ea4001f6406ea9a64f50746ed8776feb9d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30314261/ramco-systems-wins-innovation-award-at-the-2015-isg-paragon-awards", "country": "US", "title": "Ramco Systems wins Innovation Award at the 2015 ISG Paragon Awards", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Ramco Systems wins Innovation Award at the 2015 ISG Paragon Awards - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T16:11:00.000+03:00", "replies_count": 0, "uuid": "f8735ea4001f6406ea9a64f50746ed8776feb9d1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30314261/ramco-systems-wins-innovation-award-at-the-2015-isg-paragon-awards", "ord_in_thread": 0, "title": "Ramco Systems wins Innovation Award at the 2015 ISG Paragon Awards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The ISG Paragon Awards are presented to organizations that display outstanding leadership and innovation.\nSydney, Australia/ Chennai, India (PRWEB UK) 21 October 2015\nRamco Systems , today announced that it has won the “Best Sourcing Innovation” Award, at the 2015 ISG Paragon Awards for Australia and New Zealand. The Paragon Awards were established by ISG (Information Services Group), a leading global advisory firm, to celebrate and promote relationships within the sourcing community that have demonstrated high-performance leadership and best practices in the sourcing and service management fields.\nRamco along with Norske Skog Australasia nominated the Cloud ERP integrated with Asset Management implementation for the award.\nRamco entered the Australian market in 2012 and within a short span has made a significant progress in the enterprise applications space with its ERP, HCM and Aviation offerings.\nAcknowledging the award, Mr. Virender Aggarwal, CEO, Ramco Systems, said, “It’s a delightful moment for being recognized for innovation. Being a nimble David fighting the Goliaths’ on the global turf required that we constantly stay ahead with our innovations. Ramco prides itself in bringing technological innovations that have a quantifiable impact on the clients’ business. From being an early adopter of Cloud technology to embedding in-memory computing, bringing true mobility to integrating with email platform with Mail IT; the list is endless. This award reinforces our commitment to being an innovative enterprise cloud product company.”\nRamco’s Innovation lab has been churning out cool new features such as Mail It – a feature which enables users to transact with the application by just sending an email; HUB It - a one screen does it all concept built to address all activities of a user; Thumb It – mobility redefined and Prompt It – a cognitive ability which will let the system auto prompt you with options for your decision.\nThe award was presented during the ISG 2015 ANZ Paragon Awards dinner, held at the Museum of Contemporary Art Australia in Sydney on October 8, 2015. The ISG Paragon Awards are presented to organizations that display outstanding leadership and innovation.\nRead ISG’s Official PR announcing winners of 2015 ANZ Paragon Awards, HERE\n //www.prweb.com/releases/2015/10/prweb13035044.htm\n ", "external_links": ["http://www.isg-one.com/web/media-center/press/151008-AU.asp", "http://www.prweb.com/releases/2015/10/prweb13035044.htm"], "published": "2015-10-21T16:11:00.000+03:00", "crawled": "2015-10-23T07:38:59.659+03:00", "highlightTitle": ""}