{"organizations": [], "uuid": "f3d7de6aa2597ecf9bcaea5ba4e2a2fcee87fd62", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1138586/supermicro-provides-first-quarter-financial-update-and-schedules-conference-call-and-w", "country": "US", "title": "Supermicro® Provides First Quarter Financial Update and Schedules Conference Call and Webcast for First Quarter Fiscal 2016 Financial Results", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Supermicro® Provides First Quarter Financial Update and Schedules Conference Call and Webcast for First Quarter Fiscal 2016 Financial Results", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T00:00:00.000+03:00", "replies_count": 0, "uuid": "f3d7de6aa2597ecf9bcaea5ba4e2a2fcee87fd62"}, "author": "admin", "url": "http://www.freshnews.com/news/1138586/supermicro-provides-first-quarter-financial-update-and-schedules-conference-call-and-w", "ord_in_thread": 0, "title": "Supermicro® Provides First Quarter Financial Update and Schedules Conference Call and Webcast for First Quarter Fiscal 2016 Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Super Micro Computer, Inc. \nSAN JOSE, Calif. -- (BUSINESS WIRE) -- Super Micro Computer, Inc. (NASDAQ: SMCI ) , a global leader in high-performance, high-efficiency server, storage technology and green computing, today provided preliminary information regarding its financial results for the first fiscal quarter ended September 30, 2015. \nThe company also announced that it will release first quarter fiscal 2016 financial results on Thursday, October 22, 2015, immediately after the close of regular trading, followed by a teleconference beginning at 2:00 p.m. (Pacific Time). \nThe company now anticipates that it will report revenue for its first quarter of fiscal 2016 in the range of $529 million to $530 million. This compares to the company’s previous guidance range of $520 million to $580 million. \nNon-GAAP gross margin is expected to be approximately 15.6% to 15.7%. \nThe company anticipates that it will report non-GAAP operating expenses for first fiscal quarter between $2.0 million and $3.0 million higher than the fourth fiscal quarter of 2015. The increase in expenses was primarily due to higher compensation expenses and headcount increases to support new technologies and higher legal and other expenses associated with our previously disclosed review of certain marketing expenses. \nThe company also anticipates that its non-GAAP earnings per share will be in a range of $0.44 to $0.45. This compares to the company’s previous guidance of $0.49 to $0.59. \nThe company ended the first quarter of fiscal 2016 with approximately $113.6 million in cash and cash equivalents, and short and long term investments compared to $98.1 million at the end of fourth quarter of fiscal 2015. \n“Stronger seasonal effects combined with weaker Europe and Asia activity, and customer push outs led to our revenue being at the lower end of our guidance. The pattern of seasonally weak September and March quarters as compared to stronger June and December quarters continues,” said Charles Liang, Chairman and CEO. “We continue to maintain our full year expectations for revenue growth for fiscal 2016 and remain confident that Supermicro will continue to gain market share and grow multiple times the industry growth rate led by growth in storage, cloud computing, HPC and enterprise. We will provide more details on the first quarter financial performance at the time of our earnings call later this month.” \nConference Call/Webcast Information for October 22, 2015 \nSupermicro will hold a teleconference to announce its first quarter fiscal 2016 financial results on Thursday, October 22, 2015, beginning at 2:00 p.m. (Pacific Time). Those wishing to participate in the conference call should call 1-888-401-4668 (International callers dial 1-719-325-2464) a few minutes prior to the call’s start to register. The conference ID is 9354543. A replay of the call will be available through 11:59 p.m. (Eastern Time) on Thursday, November 5, 2015, by dialing 1-877-870-5176 (International callers dial 1-858-384-5517) and entering replay PIN 9354543. \nThose wishing to access the live or archived webcast via the Internet should go to the Investor Relations tab of the Supermicro website at www.Supermicro.com . \nCautionary Statement Regarding Forward Looking Statements \nStatements contained in this press release that are not historical fact may be forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Such forward-looking statements may relate, among other things, to our expected financial and operating results, our ability to build and grow Super Micro Computer, the benefits of our products and our ability to achieve our goals, plans and objectives. Such forward-looking statements do not constitute guarantees of future performance and are subject to a variety of risks and uncertainties that could cause our actual results to differ materially from those anticipated. These include, but are not limited to: our dependence on continued growth in the markets for X86, blade servers and embedded applications, increased competition, difficulties of predicting timing, introduction and customer acceptance of new products, poor product sales, difficulties in establishing and maintaining successful relationships with our distributors and vendors, shortages or price fluctuations in our supply chain, our ability to protect our intellectual property rights, our ability to control the rate of expansion domestically and internationally, difficulty managing rapid growth and general political, economic and market conditions and events. Additional factors that could cause actual results to differ materially from those projected or suggested in any forward-looking statements are contained in our filings with the Securities and Exchange Commission, including those factors discussed under the caption \"Risk Factors\" in such filings. \nAbout Super Micro Computer, Inc. \nSupermicro®, a global leader in high-performance, high-efficiency server technology and innovation is a premier provider of end-to-end green computing solutions for Data Center, Cloud Computing, Enterprise IT, Hadoop/Big Data, HPC and Embedded Systems worldwide. Supermicro's advanced Server Building Block Solutions® offer a vast array of components for building energy-efficient, application-optimized, computing solutions. Architecture innovations include Twin, TwinPro, FatTwin™, Ultra Series, MicroCloud, MicroBlade, SuperBlade®, Double-sided Storage®, Battery Backup Power (BBP®) modules and WIO/UIO. \nProducts include servers, blades, GPU systems, workstations, motherboards, chassis, power supplies, storage, networking, server management software and SuperRack® cabinets/accessories delivering unrivaled performance and value. \nFounded in 1993 and headquartered in San Jose, California, Supermicro is committed to protecting the environment through its \"We Keep IT Green®\" initiative. The Company has global logistics and operations centers in Silicon Valley (USA), the Netherlands (Europe) and its Science & Technology Park in Taiwan (Asia). \nSupermicro, FatTwin, TwinPro, SuperBlade, Double-Sided Storage, BBP, SuperRack, Building Block Solutions and We Keep IT Green are trademarks and/or registered trademarks of Super Micro Computer, Inc. \nAll other brands, names and trademarks are the property of their respective owners. \nSMCI-F View source version on businesswire.com: http://www.businesswire.com/news/home/20151008006453/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-09T00:00:00.000+03:00", "crawled": "2015-10-09T02:48:37.012+03:00", "highlightTitle": ""}