{"organizations": [], "uuid": "ca81a09116ce54aaf0e19ef5afed8532e5c67a00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newswise.com", "main_image": "", "site_section": "http://www.newswise.com/legacy/feed/channels.php?channel=41", "section_title": "Newswise Feature Channel: Technology", "url": "http://www.newswise.com/articles/view/641443/?sc=c41", "country": "US", "title": "Queen's University Belfast Research Could Revolutionise Farming in Developing World", "performance_score": 0, "site": "newswise.com", "participants_count": 1, "title_full": "Queen's University Belfast Research Could Revolutionise Farming in Developing World", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:00:00.000+03:00", "replies_count": 0, "uuid": "ca81a09116ce54aaf0e19ef5afed8532e5c67a00"}, "author": "Queen's University Belfast", "url": "http://www.newswise.com/articles/view/641443/?sc=c41", "ord_in_thread": 0, "title": "Queen's University Belfast Research Could Revolutionise Farming in Developing World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Article Next Article Queen’s University Belfast Research Could Revolutionise Farming in Developing World A brand new technology developed by researchers at Queen’s University Belfast, Northern Ireland, has the potential to reduce crop losses across the developing world. Released: 15-Oct-2015 7:00 AM EDT Contact Information \n  \nNewswise — A brand new technology developed by researchers at Queen’s University Belfast, Northern Ireland, has the potential to reduce crop losses across the developing world and boost the incomes of subsistence farmers. \nThe technology is designed to combat parasitic ‘nematodes’ - microscopic worms which infect crop plants from the soil, and are responsible for a 12.3% reduction in global agricultural productivity, a loss of around £100 billion annually. \nThe research, which involves using ‘peptide mimics’ – versions of the parasites’ own brain chemistry – to confuse the real parasites and ultimately, render them impotent, has been awarded a Phase II Grand Challenges Exploration grant of $1million from the Bill & Melinda Gates Foundation to be developed in Belfast and proceed to trials in Kenya. \nThe project will focus on banana and plantain – although in theory it could extend to other crops – which are cultivated across 130 countries, making them the eighth most produced staple in the world. The fruits are often grown by smallholders in the developing world and can account for up to 30 per cent of farmers’ income. Despite their popularity, however, the crop is highly susceptible to a variety of plant parasitic nematodes, which typically reduce yields by 30-50 per cent. \nLead researcher on the project, Dr Johnathan Dalzell from Queen’s Institute for Global Food Security said: “This project builds on our previous research where we developed a novel way of interfering with parasitic nematode host-finding behaviour. Through our lab work we have identified a family of peptide mimics, which specifically and potently interfere with their neurobiology, disorientating the parasites so they can’t find the host plant. They then die quickly through lack of food. Importantly, these peptide mimics appear to have no impact on non-target animals. This is a clean, and robust approach to parasite control. \n“Our aim is to develop a variety of approaches which harness this new technology in order to protect crops plants from these parasitic worms. We have chosen to focus on banana and plantain as these crops are highly susceptible to a range of pests and diseases, including nematodes, insects, viral and fungal pathogens. Developing a broad-spectrum nematode control strategy represents a significant challenge, especially in sub-Saharan Africa, which is a hotbed for pathogens which can break resistance strategies. This is yet another example of how Queen’s is having a global impact and is using its research findings to improve how our world functions.” \nAs a result of the Gates Foundation grant and other funding, the Queen’s-led project will proceed to glasshouse trials, in association with the International Institute for Tropical Agriculture in Nairobi, Kenya. Subsequently, field trials will be conducted and regulatory approval sought. \nFor further information, contact Queen’s University Communications Officer Una Bradley on 0044 (0)28 9097 5384 or email u.bradley@qub.ac.uk . Alternatively, contact Anne-Marie Clarke on 0044 (0)28 9097 5320 (Mon-Wed) or Michelle Cassidy on 0044 (0)28 9097 5310 (Thurs-Fri) or email comms.officer@qub.ac.uk \nNOTES TO EDITORS:• Dr Johnathan Dalzell is available for interview. Media bids to the above communications officers• Funding has been provided by the Bill & Melinda Gates Foundation, the Leverhulme Trust, the Royal Society, and Queen’s University Belfast", "external_links": [], "published": "2015-10-15T15:00:00.000+03:00", "crawled": "2015-10-15T20:24:07.160+03:00", "highlightTitle": ""}