{"organizations": [], "uuid": "d94b2be6d2e6143f7e57b4a903f6bbf7da9afa4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.industriesnews.net", "main_image": "", "site_section": "http://www.industriesnews.net/rss.php/?ind=technology", "section_title": "industriesnews.net  - Breaking Technology News latest RSS headlines", "url": "http://www.industriesnews.net/story?sid=s237201065&cid=400", "country": "US", "title": "Up Up Up Cost Per Loyal User Crosses $4 Milestone in August According to Fiksu Indexes", "performance_score": 0, "site": "industriesnews.net", "participants_count": 0, "title_full": "Up Up Up Cost Per Loyal User Crosses $4 Milestone in August According to Fiksu Indexes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T17:00:00.000+03:00", "replies_count": 0, "uuid": "d94b2be6d2e6143f7e57b4a903f6bbf7da9afa4b"}, "author": "", "url": "http://www.industriesnews.net/story?sid=s237201065&cid=400", "ord_in_thread": 0, "title": "Up Up Up Cost Per Loyal User Crosses $4 Milestone in August According to Fiksu Indexes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Up, Up, Up: Cost   August, According to Fiksu Indexes \nMarketwired Wednesday 30th September, 2015 \n  Per Loyal User (CPLU) index surpassed $4 for the first time. The figure of $4.04 represents a 36 percent rise since last month and 117 percent increase since last year. At the same time, significant year-over-year growth was observed on both the App Store Competitive Index and the Cost Per Install Index (CPI). August's results reflect heightened activity across the mobile advertising ecosystem, indicating that deep pocketed advertisers are putting ever-larger shares of their budgets into mobile, trading higher costs for greater audience precision. The takeaway for advertisers is that spending smart is a necessity to get in front of the right mobile audiences. \nOn the volume side, mobile app downloads were also on the rise. As measured by the Fiksu App Store Competitive Index, which tracks the average aggregate daily downloads of the top 200 free iOS apps, app downloads increased by 8 percent since last month to 8.1 million. This represents a 53 percent increase since last year at this time. \"Consumer demand for mobile apps is insatiable,\" writes analyst Jeremy Kressmann in eMarketer's App Marketing 2015 report. \"Smartphone and tablet users will spend more than three hours per day in-app combined in 2015 -- more than three times the average time spent per day on the mobile web.\" \nThe Cost Per Install Index (CPI) dropped slightly on iOS to $1.32, but showed a rise of 26 percent year-over-year. On Android, CPI fell to $1.91, decreasing 30 percent since last month, but increasing substantially to 103 percent from last year. The increase in Cost per Loyal user contrasted with the decreases in CPI makes it clear that competition is ramping up for fall campaigns but advertisers are struggling to get their attention, perhaps because users remain in summer mode, or perhaps because they're simply using more apps so loyalty to any one app is more difficult to establish. \n\"August demonstrates the reality of ever-increasing competition in the app marketing environment,\" said Micah Adler, CEO of Fiksu. \"Increasing costs across the landscape are nothing new, but particularly with activity surrounding new iPhones, iPads, and iOS 9 launches, marketers better be prepared for those costs to continue at or near these record high levels.If not, marketers could become acutely aware of the challenges of not reaching the right audiences.\" \nLooking ahead to next month, marketers are abuzz with concerns regarding the ad blocking introduced in iOS 9. For the most part, this won't have much impact on mobile marketers, given ad blocking is applicable solely to mobile web traffic, which only accounts for 10 percent of the time spent on mobile, and has no effect on in-app ads. However, ad blockers have been shooting to the top of the App Store charts, which shows the popularity of the concept with users, and their willingness to take extra steps to install them. \nAs for other iOS 9 changes, we anticipate this will contribute to the continued dominance of apps along with increasing opportunities to show advertisements to users. Read more about iOS 9 in the eBook, iOS 9 and the Latest Apple Devices: What Marketers Need to Know for Successful User Acquisition. Or watch for updates on the adoption of iOS 9 with our iOS launch tracker, and stay tuned for more analysis on this topic next month. \nFor Fiksu's full August analysis, visit http://www.fiksu.com/resources/fiksu-indexesanalysis. \nAbout Fiksu \nFiksu is a data-fueled mobile marketing technology company that connects brands, agencies, and app advertisers to precise audiences throughout the customer journey. Fiksu's mobile audience platform combines a massive, proprietary dataset with powerful segmentation tools to create, refresh, and reach audiences. Fiksu has led thousands of successful mobile campaigns to drive awareness, user acquisition, and re-engagement for clients such as Amazon, Disney, Activision, Coca-Cola, Electronic Arts, The New York Times, Dunkin' Donuts, and Starcom. Based in Boston, Mass., Fiksu is venture-backed by Qualcomm Ventures and Charles River Ventures. More at www.fiksu.com, @Fiksu and on the Fiksu blog. \nMedia Contacts:", "external_links": [], "published": "2015-09-30T17:00:00.000+03:00", "crawled": "2015-10-02T04:18:42.468+03:00", "highlightTitle": ""}