{"organizations": [], "uuid": "18495f45ccd1eb737290f7735a1c57a3dc3bf37d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-10/TP_21087ce7fthepeninsulanewspaper.jpg", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094384513/Simplifying-streaming-Electric-Jukebox-enters-market&src=RSS", "country": "", "title": "Simplifying streaming Electric Jukebox enters market", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Simplifying streaming Electric Jukebox enters market | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "18495f45ccd1eb737290f7735a1c57a3dc3bf37d"}, "author": "The Peninsula", "url": "http://www.menafn.com/1094384513/Simplifying-streaming-Electric-Jukebox-enters-market&src=RSS", "ord_in_thread": 0, "title": "Simplifying streaming Electric Jukebox enters market", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - The Peninsula) \n\nNEW YORK: Musicians including Robbie Williams threw their weight Wednesday behind a new streaming service that aims to bring the fast-growing sector to low-tech listeners. \nCalled Electric Jukebox the platform is a data stick that plugs into the back of a television and is then operated by a microphone-enabled remote control. \nElectric Jukebox's founders hope to appeal to listeners who would appreciate the vast possibilities of streaming -- which offers unlimited music on-demand online -- but find Internet applications cumbersome or prefer to listen from a couch in front of the TV. \nElectric Jukebox much like other streaming sites will be updated daily to offer new music and will feature mixtapes put together by artists including Williams the English pop singer of Take That fame and US folk rocker Sheryl Crow. \n\"Listening to music and sharing those experiences together is what life's all about. With headphones and iPhones we've somehow lost all that\" Crow said in a statement. \nElectric Jukebox will initially be available only in the United States and Britain at a cost of 229 or £179 which includes one year of service. \nUnlike the monthly plans of most streaming sites such as Spotify Electric Jukebox will renew annually with a listener needing to pay 60 in the United States or £60 in Britain for an additional year's service. \nBased in London Electric Jukebox's advisory board includes longtime U2 manager Paul McGuinness and veteran Warner Music executive Rob Dickins. \nRob Lewis chief executive officer of the Electric Jukebox Company said the service hoped to appeal to the vast majority of music fans who have not embraced streaming despite the sector's rapid growth. \n\"There used to be 200 million people buying CDs every month and many more buying CDs occasionally\" around the world he said. \n\"After 10 years of streaming only 40 million have converted to streaming subscription services because of complexity set-up difficulty and because of the fear of recurring credit card-based subscriptions\" he said. \nSpotify the largest streaming service says it has 75 million users but only 20 million who pay subscriptions for unlimited advertisement-free content. \nSwedish-founded Spotify and its rivals -- such as Rhapsody Deezer Rdio and Google Music -- generally require a user to install an application and provide credit card details. \nInstallation normally takes just minutes but requires a smartphone or computer. \nStreaming has become increasingly competitive with Apple Music and rapper Jay Z's Tidal both making splashy launches this year with promises of exclusive content. \nAFP", "external_links": [], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-16T08:48:06.891+03:00", "highlightTitle": ""}