{"organizations": [], "uuid": "a30871db0626144dd1a0a70b49148dae39221348", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/07/8257849.htm", "country": "US", "title": "More than the sum of its parts - Europe's largest and most advanced integrated traffic management systems are implemented by Kapsch TrafficCom", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "More than the sum of its parts - Europe's largest and most advanced integrated traffic management systems are implemented by Kapsch TrafficCom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T18:31:00.000+03:00", "replies_count": 0, "uuid": "a30871db0626144dd1a0a70b49148dae39221348"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/07/8257849.htm", "ord_in_thread": 0, "title": "More than the sum of its parts - Europe's largest and most advanced integrated traffic management systems are implemented by Kapsch TrafficCom", "locations": ["Europe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More than the sum of its parts - Europe's largest and most advanced integrated traffic management systems are implemented by Kapsch TrafficCom [October 07, 2015] More than the sum of its parts - Europe's largest and most advanced integrated traffic management systems are implemented by Kapsch TrafficCom Tweet \nKapsch TrafficCom AG (ISIN AT000KAPSCH9), listed on the Vienna Stock Exchange in the prime market segment, has been awarded two contracts to supply the Advanced Traffic Management System, DYNAC ® , as part of the collaborative program CHARM (between Highways England and Rijkswaterstaat, the English and Dutch national roads authorities) that will modernize and consolidate traffic management on their highways. \nHighways England and Rijkswaterstaat wish to improve customer services by implementing a future-proof traffic management system that helps improve safety and facilitates quicker response to real-time events. To introduce greater levels of productivity where possible, and to increase consumer satisfaction through the provision of faster, richer travel information services, Highways England and Rijkswaterstaat have chosen DYNAC ® because of its proven, highly configurable Advanced Traffic Management System capabilities. DYNAC ® helps operators work more efficiently, while improving the safety of road users and operating at lower maintenance costs. \nKapsch will deliver and install DYNAC ® in two traffic management centers, one in England and one in the Netherlands, with the installment set to be completed within 26 months of the start date. CGI ( News - Alert ), the fifth largest independent information technology and business process services firm in the world, has been selected as the main partner in this project. CGI is responsible for the design, build, test and implementation of interface software that allows Highways England and Rijkswaterstaat to reuse existing interfaces and devices in combination with the DYNAC ® software. After the implementation in the first traffic management centers, DYNAC ® will be installed by a third party in all the remaining traffic management centers of Highways England (7 regional and 1 national center) and Rijkswaterstaat (5 regional and 1 national center), with the contract totaling around 60 million Euro ($67M USD), including the provision of product-level support services for a period of up to 13 years after the successful installation of the DYNAC ® Advanced Traffic Management System. \nComplete integration of traffic management \nRijkswaterstaat and Highways England move towards a ew generation of traffic management systems in order to integrate a wide range of functions and manage the existing large quantity of different devices. Furthermore, the open, scalable and modular architecture of DYNAC ® allows the addition of new applications, resulting in a single system which has the capability to incorporate future solutions that have not yet been implemented. \"We want to make our traffic management centers more efficient and innovative,\" states Perry van der Weyden, Chief Information Officer at Rijkswaterstaat. \"The Competitive Dialogue procurement procedure provided us with a clear view of what all bidders had to offer. The implementation of this existing, proven system DYNAC ® is part of our information strategy that aims to replace dozens of applications with an integrated system.\" Neil Widdop, Services Procurement Team Leader at Highways England, says: \"The new system will allow us to improve our operational efficiencies through use of a modern, national, integrated system. As we improve our operational efficiency, we can expect road users to benefit from quicker responses to incidents leading to improved safety and greater convenience for our customers.\" \nA new generation of traffic management \nIn each of the two countries, Kapsch will be responsible for the delivery, installation and testing of one new traffic management center, with the existing technical infrastructure used to control and manage traffic being integrated. \"Future traffic management is all about integration,\" states Mag. Georg Kapsch, CEO at Kapsch TrafficCom. \"Whether aligning traffic management across borders, different technological solutions or different transportation areas like highways and cities - road users will ultimately experience more safety, more efficiency, and more convenience along their whole route.\" \nThe DYNAC ATMS ® solution is a high-performance, integrated software suite which combines mission critical reliability, and security with the latest software technology. The solution is used to monitor and control traffic, passenger safety, and facilities management assets and processes. The software allows operators to detect and respond to congestion, incidents, emergency situations, and other conditions. \nKapsch TrafficCom is a provider of intelligent transportation systems (ITS) in the solution segments of road user charging, urban access and parking, traffic management, road safety enforcement, commercial vehicle operations, electronic vehicle registration and V2X cooperative systems. With end-to-end solutions, Kapsch TrafficCom covers the entire value creation chain of its customers as a one-stop shop, from components and design to the installation and operation of systems. The core business is to design, build and operate electronic toll collection and traffic management systems. References in 44 countries on all continents make Kapsch TrafficCom a recognized ITS provider worldwide. As part of the Kapsch Group, a family-owned Austrian technology group founded in 1892, Kapsch TrafficCom, headquartered in Vienna, Austria, has subsidiaries and offices in 33 countries, has been listed on the Vienna Stock Exchange (KTCG) since 2007, and generated with more than 3,500 employees revenues of EUR 456 million in fiscal year 2014/15. \nFollow us on Twitter ( News - Alert ): twitter.com/kapschnet . View source version on businesswire.com: http://www.businesswire.com/news/home/20151007006074/en/", "external_links": [], "published": "2015-10-07T18:31:00.000+03:00", "crawled": "2015-10-08T06:33:17.221+03:00", "highlightTitle": ""}