{"organizations": [], "uuid": "a2fdd8b8ffd5e4a49b32e88adb9a49042fe478bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1145392/oracle-solaris-11-3-delivers-security-speed-and-simplicity-enterprise-cloud-environmen", "country": "US", "title": "Oracle Solaris 11.3 Delivers Security, Speed and Simplicity for Enterprise Cloud Environments and DevOps", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Oracle Solaris 11.3 Delivers Security, Speed and Simplicity for Enterprise Cloud Environments and DevOps", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:00:00.000+02:00", "replies_count": 0, "uuid": "a2fdd8b8ffd5e4a49b32e88adb9a49042fe478bd"}, "author": "admin", "url": "http://www.freshnews.com/news/1145392/oracle-solaris-11-3-delivers-security-speed-and-simplicity-enterprise-cloud-environmen", "ord_in_thread": 0, "title": "Oracle Solaris 11.3 Delivers Security, Speed and Simplicity for Enterprise Cloud Environments and DevOps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/26/2015 @ 9:00 AM Companies mentioned in this article: Oracle Corporation \nSAN FRANCISCO, CA -- (Marketwired) -- 10/26/15 -- ORACLE OPENWORLD -- Oracle (NYSE: ORCL) today introduced Oracle Solaris 11.3 , the latest release of the world's most advanced enterprise operating system, with enhanced security, virtualization, and cloud management. \n\"With Oracle Solaris 11.3 we provide a secure cloud platform. In addition to unique security features like our immutable virtualization and time-based access control, we are using the SPARC M7 processor's Silicon Secured Memory to helps prevent common security attacks like buffer overreads and buffer overwrites,\" said Markus Flierl, vice president, Oracle Solaris Core Technology. \"Leveraging hardware offload, we are making encryption affordable for data and network traffic as well as live migration across a wide range of encryption modes so customers don't have to choose between security and performance.\" \nDesigned for Security -- Oracle Solaris 11.3 transparently integrates the Oracle SPARC M7 processor's Security in Silicon capabilities, dramatically improving security for existing and future applications. Oracle Solaris 11.3 enables Silicon Secured Memory which helps prevent common security attacks like buffer overreads and overwrites. Oracle Solaris 11.3 also enables widespread use of SPARC M7 encryption acceleration across the datacenter for database, Java, existing applications, ZFS file system, network, and hot virtual machine migration without performance impact. \nDesigned for Lifecycle Management -- Oracle Solaris 11.3 simplifies the deployment and update of secure environments with three key features: Full stack patching and updating enables the creation of complete, trusted and signed software bundles including applications, operating system, and firmware verified at boot time. Immutable virtual machines prevent unauthorized installation of any additional software or configuration changes. One-step automated updates and patches through a trusted path enables simple, secure immutable virtual machine updates. This combination provides complete lock down of all virtual machine content, including built-in audit and compliance reporting. \n\"Oracle Solaris is secure by default, and security is built in to every feature. We routinely use the Oracle Solaris compliance tool as well as the Common Vulnerabilities and Exposure (CVE) metadata in IPS to automatically generate reports for our application and operating system environments. It is fully customizable and easy to use, allowing us to achieve a tenfold reduction in compliance reporting overhead,\" said Thorsten Mühlmann, lead architect, Unix Systems, Informationsverarbeitung für Versicherungen GmbH (ivv). \nOracle Database Integration -- Oracle Database In-Memory and Oracle Solaris 11.3 fully support the new SPARC M7 SQL in Silicon capabilities that enables up to 10x better database query performance for all current enterprise software and next generation analytics applications. Critical functions such as dynamic resource management and integrated high performance lock manager enhancements for Oracle RAC make Oracle Solaris 11.3 the most agile platform for delivering database-as-a-service. Full stack observability and troubleshooting enabled by DTrace provides simple analysis from the database to the OS kernel for real-time database troubleshooting and tuning. \nOpenStack for the Enterprise -- With Oracle Solaris 11.3, these security capabilities are also available with OpenStack. Oracle Solaris 11.3 includes automated upgrades and instant roll-back leveraging ZFS based boot environments. OpenStack Heat provides orchestration of multi-tier applications. Ironic enables bare metal provisioning. Leveraging Oracle Solaris Cluster delivers fault tolerance at all levels through automated service restarts, evacuation of faulty hardware and disaster recovery. Oracle's Murano database-as-a-service application enables provisioning of pluggable databases to achieve up to 5x higher efficiency. \nEnterprise DevOps -- With Java, Oracle Solaris Studio, and Oracle SPARC M7-based systems, Oracle Solaris 11.3 provides an ideal platform for DevOps. With Oracle Solaris Studio, developers can easily maximize their code performance by quantifying the effect of their code on the hardware resources while at the same time improving their productivity. C and C++ developers can easily take advantage of the Silicon Secured Memory feature through Oracle Solaris Studio's Discover module and instantly identify coding errors like stale pointers with virtually no impact on application performance. Developers can also utilize this integrated continuous deployment environment with secure lifecycle management using OpenStack. \nAvailable Now: Oracle Solaris 11.3 is available now for download or update. \nAbout Oracle Oracle offers a comprehensive and fully integrated stack of cloud applications and platform services. For more information about Oracle (NYSE: ORCL), visit oracle.com . \nAbout Oracle OpenWorld Oracle OpenWorld 2015 delivers the ultimate cloud experience. The industry's most important business conference includes thousands of educational sessions and features demos and exhibitions from hundreds of partners and customers from around the world showcasing Oracle's comprehensive cloud offerings, including an integrated stack of applications, platform and infrastructure services, as well as converged systems and industry solutions. Tens of thousands of in-person attendees and millions online gain valuable product and industry-specific insight to help them transform their businesses with Oracle. Oracle OpenWorld 2015 is being held October 25 through October 29 at the Moscone Center in San Francisco. For more information; to register; or to watch Oracle OpenWorld keynotes, sessions, and more, visit Oracle OpenWorld 2015 . Join the Oracle OpenWorld discussion on Twitter #oow15, Facebook , and the Oracle OpenWorld blog. \nTrademarks Oracle and Java are registered trademarks of Oracle and/or its affiliates. Other names may be trademarks of their respective owners. Contact:", "external_links": [], "published": "2015-10-26T18:00:00.000+02:00", "crawled": "2015-10-26T19:41:42.076+02:00", "highlightTitle": ""}