{"organizations": [], "uuid": "823aa9c493ef46e04bb2bf6dcc38be3af9322935", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stockhouse.com", "main_image": "", "site_section": "http://www.stockhouse.com/discovery/technology", "section_title": "The Technology Report - Technology investor news and research center ", "url": "http://www.stockhouse.com/news/press-releases/2015/10/21/microsoft-and-dell-extend-the-power-of-hybrid-cloud-with-new-offerings", "country": "US", "title": "Microsoft and Dell extend the power of hybrid cloud with new offerings", "performance_score": 0, "site": "stockhouse.com", "participants_count": 1, "title_full": "Microsoft and Dell extend the power of hybrid cloud with new offerings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "823aa9c493ef46e04bb2bf6dcc38be3af9322935"}, "author": "stockhouse.com", "url": "http://www.stockhouse.com/news/press-releases/2015/10/21/microsoft-and-dell-extend-the-power-of-hybrid-cloud-with-new-offerings", "ord_in_thread": 0, "title": "Microsoft and Dell extend the power of hybrid cloud with new offerings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTIN, Texas Wednesday at Dell World, Dell and Microsoft Corp. announced a new cloud solution and program that enable organizations of all sizes to use the Microsoft cloud platform to transform their business. A new, Microsoft Azure-consistent, integrated system for hybrid cloud and extended program offerings will help more customers benefit from Azure and Dell to drive greater agility and increased time to value, whether they choose on-premises or public cloud solutions.\n\"A core part of our mission to empower every organization on the planet requires us to build world-class platforms and forge deeper partnerships that help businesses of all sizes transform with digital technology,\" said Satya Nadella , CEO, Microsoft. \"By expanding our longstanding partnership with Dell to offer a truly integrated hybrid cloud, we will make the cloud more accessible to organizations of all sizes with the choice and flexibility to best meet their needs.\"\n\"Digital transformation is an imperative for business today, and we are making our customers' journey easier and faster through adoption of hybrid cloud,\" said Michael Dell , CEO, Dell. \"Dell shares a vision with Microsoft that open architectures and simplified cloud management will benefit customers of all sizes, freeing them to focus on their businesses and not their technology.\"\nMicrosoft and Dell deliver a new Azure-consistent integrated system for hybrid cloud\nCustomers are increasingly turning to hybrid cloud as a way to achieve the agility and cost-savings of the cloud while maintaining control of their assets. Extending their commitment to deliver simple yet powerful hybrid solutions, Microsoft and Dell announced Cloud Platform System Standard (CPS Standard), the newest addition to the Microsoft Cloud Platform System (CPS) family. CPS is the industry's only integrated system with a true hybrid cloud experience, built on optimized Dell modular infrastructure with pre-configured Microsoft CPS software, including the proven Microsoft software stack and popular Azure services.\nThe hybrid cloud experience comes from the platform's consistency with Azure, enabling agile deployment and operation of workloads and allowing customers to build multi-tiered, scalable applications. A fully integrated, preconfigured system, CPS Standard is purpose-built to remove many of the complexities and costs traditionally associated with hybrid cloud deployments, including the following:\nQuick time to value and operational simplicity. CPS Standard arrives ready to be plugged in and can be up and running in as little as three hours, while operations, patching and updates are simplified with an automated framework. Simplified business continuity . In case of a datacenter outage, CPS Standard features archival backup to Azure and failover to Azure that is easy-to-activate, reliable and cost-effective. Increased flexibility. Its modular design allows customers to start smaller and incrementally scale from four to up to 16 servers based on business needs. CPS Standard is shipping now with Windows Azure Pack, System Center 2012 R2 and Windows Server 2012 R2 and is ready to install Microsoft Azure Stack when it becomes available. Dell and Microsoft also offer CPS Premium for large enterprises and service providers requiring a higher-capacity hybrid cloud solution.\nDell joins Microsoft Cloud Solution Provider program to accelerate customers' cloud journey\nCustomers want cloud solution providers to help them realize the benefits of the cloud quickly. To help customers leverage the cloud, Dell also announced that it has joined the Microsoft Cloud Solution Provider program and will sell Microsoft cloud solutions across Azure, the Microsoft Enterprise Mobility Suite (EMS) and Office 365. This will help customers accelerate their journey through end-to-end cloud, mobility, identity and productivity solutions that drive new innovation, improve employee productivity and increase security.\nThe combination of Azure services and Dell's hardware, software and consulting services will assist customers through their entire hybrid cloud journey from inception to implementation. Consultants will be trained to help customers build tailored cloud solutions to address a range of core business needs including hybrid infrastructure deployments, elastic scale and bursting, backup and disaster recovery, Web and mobile development, and data and analytics.\nAs a Cloud Solution Provider, Dell will also provide end-to-end enterprise mobility and identity solutions, based on EMS and Azure Active Directory, to empower employees and protect corporate data and applications. EMS, combined with Windows 10 and Office 365, provides a comprehensive platform, productivity tools and management capabilities to help secure company data without compromising mobile productivity experiences.\nMore information on the innovations in this release and a full list of the innovations Microsoft announced Wednesday can be found on the Server and Cloud blog and by viewing Dell World keynotes and sessions on demand at http://www.dell.com/learn/us/en/uscorp1/secure/dell-world-2015 .\nAbout Dell\nDell Inc. listens to customers and delivers innovative technology and services that give them the power to do more. For more information, visit http://www.dell.com .\nJoin us Oct. 20−22 at Dell World 2015, Dell's flagship event bringing together technology and business professionals to network, share ideas and help co-create a better future. Learn more at www.dellworld.com and follow #DellWorld on Twitter.\nAbout Microsoft\nMicrosoft (Nasdaq \"MSFT\" @microsoft) is the leading platform and productivity company for the mobile-first, cloud-first world, and its mission is to empower every person and every organization on the planet to achieve more.\nLogo - http://photos.prnewswire.com/prnh/20000822/MSFTLOGO\n releases/microsoft-and-dell-extend-the-power-of-hybrid-cloud-with-new-offerings-300163790.html\nSOURCE Microsoft Corp.\nPR 11:30 AM EDT Tags: SOFTWARE - INFRASTRUCTURE TECHNOLOGY", "external_links": ["http://blogs.technet.com/b/server-cloud/archive/2015/10/21/microsoft-and-dell-extend-partnership-with-new-hybrid-cloud-offerings.aspx", "http://www.dell.com/learn/us/en/uscorp1/secure/dell-world-2015", "http://photos.prnewswire.com/prnvar/20000822/MSFTLOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=SF34318&Transmission_Id=201510211130PR_NEWS_USPR_____SF34318&DateId=20151021", "http://blogs.technet.com/b/windowsserver/archive/2014/10/20/unveiling-the-microsoft-cloud-platform-system-powered-by-dell.aspx", "http://www.prnewswire.com/news-releases/microsoft-and-dell-extend-the-power-of-hybrid-cloud-with-new-offerings-300163790.html", "http://photos.prnewswire.com/prnh/20000822/MSFTLOGO", "http://www.dell.com/", "http://www.dellworld.com/", "http://www.microsoft.com/en-us/server-cloud/products/azure-in-your-datacenter/"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-21T19:21:32.845+03:00", "highlightTitle": ""}