{"organizations": [], "uuid": "9a340d87992f77defe9b77c6f82a88db837cc8cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "http://a.abcnews.go.com/images/Technology/WireAP_6d9611995f2747eda846b3c05c2e16fa_16x9_992.jpg", "site_section": "http://abcnews.go.com/xmldata/rss?id=79", "section_title": "ABC News: Technology", "url": "http://abcnews.go.com/Technology/wireStory/idaho-nuclear-lab-director-eyes-generation-scientists-34350610", "country": "US", "title": "Idaho Nuclear Lab Director Eyes New Generation of Scientists", "performance_score": 1, "site": "go.com", "participants_count": 1, "title_full": "Idaho Nuclear Lab Director Eyes New Generation of Scientists - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a340d87992f77defe9b77c6f82a88db837cc8cb"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Technology/wireStory/idaho-nuclear-lab-director-eyes-generation-scientists-34350610", "ord_in_thread": 0, "title": "Idaho Nuclear Lab Director Eyes New Generation of Scientists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Idaho's federal nuclear facility can become the nation's premier energy security lab while also bolstering the region's economy, the new director says.\nMark Peters has been on the job for about a week at the Idaho National Laboratory, where he's in charge of about 3,900 workers.\nThe nation's energy security involves the U.S. being able to produce its own energy in a system protected from attacks, including cyber threats, he said.\n\"This laboratory has the ability to really solve problems at that nexus,\" he said Thursday in a phone interview with The Associated Press. \"That's what I've been dedicating my entire career to and that's what really attracts me. This is the best place for Mark Peters to work with a team to do that.\"\nPeters, 51, works for Battelle Energy Alliance, the U.S. Department of Energy's research contractor at the 890-square-mile federal facility. The lab is one of 17 national Department of Energy labs, which Peters calls \"crown jewels.\"\n\"Mark's recognized leadership in all fields of energy research — including energy storage, renewable energy, energy efficiency and nuclear energy — and national security makes him an ideal choice as the next Lab Director of INL,\" Ron Townsend, Chair of Battelle Energy Alliance's Board of Managers, said in a statement announcing the decision in August.\nThe Idaho lab is considered the nation's primary lab for nuclear research, with those efforts using about 70 percent of the lab's budget. About 30 percent of the lab's budget is used for clean energy research and homeland security .\nPeters said he's optimistic about combining knowledge at the lab in new ways that could bring in additional funding \"to create this great ecosystem to make Idaho and the Mountain West a center for research and development.\"\nHe said a primary focus over the next five years will be replacing nearly half the current staff that's set to retire. He said he's talking with young scientists at the lab to try to understand \"what makes them tick and gets them excited\" so he can attract more and keep them motivated to stay.\n\"This is an opportunity to bring in the next generation of scientists and engineers,\" he said. \"How often do you walk into a situation where you're able to reinvent the staff?\"\nBut Peters faces a number of challenges. A different Department of Energy contractor is handling nuclear waste cleanup at the facility that opened in 1949 and that for a time pumped radioactive waste underground into an aquifer relied on by area cities and farmers. Workers in the Cold War era also put radioactive waste in ponds that seeped into the ground.\nTwo former governors, concerned the site was becoming a nuclear waste dump, attained in 1995 an agreement with federal authorities limiting nuclear waste shipments.\nCurrently, the Idaho attorney general is refusing to grant a waiver to that deal allowing in two shipments of spent nuclear fuel weighing about 200 pounds for research until a $571 million malfunctioning treatment plant starts working.\nPeters, while not going into specifics, said he plans to reach out to the former governors and state officials. He said the federal site isn't in danger of becoming a nuclear waste dump.\nPeters previously worked at the Argonne National Laboratory in Illinois.\n  \" \nIdaho Nuclear Lab Director Eyes New Generation of Scientists  ", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T06:14:02.566+03:00", "highlightTitle": ""}