{"organizations": [], "uuid": "e0c49dafdb15685dae49fbffcc74843e25b90d9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1138772/sms-assist-wins-2015-merrick-momentum-award-presented-1871", "country": "US", "title": "SMS Assist Wins 2015 Merrick Momentum Award Presented by 1871", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "SMS Assist Wins 2015 Merrick Momentum Award Presented by 1871", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:20:00.000+03:00", "replies_count": 0, "uuid": "e0c49dafdb15685dae49fbffcc74843e25b90d9e"}, "author": "admin", "url": "http://www.freshnews.com/news/1138772/sms-assist-wins-2015-merrick-momentum-award-presented-1871", "ord_in_thread": 0, "title": "SMS Assist Wins 2015 Merrick Momentum Award Presented by 1871", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/9/2015 @ 8:20 AM   SMS Assist \nCHICAGO -- (BUSINESS WIRE) -- SMS Assist, the innovative mobile and cloud-based multisite property management company, was awarded the 2015 Merrick Momentum Award, which recognizes the best and brightest in Chicago’s technology community, presented by 1871 . \nEach year, the Momentum Award identifies a company in Chicago that is showing momentum and on track to be one of the next great tech companies to emerge from Chicago. As a Momentum winner, SMS Assist joins an impressive list of technology companies including kCura, Cleversafe, Braintree, GrubHub, SitterCity, Eved, and SAVO. \n“It’s an honor to be included in a group of such visionary, talented colleagues who are blazing new trails each day,” said Mike Rothman, CEO of SMS Assist. “We’re grateful to 1871’s leadership and are fortunate to be surrounded and supported by the innovative, entrepreneurial community that’s thriving in Chicago.” \nChicago-based SMS Assist is revolutionizing multisite property management using its proprietary, cloud-based platform to provide a fully-outsourced business solution for a growing list of national and Fortune 500 companies. SMS Assist’s 400+ employees manage a network of more than 20,000 certified affiliate subcontractors providing the highest quality maintenance services to more than 90,000 client locations. \nSMS Assist’s advanced technology platform helps to continuously reduce client property maintenance costs while simultaneously improving service quality and speed of delivery. The company’s team of certified affiliates has expertise in more than 45 trade services and provides critical maintenance such as floor care, snow and ice management, landscaping, HVAC and other property maintenance services. \nSMS Assist and Avant both earned the recognition. \nAbout SMS Assist \nSMS Assist is a Chicago-based technology company providing multisite property management to a roster of clients with more than 90,000 service locations. Using its proprietary software platform to manage its network of more than 20,000 affiliate subcontractors, SMS Assist offers a suite of property management benefits including leveraged pricing of products and services, $30M risk indemnification, real-time services validation, instant invoicing, automatic service audits and data analysis to ensure quality and cost efficiency. SMS Assist is revolutionizing multisite property management services for its growing list of national and Fortune 500 clients including Family Dollar (NYSE: FDO), O'Reilly Automotive, Inc. (NASDAQ: ORLY) and Colony Capital (NYSE: CLNY). To learn more, visit smsassist.com . \nAbout 1871 \n1871 is the home of more than 325 early-stage, high-growth digital startups. Located in The Merchandise Mart, this 75,000 square foot facility is also the headquarters of nationally recognized accelerators, Techstars Chicago and Impact Engine; half a dozen industry-specific incubators in key areas such as real estate, education technology, food and financial technology; several emerging tech talent schools (Flatiron, The Fullbridge Program, Designation and the Startup Institute), and the state’s leading technology advocate, the Illinois Science and Technology Coalition. It is the second home to Chicago-based VCs, Pritzker Group Venture Capital, MATH Venture Partners, Hyde Park Angels, OCA Ventures, OurCrowd and Chicago Ventures, as well as satellite offices for Northwestern University, University of Illinois, University of Chicago, Loyola University Chicago, Illinois Institute of Technology, and DeVry. 1871 has fast become recognized as the hub for the city’s entrepreneurial/technology ecosystem and has been featured in Inc. Magazine, TechCrunch, The Wall Street Journal, The New York Times, Chicago Tribune and Crain’s Chicago Business among other top media. 1871 is the flagship project of the Chicagoland Entrepreneurial Center. View source version on businesswire.com: http://www.businesswire.com/news/home/20151009005676/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-09T18:20:00.000+03:00", "crawled": "2015-10-09T20:07:10.759+03:00", "highlightTitle": ""}