{"organizations": [], "uuid": "f969378d946368902f89d0e31d7b967b5016540b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03472/netflixREUTERS_3472439k.jpg", "site_section": "http://www.telegraph.co.uk/lifestyle/rss", "section_title": "Lifestyle: cars, technology, health, interiors, gardening", "url": "http://www.telegraph.co.uk/goodlife/11919315/The-best-classic-shows-on-Netflix.html", "country": "US", "title": "The best classic shows on Netflix", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The best classic shows on Netflix", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T09:00:00.000+03:00", "replies_count": 0, "uuid": "f969378d946368902f89d0e31d7b967b5016540b"}, "author": "Saffron Alexander", "url": "http://www.telegraph.co.uk/goodlife/11919315/The-best-classic-shows-on-Netflix.html", "ord_in_thread": 0, "title": "The best classic shows on Netflix", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Advertisement The best classic shows on Netflix Forget Breaking Bad or The Office, here are some of the best classic shows and films available on Netflix UK What should you watch tonight? Photo: REUTERS Follow \nNetflix is more popular than ever amongst retirees. \nThe recent Colour Report found that 5 per cent of over 65s have a Netflix subscription or watch TV on demand and estimates suggest that around 34 per cent of Netflix subscribers are over the age of 49 . \nWhether you're thinking about joining the legions of over 50s already sucked into the Netflix phenomenon , or you're already there, here are some of the best classic films and shows available on Netflix UK. 12 Angry Men (1957) \nPhoto: REX \nOne of a handful of films to boast a 100 per cent rating on Rotten Tomatoes, 12 Angry Men is an unparallelled classic. \nThe film begins after the closing arguments in a murder trial and follows the members of the jury as they debilerate on whether the accused, an inner city teen, is guilty of murder. \nIt is considered a classic, from both a critical and popular viewpoint and, in 2007, it was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant.\" Heathers (1988) \nBefore Clueless or Mean Girls , there was Heathers . \nDespite initially tanking at the box office, Heathers has become something of a cult classic in the 27 years since its release. It is often heralded for its \"dark, cynical, and subversive [plot], applying a chainsaw to the conventions of the high school movie - changing the game for teen comedies to follow.\" lol that The Heathers was under teen comedies on Netflix \nThe black comedy regularly ranks in the top five of 'Best High School Movies' lists and, in 2008, made it onto Empire's list of 'The 500 Greatest Movies of All Time'. Tremors (1990) \nPhoto: ALAMY \nOn paper, Tremors seems like a disaster from the get go. Even Kevin Bacon himself had his doubts about starring in the film, considering it a career low: \"I broke down and fell to the sidewalk, screaming to my pregnant wife, 'I can't believe I'm doing a movie about underground worms!'\" \nBut 25 years later, Tremors still remains a cult favourite, with four (direct-to-video) sequels under its belt and rumours that Kevin Bacon is \"open\" to starring in one more. Hey @reba , @kevinbacon says he'd be down to return for a Tremors 25th anniversary flick. You in? You're the action star the 2010s need! — Michael Varrati (@MichaelVarrati) October 7, 2015 Shawshank Redemption (1994) \nPhoto: REX \nConsidered a classic by almost everyone and one of the best films of all time, Shawshank Redemption is an obvious choice for anyone struggling to decide on what to watch. Currently watching The Shawshank Redemption and remembering how good this movie is. Definitely in my top 5 — Martin Broda (@martinbroda) October 11, 2015 \nAlthough it has achieved classic status now, back in 1994, Shawshank Redemption was a box office disappointment, bringing in only $28 million. Despite this, it was included in the American Film Institute's 100 Years...100 Movies list, and the performance from Tim Robbins and Morgan Freeman earned it seven Oscar nominations and rave reviews from critics. 3rd Rock from the Sun (2000) \nPhoto: REX \nIf you're in the mood to laugh, maybe give the late nineties sitcom 3rd Rock from the Sun a go. If you haven't seen the show 3rd Rock from the Sun, watch it. I started it today and it's hilarious — Real Tim Toohey™ (@PaleAndChubby) October 10, 2015 \nThe show about four aliens on an expedition to Earth posing as a human family to observe the behaviour of human beings aired from 1996 to 2001 to critical acclaim, including numerous Emmy, Golden Globe, and Satellite Award nominations.", "external_links": [], "published": "2015-10-22T09:00:00.000+03:00", "crawled": "2015-10-22T10:19:01.654+03:00", "highlightTitle": ""}