{"organizations": [], "uuid": "da4e5b38ea5314839bb03fe6f8f2bdac9cada5d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techxplore.com", "main_image": "http://img.techxplore.com/newman/gfx/news/2015/5620f637c2f91.png", "site_section": "http://phys.org/rss-feed/technology-news/computer-sciences/", "section_title": "Computer Science News | Technology News | Computer Science Technology | Computer Sciences", "url": "http://techxplore.com/news/2015-10-smartphones-bi-polar-episodes.html", "country": "US", "title": "Using smartphones to predict bi-polar episodes", "performance_score": 0, "site": "techxplore.com", "participants_count": 0, "title_full": "Using smartphones to predict bi-polar episodes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T16:20:00.000+03:00", "replies_count": 0, "uuid": "da4e5b38ea5314839bb03fe6f8f2bdac9cada5d0"}, "author": "", "url": "http://techxplore.com/news/2015-10-smartphones-bi-polar-episodes.html", "ord_in_thread": 0, "title": "Using smartphones to predict bi-polar episodes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bob Yirka"], "text": "Using smartphones to predict bi-polar episodes October 16, 2015 by Bob Yirka report Mental state of the patients during various stages of the monitoring period. Credit: arXiv:1510.01665 [cs.HC] \nA team with the Center for Research and Telecommunication Experimentation for Networked Communities in Italy has conducted a small study to test the possibility of using smartphones to predict bi-polar episodes in people with the disorder. A paper by the team describing their study and results has been uploaded to the arXiv preprint server. \nBi-polar disorder, as its name implies is a mental condition that causes those who have it to experience extreme mood swings—from manic highs, to depressive lows. Why this occurs is still not known, though many medications have been developed to help those with the disorder smooth out their moods. One of the important parts of treatment is figuring out cycle duration and the time between episodes—this is normally done by interviewing patients on a regular basis, though quite often such information comes too late. In this new effort, the team in Italy has been investigating the possibility of using smartphones to help in predicting bi-polar episodes in real time. \nModern smartphones have sensors in them that can be useful in predicating a change in mood—an accelerometer for example, could note changes in body movement, and GPS could offer information about changes in movement patterns. To find out if smartphones could be used to help predict bi-polar episodes, in either direction, the researchers handed out smartphones configured to capture sensor data, to 12 volunteer bi-polar patients, who carried them for 12 weeks. The phones were also configured to monitor email messaging and the voice of the person as they talked on the phone (voices tend to rise in pitch when excited, or drop when depressed). The team also interviewed each volunteer before and after the test trial and at three week intervals to serve as a baseline. \nIn comparing the data from the phones with that from the interviews, the researchers found that the phone data allowed for predicting an episode 94 percent of the time, when looking at just motion sensors. When adding analysis of voice and email, the rate went up to 97 percent. \nThe results by the team are impressive, but there are two caveats; the first is that the test group and timeline were too small to draw serious conclusions, the other is that because of the nature of bi-polar disorder, many patients may not allow their cell phone to be used as a diagnostic tool—some, for example, simply quit taking their medications when they feel like it, allowing them to fully experience their moods, even if it causes other problems in their life. It might also be noted that paranoia is also a common symptom of bi-polar disorder and the thought that someone else might be tracking their every move might cause them to opt out of such an assistance program. \nMore information: Smartphones in Mental Health: Detecting Depressive and Manic Episodes, Pervasive Computing, IEEE (Volume:14, Issue: 3) ieeexplore.ieee.org/xpl/articleDetails.jsp?arnumber=7140674 , On Arxiv , arXiv:1510.01665 [cs.HC]: arxiv.org/abs/1510.01665 \nAbstract An observational study with patients diagnosed with bipolar disorder investigates whether data from smartphone sensors can be used to recognize bipolar disorder episodes and detect behavior changes that can signal an onset of an episode using objective data. 125 shares", "external_links": [], "published": "2015-10-16T16:20:00.000+03:00", "crawled": "2015-10-16T19:16:00.360+03:00", "highlightTitle": ""}