{"organizations": [], "uuid": "03e92b479c9684a32a2d7e06ce8a6ef725104053", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/09/23/13020989/Titan Logo_big.jpg", "site_section": "http://www.prweb.com/rss2/technology.xml", "section_title": "Technology", "url": "http://www.prweb.com/releases/2015/10/prweb13020989.htm", "country": "US", "title": "Titan Cloud Software Partners with Cybersecurity Firm Magnus Cloud to Provide Solutions for Looming Cyberthreats in the Petroleum Industry", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Titan Cloud Software Partners with Cybersecurity Firm Magnus Cloud to Provide Solutions for Looming Cyberthreats in the Petroleum Industry", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "03e92b479c9684a32a2d7e06ce8a6ef725104053"}, "author": "Rob Boughton", "url": "http://www.prweb.com/releases/2015/10/prweb13020989.htm", "ord_in_thread": 0, "title": "Titan Cloud Software Partners with Cybersecurity Firm Magnus Cloud to Provide Solutions for Looming Cyberthreats in the Petroleum Industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With the increased public spotlight on the security vulnerabilities of petroleum retailers, and on the heels of published research on cyberexploits by security firms such as Trend Micro, Rapid7, and Trustwave, Titan Cloud Software announced today a partnership with cybersecurity experts, Magnus Cloud LLC . Through this partnership, Titan will bring to the retail petroleum industry a new set of offerings to enhance the security of devices, mobile applications, and websites. “To help both our clients and manufacturer-partners better understand and protect their businesses against cyberterrorism and cybercrime, we have already begun applying our secure cloud infrastructure to help solve some of these vulnerabilities before they become breaches,” commented Phil Hunt, Director of Software Engineering at Titan Cloud Software. “Our partnership with Magnus Cloud gives us a unique set of cybersecurity capabilities around smart devices, such as ATGs, POS systems, and Fuel Dispensers, as well as mobile applications,” added Hunt.\nTitan commissioned its own independent study of industry cyberthreats earlier this year and research results dramatically expanded the security gaps previously published and shared across dozens of publications. Titan has not yet fully disclosed or published its findings due to the security sensitivities of its research.\n“Now that industry awareness of these vulnerabilities has risen to the level where action is required, this partnership is very timely,” said Kurt Gutzmann, Chief Technology Officer of Magnus Cloud, LLC. “Titan understands petroleum retailing information security better than anyone, and in partnership with Magnus Cloud, seeks to solve the prevailing issues before they become major problems for retailers and manufacturers alike,” concluded Gutzmann.\nNew security offerings will protect fuel devices, mobile applications, and websites against automated cyberattacks. To learn more about Titan Cloud Software’s independent study of cybersecurity threats facing the petroleum industry, or its security solution capabilities available through Magnus Cloud, please contact Titan Cloud Software at roi(at)titancloud(dot)com.\nAbout Magnus\nMagnus Cloud offers technology and services that prevent bots from damaging corporate websites and mission critical web applications. Magnus defends against all bot-based exploits and eliminates risk from Layer 7 Denial of Service attacks. Learn more at http://www.magnuscloud.com .\nAbout Titan\nTitan Cloud Software is the fuel industry's leading cloud platform with a comprehensive suite of over 50 modules, apps, equipment and service connectors for fuel analytics, environmental compliance, and facility maintenance. Helping the fuel industry manage risk and fuel profit, Titan solutions provide continuous monitoring of fuel inventory, deliveries, alarms, variance, meter drift, flow rates, facility compliance data, and much more. Learn more at http://www.titancloud.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYWdudXNjbG91ZC5jb20=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50aXRhbmNsb3VkLmNvbQ=="], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T15:16:22.964+03:00", "highlightTitle": ""}