{"organizations": [], "uuid": "9a12a12533ca4119bf681110d65690be4f259c70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sandiegouniontribune.com", "main_image": "http://cdn.sandiegouniontrib.com/img/photos/2015/10/08/B8810246Z.1_20151008193829_000G2Q3LATD.3-0_tx201.jpg?a7afd4f196cc87f88131a6d97e3ddf50b1644c7d", "site_section": "http://utsandiego.com/rss/headlines/business/technology/", "section_title": "The San Diego Union-Tribune stories: Technology", "url": "http://www.sandiegouniontribune.com/news/2015/oct/09/mark-bowles-san-diego-tech-guru/", "country": "US", "title": "Meet Mark Bowles: San Diego’s startup guru", "performance_score": 0, "site": "sandiegouniontribune.com", "participants_count": 1, "title_full": "Meet Mark Bowles: San Diego’s startup guru | SanDiegoUnionTribune.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a12a12533ca4119bf681110d65690be4f259c70"}, "author": "Jennifer Van Grove", "url": "http://www.sandiegouniontribune.com/news/2015/oct/09/mark-bowles-san-diego-tech-guru/", "ord_in_thread": 0, "title": "Meet Mark Bowles: San Diego’s startup guru", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When Mark Bowles tells you he's working on something new, something that will have a profound impact on health care, you listen.\nThat's because the 52-year-old serial entrepreneur and investor has the ear of the most important technologists in and outside of town — and for good reason. Bowles was the brains behind ecoATM, the local electronics recycling kiosk-maker acquired in 2013 by Coinstar's parent company, Outerwall, for $350 million in cash. The acquisition represented a landmark moment for San Diego's tech scene, which unlike Silicon Valley, isn't famous for its behemoth buyouts.\n\"It was the biggest exit in San Diego's startup community, outside of biotech or life science, in the last 10 years,\" said James Heller, who runs Wrapify, an early stage San Diego ad-tech company, and touts Bowles as one of his backers.\nBowles has been an entrepreneur since the mid-90s, when he started his first microprocessor company. He's since sold a company to Apple, one to Motorola and another to Broadcom. In total, he's raised around $250 million across 17 financing rounds for the six companies he's helped build.\n\"I don't know if it's an ego problem or an authority problem,\" Bowles said of his preference to start his own companies over working for someone else, \"but I like to make an impact.\"\nThose who know Bowles attest that he's the opposite of a head case. They're quick to point out that he's surprisingly humble for a man with so many successes, and they all have their own stories to back up the claims.\n\"When we've had to make a decision, a tricky decision about where the company should go, Mark has had us over at his home,\" said Leo Trotter, CEO of dog console-maker Clever Pet. \"He helped refined our pitch. And we got to demo (the product) with his dogs repeatedly.\"\nThese days, Bowles, who left ecoATM in full a few weeks ago, is determined to produce more winners in San Diego — either through his own efforts with his currently hush-hush health care startup or by pumping his ecoATM profits into other local upstarts. Bowles has personally invested roughly $800,000 in a dozen or so nascent San Diego businesses since cashing out. In addition to Wrapify and CleverPet, his bets include bioinformatics processing startup Edico Genome and vaccine storage-tech company TruMed Systems.\nThough not a native San Diegan, Bowles maintains a strict, San Diego-only philosophy when it comes to investing in startups.\n\"I get a lot of opportunities to invest in deals in Silicon Valley ... but I restrict all of my investing to San Diego startups, which may not be the best financial choice,\" Bowles said. \"But I do believe in recycling capital.\"\nAs he points out, it's an odd instance for someone in the business of making educated bets. But the San Diego convert, who took up surfing at age 40, is, as they say in poker, all-in. He moved to the city from the Bay Area in 2003 to poach Qualcomm engineers for his-then wireless semiconductor venture, Staccato Communications. It was supposed to be a temporary relocation, one that would produce nice, beach-filled memories to recall when back up north in Woodside, where he planned to keep his home.\n\"I was here for 10 minutes in La Jolla, and I decided I was never leaving,\" he said. \"Now I couldn't get my kids out of here if I tried.\"\nBowles' buy-local philosophy is also indicative of his faith in the region's technology sector. He admits that entrepreneurs access to capital is limited here, and that San Diego doesn't yet produce the same kind of \"Brownian motion,\" random entrepreneurial coffee-shop collisions that happen all the time in the Bay Area, spawning unexpected ideas. But, he insists, San Diego's tech scene is on the precipice of greatness.\n\"It's time,\" Bowles said. \"I think the flywheel is starting to spin.\"\nHe reasons that enough momentum is building in the genomics and biotech fields to create, in a few years time, a critical mass of ingredients, capital included, to fuel a self-sufficient local tech economy. The idea is that more local capital, currently flowing in abundance to biotech ventures, will spill over into other spaces. After all, Silicon Valley started with silicon, but it's now the playground for consumer tech giants. Even esteemed Bay Area venture firms, who used to see San Diego as the boondocks, Bowles said, now have their eyes on the city.\n\"If you get enough snowflakes on a snowball it finally goes down the hill by itself,\" Bowles said. \"I think we're at that point right now.\"\nTo push the snowball down the hill, Bowles spends much of his free time coaching founders in town. He chairs the San Diego Venture Group to match founders with investors, serves as a mentor to the Qualcomm-TechStars Robotics program, advises entrepreneurs who participate in the EvoNexus accelerator and frequently guest lectures to area MBA students.\n\"He is why I and others like me care about San Diego — and why we think there are advantages of San Diego over San Francisco,\" said Mike Krenn, president of the San Diego Venture Group. \"He sincerely cares and wants San Diego to be a better community for the next man or woman up.\"\nBeyond providing practical business and fund-raising tips, he wants would-be entrepreneurs to grasp the reality of their roles. Whiz kids getting rich is a fun, made-for-TV narrative — and it happens to be one that applies to Bowles — but failure is real and often unforgiving.\n\"I'm a little worried about the current way that a lot of people talk about entrepreneurship,\" he said. \"It's glamorized to the point of being oversold.\nThe truth is, it's a lot of really hard work and you're going to fail. And you're probably going to fail multiple times. And it's really, really emotional. It's not an easy thing, where you just go Hollywood with a mobile app.\"\nBowles would know. He claims to have made a \"small fortune\" in the dot com bubble, but he has plenty of experience losing money, too. He has, for instance, lost some of his past investors tens of millions of dollars with failed endeavors, like Staccato. And he wasn't too prudent with his own finances the first go-around, having burned through most of riches by the time he started ecoATM. He risked all that was left on that project.\nOn the other hand, Bowles preaches entrepreneurship with enough conviction to turn unbelievers into converts.\n\"It is one of the noblest things you can do to create jobs and wealth, and products that the world needs.\"\nBowles, along with a few of his ecoATM co-founders, will take another stab at greatness with a health care startup he can only talk about in terms so vague and extreme that they would sound ludicrous coming from anyone else.\n\"If successful, (this idea) is the biggest and most noble in terms of its impact yet,\" he said. \"This one is really powerful if it works.\"\n👤 Jennifer Van Grove  More from Jennifer Van Grove Making millions in tech, and keeping it in San Diego Mini Target opens in South Park Should Twitter mess with the 140-character limit?", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T17:27:08.879+03:00", "highlightTitle": ""}