{"organizations": [], "uuid": "dee6ae0d6ed52b99507c954880d6095d673ebb0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/25/1443175550131/6776576b-1e4a-40e9-897c-252e44ec1039-620x372.png?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=753aacd25767d83dad1debea0dc4697f", "site_section": "http://www.theguardian.com/technology/all", "section_title": "Technology | The Guardian", "url": "http://www.theguardian.com/global-development-professionals-network/2015/oct/02/menstruation-flo-periods-less-of-a-pain-for-girls-asia-africa", "country": "GB", "title": "The invention that aims to make periods less of a pain | Global Development Professionals Network", "performance_score": 0, "site": "theguardian.com", "participants_count": 3, "title_full": "The invention that aims to make periods less of a pain | Global Development Professionals Network | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T17:51:00.000+03:00", "replies_count": 2, "uuid": "bf8a5cb8b4e62f59fe2fcd40d6ea48a40a238210"}, "author": "Terry Slavin", "url": "http://www.theguardian.com/global-development-professionals-network/2015/oct/02/menstruation-flo-periods-less-of-a-pain-for-girls-asia-africa#post-0", "ord_in_thread": 0, "title": "The invention that aims to make periods less of a pain | Global Development Professionals Network", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "E ven in 2015, menstruating females in Asia and Africa are shunned as unclean and have difficulty getting hold of sanitary products. A 2011 survey for the Indian government found that only 12% of women across India use sanitary pads . Others use old rags, and unhygienic substances such as sand, sawdust, leaves, mattress foam and even ash to stem their monthly bleeding, with implications for their health and education. Menstruating girls in both Asia and Africa are unable to go to school during their periods, or drop out of school altogether.\nJapanese design student Mariko Higaki Iwai hopes that she can help make the lives of girls and women better with her design for a simple reusable pad, which has won some high-profile awards and plaudits from development professionals.\n“What I loved about it is that it gives the possibility of addressing the issue of washing and drying [a pad] with dignity,” says Archana Patkar, programme manager of the UN’s Water Supply and Sanitation Collaborative Council (WSSCC) , who has spent 20 years working on menstruation in Asia and Africa.\nFacebook Twitter Pinterest The Flo design team. Photograph: The Flo\nIwai’s invention allows a girl to discreetly carry a reuseable pad in a pouch around her waist to school, store a soiled one until she returns home, then wash and spin-dry the pad with a spinner that cunningly converts into a hanger covered by a burlap cloth so it can be hung outside to dry without embarrassment. Flo recently won a gold award from the Industrial Designers Society of America and is shortlisted for an international award from the James Dyson Foundation .\nIwai developed the prototype and a business plan for its global production and distribution during a 17-week course at the Art Center College of Design in California last year, with a multidisciplinary team of Sohyun Kim, Tatijana Vasily, Charlotte Wong and Benjamin Freedman. They named it Flo because they wanted to remove the stigma. “Flo is flow of blood from menstruation, flow of water that cleans the pads, and ‘go with the flow’, to accept who you are and what your body goes through,” says Iwai.\nThe team decided to focus on reusable pads because sanitary pads are too expensive for people who live on less than $1.25 a day. But they quickly realised that their product would have to tackle social as well as practical barriers: in most parts of the world social norms prohibit girls from washing used rags with other clothes or drying them in public. This mean they must be furtively washed, then stuffed under mattresses or under the eaves of roofs, where they never get dry, and can become breeding grounds for reproductive infections and illnesses.\nThe important thing is it could help girls to manage their periods in privacy – a key issue in patriarchal societies\nIwai says it was heartbreaking for her to discover during researching the product how badly girls were affected during their periods, with many even put in isolation in their communities. “It’s 2015 and such things shouldn’t be happening now. That was what we wanted to solve.”\nFlo would not be the first reusable menstrual pad. In Africa there is the AFRIpad , and in India the Uger pad . Patkar says there are also affordable eco-friendly disposable pads, such as the Anandi pad in India, and in Africa pads made of banana fibre by SHE Enterprises , founded by Harvard Business graduate Elizabeth Scharpf .\nPatkar points out that she had not seen the Flo kit, “but I love that it looks at the drying aspect, and no other reusable does from the range I have seen.” The important thing is it could help girls to manage their periods in privacy – a key issue in patriarchal societies such as India. Washing reusable pads means women are also not having to dispose of blood-soaked sanitary pads, “which pollute the environment as the waste disposal chain chooses to ignore them, perpetuating the silence and stigma all the way down the chain”.\nRelated: We need to talk about periods: why is menstruation still holding girls back?\nBut cost, at an expected retail price of $3, could be prohibitive in some of the remote rural areas they work in Senegal, Niger, India and Nepal, Patkar says. Ingeborg Krukkert, who leads programmes in Asia for international water, sanitation and hygiene NGO IRC , agreed that cost would be a barrier.\nKrukkert added that Flo’s potential will also be limited in countries whose governments are not working to tackle the issue. “These kind of ‘hardware’ solutions to menstrual hygiene are great, but they won’t help at scale to achieve the SDGs [sustainable development goals],” Krukkert says. “What’s needed is for the governments to be on board and take responsibility to act on this.”\nSome countries are taking responsibility. India and Senegal have recently announced major initiatives to improve menstrual hygiene, including providing girls toilets and hand basins in schools and public places, and WSSCC is also working with Cameroon and Niger .\nIn Bangladesh, the country’s largest NGO, Brac , has been working on improving menstrual hygiene at both the community and school level since 2006, with funding from the UK’s Department for International Development, among other donors. Over the first four years of the programme absenteeism of female students during menstruation reduced from 44% to 33% .\nThese kind of ‘hardware’ solutions to menstrual hygiene are great, but they won’t help at scale to achieve the SDGs\nIngeborg Krukkert, IRC\nBut Patkar points out that the 17 SDGs , agreed by 150 world leaders last week at the UN General Assembly in New York, does not have a single mention of menstruation in the 35-page document – despite the fact that at least eight of the 17 goals are related to improving the lot of women. Krukkert points out that even the mention of “hygiene” was dropped from early drafts of SDG 6, covering the human right to clean water and sanitation, at the beginning of this year, and was only reinstated in September after a campaign by 90 NGOs .\nPatkar says that menstrual hygiene management is a “huge blind spot” even for people working in water, sanitation, hygiene, as she found during a 2004-study (doc) of menstrual hygiene management around the world.\n“It’s deplorable that the Wash sector hasn’t talked about this,” says Patkar. “I think the worst thing we can do is perpetuate the silence around these issues by not specifically naming them in the SDGs.”\nWhether Flo will be able to contribute to breaking the silence over menstruation remains to be seen. “The development of the product is in the very early stages,” says Iwai, who is still in her last year at college. She says it’s important that Flo is extensively field-tested in many different countries to see how women interact with it. “It’s a prototype that still needs research. We don’t want to make a product that isn’t needed and ends up in landfill.”\nJoin our community of development professionals and humanitarians. Follow @GuardianGDP on Twitter.", "external_links": ["http://timesofindia.indiatimes.com/india/70-cant-afford-sanitary-napkins-reveals-study/articleshow/7344998.cms", "http://globalhandwashing.org/raise-your-voice-for-hygiene-sign-on-to-call-for-a-global-hygiene-indicator-in-the-sdgs/", "https://www.facebook.com/dialog/share?app_id=180444840287&href=http%3A%2F%2Fgu.com%2Fp%2F4cy96%2Fsfb%23img-1&redirect_uri=http%3A%2F%2Fgu.com%2Fp%2F4cy96&picture=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F9%2F25%2F1443175878475%2F8e72b7f7-b64a-4f35-9df5-a0b74eaabf87-2060x1373.jpeg", "http://www.jamesdysonaward.org/projects/flo/", "http://www.ircwash.org/", "http://washinnovations.r4d.org/program/Uger-menstrual-pads", "http://unicef.in/Whatwedo/39/Clean-India-Clean-Schools", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/25/1443175878475/8e72b7f7-b64a-4f35-9df5-a0b74eaabf87-2060x1373.jpeg?w=605&q=85&auto=format&sharp=10&s=7a2a793e499ff123cbe66328fb34aa54", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/25/1443175878475/8e72b7f7-b64a-4f35-9df5-a0b74eaabf87-2060x1373.jpeg?w=445&q=85&auto=format&sharp=10&s=1747dc8d8285a02aa47ec4edd4defc84", "http://wsscc.org/", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/25/1443175878475/8e72b7f7-b64a-4f35-9df5-a0b74eaabf87-2060x1373.jpeg?w=300&q=85&auto=format&sharp=10&s=a30b3a759e4e8a42c526f9918b19327f", "http://www.girleffect.org/what-girls-need/articles/2015/05/that-time-of-the-month-shouldn-t-mean-missing-school-period/", "http://wash.brac.net/news-a-media/175-achievements-of-wash-programme-towards-millennium-development-goals-and-beyond", "http://www.un.org/sustainabledevelopment/summit/", "http://sheinnovates.com/about-us/", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/25/1443175878475/8e72b7f7-b64a-4f35-9df5-a0b74eaabf87-2060x1373.jpeg?w=620&q=85&auto=format&sharp=10&s=f791a5f56fea38e84680000a9f95062e", "http://www.unwomenwestandcentralafrica.com/news1/unlocking-multiple-benefits-for-women-and-girls-through-sanitation-and-hygiene-in-the-post-2015-era", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/9/25/1443175878475/8e72b7f7-b64a-4f35-9df5-a0b74eaabf87-2060x1373.jpeg?w=380&q=85&auto=format&sharp=10&s=6e9a434f792ca5e65a56bd467325fd8d", "http://www.pinterest.com/pin/create/button/?description=The+invention+that+aims+to+make+periods+less+of+a+pain&url=http%3A%2F%2Fwww.theguardian.com%2Fglobal-development-professionals-network%2F2015%2Foct%2F02%2Fmenstruation-flo-periods-less-of-a-pain-for-girls-asia-africa&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F9%2F25%2F1443175878475%2F8e72b7f7-b64a-4f35-9df5-a0b74eaabf87-2060x1373.jpeg", "http://www.pbs.org/newshour/rundown/elizabeth-scharpf/", "http://afripads.com/our-products/afripads-menstrual-kits", "http://www.artcenter.edu/accd/index.jsp", "http://www.aakarinnovations.com/#!anandi-pad/c17ij", "http://www.wsp.org/Hygiene-Sanitation-Water-Toolkit/Resources/Readings/Bharadwai-2004-Menstrual.doc&sa=U&ved=0CAQQFjAAahUKEwicmNjSvJnIAhXBVz4KHZE0BE0&client=internal-uds-cse&usg=AFQjCNEzg0IDZOm1y-MnJCF9QaaVNbMPdA", "http://www.idsa.org/awards/idea/student-designs/flo", "https://twitter.com/GuardianGDP", "http://wsscc.org/wp-content/uploads/2015/05/ghs_info_letter_en_lores.pdf", "http://www.brac.net/", "https://twitter.com/intent/tweet?text=The%20invention%20that%20aims%20to%20make%20periods%20less%20of%20a%20pain&url=http%3A%2F%2Fgu.com%2Fp%2F4cy96%2Fstw%23img-1"], "published": "2015-10-02T17:51:00.000+03:00", "crawled": "2015-10-02T16:28:55.480+03:00", "highlightTitle": ""}