{"organizations": ["AP"], "uuid": "8f7fd247451a40c3bedc9bc8e013915c6576be33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/studykidstak.jpg", "site_section": "http://www.physorg.com/rss/physorg-appl.xml", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-kids-plus-required-12th-grade.html", "country": "US", "title": "Study: Kids take 100-plus required tests through 12th grade", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Study: Kids take 100-plus required tests through 12th grade", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T10:30:00.000+02:00", "replies_count": 0, "uuid": "8f7fd247451a40c3bedc9bc8e013915c6576be33"}, "author": "", "url": "http://phys.org/news/2015-10-kids-plus-required-12th-grade.html", "ord_in_thread": 0, "title": "Study: Kids take 100-plus required tests through 12th grade", "locations": ["Oklahoma City"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barack Obama", "Buchanan", "Jennifer C. Kerr"], "text": "Study: Kids take 100-plus required tests through 12th grade October 26, 2015 by By Jennifer C. Kerr In this July 21, 2014 file photo, students at a summer reading academy at Buchanan elementary school work in the computer lab at the school in Oklahoma City. Wading into one of the most polarizing issues in education, President Barack Obama called Saturday for capping standardized testing at 2 percent of classroom time, while conceding the government shares responsibility for having turned tests into the be-all-and-end-all of American schools. (AP Photo/Sue Ogrocki,File) \nStudents, parents and teachers have long lamented the hours that kids spend taking standardized tests, especially since the introduction of the Common Core academic standards. But just how much time each year? \nA. Between 10-15 hours. \nB. Between 20-25 hours. \nC. Between 30-35 hours. \nThe correct answer is \"B,\" according to a comprehensive study of 66 of the nation's big-city school districts by the Council of the Great City Schools. It said testing amounts to about 2.3 percent of classroom time for the average 8th-grader in public school. Between pre-K and 12th grade, students took about 112 mandatory standardized exams. It said testing amounts to 2.3 percent of classroom time for the average 8th-grader. \nThe study analyzed the time spent actually taking the tests, but it did not include the hours devoted to preparation ahead of testing required by the federal government, states or local districts. It also did not include regular day-to-day classroom quizzes and tests in reading, math, science, foreign languages, and more. \nIn connection with the study's release Saturday, President Barack Obama called for capping standardized testing at 2 percent of classroom time. Even while acknowledging that the government shares some responsibility for an over-emphasis on testing, the president said federal officials would work with states, schools and teachers to \"make sure that we're not obsessing about testing.\" \nThe Obama administration still supports annual standardized tests as a necessary assessment tool, and both House and Senate versions of an update to No Child Left Behind law would continue annual testing. But, the rewrite legislation would let states decide how to use test results to determine what to do with struggling schools. Differences between the two bills still need to be worked out. \n\"Learning is about so much more than just filling in the right bubble,\" Obama said in a video released on Facebook. \"So we're going to work with states, school districts, teachers, and parents to make sure that we're not obsessing about testing.\" \nTo drive the point home, Obama and Education Secretary Arne Duncan scheduled an Oval Office meeting Monday with teachers and school officials working to reduce testing time. \n\"How much constitutes too much time is really difficult to answer,\" said Michael Casserly, the council's executive director.\" He said the study found plenty of redundancy in required testing—supporting concerns from teachers and other critics about the tests consuming too much teaching and learning time. \nFor example, Casserly said that researchers found some states and school districts were mandating not only end-of-year tests, but end-of-course tests in the same subjects, in the same grade. \n\"Having states and school districts jointly reviewing redundancy and overlap in their testing requirements will be an important step in reducing unnecessary assessments,\" he said. \nThe council reviewed testing for more than 7 million students in about three dozen states during the 2014-2015 school year. And a \"testing action plan\" released by the Education Department said too many schools have unnecessary testing. \nAiming to close achievement gaps and assess learning, the No Child Left Behind Act signed by President George W. Bush in 2002 mandated annual testing in reading and math for students in grades three through eight and again in high school. States and local school districts decide which standardized assessments to use to gauge student learning and progress in those two subjects and others. \nThis past spring saw the rollout of new tests based on the Common Core college-ready academic standards in reading and math. About 12 million students in 29 states and the District of Columbia took the tests developed by two groups—the Smarter Balanced Assessment Consortium and the Partnership for Assessment of Readiness for College and Careers (PARCC). \nOther findings in the council's report: \n—The most tests were required in 8th and 10th grade; the fewest were in pre-K, kindergarten and 1st grade. \n—Four in 10 districts report having to wait between two months and four months before getting state test results. The lack of timely results means teachers begin a new school year not knowing where a student needs to improve.", "external_links": [], "published": "2015-10-26T10:30:00.000+02:00", "crawled": "2015-10-26T10:40:55.949+02:00", "highlightTitle": ""}