{"organizations": [], "uuid": "2764913b916696e92173054c2b3cf1856be00987", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/fit-in/1200x630/filters:fill(white)/cdn1.therepublic.com/tr_assets/images/TheRepublic-Icon-2048x2048.jpg", "site_section": "http://www.therepublic.com/feed/subject/6fd7e1aa975ef14a80f93a1da7d78c3a", "section_title": "Information technology News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/aea24c1e7c0840189a72065f29064cc1/NE--Data-Centers-Nebraska", "country": "US", "title": "Omaha targeting data centers, hoping they lead to more jobs", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "Omaha targeting data centers, hoping they lead to more jobs", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:58:00.000+03:00", "replies_count": 0, "uuid": "2764913b916696e92173054c2b3cf1856be00987"}, "author": "", "url": "http://www.therepublic.com/view/story/aea24c1e7c0840189a72065f29064cc1/NE--Data-Centers-Nebraska", "ord_in_thread": 0, "title": "Omaha targeting data centers, hoping they lead to more jobs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Omaha development group touts data center incentives as first step in getting more businesses \nBy DAVID A. LIEB Published: 9/30/15 2:58 pm EDT - Updated: 9/30/15 2:58 pm EDT \nAt least 20 computer data centers are located around Omaha, Nebraska, including some just across the Missouri River in neighboring Iowa. \nThey help power Internet searches for Google and Yahoo. Others house the financial data of Travelers Insurance and Mutual of Omaha. And some serve the computing needs of ConAgra Foods, Union Pacific railroad and other major companies in a wide variety of fields. \nSome have been drawn to the area by tax breaks offered by Nebraska and Iowa, two of the most prominent Midwestern competitors in an increasingly aggressive battle among states to lure data centers. \nThis summer, Omaha hosted its fourth annual Data Center Day, delivering a recruitment pitch to more than 50 site-selection brokers and business executives. \nIt's a big effort to appeal to an industry that often employs just 20 or so people to tend to its warehouses of computers servers and hard drives. But local officials insist data centers can have strong multiplier effects. \nTheir construction produces jobs for electricians and pipefitters, among others. And once a data center is built, a company sometimes locates other parts of its operations nearby. \nThe marketing holding company Interpublic Group consolidated its data centers from Hong Kong, London, New York and elsewhere to the Omaha area in 2009, when it employed 270 people in the area. Today, Interpublic has 488 employees there, as it has added back-office jobs in accounting, invoicing and payroll. \nOnline state records indicate that Interpublic Group received at least $2 million of sales tax breaks or tax credits from Nebraska in 2012 and 2013, but that does not include any property tax breaks or additional sale tax breaks since then. \nYahoo, which also has both a data center and other operations in Nebraska, received at least $13 million in state tax breaks during 2013 and 2014, according to those online records. \nVarious other data centers also might have received Nebraska incentives, but a lag time in reporting makes the total unclear. \nIowa has extended about $100 million of state tax breaks to data centers, mainly to Microsoft, Google and Facebook, according to records provided to The Associated Press. \nA data center \"kind of gets us in the door with the company, so we can sell the company on other operations to locate in greater Omaha,\" said Mark Norman, senior director of client services for the Greater Omaha Economic Development Partnership. \nThink your friends should see this? Share it with them! \nStory copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. \nFeedback, Corrections and Other Requests: AP welcomes feedback and comments from readers. Send an email to info@ap.org and it will be forwarded to the appropriate editor or reporter. We also have more stories about: (click the phrases to see a list) \nCategory:", "external_links": [], "published": "2015-09-30T21:58:00.000+03:00", "crawled": "2015-10-01T19:43:16.682+03:00", "highlightTitle": ""}