{"organizations": ["The Center for Professional Innovation and Education", "Center for Professional Innovation and Education", "Life Sciences", "FDA", "PA", "Regulatory Affairs Professionals Society"], "uuid": "2232074e5f0c8e2e7dd3e1eca1cf88ee02efb01c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/CfPIE-Discusses-Life-Sciences-Training-Advancements-at-Regulatory-Conferences-34457-1/", "country": "US", "title": "CfPIE Discusses Life Sciences Training Advancements at Regulatory Conferences", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "CfPIE Discusses Life Sciences Training Advancements at Regulatory Conferences", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:49:00.000+03:00", "replies_count": 0, "uuid": "2232074e5f0c8e2e7dd3e1eca1cf88ee02efb01c"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/CfPIE-Discusses-Life-Sciences-Training-Advancements-at-Regulatory-Conferences-34457-1/", "ord_in_thread": 0, "title": "CfPIE Discusses Life Sciences Training Advancements at Regulatory Conferences", "locations": ["Baltimore", "Cleveland", "Malvern"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark", "Mark Mazzie"], "text": "Date:10/22/2015 Malvern, PA (PRWEB) October 22, 2015 The Center for Professional Innovation and Education (CfPIE), the global leader of technical training across the life sciences industry, will participate at the upcoming 2015 regulatory conferences: Mark Mazzie , CEO at CfPIE, will join a panel at the BioOhio Annual Conference in Cleveland, OH to discuss Talent, Training and Millennials . The number one issue affecting growth of any company is finding the right talent, and then these employees need ongoing skills and often leadership training. Mark and the panel will address finding and training talent, and how best to integrate millennials in the workplace. At the Regulatory Affairs Professionals Society (RAPS) annual conference in Baltimore, MD training advisors from CfPIE will showcase and discuss their latest technical training courses and certifications for professionals across four segments—pharmaceuticals, biotechnology, medical devices, and skin/cosmetics. CfPIE courses are RAPS-approved. Attendees earn Regulatory Affairs Certification (RAC) credits through RAPS. Learn more at Booth 224. “Our training advisors and industry-active course directors address specific situations and help individuals and groups make the right choices for technical training in their organizations,” explains Mark Mazzie at CfPIE. “Annual events like RAPS and BioOhio allow us to spend quality time one-on-one to listen to their needs and shape our curriculum.” A sample of popular CfPIE course topics include: Adverse drug events; Best practices (GCP, GLP, GMP); Clinical trials; Design control principles; FDA regulatory compliance; Process validation; and Quality assurance and quality control. Learn more about CfPIE’s training courses and certifications. About CfPIE The Center for Professional Innovation and Education (CfPIE) is the global leader in quality training for pharma/biotech, medical device, and skin/cosmetics segments of the Life Sciences industry. Classroom and custom on-site formats, and certification programs help improve personal skills, maintain regulatory compliance, and advance careers. Small class sizes and industry-active course directors promote a dynamic learning environment with excellent student-to-teacher interaction. More information: http://www.cfpie.com \nRead the full story at http://www.prweb.com/releases/life-sciences/training/prweb13036954.htm . '/>\"/>", "external_links": [], "published": "2015-10-22T15:49:00.000+03:00", "crawled": "2015-10-22T16:22:31.945+03:00", "highlightTitle": ""}