{"organizations": ["CSO", "CIO"], "uuid": "ba759069099a827ea3f9d4c9bb219ca8711a5a98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/Incidents-of-cybersecurity-breach-shoot-up-117-in-India-PwC/49352120.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/digital-security", "section_title": "security - Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/incidents-of-cybersecurity-breach-shoot-up-117-in-india-pwc/49352120", "country": "IN", "title": "Incidents of cybersecurity breach shoot up 117% in India: PwC", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Incidents of cybersecurity breach shoot up 117% in India: PwC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T13:41:00.000+03:00", "replies_count": 0, "uuid": "ba759069099a827ea3f9d4c9bb219ca8711a5a98"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/incidents-of-cybersecurity-breach-shoot-up-117-in-india-pwc/49352120", "ord_in_thread": 0, "title": "Incidents of cybersecurity breach shoot up 117% in India: PwC", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sivarama Krishnan"], "text": "Share NEW DELHI: Incidents of cybersecurity breach surged by a record 117 per cent during the year and companies are investing more to tackle this menace, as also improve business performance, said a survey.According to global consultancy firm PwC along with CIO and CSO, \"The average number of information security incidents detected by respondents increased by 117 per cent over the previous year, up from 2,895 last year to 6,284 this year.\"Meanwhile, the increase in incidents of cybersecurity breach globally stood at just 39 per cent during the period under consideration (July 2014-June 2015).The report said that companies in India are investing more to reduce cybersecurity risks and improve business performance as a 71 per cent increase in budget on cybersecurity were seen during the said period.Moreover, an increasing number of organisations are now adopting cloud-based security models to manage cyber threats, the report said.\"Organisations in India are looking towards innovative cybersecurity solutions, and we have seen a 25 per cent compounded annual growth rate (CAGR) in security budgets over the past five years, which support this trend,\" PwC India Leader, Cybersecurity Sivarama Krishnan said.Over 71 per cent respondents use some form of cloud-based security tools such as analytics, advanced authentication and identity and access management, the report said.\"Not only are leaders adopting innovative solutions, but even fundamental security technologies and practices have seen wider acceptance, and organisations have evolved to master the basics,\" he added.Losses as a result of incidents of cybersecurity also surged by 135 per cent over the previous year, and the average cost per incident increased by close to 8 per cent, the report said.The survey was conducted in India with responses of more than 480 C-level executives from across 17 industry sectors.", "external_links": [], "published": "2015-10-14T13:41:00.000+03:00", "crawled": "2015-10-14T18:03:02.008+03:00", "highlightTitle": ""}