{"organizations": [], "uuid": "21eff40d3a9b89aff99ef19f1c0ea8a666a0cfac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newswise.com", "main_image": "", "site_section": "http://www.newswise.com/legacy/feed/channels.php?channel=41", "section_title": "Newswise Feature Channel: Technology", "url": "http://www.newswise.com/articles/view/640926/?sc=c41", "country": "US", "title": "Warning Labels Should Be Introduced to Prevent Digital Addiction", "performance_score": 0, "site": "newswise.com", "participants_count": 1, "title_full": "Warning Labels Should Be Introduced to Prevent Digital Addiction", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:05:00.000+03:00", "replies_count": 0, "uuid": "21eff40d3a9b89aff99ef19f1c0ea8a666a0cfac"}, "author": "Bournemouth University", "url": "http://www.newswise.com/articles/view/640926/?sc=c41", "ord_in_thread": 0, "title": "Warning Labels Should Be Introduced to Prevent Digital Addiction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Warning Labels Should Be Introduced to Prevent Digital Addiction Released: 6-Oct-2015 8:05 AM EDT Contact Information \n  \nNewswise — Warning labels and messages should be introduced on digital devices to encourage responsible usage and prevent digital addiction, according to Bournemouth University (BU) research. \nThe researchers believe labels and messages are required to help people adjust their usage of digital devices and raise awareness of potential side effects and addictive behaviours. \nA study by software experts and psychologists from BU found that more than 80 per cent of participants believed digital warning labels were a good idea, and would encourage users to adapt their use of digital devices and social networking sites. \nDr Raian Ali, a Senior Lecturer in Computing at BU, said: “Research has shown that excessive and obsessive usage and preoccupation about technology are associated with undesirable behaviours such as reduced creativity, depression and disconnection from reality. \n“The immersive use of technology and presence in the cyber space can easily lead a person to become unconscious of the time spent, the side-effects of being overly online, and the potential risks of taking actions in a hasty style due to a sort of irresistible impulse. \n“Thus, warning messages and labels are a social responsibility, ethical and professional practice for technology developers, at least to raise awareness so that people can make an informed decision on whether and how to use technology.” \nSigns of digital addition can include withdrawal symptoms, tolerance to a continuous increase of usage, relapse when trying to reduce or adjust the usage style, and mood modification when online. \nLabels could be used as powerful precautionary mechanisms to avoid entering highly-addictive usage - raising awareness of time spent online and possible alternative activities. \nThey could also be a mechanism to help recover from digital addiction or regulate usage - enabling people to set up an online limit and reminding them whether and how they are adhering to it. \n“In contrast to traditional labels found on tobacco and alcohol, digital labels can be designed to be intelligent and interactive,” Dr Ali said. “While tobacco and alcohol cannot tell their ‘users’ to stop, software fortunately can. \n“But the development of intelligent software able to understand users and personalize the labels so that they fit their context, preferences and values to ensure their effectiveness are all challenges we still have to address.” \nThe BU research, conducted in partnership with Streetscene Addiction Recover Ltd, found that people were more likely to take notice of motivational messages, rather than those focusing on potential negative impacts of spending too much time on a device. \nPossible solutions could include altering the digital interface – such as the screen changing from green to red or a buzzing to indicate excessive usage – or personalised messages and graphics related to a person’s interests and usage. \nDr Ali added: “We would like to see a policy change in the production of digital media so that it helps people to make informed decisions about their usage with regard to digital addiction. \n“We would also like to see more public awareness of the potential side effects of the obsessive usage of technology, or at least encourage people to make a self-assessment exercise around it.”", "external_links": [], "published": "2015-10-06T16:05:00.000+03:00", "crawled": "2015-10-08T08:47:49.857+03:00", "highlightTitle": ""}