{"organizations": [], "uuid": "64d63d2a85a0fe5ab3d78f35e255f282db671161", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30303055/twain-working-group-and-pdf-association-announce-partnership", "country": "US", "title": "TWAIN Working Group and PDF Association Announce Partnership", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "TWAIN Working Group and PDF Association Announce Partnership - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:11:00.000+03:00", "replies_count": 0, "uuid": "64d63d2a85a0fe5ab3d78f35e255f282db671161"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30303055/twain-working-group-and-pdf-association-announce-partnership", "ord_in_thread": 0, "title": "TWAIN Working Group and PDF Association Announce Partnership", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Groups will work together to prepare a specification for PDF/Raster (PDF/R)\nRaleigh, NC\nThe TWAIN Working Group (TWG), a not-for-profit organization designed to provide and foster a universal public standard which links applications and image acquisition devices, today announced its partnership with the PDF Association. TWG and the PDF Association have agreed to work together in the coming months on refining a specification for PDF/Raster (PDF/R). PDF/R is a component of TWG’s TWAIN Direct initiative, a language/protocol that eliminates the need for users to install vendor specific drivers as communication between scanning devices and image capture software applications. TWAIN Direct addresses the need for something simple and direct that expedites application development and results in a feature-rich end user experience. TWAIN Direct supports direct network communication between mobile and desktop applications and scanning devices, including cloud platforms. New in the TWAIN Direct Specification is PDF/R, which provides image file format guidelines that can be implemented across a wide range of imaging devices. PDF/R is designed to be efficient to implement on any scanner, to be easy to parse by applications, and be 100% compatible with ISO-standardized PDF and PDF-consuming applications. As part of the partnership, the PDF Association will launch a Technical Working Group within its organization to create awareness about PDF/R, and provide review and input on the PDF/R specification from its members. The final specification may be used for ISO Fast Track submission.\nStated Pamela Doyle, Chair and CEO of the TWAIN Working Group, “We are excited to be partnering with the PDF Association on the development of the PDF/R specification. The TWAIN Direct language is designed to revolutionize how scanners and software communicate. PDF/R, an integral part of this language, provides the portability of PDF while offering the core functionality of TIFF. PDF/R is a strict subset of the ISO-standardized PDF file format for storing and transporting raster image documents, especially scanned documents. Who better than the PDF Association to help us further develop this specification and make it the very best we can offer to the scanning community? We expect the collaboration to provide the TWG with important information and guidance as we continue the specification development process.”\n“We look forward to contributing to the development of the PDF/R specification and creating awareness of the specification among PDF Association members, in the imaging industry and to the general public,” said Duff Johnson, Executive Director of The PDF Association. “We are supportive of the TWAIN Direct initiative, and want to demonstrate that support through our collaboration with TWG on furthering the PDF/R specification. We look forward to a successful working relationship with TWG.”\nAbout TWAIN Direct\nDerived from the proven TWAIN specification which currently enables more than 150 scanning device capabilities, TWAIN Direct eliminates the need for users to install vendor specific drivers as communication between scanning devices and image capture software applications. TWAIN Direct addresses the need for something simple and direct that expedites application development and results in a feature-rich end user experience, and it supports direct network communication between mobile and desktop applications and scanning devices, including cloud platforms. TWAIN Direct reduces development time from weeks to days, supports modern programming languages, and delivers a better user experience with a full feature set best suited for any application.\nAbout The PDF Association\nFirst established as the PDF/A Competence Center in 2006, today, the PDF Association is an international organization promoting awareness and adoption of open standards in digital document applications using PDF technology. The association facilitates education, networking and communication, and the sharing of expertise and experience with interested parties worldwide. The current membership includes over 100 enterprises and numerous individual subject-matter experts from more than 20 countries. http://www.pdfa.org\nAbout The TWAIN Working Group\nThe TWAIN Working Group, established in 1992, is a not-for-profit association of industry leaders who have gathered to create a standard that benefits the imaging industry as a whole. TWAIN's purpose is to provide and foster a universal public standard which links applications and image acquisition devices. The ongoing mission of this organization is to continue to enhance the standard to accommodate future technologies. TWAIN generates multiple opportunities for application developers and users to access information and broaden the standard; through a developers forum (twainforum.org), main website (twain.org), Wikipedia page and online self-certification process. More information, to include white paper and current specifications about TWAIN Direct and PDF/R can be obtained at twaindirect.org, pdfraster.org and twain.org.\n //www.prweb.com/releases/2015/10/prweb13025776.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13025776.htm"], "published": "2015-10-20T14:11:00.000+03:00", "crawled": "2015-10-22T09:15:19.585+03:00", "highlightTitle": ""}