{"organizations": [], "uuid": "289c5e8fb621b9209af6e831907f0bd06cf3793e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newser.com", "main_image": "http://img1-azcdn.newser.com/image/1038976-0-20151001181247.jpeg", "site_section": "http://rss.newser.com/rss/section/7.rss", "section_title": "Technology from Newser", "url": "http://www.newser.com/story/213800/is-samsung-pulling-a-vw-with-its-tvs.html", "country": "US", "title": "Is Samsung Pulling a VW With Its TVs?", "performance_score": 0, "site": "newser.com", "participants_count": 1, "title_full": "Is Samsung Pulling a VW With Its TVs?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T02:12:00.000+03:00", "replies_count": 0, "uuid": "289c5e8fb621b9209af6e831907f0bd06cf3793e"}, "author": "Michael Harthorne", "url": "http://www.newser.com/story/213800/is-samsung-pulling-a-vw-with-its-tvs.html", "ord_in_thread": 0, "title": "Is Samsung Pulling a VW With Its TVs?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is Samsung Pulling a VW With Its TVs? Claims of TVs cheating efficiency tests pour in By Michael Harthorne   Oct 1, 2015 6:12 PM CDT COMMENTS (15) (Newser) – Claims are coming in from multiple European countries that television manufacturers are pulling a Volkswagen and installing software to cheat energy-efficiency tests, the BBC reports. An EU-funded lab presented findings Tuesday that showed televisions manufactured by Samsung—the largest television manufacturer in the world—cut their energy consumption nearly in half during efficiency tests through their \"motion lighting\" feature, which would activate under test conditions but not under normal viewing. Critics are comparing it to this month's Volkswagen scandal, in which the company installed software to fool emissions tests, according to the Guardian . “There is no comparison,” a Samsung spokesperson says. “This is not a setting that only activates during compliance testing.\" Earlier this year, the Swedish Energy Council complained to the European Commission that another, unnamed television manufacturer had sets that recognized the standard test video and immediately dimmed to cut energy use when the video started, the BBC reports. And the United Kingdom complained about similar \"defeat software\" in televisions three years ago, according to the Guardian . Televisions in Europe account for the equivalent of the total electrical consumption of Sweden and Europe every year. If televisions are cheating efficiency tests, that means energy consumption, electricity bills, and carbon emissions are all higher than advertised. The European Commission says it will be investigating the claims. Samsung televisions are being accused of cheating energy-efficiency tests in Europe (AP Photo/Jae C. Hong, file) ADVERTISEMENT", "external_links": [], "published": "2015-10-02T02:12:00.000+03:00", "crawled": "2015-10-02T12:42:23.524+03:00", "highlightTitle": ""}