{"organizations": [], "uuid": "ea1dc6f77be011c1df1523ac8d9de889d336a6f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emirates247.com", "main_image": "http://cdn-wac.emirates247.com/polopoly_fs/1.586147.1427941034!/image/623579376.jpg", "site_section": "http://www.emirates247.com/cmlink/en/mobile-technology-1.512834?localLinksEnabled=false", "section_title": "Mobile Technology", "url": "http://www.emirates247.com/news/emirates/gitex-shopper-dubai-guide-timings-tickets-millions-in-prizes-travel-2015-10-02-1.605343", "country": "US", "title": "Gitex Shopper Dubai guide: Timings, tickets, millions in prizes, travel…", "performance_score": 0, "site": "emirates247.com", "participants_count": 1, "title_full": "Gitex Shopper Dubai guide: Timings, tickets, millions in prizes, travel…", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:54:00.000+03:00", "replies_count": 0, "uuid": "ea1dc6f77be011c1df1523ac8d9de889d336a6f2"}, "author": "Bindu Rai", "url": "http://www.emirates247.com/news/emirates/gitex-shopper-dubai-guide-timings-tickets-millions-in-prizes-travel-2015-10-02-1.605343", "ord_in_thread": 0, "title": "Gitex Shopper Dubai guide: Timings, tickets, millions in prizes, travel…", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gitex Shopper Dubai guide: Timings, tickets, millions in prizes, travel Begins tomorrow at Dubai World Trade Centre By Published Friday, October 02, 2015 \nBundles and bumper prizes, including free cars and kilos of gold, offer a Dh3 million booty as the Gitex Shopper returns for its autumn season on October 3. \nThe eight-day consumer electronics shopping convention is bound to see thousands throng to the Dubai World Trade Centre to cash in on the deals. \nVisitors will stand the chance to bag a bundle of prizes including a Mitsubishi Pajero, a Dell Inspiron 11 2-in-1, a Samsung Galaxy A5 at the 25th minute of every hour, every day, along with a range of home appliances that includes refrigerators, televisions and more. \nOf course, with Dubai being the City of Gold, visitors can also win 25 pieces of the yellow metal, weighing 25 grams each, to mark the event’s quarter anniversary. \nMeanwhile, Mashreq has rolled out a guaranteed ‘Fly for Free’ offer, where customers can shop with and get an assured return air ticket free on spends of Dh10,000, a guaranteed free one-way air ticket on spends of Dh7,000 and a travel voucher worth Dh300 for purchases of Dh3,500. \nCustomers also get the flexibility to select an air-ticket from 25 popular destinations handpicked for them. \nFor those planning to shop for a bargain, and perhaps drive home in a new car in the process, here’s a guide to help you plan the journey for these eight days of shopping: \nWhen are the dates for Gitex Shopper 2015 Autumn edition and its timings? \nGitex Shopper 2015 will run from October 3 to 10 at the Dubai World Trade Centre. \nThe show will run from 11am to 11pm on all days. \nWhat is the price of the tickets and where can I purchase them? \nTickets are priced Dh30 per person. You can buy them in advance at select Emarat petrol station outlets and select Zoom outlets at metro stations; or you can also purchase tickets at the venue itself on the day. \nEntrance for children below the age of five years is free. \nChildren below the age of 14 years must be accompanied by an adult at all times. \nCan I travel to Gitex Shopper using Dubai Metro facilities? \nYes. The Dubai Metro’s red line World Trade Centre Station serves the exhibition centre, which the organisers say is the fastest way to reach the Shopper without the long queues for the car park. \nFor international travellers, the route also connects the exhibition centre with the Dubai International Airport, along with major stops throughout the city. \nTrains run every seven minutes to all major business, tourist and residential areas, with options such as Park and Ride, or feeder buses at select stations. \nCar parking facilities area available on the Red Line at Rashidiya (2,700 Spaces) and Nakheel Harbour and Towers (3,000 spaces) and on the Green Line Etisalat (3,000 car park spaces). \nHowever, there is also free parking available next to the Jafiliya Metro Station, which is one stop over from the Gitex Shopper. \nThe Dubai Metro runs from 5.50am-midnight from Saturday to Wednesday. \nOn Thursdays, timings extend to 1am, while on Fridays, the metro commences at 10am and runs until 1am. \nIf I still want to bring my car, what are the parking facilities available? \nA build-up of traffic is expected around the Trade Centre roundabout and parallel roads and it is advisable to use public transportation. \nHowever, if you still prefer to drive to the venue on any of the eight days, free parking is available at Car Parks 1A, 1B and 1C opposite the Novotel Hotel and Car park two located opposite Zabeel Hall. \nPaid parking closer to the venue is also available at the multi-storey Car Park (Levels 3 to 6) and the Sheikh Rashid Tower car park located next to Trade Centre Arena and Halls 1 and 2. \nThe charges are Dh10 per hour. \nMachines will be available at the exit cashier on the fourth floor of the multi-storey car park. For lost parking tokens, people will be charged at Dh150. \nWill taxis be available if I am unable to travel by Metro with big purchases? \nAt the exhibition venue, there are two taxi stands: opposite Ibis Hotel and in front of Zabeel Hall entrance. \nIf you don’t want to leave it to chance, you can book a taxi from any pick up point of your choice call 04 208 0808 \nWhen is the best time to attend Gitex Shopper 2015 Autumn edition? \nDuring weekdays, several visitors will maintain work hours, according to retailers, making the first half of the day the best time to slip away and take in a bit of shopping. \nRetailers have stated historically crowds usually surging from 4pm and peaking around 8pm. \nAlso keep in mind, the last two days of the Shopper are over the weekend, so brace yourself for the crowds. \nIs there any way I could avoid the traffic? \nUsing the public transport system is probably your best alternative here. \nHowever, if you choose not to utilise it and prefer to avoid the Trade Centre gridlock also, an alternative would be to park on the opposite side of the WTC metro station – across Sheikh Zayed Road – and use the overhead bridge to cross. \nAnother alternative is to park elsewhere and carpool with your friends and colleagues to the venue. Share with a friend or colleague Your e-mail address:", "external_links": [], "published": "2015-10-02T08:54:00.000+03:00", "crawled": "2015-10-02T09:09:50.975+03:00", "highlightTitle": ""}