{"organizations": [], "uuid": "a68549a8a066481e0a0d361013b53dafa7f3f314", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144996/sequent-launches-token-service-platform-supporting-all-card-types-and-networks", "country": "US", "title": "Sequent Launches Token Service Platform Supporting all Card Types and Networks", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Sequent Launches Token Service Platform Supporting all Card Types and Networks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T12:00:00.000+02:00", "replies_count": 0, "uuid": "a68549a8a066481e0a0d361013b53dafa7f3f314"}, "author": "admin", "url": "http://www.freshnews.com/news/1144996/sequent-launches-token-service-platform-supporting-all-card-types-and-networks", "ord_in_thread": 0, "title": "Sequent Launches Token Service Platform Supporting all Card Types and Networks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/26/2015 @ 3:00 AM Companies mentioned in this article: Sequent Software \nLAS VEGAS, Oct. 26, 2015 /PRNewswire/ -- Money 2020 ,- Sequent Software, the platform bringing cards to mobile, has launched the first Token Service Platform (TSP) to support all types of cards including credit, debit, prepaid and access control credentials. Compatible with all major credit and debit card networks, Sequent Token Service Platform allows banks to deploy a single solution to support their entire credit and debit card portfolio plus profitable private label and prepaid cards. \n\"Tokenization is an essential security component of emerging mobile payments and every issuer of plastic cards must be enabled to issue tokens for their entire card portfolio in the near future,\" said Hans Reisgies, Sequent Chief Technology Officer. \"Sequent Token Service Platform gives issuers ownership of this foundational technology, and brings all their cards to mobile without having to rely on multiple third party providers.\" \nThe Sequent Token Service Platform is a full-service suite with all modules needed to digitize card data: tokenization, card data prep and trust authority. Modules may be deployed together or separately depending on the needs of issuers and existing legacy systems. The Sequent Token Service Platform is compatible with EMV Payment Tokenization Specifications. \nCPI Card Group, Sequent's strategic partner in North America now offers this service to its customers. \"Our customers already have access to Sequent's market leading mobile technology platform, and the development of the Token Service Platform further strengthens our overall value proposition in this emerging market\", said CPI's President and CEO Steve Montross. \"We are focused on providing innovative payment products and services that meet our customer needs today and in the future. Sequent's mobile technology enables us to do this,\" concluded Montross. \n\"Banks and processors looking for differentiation and control over customer data in the age of mobile payments should deploy their own token service to protect their business relationships and customer data,\" said John Kirst, Sequent Chief Revenue Officer. \"Sequent gives them a robust, network agnostic solution that makes their apps 'top of wallet' and 'top of app' on mobile connected devices for transactions anywhere. \nUsing Sequent TSP, issuers can support issuance of all card scheme-based cards to their apps and not have to independently manage issuance for each card scheme. In addition, banks can use this platform to issue private label cards to merchant partners and their apps. It opens the door for banks to partner with retailers in card issuance thereby giving them not only top-of-wallet effect but also top-of-app. \nThe Sequent Token Service Platform increases the security of mobile transactions by replacing sensitive personal account information with less valuable \"tokens\". These tokens are then provisioned to all types of mobile devices, from smart phones to wearables, letting consumers make payments and open doors anywhere. \nAbout Sequent \nSequent Platform brings cards to mobile and makes them useful for consumers. Sequent enables banks, transit agencies and any other issuer to securely digitize their credit, debit, transit, loyalty or ID cards and distribute them to their own application, and to any other application using the Sequent Platform. Sequent's simple APIs empower the app developer community to bring cards to all apps on mobile, wearable, and other connected devices enabling consumers to make payments, redeem offers, open doors, and ride transit systems. Sequent Platform includes: Token Service Platform (TSP), Card and Wallet Management Platform, and Trust Authority. \nContact: Marcelo Delima, marcelo.delima@sequent.com, 650-776-7109 \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/sequent-launches-token-service-platform-supporting-all-card-types-and-networks-300165301.html \nSOURCE Sequent Software", "external_links": [], "published": "2015-10-26T12:00:00.000+02:00", "crawled": "2015-10-26T14:19:56.949+02:00", "highlightTitle": ""}