{"organizations": [], "uuid": "98144509be1a63fbc790120a310951204b184f84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theglobeandmail.com", "main_image": "http://static.theglobeandmail.ca/32c/report-on-business/article25958103.ece/ALTERNATES/w620/Amaya+20150813.JPG", "site_section": "http://www.theglobeandmail.com/technology/", "section_title": "Technology - The Globe and Mail", "url": "http://www.theglobeandmail.com/technology/tech-news/amaya-limits-daily-fantasy-sports-betting-in-us-pending-new-regulations/article26874004", "country": "CA", "title": "Amaya limits daily fantasy sports betting in U.S. pending new regulations", "performance_score": 0, "site": "theglobeandmail.com", "participants_count": 1, "title_full": "Amaya limits daily fantasy sports betting in U.S. pending new regulations - The Globe and Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T01:06:00.000+03:00", "replies_count": 0, "uuid": "98144509be1a63fbc790120a310951204b184f84"}, "author": "Ross Marowits", "url": "http://www.theglobeandmail.com/technology/tech-news/amaya-limits-daily-fantasy-sports-betting-in-us-pending-new-regulations/article26874004", "ord_in_thread": 0, "title": "Amaya limits daily fantasy sports betting in U.S. pending new regulations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A A Online gaming company Amaya Inc. is limiting the availability of its daily fantasy sports betting south of the border in the face of regulatory concerns raised in some U.S. states.\nMontreal-based Amaya said Monday that it will continue to operate StarsDraft in New Jersey, Massachusetts, Kansas and Maryland. However, it chose to stop operations in most other states in addition to recently suspending activities in Florida and Nevada and declining to launch in Michigan.\nThe Nevada Gaming Control Board recently determined that daily fantasy sports operations are required to obtain gambling licences.\n“Amaya supports the decision by the board and believes that it is prudent to limit the StarsDraft offering until such time as more states adopt a clear stance on daily fantasy sports,” the company said in a news release.\nLarger rivals DraftKings and FanDuel haven’t said if they’ll pursue a licence in Nevada.\nLegislators in several states said they are reviewing Nevada’s decision and whether their state’s criminal gambling laws apply to daily fantasy sports.\nAmaya said the company’s decision shouldn’t have a negative financial impact on the company. Players can continue to withdraw funds from their online accounts.\nThe owner of PokerStars entered the daily fantasy sports business about a month ago with the acquisition of Victiv, which it relaunched as StarsDraft. The site allows players to build a roster of their favourite sports stars and compete for real money.\nAmaya has been testing its own sports betting activities in Europe but is moving slowly in North American because the market is very small, with less than $100-million in industry revenues last year.\nThe company suspended its daily fantasy sports betting in Canada after acquiring Victiv.\nAmaya’s decision to pause its daily fantasy sports activities makes sense, coming soon after New Jersey approved its application to offer online gambling that will mark a return to the U.S., said analyst Ralph Garcea of Cantor Fitzgerald.\n“You’ve got to be on the side of the regulators. Especially now that they’ve been approved in New Jersey I don’t think you want to get on any state’s bad side,” he said in an interview.\nGarcea said Amaya can bide its time until the daily fantasy market develops over the next few years. Globally, sports betting is a US$40-billion-a-year business and Amaya stands to gain billions of dollars in annual revenues, he said.\n More Related to this Story Amaya’s deal to operate in New Jersey causes shares to surge\nAmaya readies for NFL season with fantasy sports betting acquisition\nAMF seized Amaya computers and records, warrant reveals\nTopics: Technology Comments A A", "external_links": [], "published": "2015-10-20T01:06:00.000+03:00", "crawled": "2015-10-20T00:15:10.324+03:00", "highlightTitle": ""}