{"organizations": [], "uuid": "4f09f3a86f4756717737d30ef02f5194d4733421", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141604/infolob-solutions-inc-announces-great-success-anniversary-its-healthier-resources-inco", "country": "US", "title": "Infolob Solutions, Inc. announces great success on the anniversary of its Healthier Resources Incorporated (HRI) acquisition.", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Infolob Solutions, Inc. announces great success on the anniversary of its Healthier Resources Incorporated (HRI) acquisition.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:19:00.000+03:00", "replies_count": 0, "uuid": "4f09f3a86f4756717737d30ef02f5194d4733421"}, "author": "admin", "url": "http://www.freshnews.com/news/1141604/infolob-solutions-inc-announces-great-success-anniversary-its-healthier-resources-inco", "ord_in_thread": 0, "title": "Infolob Solutions, Inc. announces great success on the anniversary of its Healthier Resources Incorporated (HRI) acquisition.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/16/2015 @ 5:19 AM Companies mentioned in this article: Infolob Solutions \nDALLAS, Oct. 16, 2015 /PRNewswire-iReach/ -- Infolob Solutions, Inc. today announces the anniversary of its acquisition of Healthier Resources Incorporated (HRI). Infolob Soultions also takes this opportunity to share some of the many success stories during the year and excitement about the bright future this merger will bring for our retail clients. \nOver the past year, Infolob Solutions' acquisition has enabled us to provide some of the following retail clients to conduct business more efficiently, less expensively, and realize greater profitability: -- Using our specialized retail consultants, we successfully transitioned a major clothing retailer to help in its consolidation process to increase efficiency within their four business lines. -- The acquisition enabled Infolob Solutions to land a large redesign for a clients' Oracle ebusiness suite application. \"This effort was delivered by our retail delivery team and is just one of the many excellent solutions that are a key part of our retail business we can replicate through our clients,\" said Troy Rounds, Infolobs' VP, Practice Head, Enterprise Business Solutions. -- We solutioned a major public sector client by enabling them to exploit the product contained within their Oracle product portfolio, greatly improving efficiency and providing cost savings. \n\"This acquisition has greatly enhanced our ability to deliver to Infolob Solutions' retail client sector. I am happy to see the great success we have realized over the past year and am excited for what opportunities lie in the future,\" Said Travis Reep, VP, Retail Sales at Infolob Solutions. Reep continued, \"In addition, our retail sector clients will have test capability opportunities within our newly-upgraded Center of Excellence environment.\" \n\"On the anniversary of our acquisition, we at Infolob Solutions celebrate and embrace the transition of the HRI team,\" said Vijay Cherukuri, Infolob's CEO. Cherukuri continued, \"We have made this acquisition a very smooth process that benefits our many retail sector clients greatly and adds strength to our leadership in this arena.\" \nAbout Infolob Solutions \nInfolob Solutions is an Oracle software solutions and Development Company headquartered in the Los Colinas area of Dallas, TX. Founded in 2009, Infolob has emerged as a significant player in Engineered Systems, Managed IT Services, Cloud, IT Staffing and Consulting, and Application Portfolio Management, specializing in Enterprise Application Software. We develop solutions that help global companies automate complex business processes and open those processes to business partners, customers, and employees. Infolob maintains offices in Texas, North Carolina, and Hyderabad, India. For more information, please visit www.infolob.com . \nTrademarks \nOracle is a registered trademark of Oracle and/or its affiliates. Infolob is a registered trademark of Infolob Solutions, Inc. and/or its affiliates. \nMedia Contact: Charles McFarland, INFOLOB SOLUTIONS, INC, 972-342-3890, charles.mcfarland@infolob.com \nNews distributed by PR Newswire iReach: https://ireach.prnewswire.com \nSOURCE Infolob Solutions", "external_links": [], "published": "2015-10-16T15:19:00.000+03:00", "crawled": "2015-10-16T17:13:51.992+03:00", "highlightTitle": ""}