{"organizations": ["Canfield Windsor House"], "uuid": "ba0608b17900f91fdd299a74b798318d9e0c0b65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/business", "section_title": "Vindy.com stories: Business & Technology", "url": "http://www.vindy.com/news/2015/oct/01/canfield-windsor-house-continues-progres/", "country": "US", "title": "Canfield Windsor House continues progress with local, state approval", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Canfield Windsor House continues progress with local, state approval", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T07:00:00.000+03:00", "replies_count": 0, "uuid": "ba0608b17900f91fdd299a74b798318d9e0c0b65"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/01/canfield-windsor-house-continues-progres/", "ord_in_thread": 0, "title": "Canfield Windsor House continues progress with local, state approval", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Thu, October 1, 2015 @ 12:00 a.m. \nBy ROBERT CONNELLY \nrconnelly@vindy.com \nCANFIELD \nA proposed nursing home project to bring more than 70 jobs to the Canfield community took its last step for township zoning requirements this week. \nLoran Brooks, chairman of the Canfield Township Zoning Board of Appeals, said John Masternick, owner of Girard-based Windsor House, said the special permit for the proposed facility was approved at a meeting Monday night. The special permit was needed because of township zoning laws. \n“It’s been a long process for him,” Brooks said of Masternick. \n“It’s fabulous. I had my doubts early on in the process if we would get the local approval, but once we did, we initiated our application with the state department of health,” Masternick said. “I’m really pleasantly surprised, and the outcome could not have been better.” \nA joint economic development district – JEDD – was formed between the township and city to make way for the 72-bed nursing home facility that will be bordered by state Route 446 and the Mill Creek MetroParks Farm in the township. \nIt will bring between 72 and 80 jobs to Canfield, and construction has been estimated at $10 million to $12 million. The township would collect real-estate taxes, while the city would collect income tax from the owner and employees. That would be at the city’s current income-tax rate of 1 percent. \nMasternick also cleared a hurdle with the Ohio Department of Health, which approved him for a certificate of need. That gave Masternick “the green light to go forward,” he said. \nNow architects will continue to work on the design of the complex – now in its third revision of design plan. The goal remains to begin building in spring 2016 after going to bid. \nMasternick said it would be a 12-month build and jobs for the facility, as well as taking applications for residents, would begin in January 2017. \nThe facility has yet to be named, but Masternick said there could be a contest in Canfield to select a name. “We try to tie” the name of our facilities “into the community” they are in, he said. Other stories of interest", "external_links": [], "published": "2015-10-01T07:00:00.000+03:00", "crawled": "2015-10-03T06:19:09.503+03:00", "highlightTitle": ""}