{"organizations": [], "uuid": "ed8b764b70ab8493c8cf6fcfafc1c049e8e708bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143820/motionloft-expands-presence-mexico-motionloft-mx-s-a-de-c-v-", "country": "US", "title": "Motionloft expands presence to Mexico with Motionloft MX S.A. de C.V.", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Motionloft expands presence to Mexico with Motionloft MX S.A. de C.V.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:00:00.000+03:00", "replies_count": 0, "uuid": "ed8b764b70ab8493c8cf6fcfafc1c049e8e708bf"}, "author": "admin", "url": "http://www.freshnews.com/news/1143820/motionloft-expands-presence-mexico-motionloft-mx-s-a-de-c-v-", "ord_in_thread": 0, "title": "Motionloft expands presence to Mexico with Motionloft MX S.A. de C.V.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/21/2015 @ 9:00 AM   Motionloft \nSAN FRANCISCO, Oct. 21, 2015 /PRNewswire/ -- Motionloft ( http://www.motionloft.com ), has gained a full service sales office in Mexico City as well as extended coverage to over 18 states in the country of Mexico with the relationship of newly created Motionloft MX (MLMX). The Motionloft global solution has installation, connectivity and immediate data delivery to a new market and client base. \nIn addition to the applications used by the United States customers of property owners, retailers and cities, Mexico offers unique opportunities with shopping centers, public government and private infrastructure. \n\"Motionloft Mexico has an incredible opportunity in three main sectors, FIBRAS (REITS); global retailers, and businesses whose income depends on understanding traffic flow of people and vehicles,\" said Eduardo Neuman, founder of MLMX. \nSince the 2010 authorization for FIBRAS (REITS), Mexico has experienced a real estate boom in shopping centers all across the country. In Mexico City alone, with over 20 million inhabitants, there are more than 6.5 million square meters (65 million SF) of commercial space, 33% of the national total. Infrastructure in Mexico uses private businesses for public parking lots, and highway toll booths. Motionloft technology can replace the current manual solutions used, with great accuracy and real time data. For government applications, Motionloft will provide studies to determine traffic patterns in order to provide the basic public services such as housing, public transportation, metro and hospitals. \n\"We've created an opportunity for organizations to see a dashboard view of what's happening around them,\" said Mark Cuban, American businessman, investor, and owner of the NBA's Dallas Mavericks. \"Combining our advanced analytics systems with the exploding need in Mexico creates a game-changing solution for counting vehicle and pedestrian traffic.\" \nAbout Motionloft Motionloft is an investment of Mark Cuban Companies and is based in San Francisco, California. Motionloft provides data analytics serving pedestrian and vehicle real time counts to many of the largest retailers and property owners in the world plus smart cities. Motionloft is disrupting how physical counting is done in the real world. \nFor more information on Motionloft visit www.motionloft.com ; and www.motionloft.com.mx \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/motionloft-expands-presence-to-mexico-with-motionloft-mx-sa-de-cv-300163892.html \nSOURCE Motionloft", "external_links": [], "published": "2015-10-21T19:00:00.000+03:00", "crawled": "2015-10-21T20:12:46.226+03:00", "highlightTitle": ""}