{"organizations": [], "uuid": "467fbf9d5df7054d34985b68700c8dd00cc172f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/198", "section_title": "Artipot: Science and Technology > Gadgets and Gizmos Articles", "url": "http://www.artipot.com/articles/1942412/evaluating-iot-data-storage-in-the-cloud.htm", "country": "US", "title": "Evaluating IoT Data Storage in the Cloud (Jade Witte)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Evaluating IoT Data Storage in the Cloud (Jade Witte)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T10:03:00.000+03:00", "replies_count": 0, "uuid": "467fbf9d5df7054d34985b68700c8dd00cc172f6"}, "author": "", "url": "http://www.artipot.com/articles/1942412/evaluating-iot-data-storage-in-the-cloud.htm", "ord_in_thread": 0, "title": "Evaluating IoT Data Storage in the Cloud (Jade Witte)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 8, 2015Summary Notes of Article:-) Companies use Internet of Things (IoT) devices to boost customer satisfaction and to help them make better business decisions. However, the data provided by these devices is large and needs to be stored. This is causing companies to take a second look at their data storage infrastructures and often make changes.-) Many companies choose to store this data on premises, claiming it will be too expensive or is too sensitive to have it in the cloud. -) The cloud has many advantages over on-premises storage for IoT data: --) It offers a direct connection between the device and the public cloud provider. It can also be sent from the device to the cloud much faster. --) The cloud provider becomes responsible for storage management. --) It is easier to process IoT data through the cloud.-) Between the highest concerns for using the cloud for IoT data storage, security is the main one. A lot of the information captured by these devices is sensitive information or proprietary to the organization.-) The cost to store the IoT data set is another concern. Cloud costs are inexpensive when considered on a per-gigabyte, per month. However, if you're looking to store petabytes of data for decades it isn't the same story.-) When an organization decides to store IoT data in a dedicated data-center, they need to decide whether to use a private cloud architecture or traditional NAS array. The goal is to make sure data is stored reliably and cost-effectively with minimal staffing.-) Most IoT devices have the purpose of capturing data. If an enterprise has chosen to keep this information on-premises, they need to start building the infrastructure now.The data that IoT devices generate needs to be stored. The cloud seems like the obvious choice. However, organizations fear for security and costs. Here's an interesting article about the pros and cons of using o-premises storage versus cloud storage for this data. About the Author", "external_links": [], "published": "2015-10-10T10:03:00.000+03:00", "crawled": "2015-10-10T12:58:08.706+03:00", "highlightTitle": ""}