{"organizations": [], "uuid": "57d428d9efb914b0ce26f5df143eb549afb76294", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adweek.com", "main_image": "http://www.adweek.com/files/2015_Oct/uprising-vr-studio-hed-2015.png", "site_section": "http://feeds.adweek.com/adweek/technology", "section_title": "Adweek : Technology", "url": "http://www.adweek.com/news/technology/company-making-big-bet-future-virtual-reality-167662", "country": "US", "title": "This Company Is Making a Big Bet on the Future of Virtual Reality", "performance_score": 0, "site": "adweek.com", "participants_count": 1, "title_full": "This Company Is Making a Big Bet on the Future of Virtual Reality", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:00:00.000+03:00", "replies_count": 0, "uuid": "57d428d9efb914b0ce26f5df143eb549afb76294"}, "author": "Tim Baysinger", "url": "http://www.adweek.com/news/technology/company-making-big-bet-future-virtual-reality-167662", "ord_in_thread": 0, "title": "This Company Is Making a Big Bet on the Future of Virtual Reality", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This Company Is Making a Big Bet on the Future of Virtual Reality Building an all-VR content studio By Tim Baysinger October 20, 2015, 9:00 AM EDT Creative Uprising goes all-in on nascent technology Darnell Works After dabbling in virtual reality, production house The Uprising Creative is going all-in on the immersive technology. In a move co-founder Jeff Nicholas called \"inevitable,\" the Los Angeles-based content studio is launching VEHICLEvr , which will focus exclusively on creating and developing virtual reality content. Nicholas, who will serve as managing director and head of development, told Adweek that since debuting the short film Our Reality Is Virtual starring Kenan Thompson, The Uprising Creative has been working on more original content for the VR space. Though VR is still very much in its infancy, Nicholas is bullish on the future of the technology, pointing to next month's launch of the Samsung Gear VR powered by Oculus. The $99 headset will be the first to be made widely available to consumers. \"VR right now is poised to go really mainstream, really quick,\" Nicholas said, adding, \"It's going to require a lot of really great content.\" The launch of the Gear VR should help quell one of the biggest concerns about the technology—that most viewers aren't able to see the content the way it's intended to be seen. When viewed on YouTube, for instance, viewers can use the platform's 360-degree capabilities, but they lose the immersive feel VR is intended to provide. \"You can get it out pretty significantly that way, but the experience isn't immersive—it isn't what VR promises,\" said Nicholas. \"The amount of people that can actually see it in the way it was intended is definitely smaller.\" That's the challenge for brands that are wary of diving into VR. \"It's like there's a big hole in the ground and everyone's standing around the hole, and they're going, 'I know if I jump in there, there's probably something really rad, but I don't want to be the first one to go,'\" he said. The studio expects up to 40 percent of VEHICLEvr's video to be branded or sponsored content and has at least 10 projects in the pipeline already. \"Everybody that we've talked to really wants to be involved in it. They see the future in it,\" Nicholas said, noting that brands like Nike and Under Armour are looking to learn more. \"There's a chasm there that we're all trying to cross right now. We see traditional commercials and campaigns that don't involve a VR aspect getting their budgets trimmed.\" Get the Technology Today newsletter: \nCheck out our other newsletters: Daily Digest", "external_links": [], "published": "2015-10-20T16:00:00.000+03:00", "crawled": "2015-10-20T17:18:12.193+03:00", "highlightTitle": ""}