{"organizations": [], "uuid": "0e26e3605e4f2fcd13d1941d96b3f74f555735a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.techradar.com", "main_image": "http://cdn.mos.techradar.com/art/mobile_phones/Samsung/Galaxy%20S6%20Edge/HandsOn2/MainImage-1200-80.JPG", "site_section": "http://techradar.com//rss/reviews", "section_title": "TechRadar: Technology reviews", "url": "http://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s6-edge-1286088/review", "country": "GB", "title": "Samsung Galaxy S6 Edge", "performance_score": 0, "site": "techradar.com", "participants_count": 47, "title_full": "Samsung Galaxy S6 Edge review | TechRadar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T18:58:00.000+03:00", "replies_count": 100, "uuid": "0e26e3605e4f2fcd13d1941d96b3f74f555735a3"}, "author": "John McCann", "url": "http://www.techradar.com/reviews/phones/mobile-phones/samsung-galaxy-s6-edge-1286088/review", "ord_in_thread": 0, "title": "Samsung Galaxy S6 Edge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Samsung Galaxy S6 Edge is a striking handset, taking the title as the world's first dual curved displays smartphone.\nIt attracts the eye, puts butterflies in my stomach and makes me weak at the knees. Samsung has, at last, made a handset which not only packs a powerful punch, but looks fantastic too. \nFollowing on from the Galaxy Note Edge which boasted a single curved screen, the Galaxy S6 Edge was rumored for some time so its arrival wasn't a surprise - it's the natural progression for Samsung's curved display technology.\n\nIt's certainly not cheap though, with the entry level 32GB model rocking a wallet trembling SIM-free price tag of around £700 (around $1030, AU$1320). \nIf you fancy 64GB or even 128GB of internal storage you're looking at approximately £749 (around $1120, AU$1430) and £829 (around $1180, AU$1500) respectively.\nShop around though and you'll be able to find it a little cheaper than Samsung's official site with the 64GB model available for around £635, $915 (about AU$1290) off contract.\nThat makes the Galaxy S6 Edge more expensive than the iPhone 6 Plus , a handset that already has my bank manager sweating.\nSamsung has announced some bad sales figures for the Galaxy S6 and Galaxy S6 Edge with news of both phones getting a \"price adjustment.\" We take that to mean the handsets are going to be dropped in price a little but there's no news on when it'll actually happen.\nSamsung also hasn't confirmed how much will be knocked off the price or whether the discount will come to all markets though.\nThe Galaxy S6 Edge arrives alongside the Samsung Galaxy S6 , and the two handsets share pretty much identical specs. The S6 Edge is slightly thicker (7mm vs 6.8mm), slightly lighter (132g vs 138g) and packs an ever so slightly bigger battery (2600mAh vs 2550mAh), but that's it.\nGalaxy S6 versus Galaxy S6 Edge \nIn short then, there's very little between the two, aside from the obvious inclusion of the two curved display edges on this device. It makes the £100 difference in price hard to swallow and me question why Samsung bothered making both handsets in the first place.\nFor those looking to upgrade from the Galaxy S4 , or even the Galaxy S5 , there are a few compromises for you to consider.\nIn an effort to get a slender handset with a metal unibody Samsung has removed the microSD slot, blocked access to the battery and shied away from dust and waterproofing.\n\nMany potential customers won't be too bothered about these omissions, but for power users who have stood by Samsung for its continued inclusion of expandable memory and removable battery this news will be difficult to hear.\nThat said, whip the Galaxy S6 Edge out when you're with your mates and they'll all be clambering over you to get a peek of your new SpacePhone.\nIt's also worth mentioning the Galaxy S6 Edge ran away with the Best Phone award at the TechRadar Phone Awards 2015 . The ceremony took place in July this year and our judges seemed to love the innovative curved display as well as Samsung's fully thought out redesign.\nWe are also expecting Samsung to introduce an Galaxy S6 Edge+ handset quite soon with rumors heating up in recent weeks. There's a Samsung Unpacked event scheduled for August 13, maybe we'll see it there.\nDesign I've already expressed my love for the Samsung Galaxy S6 Edge's design, but in truth this is a Jekyll and Hyde device.\nPlace the S6 Edge face up on a desk and you can't help but be impressed with the sweeping sides, rounded metal frame and overall premium appeal of the handset.\nThese are compliments usually reserved for the iPhone range and HTC's One series, but Samsung has managed to haul its design department into the 21st century banishing plastic to the lesser mobiles in its line up.\nThere's no question there are some similarities to Apple's design here. The placement of the headphone jack, microUSB port and machine drilled speaker holes on the base mimic the iPhone 6 , while the change from a volume rocker to separate metal keys on the left also suggests a Cupertino influence.\nWith the edges of the handset tapering to a very slender profile thanks to those dual curved displays there's no space for a SIM tray - plus that glass rear isn't coming off.\n\nThis has forced Samsung to the top of the handset where it lines up alongside an Infra Red blaster, handy for controlling your home entertainment systems.\nEveryone I showed the Galaxy S6 Edge was impressed by the handset's premium appeal and lush curves - that was until they actually picked it up.\nWhile the front of the S6 Edge is beautifully curved, the rear is as flat as a pancake, instantly making the handset feel a lot wider than it is.\n\nComing from the HTC One M9 which sports a lovely arching metal behind which nestles wonderfully into the palm, the S6 Edge never felt at home in my hand.\nThings are made a little more unbearable thanks to the metal frame which runs round the circumference of the device.\nOn the front it doesn't sit flush with the curved Gorilla Glass 4, creating a rather annoying lip which you don't get on the Galaxy S6 , while on the back the edges of the frame are sharp and dig into your hand.\n\nThe glossy glass rear offers little in the way of grip, which made me tighten my grasp on the handset, resulting in the frame digging into my palm more.\nIt's never going to draw blood, and I wasn't exactly in pain, but the S6 Edge is uncomfortable to hold for extended periods.\nHad Samsung repeated the curved design of the front on the rear the Galaxy S6 Edge would sit a lot better in the hand. It may make it slightly thicker, but that would mean a bigger battery and no camera protrusion - which in my book would be good things.\n\nSticking with the back and I have to say I'm a little disappointed. For all the good things I can say about how the Galaxy S6 Edge looks front-on, it all seems to be undone by a sloppily implemented rear.\nTrue, you don't spend much time looking at the back of your smartphone, but the rear of the Galaxy S6 Edge looks like it was a bit of an afterthought. \nI'm all for minimalism, but the flat, blank rear does nothing to ignite the senses and the bulky camera lens rearing its ugly head from the S6 Edge is a rather unattractive sight.\n\nThe Samsung Galaxy S6 Edge is available in white, black, gold and green - and the latter three reveal just how much of a fingerprint magnet it is.\nThere is some evidence of this on the white model when you turn the screen off, but the other colors reveal the full effect of the finger smudges - front and back.\nIn short, you'll find yourself cleaning your Galaxy S6 Edge regularly if you don't want your greasy paw prints on show.\n\nSamsung's iconic home button is retained on both the Galaxy S6 and S6 Edge, but it's been updated with a vastly improved fingerprint scanner (more on that later) and a sturdier construction.\nThis makes it feel more premium and resilient, while the touch sensitive 'back' and 'multi-tasking' keys flank it, illuminating only when required.\nThe design of the Samsung Galaxy S6 Edge is very good and a huge leap forward from the Galaxy S5 and even the Galaxy Note Edge .\nThe futuristic premium look and feel helps to justify its lofty price tag a little more, but a number of niggles detract from the overall experience.", "external_links": [], "published": "2015-10-22T18:58:00.000+03:00", "crawled": "2015-10-22T19:33:47.451+03:00", "highlightTitle": ""}