{"organizations": [], "uuid": "d728629e7f33b6679174e61a48c3c9bb648bac70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techcircle.vccircle.com", "main_image": "", "site_section": "http://techcircle.vccircle.com/feed", "section_title": "Techcircle.in - India startups, internet, mobile, e-commerce, software, online businesses, technology, venture capital, angel, seed funding", "url": "http://techcircle.vccircle.com/2015/10/12/tripoto-gets-funding-from-500-startups-idg-others/", "country": "US", "title": "Tripoto gets funding from 500 Startups, IDG, others", "performance_score": 0, "site": "vccircle.com", "participants_count": 1, "title_full": "Tripoto gets funding from 500 Startups, IDG, others", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:18:00.000+03:00", "replies_count": 0, "uuid": "d728629e7f33b6679174e61a48c3c9bb648bac70"}, "author": "Varun Arora", "url": "http://techcircle.vccircle.com/2015/10/12/tripoto-gets-funding-from-500-startups-idg-others/", "ord_in_thread": 0, "title": "Tripoto gets funding from 500 Startups, IDG, others", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| 0 Comments \nTripoto Travel Pvt Ltd, which owns and operates travel itinerary portal Tripoto.com , has raised an undisclosed amount in funding from investors led by 500 Startups, IDG Ventures and advantEdge Partners. \nNeeraj Arora, vice president at WhatsApp, and Stanhope Capital LLP chairman Leon Seynave also put money, Delhi-based Tripoto said in a statement. \nThe company said it will use the funds to improve technology and boost the site’s content by adding videos, using automated content creation tools and social publishing features, and enhancing personalisation. \nTripoto, which enables users to crowd-source travel itineraries and share experiences, was founded in September 2013 by Anirudh Gupta and Michael Pargal Lyngdoh. An alumnus of IIT Delhi and the Indian School of Business, Hyderabad, Gupta earlier co-founded another startup called Notion Ink. Prior to that, he was an entrepreneur-in-residence at Rocket Internet in Dubai. \nLyngdoh holds a master’s degree in economics from Delhi School of Economics and an MBA from ISB. Prior to co-founding Tripoto, he co-founded HST Operations (now HST Solar). He said users are publishing their travel itineraries and experiences in large numbers on the Tripoto platform. \nThe company claims to be the largest curated source of user-generated travel itineraries in the world, with around 250,000 itineraries created through its web and mobile publishing platforms. It also claims to have more than 1 million social interactions every month that include users messaging each other, adding trips to their wish list and following inspiring travelers in the community. \nThe company had, in March, raised an undisclosed amount in a pre-Series A round of funding from IDG Ventures India and existing investor Outbox Ventures. \nTripoto competes with Bangalore-based startups TripThirsty and Thrillophilia, which offer a marketplace model where buyers and sellers of travel activities and tours can interact. \n500 Startups is a Silicon Valley-based startup accelerator-cum-early stage VC fund. It recently closed its third fund with $85 million, less than the targeted $100 million, The Wall Street Journal reported citing sister publication VentureWire of Dow Jones. \nIDG Ventures India Management Co Ltd is a venture capital firm with $150 million under management. It provides finance for early- and growth-stage technology and technology-enabled companies in India. It recently put money in location-based casual dating app iCrushiFlush. \nadvantEdge Partners is an India-focused early-stage venture development fund founded in 2015. It focuses on emerging mobile-first tech sectors with potential to extend into a cross-border platform.", "external_links": [], "published": "2015-10-12T14:18:00.000+03:00", "crawled": "2015-10-12T14:44:24.175+03:00", "highlightTitle": ""}