{"organizations": [], "uuid": "7c5c503d1110fac7c67e8478eded44bb38c987e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-20/cd-dvd-drive-makers-said-to-face-eu-antitrust-fines-wednesday-ifzfltg6", "country": "US", "title": "CD, DVD Drive Makers Said to Face EU Antitrust Fines Wednesday", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "CD, DVD Drive Makers Said to Face EU Antitrust Fines Wednesday - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T21:53:00.000+03:00", "replies_count": 0, "uuid": "7c5c503d1110fac7c67e8478eded44bb38c987e7"}, "author": "Stephanie Bodoni", "url": "http://www.bloomberg.com/news/articles/2015-10-20/cd-dvd-drive-makers-said-to-face-eu-antitrust-fines-wednesday-ifzfltg6", "ord_in_thread": 0, "title": "CD, DVD Drive Makers Said to Face EU Antitrust Fines Wednesday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Makers of CD and DVD drives in a three-year-old European Union price-fixing complaint may face fines as soon as Wednesday, according to two people familiar with the investigation.\nSome recipients of a formal EU complaint in 2012 are set to be fined, said the people who asked not to be identified because the decision isn’t public. Thirteen companies were sent the so-called statement of objections three years ago including Hitachi-LG Data Storage Inc. and Toshiba-Samsung Storage Technology Corp.\nThe European Commission was supposed to announce the fines as early as July, but the case was held up as EU officials communicated the findings in the statement of objections to additional entities, one of the people said. The penalties could be one of two major competition decisions Wednesday as the regulators are expected to release the results of a tax probe involving Starbucks Corp. and Fiat Chrysler Automobiles NV.\nThe EU technology probe mirrored a U.S. investigation where Hitachi-LG agreed to plead guilty and pay a $21.1 million fine for conspiring with other companies from June 2004 through September 2009 to rig bids and fix prices for optical drives sold to Dell Inc., Hewlett-Packard Co. and Microsoft Corp.\nThe commission accused 13 companies of colluding to rig bids for at least five years on optical-disk drives sold to manufacturers of personal computers and servers in an antitrust complaint sent three years ago. Toshiba-Samsung Storage Technology, created by Samsung Electronics Co. and Toshiba Corp., was among the recipients of the complaint. Samsung Electronics and Toshiba sold the venture to Optis Co. last year.\nRoyal Philips NV has said it was granted immunity from fines in the case.\nStreaming Technologies Representatives for Hitachi Ltd., LG Corp., Samsung and Toshiba didn’t immediately respond to requests for comment. Philips spokesman Steve Klink and the commission declined to comment on the matter.\nOptical disk drives include products marketed under the names CD-ROM, CD-RW, DVD-ROM and DVD-RW that have faded in popularity in recent years as new Internet-based streaming technologies have emerged.\nPhilips has said the immunity from penalties, which is conditional on continued cooperation with regulators, also extends to a joint venture, Philips Lite-On Digital Solutions Corp. NEC Corp. said last week that it had been informed by the EU that regulators were no longer pursuing the case against it.\nSony Corp. said in 2009 that its Optiarc America unit was part of the U.S. probe and that agencies outside the country were also investigating the optical-drive market. A spokesman for Sony couldn’t be immediately reached to comment.", "external_links": ["http://www.nec.com/en/press/201510/global_20151014_01.html\\"], "published": "2015-10-20T21:53:00.000+03:00", "crawled": "2015-10-20T19:32:59.006+03:00", "highlightTitle": ""}