{"organizations": [], "uuid": "d7d2c4c0b743aef80f9ce389bb43dc12e1b9aef3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/heads-display-clip-lets-surgeons-monitor-patients", "country": "US", "title": "Heads-Up Display Clip Lets Surgeons Monitor Patients", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "Heads-Up Display Clip Lets Surgeons Monitor Patients", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7d2c4c0b743aef80f9ce389bb43dc12e1b9aef3"}, "author": "", "url": "http://www.mdtmag.com/news/2015/10/heads-display-clip-lets-surgeons-monitor-patients", "ord_in_thread": 0, "title": "Heads-Up Display Clip Lets Surgeons Monitor Patients", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new augmented reality display for surgeons brings the power of a smart glasses display in a triangular clip smaller than Google Glass.\nDesign group Method and the startup Bay Innovation joined forces to create a wearable called the Vivi, which can clip onto the type of headband or glasses surgeons regularly wear in the operating room. The Vivi can be clipped to a variety of objects, and can be swiveled out of the way when it isn’t needed.\nOnce in place in front of the eye, the small display shows basic information such as a patient’s breathing, blood pressure, or heart rate. Vivi connects to medical equipment via Bluetooth, and the user can customize the heads-up display to their personal specifications using a connected smartphone app.\nMethod Work | Vivi - A head mounted display to help medical clinicians monitor patient health. from Method_Inc Official on Vimeo .\nInstead of taking over the work of a more complicated medical device, the Vivi is instead designed to complement the machines that already exist in the operating room, letting the surgeon take quick glances at information that might otherwise have been conveyed on a hard-to-reach screen.\nIn order to design the Vivi, the team started with an idea of what the device needed to do, not what shape it would take. Thus, it doesn’t look anything like a pair of glasses, but does perform the functions it needs. Method Senior Visual Designer Stephen Osman said that his team used Lego to build the earliest prototypes.\nA new augmented reality display for surgeons brings the power of a smart glasses display in a triangular clip smaller than Google Glass. (Credit: Method) Simplifying the data a doctor might need was another challenge: the app and GUI were refined to show exactly as much as the user sets.\nThe product is still in development: the current version is “a high fidelity prototype,” said Osman.\nTherefore, the release date is still somewhere on the horizon, and pricing hasn’t yet been set. The product will need to go through the regulation process in order to be used in the health care industry, and other commercial applications such as fitness tracking might be more viable in the short term.\nFor now, it looks like Vivi might be a potential alternative to other, larger heads-up displays, as long as it can get past the planning stages.\n(Via Fast Company .)", "external_links": ["https://player.vimeo.com/video/139373029", "http://www.fastcodesign.com/3052529/innovation-by-design/this-hud-for-doctors-proves-less-is-more-for-future-wearables?utm_source", "https://vimeo.com/139373029", "https://vimeo.com/methodinc"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T06:02:11.096+03:00", "highlightTitle": ""}