{"organizations": [], "uuid": "b869e389aaeaaa6f602c759ac4d66e866b7f5845", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/the_stainless_steel_test_weight_class_e2_device.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=20", "section_title": "Technology", "url": "http://www.modernghana.com/news/648537/1/ghana-to-benefit-immensely-from-e1-device-if-purch.html", "country": "US", "title": "Ghana to benefit immensely from E1 device if purchased", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Ghana to benefit immensely from E1 device if purchased", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T15:55:00.000+03:00", "replies_count": 0, "uuid": "b869e389aaeaaa6f602c759ac4d66e866b7f5845"}, "author": "", "url": "http://www.modernghana.com/news/648537/1/ghana-to-benefit-immensely-from-e1-device-if-purch.html", "ord_in_thread": 0, "title": "Ghana to benefit immensely from E1 device if purchased", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Emmanuel Amoquandoh"], "text": "Technology | 11 October 2015 13:55 CET Ghana to benefit immensely from E1 device if purchased By Emmanuel Amoquandoh The Stainless Steel Test Weight Class E2 device \nThe head of Scientific Metrology at the Ghana Standards Authority (GSA), Paul Michael Date has stated categorically that Ghana stands to benefits so much from the Stainless Steel Test Weight Class E2 device if it is purchased for use at the GSA. \nHe said the Stainless Steel Test Weight Class E2 device is a calibration tool that is used to ensure a global uniform system of measurement using common units, for which government cannot quantity its benefits in monetary terms when purchased. \nSpeaking at a two-day workshop organised by the West African Quality System Programme (WAQSP) training for media professionals, he mentioned that “Without the ability to measure, the simplest of transactions would be open to abuse, fair trade would be impossible, and legislation aimed at protecting the health and welfare of citizens would be of no effect,” he added. \nP. M. Date posited that no technical standards could exist for products, because there would be no reliable means of measurement of their performance against requirements and as such a national measurement or metrology system is therefore the first step in facilitating trade, adding, “Legal Metrology is a tool for the protection of consumers and fair trade.” \nRecounting some of the benefits that would be derived from the use of the device, he mentioned that with the African continent divided into four, Egypt has the E1 device and so they control affairs of the Northern part of Africa in terms of mentorship training and leadership, whereas South Africa also controls the Southern part of Africa as they own one of the device. \nLikewise Kenya, with a possession of one of the device, provide leadership for the Eastern corridor of Africa. \nIt so happens that within the ECOWAS Sub-Region of West Africa, there is no leader since the standard authorities of the various countries have only the Stainless Steel Test Weight Class E2 device. \nHe added that as it stands, Nigeria, Ghana, and some few West African countries are trying hard to get that device in order to become the leader within the West African Region. \nHe stressed that with the device present in the country, all the West African countries would bring their machines and equipment to Ghana for standard measurement and calibration which will earn the country some foreign exchange since the payment would be done through the Bank of Ghana, the institution also generate some internal fund for its activities without burden to the government. \nHe again mentioned that through mentorship programmes, all the West African countries would have to come to Ghana and this will benefit the farmer who produces food for consumption while the hospitality industries also get their fair share of the cake as they host the participants of the workshops that would be organised. \nP. M. Date however cautioned that government should not delay for this one-time opportunity to pass by. Again, he said government should not wait for people who know which button to press to fade out from the system through pension before attention is paid, that he described as “A shot in the foot, having left something in the hands of someone who has little or no history to the background of an established entity.” \nHe stated that the device is a fully automated machine that needs no human presence when it is in use and for such reason, there is the need for a special underground building built purposefully for its use. \nIt requires a vibration free environment with a special type of soil forming the foundation where the device would be seated but must be in seals of five rooms. Technology Follow Us If you have never seen butter before you tend to mistake the pus in a dog's eyes for butter By: Araanaa", "external_links": [], "published": "2015-10-11T15:55:00.000+03:00", "crawled": "2015-10-11T16:23:51.741+03:00", "highlightTitle": ""}