{"organizations": [], "uuid": "a0e8fefabaee91bc1507197363fb95f7373bc5bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144509/tech-ceo-be-honored-transitioning-veterans-war-zone-work-place", "country": "US", "title": "Tech CEO to Be Honored for Transitioning Veterans from the War Zone to the Work Place", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Tech CEO to Be Honored for Transitioning Veterans from the War Zone to the Work Place", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:30:00.000+03:00", "replies_count": 0, "uuid": "a0e8fefabaee91bc1507197363fb95f7373bc5bd"}, "author": "admin", "url": "http://www.freshnews.com/news/1144509/tech-ceo-be-honored-transitioning-veterans-war-zone-work-place", "ord_in_thread": 0, "title": "Tech CEO to Be Honored for Transitioning Veterans from the War Zone to the Work Place", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/22/2015 @ 10:30 AM   Sharp Decisions \nNEW YORK -- (BUSINESS WIRE) -- Karen Ross, CEO of award-winning business and technology consulting firm Sharp Decisions and creator of a “boot camp” IT training program for veterans, will be named a “Woman of Distinction” October 28 by the Girl Scouts of Greater New York. \nMs. Ross will be honored for creating the V.E.T.S.™ (Vocations, Education and Training for Service members) Program, a unique, military-style training initiative that has transitioned more than 100 U.S. armed forces veterans since 2013 into new, high-paying careers in information technology with leading U.S. corporations. \n“At Sharp Decisions, we believe that empowering America’s veterans isn’t just good for the country – it’s good for business,” said Ms. Ross. “Veterans of the U.S. Armed Forces are tech-savvy, possessing critical experience in command control systems as well as outstanding discipline and work ethic. Each of our participating clients values the leadership and respect for chain of command that our veterans bring to the job. I am thrilled that the Girl Scouts of Greater New York share our belief in America’s veterans and humbled that they see fit to recognize our efforts with such a prestigious award.” \nMs. Ross has broken the mold for veterans’ employment efforts by making military-style training and platoon-based deployments central to her company’s training program. Through V.E.T.S., Sharp Decisions hires tech-savvy, U.S. armed forces veterans as full-time salaried/benefited employees who undergo intensive, boot camp-like technology training. They are then deployed to client companies as consultants in squads of three or more, emulating the unit-based culture in which service members thrive in the military. \nParticipating companies including EmblemHealth, Experian, Harmonic and Freddie Mac. The V.E.T.S. program is privately funded by Sharp Decisions. \nV.E.T.S. participants are trained for IT careers in disciplines such as quality assurance software testing and project management for domains like financial services and healthcare, among others. The veteran IT squads have had an extremely high success rate because, with military-style training, they work as an effective team that solves problems and meets challenges as a unit, often well ahead of schedule. Learn more about V.E.T.S. at http://www.sharpdecisions.com/services/vetsprogram . \nDemonstrating the importance of hiring veterans, the veteran unemployment rate has historically been 8% higher than the adjusted non-Veteran rate (5.51%), according to the U.S. Department of Veterans Affairs. \nThe Girl Scouts of Greater New York’s Women of Distinction Breakfast begins at 7:30 a.m., Wednesday, October 28 at Cipriani 42 nd Street, 110 E. 42 nd Street. Learn more at http://www.girlscoutsnyc.org/wod . \nAbout Sharp Decisions \nFor over two decades, Sharp Decisions has provided superior, award-winning service in strategic business and technology consulting services to government agencies at all levels, as well as domestic and global corporations. With subject matter expertise in Investment Banking, Finance, Healthcare, Media & Telecommunications, and Manufacturing, Sharp Decisions is highly equipped to serve your needs. \nEstablished in 1990 with headquarters in New York City, and locations in Princeton, Charlotte, Los Angeles, Phoenix, Europe and Canada, Sharp Decisions has been the technology backbone for a client portfolio that includes an array of high-profile companies. As a Certified Woman-Owned Business Enterprise and approved vendor, Sharp Decisions offers a powerful, cost-effective advantage. We actively partner with other MBEs to add value and meet diversity program requirements. Sharp Decisions is also committed to hiring and training post-9/11, tech-savvy U.S. armed forces veterans through the V.E.T.S.™ Program. View source version on businesswire.com: http://www.businesswire.com/news/home/20151022006255/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-22T20:30:00.000+03:00", "crawled": "2015-10-22T21:52:08.782+03:00", "highlightTitle": ""}