{"organizations": [], "uuid": "68d03536741c07bd4ec69f51987866c698abc766", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.therepublic.com", "main_image": "http://d1bdhkmqqz901h.cloudfront.net/fit-in/1200x630/filters:fill(white)/cdn1.therepublic.com/tr_assets/images/TheRepublic-Icon-2048x2048.jpg", "site_section": "http://www.therepublic.com/feed/subject/707828f88b6b10048bd1a385cd5ce603", "section_title": "Entertainment and media technology News from TheRepublic.com", "url": "http://www.therepublic.com/view/story/8452b3baf7374911a7dd1c53f910480b/MS--Printed-Prosthetic-Hand", "country": "US", "title": "Child receives prosthetic hand made by student and teacher", "performance_score": 0, "site": "therepublic.com", "participants_count": 0, "title_full": "Child receives prosthetic hand made by student and teacher", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T22:16:00.000+03:00", "replies_count": 0, "uuid": "68d03536741c07bd4ec69f51987866c698abc766"}, "author": "", "url": "http://www.therepublic.com/view/story/8452b3baf7374911a7dd1c53f910480b/MS--Printed-Prosthetic-Hand", "ord_in_thread": 0, "title": "Child receives prosthetic hand made by student and teacher", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "6-year-old boy gets prosthetic hand created on 3-D printer by high school student and teacher \nBy SARAH FOWLER - The Clarion-Ledger Published: 10/1/15 3:16 pm EDT - Updated: 10/1/15 3:16 pm EDT \nFLOWOOD, Mississippi — For six years, Braden McCay has lived without his left hand. From homework to soccer, the first-grader has deftly maneuvered his way through life with one hand. \nThat all changed Wednesday when Braden was surprised with a prosthetic hand created from a 3-D printer and fashioned by a high school student. \n\"It's pretty cool to get this hand,\" Braden said. \nJackson Preparatory School senior Matthew Clay and his teacher, Marsha Hobbs, had been constructing the hand for the past five weeks. \nClay said he has been \"burning the midnight oil\" to turn Braden's dream into reality. \nOlivia McCay, Braden's mom, said seeing her son gain a hand was \"a little overwhelming.\" \n\"We're just excited. He's excited — about to try something new,\" Olivia McCay said. \nBraden has never had a prosthetic hand, due partially to the high cost and the fact that as he grows, he would continually need a new prosthesis. \nDad Tim McCay said most prosthetics are too bulky and heavy for small children and the family decided to hold off on one for Braden. \n\"We were on board with just, he won't get anything until he's in high school and a specific event, if he wants to try golf or baseball or whatever,\" Tim McCay said. \nThen, throughout the years, family and friends would mention various prosthetics. The idea of a prosthetic crafted from a 3-D printer came about, and with Braden's blessing, the McCays sought the opinion of prosthetist Rick Psonak. \nThe McCays and Psonak had worked together years before deciding to wait on a prosthetic for Braden. \n\"It just never set well with me when they left, I thought maybe I could have done more but wasn't really sure what to do,\" Psonak said. \"3-D printing was kind of in the infancy, and I thought maybe this could fit in there. It was always in the back of my mind, what could I have done differently.\" \nPsonak and the McCays decided to move forward. But there was just one problem: Psonak didn't know where to find a 3-D printer in Mississippi. When he heard Jackson Prep had one on campus in Flowood, Psonak immediately picked up the phone. \n\"I called and said, 'Are you guys interested in printing a hand?' I didn't know how they were going to take it, but they were like, 'Wow, that would be cool,' \" he said. \nHobbs, an adjunct engineering professor at the University of Mississippi, said she was initially hesitant at the idea of creating a prosthetic from a 3-D printer but embraced the challenge. \n\"I've never done anything like this, and when they first said this I thought, 'This won't happen. This is just way out of my skill set,' but it wasn't, so it's one of those things where you just have to give something a try to see if you can do it,\" Hobbs said. \nHobbs then approached one of her students about helping build the hand. \nClay spent the summer building retainers for his uncle, an orthodontist. That skill made him the perfect fit for creating a prosthetic, Hobbs said. \n\"I broke a lot of retainers but I made a lot of them too and that helped me be able to manipulate plastics,\" Clay said. \nWhen it came to building the individual parts, Clay said, \"Right away, there was some broken fingers and melted plastics, but eventually I got the hang of it.\" \nClay said creating the hand is a rare opportunity and one for which he thanks God. \n\"You don't get the opportunity to do something with this kind of purpose behind it. It's very rare, and I'm just really thankful that I got to be a part of it,\" he said. \"It keeps you humble. It would be foolish to think that everything that happened with the hand was because of me and Ms. Hobbs. It doesn't work like that. Even if we did think by ourselves, God made our hands that made that hand. It all revolves around him.\" \nClay said he feels some personal attachment to Braden's story. \nReferencing two surgeries to repair his anterior cruciate ligaments that kept him immobile for months, Clay said, \"I know what it's like to be missing something that you feel like you should have. Every day that I go running now, I'm so thankful that I have my legs. If I wake up, if I'm having a terrible day, I can just be like, 'At least I have my legs.' For him, maybe he has a bad day, he can say, 'Hey, at least I have two hands even if one is different from the other.' I hope it makes a difference in his life.\" \nBraden didn't seem to mind the difference Wednesday as he high-fived family members for the first time with his left hand. \n\"It's pretty cool to get this hand,\" he said. \"The blue and orange are my school colors, Madison Station colors, and the green is just one of my favorite colors. It feels kind of soft too.\" \nBraden's parents said they're amazed at the advances made in prosthetics in the years since Braden's birth. Now, with the 3-D printer, Braden can have a new prosthetic every time he needs one. \n\"This will be great because it's inexpensive to print compared to the other ones, so as he grows, it will be easy to replicate,\" Olivia McCay said. \nRegardless of how many prosthetics Braden has, for the foreseeable future, he hopes they're all blue, green and orange. \nInformation from: The Clarion-Ledger, http://www.clarionledger.com \n   ", "external_links": [], "published": "2015-10-01T22:16:00.000+03:00", "crawled": "2015-10-02T10:28:58.785+03:00", "highlightTitle": ""}