{"organizations": [], "uuid": "4bec1dea6c6c9640dbb22e561553aa4b52ea8c89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww4.hdnux.com/photos/41/31/62/8756379/3/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php", "section_title": "AP Technology and Science", "url": "http://www.chron.com/business/energy/article/Researcher-Children-s-cancer-linked-to-Fukushima-6557967.php", "country": "US", "title": "Researcher: Children's cancer linked to Fukushima radiation", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Researcher: Children's cancer linked to Fukushima radiation - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T12:29:00.000+03:00", "replies_count": 0, "uuid": "4bec1dea6c6c9640dbb22e561553aa4b52ea8c89"}, "author": "chron.com", "url": "http://www.chron.com/business/energy/article/Researcher-Children-s-cancer-linked-to-Fukushima-6557967.php", "ord_in_thread": 0, "title": "Researcher: Children's cancer linked to Fukushima radiation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Wally Santana, AP Image 1 of / 5 5 FILE - In this March 15, 2011 file photo, a child is screened for radiation exposure at a testing center in Koriyama city, Fukushima Prefecture, northeast of Tokyo, after a nuclear power plant on the coast of the prefecture was damaged by March 11 earthquake. A new study says children living near the Fukushima nuclear meltdowns have been diagnosed with thyroid cancer at a rate 20 to 50 times that of children elsewhere, a difference the authors contend undermines the government’s position that more cases have been discovered in the area only because of stringent monitoring. Most of the 370,000 children in Fukushima have been given ultrasound checkups since the March 2011 meltdowns at the tsunami-ravaged Fukushima Dai-ichi nuclear plant. Thyroid cancer has been diagnosed in 137 of those children, though more broadly the disease occurs in only about one or two of every million children.\nPhoto: Wally Santana, AP FILE - In this March 15, 2011 file photo, a child is screened for... Image 2 of 5 FILE - In this March 24, 2011 file photo, a young evacuee is screened at a shelter for leaked radiation from the tsunami-ravaged Fukushima Dai-ichi nuclear plant in Fukushima, northeast of Tokyo. A new study says children living near the Fukushima nuclear meltdowns have been diagnosed with thyroid cancer at a rate 20 to 50 times that of children elsewhere, a difference the authors contend undermines the government’s position that more cases have been discovered in the area only because of stringent monitoring. Most of the 370,000 children in Fukushima have been given ultrasound checkups since the March 2011 meltdowns at the tsunami-ravaged Fukushima Dai-ichi nuclear plant. Thyroid cancer has been diagnosed in 137 of those children, though more broadly the disease occurs in only about one or two of every million children.\nPhoto: Wally Santana, AP FILE - In this March 24, 2011 file photo, a young evacuee is... Image 3 of 5 FILE - In this March 29, 2011 file photo, children watch their father being screened for radiation at a shelter in Fukushima, northeast of Tokyo. A new study says children living near the Fukushima nuclear meltdowns have been diagnosed with thyroid cancer at a rate 20 to 50 times that of children elsewhere, a difference the authors contend undermines the government’s position that more cases have been discovered in the area only because of stringent monitoring. Most of the 370,000 children in Fukushima have been given ultrasound checkups since the March 2011 meltdowns at the tsunami-ravaged Fukushima Dai-ichi nuclear plant. Thyroid cancer has been diagnosed in 137 of those children, though more broadly the disease occurs in only about one or two of every million children.\nPhoto: Wally Santana, AP FILE - In this March 29, 2011 file photo, children watch their... Image 4 of 5 Toshihide Tsuda, a professor at Okayama University, listens to a reporter's questions during a press conference at Foreign Correspondents' Club of Japan in Tokyo, Thursday, Oct. 8, 2015. A new study says children living near the Fukushima nuclear meltdowns have been diagnosed with thyroid cancer at a rate 20 to 50 times that of children elsewhere, a difference the authors contend undermines the government’s position that more cases have been discovered in the area only because of stringent monitoring.\nPhoto: Koji Sasahara, AP Toshihide Tsuda, a professor at Okayama University, listens to a... Image 5 of 5 Toshihide Tsuda, a professor at Okayama University, speaks during a press conference at Foreign Correspondents' Club of Japan in Tokyo, Thursday, Oct. 8, 2015. A new study says children living near the Fukushima nuclear meltdowns have been diagnosed with thyroid cancer at a rate 20 to 50 times that of children elsewhere, a difference the authors contend undermines the government’s position that more cases have been discovered in the area only because of stringent monitoring.\nPhoto: Koji Sasahara, AP Toshihide Tsuda, a professor at Okayama University, speaks during a... Researcher: Children's cancer linked to Fukushima radiation 1 / 5 Back to Gallery TOKYO (AP) — A new study says children living near the Fukushima nuclear meltdowns have been diagnosed with thyroid cancer at a rate 20 to 50 times that of children elsewhere, a difference the authors contend undermines the government's position that more cases have been discovered in the area only because of stringent monitoring.\nMost of the 370,000 children in Fukushima prefecture (state) have been given ultrasound checkups since the March 2011 meltdowns at the tsunami-ravaged Fukushima Dai-ichi nuclear plant. The most recent statistics, released in August, show that thyroid cancer is suspected or confirmed in 137 of those children, a number that rose by 25 from a year earlier. Elsewhere, the disease occurs in only about one or two of every million children per year by some estimates.\n\"This is more than expected and emerging faster than expected,\" lead author Toshihide Tsuda told The Associated Press during a visit to Tokyo. \"This is 20 times to 50 times what would be normally expected.\"\nThe study was released online this week and is being published in the November issue of Epidemiology, produced by the Herndon, Virginia-based International Society for Environmental Epidemiology . The data comes from tests overseen by Fukushima Medical University .\nMaking sense of the relationship between radiation and cancer is precarious: It's scientifically impossible to link an individual cancer case to radiation. Looking harder with routine check-ups, like the one in Fukushima, leads to quicker discovery of tumors, inflating the tallies in a so-called \"screening effect.\"\nRight after the disaster, the lead doctor brought in to Fukushima, Shunichi Yamashita , repeatedly ruled out the possibility of radiation-induced illnesses. The thyroid checks were being ordered just to play it safe, according to the government.\nBut Tsuda, a professor at Okayama University , said the latest results from the ultrasound checkups, which continue to be conducted, raise doubts about the government's view.\nThyroid cancer among children is one sickness the medical world has definitively linked to radiation after the 1986 Chernobyl catastrophe. If treated, it is rarely fatal, and early detection is a plus, but patients are on medication for the rest of their lives.\nScientists are divided on Tsuda's conclusions.\nIn the same Epidemiology issue, Scott Davis , professor at the Department of Epidemiology in the Seattle-based School of Public Health , said the key limitation of Tsuda's study is the lack of individual-level data to estimate actual radiation doses.\nDavis agreed with the findings of the World Health Organization and UNSCEAR, or the United Nations Scientific Committee on the Effects of Atomic Radiation , both of which have carried out reviews on Fukushima and predicted cancer rates will remain stable, with no rises being discernable as radiation-caused.\nDavid J. Brenner , professor of radiation biophysics at Columbia University Medical Center , took a different view. While he agreed individual estimates on radiation doses are needed, he said in a telephone interview that the higher thyroid cancer rate in Fukushima is \"not due to screening. It's real.\"\nConclusions about any connection between Fukushima radiation and cancer will help determine compensation and other policies. Many people who live in areas deemed safe by the government have fled fearing sickness, especially for their children.\nAn area extending about 20 kilometers (12 miles) from the nuclear plant has been declared an exclusion zone. The borders are constantly being remapped as cleanup of radiated debris and soil continues in an effort to bring as many people back as possible. Decommissioning the plant is expected to take decades.\nNoriko Matsumoto , 53, who used to work as a nurse in Koriyama, Fukushima, outside the no-go zone, fled to Tokyo with her then-11-year-old daughter a few months after the disaster. She had initially shrugged off the fears but got worried when her daughter started getting nosebleeds and rashes.\n\"My daughter has the right to live free of radiation,\" she said. \"We can never be sure about blaming radiation. But I personally feel radiation is behind sicknesses.\"\nAndrew F. Olshan , professor at the Department of Epidemiology at the University of North Carolina , in Chapel Hill, noted that research on what follows a catastrophe is complex and difficult.\n\"Dr. Tsuda's study had limitations including assessment of individual radiation dose levels to the thyroid and the ability to fully assess the impact of screening on the excess cases detected,\" he said.\n\"Nonetheless, this study is critical to initiate additional investigations of possible health effects, for governmental planning, and increasing public awareness.\"\n___\nFollow Yuri Kageyama : http://twitter.com/yurikageyama", "external_links": ["http://ww2.hdnux.com/photos/41/31/62/8756377/3/square_gallery_thumb.jpg", "http://twitter.com/yurikageyama", "http://ww3.hdnux.com/photos/41/31/62/8756378/3/920x920.jpg", "http://ap.org/schemas/03/2005/apcm", "http://ww3.hdnux.com/photos/41/31/62/8756378/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/31/62/8756379/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/31/62/8756381/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/31/62/8756380/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/31/62/8756377/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/31/62/8756379/3/square_gallery_thumb.jpg", "http://ap.org/schemas/03/2005/apnm", "http://ww2.hdnux.com/photos/41/31/62/8756381/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/31/62/8756380/3/920x920.jpg"], "published": "2015-10-08T12:29:00.000+03:00", "crawled": "2015-10-08T12:35:05.370+03:00", "highlightTitle": ""}