{"organizations": [], "uuid": "ae1aacb443d73960f7097127efdeeffcaa33681b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141541/equinix-receives-frost-sullivan-green-innovation-leadership-award-second-year-running", "country": "US", "title": "Equinix Receives Frost & Sullivan Green Innovation Leadership Award for Second Year Running", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Equinix Receives Frost & Sullivan Green Innovation Leadership Award for Second Year Running", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T04:00:00.000+03:00", "replies_count": 0, "uuid": "ae1aacb443d73960f7097127efdeeffcaa33681b"}, "author": "admin", "url": "http://www.freshnews.com/news/1141541/equinix-receives-frost-sullivan-green-innovation-leadership-award-second-year-running", "ord_in_thread": 0, "title": "Equinix Receives Frost & Sullivan Green Innovation Leadership Award for Second Year Running", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/15/2015 @ 6:00 PM   Equinix, Inc. \nREDWOOD CITY, Calif. and HONG KONG, Oct. 15, 2015 /PRNewswire/ -- Equinix, Inc. (Nasdaq: EQIX), the global interconnection and data center company, today announced that it has been awarded the 2015 Asia Pacific Data Center Green Innovation Leadership Award by Frost & Sullivan. Equinix was specifically recognized for its continued focus on designing and managing industry leading green data centers across the Asia Pacific region. \nHighlights/Key Facts -- Equinix was awarded the Green Innovation Leadership Award based on its ability to demonstrate outstanding achievement and superior performance in areas such as leadership, technology innovation, customer service and strategic product development. An example of this includes the retrofitting of its SG1 International Business Exchange(TM) (IBX®) data center with a granular temperature control system that has improved the facilities power usage effectiveness (PUE) and achieved savings of more than 8 million kilowatt hours of energy between 2012-2014. -- Every Equinix data center uses technology and techniques that reduce its environmental impact. Equinix's global IBX operations and engineering teams have implemented comprehensive conservation and efficiency programs that include energy and water conservation. Data centers in Asia-Pacific deploy: -- Adaptive control systems that reduce power consumption and increase cooling capacity through active airflow management -- Motion-activated lighting sensors to reduce energy consumption coupled with energy-efficient LED systems -- Cold/hot aisle containment that uses physical barriers to reduce the mixing of cold air in data center supply aisles with the hot air in their exhaust aisles, resulting in lower energy consumption and more efficient cooling -- Variable frequency drives that are deployed in chillers, pumps and fans in Equinix's HVAC systems to save energy by automatically reducing a motor's speed and power draw to match lower system loads -- Equinix's data centers in Sydney (SY3), Hong Kong (HK2 phase 2, HK3 phase 2) and Tokyo (TY4) have earned Leadership in Energy and Environmental Design® (LEED) Gold certifications for high building standards by the U.S. Green Building Council (USGBC). The three data centers were awarded for excellent performance in terms of energy savings, water efficiency, CO2 emission reductions, stewardship of resources and sensitivity to its impact on the environment. Additional data centers in Hong Kong (HK1 phase 9) and Singapore (SG3) are pending gold certification. All of Equinix's data centers in Singapore have received SS 564 certifications, a Singaporean green building standard similar to LEED. -- To reinforce Equinix's focus on green initiatives and energy conservation, it has set aggressive targets of 1.45 or lower for the company's design average power usage effectiveness (PUE). -- Equinix has recently signed a power purchase agreement (PPA) for solar power that will cover all of its California data centers and will increase its use of clean, renewable sources from 30 percent to 43 percent globally. -- Now in its eighth consecutive year, the Frost & Sullivan Asia Pacific Best Practices Awards recognize companies across industries commending their diligence, commitment, and innovative business strategies required to advance in the global marketplace. \nQuotes -- Adwaith Visveswaran, senior research analyst, Asia Pacific Energy & Environment Practice, Frost & Sullivan:\"Equinix continues to exhibit exemplary growth by building and maintaining state-of-the-art green data centers across the Asia Pacific region. In all its IBX facilities in the region, the company has deployed some of the most innovative and finest 'green' technologies that meet energy efficiency requirements. With its unflinching desire towards reducing the density of power consumption and carbon footprint, Equinix has demonstrated the true characteristics of a market leader.\" -- Samuel Lee, president, Equinix Asia-Pacific:\"Embracing green IT and renewable energy has become an important topic of discussion in boardrooms today. Equinix was the first colocation provider to provide a snapshot of our energy demand and related greenhouse footprint, as well as our electricity supply mix at a regional level, via our Green Web Portal. We constantly evaluate the energy efficiency of our data centers and are quick to adopt proven energy-saving technologies and techniques on a global scale. This award not only validates this approach, but also reinforces our commitment to putting all of our data centers on an aggressive path for efficiency improvements.\" \nAdditional Resources -- Equinix Receives 2014 Frost and Sullivan Best Practices Award for Leadership in Green Innovation [press release] -- Green by Design [website] -- Equinix to Make California Data Centers 100% Renewable [press release] \nAbout Frost & Sullivan Frost & Sullivan, the Growth Partnership Company, works in collaboration with client to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants. For more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organization prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies? www.frost.com \nAbout Equinix Equinix, Inc. (Nasdaq: EQIX) connects the world's leading businesses to their customers, employees and partners inside the most interconnected data centers. In 33 markets across five continents, Equinix is where companies come together to realize new opportunities and accelerate their business, IT and cloud strategies. www.equinix.com . \nForward Looking Statements This press release contains forward-looking statements that involve risks and uncertainties. Actual results may differ materially from expectations discussed in such forward-looking statements. Factors that might cause such differences include, but are not limited to, the challenges of acquiring, operating and constructing IBX centers and developing, deploying and delivering Equinix services; unanticipated costs or difficulties relating to the integration of companies we have acquired or will acquire into Equinix; a failure to receive significant revenue from customers in recently built out or acquired data centers; failure to complete any financing arrangements contemplated from time to time; competition from existing and new competitors; the ability to generate sufficient cash flow or otherwise obtain funds to repay new or outstanding indebtedness; the loss or decline in business from our key customers; and other risks described from time to time in Equinix's filings with the Securities and Exchange Commission. In particular, see Equinix's recent quarterly and annual reports filed with the Securities and Exchange Commission, copies of which are available upon request from Equinix. Equinix does not assume any obligation to update the forward-looking information contained in this press release. \nEquinix and IBX are registered trademarks of Equinix, Inc. International Business Exchange is a trademark of Equinix, Inc. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/equinix-receives-frost--sullivan-green-innovation-leadership-award-for-second-year-running-300160964.html \nSOURCE Equinix, Inc.", "external_links": [], "published": "2015-10-16T04:00:00.000+03:00", "crawled": "2015-10-16T06:16:08.401+03:00", "highlightTitle": ""}