{"organizations": [], "uuid": "6b3d5e0a2414c835a5bea65591e5e4774cec26c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theglobeandmail.com", "main_image": "http://static.theglobeandmail.ca/0e7/incoming/article26581433.ece/ALTERNATES/w620/2015-margaret_wente.JPG", "site_section": "http://www.theglobeandmail.com/technology/", "section_title": "Technology - The Globe and Mail", "url": "http://www.theglobeandmail.com/globe-debate/thanksgiving-politics-with-a-side-of-turkey/article26741796", "country": "CA", "title": "Thanksgiving politics, with a side of turkey", "performance_score": 0, "site": "theglobeandmail.com", "participants_count": 22, "title_full": "Thanksgiving politics, with a side of turkey - The Globe and Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:00:00.000+03:00", "replies_count": 25, "uuid": "6ea19515e2443c805ce9a1eef618ee01da14b301"}, "author": "Margaret Wente", "url": "http://www.theglobeandmail.com/globe-debate/thanksgiving-politics-with-a-side-of-turkey/article26741796#post-0", "ord_in_thread": 0, "title": "Thanksgiving politics, with a side of turkey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A A I can’t remember when my mild-mannered friends have been so worked up over an election. You might have to go back to the free-trade election of 1988. In general, the phrase “exciting Canadian election” is an oxymoron. But not this time. People are passionate about it. No one knows what will happen on election day – or the day after that. My friends are shouting at each other over dinner tables. Thanksgiving won’t be dull. Let the bread rolls fly!\nHere’s how the conversation will play out around my table. Many of my loved ones think you’d have to be deranged to vote for Stephen Harper. This truth is so self-evident that you’d be better off admitting you’ve joined the Ku Klux Klan. Harper has destroyed democracy. He has trampled people’s freedoms. He has tarnished Canada’s reputation in the world. He is whipping up Islamophobia and tearing the throat out of the country’s social cohesion. Not to mention the long-form census.\nThen there are the Justin Trudeau loathers (mostly older, mostly male). We all know the rap on him. He’s an airhead. Vladimir Putin would eat him for lunch. He’ll wreck the economy and spend us into the poorhouse like his father did. He’s glib, but so what? He needs adult supervision (also known as “good people around him”).\nA number of people I know agree with some or all of this assessment but they don’t care. They’re voting for him anyway. They can’t stand Harper, and Trudeau isn’t Harper, and that’s good enough for them.\nSome of us had hopes for Thomas Mulcair, not so long ago. But he has collapsed under the weight of his own contradictions. He says he’ll balance budgets, but people are skeptical. The righties think he’s a socialist in sheep’s clothing, and the lefties think he’s sold out. He’s too soft on terrorism for some, and too soft on the oil sands for others. Also, snarly. A lot of folks would like to see him prop up Justin, though.\nThe funny thing is that it’s hard to explain to outsiders what all the squabbling is about. Our battles feel intense and visceral. But to other people, we are the Peaceable Kingdom. Our scandals (Mike Duffy, anyone?) are ridiculously puny. Our corruption is negligible. Even our culture wars are minuscule, and almost totally symbolic. The social and economic crises that are tearing other countries apart are scarcely on the radar here.\nThe great thing about our political system is that any party that wants to get elected has to move toward the centre of the road. And the centre of the road has seen a great convergence. No matter who’s in power, Canada remains a prosperous, highly redistributive welfare state. Every party – even the Conservatives – supports universal health care and child support and decent old-age pensions. They all support the middle class, which, so far as I can tell, means nearly everyone. They all support transfer payments from richer provinces to poorer ones, and from richer citizens to poorer ones. Every party – even the NDP – believes in moderate levels of corporate and personal taxation, as well as balanced budgets over time. No one wants to nationalize anything. Free trade is widely accepted as a good thing (even by Mr. Mulcair, who was for the TPP before he was against it). The debt crisis of the 1990s made fiscal moderates of us all, in theory if not always in fact.\nAs for the culture wars, forget it. Canadians don’t fight over abortion, gay marriage or capital punishment, and it’s unlikely that we ever will. The niqab fight is mostly much ado about nothing. While most Canadians hate the niqab, acceptance of Muslims and other religious minorities is widespread.\nMost important, we don’t fight over immigration. There’s a reason for that. Opposition to immigration arises when immigrants don’t do well culturally and economically. Our newcomers, on the whole, do well. That’s because, unlike most other nations, we select the people who come here – and we choose wisely.\nSure, our parties have their differences on Canada’s proper role in the world. But the fundamentals don’t change. The U.S. is our friend, like it our not. We support the UN and NATO. Our defence resources are small. We aren’t about to change sides in the fight against the bad guys, even though we may change the terms of our engagement. Every leader, no matter how transformational he wants to sound, faces the same constraints and challenges that his predecessors did.\nWhich doesn’t mean it doesn’t matter how you vote, or who wins. The differences among the parties and their leaders are substantial and important. My point is that nobody can screw it up too badly for too long – not Mr. Trudeau, not Mr. Harper, not Mr. Mulcair. Our national equilibrium is too robust for that. Our system is pretty good at correcting itself.\nSo if you want to rant about the sorry state of our political culture or the deficiencies of our leaders or the awfulness of our choices, by all means go right ahead. But don’t expect any sympathy from me. I think our choices are just fine. Raise your eyes from your turkey dinner and take a look around the world. Then tell me who else’s problems and who else’s choices you’d rather have. Then we’ll raise a glass and count our blessings.\n Thanksgiving weekend: the time when political turkeys get carved\nMICHAEL ADAMS Which conservative party will you vote for?\nMARGARET WENTE If Trudeau is the bridge, Harper is the wedge\nTopics: Federal Election 2015 Comments Print /\nLicense A A", "external_links": ["http://license.icopyright.net/3.8425?icx_id=26741796", "http://license.icopyright.net/g2/3.8425?icx_id=26741796"], "published": "2015-10-10T16:00:00.000+03:00", "crawled": "2015-10-11T02:29:25.442+03:00", "highlightTitle": ""}