{"organizations": [], "uuid": "016d0ddcc74b0ab61bd169d17962015504d3252e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources1.news.com.au/images/2015/10/23/1227580/372201-0e4be7d4-791b-11e5-b984-b6d6a772c835.jpg", "site_section": "http://www.adelaidenow.com.au/technology", "section_title": "Technology | Tech News and Latest New Technology | The Advertiser", "url": "http://www.adelaidenow.com.au//www.adelaidenow.com.au/rendezview/he-called-me-a-wog-bitch-this-is-my-reply/story-fnpug1jc-1227580372234", "country": "US", "title": "He called me a wog bitch. This was my reply. Racism in Australia, is alive and well | The Advertiser", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 28, "title_full": "He called me a wog bitch. This was my reply. Racism in Australia, is alive and well | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T07:30:00.000+03:00", "replies_count": 29, "uuid": "016d0ddcc74b0ab61bd169d17962015504d3252e"}, "author": "Maria Billias", "url": "http://www.adelaidenow.com.au//www.adelaidenow.com.au/rendezview/he-called-me-a-wog-bitch-this-is-my-reply/story-fnpug1jc-1227580372234", "ord_in_thread": 0, "title": "He called me a wog bitch. This was my reply. Racism in Australia, is alive and well | The Advertiser", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This week’s column is a public response to an email sent to me from Darwin resident Ian*.\nMaria,\nI am fed up with looking at your smug face in the newspaper you ugly Greek hag. Did somebody tell you that your wog bitch opinion is important? F*ck off.\nIan, Darwin\nDear Ian,\nThanks for your email. I always appreciate fan mail.\nI also make it a priority to respond to readers who have taken the time to send me a message, no matter how ideologically opposed our views may be.\nBut the thing is Ian, it appears you are fixated more on my dinkus (that’s that photo of me up on at the top of this page ... you know, the one that has apparently offended you so much) and less on what I actually write each week.\nNow, I suspect the aim of your email was to hurt my feelings.\nYou thought “I’ll show her”, switched on your PC, belted out some elementary words, chuckled to yourself as you gulped down your cold bevy thinking you’d have me sobbing into my souvlaki by now.\nBut the thing is Ian, you haven’t hurt me.\nBecause you see, women with opinions — or in fact women with any type of public profile — are seasoned to attacks on the way they look, sometimes more so than what they actually have to say.\nWe are critiqued on what we wear, how our hair looks, how old we appear, how much weight we have put on.\nWe are judged more on our appearance than on any accolades that may have come our way in our professional lives.\nA fellow journalist (you might have heard of her — Lisa Wilkinson, she heads a TV morning news program called Today) gave a sensational Andrew Olle media lecture almost two years ago where she spoke about this very thing (you should look it up sometime).\nNow let me expand on that, Ian, because for someone who is a “wog” like myself, well, let’s just say the attack is sometimes two-pronged.\nThrowing my ethnicity into the sexism mix must feel like sheer genius to keyboard warriors of your ilk.\nAnd when I say of your ilk, I mean racists.\nBut you see Ian, as a child I dealt with far worse from 13-year-olds. Although admittedly their vocabulary was a bit more imaginative than yours.\n“Greasy wog” and “go back to your country” and “moussaka muncher” mixed with the occasional elbowing in the corridor was par for the course.\nI have plenty more colourful examples — not necessarily confined to the playground either — but I don’t really want to contribute to your arsenal of insults more than I already have.\nRacism was not unusual in Darwin in the 80s.\nEvidently it still isn’t, and you, Ian, have illustrated this point perfectly.\nIf you think I am overreacting, perhaps have a read of a previous opinion piece of mine on the treatment of Adam Goodes. Maybe even have a look at some of the vile social media responses Miranda Tapsell received last week after admitting how Australia Day made her feel.\nI’d never suggest that I’ve copped anything as hateful nor to the degree that these two Australians have in their lives.\nNonetheless, do you know what people like you have given me, Ian?\nThick skin.\nYou have also empowered me with a voice to stand up to bullies.\nLike yourself.\nI have written this as a public letter for two reasons.\n1. Who knows if that email you sent your message from was legit? I mean who’d even be daft enough to do something like that?!\nand\n2. I want to encourage people — particularly our younger generations — to call out behaviour that is unacceptable, disrespectable and unjust. Whether it’s happening to them or if they see it happening to someone else.\nI also want our youth to know that for all the decent people in this world, occasionally life will throw them a few shitty ones. People who use barbed words to bully, mock and intimidate.\nBut these low-rent words won’t be what define them in life. Not the way they define people like you, Ian.\nMaria\n* I have not published your last name as I have not done this as an exercise in public humiliation.\nOriginally published as He called me a wog bitch. This is my reply", "external_links": ["http://www.dailytelegraph.com.au/rendezview/he-called-me-a-wog-bitch-this-is-my-reply/story-fnpug1jf-1227580372234"], "published": "2015-10-24T07:30:00.000+03:00", "crawled": "2015-10-24T19:59:23.020+03:00", "highlightTitle": ""}