{"organizations": [], "uuid": "6892b1e23d433a87bdb88bea5560ee24172b188a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/9974techinfo.xml", "section_title": "Technology: Information", "url": "http://www.prweb.com/releases/2015/10/prweb13015972.htm", "country": "US", "title": "Twin Engine Labs Expands HackerForge.io", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Twin Engine Labs Expands HackerForge.io", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "6892b1e23d433a87bdb88bea5560ee24172b188a"}, "author": "Rebecca West", "url": "http://www.prweb.com/releases/2015/10/prweb13015972.htm", "ord_in_thread": 0, "title": "Twin Engine Labs Expands HackerForge.io", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Twin Engine Labs, an innovative mobile app design and development agency headquartered in Shreveport, today announced the next phase of programming for HackerForge.io, a technical boot camp that is teaching qualified students to code in short burst, high intensity sessions of 2-day workshops, 5-week and 10-week boot camps. The recently completed debut session was HackerForge.io Rails, a 10-week course that taught students the fundamentals of coding in Ruby on Rails. All of the program’s graduates have emerged with a solid technical understanding of how to code in Rails, as well as two major portfolio pieces -- one “demo” app and one “real-world” project. Twenty percent of the program’s initial graduates were hired by employers in the Shreveport area. Beginning in November, two new courses will be offered in Unity 3D and Growth Hacking/Digital Marketing, to be followed with an expanded curriculum in Q1’16.\n“Our growth has always been hindered by recruiting challenges,” said Keith Hansen, CEO at Twin Engine Labs. “We could say yes to many more entrepreneurs if we could bring in more qualified applicants, but modern programming skills aren’t being taught in the area. We’ve tried using recruiters to find qualified candidates from outside the area, but that’s an expensive approach that brings mixed results. We’ve also tried enlisting candidates directly from local colleges, but that process takes at least a year and isn’t always a sure thing since the amount of practical training needed after graduation is cost prohibitive. We came to the conclusion that the best way to find qualified candidates who are immediately available would be to train them ourselves, and continue to grow our senior talent internally through apprenticeships. That was the start of HackerForge.io.”\nHackerForge.io is for people who are serious about learning to develop so that they can find a new job, jumpstart their skills, or start their own businesses. Students don’t necessarily have to have prior coding experience, but they do need to be willing to commit to the program and be ready to learn. In comparison to a traditional college program, HackerForge.io is focused on teaching how to use modern programming languages and tools in a practical environment. Programming languages change every few quarters, and most colleges can’t keep up with the pace of innovation. Boot camps are on the rise as an alternative way of teaching these skills. HackerForge.io is fundamentally different from most boot camps in that it is committed to keeping the costs as low as possible, and also involves potential employers in the development of its curriculum, so that the graduates will have the specific skills they need to find jobs in the Shreveport area.\n“The key difference at HackerForge.io is the schedule -- they offer intense night courses twice a week, which allowed me to continue supporting myself with my existing job while gaining the entry level skills I needed in order to change careers,” said Kenneth Beers, recent HackerForge.io graduate. \"By the time the course was finished, I understood the core fundamentals of programming and had two projects to show potential employers. I ended up being offered a position for a software company based on the qualifications I gained through HackerForge.io.\"\nHackerForge.io offers a number of benefits to its participants and to the local community:\n· For students, HackerForge.io is often the start to a brand new career path. Twenty percent of HackerForge.io’s initial graduates have been hired by employers in the area, based on the work they completed in the course.\n· For instructors, HackerForge.io provides an avenue to sharpen training skills and earn supplementary income. Instructors are paid twice the going rate for adjunct instructors in the area and are provided with qualified teaching assistants for each class.\n· For companies in Shreveport , HackerForge.io offers a practical way to find qualified candidates. HackerForge.io hosts an “inverted job fair” toward the end of the course, in which students have the opportunity to display their projects. Potential employers are invited to meet the students, ask questions, look at programs and code, and find their next batch of interns and employees.\n· For the Shreveport area, programs like HackerForge.io provide economic opportunities. HackerForge.io helps local people who need to develop necessary job skills, so that they can find better jobs and companies don’t have to look elsewhere in order to fill open positions.\n“We commend Twin Engine Labs for coming up with a creative and effective way to grow the technical workforce here in Shreveport,” said Brent Dooley, who heads the engineering department at Automated Payroll Systems. “We live in a great ecosystem for growth, but we need to cultivate more talent locally, rather than having to outsource or recruit from other places. Programs like HackerForge.io are an ingenious way to train local workers with the specific skills that we need for open positions.”\nAbout Twin Engine Labs\nFounded in 2010, Twin Engine Labs is an innovative design and development agency that builds iOS applications for Fortune 500 companies, entrepreneurs, and creative agencies. Based in their hometown of Shreveport, Louisiana, the company’s partners deliver a comprehensive experience, offering creative and engineering services to a diverse range of clients including Open Table, O'Reilly Media, Cisco Networks, Red Ball Oxygen, Symantec, and Groupon. For more information visit http://www.twinenginelabs.com , check them out on Facebook at http://www.facebook.com/twinenginelabs , and interact with them on Twitter at @thetwinengine.", "external_links": ["http://www.facebook.com/twinenginelabs", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mYWNlYm9vay5jb20vdHdpbmVuZ2luZWxhYnM=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50d2luZW5naW5lbGFicy5jb20="], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T10:27:46.412+03:00", "highlightTitle": ""}