{"organizations": [], "uuid": "071772e0c906defe4d1c98323758f026e4455c06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/c590a5b8807e6d15cb38a048d7f1cf88", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_tech_506.xml", "section_title": "NEWS.com.au | Technology News", "url": "http://www.news.com.au/technology/innovation/russias-deadly-new-weapons-striking-fear-into-heart-of-the-west/story-fnpjxnlk-1227563865324?from=public_rss", "country": "IL", "title": "Russia’s deadly new weapon", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Russia’s deadly new weapon", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T23:22:00.000+03:00", "replies_count": 0, "uuid": "071772e0c906defe4d1c98323758f026e4455c06"}, "author": "", "url": "http://www.news.com.au/technology/innovation/russias-deadly-new-weapons-striking-fear-into-heart-of-the-west/story-fnpjxnlk-1227563865324?from=public_rss", "ord_in_thread": 0, "title": "Russia’s deadly new weapon", "locations": ["Russia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russia’s deadly new weapons striking fear into heart of the West October 11, 2015 6:22am Image Russian air strikes help Syrian advance 0:28 \nThe defence ministry says Russian air strikes hit 55 IS group targets in Syria in the past 24 hours. October 11th 2015 an hour ago /video/video.news.com.au/News/World/ Russia said 26 rockets fired by its warships this week struck Islamic State targets, but others aren’t so sure. Email a friend \nRUSSIA’S deadly hi-tech weapons on display in the Middle East are spreading fear of another Cold War in the West. \nVladimir Putin is employing sophisticated modern warfare in supporting Bashar al-Assad’s regime in Syria, and the world-leading electronics are making the US and its allies increasingly nervous. \nThe Russian president has sent fighter jets, drones and bombers to Syria, but it’s the spy weapons that could be the most powerful and dangerous. While surveillance equipment and “jammers” are ostensibly there to block communications by Islamic State fighters, it appears Russia is also targeting Western-armed rebels in an almighty display of power. \n“We’re still trying to work out what the strategical aim is,” Middle East expert Rodger Shanahan from the Lowy Insititute told news.com.au \n“Obviously to buttress the Assad regime, they’ve been allies for decades. There’s a significant air component and a few thousand troops, enough to defend [Russia’s] air base. \n“It’s certainly Russia trying to protect its nationalist credentials and be a player in the region.” \nWhile Dr Shanahan dismissed the idea of another Cold War, others aren’t so sure. US officials told the Times of London they were considering a revival of the protocols used to prevent such a confrontation. Civilians on the rubble of a damaged site hit on Wednesday by what activists say were cluster bombs dropped by the Russian air force in the southern countryside of Idlib, Syria. Source: Reuters \nWHY THE WEST IS WORRIED \nIn recent weeks, Russia has sent in its IL-20 surveillance aircraft, known as “Coot” by NATO, armed with radar, eavesdropping equipment and optical and infrared sensors. It has also deployed advanced electronic jamming system Krasukha-4, used to block enemy radar and aircraft. \nThe Vasily Tatishchev, an advanced naval surveillance ship , sailed for the eastern Mediterranean on Monday, Interfax reported, with Turkey expressing serious concern. \nThis intelligence weaponry is a fresh example of “hybrid warfare” tactics , covert and deceptive operations used to achieve strategic objectives, according to Foreign Policy. With many calling for no-fly zone over Syria, it has helped keep Putin in control of the skies over the Middle East, said Igor Sutyagin, a senior research fellow at London think tank Royal United Services Institute. \nElectronic warfare is one of Russia’s greatest strengths, where it out-muscles even the West. The deployment of jammers could directly affect NATO technology, blinding pilots and giving Russia a huge military advantage over the West. \n“They would have understood the implications for America.” said Dr Shanahan. “The US reaction would have been considered.” The Russian Navy's large landing ship Novocherkassk on its way to the Mediterranean Sea in Istanbul. Source: Reuters \nWHO’S REALLY THE TARGET? \nOn Wednesday, Putin’s government said it had launched 26 cruise missiles, successfully hitting targets in north and north-western Syrian provinces. But US officials said four missiles had gone off course and landed in Iran. \nSecretary of State John Kerry said he was worried that the “preponderance of targets” being struck by Russian forces in Syria were not related to IS. Local activists and US officials say the strikes have targeted Western-armed rebels, helping to prop up the Assad government. \nThe Russian Ministry of Defence responded with characteristic bullishness. “However unpleasant and ‘unexpected’ it may be for our colleagues at the Pentagon and Langley [CIA’s Virginia headquarters] about yesterday’s attacks by high-accuracy weapons on the [Islamic State] infrastructure in Syria — all the same, all rockets fired from ships found their targets,” said ministry spokesman Major General Igor Konashenkov. \nThe US has warned that further conversations may be required with Russia to avoid misunderstandings. \nThe deployment of the Krasukha-4 jamming system came after three days of aerial confrontations between Turkish jets and Russian-made warplanes used by Russia and the Syrian regime, The Times reported. \nJens Stoltenberg, NATO secretary-general, said the incursions were deliberate acts of harassment. “Intelligence that we have received provides me with reason to say it doesn’t look like an accident, it is a serious violation,” he said. Russian President Vladimir Putin has remained defiant as the US expresses concern. Source: AP \nWHAT’S PUTIN’S MOTIVATION? \nRussia’s aims in Syria are far more simple than those of the US, according to Dr Shanahan. “At some stage there will be a political settlement in Syria,” he said. “If they strengthen the Assad regime and weaken everybody else, it will make Russia’s rein in the Syrian hand much stronger in political bargaining. They don’t have to worry about IS, the West is doing that for them. \n“Russia wants to wedge US interests so it is strategically located, and it wants to support allies to show it is ‘pick and stick’ \n“It’s certainly sending a message. Military power is obviously part of national power.” \nA US official speaking to Foreign Policy said Russia has concealed communications and movements just as it did in Ukraine, hiding fighter jets in larger cargo planes. \nWhat Russia’s long-term plans are, only Putin and his confidants really know, but they’re certainly making the rest of the world uneasy. \n— With AP", "external_links": [], "published": "2015-10-10T23:22:00.000+03:00", "crawled": "2015-10-11T00:04:19.580+03:00", "highlightTitle": ""}