{"organizations": [], "uuid": "4b1ccb2bb77dca4a4ece1480c8dcb07745a0fe9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/10/8/1444319201431/d61eed7f-f5a4-4402-b0d2-db5bbda81182-2060x1236.jpeg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=59d1bb203d1f1b37fd7e224fd1d972cc", "site_section": "http://www.theguardian.com/us/technology/rss", "section_title": "Technology | The Guardian", "url": "http://www.theguardian.com/science/brain-flapping/2015/oct/09/breasts-ultimate-weapons-video-games", "country": "GB", "title": "Breasts: the ultimate weapons | Dean Burnett | Science", "performance_score": 1, "site": "theguardian.com", "participants_count": 2, "title_full": "Breasts: the ultimate weapons | Dean Burnett | Science | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T10:10:00.000+03:00", "replies_count": 1, "uuid": "c22d6018ad7c527032d5d314f6882cd22fe71831"}, "author": "Dean Burnett", "url": "http://www.theguardian.com/science/brain-flapping/2015/oct/09/breasts-ultimate-weapons-video-games#post-0", "ord_in_thread": 0, "title": "Breasts: the ultimate weapons | Dean Burnett | Science", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Forget guns . Forget nukes . The real ultimate weapon? Breasts. \nExposed breasts are a significant tactical advantage . In pop culture, large-breasted women fighters invariably wear very revealing, breast-emphasising outfits. There are numerous examples in comics ( Wonder Woman , Power Girl, Psylocke, Emma Frost , Zatanna , Black Cat , She Hulk etc.) and video games ( Lara Croft , Bayonetta , Blaze, Ivy , Rayne , Mai etc.) Presumably such capable individuals would be able to wear what they like, so why would they choose to expose so much skin to danger? \nYou might think it’s just a cheap and crude tactic by male-dominated industries to get more attention from what they assume to be their young heterosexual male audience. But you’d be wrong. The creators of these scantily-clad protagonists are aware of a greater truth; breasts are actually the most awesome weapons a human can possess, and to cover them up limits their effectiveness. No wonder there are games dedicated to women increasing their breast size . This may all seem far-fetched, but the science backs it up.\nStability Facebook Twitter Pinterest You never see wonder woman falling over a loose paving slab, and now you know why. Photograph: Alamy \nMany women complain that large breasts are actually a hindrance to physical activity , requiring supporting equipment like sturdy sports bras to stop all the disruptive movement. However, this just reveals that these women haven’t had sufficient training in using breasts to maintain stability in extreme physical scenarios. \nWhen undulated in the correct manner, large breasts can act as tuned mass dampers, aka harmonic absorbers . By swinging in the opposite direction to that of the main body, breasts can help cancel out the effect of external forces, like the large pendulum-like dampers in skyscrapers and wind turbines . Ergo, large breasts reduce the impact of hits sustained in battle, allowing the female combatant to remain standing and retaliate in kind. \nMore proficient female fighters have also mastered their breast to achieve rotational movements to induce a gyroscopic effect , allowing them to put their body through extremely elaborate moves and actions , without ever losing their balance. An obvious tactical advantage. \nOffensive capabilities A Cobra’s venom is nothing to a working mammary gland. Photograph: Guardian Human breasts are ostensibly there to house mammary glands , which produce milk for the feeding of babies. This is fine, but this child rearing only ever takes up a few years of an adult woman’s life, assuming she opts to have any children at all. So why do women have breasts on a permanent basis? \nOutside of child rearing, breasts actually produce a powerful corrosive acid, like hydrochloric acid in the stomach but much worse , strong enough to dissolve the flesh from an enemies bones and, given enough time, capable of burning through most refined metals. \nSpecific changes in diet can alter the nature of the fluid produced by breasts. It requires great discipline but some women can use their breasts to produce and emit highly-toxic venom like a cobra . Alternatively, a greater consumption of more-spicy foodstuffs can result in the production of a napalm -like substance. \nThe more of this weaponised fluid is stored, the more pressure it is under and the further it can be excreted. This causes breasts to expand, which explains why so many female combatants have such large, turgid breasts in defiance of the usual restrictions of anatomy.\nHowever, this does mean the nipple and areola areas are “weak spots” on breasts, as they have to allow openings for fluid to escape. They also look a bit like a target too. This is why these are always covered, even if nothing else is. It’s not to avoid some arbitrary threshold of offensiveness to not get in trouble, it’s to not reveal the Achilles heel. Except it’s not a heel, it’s a nipple. \nThe alternative physics of breasts Facebook Twitter Pinterest If breasts have ever struck you as “physically impossible”, there’s a good reason for that. Photograph: Meridith Kohut / Barcroft Media/Meridith Kohut / Barcroft Media \nBreasts don’t obey the usual laws of physics. Video game makers figured this out long ago, which is why breasts in video games often behave in such surreal ways .\nThis is because breasts extrude into a slightly different dimension , one visible from ours that we can still interact with, but with its own subtly different properties and physics. \nFor instance, size and mass fluctuate more often in the breast dimension, hence bra measuring is so imprecise ; the breasts are actually shifting in size and shape constantly due to their exotic physics. \nThe gyroscopic properties and ability to store highly dangerous fluids are also results of the unique physics of breasts, but it also provides a distinct defensive property. Bullets and blades are very dangerous to humans due to the laws of conventional physics, but breasts don’t obey these laws , so are practically invulnerable to traditional weapons. You seldom see any of these comic or game characters with damaged breasts, and now you know why. \nAnd if they’re invulnerable, there’s no real point in covering them with clothes. Clothes are damageable, so you’ll just ruin a good outfit. \nAs a result of all this, many women find breasts incredibly useful in combat situations, as writer and gamer Emma Boyle points out.\n\n“Female gamers have long since known that we have an unfair advantage over our male counterparts. I’ve found that if my cleavage is large enough, it becomes an excellent place to store my collection of ninja throwing stars, a spare handgun, and a fighter jet. In fact, I don’t dare to use this move often, but the quasi-religious power of my breasts means that revealing even one nipple will result in face-melting scenes akin to the opening of the Ark of the Covenant .” \nIt’s not all advantageous though. Having such potent weapons attached to your chest all-day every-day is obviously going to have drawbacks, and they can sometimes become unmanageable and incredibly dangerous, as Gadgette editor Holly Brockwell discovered.\n\n“Having giant boobs was a huge problem for me. Not just because of the vexing back and neck strain , but because it was like having two nuclear warheads strapped to my chest. It was the day they almost took out a school bus full of small children that I realised they had to go for the safety of the planet - so I booked myself in for unilateral disarmament and have never looked back ” \nPeople may read this piece and think “None of this is true. This is ludicrous!” And they’d be right. But when we’re at a point where a female characters in a modern video game wears revealing clothes because she’s literally photosynthetic , ludicrousness is sometime the only appropriate response. \nFor the record, Dean Burnett has nothing against comics, video games, or breasts. He just finds the ways in which they’re often combined utterly bizarre. He’s on Twitter, @garwboy", "external_links": [], "published": "2015-10-09T10:10:00.000+03:00", "crawled": "2015-10-09T10:28:28.260+03:00", "highlightTitle": ""}