{"organizations": ["Brooks Hays Seattle"], "uuid": "2bc602481e4d8784a79ac5142b9d75f759f1ab73", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/volcano-spix-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/Scientists_model_the_inside_of_an_active_volcano_999.html", "country": "US", "title": "Scientists model the inside of an active volcano", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "Scientists model the inside of an active volcano", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T06:43:00.000+03:00", "replies_count": 0, "uuid": "2bc602481e4d8784a79ac5142b9d75f759f1ab73"}, "author": "", "url": "http://www.terradaily.com/reports/Scientists_model_the_inside_of_an_active_volcano_999.html", "ord_in_thread": 0, "title": "Scientists model the inside of an active volcano", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scientists model the inside of an active volcano by Brooks Hays Seattle (UPI) Oct 2, 2015 disclaimer: image is for illustration purposes only \nCurrently, volcano prediction models rely on external cues -- tremors, gas emissions and lava flows, past and present. \nBut researchers at the University of Washington are trying their hand at simulating an active volcano's innards, what they call a volcano's \"magma mush.\" \nThe model's aim is to better predict the behavior of magma inside a volcano's unique plumbing system. This is difficult as each volcano features a different set of pipes, and also because scientists don't entirely understand the behavioral tendencies of magma. \nThat's because magma is a unique plasma-like substance -- part liquid rock, part solid crystal. \nThe model was actually first developed by U.S. Department of Energy scientists to simulate fuel combustion. Washington researchers adapted the code to predict the behavior a volcano's magma mush. \nTheir work was published this week in the journal Nature Geoscience. \nModeling suggests a volcano's caldron of magma mush features three speeds of circulation: slow, medium and fast. The intermixing of these three states, new molten rock meeting older crystals, plays an important role in how a volcano's insides behave. \n\"In these crystal-rich mushes, we know that we have magma going in and sometimes it might punch through [the layer of crystals at the bottom],\" study co-author Jillian Schleicher, a doctoral student in Earth and space sciences, said in a press release. \"But we don't know how the mixing is happening or the timescales involved.\" \nSchleicher and her fellow researchers hope they can continue to perfect their model, as well as adapt it to specific conditions present in individual volcanoes. \n\"This tool is novel because it lets us explore the mechanics,\" said lead author George Bergantz, a professor of Earth and space sciences at Washington. \"It creates an interpretive framework for what controls the movement, and what might produce the signals we see on the outside.\" .", "external_links": [], "published": "2015-10-05T06:43:00.000+03:00", "crawled": "2015-10-05T14:34:59.317+03:00", "highlightTitle": ""}