{"organizations": [], "uuid": "2be6ce4e5abdc5c47393c32dfe489a0eca1df227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techon.nikkeibp.co.jp", "main_image": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/102500125/1.jpg}", "site_section": "http://techon.nikkeibp.co.jp/english/index.rdf", "section_title": "Nikkei Technology Online : tech news - straight from Asia.", "url": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/102500125/?n_cid=nbptec_tecrs", "country": "JP", "title": "Toyota Reduces Loss of Transaxle, Motor by 20% for New Prius", "performance_score": 0, "site": "nikkeibp.co.jp", "participants_count": 0, "title_full": "Toyota Reduces Loss of Transaxle, Motor by 20% for New Prius", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T12:46:00.000+02:00", "replies_count": 0, "uuid": "2be6ce4e5abdc5c47393c32dfe489a0eca1df227"}, "author": "", "url": "http://techon.nikkeibp.co.jp/atclen/news_en/15mk/102500125/?n_cid=nbptec_tecrs", "ord_in_thread": 0, "title": "Toyota Reduces Loss of Transaxle, Motor by 20% for New Prius", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Toyota Reduces Loss of Transaxle, Motor by 20% for New Prius Oct 26, 2015 The transaxle and motor of the new Prius [Click to enlarge image] The \"segment winding\" has an excellent winding space factor. [Click to enlarge image] \nToyota Motor Corp disclosed the details of the electric continuously variable transmission (transaxle) and driving motor of the new (fourth-generation) Prius Oct 13, 2015. \nThey are components developed based on the \"Toyota New Global Architecture (TNGA),\" a design concept for sharing parts across segments (modular design). Toyota reduced their sizes to use them for the TNGA-compatible new platform of the vehicle. Also, the company reduced the total loss of the transaxle and motor by about 20%. \nTransaxle \nIn the previous model of the Prius, a planetary gear mechanism is used to place the motor and generator with one (coaxial) shaft. On the other hand, Toyota used two shafts for the transaxle this time. \nThe company used parallel-shaft gears in place of the planetary gear mechanism as a transmission device and placed the motor using the upper shaft and the generator using the lower shaft in the aim of shortening each shaft. As a result, the total length of the new transaxle is 362mm, which is 47mm shorter than that of the previous transaxle (409mm). \nBy replacing the planetary gear mechanism with the parallel-shaft gears, the number of components was reduced by about 80%, realizing a simple structure and contributing to the small size and light weight. The small size and light weight of the new transaxle enabled to reduce mechanical loss by about 20%. \nMotor \nToyota increased the revolution speed of the motor from 13,000rpm to 17,000rpm, enabling to reduce the size of the motor. \nIn addition, the company increased the winding space factor of the stator winding by 10% or more by employing a \"segment winding,\" which has a rectangular cross-section and looks like teeth of a comb. Unlike a normal winding, which is wound around something, the segment winding is inserted to the stator, and the protruding other end is twisted for connection. \nAs a result, the weight and volume of the motor were reduced by 15% or more and about 20%, respectively. The winding method is distributed winding for the motor and concentrated winding for the generator. \nFor the rotor, Toyota employed a low-loss silicon steel plate to improve efficiency and made improvements to the magnetic circuit design to reduce higher harmonics waves and magnetic loss. As a result, the electric loss of the motor was reduced by about 20%.", "external_links": [], "published": "2015-10-26T12:46:00.000+02:00", "crawled": "2015-10-26T06:11:38.930+02:00", "highlightTitle": ""}