{"organizations": [], "uuid": "cc2c2bebed588262a248401c6f0436a9f53d770d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/150720103253-isis-terrorism-780x439.jpg", "site_section": "http://rss.cnn.com/rss/money_technology.rss", "section_title": "Technology news - CNNMoney.com", "url": "http://money.cnn.com/2015/10/15/technology/isis-energy-grid/index.html", "country": "US", "title": "ISIS is attacking the U.S. energy grid 15,", "performance_score": 7, "site": "cnn.com", "participants_count": 11, "title_full": "ISIS is attacking the U.S. energy grid - Oct. 15, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:29:00.000+03:00", "replies_count": 10, "uuid": "cc2c2bebed588262a248401c6f0436a9f53d770d"}, "author": "Jose Pagliery", "url": "http://money.cnn.com/2015/10/15/technology/isis-energy-grid/index.html", "ord_in_thread": 0, "title": "ISIS is attacking the U.S. energy grid 15,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fun with fuel cells: Go off the grid, for good The Islamic State is trying to hack American electrical power companies -- but they are terrible at it. U.S. law enforcement officials revealed the hack attempts on Wednesday at a conference of American energy firms who were meeting about national security concerns .\n\"ISIL is beginning to perpetrate cyberattacks,\" Caitlin Durkovich, assistant secretary for infrastructure protection at the Department of Homeland Security, told company executives.\nInvestigators would not reveal any details to CNNMoney -- or cite evidence of specific incidents.\nBut they did say the attacks by the Islamic State have been unsuccessful. Terrorists are not currently using the most sophisticated hacking tools to break into computer systems and turn off or blow up machines.\n\"Strong intent. Thankfully, low capability,\" said John Riggi, a section chief at the FBI's cyber division. \"But the concern is that they'll buy that capability.\"\nIndeed, hacking software is up for sale in black markets online. That's often how mafias acquire the cyberweapons they use to break into companies and steal giant databases of information they later sell to fraudsters.\nThe FBI now worries that the Islamic State or its supporters will buy malicious software that can sneak into computers and destroy electronics. An attack on power companies could disrupt the flow of energy to U.S. homes and businesses.\nAnd it's not just Islamic extremists. There's an equal threat from domestic terrorists and hate groups, according to Mark Lemery. He's the \"critical infrastructure protection coordinator\" who helps coordinate defenses against attacks in Utah. But again, the worries are tempered.\n\"They'd love to do damage, but they just don't have the capability,\" Lemery said. \"Terrorists have not gotten to the point where they're causing physical damage.\"\nOfficials made clear that the greater concern is attacks from other countries. Riggi said malware found last year on industrial control systems at energy companies -- including pumps and engines -- were traced to the Russian government.\nBesides, the likelihood of a hack taking out the entire U.S. energy grid -- or even a section of it -- is extremely low. The grid isn't as uniform and connected as people might believe. Currently, it's a chaotic patchwork of \"grids,\" each with different types of machines and software that don't smoothly coordinate or communicate.\nThat jumble actually works to the nation's advantage, energy company executives said. It would take a large, expensive team of highly technical spies to understand the layout of computers and machines at an energy company. Then it takes stellar hackers to sneak in. And even if they do manage to flip a switch -- which companies maintain has never happened here in the United States -- the attack might only take out electricity fed to a tiny portion of land, maybe a section of a city. An entirely different type of attack would be needed to carry that over to the next power plant.\nExperts attending GridSecCon, held by the North American Electric Reliability Corporation, seemed cautious but hopeful.\nWhen energy industry representatives asked Riggi how the FBI knows who's hacking -- whether it's a government or independent hacking group -- he said American spies that are monitoring computer networks are quick to share information with law enforcement.\n\"We've had pretty good success actually,\" Riggi said. \"Since the FBI is an intelligence agency, we rely on the help of CIA and NSA. We compare information with the NSA.\"\nRelated: Computer outage brings slowdown to U.S. airports\nRelated: This is the cyberwarfare Jim Webb was talking about\nCNNMoney (Philadelphia) October 15, 2015: 12:29 PM ET", "external_links": ["http://i2.cdn.turner.com/money/dam/assets/150910170350-elon-bloom-still-1024x576.png"], "published": "2015-10-15T20:29:00.000+03:00", "crawled": "2015-10-16T00:40:24.759+03:00", "highlightTitle": ""}