{"organizations": [], "uuid": "53333394c5f9d7a93382ef827b6446d39c658c36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143304/rocket-software-advances-modernization-ibm-i-platform", "country": "US", "title": "Rocket Software Advances Modernization for IBM i Platform", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Rocket Software Advances Modernization for IBM i Platform", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T13:00:00.000+03:00", "replies_count": 0, "uuid": "53333394c5f9d7a93382ef827b6446d39c658c36"}, "author": "admin", "url": "http://www.freshnews.com/news/1143304/rocket-software-advances-modernization-ibm-i-platform", "ord_in_thread": 0, "title": "Rocket Software Advances Modernization for IBM i Platform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/21/2015 @ 3:00 AM   Rocket Software \nWALTHAM, Mass., Oct. 21, 2015 /PRNewswire/ -- Rocket Software, Inc. ( www.rocketsoftware.com ) today announced that it has expanded its commitment to the IBM i community with the launch of a major new application modernization product. Rocket Mobile for IBM i is an enterprise mobile development and deployment platform that enables organizations to cost-effectively leverage their existing application investments to create new mobile applications faster and with less risk. \nhttps://photos.prnewswire.com/prnvar/20151020/278970 \n\"Our relationship with IBM goes back more than two decades and we continue to increase our investment in the IBM i platform and the IBM i community,\" says Rocket CEO Andy Youniss. \"The launch of Rocket Mobile is an important next step in our continued commitment to the organizations and enterprises that rely on this platform every day.\" \n\"IBM, along with its Business Partners, continue to ensure that our IBM i customers can take maximum advantage of the newest technologies,\" said Dexter Henderson, Vice President, IBM Power Systems. \"In keeping with that, I am pleased that our long-time Business Partner Rocket Software is launching Rocket Mobile to add to the thriving mobile ecosystem surrounding IBM i.\" \nRocket Mobile for IBM i provides a comprehensive platform for enterprise mobility and offers features to build, integrate, deploy, manage, and monitor portfolios of mobile applications. Its key benefits include simple mobile development and integration that allows fast creation of apps. Among Rocket Mobile's features are: -- Application management to provide version control -- Identity management to control access and permissions -- Deployment to all major mobile platforms including iOS and Android -- Security and data encryption -- Offline support to allow access without network reception -- Operational insight to capture metrics and analyze user behavior. \nRocket Mobile is already being used by a number of organizations, including TW Metals, a global leader in the distribution and processing of specialty metals. \"For us, mobile is key to maintaining a competitive edge, and a strategic element in how we engage with our customers,\" says Aldo Miceli, Vice President and Chief Information Officer of TW Metals, Inc. \"Previously, we had used Rocket to modernize IBM i applications, so we knew they had the expertise. Rocket Mobile enables us to reuse our existing development, which shrinks our mobile development cycle, and allows us to deliver new services faster to the business.\" \nTo request a demo or to see the technical requirements for this platform, visit http://www.rocketsoftware.com/rocket-mobile-ibm-i \nAbout Rocket Software Rocket Software is a global software development firm that builds enterprise products and delivers enterprise solutions in the following segments: Business Information and Analytics; Storage, Networks, and Compliance; Application Development, Integration, and Modernization; and Database Servers and Tools. Rocket is engaged in business and technology partnerships with IBM, EMC, Fujitsu, Hitachi Data Systems, Avaya, Epicor, Infor, and many others. The company is headquartered in Waltham, Massachusetts, USA. \nRocket Press Contact Richard Berman for Rocket Software Phone: 415 359 4906", "external_links": [], "published": "2015-10-21T13:00:00.000+03:00", "crawled": "2015-10-21T15:03:55.370+03:00", "highlightTitle": ""}