{"organizations": [], "uuid": "5e6129fcfb5e990a0bb48e5d921a519ff96a89c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za/polopoly_fs/minecraft-3-jpg-1.1930893!/image/3173543096.jpg_gen/derivatives/box_600/3173543096.jpg", "site_section": "http://www.iol.co.za/cmlink/scitech-technology-rss-1.847487", "section_title": "Scitech Technology RSS", "url": "http://www.iol.co.za/minecraft-for-dummy-parents-1.1930897", "country": "US", "title": "Minecraft for dummy parents", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "Minecraft for dummy parents", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T08:01:00.000+03:00", "replies_count": 0, "uuid": "5e6129fcfb5e990a0bb48e5d921a519ff96a89c9"}, "author": "", "url": "http://www.iol.co.za/minecraft-for-dummy-parents-1.1930897", "ord_in_thread": 0, "title": "Minecraft for dummy parents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jak"], "text": "The Minecraft house that Jak made in half an hour to illiustrate this article. The Minecraft house has a path to the front door and a forest (on the left). A river runs through it. The flowers of the forest. October 16 2015 at 07:01am \nCape Town - IOL Lifestyle carries a regular column from the Daily Mail by Lorraine Candy. \nCandy is the editor-in-chief of Elle magazine, a mother of four and a wise and funny columnist on the subject of parenting in general and her brood of four children in particular. \nYet last week, she was in need of a little help . \nShe describes her children and their friends being engrossed in a game called Minecraft, which she cannot understand \n\"It may have notched up 100 million downloads since its launch six years ago, but believe me, it is so boring I would rather help Mr Candy fold his secret stockpile of plastic bags than play it.\" she writes. \n\"I know everyone believes computer games open the door to a dark, dangerous world, but if Minecraft is anything to go by, it is a gateway to nothing more sinister than tiddlywinks,\" she continues. \nAnd the thing is, she is wrong on all counts. \nOurs is a Minecraft household, and my son has been playing it for several years. I have watched over his shoulder a lot, and while I don't pretend to understand the nuances, I do see why he loves it. \nThe fundamental thing about Minecraft - which makes it unlike many other video and computer games (and I have watched a lot of those, too) - is that is a \"sandbox\" game: it gives you the ability to make, and break, and remake, things. Children are able to use the tools of the game (in Creative Mode) to build houses, ships, treehouses, rivers, whole worlds. So think of it as Lego on steroids. \nThere are touches of whimsy - random pigs and sheep wander around at will, the sun sets and rises, treasures can be found in unexpected places. \nIn multiplayer mode, where you interact with other people, you can form factions, build things together, defeat dreadful enemies, keep a pet dog... and on and on. Again, much of it is under your own control: it is not a game that is made for you. You make it for yourself. \nAnd it cements friendships: my son and his friends talk to each other on Skype about their lives while their hands doodle their way though endless Minecraft adventures communally and co-operatively. They might as well be a knitting circle. \nIn short, Minecraft is exactly the kind of game we would want our children to be engaged in in the real world. And I know because I have taken the trouble to talk to my son about it, and to watch him play. \nCandy describes her mute children in a ring, silent as they play. She herself has a \"prejudice against computer games\". \nI find that a rather sad picture when I consider how Jak loves my involvement in a very important part of his life. \nI would counsel her - and other adults in the same boat - to ditch her prejudices, get down on the floor with her children and enter their delightful world. \nFind your inner geek, Lorraine! It's worth it, I promise. \nIOL \n\n* Want to talk to IOL Lifestyle? Please email us on [email protected] , or use our Facebook pages to comment on our stories - or talk to us on Twitter. The links are attached to the bottom of all our stories. Related Stories", "external_links": [], "published": "2015-10-16T08:01:00.000+03:00", "crawled": "2015-10-16T10:19:22.092+03:00", "highlightTitle": ""}