{"organizations": [], "uuid": "cedf6c8873dff21e43cc20718e707c1e5fdac42d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-55f0a672/turbine/ct-apple-event-live-20150909", "site_section": "http://www.chicagotribune.com/bluesky/technology", "section_title": "Technology - Blue Sky Innovation - Chicago Tribune", "url": "http://www.chicagotribune.com/bluesky/bluesky/technology/ct-apple-event-live-20150909-story.html", "country": "US", "title": "The Latest: Key dates on iPhones, other Apple releases", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "The Latest: Key dates on iPhones, other Apple releases - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T22:43:00.000+03:00", "replies_count": 0, "uuid": "cedf6c8873dff21e43cc20718e707c1e5fdac42d"}, "author": "Tribune wire reports", "url": "http://www.chicagotribune.com/bluesky/bluesky/technology/ct-apple-event-live-20150909-story.html", "ord_in_thread": 0, "title": "The Latest: Key dates on iPhones, other Apple releases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The latest news on iPhones and other products from Apple's event in San Francisco.\nAll times are PDT.\n12:30 p.m. (2:30 p.m. Central)\nHere's a cheat sheet on what's coming when from Apple.\nA free update for existing iPhones and iPads will come next Wednesday. It brings transit directions, a news-viewing app and other refinements.\nA software update for the Apple Watch will also come next Wednesday, giving it greater functionality without a phone nearby. The hardware isn't changing, but there will be additional choices of cases and bands.\nNew iPhone models will go on sale Sept. 25 in the U.S. and other markets, with advance orders being taken starting Saturday. They come with sharper cameras and new user interactions. Prices remain the same as last year, starting at $200 for an iPhone 6s with a two-year service contract.\nApple TV, iPhone 6s among new Apple hardware VIDEO: Apple has unveiled a host of new hardware from new iPhones and iPads and a long-awaited update to Apple TV. Sept. 9, 2015. (AP)\nVIDEO: Apple has unveiled a host of new hardware from new iPhones and iPads and a long-awaited update to Apple TV. Sept. 9, 2015. (AP)\nSee more videos The new Apple TV is coming out in late October and will feature voice controls and more types of apps, including games. It will start at $149.\nA larger-screen iPad Pro will go on sale in November, starting at $799.\nApple announced its fall plans Wednesday at an event in San Francisco. It ended after more than two hours with a performance by the band One Republic.\nApple hasn't announced a release update for a Mac software update, known as El Capitan.\n___\n12:10 p.m. (2:10 p.m. Central)\nThe new iPhones will go on sale on Sept. 25, with advance orders starting this Saturday.\nThat's a week later than Apple's typical playbook. Usually, new iPhones go on sale on the second Friday after their announcements.\nConsistent with past models, the iPhone 6s will start at $200 with a two-year service contract. The iPhone 6s Plus will start at $300 with a contract. Last year's models will cost $100 less.\nThe markets getting it right away are the U.S., Australia, Canada, China, France, Germany, Hong Kong, Japan, New Zealand, Puerto Rico, Singapore and the U.K.\nApple stakes new claim to living room, shows new iPhones Tribune wire reports Apple staked a new claim to the living room on Wednesday, as the maker of iPhones and other hand-held gadgets unveiled an Internet TV system that's designed as a beachhead for the tech giant's broader ambitions to deliver a wide range of information, games, music and video to the home.\nCEO Tim...\nApple staked a new claim to the living room on Wednesday, as the maker of iPhones and other hand-held gadgets unveiled an Internet TV system that's designed as a beachhead for the tech giant's broader ambitions to deliver a wide range of information, games, music and video to the home.\nCEO Tim...\n(Tribune wire reports) The base models of the new iPhones will come with 16 gigabytes of storage, even as Samsung and other phone makers are now offering 32 gigabytes to start.\nBut for $100 more, Apple is offering 64 gigabytes. For an extra $200 over the base prices, Apple is offering 128 gigabytes.\nApple announced the new iPhone details at an event Wednesday in San Francisco.\n———\n12:05 p.m. (2:05 Central)\nThe new iPhones will have sharper cameras.\nApple says that the main camera on the iPhone 6s and 6s Plus will have a resolution of 12 megapixels. It's the first increase since 2011, when the iPhone 4s got 8 megapixels, compared with 5 megapixels before.\nBut many high-end Android phones have long had more. Samsung phones, for instance, have 16 megapixels, while an upcoming Sony phone will have 23 megapixels.\nApple said at an event in San Francisco Wednesday that it waited until it could ensure delivering more megapixels without image degradation.\nMeanwhile, the front camera for selfies is getting a boost to 5 megapixels, from 1.2 megapixels, matching Samsung's latest phones. Plus, the new iPhones will use the main display as a flash, something the front camera now lacks.\nAnd video recording will be improved to the Ultra HD, or 4k, resolution found on Samsung and Sony phones.\n———\n11:50 a.m. (1:50 p.m. Central)\nApple's new iPhones come as smartphone sales are slowing worldwide, given that many people already own one.\nBut researchers at IDC say that iPhone sales are growing faster than those of Android phones. IDC expects iPhone shipments to grow by 16 percent this year, while it estimates Android phones will grow only 10 percent.\nDuring a presentation Wednesday in San Francisco, Apple introduced new iPhone models with faster processors and a new feature called 3D Touch, which allows easy access to frequent tasks by holding down on an icon. For instance, it'll be possible to update a Facebook status right from the home screen.\nAndroid still dominates overall, with iPhones making up only about 15 percent of smartphones sold around the world. But Apple's phones tend to be more profitable. Rivals like Samsung and HTC sell many lower-cost phones that carry lower profit margins.\nIDC recently lowered its overall forecast for smartphone shipments in 2015, saying once-hot markets like China are becoming “mature,” meaning many people already have phones. Apple has seen strong growth in China, however, and CEO Tim Cook has touted the company's opportunities there.\n———\n11:40 a.m. (1:40 p.m. Central)\nMost smartphone users are accustomed to “multi-touch” — the ability for phones to recognize touches from multiple fingers, enabling such capabilities as pinching to zoom.\nNow comes 3D Touch. Pressing down hard on the new iPhones will launch additional capabilities. For example, you can get quick access to tasks such as taking a selfie or getting directions home. From a message, 3D Touch will give you a preview of a Web link without launching the browser.\nApple announced the new feature at an event in San Francisco on Wednesday.\nApple introduced this concept with some Mac laptops in March. It's called Force Touch on other devices. Press for a few seconds on a document icon, and a preview pops out. Press on an address in an email, and a map opens up. On some video apps, the pressure determines how quickly you forward or rewind.\nApple Watch also has Force Touch. Press on the Workout app, for instance, to pause or end a run.\n11:35 a.m. (1:35 Central)\nApple says the frames of the new iPhones will be made of a stronger form of aluminum.\nLast fall, Apple got some complaints that the iPhone 6 Plus was more prone to bending than previous models. Apple defended its manufacturing standards and said bending was rare with normal use of an iPhone.\nStill, the stronger frame in this year's iPhone 6s and 6s Plus should help reduce those problems.\nApple is announcing the new models Wednesday.\nThe jumbo Samsung phones released last month — the Galaxy Note 5 and the Galaxy S6 Edge Plus — also have stronger aluminum frames than before.\n———\n11:25 a.m. (1:25 p.m. Central)\nApple's new Apple TV set-top box will start at $149 and will be available in late October.\nThe company will continue selling the existing model for $69, a price that had dropped from $99 in March.\nThe main Roku 3 and Amazon Fire TV devices cost about $100, though cheaper versions with fewer features are available — as low as $39 for the Amazon Fire TV Stick. Google also sells a Chromecast device for $35.\nMaynard Um of Wells Fargo Securities has said that to justify a higher price, “Apple will have to provide significant innovation and functionality.”\nThe new Apple TV has new capabilities such as voice controls and non-video apps, including games and shopping. Even video apps will have more capabilities, including baseball stats and the ability to watch two games at once side by side.\nIt remains to be seen whether consumers will consider those capabilities to be enough.\nThe new device was announced Wednesday at an Apple event in San Francisco.\n———\n11:10 a.m. (1:10 p.m. central)\nApple's set-top box is catching up with such rivals as Roku and Amazon's Fire TV with the ability to install new apps on the device and to search for video with voice controls.\nApple has long insisted on controlling apps available on the device's home screen. In doing so, it can ensure that menus and keyboards look and feel the same, whether you're on Netflix or PBS.\nBut there have been many services unavailable on the home screen. To watch on the TV, viewers have had to launch those apps on an iPhone or iPad first and use a feature called AirPlay to get video on the TV through the home Wi-Fi network. Complicated.\nHaving app choices directly on the home screen make things simpler. To make sure everything runs smoothly, Apple created a new version of its mobile operating system called “tvOS.”\nThe app store also allows for non-video services, such as games and music.\nA new remote has a Siri microphone button for voice commands such as “show me some comedies.” The new device can search through shows and movies available on a range of apps including Netflix, Hulu, HBO and Showtime.\n10:55 a.m. (12:55 p.m. central)\nApple says its new iPad will be available in November.\nThe larger-screen iPad Pro model is aimed at countering weakening consumer demand for tablets.\nThe iPad was a runaway success when it was introduced in 2010, but sales have been declining since 2013. In part, that's because competitors are now selling a number of lower-priced tablets that use Google's Android software.\nBut sales of rivals' tablets have been getting weaker, too. Analysts say some users are finding tablets aren't well-suited for tasks that are easier to perform on a PC with a keyboard and mouse. And many consumers don't see a need to upgrade their old tablets as often as they upgrade phones.\nIn response, Apple has tried to cultivate more iPad customers in the business world. It has partnered with IBM to develop new iPad software for workers in specific industries, such as airlines and health care.\nAt an Apple event in San Francisco on Wednesday, an executive from Apple's former rival, Microsoft, demonstrated the iPad Pro's productivity potential using Microsoft Office and other apps. Other companies showed off using the iPad Pro for creativity tasks and health care — including an app for doctors to show patients what's happening with 3-D graphics.\nThe starting price is $799, with 32 gigabytes of storage. By contrast, the iPad Air 2 starts at $499, but the starting model has half the memory.\n10:35 a.m. (12:35 p.m. central)\nApple says it will make a larger-screen iPad tablet aimed at business users.\nThe iPad Pro, as it's called, will take advantage of new multitasking features coming to existing iPads. A software update will enable iPads to run two apps side by side, something previously limited to Samsung and Windows tablets.\nWith a larger screen on the new iPad Pro, apps running side by side will have more room to breathe.\nThe new iPad will have a 12.9-inch screen, compared with 9.7 inches for the current full-size iPad. It will have four speakers and options for a physical keyboard and a stylus, called Apple Pencil. Despite the larger size, Apple says it's about the same weight as the original iPad.\nSamsung made a tablet aimed at professionals last year. It had screens as large as 12.2 inches and also came with a stylus. More recently, though, Samsung has been shrinking the screens on its tablets.\nThe new iPad also marks Apple's latest attempt to steal corporate customers away from Microsoft, whose personal computers have been business staple for decades. Microsoft makes a tablet designed for the needs of office workers called the Surface Pro 3 that sells at prices starting at $800. With a 12-inch display screen, the Surface Pro 3 is slightly smaller than Apple's new tablet.\nAlthough there has been a lot of speculation that Apple would do make a larger iPad, an announcement wasn't expected until October. A release date and price wasn't immediately known.\nApple announced the new iPad in San Francisco on Wednesday.\n10:20 a.m. (12:20 p.m. central)\nApple says a software update for the Apple Watch is allowing outsider developers to write more sophisticated apps.\nWith the update, outside developers can make apps specifically for the watch and interact directly with its sensors and controls. That will enable apps that analyze golf swings or record audio. Before, third-party apps have been limited to being extensions of apps that run on the iPhone.\nThe new software will be available as a free download starting next Wednesday.\nAt an event in San Francisco Wednesday, Apple said there are now 10,000 apps designed for the watch, including ones from Facebook and GoPro — the later using the watch's screen as a viewfinder for the video camera. Apple says the new capabilities will also allow additional health-related apps.\nThe upcoming Samsung Gear S2 will also allow outside parties to write apps that run directly on the watch. Google is also hoping programmers create apps that can work independently on watches running on its Android Wear software.\n8 a.m. (10 a.m. central)\nApple investors are hoping that new iPhones and other products expected Wednesday will boost the company's stock.\nApple isn't saying what the event in downtown San Francisco is about, but the company usually announces new iPhones around this time.\nApple's stock has fallen as investors fret over whether the company can duplicate the phenomenal sales growth it saw after introducing last year's iPhone 6 and 6 Plus.\nIn a note to clients, FBR Capital Markets analyst Daniel Ives says the event is critical “for Apple to help turn the negative investor tide, and help lay out its growth vision for the next year.”\nAnalyst Amit Daryanani of RBC Capital Markets says the announcements should be “a positive catalyst” for Apple shares.\nBut Maynard Um of Wells Fargo Securities says many investors already have “low expectations.” Um says this year's iPhones aren't expected to be dramatically different from last year's models.\n7:30 a.m. PDT (9:30 a.m. central)\nNew iPhones expected from Apple on Wednesday come amid questions about whether the company can sustain growth for its best-selling device.\nApple sold more than 74 million iPhones in the first three months after it released the super-sized iPhone 6 and 6 Plus models last year. That's 46 percent more phones than it sold in the same period a year earlier. To get that same 46 percent increase, Apple would have to sell more than 108 million iPhones in the next three months.\nJerry Kim, a Columbia University management professor, says the expectations might seem unfair, but Wall Street “will definitely be disappointed if they can't break another record next quarter.”\nApple CEO Tim Cook has said he believes there is still room for iPhone sales to expand. He's told analysts that an increasing number of iPhone buyers are people who used to own devices running Google's Android software.\nResearch firm Kantar Worldpanel says many iPhone owners have older models, suggesting they may be ready to upgrade to a newer iPhone in the coming months.\nAssociated Press\n Apple Inc. Apple iPhone Google Inc. Microsoft Surface Apple TV Wells Fargo Tim Cook", "external_links": ["http://www.trbimg.com/img-55f1e880/turbine/ct-apple-tv-iphone-6s-among-new-ap-20150909", "http://www.trbimg.com/img-55f1e8d4/turbine/ct-apple-event-iphone-ipad-20150909", "http://www.trbimg.com/img-55f0a672/turbine/ct-apple-event-live-20150909"], "published": "2015-09-09T22:43:00.000+03:00", "crawled": "2015-10-01T23:26:55.827+03:00", "highlightTitle": ""}