{"organizations": [], "uuid": "1c01415ad44a0a299b47c202b31348d7bfc78cb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/15/13026283/Screen Shot 2015-10-15 at 1.37.38 PM.png", "site_section": "http://www.prweb.com/rss2/9974techinfo.xml", "section_title": "Technology: Information", "url": "http://www.prweb.com/releases/2015/10/prweb13026283.htm", "country": "US", "title": "Oral Roberts University Expands Global Education Network with OneCampus from rSmart", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Oral Roberts University Expands Global Education Network with OneCampus from rSmart", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "1c01415ad44a0a299b47c202b31348d7bfc78cb6"}, "author": "Tiffani Nichols", "url": "http://www.prweb.com/releases/2015/10/prweb13026283.htm", "ord_in_thread": 0, "title": "Oral Roberts University Expands Global Education Network with OneCampus from rSmart", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oral Roberts University has selected and implemented OneCampus from rSmart to provide Global students, faculty, and staff seamless access to its global online learning programs and campus services. The lightweight, mobile-friendly technology provides students across the world access to ORU’s fully-accredited bachelor's and master’s degrees anytime, anywhere, via any connection or device. As a leading Christian university with more than 65 undergraduate majors, 14 master's-level programs and two doctoral degrees, ORU has embraced globalized learning and innovation at home and abroad. The Tulsa campus is home to students from all 50 U.S. states and 86 international countries.\nOneCampus will empower students in Oklahoma and across the globe to find and discover ORU’s campus services, technology, and degree programs through a simple, intuitive interface from their smartphone, tablet, laptop or desktop computer.\n“It is estimated that 42% of all U.S. working adults have a college degree, while only 6.8% of all global working adults have a college degree. Our global society has been eagerly awaiting a flexible solution to address the global education attainment challenges. Through partnerships and technological advances like OneCampus, we can now address this need and grow our enrollment at ORU both locally and globally,” said Michael Mathews, CIO at ORU.\nUnlike traditional portals, OneCampus takes a fresh, new approach to organizing web-based campus services with a Google-like search, ratings, and reviews to effectively analyze what services are being used and satisfaction levels.\nFrom an IT Enterprise perspective, OneCampus sits on top of mobile apps and existing systems, as it seamlessly navigates users to disparate services and applications through a centralized point without affecting the underlying business units or processes. As a result, its implementation as well as ongoing updates are fast and easy, and the responsibility of maintenance can be shared by all campus stakeholders. Mathews states that, \"OneCampus is the Maestro to all other IT performing applications, in order to make IT appear as a enterprise that operates in complete unison.”\nrSmart CEO Tony Potts added, “As the higher education landscape continues to change and evolve, we are honored to partner with forward-thinking universities like ORU. Together, we have an opportunity to have a direct, positive impact on everyday student life.”\nTo learn more about OneCampus or to request a demo, visit http://www.rsmart.com . OneCampus will also be on display at rSmart booth #1942 at the EDUCAUSE Annual Conference Oct. 27-30 in Indianapolis, Indiana.\nAbout Oral Roberts University\nFounded to educate the whole person - mind, body and spirit - Oral Roberts University promises a thorough education in the context of a vibrant Christ-centered community. ORU offers more than 65 undergraduate majors, 14 master's-level programs and two doctoral degrees. Faculty members educated at the nation's top graduate schools serve as academic, professional and spiritual mentors to students. To learn more, visit http://www.oru.edu .\nAbout rSmart\nFor more than 15 years, rSmart has been changing the way higher ed thinks about technology by delivering solutions that reduce costs, improve productivity, and simplify the user experience. The OneCampus product is a lightweight, mobile-friendly technology that makes finding campus services faster and easier than ever. rSmart is privately held and headquartered in Scottsdale, AZ. Learn more at https://www.rsmart.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9vbmVjYW1wdXMub3J1LmVkdS8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5vcnUuZWR1", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5yc21hcnQuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cucnNtYXJ0LmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cucnNtYXJ0LmNvbS9hYm91dC1vbmVjYW1wdXM="], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T20:34:44.722+03:00", "highlightTitle": ""}