{"organizations": [], "uuid": "8aa1f3903fd28ad33774ead67c85568c7fa9ade5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.innovativeretailtechnologies.com", "main_image": "", "site_section": "http://www.retailsolutionsonline.com/rssfeeds/rssnews", "section_title": "Innovative Retail Technologies News", "url": "http://www.innovativeretailtechnologies.com/doc/onboarding-holiday-help-don-t-cut-corners-0001?atc~c=771+s=773+r=001+l=a", "country": "US", "title": "Onboarding Holiday Help? Don't Cut Corners", "performance_score": 0, "site": "innovativeretailtechnologies.com", "participants_count": 1, "title_full": "Onboarding Holiday Help? Don't Cut Corners", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T17:03:00.000+03:00", "replies_count": 0, "uuid": "8aa1f3903fd28ad33774ead67c85568c7fa9ade5"}, "author": "MattPillar", "url": "http://www.innovativeretailtechnologies.com/doc/onboarding-holiday-help-don-t-cut-corners-0001?atc~c=771+s=773+r=001+l=a", "ord_in_thread": 0, "title": "Onboarding Holiday Help? Don't Cut Corners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From The Editor | October 7, 2015 Onboarding Holiday Help? Don't Cut Corners To access this content, please Register or Sign In. By Matt Pillar , senior executive editor, Innovative Retail Technologies \nEarlier this month, I shared a few tips for hiring holiday help in a shallow labor pool marked by low unemployment and a growing population of able-bodied Americans who simply don’t want to work. \nIt’s crunch time for retailers to bulk up on seasonal staff, and with a limited labor market, many risk onboarding warm bodies at best, and bad actors at worst. \nThe holiday rush might make it tempting to skip important steps in the store associate vetting process. But, foregoing candidate screening and background checks both a risky idea and a completely avoidable mistake. \nIt’s a bad idea because uncommitted seasonal associates are often the most likely to pilfer cash and inventory from their temporary employers. The industry’s shrink rate is perennially higher in the fourth quarter than at any other time of the year, and that’s a result of more people—customers and associates alike—in retail stores. Terrence Shulman, JD, LMSW, ACSW, CAAC, CPC, framed it well in a blog post on hayesinternational.com last year. “The holiday season is supposed to be the most wonderful time of year,” he wrote, “but, for various reasons, statistics show that retail crime rates increase by 30%.” Temporary staffers are one of those various reasons. They know they’re entering an engagement with few string attached and a definitive end date, so their loyalty to your brand and its success is questionable at best. \nPlease log in or register below to read the full article. Like what you are reading? Sign up for our free newsletter SIGN ME UP By clicking Sign Me Up, you agree to our Terms and that you have read our Privacy Policy . Register Today. It's Fast And Free. \nThe content you requested is only available to registered users of Innovative Retail Technologies. By registering now, you'll get exclusive access to this piece of content and thousands of additional articles and product reviews across our entire network of sites. Already Registered? Sign In.", "external_links": [], "published": "2015-10-07T17:03:00.000+03:00", "crawled": "2015-10-08T02:45:40.390+03:00", "highlightTitle": ""}