{"organizations": [], "uuid": "c2ca5f356365bf523ca2d0b9bb82d983e51a8ceb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=13534_1430.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=ScienceComputersTechnology&premium=1", "section_title": "Science, Computers, & Technology RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/cftc-asserts-jurisdiction-in-bitcoin-49992/", "country": "US", "title": "\"CFTC Asserts Jurisdiction in Bitcoin Markets\"", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "\"CFTC Asserts Jurisdiction in Bitcoin Markets\"", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T01:43:00.000+03:00", "replies_count": 0, "uuid": "c2ca5f356365bf523ca2d0b9bb82d983e51a8ceb"}, "author": "Skadden, Arps, Slate, Meagher &amp; Flom LLP", "url": "http://www.jdsupra.com/legalnews/cftc-asserts-jurisdiction-in-bitcoin-49992/", "ord_in_thread": 0, "title": "\"CFTC Asserts Jurisdiction in Bitcoin Markets\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"CFTC Asserts Jurisdiction in Bitcoin Markets\" more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=1e6c5e1c-12eb-443c-937a-d8b0f14b503a\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nThe Commodity Futures Trading Commission (CFTC) recently took a series of actions confirming views expressed late last year by CFTC Chairman Timothy Massad that \"[d]erivatives contracts based on a virtual currency represent one area within [the CFTC's] responsibilities.\" 1 \nWith very limited exceptions, the Commodity Exchange Act (CEA) grants the CFTC exclusive jurisdiction over the trading of futures, options and swaps on \"commodities.\" The CEA contains an expansive definition of \"commodity\" to include \"goods and articles … and all services, rights and interests … .\" 2 On September 17, 2015, the CFTC issued a settlement order (the CFTC Order) in an enforcement action finding for the first time that \"Bitcoin and other virtual currencies are encompassed in the definition and properly defined as commodities.\" 3 \nIn what the CFTC described as its first action against an unregistered Bitcoin options trading platform, the CFTC charged Coinflip, Inc. and its founder and chief executive officer with failures to comply with the CEA or CFTC regulations for operating a facility for trading or processing \"commodity options.\" Among other findings, the CFTC Order found that from at least March 2014 through July 2014, Coinflip operated a facility for the trading of swaps without registering as a swap execution facility (SEF) 4 or a designated contract market. 5 \nAlbeit in footnotes, but perhaps most significantly, the Coinflip case put the CFTC on record as concluding that Bitcoin, while a commodity, is not a currency. 6 In summarizing the facts of the case, the CFTC explained that Bitcoin is \"distinct from 'real currencies'\" of the United States or another country. 7 In addition, the CFTC Order in the Coinflip settlement specifically noted that the Bitcoin options were not eligible for the CFTC's \"trade option exemption” in CFTC Rule 32.3. 8 Since the CFTC's trade option exemption can only be claimed for an option that would result in delivery of an \"exempt\" or agricultural commodity, this violation in effect serves as the CFTC's finding that it will not treat Bitcoin as a currency. This is because the term \"exempt\" commodity includes metals, energy, weather events and certain other commodities, but explicitly excludes currency. 9 \nThe CFTC finding that Bitcoin is an exempt commodity and not a currency will have regulatory consequences as more Bitcoin issues come before the CFTC. For example, if Bitcoin is not a currency, then Bitcoin forwards and Bitcoin swaps that involve the exchange of Bitcoin for another currency will not fall under the statutory definitions of the more lightly regulated foreign exchange forwards or foreign exchange swaps. 10 Likewise, retail trading of Bitcoin derivatives will be limited to designated contract markets, rather than subject to the retail foreign exchange dealer regulations. 11 Treating Bitcoin as a commodity that is not a currency dovetails with the stances taken by other U.S. regulators such as the Financial Crimes Enforcement Network (FinCEN) (virtual currency does not have all of the attributes of real currency) 12 , the Securities and Exchange Commission (Bitcoin investments are investment contracts because Bitcoin is a form of money) 13 and the Internal Revenue Service (treating Bitcoin as property for tax purposes). 14 \nBy treating Bitcoin as a commodity, but not a currency, the CFTC has opened the door to greater CFTC regulation of Bitcoin derivatives in certain, but not all, respects. For example, as an exempt commodity, forward contracts on Bitcoin between commercial market participants could be excluded from the CEA. A large retailer could enter into Bitcoin forwards with a Bitcoin merchant ( i.e. , a financial institution) — where one party pays a fixed U.S. dollar amount and the other pays in Bitcoin — and be excluded from the CEA. Likewise, if the trade is structured like a typical FX swap (the merchant pays a fixed U.S. dollar amount and the retailer pays a floating Bitcoin amount, for example), arguably the swap would be an excluded forward as long as Bitcoin was physically delivered. \nContinuing its entry into Bitcoin regulation, one week after the Coinflip action, on September 24, 2015, the CFTC again brought and settled charges related to Bitcoin, this time against TeraExchange LLC (Tera), a provisionally registered SEF, for failing to enforce its prohibition on wash trading and prearranged trading. 15 At issue was a U.S. dollar – Bitcoin swap transaction from October 2014 between the only two market participants then authorized to trade on Tera. The CFTC focused on the Tera employees, which facilitated the alleged prearranged wash trade between the only two authorized traders on the Tera SEF. The Tera employees allegedly suggested a transaction would be used to test the SEF systems and would immediately be unwound at the same price and volume. After the transaction was executed, Tera issued a press release that the swap \"was the first Bitcoin derivative transaction to be executed on a regulated exchange\" without disclosing that the Bitcoin swap transaction did not represent actual liquidity. Although the Tera action sends a message to any SEF that the CFTC expects SEFs to enforce SEF rules against illegal trading practices, this CFTC action is yet another signal to the Bitcoin industry that the CFTC is poised to regulate Bitcoin derivatives. 16", "external_links": [], "published": "2015-10-03T01:43:00.000+03:00", "crawled": "2015-10-03T02:09:54.005+03:00", "highlightTitle": ""}