{"organizations": ["REUTERS Dell", "EMC", "Dell"], "uuid": "ee7b0bbebf0e112ac528ec18c6deab92d70ec83a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za/polopoly_fs/iol-pic-oct13-dell-logo-1.1928872!/image/1477864588.jpg_gen/derivatives/box_600/1477864588.jpg", "site_section": "http://www.iol.co.za/cmlink/scitech-technology-rss-1.847487", "section_title": "Scitech Technology RSS", "url": "http://www.iol.co.za/dell-reaches-for-the-clouds-1.1928873", "country": "US", "title": "Dell reaches for the clouds", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "Dell reaches for the clouds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:35:00.000+03:00", "replies_count": 0, "uuid": "ee7b0bbebf0e112ac528ec18c6deab92d70ec83a"}, "author": "", "url": "http://www.iol.co.za/dell-reaches-for-the-clouds-1.1928873", "ord_in_thread": 0, "title": "Dell reaches for the clouds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael Bow Comment", "Carlo Allegri"], "text": "Dell reaches for the clouds October 13 2015 at 07:35am By Michael Bow Comment on this story REUTERS Dell has agreed to buy data storage company EMC in a $67 billion record technology deal that will unite two mature companies and create an enterprise technology powerhouse. File picture: Carlo Allegri \nLondon - The computer firm Dell smashed the tech takeover record yesterday after agreeing to pay $67bn (£44bn) for data centre company EMC Corporation, giving Dell better access to the fast-growing cloud computing sector. \nDell, the PC-maker which was taken private by founder Michael Dell in 2013, will pay $33.15 a share for US-listed EMC, which is best known in the UK for sponsoring rugby club Wasps. The deal surpasses the previous technology takeover record of $49bn paid by eBay for payment processor PayPal in July, according to Dealogic. \nDell will pay $24.05 in cash for each EMC share and $9.10 in new shares issued to investors tracking the share price movement of cloud computing firm VMware, a listed company part-owned by EMC. \n“Our new company will be exceptionally well-positioned for growth in the most strategic areas of next generation IT,” said Mr Dell, who will be chief executive and chairman of the combined company. \nThe takeover will give Dell access to EMC's strong presence in owning and running data centres, most visible to UK residents through its huge EMC data storage tower on the M4 near Brentford. \nDell will finance the deal using high levels of debt and some equity. \nThe company, Mr Dell's family office MSD Partners, private equity backer Silver Lake, and the Singapore state investor Temasek will provide equity up to $50bn of bank debt will be used to finance the takeover. \nDell said the deal would have a “neutral to positive” impact on its credit rating. It promised to focus on cuttings debts over the next two years. \nFears that the deal would be scuppered by Elliott Management, one of EMC's top shareholders, were allayed after the activist investor signalled support for the $33.15 offer, which is 27 percent above EMC's share price on 7 October. \nElliott Management, which won a boardroom tussle in the UK in April at Alliance Trust, took a 2.2 percent minority stake in EMC and agitated for the company to spin off its holding in VMWare and break up the rest of the group. \nJoe Tucci, EMC's chairman and chief executive inserted a clause in the deal in anticipation of a revolt by Elliott which would allow rival bidders to try to top Dell's bid over a 60-day “go shop” period. \nHowever, so far no rival bids have emerged. \nTHE INDEPENDENT", "external_links": [], "published": "2015-10-13T08:35:00.000+03:00", "crawled": "2015-10-13T12:47:24.973+03:00", "highlightTitle": ""}