{"organizations": [], "uuid": "7dd0553e2f289b292eca512b926f4fcc15bb8b5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143830/emaint-named-one-philadelphia-s-100-fastest-growing-companies-fourth-consecutive-year", "country": "US", "title": "eMaint Named One of Philadelphia’s 100 Fastest-Growing Companies for Fourth Consecutive Year", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "eMaint Named One of Philadelphia’s 100 Fastest-Growing Companies for Fourth Consecutive Year", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:16:00.000+03:00", "replies_count": 0, "uuid": "7dd0553e2f289b292eca512b926f4fcc15bb8b5f"}, "author": "admin", "url": "http://www.freshnews.com/news/1143830/emaint-named-one-philadelphia-s-100-fastest-growing-companies-fourth-consecutive-year", "ord_in_thread": 0, "title": "eMaint Named One of Philadelphia’s 100 Fastest-Growing Companies for Fourth Consecutive Year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  eMaint Enterprises, LLC \nMARLTON, N.J. -- (BUSINESS WIRE) -- eMaint Enterprises, the leader in Computerized Maintenance Management software, is thrilled to announce it has been selected for a position on the Philadelphia 100® list of the fastest-growing, privately-held companies in the Philadelphia region for the fourth year in a row. \nThis sought-after award has been the hallmark of entrepreneurial achievement in the region since 1988. Run by the Wharton Small Business Development Center, The Entrepreneurs' Forum of Greater Philadelphia and the Philadelphia Business Journal, the awards identify and honor the 100 fastest-growing, privately held entrepreneurial companies in the Greater Philadelphia Region. \n“Four years in a row on Philadelphia’s 100 fastest-growing companies list is an incredible honor,” said CEO and President Brian Samelson. “It is all thanks to the dedicated eMaint team that this level of sustained success and growth is possible.” \nA combination of new sales growth and a customer renewal rate of greater than 90% resulted in revenue growth of 274% from 2010 to 2014. 2014 also saw our employee base grow by 43% across all departments and office locations. \nThe 2015 Philadelphia 100 rankings were announced at the 27th Annual Awards Ceremony on October 15th, 2015 at the Annenberg Center in Philadelphia. \nAbout eMaint Enterprises, LLC \neMaint is a global software solutions provider established in 1986 with its headquarters based in Estero, Florida and operations centers located in Marlton, New Jersey and Dublin, Ireland. As the leader in Computerized Maintenance Management Software (CMMS), eMaint’s client base consists of over 4,000 companies and 35,000 users in 55 countries. Our portfolio of clients range from small and medium sized organizations to Fortune 500 corporations representing manufacturers, service providers, fleet operators, energy and utility companies, healthcare facilities, universities, municipalities, and facility and property managers. eMaint provides the tools for these organizations to manage their maintenance operations to control costs and increase overall productivity. \neMaint has been recognized by the Inc. 5000 2015 List of Fastest Growing Private Companies in America, the Deloitte Technology Fast 500 list and the 2015 Stevie Customer Service Award. For more information, please visit www.emaint.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20151021006270/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-21T19:16:00.000+03:00", "crawled": "2015-10-21T20:11:57.572+03:00", "highlightTitle": ""}