{"organizations": [], "uuid": "709474a12d352c8da478dd17dd97df3e05ada770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150921180113&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10935859/aeterna-zentaris-announces-amendment-to-series-b-warrants", "country": "US", "title": "Aeterna Zentaris Announces Amendment to Series B Warrants", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "Aeterna Zentaris Announces Amendment to Series B Warrants", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "709474a12d352c8da478dd17dd97df3e05ada770"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10935859/aeterna-zentaris-announces-amendment-to-series-b-warrants", "ord_in_thread": 0, "title": "Aeterna Zentaris Announces Amendment to Series B Warrants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "All amounts are in US dollars\nQUEBEC CITY, Sept. 21, 2015 /CNW Telbec/ - Aeterna Zentaris Inc. (NASDAQ: AEZS)(TSX: AEZ) (the \"Company\") announced today that it has entered into definitive agreements with the holders (the \"Consenting Holders\") of approximately 90% of its outstanding Series B Common Share Purchase Warrants (the \"Series B Warrants\") that are intended to reduce the dilutive effect of the exercise of the Series B Warrants by establishing a cap on the number of shares issuable upon alternate net cashless exercise (\"Net Cashless Exercise\") of the Series B Warrants until the close of business on November 17, 2015 and by limiting the number of shares that the Consenting Holders may sell until the close of business on October 9 , 2015. The Company was advised by Maxim Group LLC (\"Maxim\") in its negotiations with the holders of the Series B Warrants. The effectiveness of the amendments to the Series B Warrants is subject to the approval of the Toronto Stock Exchange.\nDavid A. Dodd , Chairman, President and Chief Executive Officer of the Company remarked regarding the agreements, \"We believe that the agreements we reached with the Consenting Holders should temporarily reduce the selling pressure on our stock by limiting the additional dilution from the Net Cashless Exercise of Series B Warrants. We appreciate the willingness of our Series B Warrant holders to work with us on this important step toward a resolution of the issues confronting our capital structure. We also are grateful to Maxim for helping us to reach agreement with our Series B Warrant holders in an efficient manner.\"\nUnder the terms of the agreements, the number of Common Shares issuable per Series B Warrant with respect to Net Cashless Exercises prior to the close of business on November 17, 2015 may not exceed 33.23 based on a floor on the average volume weighted average prices of $0.0541 . The number of Common Shares issuable per Series B Warrant may be less than such number, however, if the price of the Company's Common Shares recovers during the relevant period. In addition, during a trading-limitation period that expires at the close of business on October 9, 2015 , the Consenting Holders have agreed to limit their market sales of our Common Shares to an aggregate of 100 million shares, which limitation shall not apply to any of the Company's Common Shares sold at or above $0.10 per share.\nAs of September 21, 2015 , approximately 10.8 million Series B Warrants remained outstanding, representing approximately 36% of the number originally issued. In addition, the Company expects that, as of the close business on September 21, 2015 , there will be approximately 363.5 million issued and outstanding Common Shares.\nThe Company will pay Maxim an advisory fee and a success fee for each Series B Warrant that was amended. The Consenting Holders were not compensated and did not receive any other consideration in connection with the amendments to be effected to the Series B Warrants.\nAbout Maxim Group LLC\nMaxim Group LLC is a full-service investment banking firm headquartered in New York. Maxim Group provides a full array of financial services including investment banking; private wealth management; and global institutional equity, fixed-income and derivatives sales and trading as well as equity research. The investment banking group focuses on middle market and emerging growth companies within the healthcare, technology, media, shipping, energy, retail, and business and financial services sectors. The institutional coverage of Maxim Group spans North and South America , Europe and Asia. Maxim Group LLC is a registered as a broker-dealer with the U.S. Securities and Exchange Commission and is a member of the following: Financial Industry Regulatory Authority (FINRA); Municipal Securities Rulemaking Board (MSRB); Securities Insurance Protection Corporation (SIPC); NASDAQ Stock Market and the NYSE Arca, Inc.\nAbout Aeterna Zentaris Inc.\nAeterna Zentaris is a specialty biopharmaceutical company engaged in developing and commercializing novel treatments in oncology, endocrinology and women's health. For more information, visit www.aezsinc.com .\nForward Looking Statements\nThis press release contains forward-looking statements made pursuant to the safe harbor provisions of the US Securities Litigation Reform Act of 1995. Forward-looking statements involve known and unknown risks and uncertainties that could cause actual events to differ materially from those in the forward-looking statements. Such risks and uncertainties include, among others, the effectiveness of the above-described amendment of the Series B Warrants to temporarily reduce the selling pressure on our stock by limiting the additional dilution from the Net Cashless Exercise of Series B Warrants. Investors should consult the Company's quarterly and annual filings with the Canadian and US securities commissions for additional information on risks and uncertainties relating to forward-looking statements. Investors are cautioned not to place undue reliance on these forward-looking statements. The Company does not undertake to update these forward-looking statements. We disclaim any obligation to update any such factors or to publicly announce the result of any revisions to any of the forward-looking statements contained herein to reflect future results, events or developments, unless required to do so by a governmental authority or by applicable law.\nSOURCE Aeterna Zentaris Inc.", "external_links": ["http://www.aezsinc.com/"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-10-11T20:43:34.786+03:00", "highlightTitle": ""}