{"organizations": [], "uuid": "9f1986c982d4b3d437c30acf321519ae0adedf1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/technologysectorNews", "section_title": "Reuters: Technology", "url": "http://www.reuters.com/article/2015/10/19/utv-media-ma-itv-idUSL8N12J13T20151019", "country": "US", "title": "UPDATE 1-Broadcaster ITV buys Northern Irish partner UTV's TV assets", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Broadcaster ITV buys Northern Irish partner UTV's TV assets | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T12:33:00.000+03:00", "replies_count": 0, "uuid": "9f1986c982d4b3d437c30acf321519ae0adedf1d"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/19/utv-media-ma-itv-idUSL8N12J13T20151019", "ord_in_thread": 0, "title": "UPDATE 1-Broadcaster ITV buys Northern Irish partner UTV's TV assets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds shares, analyst reaction)\nLONDON Oct 19 (Reuters) - ITV, Britain's biggest free-to-air commercial broadcaster, has agreed to buy the TV business of Northern Irish network partner UTV for 100 million pounds ($154 million) in cash, it said on Monday.\nThe deal will put 13 of 15 so-called channel 3 licences in the hands of ITV, and the company said the combined business would benefit from ITV's investment in content, its advertising sales team and broadcast infrastructure.\nUTV will retain its radio businesses UTV Radio GB and UTV Radio Ireland, and its digital media businesses, Simply Zesty and Tibus Digital, ITV said.\nShares in UTV rose 4.6 percent to a five-month high of 181.5 pence after the announcement, which has been widely anticipated since UTV said it was in talks in August.\nShares in ITV, whose hit shows include soap opera \"Coronation Street\" and drama \"Downton Abbey\", were down 0.5 percent at 247.6 pence in a flat market.\nAnalysts at Citi said ITV was paying above the average transaction multiples for a broadcast business for UTV, which made a loss of 3.3 million pounds in the first half after it launched a new channel serving the Irish republic.\nThey said cost synergies, however, would make the deal broadly neutral for ITV's earnings per share in the first year.\nAfter the deal, only the two channel 3 licences in Scotland owned by STV will remain outside ITV's control.\nAnalysts at Liberum said they did not think a final deal to unify the network was likely.\n\"We do not think ITV will make a bid for STV due to the political sensitivities of Scotland's main commercial broadcaster being owned by London-based ITV Plc,\" they said.\n($1 = 0.6474 pounds) (Reporting by Paul Sandle ; Editing by Kate Holton and Mark Potter)", "external_links": [], "published": "2015-10-19T12:33:00.000+03:00", "crawled": "2015-10-19T12:12:55.966+03:00", "highlightTitle": ""}