{"organizations": [], "uuid": "646becd2f2271ab363af13cf9281022dd4ba594c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "abcnews.go.com", "main_image": "", "site_section": "http://abcnews.go.com/xmldata/rss?id=79", "section_title": "ABC News: Technology", "url": "http://abcnews.go.com/Technology/wireStory/microsofts-businesses-shine-pc-software-sags-34664306", "country": "US", "title": "Microsoft's New Businesses Shine, but PC Software Still Sags", "performance_score": 1, "site": "go.com", "participants_count": 1, "title_full": "Microsoft's New Businesses Shine, but PC Software Still Sags - ABC News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "646becd2f2271ab363af13cf9281022dd4ba594c"}, "author": "abcNEWS", "url": "http://abcnews.go.com/Technology/wireStory/microsofts-businesses-shine-pc-software-sags-34664306", "ord_in_thread": 0, "title": "Microsoft's New Businesses Shine, but PC Software Still Sags", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Microsoft may still be suffering from lagging sales of personal computers, but the tech giant has taken some cues from rivals like Apple and Google — and it's now seeing substantial growth in more promising lines of business ranging from mobile apps and advertising to online games and cloud computing.\nInvestors drove the company's stock price up more than 8 percent in late trading Thursday, after Microsoft issued an earnings report that showed evidence of that transition.\nOn the downside, key segments of Microsoft's business continued to decline in the quarter ended September. Licensing payments from PC makers were down 6 percent, a fifth straight quarter of decline, a sign that the July launch of Microsoft's Windows 10 operating system failed to spark an immediate revival in sales. And the recent decision to pare back its struggling Nokia division meant Microsoft made less money from selling mobile phones.\nBut the company posted strong performance in several segments that CEO Satya Nadella considers key to the company's future. That included a 70 percent increase in revenue from commercial cloud computing, in which businesses run software stored on Microsoft's servers. Microsoft also reported hefty increases in the number of people paying for the Xbox Live online gaming service and for Office 365, the subscription version of its popular email, document-editing and other \"productivity\" programs.\nMicrosoft said advertising revenue from its Bing search engine grew to more than $1 billion for the quarter, allowing the Bing business to show a profit for the first time. Microsoft has spent billions to develop that business, a rival to Google's dominant search engine.\nAll told, the company said it had $20.4 billion in revenue for the quarter ending Sept. 30, down 12 percent from a year earlier. Net income rose 1.7 percent to $4.6 billion.\nBut that was better than many had feared, said FBR Capital Markets analyst Daniel Ives. Microsoft \"defied the skeptics\" by showing growth in key areas, he added.\nNadella is also continuing to cut expenses. Microsoft quietly laid off about 1,000 workers this week, in addition to about 7,800 jobs that were cut earlier this year. While the earlier cuts fell primarily on the Nokia division, a spokeswoman said the new layoffs \"were spread across more than one business area.\"\nPC makers like Hewlett-Packard and Lenovo are still hoping Windows 10 will boost PC sales this fall, when they'll be offering more new models for sale. But Thursday's report showed Nadella's increasing emphasis on other segments that promise more potential for growth.\n\"I think he is realistic about the role of Windows,\" said Gartner tech analyst David Smith. Instead of counting heavily on Windows licensing fees, Nadella \"is much more focused on cloud computing and other services,\" Smith said. \"That's where the future of the company will be.\"\nRather than charge individual PC owners to upgrade their older versions of Windows, for example, Microsoft has been offering free upgrades to Windows 10 — much the way Apple and Google provide free updates to their operating systems for Macs, iPhones and Android devices.\nMicrosoft hopes to make up the revenue from other sources. Nadella told analysts Thursday that Bing's advertising growth got a boost because Windows 10 lets PC users ask questions of Cortana, Microsoft's voice-enabled digital assistant, which provides answers from Bing.\nAnalysts say Nadella's goal is to build a broad ecosystem of interrelated products, offering some for free — including Microsoft apps for Apple and Android devices — while making money from others.\nBy getting Windows 10 onto more computers, he's also hoping to persuade independent app-makers that there's an audience for apps that work with Windows on PCs, phones, tablets and gaming consoles. That in turn could give consumers more reason to use those devices.\nWindows 10 is now running on 110 million devices, according to Microsoft, although it hasn't said how many are new PCs and how many are older machines whose owners took advantage of the free upgrade. Analysts say that suggests a healthy interest in the new software, although International Data Corp. estimates overall PC sales still dropped 11 percent in the third quarter.\nThursday's results were the first to reflect Microsoft's recent reshuffling of product lines into new reporting segments. Windows revenue is now lumped in the same category with online advertising, Xbox gaming and its remaining phone business.\nThe somewhat cosmetic move \"shows the shrinking importance of Windows as a stand-alone product,\" said Bernstein Research analyst Mark Moerdler.\nTwo other categories consolidate Microsoft's other major revenue sources. One is business software, including the popular \"Office\" programs. The other combines data center software with cloud services, in which companies use software housed on Microsoft's servers.\nThe latter is Microsoft's fastest growing segment, and one where analysts say Microsoft is outshining rivals like IBM and Hewlett Packard. Yesterday, in fact, HP announced it will shut down its public cloud-computing service, a tacit admission of defeat.\n  Microsoft's New Businesses Shine, but PC Software Still Sags \" \n      FDA   \n ", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T06:07:15.179+03:00", "highlightTitle": ""}