{"organizations": [], "uuid": "78f669ba95beb3e6f302f989010d9677f0a73c37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techxplore.com", "main_image": "http://img.techxplore.com/newman/gfx/news/2015/lightintrodu.jpg", "site_section": "http://www.physorg.com/physorg.rss", "section_title": "Phys.org - latest science and technology news stories", "url": "http://techxplore.com/news/2015-10-multi-aperture-camera.html", "country": "US", "title": "Light introduces multi-aperture computational camera", "performance_score": 0, "site": "techxplore.com", "participants_count": 0, "title_full": "Light introduces multi-aperture computational camera", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T12:00:00.000+03:00", "replies_count": 0, "uuid": "78f669ba95beb3e6f302f989010d9677f0a73c37"}, "author": "", "url": "http://techxplore.com/news/2015-10-multi-aperture-camera.html", "ord_in_thread": 0, "title": "Light introduces multi-aperture computational camera", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nancy Owano"], "text": "Light introduces multi-aperture computational camera October 9, 2015 by Nancy Owano weblog \nHold it right there. Say cheese or, more appropriately, wow. The L16 is a small camera that enables professional-quality photos. \nLori Grunin, who covers digital imaging for CNET, reported Wednesday on Light, the company behind the L16. Of one thing she is certain. \"I can say for sure that this will be one of the most interesting cameras to test and shoot with that I've seen in a long while.\" \nThe L16 is a camera which is considered as a first by its owners. It is the \"first multi-aperture computational camera.\" You can take quality images with this device, which is small and light to carry around. \nThe company touts the camera as delivering the highest quality images from the smallest possible device. They said it was like having a camera body, zoom and three fast prime lenses right in your pocket. \n\"We don't think that on day one everybody drops their DSLR and buys one of these, but we think there's a great population of people that will appreciate the size, cost, and weight reduction,\" Light CEO Dave Grannan said in MIT Technology Review . (The article noted also that a high-end DSLR camera and equipment may cost thousands.) \nThe technology used is a combination of \"folded optics\" with computational imaging algorithms. \n\"With 16 individual cameras, ten of them firing simultaneously, the L16 captures the details of your shot at multiple fixed focal lengths,\" said Light. The images are computationally fused to create a final image with up to 52-megapixel resolution. \nWhat does the company mean by \"folded optics?\" Rachel Metz in MIT Technology Review explained how \"each camera module is placed on its side, and light comes in through an aperture, hits a mirror, and then travels down the barrel of the lens to an image sensor. Since the camera modules have different focal lengths, different ones will fire at once depending on how close you want to zoom in on a subject and how the mirrors inside the modules move to grab light.\" \nYou can adjust focus and depth of field even after the shot is taken. \nThe company is now taking pre-orders. The pre-order price is $1299 until November 6. Then it will go up to $1699. They said the camera will ship late summer 2016. \nThe L16 will be dust- and water-resistant. Rob Triggs in Android Authority also mentioned some other features about the L16 which would seem very appealing both to nonprofessional and professional picture takers: The L16 comes with WiFi built in, and photographers in turn can share their images straight from the camera or quickly transfer them over the air to a PC. In response to the question, \"Does the Light L16 Camera shoot video?,\" The company FAQ section answers that the L16 \"will shoot video up to 4K with optical zoom from 35-150mm equivalent focal length .\" 7 shares", "external_links": [], "published": "2015-10-09T12:00:00.000+03:00", "crawled": "2015-10-09T12:16:52.878+03:00", "highlightTitle": ""}