{"organizations": [], "uuid": "a502e8fdcadeedd45380962d12df8cd5b98fee75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "https://photos.prnewswire.com/prnvar/20151020/278782LOGO", "site_section": "http://rss.prnewswire.com/industry/technology/", "section_title": "PR Newswire: Business Technology", "url": "http://www.prnewswire.com/news-releases/schlafender-hase-inc-expands-its-presence-in-the-americas-300163292.html", "country": "IT", "title": "Schlafender Hase Inc. expands its presence in the Americas", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Schlafender Hase Inc. expands its presence in the Americas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T18:04:00.000+03:00", "replies_count": 0, "uuid": "a502e8fdcadeedd45380962d12df8cd5b98fee75"}, "author": "Schlafender Hase", "url": "http://www.prnewswire.com/news-releases/schlafender-hase-inc-expands-its-presence-in-the-americas-300163292.html", "ord_in_thread": 0, "title": "Schlafender Hase Inc. expands its presence in the Americas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Schlafender Hase GmbH, the maker of the Text Verification Tool® (TVT) and the global leader in text verification for regulated environments, are expanding their presence in the Americas by offering more local services such as software installation, validation, training & support by adding new leadership & talent to their growing team.  CAMBRIDGE, Mass. , Oct. 21, 2015 /PRNewswire/ -- Schlafender Hase GmbH, the maker of the Text Verification Tool® (TVT) and the global leader in text verification for regulated environments opened Schlafender Hase Inc. in North America just over a year ago. \"We have been very successful over the last year, and due to customer demand we've decided to offer more local services in the Americas,\" said Frank Hessler , CEO and President of Schlafender Hase. Additional local services now include software installation, validation, on-site training and support. \nSchlafender Hase Inc. has expanded its team to assist with this expansion. Heading up the Americas team as Managing Director, is Peter Muller . Peter is an industry veteran who is an expert on Proofreading technologies and how to apply software tools to solve Regulatory Affairs and Packaging challenges.  \"TVT is the de facto global standard for text verification. Not only is it used by every major pharmaceutical and medical device company, it is used by Regulatory Authorities such as the EMA, BfArM and MHRA to ensure the accuracy and compliance of product packaging submissions,\" said Peter Muller . \"I am thrilled to be working with Schlafender Hase. We know we have the best product on the market but our challenge  is to inform clients that they have a choice of local suppliers in the Americas.''\nSchlafender Hase Inc. will be exhibiting at this year's RAPS Regulatory Convergence in Baltimore on October 24 th – 28 th . The new team will be present and looking forward to meeting with customers. \nTo learn more go to https://www.schlafenderhase.com  or contact the North American office at +1 617 607-4900\nAbout Schlafender Hase: \nSchlafender Hase is the global leader in computer-driven proofreading. Our Text Verification Tool® (TVT) is the international benchmark for accurate and user friendly text and graphic verification. TVT is currently used by the world's leading pharmaceutical and medical device companies as well as numerous regulatory bodies to ensure compliant, error-free and consistent packaging. TVT allows users to compare text and graphics with one solution. It is ISO 9001:2008 certified, 21 CFR Part 11 and Annex 11 compliant. \nContact: Kindrie Eaton, 617-607-4900, marketing@sh-p.com \nLogo - http://photos.prnewswire.com/prnh/20151020/278782LOGO \n\nSOURCE Schlafender Hase\n\n\nRELATED LINKS\nhttp://www.schlafenderhase.com", "external_links": [], "published": "2015-10-21T18:04:00.000+03:00", "crawled": "2015-10-21T18:10:31.706+03:00", "highlightTitle": ""}