{"organizations": ["IDC", "IDC Spending on Mobile Technologies"], "uuid": "fddc67378187e8c56de1df55e0d6ed5b39c8e1f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/05/8255971.htm", "country": "US", "title": "Spending on Mobile Technologies to Reach $1.2 Trillion by 2019, According to IDC", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "Spending on Mobile Technologies to Reach $1.2 Trillion by 2019, According to IDC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:01:00.000+03:00", "replies_count": 0, "uuid": "fddc67378187e8c56de1df55e0d6ed5b39c8e1f2"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/05/8255971.htm", "ord_in_thread": 0, "title": "Spending on Mobile Technologies to Reach $1.2 Trillion by 2019, According to IDC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spending on Mobile Technologies to Reach $1.2 Trillion by 2019, According to IDC [October 05, 2015] Tweet \nOrganizations across industries are increasingly leveraging mobility to transform their businesses. A new International Data Corporation ( IDC ) study, Empowering the Workforce for Business Transformation: Worldwide and U.S. Forecast for Mobility, 2014-2019 (Doc #259191), examines the current status of mobile strategy in the context of different vertical industries. It identifies key industry drivers and barriers to build, implement, and deploy mobile solutions, and presents assumptions of the changes brought by mobility that will shape business and IT strategy in the coming years. In addition, this study provides a vertical forecast for six mobile technologies in both the United States and worldwide. ClicktoTweet : IDC ( News - Alert ) shares areas of greatest growth in worldwide mobility #mobileopportunities \nMobility may have started with the simple concept of shifting employees from being deskbound to being mobile. But it has advanced and evolved in such ways that many organizations are embracing capabilities unique to mobility and unique to their industries. Each vertical is different in terms of its underlying industry drivers, barriers, and potential benefits. \nIndustry-specific applications will be a driving force as businesses look for solutions that can be easily configured to their unique business and vertical requirements. \nKey findings from the new report include: Worldwide, the manufacturing sector represents the largest enterprise opportunity for mobile technologies. The industry's sizeable economic footprint and global operatons create a naturally large market. Consumer-centric industries such as retail, media, and personal and consumer services are leveraging mobility to engage and connect with their customers to improve their experience, bolster loyalty, and generate larger sales per customer. There are still numerous concerns around mobility (and all of the other pillar technologies). Security and regulatory issues remain the biggest barrier for mobile technology adoption across industries such as government and financial services. According to the report, IDC estimates that $901 billion was spent worldwide on mobile technologies in 2014. Wireless data and smartphones comprised the lion's share of this spending. The opportunity is forecast to reach $1.2 trillion by 2019. Excluding consumer spending, the industries expected to spend the most for mobile technologies include discrete and process manufacturing and professional services. Combined, these three segments will represent 17% of the market in 2019. The areas of greatest growth include personal and consumer services, media, and the banking industries. \n\"More than ever, mobile technologies are empowering workers across industries to connect, collaborate, and create new ways to operate and do business,\" said Jessica Goepfert , Program Director of IDC's Global Technology ( News - Alert ) and Industry Research Organization. \"It goes beyond providing a smartphone to liberate the deskbound worker. Instead, it's about utilizing mobile technology to increase sales, improve productivity, and raise customer and employee satisfaction.\" \nThe vertical industries examined in this report include Banking, Insurance, Securities and Investment Services, Discrete Manufacturing, Process Manufacturing, Retail, Wholesale, Professional Services, Personal and Consumer Services, Healthcare Provider, Transportation, Telecommunications, Media, Utilities, Construction, Resource Industries, Central Government, State & Local Government, Education and Consumer. \nFor additional information about this research or to arrange a one-on-one briefing with Jessica Goepfert, please contact Sarah Murray at 781-378-2674 or sarah@attunecommunications.com . Reports are available to qualified members of the media. For information on purchasing reports, contact insights@idc.com ; reporters should email sarah@attunecommunications.com . \nAbout IDC \nInternational Data Corporation (IDC) is the premier global provider of market intelligence, advisory services, and events for the information technology, telecommunications, and consumer technology markets. With more than 1,100 analysts worldwide, IDC offers global, regional, and local expertise on technology and industry opportunities and trends in over 110 countries. IDC's analysis and insight helps IT professionals, business executives, and the investment community to make fact-based technology decisions and to achieve their key business objectives. Founded in 1964, IDC is a subsidiary of IDG , the world's leading technology media, research, and events company. To learn more about IDC, please visit www.idc.com . Follow IDC on Twitter ( News - Alert ) at @IDC . \nAll product and company names may be trademarks or registered trademarks of their respective holders. View source version on businesswire.com: http://www.businesswire.com/news/home/20151005005042/en/", "external_links": [], "published": "2015-10-05T16:01:00.000+03:00", "crawled": "2015-10-05T20:35:47.594+03:00", "highlightTitle": ""}