{"organizations": [], "uuid": "2c6249f11356893783ff5751f9dfa42309503910", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fcw.com", "main_image": "", "site_section": "http://fcw.com/rss-feeds/all.aspx", "section_title": "FCW: The business of federal technology", "url": "https://fcw.com/articles/2015/10/22/car-cyber-congress.aspx", "country": "US", "title": "Could proposed legislation make cars MORE susceptible to hackers?", "performance_score": 0, "site": "fcw.com", "participants_count": 0, "title_full": "Could proposed legislation make cars MORE susceptible to hackers?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:19:00.000+03:00", "replies_count": 0, "uuid": "2c6249f11356893783ff5751f9dfa42309503910"}, "author": "", "url": "https://fcw.com/articles/2015/10/22/car-cyber-congress.aspx", "ord_in_thread": 0, "title": "Could proposed legislation make cars MORE susceptible to hackers?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Aleida Fernandez"], "text": "Could proposed legislation make cars MORE susceptible to hackers? By Aleida Fernandez Oct 22, 2015 \nHouse Republicans are looking to protect cars against hackers. But federal regulators told lawmakers at an Oct. 21 hearing that the bill might not work the way it is supposed to. \n\"The proposed legislation, as drafted, could substantially weaken the security and privacy protections that consumers have today,\" said Maneesha Mithal, head of the Federal Trade Commission's Division of Privacy and Identity Protection at the hearing of the Commerce, Manufacturing and Trade Subcommittee of the House Energy and Commerce Committee. \nThe draft bill -- which comes in the wake of news reports that showed how cyber adversaries can take over command and control of some automotive operating systems -- aims to improve vehicle security and provide more consumer autonomy over their personal information. The bill directs the National Highway Traffic Security Administration to form an advisory council to create and draft cybersecurity standards within the auto industry. Under the legislation, a $100,000 fine would be imposed on anyone who accesses a car's electronic system \"without authorization,\" and car companies would be required to create and file privacy policies with the Transportation Department. \nAt the hearing, federal regulators warned that the bill would actually have the opposite of its intended effect. Mithal argued that under the proposed legislation, companies with privacy policies meeting the minimum requirements would be immune from FTC privacy laws. She also cautioned against the section authorizing fines for car hackers, saying that it could punish researchers testing for security flaws. \n\"By prohibiting such access, even for research purposes, this provision would likely [discourage] such research, to the detriment of consumers' privacy, security, and safety,\" Mithal said. \nNHSTA Administrator Mark Rosekind, meanwhile, expressed concern that the bill would allow industry lobbyists to sway cybersecurity standards advisory council. \n\"The public expects NHTSA, not industry, to set safety standards,\" Rosekind said. \nWhile Republicans defended their legislation, they acknowledged it still needed work. \n\"The staff discussion that we will review today is a starting point\" said Energy and Commerce Committee Chairman and Fred Upton (R-Mich.) \"[Some] ideas, like how to best ensure cybersecurity, may need to further evolve.\" About the Author \nAleida Fernandez is an FCW editorial fellow. <>", "external_links": [], "published": "2015-10-23T00:19:00.000+03:00", "crawled": "2015-10-25T16:23:32.191+02:00", "highlightTitle": ""}