{"organizations": [], "uuid": "dab28af8a65db753f1a718970ee705f4f58d2d23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/technologysectorNews", "section_title": "Reuters: Technology", "url": "http://www.reuters.com/article/2015/10/14/volkswagen-emissions-bosch-idUSL8N12E28T20151014", "country": "US", "title": "Bosch sees diesel market so far unharmed by VW scandal", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Bosch sees diesel market so far unharmed by VW scandal | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T15:58:00.000+03:00", "replies_count": 0, "uuid": "dab28af8a65db753f1a718970ee705f4f58d2d23"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/14/volkswagen-emissions-bosch-idUSL8N12E28T20151014", "ord_in_thread": 0, "title": "Bosch sees diesel market so far unharmed by VW scandal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RENNINGEN, Germany Oct 14 German automotive supplier Robert Bosch has not seen any change so far in the diesel car market as a result of an emissions scandal that has rocked Volkswagen, its chief executive said on Wednesday.\n\"It will depend, though, on an active campaign for diesel to quickly dispel the current uncertainty that many consumers are feeling,\" Volkmar Denner told reporters at the opening of a new research centre in the German town of Renningen near Stuttgart.\nGerman Economy Minister Sigmar Gabriel warned against condemning diesel technology overall but said Germany needed to do better in switching to alternative engines.\nHe said he favoured introducing incentives to reduce the price difference between electric and conventional cars.\nVolkswagen, Europe's largest carmaker, last month admitted to cheating U.S. diesel emissions tests, sparking a crisis that unseated its CEO and wiped around a quarter off its market value.\nBosch is the maker of a popular diesel engine management programme used by several top automakers including VW, which U.S. officials said last week was not preprogrammed to detect when a vehicle was undergoing laboratory emissions testing.\nBut it is not clear what role Bosch played, how closely it worked with VW to modify the engine management software and how much it knew about VW's intentions to use software to cheat on emissions standards.\nDenner declined to comment on the matter.\nHe added that VW had not started talks to demand lower prices, following a media report that VW planned to extract 3 billion euros in price cuts from its suppliers to help mitigate the costs of the scandal.\n(Reporting by Ilona Wissenbach ; Writing by Georgina Prodhan ; Editing by Louise Heavens)", "external_links": [], "published": "2015-10-14T15:58:00.000+03:00", "crawled": "2015-10-14T16:21:42.260+03:00", "highlightTitle": ""}