{"organizations": [], "uuid": "eca85e3ac1de43b24ac5e651ce0528a01bea318f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.npr.org", "main_image": "http://media.npr.org/assets/img/2015/09/14/robo-tutor_wide-9360db9d5fd121be6efef49b6c66fc36ae9cd9ac.jpg?s=1400", "site_section": "http://www.npr.org/rss/rss.php?id=1019", "section_title": "Technology : NPR", "url": "http://www.npr.org/sections/ed/2015/10/13/437265231/meet-the-mind-reading-robo-tutor-in-the-sky", "country": "US", "title": "Meet The Mind-Reading Robo Tutor In The Sky", "performance_score": 3, "site": "npr.org", "participants_count": 1, "title_full": "Meet The Mind-Reading Robo Tutor In The Sky", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T12:14:00.000+03:00", "replies_count": 0, "uuid": "eca85e3ac1de43b24ac5e651ce0528a01bea318f"}, "author": "Eric Westervelt", "url": "http://www.npr.org/sections/ed/2015/10/13/437265231/meet-the-mind-reading-robo-tutor-in-the-sky", "ord_in_thread": 0, "title": "Meet The Mind-Reading Robo Tutor In The Sky", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Meet The Mind-Reading Robo Tutor In The Sky October 13, 2015 5:14 AM ET LA Johnson/NPR \nOur Ideas series is exploring innovation in education. \nSome version of this criticism has likely echoed since the rise of compulsory schooling during the Progressive era: Teachers tend to teach to the middle, leaving struggling students feeling lost and more advanced students bored. \nEveryone too often gets the same books, material, homework. The same level of difficulty. \nAnd underpaid, time-stressed teachers don't necessarily have the time to personalize every lesson or drill deep into what each child is struggling with. \nEnter the omniscient, cloud-based robo tutor. \n\"We think of it like a robot tutor in the sky that can semi-read your mind and figure out what your strengths and weaknesses are, down to the percentile,\" says Jose Ferreira, the founder and CEO of ed-tech company Knewton . \nThe company believes its new, free online tutoring platform will radically transform how teachers personalize instruction. \nKnewton claims to offer automated, digital tutoring that responds to each student's needs. \n\"We can take the combined data power of millions of students — all the people who are just like you — [who] had to learn a particular concept before, that you have to learn today — to find the best pieces of content, proven most effective for people just like you, and give that to you every single time,\" he says. \nHere's how it works: the platform presents video and a variety of written content and then asks multiple-choice questions. Based on student responses, and patterns of responses from other similar students, the next piece of content is served up. \nKnewton currently offers programs in math, biology and English language arts , mostly for middle and high school grades. The company plans to expand soon with history and other curricula. \nIn a San Francisco office, Ferreira gives me a demo, starting with some math problems he's getting wrong on purpose. \"So now it's already gone on to easier material,\" he explains. \nKnewton probes to see what you are good at and where you're stumbling. It will also pull up related content — say, a biology video that uses a math challenge. If you continue to struggle with answers, Knewton might prompt you on how well you know foundational concepts that could be hindering progress. \n\"It will say, 'The problem wasn't difficulty, because we gave him easy questions on that topic. The problem must be some sub-concept he's struggling with. Let's identify the sub-concepts and quickly test him on those,'\" Ferreira explains. \nAnd if a student user is at risk of doing poorly in an upcoming algebra exam, the robo tutor will know \"in advance that will happen and get you ready by giving you a little extra homework targeted for you,\" he says. \"We can fill gaps algorithmically in your conceptual mastery. We can predict problems in advance.\" \nMaybe. \nIs Knewton really any different from other over-hyped \"adaptive learning\" platforms that have struggled mightily to become a pedagogic staple? News Corp.'s much-ballyhooed ed-tech company Amplify is losing money and was sold last month . One of the problems Amplify ran into was that some schools it worked with simply didn't have the Internet bandwidth to successfully run its programs. \nKnewton has already monetized its platform via licensing agreements with large education companies, including Houghton Mifflin Harcourt, and the world's biggest education company, Pearson . \nResults have been mixed , including challenges scaling and implementing adaptive learning programs across large institutions. \nDespite the challenges, who wouldn't want a free, quasi-mind-reading robo tutor? Knewton's new version is now free and available to any teacher around the world who wants to upload his or her own education content. \nI'm game to try it, as long as the robot doesn't go Terminator dystopian SkyNet self-aware on us. \nActually, Ferreira says Knewton's strength is that it will grow more powerful, accurate and valuable business-wise over time. \n\"We're the first to build a web-based system that can calibrate content,\" he explains. \"Anytime anybody adds content, then that content in a few days becomes itself calibrated and we can make that adaptive.\" \nSorry. I should have warned you. Ferreira sometimes drifts into annoying ed-tech jargon. Don't worry, the NPR Ed team speaks some Silicon Valley. Our Anya Kamenetz helps translate: \n\"The more students view and use Knewton's education tools online and answer questions about it, the more the platform learns about the right speed and sequencing to serve that content up,\" Kamenetz says. \"It's kind of like how Facebook is a platform that decides what to put in your news feed based on what you and others are liking and sharing. So by building this free tool, they're essentially hoping to attract even more content and even more users, which in turn will make their platform more powerful and more valuable.\" \nAn automated mashup of Wikipedia and Facebook for learning. \nBut wait. Learning is a lot more complicated than algorithmic reading of multiple-choice responses. What about a student's level of motivation or persistence or, say, the empathy, passion and insight of a good teacher or dozens of other factors? \n\"He is overselling the kind of power that Knewton can do,\" says Michael Feldstein, a digital education consultant and co-founder of the ed blog e-literate. \"I would go so far as to say that he is selling snake oil.\" \nClaims about the wonders of tech to revolutionize learning, Feldstein argues, vastly oversimplify the complexity, beauty and mystery of how humans learn. He notes there's a lot going on between teacher and student – some of which we don't really fully understand – during the dance of face-to-face learning. \n\"Comments, context, facial gestures, eye contact and so on. There is a lot of bandwidth there,\" Feldstein says. \"Knewton really has a very narrow bandwidth in terms of what they can observe about the student relative to what a human teacher can observe.\" \nFeldstein is not saying tech tools like Knewton's can't be incredibly helpful. \"But we have no reason to believe that it (Knewton) is capable of achieving anything like this magic robot in the sky that he's selling, or as he put recently in Wired magazine, a 'magic pill.'\" \nFerreira says he's merely trying to complement and support teachers, not replace them. A hundred-plus years ago, he notes, hospital operating rooms didn't have much technology. Now there's tons. That technology \"didn't replace doctors or medical personnel,\" he says. Teachers who are used to staying up until midnight crafting lessons, he asserts, can now \"press a few buttons and say, 'OK, Knewton, show me all content in the world ranked by data that's the best to add to my content plan.'\" \nEven critics of so-called \"adaptive learning\" platforms concede they have the potential to change the economics of tutoring — that they may help create a place where disadvantaged kids around the globe can get a more personalized learning coach. \nRight now it seems like adaptive learning tools exist in a kind of iterative place somewhere between snake oil and revolution. They are incredibly promising though, as yet, not fully realized tools.", "external_links": [], "published": "2015-10-13T12:14:00.000+03:00", "crawled": "2015-10-13T12:22:34.563+03:00", "highlightTitle": ""}