{"organizations": [], "uuid": "5d6534fdb6166025a5db0873137acc757ef676cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/d/9/o/e/image.related.StuffLandscapeSixteenByNine.620x349.17d9jb.png/1444290664664.jpg", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNE2GSUmi2RjC-tkBuXzOdo-ZNdOtA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778966510001&ei=fTwWVqDgFIudar-wooAO&url=http://www.stuff.co.nz/entertainment/72842375/audio-technology-to-premiere-in-nz-film", "country": "IL", "title": "Audio technology to premiere in NZ film - Stuff.co.nz", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Audio technology to premiere in NZ film - Stuff.co.nz", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T10:44:00.000+03:00", "replies_count": 0, "uuid": "5d6534fdb6166025a5db0873137acc757ef676cf"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNE2GSUmi2RjC-tkBuXzOdo-ZNdOtA&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778966510001&ei=fTwWVqDgFIudar-wooAO&url=http://www.stuff.co.nz/entertainment/72842375/audio-technology-to-premiere-in-nz-film", "ord_in_thread": 0, "title": "Audio technology to premiere in NZ film - Stuff.co.nz", "locations": ["NZ"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["HANNAH MCKEE"], "text": "Audio technology to premiere in NZ film HANNAH MCKEE Last updated 20:51, October 8 2015 ROBERT KITCHIN/FAIRFAX NZ \nCinema goers have been given a sneak sound preview at the Embassy Theatre in Wellington that enhances the experience in scary movies. \nWellington volunteers have been playing guinea pig to a type of sound technology never used in cinema before. \nThe Embassy has been doubling as a pseudo-lab this week to test the effects of Rumble, a type of audio technology designed to heighten fear and anxiety. \nThe technology is set to premiere with the new Kiwi horror film The Dead Room, in cinemas on October 29. SUPPLIED \nThe Dead Room uses Rumble audio technology, aimed to give an extra sense of dread. \nOver 250 volunteers sat through six-minute Rumble sample sessions, many of whom had their heart-rate tested before and after the screening and received basic psychology testing. \nCalifornia-based Rumble was initially developed for use in theme-park rides. \nCreators soon discovered its potential for cinema, with the industry's increasing demands for technical innovation and audience experience. \nThe audio technology is designed to hit the bass frequencies of most cinema's sub effects speakers, creating a physical reaction similar to dread, or that feeling you might get when you think you have left the oven on. \nWhile the company said medical professionals have deemed the technology safe with limited exposure, viewers reported an increased sense of unease and heart rate after test sessions. \nVolunteer Connor Kennedy said the test session made him feel uneasy. \n\"Short of breath as well and it just felt a little bit off.\" Ad Feedback \nPearl Leonard said her heartbeat increased 12 beats per minute after the preview. \n\"It made me a lot more focused on the film. I was entranced by the film a lot more.\" \nThe Dead Room director Jason Stutter said he had considered using 3D technology film but was excited at the prospect of using something New Zealand audiences had never seen before. \n\"It heightens the 'scare factor',\" he said. \n\"I'm hooked on any technology that makes the experience of seeing a movie in the cinema immersive.\" \nThe Dead Room is about a haunted house in Central Otago, starring Jed Brophy ( The Hobbit ), Laura Petersen ( Shopping ) and Jeffrey Thomas ( Lord of the Rings ).", "external_links": [], "published": "2015-10-08T10:44:00.000+03:00", "crawled": "2015-10-08T12:51:06.842+03:00", "highlightTitle": ""}