{"organizations": ["National University of Singapore"], "uuid": "913b1a2438767d97fad35a67318cbbf62261a121", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eurekalert.org", "main_image": "http://media.eurekalert.org/multimedia_prod/pub/web/100465_web.jpg", "site_section": "http://www.eurekalert.org/rss/technology_engineering.xml", "section_title": "EurekAlert! - Technology, Engineering and Computer Science", "url": "http://www.eurekalert.org/pub_releases/2015-10/nuos-nmw100215.php", "country": "US", "title": "NUS making waves in the brave new world of synthetic biology", "performance_score": 0, "site": "eurekalert.org", "participants_count": 0, "title_full": "NUS making waves in the brave new world of synthetic biology", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T07:00:00.000+03:00", "replies_count": 0, "uuid": "913b1a2438767d97fad35a67318cbbf62261a121"}, "author": "", "url": "http://www.eurekalert.org/pub_releases/2015-10/nuos-nmw100215.php", "ord_in_thread": 0, "title": "NUS making waves in the brave new world of synthetic biology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2-Oct-2015 NUS making waves in the brave new world of synthetic biology New S$25 million multi-disciplinary research programme aims to develop smart biological systems for clinical and industrial applications, as well as train next-generation synthetic biologists National University of Singapore \nIMAGE: The new NUS Synthetic Biology for Clinical and Technological Innovation (SynCTI) programme, helmed by Associate Professor Matthew Chang (left) as the Programme Leader, is a multi-disciplinary research programme that aims... view more Credit: National University of Singapore \nThe National University of Singapore (NUS) launched a new research initiative called the NUS Synthetic Biology for Clinical and Technological Innovation (SynCTI) to further develop research capacity and capabilities in the emerging and fast-growing field, which has the potential to be the next engine for economic growth for technologically advanced countries, including Singapore. \nSynthetic biology is an interdisciplinary branch of biology, combining disciplines such as biotechnology, evolutionary biology, molecular biology, systems biology, biophysics, computer engineering, and genetic engineering. It involves the creation of complex, biologically based or inspired systems, which display functions that do not exist in nature. Potential applications of synthetic biology include biosensing, therapeutics, and the production of biofuels, pharmaceuticals and novel biomaterials. \nThe global market for synthetic biology is estimated to be more than US$10 billion by 2016. Over the last two years, the Singapore National Research Foundation and Economic Development Board have made concerted efforts to create a conducive environment for synthetic biology to take root and grow in the country by developing local talent in foundational disciplines such as biochemical, metabolic, microbial and genome engineering as well as molecular, structural and systems biology. \nProfessor Barry Halliwell, internationally acclaimed biochemist and Senior Advisor to NUS President, who launched the NUS SynCTI initiative, said, \"Synthetic biology is one of the most promising fields of modern science with far reaching applications, many of which are still undiscovered and unexplored. NUS' strong leadership in translational research stands us in good stead to contribute towards developing Singapore as one of the leading synthetic biology hubs in the world.\" \nNUS SynCTI will be helmed by Associate Professor Matthew Chang, who is a faculty member from the Department of Biochemistry at the NUS Yong Loo Lin School of Medicine. Assoc Prof Chang has been working in the field of synthetic biology for the past 10 years, and has since developed a pioneering approach of reprogramming cells for clinical and industrial applications. His landmark discoveries have been widely cited by synthetic biology communities around the world. \nCutting-edge research and facilities \nEstablished with a total funding of about S$25 million, SynCTI is a multi-disciplinary programme comprising more than 60 research staff from the University's Faculty of Engineering, Faculty of Science and Yong Loo Lin School of Medicine. SynCTI's work is supported by seven laboratories boasting state-of-the-art equipment, including advanced facilities for Singapore's only Synthetic Biology Foundry, where biological systems are designed and produced for translational research. \nThe research activities of SynCTI are organised under six themes, namely: \nYeast Genome Project: SynCTI is part of an international consortium to synthesise and construct a modified version of the baker's yeast that has new functions and capabilities, paving the way for future breakthroughs, including the making of designer bread and wine. Microbial Cell Factories: Microbial hosts are designed to produce biochemicals, fuels, nutraceuticals and pharmaceutical ingredients from inexpensive renewable raw materials. Therapeutic Cells: SynCTI engineers designer probiotics with prophylactic and therapeutic properties to combat human infectious diseases, immune and metabolic disorders. Bio-Lixiviant Engineering: Microbes are repurposed for the recovery of precious metals, such as gold, from electronic waste, which is a significant and growing problem confronting our society. Mammalian Synthetic Biology: Designer mammalian cells are used in the discovery and production of new medicines. Cell-free & Whole-cell Biosensors: Biosensors are developed for the detection of disease-causing human pathogens, environmental pollutants, heavy metals, and even metabolites from cell factories for applications for the betterment of human civilisations. \nSynCTI hopes to train 30 post-graduate and undergraduate students each year and, more than 90 synthetic biologists over the next three years. \nStrong collaboration with leading research groups around the world \nScientists at SynCTI work closely with world-class research groups to augment research efforts and capabilities. For instance, SynCTI has a strong connection with other leading synthetic biology foundries in the world, including University of California, Berkeley, Lawrence Berkeley National Laboratory, Imperial College London, and University of Edinburgh. \nIn line with its emphasis on international research collaboration, SynCTI hosts two joint global synthetic biology laboratories - with the University of California, Berkeley, headed by Professor Jay Keasling, who is one of the foremost authorities in synthetic biology; and with Imperial College London, led by Professor Paul Freemont, a renowned scientist in the field of structural biology and synthetic biology. SynCTI has also established two partnerships with Singer Instruments and BD Biosciences to co-develop next generation platforms of synthetic biology applications. \nAssoc Prof Chang said, \"The launch of SynCTI marks a significant milestone in the growth and development of synthetic biology as a promising field in Singapore's research landscape. By deepening our SynCTI's core capabilities and leveraging on the strengths of our international research and industry partners, our long-term goal is to develop a world-class research programme in synthetic biology that generates novel solutions to address grand challenges in society, ranging from diagnostics and therapeutics, to environmental remediation, energy production, and other biomolecular and chemical manufacturing outputs.\" ### \nDisclaimer: AAAS and EurekAlert! are not responsible for the accuracy of news releases posted to EurekAlert! by contributing institutions or for the use of any information through the EurekAlert system.", "external_links": [], "published": "2015-10-02T07:00:00.000+03:00", "crawled": "2015-10-02T18:09:13.204+03:00", "highlightTitle": ""}