{"organizations": [], "uuid": "d075af1210080a60614dd453a8f1aeac7f2a806d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144675/excellence-mobility-awards-presented-enterprise-mobility-forum", "country": "US", "title": "Excellence in Mobility Awards Presented at Enterprise Mobility Forum", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Excellence in Mobility Awards Presented at Enterprise Mobility Forum", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T01:11:00.000+03:00", "replies_count": 0, "uuid": "d075af1210080a60614dd453a8f1aeac7f2a806d"}, "author": "admin", "url": "http://www.freshnews.com/news/1144675/excellence-mobility-awards-presented-enterprise-mobility-forum", "ord_in_thread": 0, "title": "Excellence in Mobility Awards Presented at Enterprise Mobility Forum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/22/2015 @ 3:11 PM Companies mentioned in this article: Boardroom Events \nAUSTIN, Texas, Oct. 22, 2015 /PRNewswire/ -- Boardroom Events announced today the winners of the Enterprise Mobility Innovation Awards, presented at Enterprise Mobility Forum, held this week in Austin. \nVoting is done onsite by mobility executives from some of the world's leading organizations to recognize the mobility vendors who exhibited exceptional capabilities to solve both technology and business challenges. The winners captured honors in the following categories: -- Best Mobile Strategy-- SkyGiraffe; with runners-up including Capriza, Good Technology, and Lookout, Inc. -- Most Innovative Solution-- Umajin; with runners-up Red Hat Mobile and Teligistics \nAWARD OF EXCELLENCE IN MOBILITY LEADERSHIP A special award for best collaboration between an attendee and a vendor went to Scott Franzel, Senior VP, IT of OFS Brands for his work with Information Builders. \nThis award is designed to recognize the collaboration between a Mobility Leader and a vendor that resulted in exceptional results for their company. This award goes to a person who needed to empower their field employees and sales team with data and information But the company also needed to unburden its 25-member IT department to address other business needs. The company chose to enhance its sales reporting processes through mobile business intelligence and analytics. That solution was Information Builder's WebFOCUS platform; and the Mobility Leader is Scott Franzel, Senior VP, IT of OFS Brands. \n\"The Enterprise Mobility Forum brings together the most forward-thinking vendors and mobility leaders in a format designed to foster insights and inspire collaboration,\" said Charles Badoian, President of Boardroom Events. \"The awards showcase the technologies, services that serve the mobility market best. We're happy to see so much support given to these outstanding winners and nominees.\" \nThe Enterprise Mobility Forum is an engaging, informative, and interactive venue where solution providers with technologies designed for the enterprise meet directly with decision makers in boardrooms, one-to-one meetings, and networking events. Leading industry analysts conduct leadership workshops and meet directly with executive and vendor participants. This unique format enables the select group of C-level decision-makers to quickly identify relevant technologies, immediately engage in peer-to-peer best practice discussions, and hear about current trends and topics from leading market analysts. \nAbout Boardroom Events Boardroom Events produces best-in-class business development and networking experiences for leaders in the technology industry. Our team pioneered the concept of hosted boardroom meetings that create productive, engaging, and valuable experiences, and the Forums we produce today are an extension of that original model, refined over years of experience. These Forums attract thought leaders from all aspects of the market: IT executives, solution providers, and industry analysts. For more information, visit us on the Web , or follow us on LinkedIn , Vimeo , and Flickr . \nContact: Amy Abbott (786) 361-0454 x120 abbott@boardroomevents.com \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/excellence-in-mobility-awards-presented-at-enterprise-mobility-forum-300165184.html \nSOURCE Boardroom Events", "external_links": [], "published": "2015-10-23T01:11:00.000+03:00", "crawled": "2015-10-23T02:38:49.695+03:00", "highlightTitle": ""}