{"organizations": [], "uuid": "485cf8b7dc8e10b1f4a92251bc67d5a6b53573e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "https://www.porttechnology.org/images/made/images/uploads/wygwam/151014_APM_Terminals_Moin_Costa_Rica_future_port_image_(2)_360_167.jpg", "site_section": "http://feeds.feedburner.com/PortTechnologyInternational-News", "section_title": "Port Technology International - News", "url": "https://www.porttechnology.org/news/apmt_to_construct_costa_rican_terminal/?utm_source=Feeds&utm_campaign=News&utm_medium=rss", "country": "GB", "title": "APMT to Construct Costa Rican Terminal", "performance_score": 0, "site": "porttechnology.org", "participants_count": 1, "title_full": "APMT to Construct Costa Rican Terminal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "05d07fe4825fc704ebed105145a77a808505222d"}, "author": "porttechnology.org", "url": "https://www.porttechnology.org/news/apmt_to_construct_costa_rican_terminal/", "ord_in_thread": 0, "title": "APMT to Construct Costa Rican Terminal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "APM Terminals Moin has announced a number of port project updates enabling Costa Rica’s future economic growth needs through a safe, world-class, high-productivity and environmentally-sustainable container terminal designed to serve the larger vessels entering the Latin American trades, in particular the temperature controlled containers through which fresh fruit is now being transported to North America and Europe.  Costa Rica is currently the world’s largest exporter of pineapples, and the third-largest exporter of bananas; sugar, coffee and beef are also major export products.\nCosta Rica’s exports totalled US$11.75 billion in 2014, with the US its largest export market, the destination of nearly 40% of all Costa Rican exports.\nIn the first six months of 2015, Costa Rica shipped over a billion tonnes of pineapples, 473,000 tons of which were destined for the USA.\nCosta Rica’s exports account for 40% of the Central American nation’s GDP.\nRead: APMT Swoops in Billion Dollar Terminal Acquisition \nMuch of Costa Rica’s exports of agricultural and meat products are temperature controlled; and are increasingly moving in refrigerated containers (reefers) as opposed to being transported by dedicated refrigerated vessels.\nGlobal containerised reefer volume increased by 4.9% in 2014.\nAdvances in reefer container operations enable not only temperature control, but also the mix of oxygen, carbon dioxide and nitrogen within the container to slow the ripening process and keep fruit fresh. \nReefer containers are able to reduce costs by reducing spoilage and by taking advantage of faster and more efficient intermodal movements. \nCosta Rica’s Port of Limón-Moin, ranked thirteenth in Latin America, and fourth in Central America had a container volume of 1.09 million TEU in 2014.\nOver the next 15 years, reefer container shipments from Costa Rica are projected to double from an estimated 300,000 TEU to 600,000 TEU.\n\nPineapples and bananas alone account for a combined 13% of all Costa Rican exports. APM Terminals Moin will allocate 60-70% of the terminal to refrigerated storage capacity to accommodate this expected growth, employing state-of-the-art technology.   \nAPM Terminals Moin recently concluded a contract for the delivery of six electric-powered STS cranes and 29 electric-powered rubber tyre gantry cranes (eRTGs) which will make the 1.3 million TEU, deep-water container terminal one of the most advanced in Latin America upon completion of Phase One in 2018. \nDredging of the access channel is underway and the turning‐basin is also to be deepened (to 16 metres).\nOther construction projects include the construction of a new 1.5 kilometre breakwater with a 40 hectare container yard, 600 metres of quay and 2 berths equipped with 6 post‐Panamax cranes.\n Upon the completion of the project’s final phase, the facility will cover an area of 80 hectares, with 1,500 metres of quay, 5 berths, a 2.2km breakwater and an access channel 18 metres deep, serving as a shipping hub for the Caribbean and Central America.\nThe opening of the expanded Panama Canal in 2016 will essentially triple the size of container vessels able to transit the canal (to allow vessels up to 12,500 TEU), which current facilities at the Port of Limon are unable to handle.\nThe current port, with a draft of 9 metres, is limited to vessels of 2,500 TEU capacity.\nNewer vessels on order for the Latin American trades include five 10,500 TEU vessels for German-based Hapag-Lloyd, each equipped to carry 2,100 reefer containers (or 4,200 TEU). \nKenneth Waugh, Managing Director of APM Terminals Costa Rica, said: “The future of temperature-controlled shipments is containers, and the larger containerships dedicated space to reefer cargoes.\n“The advanced technology of APM Terminals Moin next-generation cranes will improve safety as well as efficiency, with improved environmental performance essential to handling these ships and attracting more business for Costa Rica in the port, and across the country.”\n\nAn artist's impression of the new terminal. Source: APMT For more news on APMT, click here", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T21:23:33.098+03:00", "highlightTitle": ""}