{"organizations": [], "uuid": "00b984d01a0042e1f4e2e6565feb8cd271efdf24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techcircle.vccircle.com", "main_image": "", "site_section": "http://techcircle.vccircle.com/feed", "section_title": "Techcircle.in - India startups, internet, mobile, e-commerce, software, online businesses, technology, venture capital, angel, seed funding", "url": "http://techcircle.vccircle.com/2015/10/05/voylla-raises-15m-from-peepul-capital/", "country": "US", "title": "Voylla raises $15M from Peepul Capital", "performance_score": 0, "site": "vccircle.com", "participants_count": 1, "title_full": "Voylla raises $15M from Peepul Capital", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T10:57:00.000+03:00", "replies_count": 0, "uuid": "00b984d01a0042e1f4e2e6565feb8cd271efdf24"}, "author": "Anuradha Verma", "url": "http://techcircle.vccircle.com/2015/10/05/voylla-raises-15m-from-peepul-capital/", "ord_in_thread": 0, "title": "Voylla raises $15M from Peepul Capital", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home > Internet > Voylla raises $15M from Peepul Capital Voylla raises $15M from Peepul Capital \nVoylla works with more than 30 online marketplaces \nVoylla.com has secured $15 million (about Rs 100 crore) in fresh funding from private equity firm Peepul Capital, as the fashion jewellery and accessories e-tailer looks to expand its network of offline stores. \nThe company, run by Bangalore-based Voylla Retail Pvt Ltd, said in a press release it is looking to increase the number of physical stores to 100. This would include 40 exclusive stores while the remaining would be shop-in-shop stores and franchise outlets in popular shopping locations and malls. \nThe e-tailer currently has three shop-in-shop stores in partnership with Future Group’s Central Mall. \nVoylla co-founder Vishwas Shringi said that even in the US, not more than 30 per cent of the jewellery retail business is online and that the company would not reach more than 15 per cent of the market in India in next five years if it focused only on an online model. “The large part of it is still going to be offline and it makes complete sense to go offline and capture a large piece of the offline market,” he said. \nVoylla said it will also use the funds to boost manufacturing capacity, improve technology and for brand building. \nThe company had, in 2013, raised Rs 2.5 crore in funding from Pune-based Snow Leopard Technology Ventures. In 2012, it had secured about Rs 1 crore in angel funding from unnamed investors. \nIn the jewellery retail segment, Mumbai-based Pipa Bella Accessories Pvt Ltd, the company behind private label non-precious jewellery e-tailer Pipa + Bella, secured $600,000 (Rs 3.8 crore) in a pre-Series A funding round led by Singapore-based LionRock Capital in July this year. \nAs part of the latest deal, Peepul Capital’s investment director Surya Mantha will join the board of Voylla.", "external_links": [], "published": "2015-10-05T10:57:00.000+03:00", "crawled": "2015-10-05T11:35:48.502+03:00", "highlightTitle": ""}