{"organizations": [], "uuid": "d0ba845ba91c99f3939cbbdb3cfddff3fd0082f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30157817/dns-made-easy-praised-for-exceptional-customer-experience-in-new-survey", "country": "US", "title": "DNS Made Easy Praised for Exceptional Customer Experience in New Survey", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "DNS Made Easy Praised for Exceptional Customer Experience in New Survey - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T06:01:00.000+03:00", "replies_count": 0, "uuid": "d0ba845ba91c99f3939cbbdb3cfddff3fd0082f6"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30157817/dns-made-easy-praised-for-exceptional-customer-experience-in-new-survey", "ord_in_thread": 0, "title": "DNS Made Easy Praised for Exceptional Customer Experience in New Survey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After collecting responses from current and previous customers for over 3 years, DNS Made Easy has launched a new study that explores customer experiences from trial to job completion. Praised for having exceptional customer care, the study examines what DNS Made Easy does well, and also what needs improvements, which will all be translated into the upcoming upgrades in Constellix.\nReston, VA (PRWEB) September 30, 2015\nIn order to connect with customers, companies have to maintain constant communication with their clients. DNS Made Easy strives to be the industry leader in minimizing the gap between provider and client relations. As of later 2012, our staff began circulating surveys to customers and potential clients who participated in a free trial.\nThe results were such a great success, our sales engineers developed another survey for customers who have been using DNS Made Easy services and were up for renewal. After three years of compiling data, our team has created a plan to implement the proposed changes from the surveys into our sister company, Constellix .\nEach survey consisted of 10-20 brief questions which explored what DNS Made Easy features were excelling, and what suggestions users had for improvement. \"Our staff is committed to bridging the gap between us and our clients,\" says President of DNS Made Easy Steven Job. \"We always encourage users to share with us what is helping them achieve a higher ROI, or what they need improved to manage their DNS more efficiently.\"\nThis series of surveys is just one small part of DNS Made Easy's initiative to develop a traffic management suite, designed as a collaborative effort between DNS Made Easy engineers and clients. Over 75 percent of users who contributed to this study have either advanced or expert experience in the IT industry, with 61 percent having worked in the industry for ten or more years.\nAccording to survey replies, nearly half of the customers worked in the Internet industry, with a surprising 20 percent as contractors or using DNS Made Easy for personal use. This variety of users allowed us to optimized Constellix for the everyday IT professional seeking global scalability, and also the small business user wanting redundancy they couldn't achieve through an in-house network or web hosting provider.\nTo see the full implications of this long study, sign up for Constellix Beta which is free with any DNS Made Easy membership.\nAbout DNS Made Easy:\nDNS Made Easy is a subsidiary of Tiggee LLC, and is a world leader in providing global IP Anycast+ enterprise DNS services. DNS Made Easy implemented the industry’s first triple independent Anycast cloud architecture for maximum DNS speed and DNS redundancy. Originally launched in 2002, DNS Made Easy’s services have grown to manage hundreds of thousands of customer domains receiving more than 15 billion queries per day. Today, DNS Made Easy builds on a proud history of uptime and is the preferred DNS hosting choice for most major brands, especially companies that compare price and performance of enterprise IP Anycast alternatives.\n //www.prweb.com/releases/survey/results/prweb12996346.htm\n ", "external_links": ["http://www.constellix.com/getstarted.html", "http://www.prweb.com/releases/survey/results/prweb12996346.htm"], "published": "2015-10-01T06:01:00.000+03:00", "crawled": "2015-10-01T11:05:58.113+03:00", "highlightTitle": ""}