{"organizations": [], "uuid": "bf8d40ce949edbe64bfdaaa8da6ea80fba8eef65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30348483/premium-law-web-design-firms-designated-by-10-best-design-for-the-month-of-october", "country": "US", "title": "Premium Law Web Design Firms Designated by 10 Best Design for the Month of October", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Premium Law Web Design Firms Designated by 10 Best Design for the Month of October - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T16:11:00.000+02:00", "replies_count": 0, "uuid": "bf8d40ce949edbe64bfdaaa8da6ea80fba8eef65"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30348483/premium-law-web-design-firms-designated-by-10-best-design-for-the-month-of-october", "ord_in_thread": 0, "title": "Premium Law Web Design Firms Designated by 10 Best Design for the Month of October", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "10 Best Design - a company that picks the best web firms for law websites - has released their picks for the best law web design firm, and Old City Press from Washington DC topped the list. Among the other companies on the list are Scorpion Design, Valencia, CA and JurisPage, New York City.\nWASHINGTON, D.C. (PRWEB) October 26, 2015\n10 Best Design is pleased to announce its new October 2015 award for Best Law Web Design Firm. To determine the winners, 10 Best Design uses its own Analytic Review Algorithm to calculate data from traffic and SEO rankings, proprietary analytics, online research, and other sources. This data is then compiled to demonstrate which company ranks as the Best Law Web Development Firm.\nThe October 2015 inaugural award goes to a Washington D.C. firm, Old City Press. Old City Press is an extremely versatile top law web development firm that creates content for multiple purposes. The company works closely with clients of all sizes to develop great-looking websites. Old City Press uses its expert knowledge of HTML, WordPress, and e-commerce to help businesses reach their goals.\nThe second- and third-place spots on the 10 Best Law Web Design Firms list went to JurisPage of New York, N.Y. and Scorpion Design in Valencia, Calif. JurisPage is a leading law web design firm that builds websites for small firms and solo practitioners. The company's goal is to help lawyers attract more business and maintain contact with existing clients. True to its commitment to being a top law web design firm, Scorpion Design views itself as a partner for law firms. The California-based company has a proven record of success taking small firms and helping them grow through innovative online marketing.\nThe 10 Best Design team is made up of experienced online branding, web design, and development experts. The company maintains its own well-designed website that includes a blog with tips, updates, web development news, and, of course, lists of the top web design firms. 10 Best Design's awards are unique for their scientific method that uses qualitative and quantitative data to measure a design firm's performance. The company promotes creativity and best practices in the growing web design industry.\nThe 10 Best Design website features a bubble Quote: from Steve Jobs that says, \"Design is not just want it looks like. Design is how it works.\" The California company is congratulating its colleagues at the law web design firms who made this month's 10 Best list.\n //www.prweb.com/releases/best-law-web-design-firm/best-law-web-development/prweb13033402.htm\n ", "external_links": ["http://www.prweb.com/releases/best-law-web-design-firm/best-law-web-development/prweb13033402.htm", "http://www.10bestdesign.com/firms/law/2015/october/jurispage/", "http://www.10bestdesign.com/firms/law/", "http://www.10bestdesign.com/", "http://www.10bestdesign.com/firms/law/2015/october/scorpion-design/"], "published": "2015-10-26T16:11:00.000+02:00", "crawled": "2015-10-26T15:29:02.439+02:00", "highlightTitle": ""}