{"organizations": [], "uuid": "ce49555a938e422cdb18594a07b51d7644fe31f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144968/the-clearing-house-drives-closer-standing-up-new-innovative-national-real-time-payment", "country": "US", "title": "The Clearing House Drives Closer to Standing-Up New Innovative National Real-Time Payment System", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "The Clearing House Drives Closer to Standing-Up New Innovative National Real-Time Payment System", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T10:00:00.000+02:00", "replies_count": 0, "uuid": "ce49555a938e422cdb18594a07b51d7644fe31f2"}, "author": "admin", "url": "http://www.freshnews.com/news/1144968/the-clearing-house-drives-closer-standing-up-new-innovative-national-real-time-payment", "ord_in_thread": 0, "title": "The Clearing House Drives Closer to Standing-Up New Innovative National Real-Time Payment System", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  The Clearing House \nNEW YORK -- (BUSINESS WIRE) -- Today, The Clearing House (TCH) announced it has entered into a letter of intent with VocaLink, the UK-based international payment systems provider, to help build and deliver core elements of TCH’s new real-time payment system for the United States. \n“Building a real-time payment system is centered around meeting customer needs,” said Jim Aramanda, CEO of The Clearing House. “I am confident that working together with VocaLink we can build the most innovative and widely used real-time payment system in the world.” \n“We are delighted to be working in collaboration with The Clearing House to develop real-time payment solutions with innovative value added services for the USA,” said David Yates, CEO of VocaLink. “As the digital payments landscape continues to evolve, creating global market and business opportunities, it is vital that the USA, which is the largest developed economy in the world remains at the forefront of payments innovation.” \nIn designing the capabilities of the system, TCH made consumer protections a priority and intends for the new system to be compliant with the Consumer Financial Protection Bureau’s (CFPB) “Consumer Protection Principles” for faster payment systems. Some of the core customer benefits include: Ubiquity – the system will be accessible by all financial institutions in the U.S., regardless of size or charter type; Seamless Integration – the system will enable customers to use their current accounts to make and receive payments using their financial institutions’ existing online or mobile banking platforms; Commercial Payments – supports complex business payment services including electronic invoicing, rich remittance data and confirmation of delivery; Customer Control – every payment is initiated directly by the sender, providing complete control and transparency to customers; Certainty – senders and receivers will receive immediate notification of payment, and risk of returned payments will be eliminated, because sending financial institutions immediately verify good funds; Built to Last – extensibility in the system’s architecture will allow it to be flexible so it can adapt to changing market needs in the future; and Conforms to International Standard – meets ISO 20022 standards for real-time payments. Immediately allows FIs and customers to use the same formats, technology and processes across borders; which will eventually support international payments through interoperable domestic payment systems. \n“Our real-time payment system will enable customers across the country to make secure, convenient payments instantaneously,” Aramanda continued. “This real-time payment system will enable business to process invoices, governments to send disaster relieve funds, and individuals to pay contractors – all within an instant.” \nVocaLink designed, built and manages the real-time technology behind the UK Faster Payments Service on behalf of the Faster Payments Scheme. Since the service was launched in 2008, over 4 billion payments have been securely processed and the real-time infrastructure has provided a platform for further innovation, driving the development and proliferation of a wider range of services, including mobile payments. VocaLink has also exported its real-time capabilities to other markets and its Immediate Payments Solution powers the FAST payments service in Singapore, which has enabled it to become one of the world’s most advanced and dynamic payments markets. \nThe Clearing House is the only private-sector ACH Operator in the country, processing approximately 50% of all commercial ACH volume in the U.S. Its customers include credit unions, commercial banks, savings banks and savings and loans. It also owns and operates the CHIPS system, the largest private-sector U.S.-dollar funds-transfer system in the world, and an Image Payments Network, an industry utility that connects financial institutions of all sizes to get check images anywhere they need to go. \nAbout The Clearing House Established in 1853, The Clearing House is the oldest banking association and payments company in the United States. It is owned by the world’s largest commercial banks, which collectively hold more than half of all U.S. deposits and which employ over one million people in the United States, and more than two million people worldwide. The Clearing House Association L.L.C. is a nonpartisan advocacy organization that represents the interests of its owner banks by promoting and developing policies to support a safe, sound and competitive banking system that serves customers and communities. Its affiliate, The Clearing House Payments Company L.L.C., which is regulated as a systemically important financial market utility, owns and operates payments technology infrastructure that provides safe and efficient payment, clearing and settlement services to financial institutions, and leads innovation and thought leadership activities for the next generation of payments. It clears almost $2 trillion each day, representing nearly half of all automated clearing-house, funds transfer and check-image payments made in the United States. See The Clearing House’s web page at www.theclearinghouse.org . View source version on businesswire.com: http://www.businesswire.com/news/home/20151026005402/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-26T10:00:00.000+02:00", "crawled": "2015-10-26T11:06:01.356+02:00", "highlightTitle": ""}