{"organizations": [], "uuid": "0d6b4bdb67addccb8dfcd4b66a29a76ae5a65992", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/business", "section_title": "Vindy.com stories: Business & Technology", "url": "http://www.vindy.com/news/2015/oct/04/helping-with-style/", "country": "US", "title": "Soul Food mafia feeds giving-back movement", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Soul Food mafia feeds giving-back movement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T07:00:00.000+03:00", "replies_count": 0, "uuid": "0d6b4bdb67addccb8dfcd4b66a29a76ae5a65992"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/04/helping-with-style/", "ord_in_thread": 0, "title": "Soul Food mafia feeds giving-back movement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CANFIELD \nHeidi Davis sips her large iced coffee at a local coffee shop. \nThe Canfield resident talks quickly, with passion in her eyes, about her new venture into the world of making T-shirts for a purpose: to give back. \n“I felt like I didn’t have a choice,” she said. “It was something I was supposed to do.” \nCoffee, good vibes and something else fuel her fire. \nShe’s a mother of four with a new business and a full-time job. \nMost would wonder how she does it. She just does it. That something else that fuels her fire is a passion to make the world a better place. \n“We have a human responsibility,” Davis said. “It’s about doing good.” \nThe idea to start a T-shirt company with a purpose came six months ago. The launch of her business, Soul Food Mafia, came about two months ago. And her brainstorming goes on forever. \nSoul Food Mafia is an edgy apparel company with heart. When a customer purchases a piece of Soul Food Mafia gear, 8 percent of the cost goes toward a movement of the customer’s choice. The vision is in the name: soul represents giving back; food represents feeding a movement; and mafia represents a group of like-minded people willing to take a bullet for what they believe. \nThe gear has witty sayings mixed with eye-catching designs such as the Gandhi: “The OG” T-shirt – OG stands for original gangsta or the “I Run This Motha” T-shirt. The company website, www.soulfoodmafia.com, opens with “Be The Change: Start with Your T-Shirt.” \nDavis wears a Soul Food Mafia black Buddhaful shirt as she talks about how this company came to be. \nShe left a meditation circle on April 16 – yes, she remembers the date – and decided she had to start a T-shirt operation. \n“I had no idea how to do that,” she said. \nBut she developed a plan, and a spiritual deadline. She wanted to launch the company Aug. 8 – 8-8-2015 – because of the significance of the number eight. It is the universal number of karma. \nFinding T-shirt companies that adhered to Davis’ standards was difficult. She wanted a T-shirt maker that didn’t use child labor or sweatshop manufacturing. She also wanted eco-conscious manufacturers with mandatory recycling, solar-powered sewing rooms and little-to-no landfill. \nAfter finding the right T-shirt companies, Davis moved on to the designs. \n“It’s really fun to take the crazy part out of your head and see it on a T-shirt,” Davis said. \nShe started with eight designs and went out to find a place to screen them. She found The Federal, a downtown Youngstown business. \nNext, Davis added Chad Warren, website designer, business partner and digital godfather. He believed in her vision. \n“He believed in the outcome, which is just to make the world a better place,” Davis said, getting emotional. \nShe also added Lauren Houser as Little Miss TMZ, also known as the director of marketing and philanthropy. \nAs soon as Davis explained her vision for the business to Houser, she was on board. \nHouser said there are a lot of reasons why she instantly knew she had to be a part of Soul Food Mafia, including the passion in Davis’ eyes and voice. \n“I walked away from her saying, ‘There’s no way I can walk away from this,’” Houser said. \nHouser liked the idea of marrying edginess and beauty in the soul. Being edgy doesn’t mean you can’t have a warm heart. \n“It’s OK to be both,” Houser said. “Most of us are.” \nHouser took on marketing the business and creating partnerships with an array of philanthropic organizations with focuses from animals to students. \nDavis’ team, which also includes Amanda Young as the director of social media, or the social hustler, worked round the clock to meet the launch deadline. The last picture was dropped on the website at 2 a.m. Aug. 8, and the website launched at 8 a.m. \n“I am not sure there are words to describe it,” Davis said of the launch. \nSo many people checked out the site it shut down, but came back up. \n“The support was incredible,” Davis said. \nIn her first few weeks of business, about 1,000 shirts sold. \n“I think it is going to be bigger than big,” Davis said. \nNo matter how big it gets, Davis will keep the business centered on her vision. \n“This isn’t about me,” she said. “This is about giving back.” \nA new set of eight designs will come out for the holidays with items for babies and children. The gear will expand outside of T-shirts to include hoodies, lounge pants and jewelry. \nThe designing never stops. Davis sees an idea and takes it down. \n“I think with her at the reins, there’s no stopping,” Houser said. “She is just a flame that’s burning into a wild fire. She’s not going to stop until she’s made the biggest impact.” Other stories of interest", "external_links": [], "published": "2015-10-04T07:00:00.000+03:00", "crawled": "2015-10-05T11:26:41.793+03:00", "highlightTitle": ""}