{"organizations": [], "uuid": "b1093ec57ab22cf375b171f096096f5fad3e966e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151005006124/en/Fraunhofer-SIT-Enterprise-Mobility-Management-App-Security", "country": "US", "title": "Fraunhofer SIT: Enterprise Mobility Management Using App Security Information", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Fraunhofer SIT: Enterprise Mobility Management Using App Security Information", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:00:00.000+03:00", "replies_count": 0, "uuid": "b1093ec57ab22cf375b171f096096f5fad3e966e"}, "author": "", "url": "http://www.businesswire.com/news/home/20151005006124/en/Fraunhofer-SIT-Enterprise-Mobility-Management-App-Security", "ord_in_thread": 0, "title": "Fraunhofer SIT: Enterprise Mobility Management Using App Security Information", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Fraunhofer"], "text": "Thumbnail October 05, 2015 11:00 AM Eastern Daylight Time \nDARMSTADT, Germany--( BUSINESS WIRE )-- Easily more security – that is the objective of a cooperation between MobileIron, one of the leading providers of Enterprise Mobility Management applications, and Fraunhofer Institute for Secure Information Technology in Darmstadt: with MobileIron the Fraunhofer SIT Appicaptor analysis service can be integrated into the Enterprise Mobility Management System (EMM). Appicaptor is an autonomous solution providing automated app security checks with up-to-date security information and data protection features for iOS and Android apps. MobileIron customers can now view their analysis results directly in the EMM system in order to improve their own risk management and to exclude insecure apps quickly from daily business issues. \nA company’s security is endangered when the staff is allowed to use apps randomly. This is why Fraunhofer SIT has developed Appicaptor. Appicaptor is one of the few app testing services worldwide that provides security evaluations for iOS apps as well. Appicaptor automatically scans a large number of apps, inspects them with regard to IT security and compliance with data protection specifications, and evaluates if they are suitable for business operations. Appicaptor opts between different default rules (black and white listing) or makes recommendations according to the company’s security policies. Until now the results were available as reports only. The cooperation with MobileIron now gives its customers the option to view the results in the EMM system. Future MobileIron versions are intended to have automated result processing. \nWith new attack possibilities becoming known constantly and since even new versions of an app may introduce old flaws, Appicaptor repeats the app tests on a regular basis while also checking for new vulnerabilities. The app security assessments will be updated automatically via MobileIron: The system that supplies mobile device, app and content management provides an overview over the company’s mobile hardware and the apps installed on it. This is the basis on which Appicaptor reviews the security of all the apps relevant for the company. Within MobileIron enterprises can retrieve detailed information on the security features of individual apps to help them decide whether critical apps should be de-installed or put under quarantine. \nAs of now, Appicaptor may be used directly with MobileIron’s EMM system. Once they have bought an Appicaptor subscription from Fraunhofer SIT, MobileIron customers can perform automated checks of the apps installed on their employees‘ devices and determine which features the apps need to have to be approved for business use. \nAbout MobileIron: \nMobileIron (NASDAQ: MOBL) offers companies worldwide a secure basis to become successful Mobile First Organisations. Further information can be found at: www.mobileiron.com . Contacts \nFraunhofer Institute for Secure Information Technology SITOliver KüchHead of PR and Marketingphone: +49 6151 869-213", "external_links": [], "published": "2015-10-05T18:00:00.000+03:00", "crawled": "2015-10-05T18:06:27.387+03:00", "highlightTitle": ""}