{"organizations": [], "uuid": "427269fc6b0989e202381b340ecb4290aa34b6f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30161991/total-phase-announces-the-release-of-the-usb-power-delivery-analyzer", "country": "US", "title": "Total Phase Announces the Release of the USB Power Delivery Analyzer", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Total Phase Announces the Release of the USB Power Delivery Analyzer - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T18:01:00.000+03:00", "replies_count": 0, "uuid": "427269fc6b0989e202381b340ecb4290aa34b6f7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30161991/total-phase-announces-the-release-of-the-usb-power-delivery-analyzer", "ord_in_thread": 0, "title": "Total Phase Announces the Release of the USB Power Delivery Analyzer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The USB Power Delivery Analyzer is a Type-C connector sniffing dongle which is able to act as USB 3.1 Gen 2 data pass through while simultaneously recording traffic on CC1 or CC2.\nSanta Clara, CA (PRWEB) October 01, 2015\nTotal Phase, a provider of industry-leading USB, I2C, SPI, and CAN embedded systems tools, announced the addition of a new product to their portfolio. The USB Power Delivery Analyzer is a Type-C connector sniffing dongle which is able to act as USB 3.1 Gen 2 data pass through while simultaneously recording traffic on CC1 or CC2.\n“USB Type-C is rapidly replacing the USB connectors that were previously included in consumer electronic devices like monitors and computers. The new Type-C form factor is easy-to-use and offers a much higher degree of flexibility, giving designers the ability to standardize connections and use one port for all high-speed interconnects, said Gil Ben-Dov, CEO at Total Phase. “We are confidant the Power Delivery Analyzer, with its open source software, will be most beneficial in the design, development and test phases of the development lifecycle.”\nThe USB Power Delivery Analyzer is able to sniff power delivery traffic on both Control Channel lines (CC1/CC2), while acting as a transparent pass through for your USB protocol traffic (at up to 10 Gbps). The PulseView open source software allows you to view captured traces for decoding and visualization of USB power delivery (PD) traffic. The applicable uses are limitless:\n Monitor power delivery negotiation Visualize and decode PD packets Inject BMC incoded PD packets on the CC1 or CC2 lines Switch in Rd/Rp/Ra resistors on CC1 and CC2 Monitor detailed sink/source charging level negotiation See PD negotiation between multiple sources Test interoperability of how your device interacts with other Type-C PD solutions Test the interaction between source and sink Test/verify electronically marked cables Monitor upstream/downstream port role swap View entrance/exit for Alternate Mode\nThe USB Power Delivery Analyzer is a lightweight, low profile device that is bus-powered. Software for the Power Delivery Analyzer is provided by the open source PulseView visualization tool and available at no additional charge.\nFor more information visit http://www.totalphase.com/get/pda/\nAbout Total Phase\nTotal Phase manufactures user-friendly, powerful, and affordable USB, I2C, CAN and SPI development tools for embedded systems engineers. Total Phase tools combine best-of-breed features, Windows, Linux, and Mac OS X support, a royalty-free API, and excellent customer support, making them perfect additions to any engineer's toolbox.\nPlease visit us at http://www.totalphase.com .\n###\nTrademarks and brands are the property of their owners.\nMedia Contact:\nYvonne Smith\nMarketing Manager\n(408) 850-6559\nyvonne(at)totalphase(dot)com\nSales Inquiries:\n(408) 850-6501\nsales(at)totalphase(dot)com\n //www.prweb.com/releases/201510/totalphase/prweb12996686.htm\n ", "external_links": ["http://www.prweb.com/releases/201510/totalphase/prweb12996686.htm", "http://www.totalphase.com/get/pda", "http://www.totalphase.com/get/pda/"], "published": "2015-10-01T18:01:00.000+03:00", "crawled": "2015-10-02T19:21:02.168+03:00", "highlightTitle": ""}