{"organizations": [], "uuid": "b10850bbbba5e91787fd7c0ab611376e5e95dd9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30308115/l-com-global-connectivity-appoints-scott-rassoulian-global-director-product-development-and-engineering", "country": "US", "title": "L-com Global Connectivity Appoints Scott Rassoulian Global Director, Product Development and Engineering", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "L-com Global Connectivity Appoints Scott Rassoulian Global Director, Product Development and Engineering - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T22:11:00.000+03:00", "replies_count": 0, "uuid": "b10850bbbba5e91787fd7c0ab611376e5e95dd9a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30308115/l-com-global-connectivity-appoints-scott-rassoulian-global-director-product-development-and-engineering", "ord_in_thread": 0, "title": "L-com Global Connectivity Appoints Scott Rassoulian Global Director, Product Development and Engineering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "L-com Global Connectivity, a preferred manufacturer of wired and wireless connectivity products, announced today that it has appointed Scott Rassoulian as Global Director, Product Development and Engineering.\nNorth Andover, MA\nL-com Global Connectivity, a preferred manufacturer of wired and wireless connectivity products, announced today that it has appointed Scott Rassoulian as Global Director, Product Development and Engineering.\nMr. Rassoulian comes to L-com with over 25 years of proven experience in global product development and technology commercialization. Scott’s most recent role was with Atomic Precision, Inc. where he was Chief Technology Officer and founder. Additionally, Scott held senior technology and engineering roles and led strategic product development projects at Symmetricom (now Microsemi), and Crane Aerospace Corporation.\nScott’s areas of technical expertise include wireless sensors, advanced millimeter wave systems, microwave technology, and RF systems.\n“Scott brings to L-com strong technical expertise and proven new product development skills. He has an exceptional record of success commercializing high-tech products, and the key to his impressive success has been his extraordinary ability to develop talented employees and build highly successful, results-oriented teams. In fact, we believe that it is his organizational, mentoring, and coaching skills that truly set him apart in this industry” said Jon Jensen, L-com’s President and CEO.\n“Through his unique combination of technical acumen and organizational skills, Scott will take L-com to the next level of innovation and new product development,” continued Jensen.\n“I am excited to build upon L-com’s diverse and successful product portfolio. By utilizing new product development best practices coupled with strategic research and VOC feedback, we will be able to bring innovative, solutions driven products to market at a faster pace to delight our customers, shareholders and employees,” shared Scott.\nScott will be based at L-com’s North Andover Massachusetts location and will report directly to Bill Miller, L-com’s Executive Vice President of Sales and Engineering.\nScott holds BS, MEE and MS, M. Sc degrees from Northeastern University and attended the MIT-Sloan School of Management’s Executive Program.\nFor more information about this release, please contact:\nPeter McNeil, Marketing Manager\n978-682-6936 x1174, pmcneil(at)l-com(dot)com\nAbout L-com Global Connectivity\nL-com Global Connectivity, a preferred manufacturer of wired and wireless connectivity products, offers a wide range of solutions and unrivaled customer service for the electronics and data communications industries. The company's product portfolio includes cable assemblies, connectors, adapters, computer networking components, and custom products, as well as their HyperLink® brand of wireless products which include antennas, RF amplifiers, coaxial lightning and surge protectors, and NEMA rated enclosures. L-com's HyperLink® wireless products are designed for WiFi, WiMAX, SCADA, 802.11a/b/g/n/ac, RFID and Bluetooth applications. In addition to HyperLink® , L-com’s other brands include MilesTek®, specialists in Military/Aeronautics connectivity solutions and Aiconics®, a leading manufacturer of electrical connector products. Trusted for over 30 years, L-com, which is headquartered in North Andover, MA, is ISO 9001: 2008 certified and many of its products are UL® recognized. For more information, please visit: http://www.L-com.com/\n //www.prweb.com/releases/2015/10/prweb13028369.htm\n ", "external_links": ["http://www.L-com.com/", "http://www.prweb.com/releases/2015/10/prweb13028369.htm"], "published": "2015-10-20T22:11:00.000+03:00", "crawled": "2015-10-20T23:15:21.363+03:00", "highlightTitle": ""}