{"organizations": [], "uuid": "d22e44534cfe61b5210e64fa3a97eff785497aab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3250030.1443663059!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_1180/oilsands-emissions.jpg", "site_section": "http://rss.cbc.ca/lineup/technology.xml\r", "section_title": "CBC | Technology News", "url": "http://www.cbc.ca/news/technology/election-science-debate-quirks-quarks-1.3264777?cmp=rss", "country": "IL", "title": "Federal party candidates debate science funding, muzzling of scientists on Quirks & Quarks", "performance_score": 0, "site": "cbc.ca", "participants_count": 1, "title_full": "Federal party candidates debate science funding, muzzling of scientists on Quirks & Quarks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T23:06:00.000+03:00", "replies_count": 0, "uuid": "d22e44534cfe61b5210e64fa3a97eff785497aab"}, "author": "CBC News", "url": "http://www.cbc.ca/news/technology/election-science-debate-quirks-quarks-1.3264777?cmp=rss", "ord_in_thread": 0, "title": "Federal party candidates debate science funding, muzzling of scientists on Quirks & Quarks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Federal party candidates debate science funding, muzzling of scientists on Quirks & Quarks Listen to the full debate on CBC Radio One on Saturday at 12 p.m. CBC News Posted: Oct 09, 2015 4:06 PM ET Last Updated: Oct 09, 2015 4:06 PM ET Quirks & Quarks host Bob McDonald asks four candidates running in the federal election how each of their parties views the government's role when it comes to science. (Jason Franson/Canadian Press) Related Stories \nThe four candidates featured in the debate are: Lynne Quarmby, Green Party candidate in Burnaby North-Seymour. Gary Goodyear, Conservative Party candidate in Cambridge. Marc Garneau, Liberal Party candidate in NDG-Westmount. Megan Leslie, NDP candidate in Halifax. \nHost Bob McDonald quizzed the candidates on their party's science policies. Science funding \nFirst, they sparred over what role the federal government should play when it comes to science policies. \nThe NDP, Green and Liberal candidates accused the ruling Conservative government of shifting their focus too far to science that is focused on creating products. \n\"Basic scientific research is at starvation levels,\" said Quarmby, who is also a professor and chair of the molecular biology and biochemistry department at Vancouver's Simon Fraser University. \nGoodyear, the former minister of state for science and technology, defended his party's focus. \nThe Harper government has invested into scientific research that it considers a \"home run,\" he said, which means discoveries that resulted in products being built in Canadian factories. \n\"When [scientists] discover something that's going to help society, that we can create jobs by building it on our factory floors ... We feel that the home run is where all of the benefits of that knowledge are obtained. Leaving it in the laboratory is not what can happen today in this competitive global environment,\" he said. \nGarneau, a former astronaut, did not agree with Goodyear's assessment. \n\"The government should not play god with respect to science and decide which science is more important than others,\" he said. Silencing scientists \nThe conversation shifted to recent concerns over allegations that the federal government is muzzling scientists. McDonald questioned the candidates on whether they think the concerns are a problem and how they would address it. FAQ: The issues around muzzling government scientists \nAbout a year ago, a report from Evidence for Democracy, a non-profit group that advocates for evidence-based public policy, suggested that Canadian government scientists face far more restrictions on talking to the media than their U.S. counterparts. One Canadian scientist says he quit over the practice . \nNDP candidate and environment critic Leslie called it \"a huge problem.\" \nAgain, Goodyear rebutted the criticism, saying Canada's scientists conduct thousands of media interviews annually as well as publish articles and attend international conferences. \nThe candidates also answered questions about how their parties plan to reduce Canada's greenhouse gas emissions while protecting employment and the economy. \nListen to the full debate on CBC Radio One on Saturday at 12 p.m.", "external_links": [], "published": "2015-10-09T23:06:00.000+03:00", "crawled": "2015-10-10T04:35:52.632+03:00", "highlightTitle": ""}