{"organizations": [], "uuid": "fba87f76490fe8da2cdcf6420a27919c62187480", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/technology.html", "section_title": "Technology", "url": "https://www.prbuzz.com/technology/351451-caprion-to-present-at-biojapan-2015-world-business-forum.html", "country": "US", "title": "Caprion to Present at BioJapan 2015 World Business Forum", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Caprion to Present at BioJapan 2015 World Business Forum", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "fba87f76490fe8da2cdcf6420a27919c62187480"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/technology/351451-caprion-to-present-at-biojapan-2015-world-business-forum.html", "ord_in_thread": 0, "title": "Caprion to Present at BioJapan 2015 World Business Forum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Montreal, Canada – October 13, 2015 - Caprion announced today that it will be delivering two scientific platform presentations at the BioJapan 2015 Conference being held in Yokohama, Japan October 14-17, 2015. The platform presentations will focus on translational assay solutions for personalizing Cancer Immunotherapies.\n“Immune Monitoring of Oncology Trials during Pre-Clinical and Clinical Development”\nWednesday, October 14, 2015, 12:00 – 13:00 pm\nLocation: Pacifico Yokohama Annex Hall F202\nPresenter: Yoav Peretz, PhD., Scientific Director Immunology\nImmune monitoring of patients enrolled in oncology trials has become crucial to help guide the development of immunotherapies and reveal potential relationships between the clinical and immunological response. Dr. Peretz will review the tools used to comprehensively monitor the function and phenotype of cellular responses in the setting of Immuno-oncology enabling the identification of correlates and predictive biomarkers of immune protection. These tools have the potential to rapidly accelerate the development of immune modulatory therapies.\n“Direct Identification of Tumor Neo-antigens for Personalised Cancer Immunotherapy”\nFriday, October 16, 2015 12:30 – 13:00 pm\nLocation: Pacifico Yokohama / Global Partnering Stage A\nPresenter: Andrew Munk, PhD., Director, New Products and Business Development\nThe presentation will feature Caprion’s newly launched MHC class I Peptide Identification and T-cell Characterization Service which combines the company’s expertise in proteomics and immune monitoring to provide identification of naturally processed, MHC class I-bound peptides followed by a comprehensive functional characterization of the T-cell response.\nThis methodology can identify overexpressed tumor antigens and T-cell neo-epitopes presented on the surface of tumor cells relative to adjacent normal tissue. The technology facilitates the discovery of novel T-cell targets effectively guiding the design of therapeutic vaccines and adoptive T-cell therapies.\nAbout Caprion\nCaprion is the leading provider of proteomics and immune monitoring services to the pharmaceutical and biotechnology industry. Its immune monitoring business unit, ImmuneCarta ®, offers proprietary multiparametric flow cytometry for functional analyses of innate and adaptive immune responses. Caprion’s proteomics business unit, ProteoCarta ™, offers proprietary gel-free, label-free mass spectrometry (MS) for comprehensive, quantitative and robust comparative measurement of proteins across large sets of biological samples for the discovery and validation of protein biomarkers. Caprion also leverages ProteoCarta to develop its own in-vitro diagnostic products targeting cancer, metabolic and infectious diseases. With research sites in Montreal, Canada and in Menlo Park, CA, Caprion has been providing large-scale proteomics and immune monitoring services to over 50 major pharmaceutical and biotech clients for more than 10 years. Caprion, a privately-held company, is majority owned by Chicago Growth Partners. For more information, please visit www.caprion.com .", "external_links": ["http://www.caprion.com/en/index.php", "http://www.immunecarta.com/en/index.html"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T17:05:53.190+03:00", "highlightTitle": ""}