{"organizations": ["Inc AppYea Inc.", "AppYea Inc", "Amazon", "Google", "Securities and Exchange Commission"], "uuid": "022810b9252b27fe00fb043743a139ef97409174", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/360357?filename=360357.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/industry/9000/Technology", "section_title": "GlobeNewswire: Industry News on Technology", "url": "http://globenewswire.com/news-release/2015/10/09/775062/0/en/Apple-Approves-17-of-AppYea-s-New-Gaming-Apps-for-Apples-iOS-Platform.html?f=22&fvtc=3&fvtv=9000", "country": "US", "title": "Apple Approves 17 of AppYea’s New Gaming Apps for Apples’ iOS Platform", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Apple Approves 17 of AppYea’s New Gaming Apps for Apples’ iOS Platform", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T00:15:00.000+03:00", "replies_count": 0, "uuid": "022810b9252b27fe00fb043743a139ef97409174"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/09/775062/0/en/Apple-Approves-17-of-AppYea-s-New-Gaming-Apps-for-Apples-iOS-Platform.html?f=22&fvtc=3&fvtv=9000", "ord_in_thread": 0, "title": "Apple Approves 17 of AppYea’s New Gaming Apps for Apples’ iOS Platform", "locations": ["FORT WORTH", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jackie Williams", "Stuart T. Smith"], "text": "Apple Approves 17 of AppYea’s New Gaming Apps for Apples’ iOS Platform October 09, 2015 17:15 ET | Source: AppYea Inc. FORT WORTH, Texas, Oct. 09, 2015 (GLOBE NEWSWIRE) -- APPYEA (OTCQB:APYP) is pleased to announce that Apple has approved all 17 of their new gaming apps which will be added to their gaming portfolio. AppYea’s new apps consist of 10 apps for the new iWatch which includes Simon Says, 8 Puzzle, Quick Quiz and Tic Tac Toe just to name a few and 7 for the iPhone which includes Hearts Match, Bug Smash, Doodle Birdy and 777 Slots. AppYea’s CEO Jackie Williams stated, “I’m excited about these new gaming apps that Apple just approved. What’s even more exciting is that we have developers currently working on even more gaming apps that we will be adding to our gaming portfolio soon.” Apple is expected to sell roughly 21 million iWatches by 2016 and with its two new iPhone 6 models breaking sales records the iOS platform it is still the number one opportunity platform for app developers. The global mobile gaming market for smart mobile devices have seen huge demands. Diverse connectivity options that are available on these devices such as 4G, Bluetooth and Wi-Fi are helping its tremendous surge. Over 60 percent of smart phone users play games on their mobile devices on a daily basis and nearly 65 percent of the money spent on smartphones and tablets is for gaming purposes. About AppYea, Inc AppYea Inc., founded in 2012, is a mobile application developer for iOS, Google Play, and Amazon platforms. The Company operates its own titles as well as provides strategic partnerships with promising mobile app developers. AppYea focuses on a number of different categories including next-generation social networks and gaming. The company is headquartered in Ft Worth, Texas. The Company trades under the symbol \"APYP.\" Find out more by visiting: http://appyea.com/about/ This press release contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Act of 1934. These forward-looking statements are based largely on the expectations or forecasts of future events, can be affected by inaccurate assumptions, and are subject to various business risks and known and unknown uncertainties, a number of which are beyond the control of management. Therefore, actual results could differ materially from the forward-looking statements contained in this press release. Additional information respecting the factors that could materially affect the Company and its operations are contained in its annual report on Form 10K and Form 10-Q as filed with the Securities and Exchange Commission. The Company undertakes no obligation to publicly update or revise any forward-looking statement. CONTACT: Contact: Stuart T. Smith SmallCapVoice.com E-mail: ssmith@smallcapvoice.com Website: www.smallcapvoice.com Related Articles", "external_links": [], "published": "2015-10-10T00:15:00.000+03:00", "crawled": "2015-10-10T21:42:39.984+03:00", "highlightTitle": ""}