{"organizations": [], "uuid": "8b1c63ef7bc866d0d5e9a38226dfa566c23d2741", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/studyfindsap.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-apps-benefit-pre-schoolers-parents-wisely.html", "country": "US", "title": "Study finds apps can benefit pre-schoolers, but parents need to choose wisely", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Study finds apps can benefit pre-schoolers, but parents need to choose wisely", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T16:10:00.000+03:00", "replies_count": 0, "uuid": "8b1c63ef7bc866d0d5e9a38226dfa566c23d2741"}, "author": "", "url": "http://phys.org/news/2015-10-apps-benefit-pre-schoolers-parents-wisely.html", "ord_in_thread": 0, "title": "Study finds apps can benefit pre-schoolers, but parents need to choose wisely", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Study finds apps can benefit pre-schoolers, but parents need to choose wisely October 6, 2015 \nApps can foster play and creativity in children aged between 0 and five, but parents need to choose the ones they use carefully, research by the University of Sheffield has found. \nA study examining pre-school children 's use of apps and tablets found that in households where there are tablets, 31 per cent of under-fives have their own and use them for an average of one hour and 19 minutes on weekdays and one hour and 23 minutes on weekends. \nResearchers found that while age-appropriate apps could help children with play and creativity, those which included many adverts for other apps and featured pop-ups for in-app purchases hampered this. Apps aimed at older children, like Candy Crush Saga and Angry Birds, are less beneficial to pre-schoolers. \nThe project, funded by the Economic and Social Research Council, was undertaken as a collaboration between the universities of Sheffield and Edinburgh, the pre-school children's television channel, CBeebies, children's media industry partners Dubit and Foundling Bird and Monteney Primary School, Sheffield. \nThe project has led to a range of publications aimed at parents, early years educators and the children's media industry, including recommendations for app developers that provide guidance on how to design apps for pre-schoolers. \nPrincipal investigator Professor Jackie Marsh, of the University of Sheffield's School of Education, said: \"The study showed that the use of apps on tablets by pre-schoolers can be very productive and foster a wide range of play and creativity. However, apps need to be chosen carefully by parents for this age group. \n\"Apps that contain adverts and pop-ups for in-app purchases can limit children's play. In addition, whilst children of this age want to play some of the same games that their older siblings or parents play, these are not age-appropriate and do not offer a great deal of value for pre-schoolers. \nShe added: \"Parents should look for apps produced by broadcasters or companies that know a great deal about this age group.\" \nIn the study, researchers found youngsters use their tablets to watch television programmes and films, play games, listen to music, draw and paint, create virtual worlds, look after pets, dress up avatars and engage in role play. \nOver half of children aged 0-five can swipe the screen, trace shapes with their fingers, drag items across the screen, open their apps, draw things, tap the screen to operate commands, exit apps and enter other apps and turn the device on and off without any assistance. \nThe study found that children's top ten favourite apps are: YouTube Candy Crush Saga Toca Boca \nFrom the top ten list, the CBeebies app 'Playtime' was the app that promoted the widest range of play and creativity for the under-fives. \nCo-investigator, Professor Lydia Plowman of the University of Edinburgh, said: \"It may seem surprising that in homes with a tablet, nearly a third of under 5s have their own device. But when parents upgrade their tablet many pass on their older model to their children. Budget models are also popular gifts, as parents don't have to worry so much about breakages. While there are benefits to children becoming independent users, it's also important that parents are able to find time to share the experience of interacting with apps.\" \nEarly years settings and schools could also play a role in advising parents. Peter Winter, Information Communication Technology teacher at Monteney Primary School, said: \"Teachers could be a valuable source of information for parents on apps that have educational value through the use of Twitter feeds, blogs and/ or newsletters. Offering guidance in these areas is crucial if parents are going to help their children to use digital tools effectively.\" 23 hours ago 2 Have yourself an appy little Christmas December 12, 2013 \nApps that keep young children occupied abound but there are some that are educational, fun and free to boot. What's more they can make an heirloom record of a young child's development. What we know about tablets and how your child learns to read January 14, 2015 \nA recent US survey commissioned by the children's books publisher Scholastic found that 65% of 6-11 year olds prefer to read print books even when e-books are available on tablets. In the UK, a National Literacy Survey found ... Science of learning can help parents, developers grade educational apps April 20, 2015 \nNew apps developed for children come online every day and many of them are marketed or labeled as \"educational\" - but how can we tell which of these thousands of apps will actually help children learn? A comprehensive new ... Connecting with citizen science apps September 22, 2015 \nYears ago, when my daughter got an iPod, her iTunes account became un-affectionately known to the rest of the family as the \"iTunes you out\" app. Many parents have joined scholars in expressing concerns about how mobile computing ... Recommended for you Toyota shows self-driving technology being readied for 2020 (Update) October 6, 2015 \nToyota unveiled its vision for self-driving cars in a challenge to other automakers as well as industry newcomer Google Inc., promising to start selling such vehicles in Japan by 2020. Top EU court rules data sharing pact with US invalid (Update) October 6, 2015 \nThe European Union's highest court struck a big blow Tuesday against Facebook and other companies by ruling that a long-running pact allowing the free transfer of data to the U.S. is invalid as it does not adequately protect ... Dutch create world's largest man-made wave October 5, 2015 \nIn a country where most people live below sea level, studying the oceans is a matter of survival. Now Dutch scientists have created the world's biggest man-made wave in a bid to prepare for the worst. Research improves efficiency from larger perovskite solar cells October 5, 2015 \nPerovskite solar cells are cheaper to make than traditional silicon cells and their electricity conversion efficiency is improving rapidly. To be commercially viable, perovskite cells need to scale up from lab size. Researchers ... Liquid cooling moves onto the chip for denser electronics October 5, 2015 \nUsing microfluidic passages cut directly into the backsides of production field-programmable gate array (FPGA) devices, Georgia Institute of Technology researchers are putting liquid cooling right where it's needed the most ... Price of solar energy in the United States has fallen to 5c/kWh on average September 30, 2015 \nSolar energy pricing is at an all-time low, according to a new report released by Lawrence Berkeley National Laboratory (Berkeley Lab). Driven by lower installed costs, improved project performance, and a race to build projects ...", "external_links": [], "published": "2015-10-06T16:10:00.000+03:00", "crawled": "2015-10-06T16:14:25.824+03:00", "highlightTitle": ""}