{"organizations": ["Social Media Marketing"], "uuid": "f07e0b4b6372f34b70e05b81a05bb4643e58ab81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "investor.biospace.com", "main_image": "", "site_section": "http://investor.biospace.com/biospace/action/rssfeed?Category=technology", "section_title": "News about technology", "url": "http://investor.biospace.com/biospace/news/read?GUID=30872430", "country": "US", "title": "Announcement: Event Changes - Free Webinar on Air - Lead Generation, Social Media Marketing and Crowdfunding", "performance_score": 0, "site": "biospace.com", "participants_count": 0, "title_full": "Announcement: Event Changes - Free Webinar on Air - Lead Generation, Social Media Marketing and Crowdfunding", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T12:19:00.000+03:00", "replies_count": 0, "uuid": "f07e0b4b6372f34b70e05b81a05bb4643e58ab81"}, "author": "", "url": "http://investor.biospace.com/biospace/news/read?GUID=30872430", "ord_in_thread": 0, "title": "Announcement: Event Changes - Free Webinar on Air - Lead Generation, Social Media Marketing and Crowdfunding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 23, 2015 at 05:19 AM EDT Announcement: Event Changes - Free Webinar on Air - Lead Generation, Social Media Marketing and Crowdfunding \nRosemary Burnett Consulting announced the Speaker Event to be held in Perth on 29th Oct will now be a FREE Webinar so small business owners globally can attend. The two biggest problems faced by small business today is how do they fund their startup and leverage technology to attract more customers and make more sales. — Rosemary Burnett, Event Organizer PERTH, WESTERN AUSTRALIA, AUSTRALIA, October 23, 2015 / EINPresswire.com / -- With 4 guest speakers, entrepreneurs will learn how to generate more leads using the latest mobile social coupon technology and viral social sharing tools. Plus will learn how to crowdfund their startup and an amazing Amazon Kindle Book success story from US Today bestselling author, Jani Kay. Join Rosemary Burnett, Jurgen Van Pletsen, Julia Buchholz and Jeanette Kemert for this free webinar on October 29th, 2015 from 5.30pm to 7.30pm AWST by registering here - http://tinyurl.com/smallbizwebinar The webinar is for small business owners, entrepreneurs and tech startups. The webinar will focus on emerging technologies in mobile social coupons to increase customer engagement, capture client data and generate more leads using viral social sharing presented by Julia Buchholz, Social Media Specialist at Octano Pty Ltd ( www.octano.com.au ). Rosemary Burnett, Business Coach at Rosemary Burnett Consulting and Technology News Blog founder of www.sitecontent4u.com will share expert tips on lead generation using content marketing, YouTube and viral social sharing tools. Jurgen Van Pletsen, Managing Director of Niche Interview, Blink Technology and www.cfblueprint.com will reveal expert tips on how to create a successful crowdfunding campaign to help fund startups. Based on a new ‘Crowdfunding Blueprint’ developed from 50 interviews with the top 3% of crowdfunders in the world, who have collectively raised $56 million from crowdfunding. Jeanette Kemert from Jani Kay Books ( www.janikaybooks.blogspot.com.au ) is a bestselling author of adult fiction books on Amazon.com, Barnes and Noble, and Goodreads. Jeanette will be sharing her inspiring story and journey from business woman and scientist with her own skincare range JK Secret Cosmeceuticals to becoming a highly successful Author. The webinar event is part of the ‘Grow Your Small Business Online Meetup’ group which is free for entrepreneurs, startups and small business owners to join. It provides networking opportunities, speaker events and webinars to support budding entrepreneurs create profitable online businesses. Webinar details:", "external_links": [], "published": "2015-10-23T12:19:00.000+03:00", "crawled": "2015-10-23T13:05:43.757+03:00", "highlightTitle": ""}