{"organizations": [], "uuid": "2cea25dea59dde41b865eafe4a5f219eff26b343", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141259/wireless-milestone-reached-rural-america", "country": "US", "title": "Wireless milestone reached in rural America", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Wireless milestone reached in rural America", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:00:00.000+03:00", "replies_count": 0, "uuid": "2cea25dea59dde41b865eafe4a5f219eff26b343"}, "author": "admin", "url": "http://www.freshnews.com/news/1141259/wireless-milestone-reached-rural-america", "ord_in_thread": 0, "title": "Wireless milestone reached in rural America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/15/2015 @ 7:00 AM Companies mentioned in this article: Verizon \nBASKING RIDGE, N.J., Oct. 15, 2015 /PRNewswire/ -- A little more than five years ago, Verizon announced its LTE in Rural America (LRA) program with a simple vision: to help rural wireless companies across America drive innovation through advanced 4G LTE technology. \nThe benefits were obvious. Wireless companies in rural areas of the country would get access to Verizon's valuable 700MHz spectrum, leverage Verizon's advanced core networking technology, gain from the expertise offered by its seasoned engineering teams, and forge mutual roaming relationships - while less-populated parts of America could experience the innovation that is driven by emerging technologies like 4G LTE. \nThat vision is now reality. Verizon announced today that all 21 program participants have launched 4G LTE service. The company and its partners have fully met their original goal of deploying 4G LTE technology and spectrum across rural counties in 15 states. \n\"The LRA program has positively impacted the lives of Americans from Maine to Alaska, and we're very proud to be a part of that,\" said Philip Junker, executive director of strategic alliances at Verizon and a leader of the LRA program. \"Verizon has always been a responsible steward of spectrum resources. We had a vision of partnering with the rural carrier community, we put our resources behind that vision, and we delivered what we promised for our customers.\" \nVerizon's LRA program offers scope and scale economies to rural wireless companies through a comprehensive 4G LTE enablement system involving spectrum, roaming, core network services, IT integration, device specification/certification and technology collaboration. Here's what the program has accomplished to date: -- 225,000 square miles of Verizon's spectrum is leased by LRA participants across 169 rural counties in 15 states -- 1,000+ 4G LTE cell sites have been activated, covering an area larger than Colorado -- 2.7 million people are covered by those cells sites -- More than 50 wireless devices have been certified, including smartphones, tablets and connected devices \nBest of all, LRA participants are using advanced 4G LTE technology in unique ways and unique places, such as: -- Paducah & Louisville Railway -Installing a traditional telephone wireline data circuit to track the location of trains in often idyllic but very remote areas of the country can be costly and challenging. However, advances in wireless technology are helping make connections possible in Kentucky and other rural areas. -- Heartland Medical - The Heartland Mobile Health unit from Montgomery County Memorial Hospital (MCMH) serves a large rural expanse of Iowa with very few doctors. If not for the mobile clinic, many residents would have to drive long distances, delay their routine visits or perhaps skip altogether important primary, preventive and other crucial care. -- Coaches Aid - High school sports are a vital part of many rural communities, but life circumstances can get in the way of watching live - for example, grandparents who live two states away, or a father serving in the military overseas. The reasons people can't attend are numerous, but the Verizon Wireless LTE in Rural America (LRA) program helps in providing fans access to the game. -- KMA Broadcasting - In the rural farming communities of Southwest Iowa, getting the latest news about weather can mean the difference between a profitable growing season and a year in the red. And when the National Weather Service issues a severe weather alert, KMA Broadcasting often is the first place local residents learn about it, thanks to 4G LTE. \nTo date participants in Verizon's LRA program have certified over 50 wireless devices, including smartphones, tablets and connected devices. \nCurrent LRA participants include Bluegrass Cellular; Cross Telephone; Pioneer Cellular; Cellcom; Thumb Cellular; Strata Networks; S and R Communications; Carolina West; Custer Telephone Cooperative; KPU Telecommunications; Chariton Valley Communication Corporation; Appalachian Wireless; Northwest Missouri Cellular; Chat Mobility; Matanuska Telephone Association; Wireless Partners; Triangle Communications; Nemont; Mid-Rivers Communications and Copper Valley Telecom. \nFor a visual illustration of the first five years of Verizon's LRA program, click here . \nVerizon Communications Inc. (NYSE, Nasdaq: VZ), headquartered in New York, employs a diverse workforce of 178,500 and generated more than $127 billion in 2014 revenues. Verizon Wireless operates America's most reliable wireless network, with 109.5 million retail connections nationwide. Verizon also provides converged communications, information and entertainment services over America's most advanced fiber-optic network, and delivers integrated business solutions to customers worldwide. For more information, visit www.verizon.com/news/ . \nVERIZON'S ONLINE NEWS CENTER: Verizon news releases, executive speeches and biographies, media contacts and other information are available at Verizon's online News Center at www.verizon.com/news / . The news releases are available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds /. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/wireless-milestone-reached-in-rural-america-300160398.html \nSOURCE Verizon", "external_links": [], "published": "2015-10-15T17:00:00.000+03:00", "crawled": "2015-10-15T18:26:29.460+03:00", "highlightTitle": ""}