{"organizations": [], "uuid": "42de2b6a677d28b08ba44f0990fd3ce40f02c58a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/17-scientistsid.jpg", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-scientists-molecular-mechanism-early.html", "country": "US", "title": "Scientists identify molecular mechanism behind early flowering", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Scientists identify molecular mechanism behind early flowering", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:24:00.000+03:00", "replies_count": 0, "uuid": "42de2b6a677d28b08ba44f0990fd3ce40f02c58a"}, "author": "", "url": "http://phys.org/news/2015-10-scientists-molecular-mechanism-early.html", "ord_in_thread": 0, "title": "Scientists identify molecular mechanism behind early flowering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["U. Lutz"], "text": "Scientists identify molecular mechanism behind early flowering October 23, 2015 The scientists discovered a molecular mechanism that causes Scottish thale cress to flower two weeks earlier than its counterparts in warmer regions. Credit: U. Lutz \nPlants adapt their flowering time to the temperature in their surroundings. But what exactly triggers their flowering at the molecular level? Can this factor switch flowering on or off and thus respond to changes in the climate? In a study currently published in PLOS Genetics , a team headed by Professor Claus Schwechheimer from the Technical University of Munich (TUM) describes a molecular mechanism with which plants adapt their flowering time to ambient temperatures and thereby indicate ways in which the flowering time can be predicted on the basis of genetic information. \nPlants adapt their flowering time to the temperature in their surroundings. To flower at the optimal time, they take factors like temperature, day length and temperature fluctuations into account. Although the mechanisms that cause flowering before and after winter are largely known by now, relatively little is known about how plants delay their flowering time during a cold spring. Such processes are very important, particularly in regard of global warming with relatively small fluctuations in temperature, as the correct flowering time guarantees optimum arable yields for farmers - and also ensures that the thale cress Arabidopsis thaliana prevails in the everyday evolutionary struggle for survival. \nCrucial gene for early flowerers \nIn the current edition of the journal PLOS Genetics , the team, headed by Professor Claus Schwechheimer from TU Munich in close cooperation with colleagues from the German Research Center for Environmental Health (Helmholtz Zentrum Neuherberg) and the Max Planck Institute in Tübingen, describe the molecular mechanism with which the thale cress Arabidopsis thaliana adapts its flowering time to the ambient temperature. Interestingly, the first indication of the existence of this natural gene variation came from the cool latitudes of Scotland. This led the scientists to discover a molecular mechanism that causes Scottish thale cress to flower two weeks earlier than its counterparts in warmer regions. Due to the insertion of a so-called jumping gene (transposon), the formation of the crucial flowering gene was so minimal that the function of the flowering repressor no longer had any effect. Result of a DNA sequence analysis as it could be used to identify gene variants. The coloured curves represent the four different bases/nucleic acids that form the DNA strand. Credit: C. Schwechheimer/ TUM \nAnd that's not all: Ulrich Lutz, first author of the study, was also able to show that this gene mutation has already become established in several other variants of the thale cress and controls flowering behavior in them. The researchers were even able to trace their steps here and predict the flowering behavior of the thale cress based on the presence of the jumping gene (transposon) with a high degree of accuracy. Already in the near future, it should be possible to transfer this knowledge to the flowering behavior of crop plants like rapeseed. \nResearch helps estimate the ecological consequences of climate change \n\"Our research will help to enable the estimation of the ecological consequences of climate change ,\" says Professor Schwechheimer. \"Climate change will bring about a change in the flowering behavior of many plants. We researchers must gain a better understanding of the impacts of this temperature change on the world of plants and the organisms that depend on them.\" \nPlants react to the experience of a long cold winter and to extended cold periods in spring by delaying their flowering time. The molecular mechanisms with which plants perceive these cold periods differ, however. In the case of winter cereals, like winter wheat, the seed can germinate in autumn but the plant does not flower, as it needs the experience of winter to act as a wake-up call indicating that the correct time for flowering has come. \nThe genes that regulate this process are already known in many plants. In spring wheat, for example, they have been modified by conventional breeding that the plant flowers even if it is planted in spring. The temperatures in a cool or warm spring also affect flowering behavior; however, very little is known about this. Given that small changes of just a few degrees Celsius can have a negative impact on agricultural production, it is important to understand these processes. \nThe findings of the research team from the TUM Chair of Plant Systems Biology could help with the prediction and even modification of plant flowering time in the future. Such insights are also important for plant breeding to ensure that food production can be guaranteed in the long term in the context of progressive global warming.", "external_links": [], "published": "2015-10-23T19:24:00.000+03:00", "crawled": "2015-10-23T19:26:17.945+03:00", "highlightTitle": ""}