{"organizations": [], "uuid": "f3908eb64afa53ff1efa4a69c9f0ed234da8bfef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/3d-scans-spot-earliest-signs-heart-disease", "country": "US", "title": "3D Scans Spot Earliest Signs of Heart Disease", "performance_score": 0, "site": "mdtmag.com", "participants_count": 2, "title_full": "3D Scans Spot Earliest Signs of Heart Disease", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 1, "uuid": "f3908eb64afa53ff1efa4a69c9f0ed234da8bfef"}, "author": "MRC Clinical Sciences Centre/Institute of Clinical Sciences (ICS) Faculty of Medicine, Imperial College London", "url": "http://www.mdtmag.com/news/2015/10/3d-scans-spot-earliest-signs-heart-disease", "ord_in_thread": 0, "title": "3D Scans Spot Earliest Signs of Heart Disease", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Researchers have shown that people with high blood pressure develop changes in their hearts even before symptoms appear.\nThese changes are known to put people at risk of dying early, and the new work suggests it is possible for doctors to recognize such signs of heart disease earlier than they can today - by examining detailed images of the heart.\nThe scientists, from the MRC's Clinical Sciences Centre based at Imperial College London, used specialized MRI scans to create a 3D map of the hearts of 1,500 people. They then used the latest computer technology to explore each person’s heart to establish the precise changes in its shape and function - the effects of increasing blood pressure.\nContours modelled in 3D and shown in deeper red are those where high blood pressure is thought to cause most harm. This revealed that even in healthy adults a small increase in blood pressure led to thickening of the heart muscle that is known to be a risk-factor for premature death.\nHigh blood pressure affects 16 million people in the UK and causes 62,000 preventable deaths from stroke and heart attack. It rarely has any symptoms and the only way for people to know if they have the condition is to have their blood pressure measured.\nLead author for the study, Dr. Declan O’Regan says, “New 3D imaging technology lets researchers look at the living heart in amazing detail. The risk of high blood pressure is well known, but these scans show the earliest signs of damage to the heart may begin in completely healthy people. This suggests that any increase in our blood pressure may put greater strain on the heart.”\nDr. Antonio de Marvao, first author, says, “This new research will enable doctors to recognize signs of heart disease at a much earlier stage than has previously been possible. High blood pressure is often called the ‘silent killer’, and we can now see that its effects start much earlier and affect more people than previously thought.”\nThe next step, the researchers say, is to look for any genetic differences between those people who develop the changes in their hearts that suggest a raised risk of developing heart disease, and people who do not develop such changes.", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T23:49:10.866+03:00", "highlightTitle": ""}