{"organizations": ["MOOC Missions U Michigan Scales"], "uuid": "4ade9aebb67edaa77c6e326e6e7893a90ace50e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "campustechnology.com", "main_image": "", "site_section": "http://campustechnology.com/rss-feeds/all-articles.aspx", "section_title": "Campus Technology: All Articles", "url": "https://campustechnology.com/articles/2015/10/07/u-michigan-scales-up-mooc-missions.aspx", "country": "US", "title": "U Michigan Scales up MOOC Missions", "performance_score": 0, "site": "campustechnology.com", "participants_count": 0, "title_full": "U Michigan Scales up MOOC Missions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T14:00:00.000+03:00", "replies_count": 0, "uuid": "4ade9aebb67edaa77c6e326e6e7893a90ace50e1"}, "author": "", "url": "https://campustechnology.com/articles/2015/10/07/u-michigan-scales-up-mooc-missions.aspx", "ord_in_thread": 0, "title": "U Michigan Scales up MOOC Missions", "locations": ["Michigan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dian Schaffhauser"], "text": "U Michigan Scales up MOOC Missions By Dian Schaffhauser 10/07/15 \nThe University of Michigan is expanding its MOOC presence. The institution, which was a founding partner in Coursera , will now be offering its massive, open, online courses on edX too, the first to begin in April 2016. The university also has ties to a third MOOC platform, NovoEd , which runs both educator and corporate operations. \nUnder the edX agreement, U Michigan will launch \" MichiganX ,\" and promises to deliver \"at least\" 20 courses on the platform over the next two years. Three of the early ones will cover finance, learning analytics and data science ethics. The institution is also anteing up on Coursera at the same time, asserting that it will grow from 20 MOOCs on that platform to \"more than 50\" by December. \nA major appeal of the edX platform, however, noted the school, was its open source nature. \n\"This new partnership aligns closely with our mission and values. Our core commitment is about experimenting, learning and adapting in order to shape the future of higher education,\" said James Hilton, vice provost for the Office of Digital Education & Innovation (DEI), in a prepared statement. \"EdX and Coursera provide very different models with different sweet spots for experimentation. We are thrilled that our faculty will be able to take advantage of both platforms to push the boundaries of discovery.\" \nJames DeVaney, associate vice provost in that same division, said the university has already reached 3.6 million learners through MOOCs since 2012. \"If we continue to harness the best technology and deepen our use of learning analytics, we know the ripple effect of Michigan's academic excellence and alumni network will be felt around the world.\" \nThe first new course will be \" Finance for Everyone: Smart Tools for Decision-Making ,\" launched on April 5 and taught by Gautam Kaul, professor of finance in the school of business. That lasts for six weeks and is expected to take five to six hours of \"effort\" each week. A verified certificate will be available for $49 to students who successfully complete the class. \nKaul, who serves as DEI's first \"Innovator in Residence,\" has become a proponent of MOOCs for online learners and students on campus. \"With the help of strategic investments U-M has made in digital learning, I've been able to reach nearly a million global learners through MOOCs while transforming the way I engage students on campus. I'm excited to experiment with the edX platform to continue our quest to redefine residential learning.\" \nA second new course will focus on learning analytics and will be taught by Timothy McKay, a professor of physics and astronomy and a DEI \"Academic Innovation Fellow.\" McKay's experiences with personalized learning in his physics classes have influenced other courses at the university. Now he'll have the chance to experiment with personalization \"at scale,\" he said. \"With edX, we will continue to employ personalization and learning analytics to improve the effectiveness of student learning, our teaching and the design of courses and curricula.\" \nA third course will address data science ethics, specifically to help learners \"think about the ethical questions surrounding the use, integration and analysis of data,\" said H V Jagadish, a professor of electrical engineering and computer science, who will be teaching the program. \nNeither of the latter two courses has been added to the edX catalog yet. About the Author \nDian Schaffhauser is a writer who covers technology and business for a number of publications. Contact her at dian@dischaffhauser.com .", "external_links": [], "published": "2015-10-07T14:00:00.000+03:00", "crawled": "2015-10-09T06:47:20.047+03:00", "highlightTitle": ""}