{"organizations": [], "uuid": "c9a2db8e6eff045e2f7fcc0ffff31a6fbb5659de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/1014fbf2ad40a8085ec24586b52fb827", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_tech_506.xml", "section_title": "NEWS.com.au | Technology News", "url": "http://www.news.com.au/technology/online/the-amazing-spider-man-1-has-transformed-the-teenager-crime-fighter-into-an-adult-entrepreneur/story-fnjwnhzf-1227566582750?from=public_rss", "country": "IL", "title": "Spider-Man will never be the same again", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Spider-Man will never be the same again", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T11:28:00.000+03:00", "replies_count": 0, "uuid": "c9a2db8e6eff045e2f7fcc0ffff31a6fbb5659de"}, "author": "", "url": "http://www.news.com.au/technology/online/the-amazing-spider-man-1-has-transformed-the-teenager-crime-fighter-into-an-adult-entrepreneur/story-fnjwnhzf-1227566582750?from=public_rss", "ord_in_thread": 0, "title": "Spider-Man will never be the same again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Spider-Man"], "text": "Email a friend \nTHERE has always been a certain charm about Peter Parker and his alter-ego Spiderman. \nAs one of Marvel’s most popular and commercially successful superheroes, generations have grown up enthralled by the teenager turned web-slinging crime-fighter. \nHowever, Marvel’s recent relaunch of The Amazing Spider-Man will change everything you know and love about the superhero in a big, big way. \nIn first issue of the revamped comic book series, the now grown-up Peter Parker is reintroduced to the world as the founder and CEO of Parker Industries — a global consumer tech company marketing products to SHIELD and the wider public. \nFollowing in the footsteps of Iron Man’s Tony Stark and Batman’s Bruce Wayne, Parker tries to strike a balance between world-famous entrepreneur and masked superhero. \nHowever, unlike his Marvel counterpart, Iron Man , Parker still tries to keep his alter-ego hidden from the world. \nTo achieve this, he creates the illusion that Spider-Man is a separate identity acting as his personal bodyguard/spokesman for his company. \nWith more money and resources available, Spider-Man has also been able develop a new suit designed with some serious technological advancements. \nNot that he really needs them, given the web-slinger now uses a militarised car — similar to the Batmobile — to patrol the streets, as opposed to watching from the top of buildings. The cover of The Amazing Spider-Man #1. Take note of his new wheels. \nIn addition, Spider-Man moves away from solely protecting the good people of New York, with The Amazing Spider-Man #1 seeing the superhero fighting crime in Shanghai and London. \nAmid the mayhem, the progressive superhero even finds time to attend a same-sex marriage in San Fransisco. \nWhile these huge changes might be met with trepidation from fans, The Amazing Spider-Man writer Dan Slott is confident they were needed to bring the franchise forward. \n“He’s grown. He’s become the Peter Parker we’ve always hoped he was going to be,” he told MTV . \n“He’s going to be a far more global Spider-Man , and with that is going to come all new global threats. Things that will really test Spider-Man like never before.” \nMr Slott said despite brining the story forward, the basis of the Spider-Man comic was still the same. \n“He’s Peter Parker — one of the greatest characters in this history of all fiction. He’s the same guy that Stan Lee and Steve Ditko introduced us to in Amazing Fantasy #15 ,” he told Comic Book Resources . \n“It’s really about taking great power and great responsibility as far as he possibly can. It’s not about trying to be your friendly, neighbourhood Spider-Man . It’s about being the hero the world needs.” \nAmazing Spider-Man #1 is on sale now from Marvel Comics .", "external_links": [], "published": "2015-10-12T11:28:00.000+03:00", "crawled": "2015-10-12T14:49:37.097+03:00", "highlightTitle": ""}