{"organizations": [], "uuid": "9ed288200225ad4d378acf021d24087686de0533", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stockhouse.com", "main_image": "", "site_section": "http://www.stockhouse.com/discovery/technology", "section_title": "The Technology Report - Technology investor news and research center ", "url": "http://www.stockhouse.com/news/press-releases/2015/10/22/youku-tudou-special-committee-engages-financial-advisor-and-legal-counsel", "country": "US", "title": "Youku Tudou Special Committee Engages Financial Advisor and Legal Counsel", "performance_score": 0, "site": "stockhouse.com", "participants_count": 1, "title_full": "Youku Tudou Special Committee Engages Financial Advisor and Legal Counsel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "9ed288200225ad4d378acf021d24087686de0533"}, "author": "stockhouse.com", "url": "http://www.stockhouse.com/news/press-releases/2015/10/22/youku-tudou-special-committee-engages-financial-advisor-and-legal-counsel", "ord_in_thread": 0, "title": "Youku Tudou Special Committee Engages Financial Advisor and Legal Counsel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING , Oct. 22, 2015 /PRNewswire/ -- Youku Tudou Inc. (NYSE: YOKU), a leading multi-screen entertainment and media company in China (\"Youku Tudou\" or the \"Company\"), today announced that the independent special committee of the Company's Board of Directors (the \"Special Committee\") has retained J.P. Morgan Securities ( Asia Pacific ) Limited as its financial advisor, Skadden, Arps, Slate, Meagher & Flom LLP as its U.S. legal counsel and Conyers Dill & Pearman as its Cayman Islands legal counsel in connection with its review and evaluation of the nonbinding proposal, dated October 16, 2015 , from Alibaba Group Holding Limited (\"Alibaba\") for a \"going-private\" transaction in which it would acquire all of the outstanding ordinary shares of the Company, including ordinary shares represented by American depositary shares (each representing 18 ordinary shares of the Company), that are not owned by Alibaba.\nThe board of directors cautions the Company's shareholders and others considering trading in its securities that no decision has been made on the response to the proposal. There can be no assurance that any definitive offer will be made, that any agreement will be executed or that this or any other transaction will be approved or consummated. The Company does not undertake any obligation to provide any updates with respect to this or any other transaction, except as required under applicable law.\nAbout Youku Tudou Inc.\nYouku Tudou Inc. (NYSE: YOKU) is a leading multi-screen entertainment and media company in China . Youku Tudou is China's leading Internet television platform, enabling users to search, view and share high-quality video content quickly and easily across multiple devices. Its Youku brand and Tudou brand are among the most recognized online video brands in China . Youku Tudou's American depositary shares, each representing 18 of Youku Tudou's Class A ordinary shares, are traded on the NYSE under the symbol \"YOKU.\"\nSafe Harbor Statement\nThis announcement contains forward-looking statements. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"may,\" \"intend,\" \"confident,\" \"is currently reviewing,\" \"it is possible,\" \"subject to\" and similar statements. Youku Tudou may also make written or oral forward-looking statements in its reports filed or furnished with the U.S. Securities and Exchange Commission, including Forms 20-F and 6-K, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including statements about Youku Tudou's beliefs and expectations, are forward-looking statements and are subject to change. Forward-looking statements involve inherent risks and uncertainties. A number of important factors could cause actual results to differ materially from those contained, either expressly or impliedly, in any of the forward-looking statements in this press release. Potential risks and uncertainties are outlined in Youku Tudou's filings with the U.S. Securities and Exchange Commission. All information provided in this press release is current as of the date of this press release, and Youku Tudou does not undertake any obligation to update any such information, except as required under applicable law.\nFor more information, please contact:\nRyan Cheung\nVice President, Finance\nYouku Tudou Inc.\nTel: (+8610) 5890-6883\nEmail: [email protected]\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/youku-tudou-special-committee-engages-financial-advisor-and-legal-counsel-300164659.html\nSOURCE Youku Tudou Inc.\nPR Newswire October 22, 2015 - 9:15 AM EDT Tags: INTERNET CONTENT &AMP; INFORMATION TECHNOLOGY", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CN35662&Transmission_Id=201510220915PR_NEWS_USPR_____CN35662&DateId=20151022", "http://www.prnewswire.com/news-releases/youku-tudou-special-committee-engages-financial-advisor-and-legal-counsel-300164659.html"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T17:09:49.691+03:00", "highlightTitle": ""}