{"organizations": [], "uuid": "14d582be4eed45f7e75c18da8605db2b5b06bb98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/2015/10/prweb13014400.htm", "country": "US", "title": "Campaign Encourages National Dialogue on Youth Mental Health with Text-Enabled Events in October & November", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Campaign Encourages National Dialogue on Youth Mental Health with Text-Enabled Events in October & November", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "14d582be4eed45f7e75c18da8605db2b5b06bb98"}, "author": "Jeffrey Salzgeber", "url": "http://www.prweb.com/releases/2015/10/prweb13014400.htm", "ord_in_thread": 0, "title": "Campaign Encourages National Dialogue on Youth Mental Health with Text-Enabled Events in October & November", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Text, Talk, Act\" Program Commemorates Mental Illness Awareness Week by Hosting Text-Enabled Mental Health Events to Reach Teens & Young Adults The campus tragedies that occurred this week and last week in Houston, Northern Arizona and Oregon have, once again, brought mental health issues to the forefront of the nation’s consciousness. But such high profile incidents are not the only story. The reality is that there are many mental health stories, in every community, sometimes very close to home. The majority of people struggling with mental health issues do not resort to violence, and instead are more likely to have acts of violence happen against them.\nMental health can be one of the most difficult topics to bring up, but it’s also one of the most important. Given that one in four Americans struggles with mental health issues, and three-fourths of all such problems arise between the ages of 14 and 24, it’s crucial that young people know they’re not alone, learn to talk openly about mental health and seek help as early as possible.\nThat’s why Creating Community Solutions, powered by the National Institute for Civil Discourse, Everyday Democracy, the Deliberative Democracy Consortium and a coalition of other advocacy groups, is launching a unique, text-enabled mental health awareness campaign called \"Text, Talk, Act.\" Launched during the National Alliance on Mental Health (NAMI)’s Mental Illness Awareness Week, the national initiative is designed to reach young people right where they live, through the use of mobile technology and social media, combined with face-to-face conversation and community organizing. Campaign officials hope that \"Text, Talk, Act\" will facilitate conversation, reduce stigma and teach young people how to get and give help, when necessary.\n“The right words at the right time can, literally, change a life,” said Raquel Goodrich, Director of Digital Communications, National Institute for Civil Discourse. “That’s why we want to empower teens and young adults to step up, contribute to the conversation and, ultimately, help formulate community solutions to issues of mental health diagnosis and treatment.”\n\"Text, Talk, Act\" will host nationwide events throughout the months of October and November. The events will use text messaging to help participants have candid discussions on mental health. (People who don’t have a group with them on those dates but want to participate can join the discussion on Twitter using #TextTalkAct.)\nHere’s how it works: Participants gather at any time, in either month, in small groups (3-4 people) with one cell phone per group. They text the word “START” to the number 89800* and receive a series of text messages that guide the group through a conversation on mental health. The campaign’s text messages provide prompts about topics such as why talking about mental health is important and how to help a friend in need. The messages include videos, social media interactions, and a series of questions, some of which invite participants to text in ideas on how individuals and communities can improve mental health. As the conversation comes to a close, participants receive links to resources to continue the conversation and/or seek help.\nTeens and young adults or anyone who lives or works with young people—parents, teachers, coaches, community, church leaders, and others—are encouraged to participate in a \"Text, Talk, Act\" event. The anonymous data collected from participant responses during the event can be made available to schools and communities. What’s more, \"Text, Talk, Act\" will synthesize and leverage participants’ input to inform the media and policymakers about the aspirations and needs of young people regarding mental health. The community events are an opportunity for young people to have their voices heard and, hopefully, influence how decision-makers think about the policies and programs they recommend.\nOrganizers of \"Text, Talk, Act\" events can win $1,000 prizes for their schools or community organizations. The campaign provides all of the materials needed to organize an event.\nPrevious participants reported \"Text, Talk, Act\" to be convenient, flexible and easy-to-follow and have indicated that the conversations it inspired were quite meaningful. What’s more, over 90 percent of respondents to follow-up surveys reported an increase in understanding of mental health issues, and over 65 percent reported that they were more comfortable talking about mental health.\n“'Text, Talk, Act' really helped me to feel more comfortable talking about mental health,” said Krystal Roach, a student at Coppin State University in Baltimore. “In the past, when the subject came up or situations arose, I never really knew how to address it. But after going through the guided conversation, I feel like I’m better prepared to notice if a friend or family member is struggling and to step up to help.”\nFor more information on \"Text, Talk, Act\" and how to start the change in your school or community, visit http://creatingcommunitysolutions.org/texttalkact .\nTo see how \"Text, Talk, Act\" works, please visit:\nhttps://youtu.be/gGuDncbUYoY\nOfficial partners of \"Text, Talk, Act\" include: Active Minds, Each Mind Matters, National Association of School Psychologists, and the American School Counselor Association. Promotional partners of \"Text, Talk, Act\" are Youth M.O.V.E. National, the Jed Foundation, Mental Health America, Crisis Text Line, School Social Work Association of America, Entertainment Industry Council, Populove the American Association of Suicidology, American Indian College Fund, Public Conversations Project, Crisis Response Network, National Campus Leadership Council and Screening for Mental Health.\n*For participants from Canada or whose phones can’t use short codes, use 7785881995", "external_links": ["https://youtu.be/gGuDncbUYoY", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2NyZWF0aW5nY29tbXVuaXR5c29sdXRpb25zLm9yZy90ZXh0dGFsa2FjdA==", "http://creatingcommunitysolutions.org/texttalkact", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly95b3V0dS5iZS9nR3VEbmNiVVlvWQ=="], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T22:45:28.815+03:00", "highlightTitle": ""}