{"organizations": [], "uuid": "474ae48667f8ce871b76b81866564f15989ddd8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3262940.1444326122!/fileImage/httpImage/image.png_gen/derivatives/16x9_1180/pluto-blue-sky.png", "site_section": "http://rss.cbc.ca/lineup/technology.xml", "section_title": "CBC | Technology News", "url": "http://www.cbc.ca/news/technology/pluto-blue-sky-water-ice-1.3262924?cmp=rss", "country": "IL", "title": "New Horizons spacecraft finds blue skies, frozen water on Pluto", "performance_score": 1, "site": "cbc.ca", "participants_count": 1, "title_full": "New Horizons spacecraft finds blue skies, frozen water on Pluto", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:30:00.000+03:00", "replies_count": 0, "uuid": "474ae48667f8ce871b76b81866564f15989ddd8d"}, "author": "CBC News", "url": "http://www.cbc.ca/news/technology/pluto-blue-sky-water-ice-1.3262924?cmp=rss", "ord_in_thread": 0, "title": "New Horizons spacecraft finds blue skies, frozen water on Pluto", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Horizons spacecraft finds blue skies, frozen water on Pluto Ice's red colour and blue skies both caused by chemicals called tholins CBC News Posted: Oct 08, 2015 3:30 PM ET Last Updated: Oct 08, 2015 3:30 PM ET The blue halo of Pluto's atmospheric haze stands out in the newest colour photos sent home by the New Horizons spacecraft. (NASA/JHUAPL/SwRI) Related Stories NASA - New Horizons (Note: CBC does not endorse and is not responsible for the content of external links.) \nIf you stood on the surface of Pluto, you'd be looking up at a blue sky, just like on Earth. \nThe blue halo of Pluto's atmospheric haze stands out in the newest colour photos sent home by the New Horizons spacecraft. \n\"Who would have expected a blue sky in the Kuiper Belt? It's gorgeous,\" said Alan Stern, principal investigator of New Horizons, in statement accompanying the release of the photo Thursday afternoon. NASA picks Pluto spacecraft New Horizons' latest destination \nThe Kuiper belt is a region beyond Neptune full of thousands of icy bodies such as Pluto and its moons. \nThe latest data sent back by the New Horizons spacecraft also shows patches of frozen water exposed on Pluto's surface. Previously, most of the ice detected on Pluto's surface has been made of gases such as methane or nitrogen that have colder melting points and tend to sublime and recondense more on Pluto's cold surface. Regions with exposed water ice are highlighted in blue in this composite image captured by New Horizons. The scene is approximately 450 kilometres (280 miles) across. (NASA/JHUAPL/SwRI) \nInterestingly, the frozen water corresponds to areas on Pluto's surface that are a colour not normally associated with water or ice. \n\"I'm surprised that this water is so red,\" said Silvia Protopapa , a member of the New Horizons science team from the University of Maryland, College Park. \nShe suggested the colour was due to chemical compounds called tholins , but said researchers don't yet know how they're related to the water. \nAs for the blue colour of the sky, researchers think they know where that comes from – the haze particles in Pluto's atmosphere are the right size and composition to scatter the blue light in sunlight. While the particles that scatter light in Earth's atmosphere are nitrogen, on Pluto they're the same tholins that make the surface red. \nTholins , which don't form naturally on Earth, are complex organic molecules formed high in Pluto's atmosphere from nitrogen and methane when they're broken apart by ultraviolet light. They stick together into large particles that eventually get coated with ice and \"snow\" down to the surface. The location of the frozen water corresponds to areas on Pluto's surface that are a colour we don't normally associate with water or ice - red. (NASA/JHUAPL/SwRI) \nNew Horizons became the first spacecraft to make a close flyby of Pluto and its moons in July. The images and data that it captured during the flyby are slowly being sent back to Earth over many months. NASA typically releases new images every Thursday.", "external_links": [], "published": "2015-10-08T22:30:00.000+03:00", "crawled": "2015-10-09T02:21:07.528+03:00", "highlightTitle": ""}