{"organizations": ["VW"], "uuid": "e4c2604d8e25588e3bd8b486c05cf08bfab3e843", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-vw-compensate-owners-diesel-cars.html", "country": "US", "title": "VW may compensate owners of diesel cars for loss of value", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "VW may compensate owners of diesel cars for loss of value", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:30:00.000+03:00", "replies_count": 0, "uuid": "e4c2604d8e25588e3bd8b486c05cf08bfab3e843"}, "author": "", "url": "http://phys.org/news/2015-10-vw-compensate-owners-diesel-cars.html", "ord_in_thread": 0, "title": "VW may compensate owners of diesel cars for loss of value", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Krisher"], "text": "VW may compensate owners of diesel cars for loss of value October 8, 2015 by By Tom Krisher \nVolkswagen could compensate owners of diesel-powered cars that emit high levels of pollutants, possibly by paying them for the lost value of their vehicles, the company's top U.S. executive said Thursday. \nSpeaking to lawmakers investigating the emissions cheating, U.S. CEO Michael Horn also said fixing most of the 500,000 affected cars in the U.S. could take one to two years, possibly more. The fix, he said, would not hurt fuel mileage, but it could hinder the cars' performance, knocking one or two miles-per-hour off the top speed. \n\"There might be a slight impact on performance,\" Horn said to a subcommittee of the House Energy and Commerce Committee. \nUnder questioning from Rep. Jan Schakowsky, D-Ill., Horn said VW isn't considering offering owners loaner cars because the U.S. government says the diesels equipped with a so-called defeat device are safe to drive. The cars, though, emit 10 to 40 times the nitrogen oxide pollution that's allowed under federal law. \nVW has admitted to installing the defeat devices on Volkswagen and Audi cars with four-cylinder diesel engines dating to the 2009 model year. The devices switch on pollution controls when the cars are being tested, but turn off the controls when the software determines that the cars are back on real roads. Affected models include the Jetta, Golf, Beetle, Passat and Audi A3. VW has said a total of 11 million cars worldwide have the software worldwide. \nHorn said software changes alone will work to fix newer models, but 430,000 cars dating to 2009 will need mechanical repairs that are still being developed. Horn said engineers are working on either a larger catalytic converter that would treat nitrogen oxide, or a system that injects a chemical called urea into the exhaust. \nSoftware alone will repair some newer Passat models, but they may need an additional sensor, Horn said. He didn't have an exact timeline on when the repairs might take place, but said it could take multiple years to develop the fix, get government approval and distribute parts to the company's U.S. dealers. The fixes may take five to 10 hours per car for dealership mechanics to complete, he said. \nVW has set aside $7.3 billion to pay for the scandal, but Horn said he is unsure if that will be enough. Ultimately, the total cost will depend on fines from government agencies, how much it costs to fix the cars and the price tag for any compensation to customers. Q&A: A look at Volkswagen's emissions crisis September 22, 2015 \nGerman automaker Volkswagen AG admits that it rigged U.S. emissions tests so it would appear that its diesel-powered cars were emitting fewer nitrogen oxides, which can contribute to ozone buildup and respiratory illness. ... Sell, sue or stay put: considerations for Volkswagen owners September 25, 2015 \nIf you're driving a diesel-powered four-cylinder Volkswagen, you're stuck with a fun-to-drive machine that's belching unhealthy pollutants from its tailpipe. VW faces daunting challenges in fixing emissions cheating September 28, 2015 \nVolkswagen faces daunting challenges in fixing software that enables cheating on diesel engine emissions tests, a task that's becoming more urgent because of growing anger from customers. Senate panel probing VW's use of tax credits October 6, 2015 \nThe Senate Finance Committee opened a probe Tuesday into Volkswagen's use of a federal tax credit intended for fuel-efficient cars as the company's emissions-rigging scandal widened. VW's US CEO to face tough questions in congressional hearing October 8, 2015 \nVolkswagen's top U.S. executive is expected to face tough questions on Capitol Hill as the emissions-rigging scandal enveloping the world's largest automaker appears to be deepening. VW executive: Any fix for car owners could take year or more October 8, 2015 \nVolkswagen's top U.S. executive apologized Thursday as the emissions-rigging scandal engulfing the world's largest automaker deepened and members of Congress said the company violated the public's trust. Recommended for you Bio-inspired robotic finger looks, feels and works like the real thing (w/ Video) October 8, 2015 \nMost robotic parts used to today are rigid, have a limited range of motion and don't really look lifelike. Inspired by both nature and biology, a scientist from Florida Atlantic University has designed a novel robotic finger ... Remote Mexican village uses solar power to purify water October 8, 2015 \nDeep in the jungles of the Yucatan peninsula, residents of the remote Mexican village of La Mancalona are producing clean drinking water using the power of the sun. Researcher explores cost-effective, non-polluting enhanced geothermal systems October 8, 2015 \nTapping the natural heat of the earth may be more cost-effective and clean thanks to a research project by New Mexico State University Assistant Professor Kenneth C. Carroll and others. IROS 2015: Thermobot feels the heat and walks (and walks) October 7, 2015 \nTakeru Nemoto and Akio Yamamoto of University of Tokyo have presented a bipedal walking robot which is driven by constant heating. No sensors. No actuators, said Even Ackerman in IEEE Spectrum. Just a hot surface will do ... Two years of tests confound two decades of assumptions on lithium-ion battery design October 2, 2015 \nA Stanford undergraduate has contributed to a discovery that confounds the conventional wisdom in lithium-ion battery design, pointing the way toward storage devices with more power, greater capacity, and faster charge and ... Discovery about new battery overturns decades of false assumptions October 6, 2015 \nNew findings at Oregon State University have overturned a scientific dogma that stood for decades, by showing that potassium can work with graphite in a potassium-ion battery - a discovery that could pose a challenge and ...", "external_links": [], "published": "2015-10-08T22:30:00.000+03:00", "crawled": "2015-10-08T22:32:26.927+03:00", "highlightTitle": ""}