{"organizations": [], "uuid": "205628b167f16e21f2d102c8d7c39bdf908db4fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Results-from-Phase-2-Trial-Investigating-Lenvatinib-in-Metastatic-Renal-Cell-Carcinoma-Published-in-The-Lancet-Oncology-49011-1/", "country": "US", "title": "Results from Phase 2 Trial Investigating Lenvatinib in Metastatic Renal Cell Carcinoma Published in The Lancet Oncology", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Results from Phase 2 Trial Investigating Lenvatinib in Metastatic Renal Cell Carcinoma Published in The Lancet Oncology", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:55:00.000+03:00", "replies_count": 0, "uuid": "205628b167f16e21f2d102c8d7c39bdf908db4fd"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Results-from-Phase-2-Trial-Investigating-Lenvatinib-in-Metastatic-Renal-Cell-Carcinoma-Published-in-The-Lancet-Oncology-49011-1/", "ord_in_thread": 0, "title": "Results from Phase 2 Trial Investigating Lenvatinib in Metastatic Renal Cell Carcinoma Published in The Lancet Oncology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY Results from Phase 2 Trial Investigating Lenvatinib in Metastatic Renal Cell Carcinoma Published in The Lancet Oncology ... WOODCLIFF LAKE N.J. Oct. 16 2015 /PRNewsw...The article Lenvatinib everolimus and the combination in patients ... Renal cell carcinoma accounts for 90% of all kidney cancers and appro...Based on the results of this Phase 2 study the U.S. Food and Drug Adm... http://feeds.bio-medicine.org/latest-medical-technology Date:10/16/2015 \nWOODCLIFF LAKE, N.J. , Oct. 16, 2015 /PRNewswire/ -- Results from an investigational Phase 2 clinical trial evaluating lenvatinib in combination with everolimus and lenvatinib and everolimus alone for the treatment of metastatic renal cell carcinoma (mRCC) were published online today ahead of print in The Lancet Oncology , a leading clinical oncology research journal. \nThe article, \"Lenvatinib, everolimus, and the combination in patients with metastatic renal cell carcinoma\" reports the results from the randomized, open-label, multi-center trial, which evaluated progression-free survival in patients treated with the combination (n=51), patients who received everolimus alone (n=50) and patients treated with lenvatinib monotherapy (n=52). \n\"Renal cell carcinoma accounts for 90% of all kidney cancers and approximately 25% of kidney cancer patients will have metastatic disease at diagnosis,\" said Robert Motzer , M.D., Memorial Sloan Kettering Cancer Center, New York , and a principal investigator of the study. \"We have made considerable progress in the treatment of this disease, but additional treatment options are needed to further extend disease control and patient survival.\" \nBased on the results of this Phase 2 study, the U.S. Food and Drug Administration (FDA) granted lenvatinib Breakthrough Therapy designation for patients with advanced or metastatic RCC who were previously treated with a vascular endothelial growth factor (VEGF)-targeted therapy. \nLenvatinib (available as LENVIMA™) is currently approved by the U.S. Food and Drug Administration for the treatment of locally recurrent or metastatic, progressive radioactive iodine-refractory differentiated thyroid cancer. The information discussed in this release presents an investigational use for lenvatinib. It is not intended to convey conclusions about efficacy and safety. There is no guarantee that the investigational use of this FDA-approved product will successfully complete clinical development or gain FDA approval. \n\"We are pleased that the results of this study have been published in The Lancet Oncology, as it is important that peer-reviewed research on treatments for metastatic renal cell carcinoma be made available to the medical community,\" said Kenichi Nomoto , Ph.D., President, Oncology Product Creation Unit at Eisai Inc. \"Eisai is committed to ongoing research of lenvatinib to potentially address unmet needs in cancer and offer new treatment options for patients.\" \nPatients in the study were previously treated with a VEGF-targeted therapy and randomized 1:1:1 to receive lenvatinib (18 mg once a day) and everolimus (5 mg once a day), lenvatinib (24 mg once a day) or everolimus (10 mg once a day). Nearly all patients (99%) had received one prior VEGF-targeted therapy, 1% had received two prior VEGF-targeted therapies, and 18% had received prior immunotherapy treatment. \nFor more information, visit www.thelancet.com/oncology . \nAbout Renal Cell Carcinoma \nRenal cell carcinoma (RCC), also known as kidney cancer, renal cell cancer or renal cell adenocarcinoma, is the most common type of kidney cancer, representing about 90% of cases in the United States . Renal cell carcinoma occurs when malignant cells are found in the lining of the tubules in the kidney. While RCC usually grows as a single tumor within a kidney, there may also be two or more tumors in one or both kidneys. In 2015, there will be approximately 61,560 new cases of kidney cancer and about 14,080 people will die from the disease. Approximately 25% of patients with kidney cancer will have metastases at diagnosis and the prognosis for these patients and other patients who develop metastases after diagnosis is poor. \nAbout Lenvatinib (available as LENVIMA™) \nLENVIMA is indicated for the treatment of patients with locally recurrent or metastatic, progressive, radioactive iodine-refractory differentiated thyroid cancer (DTC). Lenvatinib is not indicated for patients with metastatic renal cell carcinoma. \nLenvatinib, discovered and developed by Eisai, is a receptor tyrosine kinase (RTK) inhibitor that inhibits the kinase activities of vascular endothelial growth factor (VEGF) receptors VEGFR1 (FLT1), VEGFR2 (KDR), and VEGFR3 (FLT4). Lenvatinib also inhibits other RTKs that have been implicated in pathogenic angiogenesis, tumor growth, and cancer progression in addition to their normal cellular functions, including fibroblast growth factor (FGF) receptors FGFR1, 2, 3, and 4; the platelet derived growth factor receptor alpha (PDGFRα), KIT, and RET. Lenvatinib was approved under Priority Review designation for locally recurrent or metastatic, progressive, radioactive iodine-refractory differentiated thyroid cancer by the FDA in February 2015. Eisai was granted Orphan Drug Designation (ODD) for lenvatinib in various types of thyroid cancer in the United States , Japan , and Europe. \nImportant Safety Information \nWarnings and Precautions Hypertension reported in 73% of patients on LENVIMA vs 16% for placebo (44% vs 4% ≥grade 3). Blood pressure should be controlled prior to treatment. Withhold dose for grade 3 hypertension despite optimal antihypertensive therapy; resume at reduced dose when controlled at ≤grade 2. Discontinue for life-threatening hypertension. Cardiac dysfunction reported in 7% of patients on LENVIMA vs 2% for placebo (2% vs 0% ≥grade 3). Monitor for signs/symptoms of cardiac decompensation. Withhold for grade 3 cardiac dysfunction. Resume at reduced dose or discontinue based on severity and persistence of cardiac dysfunction. Discontinue for grade 4 cardiac dysfunction. Arterial thromboembolic events reported in 5% of patients on LENVIMA vs 2% for placebo (3% vs 1% ≥grade 3). Discontinue following an arterial thrombotic event. The safety of resuming LENVIMA after an arterial thromboembolic event has not been established, and LENVIMA has not been studied in patients who have had an arterial thromboembolic event within the previous 6 months. ALT and AST increases (≥grade 3) occurred in 4% and 5% of patients on LENVIMA vs 0% for placebo. Across clinical studies in which 1108 patients received LENVIMA, hepatic failure (including fatal events) was reported in 3 patients and acute hepatitis in 1 patient. Monitor liver function before initiation, then every 2 weeks for first 2 months, and at least monthly thereafter during treatment. Withhold dose for liver impairment ≥grade 3. Resume at reduced dose or discontinue based on severity/persistence of hepatotoxicity. Discontinue for hepatic failure. Proteinuria reported in 34% of patients on LENVIMA vs 3% for placebo (11% vs 0% ≥grade 3). Monitor for proteinuria before and during treatment. Withhold dose for ≥2 grams of proteinuria/24 hours. Resume at reduced dose when proteinuria is <2 gm/24 hours. Discontinue for nephrotic syndrome. Events of renal impairment reported in 14% of patients on LENVIMA vs 2% for placebo (3% vs 1% ≥grade 3). Withhold LENVIMA for grade 3 or 4 renal failure/impairment. Resume at reduced dose or discontinue, depending on severity/persistence of renal impairment. Events of gastrointestinal (GI) perforation or fistula reported in 2% of patients on LENVIMA vs 0.8% for placebo. Discontinue in patients who develop GI perforation or life-threatening fistula. QT/QTc interval prolongation reported in 9% of patients on LENVIMA vs 2% for placebo (2% vs 0% ≥grade 3). Monitor ECG in patients with congenital long QT syndrome, CHF, bradyarrhythmias, or patients taking drugs known to prolong the QT interval. Monitor and correct electrolyte abnormalities in all patients. Withhold dose for ≥grade 3 QT interval prolongation. Resume at reduced dose when QT prolongation resolves to grade 0, 1, or baseline. Hypocalcemia ≥grade 3 reported in 9% of patients on LENVIMA (2% for placebo). Monitor blood calcium levels at least monthly and replace calcium as necessary. Interrupt and adjust LENVIMA as necessary. In most cases, hypocalcemia responded to replacement and dose interruption/reduction. Across clinical studies in which 1108 patients received LENVIMA, reversible posterior leukoencephalopathy syndrome (RPLS) was reported in 3 patients. Withhold LENVIMA for RPLS until fully resolved. Resume at reduced dose or discontinue based on the severity and persistence of neurologic symptoms. Hemorrhagic events occurred in 35% of patients on LENVIMA vs 18% for placebo (2% vs 3% ≥grade 3). The most frequently reported hemorrhagic event was epistaxis (11% grade 1 and 1% grade 2). Discontinuation due to hemorrhagic events occurred in 1% of patients on LENVIMA. There was 1 fatal intracranial hemorrhage case among 16 patients who received LENVIMA and had CNS metastases at baseline. Withhold dose for grade 3 hemorrhage. Resume at reduced dose or discontinue, based on severity/persistence of hemorrhage. Discontinue for grade 4 hemorrhage. LENVIMA™ (lenvatinib) impairs exogenous thyroid suppression. In patients with a normal baseline TSH, elevation of TSH level above 0.5 mU/L was observed post baseline in 57% of patients on LENVIMA (14% for placebo). Monitor TSH levels monthly and adjust thyroid replacement medication as needed in patients with DTC. LENVIMA may cause fetal harm when administered to a pregnant woman. Advise females of reproductive potential to use effective contraception during treatment with LENVIMA and for at least 2 weeks following completion of therapy. \nAdverse Reactions The most common adverse reactions observed in LENVIMA-treated patients vs placebo-treated patients were hypertension (73% vs 16%), fatigue (67% vs 35%), diarrhea (67% vs 17%), arthralgia/myalgia (62% vs 28%), decreased appetite (54% vs 18%), weight decreased (51% vs 15%), nausea (47% vs 25%), stomatitis (41% vs 8%), headache (38% vs 11%), vomiting (36% vs 15%), proteinuria (34% vs 3%), palmar-plantar erythrodysesthesia syndrome (32% vs 1%), abdominal pain (31% vs 11%), and dysphonia (31% vs 5%). \nUse in Specific Populations Because of the potential for serious adverse reactions in nursing infants, advise women to discontinue breastfeeding during treatment. LENVIMA may result in reduced fertility in females of reproductive potential, and may result in damage to male reproductive tissues, leading to reduced fertility of unknown duration. \nFor more information about lenvatinib, click here for the full Prescribing Information. \nAbout Eisai Inc. \nAt Eisai Inc., human health care is our goal. We give our first thoughts to patients and their families, and helping to increase the benefits health care provides. As the U.S. pharmaceutical subsidiary of Tokyo-based Eisai Co., Ltd., we have a passionate commitment to patient care that is the driving force behind our efforts to help address unmet medical needs. We are a fully integrated pharmaceutical business with discovery, clinical, manufacturing and marketing capabilities. Our key areas of commercial focus include oncology and specialty care (Alzheimer's disease, epilepsy and metabolic disorders). To learn more about Eisai Inc., please visit us at www.eisai.com/US . \nEisai Inc. has affiliates that are part of a global product creation organization that includes R&D facilities in Massachusetts, New Jersey and Pennsylvania, as well as a global demand chain organization that includes facilities in Maryland and North Carolina. Eisai's global areas of R&D focus include neuroscience; oncology; metabolic disorders; vascular, inflammatory and immunological reaction; and antibody-based programs.Contacts:MediaInvestorsLaurie Landau \nAlex ScottEisai Inc.", "external_links": [], "published": "2015-10-16T15:55:00.000+03:00", "crawled": "2015-10-16T16:19:36.658+03:00", "highlightTitle": ""}