{"organizations": [], "uuid": "04c704f8ff3e1e4e5fabf916cc0112baa7702e90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144415/endava-launches-global-digital-transformation-service-with-acquisition-nickelfish", "country": "US", "title": "Endava Launches Global Digital Transformation Service With Acquisition of Nickelfish", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Endava Launches Global Digital Transformation Service With Acquisition of Nickelfish", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:37:00.000+03:00", "replies_count": 0, "uuid": "04c704f8ff3e1e4e5fabf916cc0112baa7702e90"}, "author": "admin", "url": "http://www.freshnews.com/news/1144415/endava-launches-global-digital-transformation-service-with-acquisition-nickelfish", "ord_in_thread": 0, "title": "Endava Launches Global Digital Transformation Service With Acquisition of Nickelfish", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/22/2015 @ 7:37 AM Companies mentioned in this article: Endava \nNEW YORK & LONDON -- (BUSINESS WIRE) -- Enhancing its credentials in designing, building and running digital platforms for some of the world’s leading companies, Endava announces the acquisition of Nickelfish, a New Jersey based UX and interactive design firm. The acquisition now gives Endava the added capability of delivering Digital Strategy and User Experiences. \nThe result of the acquisition is a fully integrated end-to-end Digital Transformation Service that helps companies become digital businesses while keeping the end-to-end accountability, from strategy and UX through to the build and operation of the platform, with a single, global digital partner. \n“This acquisition is in response to the market desperately needing partners to step up and assume end-to-end accountability for developing and delivering competitive digital business strategies with great user experiences that work seamlessly with the technology platforms they run on,” said Endava CEO John Cotterell . “This demand combined with the expertise and great cultural fit of the Nickelfish team made this acquisition the obvious thing to do.” \n“We’re incredibly excited by this opportunity as it will allow us to create great digital strategies and amazing user experiences that sit on top of world class technology platforms,” said Nickelfish CEO Justin Marcucci. “This new, fully integrated organization will be able to deliver clients the insights, agility and continuous improvement required to keep them relevant and competitive in today’s markets, while still focusing on the user and ensuring their experiences are second-to-none.\" \nGlobal Digital Transformation Service \nEndava is now positioned to unite the agendas of CMOs and CIOs, as its balance of digital strategy, user experience design and enterprise scale engineering will provide value to all users, both consumers and internal corporate staff alike. Endava’s digital team will offer this service across all of its global markets and industries. \nFor more information visit www.endava.com/en/Digital-Transformation \nAbout Endava \nEndava is a privately owned IT services company with over 2,500 employees and offices in New York, New Jersey, Atlanta, London and Frankfurt and six delivery centers across Romania, Moldova, Macedonia, and Serbia. Formed in 2000, Endava works with some of the world’s biggest brands in Finance, Insurance, TMT, and Retail helping them harness digital technologies and transforming them into more agile, responsive and valuable businesses. \nEndava’s philosophy is simple: Create success for people. The people who work for them, the people who engage them, and the people who use the systems and platforms they design, build, and operate. \nFor more information visit www.endava.com . \nAbout Nickelfish \nNickelfish, a New Jersey based UX and interactive design firm, provides digital strategy and end-to-end digital implementation services to some of the most recognized brands in the world operating primarily in the financial services, e-commerce, real estate, and hospitality sectors. Since its founding in 2002, the firm has completed 1,500 projects, significantly enhancing its branded clients’ engagement with consumers and businesses alike. \nThe business is led by a dynamic and commercially driven management team of recognized digital strategy veterans and is overseen by founder and CEO Justin Marcucci, responsible for strategy and major client relationships. View source version on businesswire.com: http://www.businesswire.com/news/home/20151022005997/en/ Copyright © Business Wire 2015 \nMedia Contacts for New York:CooperKatz & Company for Endava", "external_links": [], "published": "2015-10-22T17:37:00.000+03:00", "crawled": "2015-10-22T18:31:53.466+03:00", "highlightTitle": ""}