{"organizations": ["Catholic Church"], "uuid": "f72317d2cb00d969b6f58fd7b308897d01db891e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.live5news.com", "main_image": "http://images.worldnow.com/AP/images/9047286_G.jpg", "site_section": "http://www.live5news.com/Global/category.asp?C=159809&clienttype=rss", "section_title": "Live 5 News - Technology", "url": "http://www.live5news.com/story/30292580/pope-rallies-bishops-to-press-climate-call-before-paris-meet", "country": "US", "title": "Pope rallies bishops to press climate call before Paris meet", "performance_score": 0, "site": "live5news.com", "participants_count": 0, "title_full": "Pope rallies bishops to press climate call before Paris meet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:43:00.000+03:00", "replies_count": 0, "uuid": "f72317d2cb00d969b6f58fd7b308897d01db891e"}, "author": "", "url": "http://www.live5news.com/story/30292580/pope-rallies-bishops-to-press-climate-call-before-paris-meet", "ord_in_thread": 0, "title": "Pope rallies bishops to press climate call before Paris meet", "locations": ["Paris", "St. Peter"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Francis"], "text": "Watch CBS Shows Pope rallies bishops to press climate call before Paris meet (AP Photo/Alessandra Tarantino). Pope Francis spreads incense during a canonization ceremony in St. Peter's Square at the Vatican Sunday, Oct. 18, 2015. Pope Francis canonized the Catholic Church's first married couple in modern times on Sunday, declar... \nVATICAN CITY (AP) - The Vatican is seeking to reinforce Pope Francis' environmental message by encouraging bishops from around the world to sign an appeal to world leaders meeting in Paris next month for crucial climate change talks. \nCardinals, patriarchs and bishops, including representatives of regional bishops' conferences from Asia, Africa, Latin America and Oceania, are expected to sign the appeal Monday. \nFrancis outlined his eco-message in a major teaching document in June, denouncing what he called the \"structurally perverse\" fossil fuel-based world economy that he says exploits the poor and destroys the Earth. \nThe encyclical was cheered by environmentalists and ignored or criticized by big business interests. In the U.S., it was met with particular unease and so far no U.S. bishop is scheduled to participate in the conference to launch the appeal. Copyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. 'Whitey' Bulger's lover heads to court on contempt charge The longtime girlfriend and fugitive companion of James \"Whitey\" Bulger is expected in federal court to face a contempt charge for refusing to tell whether other people helped the Boston mobster during his 16 years... More >> The longtime girlfriend and fugitive companion of James \"Whitey\" Bulger is expected in federal court to face a contempt charge for refusing to tell whether other people helped the Boston mobster during his 16 years on the... More >> Saving 'sang': New label aims to conserve wild ginseng Denny Colwell fires up a weed whacker and makes quick work of his prized American ginseng patch, a fall ritual that helps hide the slow-growing, long-lived perennials from poachers keen on digging them up. More >> Denny Colwell fires up a weed whacker and makes quick work of his prized American ginseng patch, a fall ritual that helps hide the slow-growing, long-lived perennials from poachers keen on digging them up. More >> Eddie Murphy receives top US humor prize at Kennedy Center Eddie Murphy is trading places with Mark Twain. More >> A star-studded lineup of comedians including Chris Rock, Dave Chappelle, George Lopez, Kathy Griffin and Arsenio Hall honored Eddie Murphy as an \"American icon.\" More >>", "external_links": [], "published": "2015-10-19T14:43:00.000+03:00", "crawled": "2015-10-19T14:51:11.976+03:00", "highlightTitle": ""}