{"organizations": [], "uuid": "0990c60f3ba488df4ba53b0c8e1fe991f42249c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/instagramhas.jpg", "site_section": "http://phys.org/rss-feed/technology-news/internet/", "section_title": "Internet News - Technology News, Internet, World Wide Web", "url": "http://phys.org/news/2015-10-instagram-short-boomerang-videos-aim.html", "country": "US", "title": "Instagram short 'Boomerang' videos aim to hook users", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Instagram short 'Boomerang' videos aim to hook users", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:50:00.000+03:00", "replies_count": 0, "uuid": "0990c60f3ba488df4ba53b0c8e1fe991f42249c3"}, "author": "", "url": "http://phys.org/news/2015-10-instagram-short-boomerang-videos-aim.html", "ord_in_thread": 0, "title": "Instagram short 'Boomerang' videos aim to hook users", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Instagram short 'Boomerang' videos aim to hook users October 22, 2015 Instagram has inaugurated a new \"Boomerang\" photo feature that loops still frames to create a 1-second moving image \nInstagram unveiled a new feature allowing users to post one-second video \"loops\" in an effort to keep up with rivals offering animated images. \n\"Boomerang\" is a new video application \"that lets you turn everyday moments into something fun and unexpected,\" the Facebook-owned picture-sharing network said in a blog post. \n\"Capture a friend jumping off a diving board, defying physics as she flies back and forth through the air. Transform an ordinary selfie with your friends into a funny video. Get that exact moment your friend blows out his birthday candles, then watch them come back to life again and again.\" \nThe Instagram feature is shorter than the six-second video segments on Twitter-owned Vine, but aims for a richer experience than animated GIF images. \n\"Boomerang takes a burst of photos and stitches them together into a high-quality mini video that plays forward and backward,\" Instagram said. \nInstagram said recently its user base has climbed past the 400-million-user mark, but it is facing intense competition with other services such as Snapchat, which is popular among young smartphone users. 8 hours ago 1 Twitter launches iPhone video sharing app January 24, 2013 \nTwitter on Thursday launched Vine, a service that lets people share video snippets from iPhones or iPod touch devices. Vine video porn posts exposed January 28, 2013 \nTwitter's iPhone video-snippet sharing service Vine had concerns about porn exposed on Monday after adult content was bared briefly in an \"Editor's Picks\" section. Instagram unveils private video, photo messaging (Update) December 12, 2013 \nInstagram on Thursday unveiled a new service allowing its 150 million members to send private photo and video messages to friends and loved ones in an increasingly competitive market. Instagram images no longer just squares August 27, 2015 \nInstagram on Thursday broke its square mold with an update that adds portrait and landscape formats to the image-sharing smartphone application. Facebook counters Twitter with tool for journalists September 17, 2015 \nFacebook unveiled a new tool Thursday aimed at helping journalists using the social network track breaking and trending news, in a challenge to Twitter. Instagram tops 400 million users September 23, 2015 \nInstagram has rocketed past the 400-million-user mark, with more than 80 million pictures shared daily at the Facebook-owned service. Recommended for you Shining more light on solar panels October 22, 2015 \nSolar panels are the beacon of renewable energy, yet they are not getting as much light as they could be. Joshua Pearce from Michigan Technological University and a team from Queen's University in Canada have found a way ... Top EU court rules Bitcoin exchange tax-free in Europe October 22, 2015 \nThe EU's top court ruled Thursday that the exchange of Bitcoin and other virtual currencies should be treated just like traditional money in Europe and not incur any sales tax. Up to 27 seconds of inattention after talking to your car or smartphone October 22, 2015 \nIf you think it is okay to talk to your car infotainment system or smartphone while driving or even when stopped at a red light, think again. It takes up to 27 seconds to regain full attention after issuing voice commands, ... Engineering students innovate 3-D printing process to improve accessibility October 22, 2015 \nPenn State engineering students Kevin Paroda and Justin Keenan quickly discovered that they had much in common. As first-year roommates, they designed a keyless entry mechanism for their dorm room during the first week of ... Engineers and students grapple with 3-D printing a habitable structure on Mars October 16, 2015 \nWe are in the midst of a \"Mars moment.\" This fall, the Matt Damon film, \"The Martian,\" a story about a stranded astronaut who must learn to survive on Mars, grossed a whopping $55 million at the box office in its opening ... Study urges optimization of solar energy development October 19, 2015 \nWith mounting vigor for combating global climate change, increasing the use of renewable energy resources such as solar, without compromising natural habitats, is a challenge to the traditional model of utility-scale solar ...", "external_links": [], "published": "2015-10-23T00:50:00.000+03:00", "crawled": "2015-10-23T01:14:00.612+03:00", "highlightTitle": ""}