{"organizations": [], "uuid": "4d2270501d78e30a47b738ad9fc403f311dd92df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/technology", "section_title": "Technology | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/26/markets/us-oil-imports-rise-after-years-decline", "country": "US", "title": "US oil imports rise after years of decline", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "US oil imports rise after years of decline | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-27T03:38:00.000+02:00", "replies_count": 0, "uuid": "4d2270501d78e30a47b738ad9fc403f311dd92df"}, "author": "Dow Jones newswires", "url": "https://www.businessspectator.com.au/news/2015/10/26/markets/us-oil-imports-rise-after-years-decline", "ord_in_thread": 0, "title": "US oil imports rise after years of decline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US imports of foreign oil are rising again after a long decline, as the oil bust forces domestic producers to scale back.\nLess than a year after the Organisation of the Petroleum Exporting Countries opted to continue production despite plummeting prices, member countries including Saudi Arabia and Iraq are clawing back market share they ceded to oil companies pumping in Texas and North Dakota.\nUS crude imports declined 20 per cent between 2010 and 2014 amid the domestic energy boom but have recently started to rise again. Total crude-oil imports rose for three straight months between April and July, according to the most recently available data from the Energy Information Administration. Imports of light crude grew more rapidly, from 5.6 per cent of total imports in April to 11 per cent in July.\nOn the Gulf Coast, vessels carrying nearly a week's worth of imports waited offshore Friday to unload, according to shipping tracker ClipperData.\nThe slowdown in the nation's shale-oil output has pushed up the price of high-quality US oil relative to global prices, giving US refiners a reason to buy from countries such as Nigeria. Until very recently, the boom in US shale-oil production forced countries that exported oil to the US to hustle for new customers.\nDecreased reliance on foreign crude in the past few years has allowed the US to be more flexible in its foreign policy and given the US more global heft, politicians and analysts have said.\nNow, the shifts in oil flows spurred by declining US output show how some of the ripple effects of the shale-oil boom are going into reverse following the plunge in oil prices. US oil producers have sharply cut spending on new drilling, and transportation companies that profited from shipping crude by rail and barge in recent years have seen volumes decline.\n\"Production declines are taking hold,\" said Gary Ross, head of global oil at consulting firm PIRA Energy Group. \"There is no surplus\" of the type of crude oil extracted from shale-rock formations. \"Light, sweet\" crude, such as that produced from shale, is historically prized because it is easier to process into large amounts of gasoline and other fuels.\nGlobally, the glut of crude oil that sent prices tumbling last year still persists, and benchmark oil and gasoline prices remain near six-year lows. Falling US output is unlikely to have an immediate impact on prices, because other countries are still pumping at high rates and Iran is expected to increase production in the coming months.\nIn the US, however, the adjustments have been swift. US crude production has fallen to about 9 million barrels a day from a 43-year peak of 9.6 million barrels a day in April and is forecast to keep declining.\n\"There's just not enough light barrels to go around today,\" said Adam Bedard, chief executive of ARB Midstream, a shipping and trading company in Denver.\nStill, the US is importing less than eight million barrels of crude a day, down from 9.2 million daily barrels on average in 2010. The rate of imports could also decline at the end of the year, as refiners draw down on inventories to avoid higher taxes.\nBut at the moment, the surge in imports continues to surprise. Total US crude imports rose 156,000 barrels a day in the week ended Oct. 16, helping push the combined stockpiles of crude oil and refined products to a weekly all-time high.\nThe East Coast is one place where the pricing battle is being fought between domestic and foreign oil, said David St. Amand, president of maritime consulting firm Navigistics Consulting. Refiners that were willing to pay high transportation costs in recent years to ship domestic crude oil by rail and by barge are now finding it cheaper to import.\nCrude imports to the East Coast shot up to 883,000 barrels a day in the week ended October 16, up more than threefold from the prior week and the highest volume since early August, when US oil demand tends to be seasonally high, according to the EIA.\nDelta Air Lines Inc's refinery in Trainer, Pa., imported Nigerian crude in July, according to the EIA, the first time that refinery has done so since September 2014. Monroe Energy LLC, Delta's refining unit, declined to comment. After falling to zero in July 2014 and hovering at low levels since, shipments of crude from Nigeria to the US rose to 106,000 barrels a day in July 2015.\nThe price of US oil has started to draw close to the price of Brent, the global benchmark. That attracts more crude to the US and indicates that imports can continue to rise.\nWith the gap between US and international prices so narrow, refiners would \"rather just start importing a more high-quality barrel instead,\" said Dominic Haywood, oil analyst at Energy Aspects. \"There's a lot of imports on the way.\"\nAt $44.60 a barrel, the US benchmark, known as West Texas Intermediate, costs $3.39 a barrel less than the global benchmark, Brent crude. In the past four years, WTI's discount to Brent was about $10 a barrel.\nWTI could trade above Brent in 2016 as US production continues to decline and gasoline demand remains strong, according to analysts at Bank of America Merrill Lynch.\nWhen US output was rapidly growing in recent years, producers were forced to heavily discount their barrels to persuade refiners to buy domestic crude. US refiners that were built to process foreign crudes, especially on the Gulf Coast, used more US oil once it became significantly cheaper. But some types of shale oil caused problems for refiners.\nIn the first half of October, crude-oil imports to the Gulf Coast were 60,000 barrels a day higher than a year ago, according to ClipperData. The displacement [of imports] that we saw in 2013 and 2014 is definitely over,\" said Abudi Zein, ClipperData's chief operating officer.", "external_links": [], "published": "2015-10-27T03:38:00.000+02:00", "crawled": "2015-10-26T11:54:30.548+02:00", "highlightTitle": ""}