{"organizations": ["International Road Dynamics Print Email"], "uuid": "ea514b3d8a97ad03c484827a817026609f0666f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.roadtraffic-technology.com", "main_image": "", "site_section": "http://www.roadtraffic-technology.com/news-rss.xml", "section_title": "Road Traffic Technology-Updates", "url": "http://www.roadtraffic-technology.com/contractors/tolling/ird/pressird-announces-record-revenue.html", "country": "", "title": "IRD Announces Record Revenue and Earnings in Third Quarter 2015", "performance_score": 0, "site": "roadtraffic-technology.com", "participants_count": 0, "title_full": "IRD Announces Record Revenue and Earnings in Third Quarter 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T17:19:00.000+03:00", "replies_count": 0, "uuid": "ea514b3d8a97ad03c484827a817026609f0666f8"}, "author": "", "url": "http://www.roadtraffic-technology.com/contractors/tolling/ird/pressird-announces-record-revenue.html", "ord_in_thread": 0, "title": "IRD Announces Record Revenue and Earnings in Third Quarter 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IRD Announces Record Revenue and Earnings in Third Quarter 2015 Friday, October 09, 2015 by International Road Dynamics Print Email \nInternational Road Dynamics (TSX: IRD) has announced continued strong growth in the quarter ending 31 August 2015. \n\"With significant gains in revenues and profitability across all of our key business lines and geographic segments, we generated stellar results and achieved the highest single quarterly earnings in the Company's history,\" commented Terry Bergan, president and CEO. \"Looking ahead, we are confident growth will continue as governments and the private sector invest in ITS solutions to enhance highway and roadway infrastructure. In addition, with recent contract wins in the US and other targeted markets, our backlog of confirmed orders continues to rise, and we expect further increases in the months ahead as we leverage our global presence and reputation for innovative and quality products and services.\"Consolidated revenue increased 51.9% and 23.6% respectively, compared to the same prior year periods due primarily to the company's successful execution of an increased number of contracted projects, improved service revenues and growth in product sales into other international markets, as well as an increase in the value of the US dollar. Revenue in the company's Canada and US segment increased 53.0% for the quarter ending 31 August 2015, and 26.2% for the first nine months of the year, compared to the same prior-year periods primarily due to an increase in contracted project revenues higher service revenues, and increased product sales into other international markets. For the fourth quarter of 2015, the company expects continued revenue and profitability growth in project and service markets based on the significant increase in current orders on hand compared to last year. Results are subject to variability due to seasonal weather restrictions or changes in customer schedules. \nLatin America and Mexico segment revenue increased 66.7% in the third quarter of fiscal 2015 and 21.9% year-to-date compared to the same prior-year periods due primarily to the significant increase in current projects and increased product sales growth, partially offset by a small decline in service revenues due to changes in customer requirements. For the balance of 2015 the company expects further revenue growth arising from existing and new project and product sales identified in the region.India segment revenue has decreased in fiscal 2015 reflecting the company's decision to reduce the level of business activity in this geographic segment. Despite the revenue decline, gross margins as a percentage of revenue increased to 46.8% compared to 22.8% of revenues in the same prior-year period as current project and service revenues delivered improved profitability. For the balance of 2015, the company expects only limited activity in the India segment as it remains committed to accepting only revenue opportunities with acceptable gross margins and payment terms.Gross margin in the third quarter of fiscal 2015 increased 29.0%, compared to the prior-year periods due to the higher sales volumes across all market segments. As a percentage of revenue, gross margin decreased to 27.4% and 30.2% for the third quarter and nine months ending 31 August 2015, from 32.4% and 30.8%, respectively, in the prior-year periods. The declines in gross margin as a percentage of revenue are due to variability in margins on projects currently underway and changes in product mix, partially offset by increases in the value of the US dollar compared to the prior year. \nAdministrative and marketing expenses increased in fiscal 2015 compared to the prior year primarily due to higher performance based compensation costs and increased sales costs related to higher levels of business activity. R&D costs have also increased as the company continues to allocate increased resources to accelerate near term business opportunities and advance the development and introduction of new products to the market.The company recorded foreign exchange gains of $686,870 (2014 - $405,120) in the third quarter of fiscal 2015 and $592,149 (2014 - $689,661) through the first nine months of the fiscal year due primarily to increased value of the US dollar against the Canadian dollar and Chilean peso. The company continues its strategy of reducing its exposure to currency volatility by maintaining a portion of its bank indebtedness in US funds.Earnings before interest, taxes, depreciation and amortisation (EBITDA) for the three and nine months ending 31 August 2015, increased to $2,188,393 and $3,205,673, respectively, compared to $1,157,278 and $2,211,136 in the comparable prior-year periods. Net earnings increased to $1,458,315 ($0.10 per common share) in the third quarter of fiscal 2015 from $505,573 ($0.03 per common share) in fiscal 2014. For the first nine months of fiscal 2015, net earnings were $1,752,442 ($0.12 per common share), compared to $906,857 ($0.06 per common share) in the prior year. The company's financial position remained solid at 31 August 2015 with working capital of $10.5 million, up from $9.5 million at November 30, 2014. Follow Us:", "external_links": [], "published": "2015-10-09T17:19:00.000+03:00", "crawled": "2015-10-10T04:04:03.844+03:00", "highlightTitle": ""}