{"organizations": [], "uuid": "c39ff5e0ae2f7dbe1c767b20732106d7a18f680b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://www.sfgate.com/img/pages/article/opengraph_default.png", "site_section": "http://sfgate.com//rss/feed/Business-and-Technology-News-448.php", "section_title": "Business and Technology News", "url": "http://www.sfgate.com/business/article/Subway-to-transition-to-meat-raised-without-6580172.php", "country": "US", "title": "Subway to transition to meat raised without antibiotics", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Subway to transition to meat raised without antibiotics - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T18:09:00.000+03:00", "replies_count": 0, "uuid": "c39ff5e0ae2f7dbe1c767b20732106d7a18f680b"}, "author": "sfgate.com", "url": "http://www.sfgate.com/business/article/Subway-to-transition-to-meat-raised-without-6580172.php", "ord_in_thread": 0, "title": "Subway to transition to meat raised without antibiotics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK — Subway said Tuesday that it plans to switch to meat raised without antibiotics over the next several years. The announcement comes after the company was targeted by advocacy groups calling for the change, with a coalition planning to deliver petitions to Subway’s headquarters on Thursday.\nThe sandwich chain had said this summer that it would start switching to chicken raised without antibiotics important to human medicine by next year. Now, it says it will serve chicken that receive no antibiotics starting in March 2016. It will also make the change to turkey starting sometime next year, with a transition expected to be complete within two to three years.\nPork and beef raised without antibiotics will follow within six years after that, or by 2025, the company says.\nSubway said its announcement was the “culmination of several months of intensive work with suppliers” and that it is proud to finally be in a position to share its plans. It said the decision was not a reaction to any campaign, and that it continually works on improving its menu.\nThe announcement comes as multiple groups including Natural Resources Defense Council , Friends of the Earth , the Center for Food Safety , U.S. Public Interest Research Group and food blogger Vani Hari had campaigned to get Subway to commit to buying meat produced without the routine use of antibiotics, and provide a timeline for doing so.\nLivestock producers often give their cattle, hog and poultry antibiotics to make them grow faster and to prevent illnesses. The practice has become a public health issue, with officials saying it can lead to germs becoming resistant to drugs so that they’re no longer effective in treating illnesses in humans.\nChipotle and Panera say they already serve meat raised without antibiotics, and McDonald’s said this year it would make the switch for its chicken. Subway is the largest chain in the U.S. by locations, with more than 27,000 stores.\nKari Hamerschlag, a representative for Friends of the Earth, said a coalition of groups had notified Subway last week of their plans to deliver their petitions on Thursday to its headquarters in Milford, Conn. She said the groups have been trying to get a meeting with Subway since this summer, but that the company has not been responsive.\nWhile other chains serve meat from animals that are given antibiotics, Hamerschlag said the groups singled out Subway because of its image.\n“We thought Subway was the most important one to target publicly because they claim to be this healthy fast-food restaurant chain,” she said.\nIt isn’t the first time Subway has been the target of a petition. Hari, known as the Food Babe, also previously petitioned the company to remove azodicarbonamide from its bread, noting that the ingredient is also used in yoga mats.\nSubway later removed the ingredient, which is widely used as a dough conditioner, saying it had already been in the process of doing so.", "external_links": [], "published": "2015-10-20T18:09:00.000+03:00", "crawled": "2015-10-21T14:06:45.038+03:00", "highlightTitle": ""}