{"organizations": [], "uuid": "d6b4c701af883c0618aa306563b0a5f0d5ce7b26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cleveland.com", "main_image": "http://imgick.cleveland.com/home/cleve-media/width620/img/plain-dealer/photo/2015/10/02/18885807-large.jpg", "site_section": "http://www.cleveland.com/science/", "section_title": "Cleveland &amp; Ohio Environment, Science &amp; Technology News: cleveland.com ", "url": "http://www.cleveland.com/metro/index.ssf/2015/10/great_lakes_science_center_sho.html", "country": "US", "title": "Great Lakes Science Center sees math from new angles (photos)", "performance_score": 0, "site": "cleveland.com", "participants_count": 1, "title_full": "Great Lakes Science Center sees math from new angles (photos) | cleveland.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T23:28:00.000+03:00", "replies_count": 0, "uuid": "d6b4c701af883c0618aa306563b0a5f0d5ce7b26"}, "author": "James Ewinger, The Plain Dealer", "url": "http://www.cleveland.com/metro/index.ssf/2015/10/great_lakes_science_center_sho.html", "ord_in_thread": 0, "title": "Great Lakes Science Center sees math from new angles (photos)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CLEVELAND, Ohio – If math is a language, the latest exhibition at the Great Lakes Science Center talks a great game.\nIt is called 2theXtreme: MathAlive!, and goes beyond asserting math's relevance to giving hands-on demonstrations of its utility.\n\"Math is just a language to describe the world around us,\" said Dr. Kirsten Ellenbogen, the center's CEO.\n\"People tell you math is fun,\" she said. \"This takes a different approach.\"\nBy immersing students in situations that rely on some degree of calculation, the presentation tells kids, \"you're already doing math,\" Ellenbogen said.\nThe exhibits are organized into galleries exploring diverse themes:\nOutdoor Action ... Adventure Sports Build Your World ... Environment Future Style ... Style and Design Kickin' It ... Entertainment Game Plan ...Video Games and Other Games Robotics and Space Visitors can design and play their own video games, master-engineer various aspects of a modern city, edit their own animated movies, compete against others in a mountain bike race, jump into a binary dance party, or program and control Curiosity, NASA's Mars rover.\nThrough approximately 40 unique, interactive experiences, the exhibit takes math from its native form into the applied worlds of design, engineering, technology and science.\nThe science center is focused on STEM (science, technology, engineering and math). The new exhibition is appropriate for all ages, but is designed particularly for students in grades 3 through 8.\nDante Centuori, the center's creative producer, said it hits on a variety of mathematical disciplines, including geometry, trigonometry and arithmetic.\nActing as informal beta testers Friday were the top 3 rd , 4 th and 5 th grade math students for Apex Academy in East Cleveland.\nMathAlive remains at the Great Lakes Science Center through January 2, as part of a 15-city tour.\nThe exhibit goes public Saturday. The center is open Monday-Saturday, 10 a.m.-5 p.m. and Sunday, noon-5 p.m. Admission prices vary depending on what attraction people want to see.\nAdmission to MathAlive is included in the general-admission price.", "external_links": ["http://www.greatscience.com/plan-your-visit/hours-and-admission.aspx"], "published": "2015-10-02T23:28:00.000+03:00", "crawled": "2015-10-09T17:06:37.653+03:00", "highlightTitle": ""}