{"organizations": [], "uuid": "a14e4e274b99c66d7907fc699483d98e2c931312", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30303451/apple-magic-keyboard-and-trackpad-get-custom-fit-cases-from-waterfield-designs", "country": "US", "title": "Apple Magic Keyboard and TrackPad Get Custom-fit Cases from WaterField Designs", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Apple Magic Keyboard and TrackPad Get Custom-fit Cases from WaterField Designs - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:11:00.000+03:00", "replies_count": 0, "uuid": "a14e4e274b99c66d7907fc699483d98e2c931312"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30303451/apple-magic-keyboard-and-trackpad-get-custom-fit-cases-from-waterfield-designs", "ord_in_thread": 0, "title": "Apple Magic Keyboard and TrackPad Get Custom-fit Cases from WaterField Designs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WaterField Designs unveils new Keyboard and TrackPad cases to protect and carry Apple’s Upgraded Rechargeable Magic Keyboard and Magic TrackPad 2. These Made-in-America tan waxed canvas and black ballistic nylon cases provide varied levels of protection and can easily be stowed under an arm or in a messenger bag, backpack or briefcase.\nSan Francisco, CA\nWaterField Designs —a San Francisco manufacturer of custom laptop sleeves, bags and cases for digital gear—unveils the custom-fit Magic Keyboard Slip, Keyboard Socket and Keyboard Travel Express to hold the new smaller and thinner Apple Magic Keyboard. Ready for the new Magic TrackPad 2 as well, WaterField announces a new custom fit TrackPad Slip and Socket case. The Magic Keyboard sleeve s and Magic TrackPad 2 case s protect these redesigned, rechargeable Apple devices from bag contents, dings and spills, and the Travel Express organizes the Magic Keyboard, Magic TrackPad 2 or Magic Mouse 2 and a few other necessities all in one, protective case.\n“Many laptop and tablet owners use a separate keyboard with their mobile devices to avoid potential Repetitive Strain Injuries (like carpel tunnel syndrome) and other ergonomic problems,” explained founder Gary Waterfield, “But—as too many of us know from experience—one small spill can instantly ruin a Keyboard or TrackPad. We designed the Magic Keyboard and TrackPad 2 cases to protect these devices so that users can take them from workstation to workstation or from work to home with peace of mind.”\nWaterField designs and manufactures all its gear in San Francisco allowing for quick turnaround time on custom cases for new devices from Apple and its competitors. Three options for the new Apple Magic Keyboard offer mid to light protection for these sensitive keyboards. The Keyboard Slip, in black ballistic nylon or tan waxed canvas is lightly padded, and the Keyboard Socket, a soft pouch, keeps dust and grit from getting into the device. Each includes a rear mesh pocket to hold the Lightening to USB Cable. The Keyboard Travel Express has no-scratch, padded pockets for the new Magic Keyboard, a Magic TrackPad 2 or Magic Mouse 2 and other essential accessories. WaterField’s TrackPad Slip case and TrackPad Socket offer similar levels of protection for this refreshed Apple device.\nThe new Keyboard Travel Express, Keyboard Slip, Keyboard Socket, TrackPad Case and TrackPad Socket can be stylishly stowed in any of WaterField Design’s messenger bag s, briefcase s or tablet bags.\nPricing & Availability\nKeyboard Travel Express—Price: $59. Colors: Black ballistic nylon or tan waxed canvas.\nKeyboard Slip—Price: $29. Colors: Black ballistic nylon with black piping or tan waxed canvas with copper piping. Rear mesh pocket.\nKeyboard Socket—Price: $15. Color: Black.\nTrackPad Slip—Price: $25. Colors: Black ballistic nylon with black piping or tan waxed canvas with copper piping. Rear mesh pocket.\nTrackPad Socket—Price: $12. Color: Black.\nAbout WaterField Designs\nWaterField Designs is an innovative San Francisco designer and manufacturer of bags and cases for tech-savvy consumers who want to stylishly and responsibly transport their technology. WaterField manufactures custom-fitted, high-quality cases and bags for a full-range of laptop computers, smartphones, tablets, gaming devices and other digital gear. All products are manufactured to exacting standards entirely in San Francisco. More information at \" Our Story ”.\n //www.prweb.com/releases/2015_Magic_Keyboard_Case/10_Magic_TrackPad_2_Case/prweb13026386.htm\n ", "external_links": ["https://www.sfbags.com/collections/keyboard-cases/products/magic-keyboard-travel-express", "https://www.sfbags.com/collections/magic-trackpad-cases", "https://www.sfbags.com/collections/briefcases", "https://www.sfbags.com/collections/shoulder-messenger-bags", "http://www.prweb.com/releases/2015_Magic_Keyboard_Case/10_Magic_TrackPad_2_Case/prweb13026386.htm", "https://www.sfbags.com/pages/about-us", "https://www.sfbags.com/", "https://www.sfbags.com/collections/magic-keyboard-cases"], "published": "2015-10-20T15:11:00.000+03:00", "crawled": "2015-10-20T23:19:08.806+03:00", "highlightTitle": ""}