{"organizations": ["Verizon", "Giants", "Yomiuri Giants Face Hanshin Tigers", "Charter Communications", "New York Yankees", "TV & Livestream Carriage On ONE World Sports Yomiuri Giants Face Hanshin Tigers", "Nippon Professional Baseball", "Texas Rangers", "RCN", "Google Fiber", "NCTC", "Cablevision", "Yakult Swallows", "Hanshin Tigers", "Pacific Leagues", "Yomiuri Giants", "NPB", "Tigers", "DISH Network", "MLB", "Campo Communications", "Washington Nationals", "TV & Livestream", "Google", "Yomiuri Giants The Giants", "Mediacom Communications"], "uuid": "54cf07762767b430f9973289a39fc1682c484450", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.consumerelectronicsnet.com", "main_image": "", "site_section": "http://feeds2.feedburner.com/Cen-ConsumerElectronicsNet-technologyNews", "section_title": "CEN - Consumer Electronics Net-Technology News", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4108187", "country": "US", "title": "Yomiuri Giants Face Hanshin Tigers In NPB Climax Series Saturday; Exclusive U.S. TV & Livestream Carriage On ONE World Sports", "performance_score": 0, "site": "consumerelectronicsnet.com", "participants_count": 0, "title_full": "Yomiuri Giants Face Hanshin Tigers In NPB Climax Series Saturday; Exclusive U.S. TV & Livestream Carriage On ONE World Sports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:00:00.000+03:00", "replies_count": 0, "uuid": "54cf07762767b430f9973289a39fc1682c484450"}, "author": "", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4108187", "ord_in_thread": 0, "title": "Yomiuri Giants Face Hanshin Tigers In NPB Climax Series Saturday; Exclusive U.S. TV & Livestream Carriage On ONE World Sports", "locations": ["United States", "Japans", "America", "USA", "U.S.", "Tokyo", "Stamford", "Boston", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Campo", "Roy White", "Tom", "Reggie Smith", "Aaron Poreda", "Miles Mikolas", "Tomoyuki Sugano", "Koji Uehara", "Warren Cromartie", "Joel Feld", "Hideki Okajima", "Hideki Matsui", "Rachel Gary", "Clyde Wright", "Davey Johnson"], "text": "Yomiuri Giants Face Hanshin Tigers In NPB Climax Series Saturday; Exclusive U.S. TV & Livestream Carriage On ONE World Sports October 08, 2015 -- Stamford, CT (PRWEB) October 08, 2015 The Yomiuri Giants, widely considered the New York Yankees of Japan, face the Hanshin Tigers in Nippon Professional Baseballs (NPB) Climax Series beginning October 10 at the Tokyo Dome. Like the Giants, the Tigers are one of NPBs oldest and most storied ball clubs. ONE World Sports, Americas Network for Global Sports , will provide exclusive U.S. TV carriage of the First Stage of the Climax Series. This best of three series begins on October 10 with Game 2 slated for October 11 and a possible Game 3, if necessary, scheduled for October 12. All games will air live at 1:00 AM ET on ONE World Sports . The network will also livestream Saturdays and Sundays games from ONEWorldSports.com, and its distribution partners Verizon FiOS and RCN will, as part of the networks recently announced Soctober promotion, provide a free preview of this weekends Climax Series games. Selected video highlights will also be made available on the networks Watch ONE World Sports app. The Climax Series is the NPBs annual playoff process to determine the two teams, one each from NPBs Central and Pacific Leagues, which will compete in the Japan Series that countrys version of the World Series -- for the national championship. The winner of the Giants and Tigers match-up will face-off against the Yakult Swallows to represent the Central League in the Japan Series. As a network of championship events, ONE World Sports will carry for the first time Giants postseason action, allowing American fans to continue cheering on Japans most remarkable baseball players, said Joel Feld, Executive Vice President of Programming & Production, ONE World Sports. Nippon Professional Baseball boasts some of the sports best players outside the USA and is one of Major League Baseballs favorite hunting grounds for new talent. About the Yomiuri Giants The Giants, Japans most popular baseball team, are the flagship of the NPB league, long a source of high-profile talent for Major League Baseball. Japanese professional baseball began with the founding of the Yomiuri Giants in 1934 and, since the beginning; the Giants have dominated -- winning more pennants and Japan Series than any other team. MLB stars emerging from the Giants roster have included 2009 World Series Most Valuable Player Hideki Matsui, All-Star Hideki Okajima and the Boston Red Soxs Koji Uehara. MLB players who have headed to Japan to wear the Yomiuri Giants uniform include: Davey Johnson, former manager of the Washington Nationals and 2012 National League Manager of the Year; New York Yankees star outfielder, Roy White; seven-time All-Star Reggie Smith; All-Star pitcher Clyde Wright; and Warren Cromartie. Joining the team for 2015, both from the Texas Rangers, are pitchers Aaron Poreda and Miles Mikolas. Among the teams current stars is pitcher Tomoyuki Sugano, 2014 MVP in NPBs Central League. About ONE World Sports ONE World Sports is Americas Network for Global Sports, producing best-in-class, captivating live sports content from around the world. With multi-platform capabilities and superior production quality, ONE World Sports is one of the fastest growing independent sports networks available throughout the United States. Currently available to more than 30 million homes nationally on cable, telco and satellite, ONE World Sports delivers live and exclusive coverage of some of America's most popular sports played professionally outside the USA -- basketball, baseball, golf and ice hockey -- plus sporting events with the largest global followings, including soccer and cricket. ONE World Sports is distributed through Verizon FiOS and go90, DISH Network, Charter Communications, Cablevision's Optimum TV, Mediacom Communications, Google Fiber, Suddenlink, RCN and a growing number of systems through the NCTC. In addition, the network's mobile app, Watch ONE World Sports, features a live stream of the network for authenticated subscribers and on-demand content for all users. More information on ONE World Sports and its availability in particular markets can be found at http://www.oneworldsports.com or consumers can call their television distributor. Watch ONE World Sports is available in the Apple and the Google Play stores. # # # Rachel Gary, ONE World Sports, 201-615-9629, rgary(at)oneworldsports(dot)com Tom Campo, Campo Communications, LLC, 212-590-2464 / Tom(at)CampoComm(dot)com # # #", "external_links": [], "published": "2015-10-08T22:00:00.000+03:00", "crawled": "2015-10-09T08:30:37.569+03:00", "highlightTitle": ""}