{"organizations": ["U.S. Securities and Exchange Commission", "SAP", "SEC", "EVP Internet of Things & Customer Innovation", "Tech Mahindra", "SAP Predictive Maintenance and Service", "Mahindra Group", "Tech Mahindra Pilot Intelligent Electric Vehicle Charging System Tech Mahindra Ltd", "SAP Power the Connected Enterprise for IT Expense Management Solutions Tangoe"], "uuid": "7f906118691101d618794e5be1541175220708b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/sap-expands-focus-the-internet-things.xhtml", "country": "US", "title": "SAP Expands Focus on the Internet of Things", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "SAP Expands Focus on the Internet of Things", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T20:21:00.000+03:00", "replies_count": 0, "uuid": "7f906118691101d618794e5be1541175220708b6"}, "author": "", "url": "http://science-technology.news-articles.net/content/sap-expands-focus-the-internet-things.xhtml", "ord_in_thread": 0, "title": "SAP Expands Focus on the Internet of Things", "locations": ["United States", "Las Vegas", "U.S.", "LAS VEGAS", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Susan Miller", "Samantha Finnegan", "Tanja Rueckert", "Prateek Saxena", "Tangoe"], "text": "SAP Expands Focus on the Internet of Things   SAP Expands Focus on the Internet of Things -- LAS VEGAS, Oct. 20,   SAP Logo. SAP Logo.   LAS VEGAS , Oct. 20,   [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCdmJtTnNhV05yUFNkc2FXNXJUMjVEYkdsamF5aDBhR2x6S1NjZ2FISmxaajFjSW1oMGRIQTZMeTkzZDNjdWMyRndMbU52YlM5Y0lpQnlaV3c5WENKdWIyWnZiR3h2ZDF3aUlIUmhjbWRsZEQxY0lsOWliR0Z1YTF3aVBsTkJVQ0JUUlR3dllUND18]] (NYSE: [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QU2RvZEhSd09pOHZjM1IxWkdsdkxUVXVabWx1WVc1amFXRnNZMjl1ZEdWdWRDNWpiMjB2Y0hKdVpYZHpQMUJoWjJVOVVYVnZkR1VtVkdsamEyVnlQVk5CVUNjZ2NtVnNQU2R1YjJadmJHeHZkeWNnZEdGeVoyVjBQU2RmWW14aGJtc25JSFJwZEd4bFBTZFRRVkFuSUc5dVkyeHBZMnM5SjJ4cGJtdFBia05zYVdOcktIUm9hWE1wSnlCeVpXdzlKMjV2Wm05c2JHOTNKejVUUVZBOEwyRSt8]]) today announced it is continuing to co-innovate with customers and partners to expand its comprehensive portfolio of solutions for the Internet of Things (IoT). Working together with Tech Mahindra, SAP is offering a solution to gather data on electrical vehicle charging patterns and transformer performance. SAP is partnering with Tangoe to help customers gain real business value from leveraging the SAP HANA® platform to successfully implement the IoT. Additionally, SAP has created a new IoT-focused product and development unit dedicated to developing leading solutions. This announcement was made at the SAP® TechEd conference held October 19–23, 2015, in Las Vegas . SAP and Tech Mahindra Pilot Intelligent Electric Vehicle Charging System Tech Mahindra Ltd is an Indian multinational IT provider specializing in digital transformation, consulting and business re-engineering solutions for the telecommunications industry. Part of the Mahindra Group, it is a US$3.8 billion company with over 100,000 professionals across 91 countries. SAP worked with a Tech Mahindra–funded internal startup on a co-innovation pilot to enable the development of an application built on the SAP HANA platform that monitors charging stations, electric vehicle usage, driving patterns, and transformers and overall grid performance. Using SAP HANA, the intelligent electric vehicle charging system application can monitor and analyze the electric load put on the distributed transformers in real time, schedule charging according to usage patterns to avoid bottlenecks, and proactively monitor the grid for reliability. \"Clean tech is maturing and adopting proven management practices, and we have been a strong advocate of the same, focusing our efforts toward delivering a positive and actionable project that will help our customers adapt to digital technologies effectively,\" said Prateek Saxena , director at an internal startup funded by Tech Mahindra. \"As we collaborate with SAP on the IoT platform solution, we aim to deliver and transform the power and benefits of in-memory computing for real-time monitoring and analysis of sensors. This will help energy companies assess the challenges and opportunities of charging electric vehicles, with the aim of hastening consumer adoption of electric vehicle technology.\" Tangoe and SAP Power the Connected Enterprise for IT Expense Management Solutions Tangoe, an SAP partner and a global leader in powering the connected enterprise through connection lifecycle management, is leveraging SAP HANA for its Matrix Solution Suite. With SAP HANA, Tangoe's Matrix will deliver enhanced analytics and online transaction processing (OLTP) capabilities, enabling global enterprises to analyze and optimize their IT assets and expenses, and understand the usage of these connections in the workplace, including fixed, mobile, cloud, machine and IT communications. New Product and Development Unit Focuses on Delivering Value to Customers with Emerging IoT Solutions The new Internet of Things & Customer Innovation product and development unit brings together all IoT and Industry 4.0 development activities, leveraging talented developers and industry experts at SAP to work with customers and partners to develop new and exciting IoT applications. Using SAP HANA and the business application service from SAP HANA Cloud Platform as foundations, SAP is helping customers and partners to quickly build or extend and integrate connected machine applications capable of querying and analyzing structured and unstructured data. \"SAP is in a unique position to succeed as an IoT market and thought leader, and spearhead innovation in this area,\" said Tanja Rueckert , EVP Internet of Things & Customer Innovation, SAP. \"Our broad customer base, ongoing co-innovation with customers and partners, breadth and depth of industry knowledge, and unique ability to create a closed loop of 'thing to insight to action' allow us to bring together in a meaningful way the business context from the transaction system (IT) and the operational context from machine-generated data (OT) to deliver value to our customers.\" This new unit will focus on broadening the portfolio of existing applications, including the SAP Vehicle Insights application, SAP Predictive Maintenance and Service solution and SAP Connected Logistics package. SAP solutions for the IoT are developed through co-innovation with customers and partners to help define new offerings based on market requirements and business challenges. SAP is enabling its ecosystem of partners to build new applications with SAP HANA Cloud Platform for the IoT to help customers to connect devices, machine and vehicle sensors, using application services to create a foundation to help ensure maximum development efficiency. For more information, visit the SAP News Center . Follow SAP on Twitter at @sapnews . About SAP As market leader in enterprise application software, SAP (NYSE: SAP ) helps companies of all sizes and industries run better. From back office to boardroom, warehouse to storefront, desktop to mobile device – SAP empowers people and organizations to work together more efficiently and use business insight more effectively to stay ahead of the competition. SAP applications and services enable more than 296,100 customers to operate profitably, adapt continuously, and grow sustainably. For more information, visit www.sap.com . Any statements contained in this document that are not historical facts are forward-looking statements as defined in the U.S. Private Securities Litigation Reform Act of 1995. Words such as \"anticipate,\" \"believe,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"predict,\" \"should\" and \"will\" and similar expressions as they relate to SAP are intended to identify such forward-looking statements. SAP undertakes no obligation to publicly update or revise any forward-looking statements. All forward-looking statements are subject to various risks and uncertainties that could cause actual results to differ materially from expectations. The factors that could affect SAP's future financial results are discussed more fully in SAP's filings with the U.S. Securities and Exchange Commission (\"SEC\"), including SAP's most recent Annual Report on Form 20-F filed with the SEC. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of their dates. © 2015 SAP SE. All rights reserved. SAP and other SAP products and services mentioned herein as well as their respective logos are trademarks or registered trademarks of SAP SE in Germany and other countries. Please see http://www.sap.com/corporate-en/legal/copyright/index.epx#trademark for additional trademark information and notices. For customers interested in learning more about SAP products: Global Customer Center: +49 180 534-34-24United States Only: 1 (800) 872-1SAP (1-800-872-1727) For more information, press only: Samantha Finnegan , SAP, +1 (415) 377-0475, samantha.finnegan@sap.com , EDT Susan Miller , SAP, +1 (610) 570-6845, susan.miller@sap.com , EDT", "external_links": [], "published": "2015-10-20T20:21:00.000+03:00", "crawled": "2015-10-20T20:06:45.545+03:00", "highlightTitle": ""}