{"organizations": [], "uuid": "c6ec642348547e6d0049c4725316fc097f1012f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "http://images.tribuneindia.com/cms/gall_content/2015/10/2015_10$largeimg25_Sunday_2015_012046303.jpg", "site_section": "http://www.tribuneindia.com/news/features/science-technology/", "section_title": "The Tribune: Science/technology/gadgets/environment ", "url": "http://www.tribuneindia.com/news/community/3-civilians-hurt-as-pak-pounds-jammu-villages/150185.html", "country": "US", "title": "3 civilians hurt as Pak pounds Jammu villages", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "3 civilians hurt as Pak pounds Jammu villages", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "c6ec642348547e6d0049c4725316fc097f1012f9"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/community/3-civilians-hurt-as-pak-pounds-jammu-villages/150185.html", "ord_in_thread": 0, "title": "3 civilians hurt as Pak pounds Jammu villages", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ravi Krishnan Khajuria\nTribune News Service\nJammu, October 24\nThree civilians were injured and nearly 20 houses damaged as Pakistan rained mortars through Friday night on nine Indian posts and forward villages along the Indo-Pak International Border in Samba and Hiranagar sub-sectors today. The Border Security Force said they responded in equal measure to the shelling. The exchange of fire continued till 5 am before guns fell silent on both sides. The injured have been identified as Surinder Kumar, Rohit Kumar and Suraj Singh of Mawa Village. “On Friday evening, Pakistan Rangers, in violation of the agreement reached between us at the DG-level meeting, opened sniper fire on labourers engaged in maintenance work,” said RK Sharma, BSF Inspector General (Jammu frontier). They deliberately targeted civilians to cause casualties and interrupt maintenance work, he added. Five cattle head were killed in the firing. “On Friday, Pakistan resorted to unprovoked firing on nine of our posts in the Samba sector from 10.25 pm, to which we retaliated effectively,” he said. On Friday evening, the BSF headquarters in Delhi lodged a protest via hotline with the Rangers telling them that they had violated the mandate of the DG-level meeting, said Sharma. “We will lodge a protest at the sector commander-level on Sunday,” he said. The fresh round of ceasefire violations by Pakistan since Friday evening to Saturday morning has so far left one labourer dead and five civilians injured. A labourer, Raj Kumar of Chhattisgarh, was killed and two others injured on Friday at Manguchak border outpost. “Rangers fired at nine posts in areas between Basantar and Tarnah rivers in the Samba sector. They also fired 82, 81 and 51 mm mortar shells,” said Sharma. A mortar exploded inside a Modern Higher Secondary School in Mawa where it damaged a school bus. “In early hours today, a minibus and a tractor were damaged and three cows died in the village in Pakistan shelling while two cattle head died in Patti village,” said a police officer. Manguchak, Mawa, Chachwal, Chalyari, Khora, Regal, Bobbiya, Londi, Sujanpur and Patti villages in Samba and Hiranagar sub-sectors were targeted by Pak Rangers through Friday night, he added. The ceasefire violations by Pakistan, which were almost a routine affair for several weeks, had ceased following DG-level talks between the BSF and Pakistan Rangers in Delhi on September 12. People in Chann Arorian in Kathua district later staged a protest and burnt a Pakistan flag. State Industries and Commerce Minister Chander Prakesh Ganga visited Mawa — the epicentre of Pak shelling — and to compensate a villager who lost cattle in the firing. BSF to lodge protest\nThe BSF will lodge a protest with Pakistan Rangers at a sector commander-level meeting on Sunday, said RK Sharma, Inspector General (Jammu frontier). On Friday, the BSF headquarters in Delhi lodged a protest via hotline with the Rangers telling them that they had violated the mandate of the DG-level meeting", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T07:03:59.202+02:00", "highlightTitle": ""}