{"organizations": [], "uuid": "b761b142c0ccdba6738580c255cc1bca9535689a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/18/13029119/Artlery.jpg", "site_section": "http://www.prweb.com/rss2/technology.xml", "section_title": "Technology", "url": "http://www.prweb.com/releases/2015/10/prweb13029119.htm", "country": "US", "title": "Appreciate Art Anywhere with Artlery", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Appreciate Art Anywhere with Artlery", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "b761b142c0ccdba6738580c255cc1bca9535689a"}, "author": "Press", "url": "http://www.prweb.com/releases/2015/10/prweb13029119.htm", "ord_in_thread": 0, "title": "Appreciate Art Anywhere with Artlery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Artlery was featured on NewsWatch as part of its monthly AppWatch, which takes a look at the latest and coolest applications on the market for iOS, Android, and Windows. Scott Steinberg, special reporter for NewsWatch and mobile technology expert, conducted the app review and shared with viewers how this app allows people to appreciate art anywhere. Art is an extremely vital part of the fabric of society - it keeps the world interesting, is the foundation of culture, and critically important to both science and technology. But unfortunately the art world is very small and overly exclusive. The Artlery app aims to solve this problem and help anyone appreciate art.\nWith Artlety, an art gallery works with artists to get their art listed within the app. They then setup something called an Initial Public Offering, which is a gift from the artist to the community, where anyone with the app that sees the art or is near it in a gallery can like it and get in on the revenue generated by its’ sale. The artist or gallery includes a percentage of the profit of the sale that the stakeholder can earn. If it’s resold later they can continue to make money off of it along with the artist.\nOnce a user has appreciated that art piece, they can share it on Facebook and gain more appreciation points. Artlery has a number of early trials under way including a popup gallery at the Payne Mansion Hotel in downtown San Francisco. Artlery is available for free on iOS and Android devices.\nTo learn more, visit http://www.artlery.com today.\nAbout NewsWatch\nNewsWatch is a weekly 30-minute consumer oriented television show that airs on the Discovery Channel and ION Network. NewsWatch regularly features top technology products and services, mobile applications for iOS, Android, and Windows devices, unique and beautiful travel destinations around the world, health and medical tips, and entertainment interviews on the show. NewsWatch airs on the Discovery Channel at 7:00 – 7:30 AM ET/PT.\nNewsWatch is located in the greater Washington, DC area and has been on air for over 25 years. For more information or to watch the most recent episode, visit http://newswatchtv.com/appwatch.html .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5hcnRsZXJ5LmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL25ld3N3YXRjaHR2LmNvbS9hcHB3YXRjaC5odG1s", "http://newswatchtv.com/appwatch.html"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T10:35:24.480+03:00", "highlightTitle": ""}