{"organizations": [], "uuid": "42d0a7f675e5f9fe8c3d938455e54a207ae826db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-22/activision-bets-you-will-want-to-watch-geeks-play-video-games", "country": "US", "title": "Activision Bets You Will Want to Watch Geeks Play Video Games", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Activision Bets You Will Want to Watch Geeks Play Video Games - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:02:00.000+03:00", "replies_count": 0, "uuid": "42d0a7f675e5f9fe8c3d938455e54a207ae826db"}, "author": "Christopher Palmeri", "url": "http://www.bloomberg.com/news/articles/2015-10-22/activision-bets-you-will-want-to-watch-geeks-play-video-games", "ord_in_thread": 0, "title": "Activision Bets You Will Want to Watch Geeks Play Video Games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Activision Blizzard Inc., the largest U.S.-based video game creator, is forming a division to target the fast-growing business of eSports, where video-game players compete against each other for prizes in front of live and online audiences.\nThe effort will be led by Steven Bornstein, a former chief executive officer of the NFL Network and ESPN, and Mike Sepso, co-founder of the online eSports network Major League Gaming, according to a statement Thursday from Santa Monica, California-based Activision.\nActivision CEO Bobby Kotick sees an opportunity to create a new global sports business, not unlike major sports. In August, Amazon.com Inc. agreed to buy Twitch Interactive Inc. for $970 million, obtaining an online video network focused on gamers.\n“There’s lots of opportunities for broadcast distribution,” Kotick said in an interview.\nCoordinating events for Activision’s growing roster of games on a local, national and international basis will attract more sponsors and make events “more compelling to watch,” Kotick said. For years, the company has hosted tournaments, such as its annual BlizzCon convention, set for next month in Anaheim, California.\nIn eSports, contestants play games such as League of Legends, from Riot Games, Valve Corp.’s Dota 2 and Activision’s Call of Duty in tournaments, many of which are broadcast online or on television.\nThe business originated in South Korea, where dedicated TV channels Ongamenet and MBC Game air regularly scheduled competitions, according to an Oct. 5 report from the brokerage firm Robert W. Baird & Co.\nESports, which now attract some 200 million viewers around the world, could become a $1 billion business by 2020, according to Baird. That’s up from $300 million this year.\nAdvertising and sponsorships are the main sources of revenue, followed by ticket sales and merchandise. For game publishers, the tournaments also increase awareness and purchases of their products.\nIn the U.S., eSports contests appear on Amazon’s Twitch network, as well as Google’s YouTube channels. Time Warner Inc.’s Turner Broadcasting division said last month it will air competitions on the TBS network on Friday nights starting next year. The first will feature Valve’s Counter-Strike: Global Offensive, a combat game.\nBornstein said his decision to focus on this business, rather than traditional sports, was based in part on his own 11-year-old boys who play Destiny, a game published by Activision, and watch eSports.\n“There are a lot of great entities in this space,” Bornstein said in an interview. “Now it’s time to try to figure out how to focus it and make it bigger.”\nBlizzCon, now in its 10th year, draws about 26,000 fans to the Anaheim Convention Center where it will run Nov. 6 and Nov. 7. Tickets cost $199 and online viewing is priced at $40. The tournaments offer $4 million in prizes.", "external_links": [], "published": "2015-10-22T20:02:00.000+03:00", "crawled": "2015-10-22T16:09:15.120+03:00", "highlightTitle": ""}