{"organizations": ["American Cancer Society", "FDA"], "uuid": "d88595680a565e6b20e9e5a18bed41437c07a8ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/FDA-approves-device-used-to-treat-prostate-cancer-48874-1/", "country": "US", "title": "FDA approves device used to treat prostate cancer", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "FDA approves device used to treat prostate cancer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T11:30:00.000+03:00", "replies_count": 0, "uuid": "d88595680a565e6b20e9e5a18bed41437c07a8ab"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/FDA-approves-device-used-to-treat-prostate-cancer-48874-1/", "ord_in_thread": 0, "title": "FDA approves device used to treat prostate cancer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Suarez", "George Suarez"], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY FDA approves device used to treat prostate cancer ... MIAMI Oct. 13 2015 /- A ...Dr. George Suarez a pioneering sp...The American Cancer Society projects that more than 2 men will b...Dr. Suarez was a founder of SonaCare the company that manufactures a... http://feeds.bio-medicine.org/latest-medical-technology Date:10/13/2015 \nMIAMI , Oct. 13, 2015 /PRNewswire/ -- A minimally-invasive treatment just became available to men suffering from prostate cancer in the United States. After more than 10 years of clinical trials, the Food and Drug Administration on October 9 approved the use of High Intensity Focused Ultrasound (HIFU), a procedure that can zero in on cancer cells while protecting surrounding tissue and minimizing chances for erectile and urinary dysfunction associated with other treatments. \nDr. George Suarez , a pioneering Miami urologist who spearheaded the HIFU clinical trials with the FDA, is the foremost expert on the procedure in the U.S. He has treated several thousand patients over the past 12 years in countries where it has been available and is eager to explain why it can now be a lifesaver and quality-of-lifesaver for American men. \nThe American Cancer Society projects that more than 200,000 men will be diagnosed with prostate cancer in 2015 and more than 25,000 will die. HIFU has been used to treat prostate cancer in Europe , Asia , and much of the rest of the world for twenty years. \nDr. Suarez, was a founder of SonaCare, the company that manufactures and markets the newly-approved equipment, and was also the first American urologist to perform HIFU treatment for prostate cancer in the Western Hemisphere. He has authored numerous articles on the application of HIFU including a physician's training manual for the Sonablate device. Moreover, he is the only urologist in North America that is trained and certified on both the European HIFU device, EDAP's Ablatherm as well as SonaCare's Sonablate. \nIn 2000, Dr. Suarez established the first HIFU facility in North America at the Universidad Madre y Maestra, Santiago , Dominican Republic , a private, Catholic medical school owned and operated by the Vatican. He subsequently established similar HIFU facilities throughout Canada , Mexico , South America and the Caribbean , all countries in which HIFU was approved based on European (CE) approval that dates back to 1996. \nWhile maintaining his urological practice in Miami as well as the most advanced state-of-the-art HIFU center in the Caribbean located in Grand Cayman , Dr. Suarez is now actively exploring opening HIFU treatment centers in Florida and other U.S. cities. \nFor more about Dr. George Suarez :", "external_links": [], "published": "2015-10-13T11:30:00.000+03:00", "crawled": "2015-10-13T23:57:49.548+03:00", "highlightTitle": ""}