{"organizations": [], "uuid": "ae35eace00b0bc4c9fc0133cfd37c7b615a74fe7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnet.com", "main_image": "http://cnet1.cbsistatic.com/hub/i/r/2015/10/22/c93782e1-a2e0-4617-a96d-6e995330e885/thumbnail/670x503/2c4d6661fcd2b7cca9d2437ba6044067/nasastar.jpg", "site_section": "http://www.cnet.com/news/", "section_title": "Technology News - CNET News - CNET", "url": "http://www.cnet.com/news/nasa-spots-real-death-star-vaporizing-a-mini-planet/", "country": "US", "title": "NASA spots real 'Death Star' vaporizing a mini planet", "performance_score": 2, "site": "cnet.com", "participants_count": 1, "title_full": "NASA spots real 'Death Star' vaporizing a mini planet - CNET", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:20:00.000+03:00", "replies_count": 0, "uuid": "ae35eace00b0bc4c9fc0133cfd37c7b615a74fe7"}, "author": "Amanda Kooser", "url": "http://www.cnet.com/news/nasa-spots-real-death-star-vaporizing-a-mini-planet/", "ord_in_thread": 0, "title": "NASA spots real 'Death Star' vaporizing a mini planet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Enlarge Image An artist's idea of what the mini-planet vaporization would look like. CfA/Mark A. Garlick\nThe Death Star in Star Wars is something to be feared. It's a superweapon in space, capable of blasting away a planet on a whim. Darth Vader's deadly ride now has a real-life doppelganger. NASA announced Wednesday it found evidence of a white dwarf star destroying a nearby small rocky object.\nNASA's Kepler telescope spotted evidence of the dramatic scene playing out in space. \"This discovery validates a long-held theory that white dwarfs are capable of cannibalizing possible remnant planets that have survived within its solar system,\" NASA notes .\nWhite dwarfs are dense dead stars that have already been through the super-sized red-giant phase of their lifespans and then shrunk in on themselves.\n\"We are for the first time witnessing a miniature 'planet' ripped apart by intense gravity, being vaporized by starlight and raining rocky material onto its star,\" said Andrew Vanderburg , lead author of a paper on the findings that was published in the journal Nature Wednesday.\nThe \"mini planet\" described by NASA is more accurately called a planetesimal, which is a small object made up of dust, rock and other space debris. It orbits the white dwarf every 4.5 hours, which means it's dangerously up close and personal with the dying star.\nKepler was able to pick up a regular dimming of the light coming from the white dwarf, indicating the presence of the planetesimal, which showed signs of breaking up in its orbit. \"For the last decade we've suspected that white dwarf stars were feeding on the remains of rocky objects, and this result may be the smoking gun we're looking for,\" NASA staff scientist Fergal Mullally said.\nKepler is currently engaged in its K2 mission of monitoring distant stars and looking for signs of planets around them. The mission started last year.", "external_links": ["http://www.nasa.gov/ames/kepler/nasa-k2-finds-dead-star-vaporizing-mini-planet", "http://cnet2.cbsistatic.com/hub/i/r/2015/10/22/c93782e1-a2e0-4617-a96d-6e995330e885/resize/570xauto/536c83ae9a6377fe32eab4be8c5be500/nasastar.jpg", "http://www.nature.com/nature/journal/v526/n7574/full/nature15527.html"], "published": "2015-10-22T17:20:00.000+03:00", "crawled": "2015-10-22T19:29:44.368+03:00", "highlightTitle": ""}