{"organizations": [], "uuid": "919c2731d858c86f6df7029421a00f43b1569fea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maritimeglobalnews.com", "main_image": "", "site_section": "http://www.maritimeglobalnews.com/technology", "section_title": "Technology - maritime global news ", "url": "http://www.maritimeglobalnews.com/news/tackling-subsea-blockages-bwkhpx", "country": "US", "title": "Tackling Subsea Blockages", "performance_score": 0, "site": "maritimeglobalnews.com", "participants_count": 1, "title_full": "Tackling Subsea Blockages - maritime global news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "919c2731d858c86f6df7029421a00f43b1569fea"}, "author": "Angus Macaulay", "url": "http://www.maritimeglobalnews.com/news/tackling-subsea-blockages-bwkhpx", "ord_in_thread": 0, "title": "Tackling Subsea Blockages", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Subsea blockages are a common industry challenge that can be so complex and costly to treat that some operators are known to leave multiple flow lines blocked for over a decade.\nThis issue is set to become more challenging to solve, as we deal with complex reservoir conditions and fluids and more challenging flow-assurance conditions. With oil and gas production venturing into deeper waters, increasing tie-back distance, higher temperatures and greater pressures, the remediation of restrictions and blockages in subsea pipelines will become more difficult to combat as time moves on.\nWithin subsea infrastructure, blockages can affect risers, flow lines, pipelines, umbilical, pipeline end terminations (PLETS) and manifolds. Blockages can occur for a variety of reasons and some simply come down to a lack of infrastructure maintenance. Whatever the cause, the effect can be a significant loss of revenue with far-reaching consequences.\nA buildup of wax, scale, asphaltene or hydrates will severely affect production and hamper field profitability. Remediation methods are historically costly and include deploying a coiled-tubing system from a rig into the pipeline or undertaking subsea intervention via remotely operated vehicle (ROV) or saturation divers. The requirement for a rig or vessel to undertake the work can also significantly delay the time to implement a solution, further contributing toward making these options uneconomical. Replacing the pipeline can be a time consuming and costly exercise to undertake. The blocked line would still require decontamination as per the Department of Energy and Climate Change (DECC) requirements prior to decommissioning and retrieval.\nEnter Pipe Pulse\nOne international oil company operating in the North Sea suffered persistent blockage on a 15 kilometer flow line for 11 years and lost an estimated 350 barrels per day. Another had a subsea flow line blocked for 10 months with sand and wax.\nLocated 16 kilometers from the host platform, the six-inch multiphase flow line lay at a water depth of 100 meters. This operator had tried a variety of conventional methods to tackle the issue, but due to the remote location of the blockages from the host platform, access to the pipelines and the subsea infrastructure proved difficult. A number of topsides and subsea issues were left unsolved.\nA nonintrusive removal of subsea blockages was needed, and the solution was the Pipe-Pulse flow oscillation method. Deploying this type of technology cleared the blockage in all these examples and lines could be flushed within 2.5 days. It took less than a week to unblock multiple flow lines in this central North Sea field.\nDuring the test phase of its development, Pipe-Pulse had accurately detected a blockage for an operator in the North Sea which turned out to be a collapsed flexible jumper 10 kilometers into the gas lift line of an umbilical. This knowledge saved the client an estimated $600,000 for not having to mobilize a DSV to investigate the blockage.\nPipe-Pulse has also been used to solve a number of paraffin wax blockages in the Gulf of Mexico, and the unblocking operations let oil companies get their wells back online. In one case, the blockage occurred in a 16-mile, five-inch flow line, and the operator had failed to unblock the blockage despite six months of trying. Pulsing cleared the blockage in two weeks and full-flow resumed without the need to shut down the flow line.\nGulf Interventions\nA high-frequency low-amplitude flow oscillator for the removal of blockages in pipelines and umbilical offers a low cost solution which completes in days rather than months with minimum vessel requirements. A rapid response service also minimizes HSE exposure, reducing the requirement for diver intervention programs, and diver intervention inside lines that might have trapped pressure.\nTypical blockage locations include chemical injection umbilical, production risers, manifolds, flow lines and pipelines. Pipe-Pulse is effective in all of these applications even in long-distance or large-diameter pipework.\nPipe-Pulse works remotely and can locate and remove blockages in pipework up to 50 kilometers distant. This deblocking system is designed to be connected on the topside facilities of a host platform via the pig launcher or umbilical termination unit. The unit delivers high-energy and high-volume pressure pulses into the pipeline or subsea umbilical. These pulses transmit at the speed of sound to the blockage miles away. Four engineers on a unit per shift control the length and pressure of the pulse.\nSteady pulse\nThe Paradigm system uses a touch-screen panel to operate a complex series of control valves in the body of a Pipe-Pulse unit. Algorithms determine the optimum wave structure for each pulse from potentially millions for each particular job. The unit then physically creates and injects the manufactured pulse into the pipeline, a far more effective method than applying pressure alone.\nWhile water is the fluid of choice, a number of chemicals have been used where water incompatibility is an issue. Solvents and monoethylene glycol have been used successfully where required, but these are avoided due to handling issues.\nEach debris removal ought to be uniquely engineered depending on the subsea infrastructure, and that's what Paradigm does. Sometimes, a blockage can be pushed to a larger flow line and circulated out. Occasionally, flushing heavily with chemicals may be necessary once a bypass has been achieved, or flow from a well can be brought on to flush debris back to the surface.\nSpace is often at a premium offshore. The Pipe-Pulse is just one meter wide by two meters tall and fits into the most cramped Zone 1 hazardous area. The two units needed for operations are 1,763 pounds each yet still achieve flows of five barrels per minute while operating at 10,000 psi.\nDeeper water, complex reservoirs and aging equipment all push prices up. This solution from paradigm solves at least one expensive problem cost-effectively, and in deep water, the Pipe-Pulse delivers dramatic savings. Where chronic obstructions have gone unresolved for years, millions of dollars can be saved by not having to replace umbilical or pipeline.\n(As published in the September 2015 edition of Marine Technology Reporter - http://www.marinetechnologynews.com/Magazine )", "external_links": ["http://www.marinetechnologynews.com/Magazine"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-09T02:10:55.781+03:00", "highlightTitle": ""}