{"organizations": ["China Communist Party"], "uuid": "3b55ae548cd415dfa9b9b063fce5bc36aa4f082a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.terradaily.com", "main_image": "http://www.spxdaily.com/images-bg/chemical-plant-fire-china-zhangzhou-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.terradaily.com/reports/China_Communist_Party_expels_safety_chief_after_Tianjin_blasts_999.html", "country": "US", "title": "China Communist Party expels safety chief after Tianjin blasts", "performance_score": 0, "site": "terradaily.com", "participants_count": 0, "title_full": "China Communist Party expels safety chief after Tianjin blasts", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T14:33:00.000+03:00", "replies_count": 0, "uuid": "3b55ae548cd415dfa9b9b063fce5bc36aa4f082a"}, "author": "", "url": "http://www.terradaily.com/reports/China_Communist_Party_expels_safety_chief_after_Tianjin_blasts_999.html", "ord_in_thread": 0, "title": "China Communist Party expels safety chief after Tianjin blasts", "locations": ["Tianjin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China Communist Party expels safety chief after Tianjin blasts by Staff Writers Beijing (AFP) Oct 16, 2015 \nThe former head of China's work safety authority has been ousted from the ruling Communist Party for corruption, its anti-graft watchdog said Friday, after giant explosions in Tianjin that killed at least 165. \nYang Dongliang, 61, was removed as director of the State Administration of Work Safety two weeks after a series of detonations at a dangerous chemicals storage facility rocked the northern port in August. \nBefore taking up his national post Yang worked in Tianjin for 18 years and rose to be one of its vice mayors. \nHe was stripped of his party membership and transferred to judicial authorities -- normally a precursor to prosecution and trial, with conviction virtually guaranteed in the country's party-supervised courts -- the Central Commission for Discipline Inspection (CCDI) said in a statement Friday. \nAs a senior cadre of the party, Yang \"lost his ideals and conviction\", said the statement. \nAn investigation found Yang, among other things, violated regulations to land jobs and promotions for his son, took advantage of his power to embezzle public properties and assets, and sought business gains for companies in exchange for bribes, the statement said. \nHis actions were \"vicious in nature and the circumstances were particularly serious\", it said, using phrases that often portend severe punishment in China's legal system. \nThe CCDI in the same statement also announced the expulsion of Zhou Benshun, previously the most senior official in Hebei province, which neighbours Beijing, and a close ally of jailed ex-security chief Zhou Yongkang. \nAccusations against Zhou Benshun included illegally keeping confidential documents and leaking party and state secrets, making comments that ran afoul of top party leaders' stances on \"major issues\", and taking bribes, it said. \nHis case has also been handed over to judicial authorities, it added. \nSix other acolytes of Zhou Yongkang went through court proceedings this week, with four of them sentenced to between 12 and 20 years in jail and verdicts pending on the other two. \nChinese President Xi Jinping has pursued a highly publicised anti-graft drive since taking office, vowing to go after both senior \"tigers\" and low-level \"flies\". \nZhou Yongkang, who was imprisoned for life in June after a secret trial, was the highest ranking ex-official prosecuted by Beijing in decades. \nBut some critics liken the campaign to a political purge and say the Communist Party has failed to introduce systemic reforms to prevent graft, such as public disclosure of assets. .", "external_links": [], "published": "2015-10-18T14:33:00.000+03:00", "crawled": "2015-10-18T16:16:05.587+03:00", "highlightTitle": ""}