{"organizations": ["NACOR", "American Society of Anesthesiologists", "ASA"], "uuid": "acaa7e8fc3e7e119be2dd1b2d0dee710d521b7cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/American-Society-of-Anesthesiologists-selects-ArborMetrix-cloud-analytics-to-power-National-Anesthesia-Clinical-Outcomes-Registry--28NACOR-29-49273-1/", "country": "US", "title": "American Society of Anesthesiologists selects ArborMetrix cloud analytics to power National Anesthesia Clinical Outcomes Registry (NACOR)", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "American Society of Anesthesiologists selects ArborMetrix cloud analytics to power National Anesthesia Clinical Outcomes Registry (NACOR)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T12:18:00.000+03:00", "replies_count": 0, "uuid": "acaa7e8fc3e7e119be2dd1b2d0dee710d521b7cd"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/American-Society-of-Anesthesiologists-selects-ArborMetrix-cloud-analytics-to-power-National-Anesthesia-Clinical-Outcomes-Registry--28NACOR-29-49273-1/", "ord_in_thread": 0, "title": "American Society of Anesthesiologists selects ArborMetrix cloud analytics to power National Anesthesia Clinical Outcomes Registry (NACOR)", "locations": ["U.S."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ANN ARBOR"], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY American Society of Anesthesiologists selects ArborMetrix cloud analytics to power National Anesthesia Clinical Outcomes Registry (NACOR) ... ANN ARBOR Mich. Oct. 23 2015 /PRNewswire/...NACOR is one of the largest registries operating in the U.S. with mor...AQI was established by ASA in 2009 to facilitate practice-based qualit... AQI is the primary resource for physician anesthesiologists looking t... http://feeds.bio-medicine.org/latest-medical-technology Date:10/23/2015 \nANN ARBOR, Mich. , Oct. 23, 2015 /PRNewswire/ -- ArborMetrix announced today that the American Society of Anesthesiologists (ASA) Anesthesia Quality Institute (AQI) will use the company's RegistryMetrix ® cloud-based analytics to power AQI's National Anesthesia Clinical Outcomes Registry (NACOR). \nNACOR is one of the largest registries operating in the U.S., with more than 31 million patient cases. NACOR has been designated as a Qualified Clinical Data Registry (QCDR) by the Centers for Medicare and Medicaid Services (CMS) for the Physician Quality Reporting System (PQRS). \nAQI was established by ASA in 2009 to facilitate practice-based quality management through education and quality data feedback. Today, the AQI carries out this mission by helping hospitals and practices answer important questions about the care they deliver by gathering, analyzing, and providing the data that providers need. Through education and quality data feedback, AQI establishes evidence-based rationales to improve the care of patients, speed the response to critical incidents and reduce anesthesia-related morbidity and mortality. \n\"AQI is the primary resource for physician anesthesiologists looking to assess and improve patient care as health care shifts to a value-based care model,\" said ASA President J.P. Abenstein, M.S.E.E., MD. \"Currently, more than 33,000 professionals are actively submitting data into NACOR. As we continue to grow, the data infrastructure and reporting system provided through RegistryMetrix will help us to identify best practices and opportunities for quality improvement by ASA members nationwide.\" \nNACOR provides participating providers with custom continuous performance monitors; performance gap analysis and patient outlier identification; access to improvement interventions to close performance gaps including patient care management tools, targeted education, and links to anesthesia information technology vendors; and peer-to-peer benchmarks. \n\"The NACOR registry is one of the largest and most important sources of clinical quality content in the country and affects all aspects of surgical care,\" said Brett Furst , CEO of ArborMetrix. \"We are delighted to be selected to strategically partner with ASA and AQI to evolve NACOR to the next level of performance measurement and quality improvement.\" \nArborMetrix will provide NACOR with a state-of-the-art registry system based on its proprietary cloud-based software platform. RegistryMetrix's electronic data integration, analytics, and dashboard reporting system will be used to collect patient information and perform real-time risk and reliability adjusted outcomes reporting. It will also provide analytics and reporting modules to help accelerate the quality improvement initiatives of AQI and participating practices. \nTWEET THIS: .@ASALifeline to measure physician anesthesiologists' performance, quality with @ArborMetrix #ClinicalAnalytics. http://bit.ly/1C4iaUE \nAbout The American Society of AnesthesiologistsFounded in 1905, the American Society of Anesthesiologists (ASA®) is an educational, research and scientific society with more than 52,000 members organized to raise and maintain the standards of the medical practice of anesthesiology. ASA is committed to ensuring physician anesthesiologists evaluate and supervise the medical care of patients before, during and after surgery to provide the highest quality and safest care every patient deserves. \nFor more information on the field of anesthesiology, visit the American Society of Anesthesiologists online at asahq.org . To learn more about the role physician anesthesiologists play in ensuring patient safety, visit asahq.org/WhenSecondsCoun t . Join the ANESTHESIOLOGY® 2015 social conversation today. Like ASA on Facebook , follow ASALifeline on Twitter and use the hashtag #ANES2015. \nAbout ArborMetrix ArborMetrix, Inc. , located in Ann Arbor, Michigan , provides a unique, private cloud-based platform for performance measurement and clinical intelligence in acute and specialty care. Based on its industry changing econometric research, ArborMetrix solutions deliver rigorous data analysis while incorporating advanced risk and reliability adjustments. With actionable insights grounded in clinical evidence, ArborMetrix clients quickly achieve quality improvements and cost savings. For more information, visit www.arbormetrix.com , email info@arbormetrix.com or call 734-661-7949. \nMedia Contact:", "external_links": [], "published": "2015-10-23T12:18:00.000+03:00", "crawled": "2015-10-24T10:47:15.115+03:00", "highlightTitle": ""}