{"organizations": [], "uuid": "259ff081bde30ec4512eafe6c72bcc3171399b8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://www.chron.com/img/pages/article/opengraph_default.jpg", "site_section": "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php", "section_title": "AP Technology and Science", "url": "http://www.chron.com/news/science/article/Prominent-astronomer-resigns-over-student-sexual-6571677.php", "country": "US", "title": "Prominent astronomer resigns over student sexual harassment", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Prominent astronomer resigns over student sexual harassment - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:13:00.000+03:00", "replies_count": 0, "uuid": "259ff081bde30ec4512eafe6c72bcc3171399b8c"}, "author": "chron.com", "url": "http://www.chron.com/news/science/article/Prominent-astronomer-resigns-over-student-sexual-6571677.php", "ord_in_thread": 0, "title": "Prominent astronomer resigns over student sexual harassment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN FRANCISCO (AP) — A well-known astronomer resigned from the University of California , Berkeley, where he had been a professor for 16 years after an investigation found he sexually harassed several female students, two top administrators said.\nThe university immediately accepted Professor Geoffrey Marcy 's resignation, according to a Wednesday statement from Chancellor Nicholas B. Dirks and Executive Vice Chancellor and Provost Claude Steele . It called Marcy's conduct \"contemptible and inexcusable.\"\n\"We also want to express our sympathy to the women who were victimized, and we deeply regret the pain they have suffered,\" the statement released said.\nThe university has not released details of a six-month investigation into one of the world's leading experts on planets outside Earth's solar system, which found he violated the campus' sexual harassment policies. The inquiry that ended in June stemmed from complaints from former students and involved incidents dating as far back as 2001.\nAn email to Marcy wasn't immediately returned. He apologized last week, but the university faced growing pressure to fire him.\n\"UC Berkeley's reaction to the finding that Professor Geoff Marcy violated the university's sexual harassment policies has been the subject of understandable criticism and anger,\" the administrators said.\nAfter the investigation and the nature of the complaints first were reported by BuzzFeed News , UC Berkeley said Marcy had agreed to clear parameters around his behavior, knowing that he would be subject to automatic suspension or dismissal for any violations.\nThe school described the agreement Marcy reached with Vice Provost for Faculty Janet Broughton as \"the most certain and effective option for preventing any inappropriate future conduct\" because it bypassed a lengthy disciplinary process that would have required a hearing before a faculty committee.\nSome of Marcy's colleagues and former students were angry that he had not been sanctioned more severely.\nThe pressure on both the university and him mounted this week when 25 members of Berkeley's astronomy department, including its interim chairman, issued a letter saying he was no longer fit \"to perform the functions of a faculty member.\"\n\"My guess is he his position was untenable,\" American Astronomical Society President Meg Urry , a physics professor at Yale, said of Marcy's resignation. \"I've seen very senior astronomers calling for this from him, so I think he probably understood it wasn't going to be viable.\"\nWhether a scientist of Marcy's stature will find a new academic position is unclear, Urry said, adding that if he does he should not be allowed to teach undergraduates.\nUrry said that while she was heartened by the condemnation Marcy's actions inspired, she hopes it will lead to a sustained reevaluation of what constitutes sexual harassment and the responsibility of universities and professional organizations to address it.\n\"We know it happens at other places. This is a problem women have to deal with all the time, usually at a much less serious level,\" she said. \"Even the mild harassment is very damaging, so we really want to point out to our community that we each have a responsibility of looking at our own spaces, our own institutions, our own departments and a very strong responsibility as bystanders.\"\nThe behavior Berkeley's investigation substantiated would constitute a breach of the American Astronomical Society's ethics policy, Urry said. The organization now plans to come up with a process for stripping a member of membership and could decide to apply it to Marcy, she said.\nMarcy posted a public apology on his website ( http://bit.ly/1jtpjrT ) in a letter he sought to have published in the newsletter of the society's Committee on the Status of Women in Astronomy. The committee declined his request.\n\"While I don't agree with each complaint that has been made, it's clear my actions made some women uncomfortable and, for that, I sincerely apologize,\" he told The Associated Press in an email Monday. \"I have worked hard to change and will continue to focus my efforts on promoting a supportive and respectful environment both in the astronomy community and more broadly.\"", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://bit.ly/1jtpjrT", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-10-15T10:13:00.000+03:00", "crawled": "2015-10-15T10:38:09.407+03:00", "highlightTitle": ""}