{"organizations": [], "uuid": "c641a330d4a35b58f38de3908b5332cbd335f7e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ghacks.net", "main_image": "http://cdn.ghacks.net/wp-content/uploads/2015/10/firefox-64-bit-windows-stable.jpg", "site_section": "http://feeds.feedburner.com/Ghacksnet", "section_title": "gHacks Technology News", "url": "http://www.ghacks.net/2015/10/17/fingers-crossed-firefox-64-bit-for-windows-to-be-released-when-firefox-42-comes-out/", "country": "US", "title": "Fingers crossed: Firefox 64-bit for Windows to be released when Firefox 42 comes out", "performance_score": 0, "site": "ghacks.net", "participants_count": 1, "title_full": "Fingers crossed: Firefox 64-bit for Windows to be released when Firefox 42 comes out", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T10:05:00.000+03:00", "replies_count": 0, "uuid": "c641a330d4a35b58f38de3908b5332cbd335f7e6"}, "author": "Martin Brinkmann", "url": "http://www.ghacks.net/2015/10/17/fingers-crossed-firefox-64-bit-for-windows-to-be-released-when-firefox-42-comes-out/", "ord_in_thread": 0, "title": "Fingers crossed: Firefox 64-bit for Windows to be released when Firefox 42 comes out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fingers crossed: Firefox 64-bit for Windows to be released when Firefox 42 comes out By Martin Brinkmann on October 17, 2015 in Firefox - Last Update: October 17, 2015 10 \nWhile there is certainly some truth to the saying that good things take time, no one probably anticipated the drama surrounding the release of a 64-bit version of Firefox. If they would have, they would have probably not used it in this case. \nSo, Firefox has been available as a 64-bit version for Linux and Mac systems for a very long time. There are also 64-bit development versions of Firefox for Windows, but no stable versions yet. \nMozilla switched gears in the development process several times in the past five or so years making the 64-bit version of Windows a priority, then almost dumping it, and then a priority again . \nAfter making the 64-bit version a priority again in 2014, Mozilla has been trying to get a stable version out but it has been delayed several times for various reasons since then. It is largely unclear why it took Mozilla that long of a time especially since Firefox spin-offs like Pale Moon or Waterfox have been available as 64-bit versions for years. \nA recent discussion on the company's Bugzilla bug tracking website indicates that Mozilla may finally be ready to release a stable 64-bit version of the browser for Windows. \nFirefox 42 will be released November 3, 2015 if things go as planned. Before you start jumping up and down in joy, you should know that the release won't be pushed to the public right away. \nMozilla will only release the 64-bit version of Firefox 42 Stable to the official FTP directory but not to the download pages on the Mozilla website. \nSo, if you have been waiting to get your hands on a stable 64-bit version of Firefox, you need to point your current browser to the latest release directory and snag it from there. \nWe won't update the download page with Windows 64 builds for 42. We are waiting for some partner changes before making that public. However, the binaries will be available on the ftp for testing: \nThe reason for this is that Mozilla is waiting for \"some partner changes\" for the 64-bit version of Firefox. It is unclear who these partners are and what these changes entail though. \nMozilla announced earlier that the 64-bit version of Firefox would ship without NPAPI plugin support . \nIf you want to know more about the differences between 32-bit and 64-bit versions of Firefox , check out our guide that provides you with those information. Summary Fingers crossed: Firefox 64-bit for Windows to be released when Firefox 42 comes out Author Martin Brinkmann Description It seems that the 64-bit version of Firefox for Windows is finally going to be released by Mozilla when Firefox 42 comes out in early November 2015. Please share this article About Martin Brinkmann Martin Brinkmann is a journalist from Germany who founded Ghacks Technology News Back in 2005. He is passionate about all things tech and knows the Internet and computers like the back of his hand. You can follow Martin on Facebook , Twitter or Google+", "external_links": [], "published": "2015-10-17T10:05:00.000+03:00", "crawled": "2015-10-17T17:14:56.863+03:00", "highlightTitle": ""}