{"organizations": [], "uuid": "db49c6987869c15019f8041377c763916eada8ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1137984/ems-software-announces-next-two-product-releases", "country": "US", "title": "EMS Software Announces Next Two Product Releases", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "EMS Software Announces Next Two Product Releases", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:00:00.000+03:00", "replies_count": 0, "uuid": "db49c6987869c15019f8041377c763916eada8ef"}, "author": "admin", "url": "http://www.freshnews.com/news/1137984/ems-software-announces-next-two-product-releases", "ord_in_thread": 0, "title": "EMS Software Announces Next Two Product Releases", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/8/2015 @ 3:00 AM Companies mentioned in this article: EMS Software \nDENVER, CO--(Marketwired - October 08, 2015) - EMS Software™, the leading meeting and room scheduling software provider, today announced its next two product releases, available in January and June of 2016. In-depth demonstrations will be available for attendees at EMS Live! 2015 , the company’s annual conference to be held October 26-28 in Orlando. \n“The EMS release in January extends our market leadership. We will offer even more breadth and depth of functionality for the expert user,” said PG Bartlett, the EMS Software vice president of product. “The EMS release in June will deliver significant functional improvements and a better experience for the everyday user.” Read more from Bartlett about the next two releases in his recent blog post, What’s the Future of EMS? \nThe EMS release in January 2016 features the top customer requested enhancements: Automated report generation and delivery: Set up reports and schedule them to run and distribute automatically. Operational users like caterers and audio / visual teams will be able to retrieve their reports without having to log in. Simplified user-defined fields (UDFs): Simplified data collection for creating meetings and scheduling services. Enhanced notification rules: Provides precise, relevant, and actionable information to service providers to ensure more accurate and timely fulfillment of the services for meetings and events. Booking check-in: Free up rooms that are reserved but not being used, allowing others to take advantage of the room for their meeting needs. Easily deployable desktop client: Click on a link to install the client software, even if users do not have administrative privileges. Updates to the client will install automatically, without requiring user involvement. \nThe EMS release in June 2016 will focus on giving everyday users the fastest and easiest way to schedule a meeting. It will deliver a more intuitive user experience, including a completely redesigned web application and a new mobile application. In addition, EMS will significantly improve how it works with Microsoft® Outlook. \nAbout EMS Software EMS Software™ helps millions of people create great meetings. AIG, Yale University, Accenture, and thousands of others rely on EMS Software to increase productivity, attract and retain people, reduce costs, and differentiate their brand. EMS Software offers the greatest depth and breadth of functionality, the fastest and easiest way to schedule a meeting, and an exceptional customer experience. For more information, please visit dea.com . Contact:", "external_links": [], "published": "2015-10-08T13:00:00.000+03:00", "crawled": "2015-10-08T14:45:28.968+03:00", "highlightTitle": ""}