{"organizations": [], "uuid": "f49223374c4803fca066c8313d4936bc846285d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3268698.1444754125!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_1180/oviraptors.jpeg", "site_section": "http://rss.cbc.ca/lineup/technology.xml\r", "section_title": "CBC | Technology News", "url": "http://www.cbc.ca/news/technology/dinosaur-eggs-blood-1.3268687?cmp=rss", "country": "IL", "title": "Fossil eggs reveal how warm blooded dinosaurs were", "performance_score": 0, "site": "cbc.ca", "participants_count": 1, "title_full": "Fossil eggs reveal how warm blooded dinosaurs were", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T19:53:00.000+03:00", "replies_count": 0, "uuid": "f49223374c4803fca066c8313d4936bc846285d0"}, "author": "CBC News", "url": "http://www.cbc.ca/news/technology/dinosaur-eggs-blood-1.3268687?cmp=rss", "ord_in_thread": 0, "title": "Fossil eggs reveal how warm blooded dinosaurs were", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fossil eggs reveal how warm blooded dinosaurs were Titanosaurs were warm blooded, but bird-like oviraptors weren't that warm, study finds CBC News Posted: Oct 13, 2015 12:53 PM ET Last Updated: Oct 13, 2015 2:05 PM ET Bird-like oviraptors from Mongolia, pictured in an artists' conception, had body temperatures that averaged 31.9 C, much lower than modern birds' average of 36 to 43 C. ( Doyle Trankina and Gerald Grellet-Tinner) Related Stories Summary of the paper in Nature Communications (Note: CBC does not endorse and is not responsible for the content of external links.) \nScientists have used the fossilized eggshells of dinosaurs to estimate their body temperatures — and have revealed some surprises. \nResearchers have long debated whether dinosaurs were warm blooded like their living relatives, modern birds. In recent decades, the idea that dinosaurs — especially later, smaller, more bird-like dinosaurs – were warm blooded and active like birds, rather than more sluggish like cold-blooded lizards, has become more popular among scientists. New dinosaur finds soar in 'golden age' of dinosaur discovery \nThe new estimates from an international team of scientists suggests some dinosaurs were quite warm blooded — huge, long-necked plant eaters called titanosaurs that lived in ancient Argentina had average body temperatures of 37.6 C. But more bird-like oviraptors from Mongolia had body temperatures that averaged 31.9 C — much lower than modern birds' average of 36 to 43 C, but still higher than the temperature of the surrounding environment, which was estimated to be 26.3 C. \n\"The temperatures we measured suggest that at least some dinosaurs were not fully endotherms [warm-blooded] like modern birds,\" said Robert Eagle, a scientist at the University of California, Los Angeles, who led the research. \"They may have been intermediate — somewhere between modern alligators and crocodiles and modern birds.\" \nThe results were published in the journal Nature Communications . This clutch of fossil Titanosaur eggs was found in Argentina. The shells reveal the body temperature of the mother dinosaur when she produced them. (Luis Chiappe) \nThe researchers aren't sure why the titanosaurs, which are generally considered more reptile-like and less bird-like than oviraptors, were warmer, but they suggested two possible explanations. Titanosaurs could have elaborate systems to regulate their temperature the way modern birds and mammals do. They might just stay warm more easily due to their large size, as leatherback turtles do. \nThe researchers estimated dinosaurs' body temperatures by examining their fossilized eggshells. Eggshells contain small amounts of heavier forms of carbon and oxygen that tend to cluster together more when the temperature is lower. \nBy looking at the amount of clustering of those isotopes, the researchers were able to estimate the body temperature of the mother dinosaur at the time she produced the eggs. \nThe researchers found the estimated body temperatures for the titanosaurs was similar to earlier estimates they had made based on their analysis of the dinosaurs' teeth. A technician lies next to the femur of a Titanosaurus nicknamed 'the giant' at the Egidio Feruglio Museum in Argentina. Titanosaurs were huge, long-necked plant eaters that could grow up to 40 metres long. (Reuters/Museo Egidio Feruglio)", "external_links": [], "published": "2015-10-13T19:53:00.000+03:00", "crawled": "2015-10-13T21:42:17.063+03:00", "highlightTitle": ""}