{"organizations": [], "uuid": "02a071f4b2d2ff6f3371913b90be448a7f7cbd45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.iol.co.za", "main_image": "http://www.iol.co.za/polopoly_fs/iol-news-pic-ecstasy-tablets-pills-1.1537979!/image/3321251360.jpg_gen/derivatives/box_600/3321251360.jpg", "site_section": "http://www.iol.co.za/cmlink/scitech-technology-rss-1.847487", "section_title": "Scitech Technology RSS", "url": "http://www.iol.co.za/social-media-plan-to-fight-drug-abuse-1.1925089", "country": "US", "title": "Social media plan to fight drug abuse", "performance_score": 0, "site": "iol.co.za", "participants_count": 0, "title_full": "Social media plan to fight drug abuse", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T11:44:00.000+03:00", "replies_count": 0, "uuid": "02a071f4b2d2ff6f3371913b90be448a7f7cbd45"}, "author": "", "url": "http://www.iol.co.za/social-media-plan-to-fight-drug-abuse-1.1925089", "ord_in_thread": 0, "title": "Social media plan to fight drug abuse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ilse Fredericks", "Etienne Creux"], "text": "Social media plan to fight drug abuse October 5 2015 at 10:44am By Ilse Fredericks Comment on this story INLSA File picture by Etienne Creux \nThe Western Cape Department of Social Development is moving its fight against youth drug abuse online, including a counselling service on Mxit. \nThe department’s digital substance abuse campaign will be launched today and will also make use of social media channels Facebook and Twitter to reach young people between the ages of 10 and 24. \nPromoted posts on social media and banners and messages on Mxit and BBM will warn youngsters of the dangers of substance abuse, and urge them to partner with the department and “take back control”, the department said. \nEach of the channels will give users the opportunity to click through for further information or direct them to the toll free number 0800 220 250. \nThrough the Mxit component of the campaign, young people will be able to access online counselling by using their cellphones. \nAccording to the department, research shows children in the province start forming risk-taking behaviours between the ages of 10 and 14, and unhealthy coping strategies – including substance abuse – are developed. \nThe campaign is informed by the Western Cape Youth Development Strategy, which was launched last year. \nThe department, through its three inpatient treatment centres, along with five funded facilities, have treated 740 people since April. \nThis figure includes adults, and children aged 13 to 18. Outpatient treatment was rendered to 1 717 people in the same period. \nThe top substances youth seek treatment for in the Western Cape are dagga, methamphetamine and heroin. \nThe department funds two organisations to run the Matrix Teen programme in Eerste River, Kuils River and Steenberg. \nThe outpatient treatment is a school-based pilot project with the capacity to reach 410 children a year. Based at schools, young people can access treatment with minimal disruption to their schoolwork. \n“If we are to turn the tide and reduce the harm of drugs and alcohol abuse on our communities, then we must continue to work in a whole-of-society manner. It is up to us in government, the private sector, civil society and communities to build partnerships against drugs and drug-peddlers in our society,” said Social Development MEC Albert Fritz.", "external_links": [], "published": "2015-10-05T11:44:00.000+03:00", "crawled": "2015-10-06T01:06:49.171+03:00", "highlightTitle": ""}