{"organizations": [], "uuid": "da4238597eb5f84bb2f637241db6d6d0cdc285f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/technology.html", "section_title": "Technology", "url": "https://www.prbuzz.com/technology/350042-quwave-announces-new-bundle-offer-swap-equally-priced-units.html", "country": "US", "title": "QuWave Announces New Bundle Offer: Swap Equally-Priced Units", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "QuWave Announces New Bundle Offer: Swap Equally-Priced Units", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "da4238597eb5f84bb2f637241db6d6d0cdc285f9"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/technology/350042-quwave-announces-new-bundle-offer-swap-equally-priced-units.html", "ord_in_thread": 0, "title": "QuWave Announces New Bundle Offer: Swap Equally-Priced Units", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ledgewood, NJ (PR Buzz) October 1, 2015--- QuWave offers bundle packages providing significant discounts. The site is now announcing a new option in its online store: individual units of equal or lesser value can now be swapped within bundles.\nFor example, in the \"Couples Protection Discount Package,\" which contains two Personal Harmonizers, one or both of the Personal Harmonizers can be swapped for Personal Defenders and retain the same discounted price ($397 for two $297 units). This deal applies to all bundles and all units of equal or lesser value. One could also exchange the units in the Couples Protection package for a Divine and a Law of Attraction unit.\nOther bundle packages offer different discounts and different units. For example in the \"Personal & Tabletop Harmonizer Models\" (consisting of one Personal Harmonizer and one Tabletop Harmonizer ) the Tabletop Model can be swapped for any other Tabletop unit of equal value.\nDiscount codes aren't typically allowed to be used with bundle packages. Recently QuWave has partially rescinded this policy. Their Back to School sale and Autumn sale allowed customers to use discount codes with bundle packages. Check the individual sale for more information.\nBundle packages are a great way to get more value for your money. Many of QuWave's bundle packages approach 50% savings, and now with the ability to swap between them, all allow greater versatility in product selection.\nAbout QuWave:\nQuWave LLC, a prominent organization in the energy medicine field, manufacturing unique and active products that block the negative effects of EMF pollution and radiation while also generating Scalar Waves, Solfeggio Frequencies, Schumann Resonance, and Chi Orgone energies to promote a healthy, balanced lifestyle. QuWave is an online company located in Ledgewood, NJ that has customers, affiliates, and resellers around the world. For more information on QuWave, visit www.QuWave.com\nContact:\nJohn Goodson\nQuWave\n818-478-9283\nThis email address is being protected from spambots. You need JavaScript enabled to view it.", "external_links": ["http://quwave.com/defender.html", "http://quwave.com/Harmonizer.html", "http://quwave.com/QuWave-EMF-Shield-EMF-Blocker-Store.html#harmonizerpackages", "http://quwave.com/harmonizer-tabletop.html", "http://quwave.com/autumn2015.html#1"], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T16:51:32.255+03:00", "highlightTitle": ""}