{"organizations": [], "uuid": "bb7f3f89157f90651c8f7baabf01d7c4d78708f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.inquisitr.com", "main_image": "http://cdn.inquisitr.com/wp-content/uploads/2015/10/vaio-z-hero.jpg", "site_section": "http://feeds.inquisitr.com/TheInquisitrTechnology", "section_title": "The Inquisitr News » Technology", "url": "http://www.inquisitr.com/2510855/vaio-z-canvas-tries-to-take-on-microsoft-surface-pro-4-and-surface-book/", "country": "US", "title": "VAIO Z Canvas Tries To Take On Microsoft Surface Pro 4 And Surface Book", "performance_score": 0, "site": "inquisitr.com", "participants_count": 1, "title_full": "VAIO Z Canvas Tries To Take On Microsoft Surface Pro 4 And Surface Book", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:01:00.000+03:00", "replies_count": 0, "uuid": "bb7f3f89157f90651c8f7baabf01d7c4d78708f9"}, "author": "Daryl Deino", "url": "http://www.inquisitr.com/2510855/vaio-z-canvas-tries-to-take-on-microsoft-surface-pro-4-and-surface-book/", "ord_in_thread": 0, "title": "VAIO Z Canvas Tries To Take On Microsoft Surface Pro 4 And Surface Book", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Daryl Deino \nMicrosoft’s Surface Pro 4 and Surface Book arrive in stores next week, but the new VAIO Z, which is a similar laptop/tablet hybrid, is already in stores. PCWorld talked about the new VAIO earlier this month. \n“Yes, VAIO, the former PC division of Sony that was cast from the mothership last year, is back with an impressive engineering feat: Stuffing a real quad-core CPU into a tablet formally named the Z Canvas.” \nThe VAIO Z Canvas has a 12.3-inch IPS screen with a 2560 x 1704 pixel resolution and comes with a Bluetooth keyboard. Just like the new Surface devices, it has a 3:2 aspect ratio. The “cheapest” model has an Intel i7 processor, 8GB of RAM, and a 256GB solid-state drive. It also costs $2,199. WinBeta just did a review and compared the device to the Surface Pro 4 . \n“There are several key differences between the Surface Pro 4 and the VAIO Z Canvas. Unlike the Surface Pro 4’s Type Cover, which is attached at the base of the tablet, the Canvas is a wireless Bluetooth keyboard. This gives it the advantage of being able to reposition the keyboard to the side of the device while drawing, enabling a much more comfortable drawing posture.” \nThe VAIO Z Canvas has a powerful processor, but the battery life is mediocre. [Image via Daryl Deino] WinBeta notes that the Canvas has a quad-core Intel Core i7-4770HQ processor that is more powerful than the lower voltage processor on the Surface Pro 4. However, they weren’t impressed with the device. Reviewer Rick Rodriguez was especially disappointed with the pen capabilities. \n“I’d say my reaction to the pen performance is lukewarm. It wasn’t bad by any means; it just didn’t feel special. In fact, it felt familiar, bearing many of the niggling problems of other current generation N-Trig devices.” \nThere aren’t a lot of reviews for the VAIO Canvas Z online, but time spent with the device at the Microsoft Store at the Century City Mall shows that the Canvas looks nice, but has a lot of flaws. First of all, it’s too heavy to be used as a tablet. The Bluetooth keyboard, although definitely usable, has some drawbacks, as the keys don’t have much travel. When using the pen with Photoshop, there was a slight delay. It was also printed on the advertisement card for the device that it uses a Haswell processor, which was the norm in 2013. \nMicrosoft’s Surface Pro 4 has garnered very positive reviews. [Image via Daryl Deino] Judging from new reviews of the Surface Pro 4, those considering buying the VAIO may want to wait until Monday. Engadget is just one of the sites giving Microsoft’s new device an excellent review . They say that the device not only works well as both a tablet and a laptop, but that the new Type Cover and Surface Pen are massive improvements. They also like the fact that the Surface Pro 4 is still pretty light and thin for an equivalent of an ultraportable. \nThe Wall Street Journal likes the Surface Pro 4 for the most part. Reviewer Joanna Stern is very impressed with the screen, and notices major improvements in the Type Cover, which you’ll have to spend an extra $130 for. However, she wasn’t as impressed with the Surface Pro 4’s battery life, which lasted just short of six hours — that’s not bad, but less than the MacBook Air, MacBook Pro, and even the Dell XPS 13. \nThe VAIO Canvas is just one of the many Surface Pro clones to hit the market. However, like clones from Lenovo and Dell, the new VAIO doesn’t appear to be making any waves. Which laptop/tablet hybrid would you rather have — the VAIO Z Canvas or the Surface Pro 4? Let us know in the comments section. \n[Featured image via Daryl Deino]", "external_links": [], "published": "2015-10-21T22:01:00.000+03:00", "crawled": "2015-10-22T01:10:23.276+03:00", "highlightTitle": ""}