{"organizations": ["Advisory Board Resonant Inc", "Resonant Inc"], "uuid": "4161238797ca1dd3393de7c758433e23a0bf9053", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVpSWw==", "section_title": "Business Wire Technology: Consumer Electronics News", "url": "http://www.businesswire.com/news/home/20151012006030/en/Resonant-Expands-Advisory-Board", "country": "US", "title": "Resonant Inc. Expands Advisory Board", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Resonant Inc. Expands Advisory Board", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:15:00.000+03:00", "replies_count": 0, "uuid": "4161238797ca1dd3393de7c758433e23a0bf9053"}, "author": "", "url": "http://www.businesswire.com/news/home/20151012006030/en/Resonant-Expands-Advisory-Board", "ord_in_thread": 0, "title": "Resonant Inc. Expands Advisory Board", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Resonant Inc. Expands Advisory Board October 12, 2015 04:15 PM Eastern Daylight Time \nSANTA BARBARA, Calif.--( BUSINESS WIRE )--Resonant Inc. (NASDAQ: RESN), a late-stage development company creating innovative filter designs for radio frequency front-ends (RFFEs) for the mobile device industry, today announced it named industry sales & marketing veteran, Barry Waxman to its Advisory Board. Resonant formed the advisory board in late August to aid in marketing and commercializing its designs. \nMr. Waxman has more than 25 years’ experience in sales and developing strategic partnerships in diversified segments of the high tech industry. His expertise spans a broad range of technology sectors including semiconductors and system-level products used in wireless, including tunable filters. He currently serves as the VP of sales & marketing at Newlans, a developer of programmable duplexer and filter products for the RFFE. He has also served in executive and senior management roles at Western Digital, Adaptec, Mylex, PixelMagic, Microtouch Systems, and various startups. \nIn 2001, Mr. Waxman founded business development firm TechASIA Management to accelerate design wins by providing strong, well established OEM/ODM relationships and native language, in-country support. Mr. Waxman is also a member of Launchpad Venture Group, a Boston-area angel investor group. He earned his B.S. in Electronics and Electrical Engineering from Paisley College of Technology, King’s College, London. \nMr. Waxman stated: “I am pleased to have this opportunity to help Resonant commercialize its designs. Resonant’s filter design tools and technology can deliver cost and size reductions for its customers in a market that is experiencing ever growing demand, driven by band proliferation and carrier aggregation. With the Company’s development of a tunable filter design well underway, I look forward to showing the benefits of replacing multiple filters with Resonant’s single tunable filter.” \nCEO and Co-Founder Terry Lingren, added, “Our newly formed Advisory Board already is engaged with our senior leadership team, contributing their expertise and insight into the RFFE marketplace. We look forward to benefiting from the addition of Barry to this veteran team of wireless professionals. His global business perspective will help propel Resonant into new customers and market opportunities. \nAbout Resonant Inc. Resonant is a late-stage development company creating innovative filter designs for the RF front-end for the mobile device industry. The RFFE is the circuitry in a mobile device responsible for analog signal processing and is located between the device’s antenna and its digital baseband. Filters are a critical component of the RFFE that selects the desired radio frequency signals and rejects unwanted signals. \nUsing a patented, fundamentally new technology called Infinite Synthesized Networks ® (ISN ® ), Resonant has developed a new method of designing RF filters that can displace conventional filters by providing significant cost and size reductions, fewer components and improved performance. ISN can improve Surface Acoustic Wave (SAW) filters to work in difficult, Bulk Acoustic Wave (BAW) bands with performance that is competitive with best in class products that exist on the market today. These capabilities will also allow Resonant to create filter designs that tune to multiple bands. Resonant plans to market these tunable designs, which would replace several existing filters while significantly reducing the overall size and cost of the RFFE. For more information, please visit www.resonant.com . \nSafe Harbor for Forward-Looking Statements This press release contains forward-looking statements that include the following subjects, among others: the status of filter designs under development, the prospects for licensing filter designs upon completion of development, potential customers for Resonant’s designs, the impact of Resonant’s designs on the mobile device market, and its business strategy. Forward-looking statements are made as of the date of this document and are inherently subject to risks and uncertainties which could cause actual results to differ materially from those in the forward-looking statements, including, without limitation, the following: Resonant’s limited operating history (particularly as a new public company); Resonant’s ability to complete designs that meet customer specifications; the ability of its customers (or their manufacturers) to fabricate our designs in commercial quantities; dependence on a small number of customers; the ability of Resonant’s designs to significantly lower costs compared to other designs and solutions; the risk that the intense competition and rapid technological change in our industry renders Resonant’s designs less useful or obsolete; Resonant’s ability to find, recruit and retain the highly skilled personnel required for the design process in sufficient numbers to support growth; the ability to manage growth; and general market, economic and business conditions. Additional factors that could cause actual results to differ materially from those anticipated by Resonant’s forward-looking statements are under the captions “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Resonant’s most recent Annual Report (Form 10-K) or Quarterly Report (Form 10-Q) filed with the Securities and Exchange Commission. Forward-looking statements are made as of the date of this release, and the Company expressly disclaims any obligation or undertaking to update forward-looking statements. Contacts", "external_links": [], "published": "2015-10-12T23:15:00.000+03:00", "crawled": "2015-10-12T23:30:33.075+03:00", "highlightTitle": ""}