{"organizations": [], "uuid": "c35533133c8ee84c632540722040eb59c8f8e21b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/eeb856c47d43672227c03b75219ab58a91bb1011/151_93_3349_2009/master/3349.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=94df0fd9b3b0a5a38da8d176d4a99b58", "site_section": "http://www.theguardian.com/uk/technology", "section_title": "Technology | The Guardian", "url": "http://www.theguardian.com/technology/2015/oct/01/uber-fires-back-in-high-court-row-with-tfl", "country": "GB", "title": "Uber fires back in high court row with TfL | Technology", "performance_score": 1, "site": "theguardian.com", "participants_count": 4, "title_full": "Uber fires back in high court row with TfL | Technology | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:07:00.000+03:00", "replies_count": 3, "uuid": "b1be5c12671d817b7baf0257b6d55f6999965ee0"}, "author": "David Hellier", "url": "http://www.theguardian.com/technology/2015/oct/01/uber-fires-back-in-high-court-row-with-tfl#post-0", "ord_in_thread": 0, "title": "Uber fires back in high court row with TfL | Technology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uber, the under-fire taxi-hailing app, has hit out at London’s transport regulator, Transport for London (TfL), for taking it to the high court on Monday in the latest threat to its explosive growth in the London taxi market.\nThe high court case, which will determine whether the Uber app breaks the law by effectively acting as a meter, is piling on the pressure for the ride-hailing firm.\nUber, which is backed by investors including Wall Street institution Goldman Sachs, is already facing the threat of a major crackdown on its business practices in London following the announcement earlier this week of a public consultation .\nRelated: Uber fights back with petition after TfL launches consultation\nAn Uber spokesman said on Thursday: “The proposals, and the court case, are designed to protect the black-cab industry rather than help them adapt to what people want.”\nTfL, which provisionally took the view that Uber’s app was lawful, subsequently referred that decision to the court. “The court will be dealing with what is a distinguishing part of the Uber offering,” said Liam Griffin, chief executive of Europe’s biggest minicab firm, Addison Lee. “This court case could potentially have a devastating effect on Uber’s London business,” he added.\nUber is said to be confident it can survive a defeat in the high court. However, it is concerned that, if the case goes against them, it might need to make changes to the way its app operates that will make it less user friendly.\nThe legal spat over whether the Uber app breaches the law comes towards the end of a tough week for the firm, which has 18,000 drivers (called registered partners) in the capital.\nIn London, the group was shellshocked by TfL’s decision to consider new proposals – including making passengers wait at least five minutes for a ride – after talks with the rest of the industry.\nRelated: Why won't Boris Johnson let Uber break the cab 'cartel'? Votes, maybe?\nThe firm is facing problems in countries all over the world as it disrupts existing taxi services. In France, two of Uber’s executives were in court to face criminal charges of illegally organising taxi services through the company’s low-cost UberPop service. The trial has been delayed until mid-February so that both sides can review more data.\nIn the Netherlands on Tuesday, the group’s Amsterdam offices were raided as part of an ongoing criminal investigation into whether it is violating the country’s laws over a super-cheap service using untrained drivers. On the same day, in Rio de Janeiro, Uber and other similar smartphone taxi apps were banned from operating.\nLondon’s black-cab operators, who number more than 25,000, have long been arguing they want Uber to face tougher regulations so that the competition can be fairer. Uber, meanwhile, is arguing that regulation of the whole industry should be reduced, while adhering to tough safety standards.\nThe black-cab drivers were given a boost yesterday when Hailo, an app firm, signed a new deal that boosts their tech offering in the battle against Uber. The black cabs have other app deals, with groups such as GetTaxi and TaxiToo.\nUber has launched a petition, which has so far attracted nearly 120,000 names, to support its fight against the new TfL proposals in London. It says: “These rules make no sense”.\nRelated: Want a cheap Uber taxi? Wait till no one else wants one\n“We understand that black-cab drivers are feeling the pressure from services like Uber,” the petition states. “But the answer is to level the playing field by reducing today’s burdensome black-cab regulations – not to introduce rules that will be bad for riders, drivers and London.”\nTfL is chaired by Boris Johnson, who only two weeks ago branded black-taxi drivers as luddites. Yesterday, seven London Tory councillors, led by Peter Cuthbertson, asked Johnson to “think again” on Uber, concerned that his relatively relaxed view about the firm was changing.\nCuthbertson told the Guardian: “There are some concerns with Uber, such as its policy on insurance, but these proposals don’t look at that. It’s almost like they’ve asked what are the key features of Uber that people like and how do we make them illegal?”\nJohnson is said to be worried by the increased number of minicabs in the capital and the congestion this is causing. The number of licensed private hire vehicles has gone from around 35,000 in 2005 to just over 60,000 now.\nSimon Walker, director general of the business-friendly Institute of Directors, has appealed to Johnson to uphold his free market ideals over the situation.", "external_links": [], "published": "2015-10-02T03:07:00.000+03:00", "crawled": "2015-10-01T22:44:35.929+03:00", "highlightTitle": ""}