{"organizations": [], "uuid": "e77f9e2dc1d3f34fdccb921789318b65898c7706", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sciencedaily.com", "main_image": "http://images.sciencedaily.com/2015/10/151019072155_1_540x360.jpg", "site_section": "http://www.sciencedaily.com/rss/matter_energy/technology.xml", "section_title": "Technology News -- ScienceDaily", "url": "http://www.sciencedaily.com/releases/2015/10/151019072155.htm", "country": "US", "title": "New graphene based inks for high-speed manufacturing of printed electronics", "performance_score": 0, "site": "sciencedaily.com", "participants_count": 0, "title_full": "New graphene based inks for high-speed manufacturing of printed electronics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:21:00.000+03:00", "replies_count": 0, "uuid": "e77f9e2dc1d3f34fdccb921789318b65898c7706"}, "author": "", "url": "http://www.sciencedaily.com/releases/2015/10/151019072155.htm", "ord_in_thread": 0, "title": "New graphene based inks for high-speed manufacturing of printed electronics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Graphene ink being roll-to-roll printed. Credit: Tawfique Hasan Graphene ink being roll-to-roll printed. Credit: Tawfique Hasan Close A low-cost, high-speed method for printing graphene inks using a conventional roll-to-roll printing process, like that used to print newspapers and crisp packets, could open up a wide range of practical applications, including inexpensive printed electronics, intelligent packaging and disposable sensors. \nDeveloped by researchers at the University of Cambridge in collaboration with Cambridge-based technology company Novalia, the method allows graphene and other electrically conducting materials to be added to conventional water-based inks and printed using typical commercial equipment, the first time that graphene has been used for printing on a large-scale commercial printing press at high speed. \nGraphene is a two-dimensional sheet of carbon atoms, just one atom thick. Its flexibility, optical transparency and electrical conductivity make it suitable for a wide range of applications, including printed electronics. Although numerous laboratory prototypes have been demonstrated around the world, widespread commercial use of graphene is yet to be realised. \n\"We are pleased to be the first to bring graphene inks close to real-world manufacturing. There are lots of companies that have produced graphene inks, but none of them has done it on a scale close to this,\" said Dr Tawfique Hasan of the Cambridge Graphene Centre (CGC), who developed the method. \"Being able to produce conductive inks that could effortlessly be used for printing at a commercial scale at a very high speed will open up all kinds of different applications for graphene and other similar materials.\" \n\"This method will allow us to put electronic systems into entirely unexpected shapes,\" said Chris Jones of Novalia. \"It's an incredibly flexible enabling technology.\" \nHasan's method, developed at the University's Nanoscience Centre, works by suspending tiny particles of graphene in a 'carrier' solvent mixture, which is added to conductive water-based ink formulations. The ratio of the ingredients can be adjusted to control the liquid's properties, allowing the carrier solvent to be easily mixed into a conventional conductive water-based ink to significantly reduce the resistance. The same method works for materials other than graphene, including metallic, semiconducting and insulating nanoparticles. \nCurrently, printed conductive patterns use a combination of poorly conducting carbon with other materials, most commonly silver, which is expensive. Silver-based inks cost £1000 or more per kilogram, whereas this new graphene ink formulation would be 25 times cheaper. Additionally, silver is not recyclable, while graphene and other carbon materials can easily be recycled. The new method uses cheap, non-toxic and environmentally friendly solvents that can be dried quickly at room temperature, reducing energy costs for ink curing. Once dry, the 'electric ink' is also waterproof and adheres to its substrate extremely well. \nThe graphene-based inks have been printed at a rate of more than 100 metres per minute, which is in line with commercial production rates for graphics printing, and far faster than earlier prototypes. Two years ago, Hasan and his colleagues produced a prototype of a transparent and flexible piano using graphene-based inks, which took between six and eight hours to make. Through the use of this new ink, more versatile devices on paper or plastic can be made at a rate of 300 per minute, at a very low cost. Novalia has also produced a printed DJ deck and an interactive poster, which functions as a drum kit using the same method. \nHasan and PhD students Guohua Hu, Richard Howe and Zongyin Yang of the Hybrid Nanomaterials Engineering group at CGC, in collaboration with Novalia, tested the method on a typical commercial printing press, which required no modifications in order to print with the graphene ink. In addition to the new applications the method will open up for graphene, it could also initiate entirely new business opportunities for commercial graphics printers, who could diversify into the electronics sector. \n\"The UK, and the Cambridge area in particular, has always been strong in the printing sector, but mostly for graphics printing and packaging,\" said Hasan, a Royal Academy of Engineering Research Fellow and a University Lecturer in the Engineering Department. \"We hope to use this strong local expertise to expand our functional ink platform. In addition to cheaper printable electronics, this technology opens up potential application areas such as smart packaging and disposable sensors, which to date have largely been inaccessible due to cost.\" \nIn the short to medium term, the researchers hope to use their method to make printed, disposable biosensors, energy harvesters and RFID tags. \nThe research was supported by grants from the Engineering and Physical Sciences Research Council's Impact Acceleration Account and a Royal Academy of Engineering Research Fellowship. The technology is being commercialised by Cambridge Enterprise, the University's commercialisation arm. \nVideo: media/2092593\" href=\"http://sms.cam.ac.uk/media/2092593\">http://sms.cam.ac.uk/media/2092593 \n  University of Cambridge . The original story is licensed under a Creative Commons Licence . Note:   Cite This Page :", "external_links": [], "published": "2015-10-19T14:21:00.000+03:00", "crawled": "2015-10-19T18:46:08.308+03:00", "highlightTitle": ""}