{"organizations": [], "uuid": "d68aec5b4df3cb94ffecaa3c03622e8bdf05b17d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techcircle.vccircle.com", "main_image": "", "site_section": "http://techcircle.vccircle.com/feed/", "section_title": "Techcircle.in - India startups, internet, mobile, e-commerce, software, online businesses, technology, venture capital, angel, seed funding", "url": "http://techcircle.vccircle.com/2015/10/20/govt-makes-aadhaar-mandatory-to-register-new-business/", "country": "US", "title": "Govt makes Aadhaar mandatory to register new business", "performance_score": 0, "site": "vccircle.com", "participants_count": 1, "title_full": "Govt makes Aadhaar mandatory to register new business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:47:00.000+03:00", "replies_count": 0, "uuid": "d68aec5b4df3cb94ffecaa3c03622e8bdf05b17d"}, "author": "Binu Paul", "url": "http://techcircle.vccircle.com/2015/10/20/govt-makes-aadhaar-mandatory-to-register-new-business/", "ord_in_thread": 0, "title": "Govt makes Aadhaar mandatory to register new business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home > TOP STORY > Govt makes Aadhaar mandatory to register new business Govt makes Aadhaar mandatory to register new business | 0 Comments \nThe government has made it mandatory for entrepreneurs to submit Aadhaar number to register a new business. \nThe newly issued single-page registration form, called Udyog Aadhaar, necessitates business owners to submit their Aadhaar number to register a new business. \nThe ‘simplified form’ was issued by the Ministry for Micro, Small and Medium Enterprises on September 18 after Prime Minister Narendra Modi called for simplification of business registration process. From being what was just another form of verification, Aadhaar is now compulsory without which no new business can be registered. \nUnion Minister for Micro, Small and Medium Enterprises (MSMEs) Kalraj Mishra said over 800 MSMEs have so far registered under the simplified Aadhaar-based registration system. \n“Udyog Aadhaar Memorandum was notified on 18 September. Within a short time span, 800 MSMEs have registered. Udyog Aadhaar Memorandum is the cornerstone of ease of doing business in the country,” the minister was quoted as saying at a press conference by PTI. \nThe ministry had rolled out a one-page Udyog Aadhaar Memorandum to be filled online by all unregistered MSMEs, which was introduced to simplify registration procedure for entrepreneurs and promote ease of doing business. \nIn a landmark ruling recently, a five-judge Constitution bench led by Chief Justice HL Dattu reiterated its earlier verdict that the government cannot force citizens to enroll for Aadhaar until the court decides the case against the scheme. It allowed Aadhar to be used ‘voluntarily’ in four public welfare schemes. \nThe new move from the government has taken the business world by surprise and according to legal experts, the move to make Aadhaar mandatory is a clear case of violation of Supreme Court’s order regarding the same. \n“The Supreme Court has been crystal clear on the Aadhaar number being voluntary for now. So this would be a violation of the apex court’s order and could be a fit case for contempt of court. This would also infringe on citizens’ right to equality, as it would discriminate against people who don’t have Aadhaar numbers yet,” Supreme Court lawyer Pavan Duggal was quoted as saying by The Economic Times . \nExperts feel that while Aadhaar has its benefits, it’s unfair to force it upon people as the programme is yet to achieve full ‘coverage’ or enrolments. \nThe government has been promoting the Aadhaar programme in all its capacity. In February, the Department of Electronics and IT (DeitY) had launched a beta version of online repository of important documents like college certificates and degrees called digital locker . “Digital locker will allow you to securely upload and share your documents anytime, anywhere to authorised users/agencies. The issuer departments will also be able to automatically push the link of your document kept in their repositories,” its website said. Leave a comment", "external_links": [], "published": "2015-10-20T16:47:00.000+03:00", "crawled": "2015-10-20T17:02:48.781+03:00", "highlightTitle": ""}