{"organizations": ["StarNet Communications Corp", "StarNet Communications StarNet Communications Corp.", "StarNet Communications", "StarNet"], "uuid": "34423adfc5a5c8f0a6dc1b84a998d1df92d47a0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/StarNet-u2019s-FastX-2-1-Offers-Browser-Access-to-Remote-Linux-Desktops-Running-in-Load-Balanced-Clusters-34443-1/", "country": "US", "title": "StarNet’s FastX 2.1 Offers Browser Access to Remote Linux Desktops Running in Load-Balanced Clusters", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "StarNet’s FastX 2.1 Offers Browser Access to Remote Linux Desktops Running in Load-Balanced Clusters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:28:00.000+03:00", "replies_count": 0, "uuid": "34423adfc5a5c8f0a6dc1b84a998d1df92d47a0c"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/StarNet-u2019s-FastX-2-1-Offers-Browser-Access-to-Remote-Linux-Desktops-Running-in-Load-Balanced-Clusters-34443-1/", "ord_in_thread": 0, "title": "StarNet’s FastX 2.1 Offers Browser Access to Remote Linux Desktops Running in Load-Balanced Clusters", "locations": ["California", "Calif.", "Sunnyvale"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Steven Schoch"], "text": "Date:10/21/2015 Sunnyvale, California (PRWEB) October 21, 2015 StarNet Communications Corp, ( http://www.starnet.com/ ) a leading publisher of remote Linux access solutions today announced its FastX 2.1 X Windows emulator now allows engineers to use standard PC browsers to access high-end graphics applications in large clusters of load-balanced Linux servers. New session tracking tools also offer administrators detailed overview of the remote visualization activity in the cluster. FastX 2.1 is a high-speed remote Linux access tool that allows users connect to Linux desktops and applications running on remote Linux servers. FastX is unique in the market for remote Linux display tools by allowing users to securely view and work on their remote Linux desktops using nothing but the browser on their PC. In addition, browsers on devices such as iPads and smart phones can also be used to access a remote Linux desktop running somewhere in a server cluster. FastX 2.1 meets the increasing demand for solutions that can be deployed in large clusters of load balanced Linux servers, said Steven Schoch, founder and CEO of StarNet Communications. “In a single product, FastX now provides remote Linux access for all types of end users, from a single user connecting to a remote Linux desktop from his smart phone, to thousands of engineers working on high-resolution graphics engineering design applications in clusters of super computers.” Among the advanced new configurations, FastX 2.1 supports the use of gateway servers from which users launch sessions that run on servers in a cluster. The gateway support also allows administrators to set up duplicate FastX gateway servers. By backing each other up, FastX creates a fault-tolerant environment that protects users from losing their remote sessions should one of the gateway servers go down unexpectedly or for service. To further enhance the ability of FastX to support clusters of Linux servers, FastX also include a new set of Administrator features such the ability to track how many FastX sessions are running in the cluster and how much load (CPU and memory) each session is putting on a given server in the cluster. Pricing & Availability FastX can be downloaded with a 30-day free evaluation license from the StarNet Web site . Despite the addition of advanced new capabilities, the FastX list price remains at $295 in single license quantity. Volume, government and educational discounts are available. StarNet offers named-user and floating (concurrent) users licensing options. About StarNet Communications StarNet Communications Corp., founded in 1989, develops and markets X11 emulation solutions on the Windows, Macintosh and Linux platforms. StarNet's family of X-Win32 and FastX PC X server products offers cost-effective, best-of-breed X terminal emulation solutions. Based in Sunnyvale, Calif., the company is privately held. For more information about our PC X Server solutions, visit http://www.starnet.com \nRead the full story at http://www.prweb.com/releases/2015/10/prweb13027606.htm . '/>\"/>", "external_links": [], "published": "2015-10-21T21:28:00.000+03:00", "crawled": "2015-10-22T16:22:52.600+03:00", "highlightTitle": ""}