{"organizations": [], "uuid": "0e3257d1cc521ad16cf3506e982a8df1a9afa686", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/9974techinfo.xml", "section_title": "Technology: Information", "url": "http://www.prweb.com/releases/2015/10/prweb13027175.htm", "country": "US", "title": "MindStream Analytics Partners with CXO-Cockpit to Expand Delivery of Enterprise Performance Dashboards", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "MindStream Analytics Partners with CXO-Cockpit to Expand Delivery of Enterprise Performance Dashboards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "0e3257d1cc521ad16cf3506e982a8df1a9afa686"}, "author": "Susanna Ratsavong, Communications Director, Sales & Marketing", "url": "http://www.prweb.com/releases/2015/10/prweb13027175.htm", "ord_in_thread": 0, "title": "MindStream Analytics Partners with CXO-Cockpit to Expand Delivery of Enterprise Performance Dashboards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MindStream Analytics, a leading consulting and managed services provider, announced its partnership with CXO-Cockpit today, tapping the technology developer’s industry-leading mobile and web-based reporting and dashboard capabilities. Specially developed for leading enterprise performance management (EPM) systems, CXO-Cockpit allows MindStream Analytics to directly deliver advanced dynamic dashboarding tools to customers seeking to maximize their EPM investments. Built around the latest HTML5 technology, CXO-Cockpit is able to provide dynamic dashboards and reporting packs combining both data and narrative directly to mobile devices, like phones and tablets, as well as to traditional output media from a single platform.\n“It’s no surprise that organizations want to squeeze every dollar out of their expensive technology implementations,” says Alex Ladd, CEO & Senior Partner at MindStream. “With the advent of CXO-Cockpit’s technology, coupled with the functional expertise at MindStream, we are now providing tools that can prove the value of your investment by providing on-demand insight each time you touch the technology—from desktop to phones, from the data cruncher to the executive-level manager.”\n“Dashboards” refer to data reporting and visualization tools, the latest in enhancements for data-driven enterprise organizations seeking to streamline the process of analyzing their information. Those working at the executive, director, and manager levels are able to access data on demand, with the assurances of data reliability, as the dashboard tools are connected directly to the organization’s system. In so doing, the risk of human error in reporting is minimized, and the opportunity to view, analyze, and understand organization-level data is enhanced.\nCXO-Cockpit is headquartered in the Netherlands, with an expanding U.S. market. The technology is compatible with multiple leading EPM systems, including Oracle EPM Hyperion software (HFM, Essbase, Enterprise), SAP BPC, BW and HANA, IBM TM1, and Tagetik.\n“We are excited to be partnering with MindStream to help optimize the ‘last mile’ of customers’ enterprise performance management implementations with a world-class and dynamic single point of truth,” says Hugo Ehrnreich, CEO of CXO-Cockpit. “Still too often the rich data and intelligence in these systems is underutilized. We look forward to helping MindStream customers unleash the full power and achieve the full business impact of their investment.”\nCXO-Cockpit will join MindStream Analytics in hosting its first Financial Applications User Group in Cincinnati, Ohio, November 17, where users working at the intersection of Finance and IT can meet for roundtable discussions on technology and business issues. For more information, visit http://www.mindstreamanalytics.com/mindstream-financial-applications-user-group . In addition, together, MindStream and CXO-Cockpit will host a joint webinar, “The Final Reporting Mile of Your EPM Investments,” on Friday, October 30 at 12:00PM (Eastern Standard Time). For more information, or to get registered, visit: http://bit.ly/msacxowebinar .\nAbout MindStream Analytics\nMindStream Analytics, headquartered in Boston, MA, is a leading consulting and managed services provider. Our team is made up of business and technical experts that believe in the power of data.\nWe know that, to not only survive but, to excel in today's environment, organizations must have insight across the organization to enable actionable financial decisions that achieve positive business results; those that accomplish this win with data.\nWe love challenging work—the messier the data, the better. We're the partner to turn unruly, chaotic data into meaningful information for better, faster, and more accurate decision-making. We know finance; we get it.\nMindStream has been recognized by CIO Review, ProformaTech, and others for our innovative thinking and business analytic applications expertise. In 2015, MindStream was named by MSPmentor as one of the “Top 501 Managed Services Providers.”\nAbout CXO-Cockpit\nCXO-Cockpit is an independent software company founded in 2007 by a team of Finance and Enterprise Performance Management (EPM) professionals frustrated with the limitations of Excel and generic BI solutions. Through our financially-intelligent CXO Cockpit Web-based and Mobile Reporting and Communication Platform we create a single point of truth (data + narrative) and governance and eliminate the barriers (and inefficiencies) that prevent the CFO-office from adding maximum value and having maximum impact.", "external_links": ["http://bit.ly/msacxowebinar", "http://www.mindstreamanalytics.com/mindstream-financial-applications-user-group", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5taW5kc3RyZWFtYW5hbHl0aWNzLmNvbS9taW5kc3RyZWFtLWZpbmFuY2lhbC1hcHBsaWNhdGlvbnMtdXNlci1ncm91cA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2JpdC5seS9tc2FjeG93ZWJpbmFy"], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-19T11:48:32.314+03:00", "highlightTitle": ""}