{"organizations": [], "uuid": "aa0d201acf6b13a353443ff4eb83903dbc0c9c2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-10/GT_356518_f4278485-c90f-4c35-ae07-48b3fdc87926.jpg", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094361808/Billionaire-Ambani-brothers-join-hands-for-India-phone-network&src=RSS", "country": "", "title": "Billionaire Ambani brothers join hands for India phone network", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Billionaire Ambani brothers join hands for India phone network | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "aa0d201acf6b13a353443ff4eb83903dbc0c9c2d"}, "author": "Gulf Times", "url": "http://www.menafn.com/1094361808/Billionaire-Ambani-brothers-join-hands-for-India-phone-network&src=RSS", "ord_in_thread": 0, "title": "Billionaire Ambani brothers join hands for India phone network", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Gulf Times) Billionaires Mukesh and Anil Ambani are working on a partnership that will help them share each other's resources for their nationwide fourth-generation phone networks after India last month allowed operators to trade airwaves.\nReliance Communications, controlled by younger brother Anil Ambani, will share its countrywide 800-850 megahertz spectrum with Mukesh Ambani's Reliance Jio Infocomm, Anil Ambani told shareholders of Reliance Communications yesterday in Mumbai. Such a cooperation will help his company cut debt, he said. Reliance Communications' shares jumped 6.1%, the most in three weeks, to Rs67.85 in Mumbai.\n\"We are in advanced talks for spectrum trading and sharing pact for our 800-850 MHz countrywide spectrum,\" Anil Ambani, 56, told Reliance Communications' shareholders in Mumbai. \"This tie-up will be virtual consolidation in the telecom sector.\" The pact is the latest sign of reconciliation between the siblings who split their father's Reliance empire a decade ago over a family feud. Mukesh Ambani, 58, who is spending more than 16bn on his 4G network, will be stepping into the crowded and indebted wireless industry, which has more than 900mn subscribers and one of the world's fastest-growing smartphone markets. \nThe start of Jio's services, planned towards the end of the year, will also mark the return of the older brother to the telecommunications industry a decade after he handed over the group's phone business to Anil Ambani when the conglomerate was divided between the two.\nReliance Communications plans to start its 4G services by the end of the financial year through March 2016, Anil Ambani told shareholders. The partnership between the Reliance Communications and Jio will extend to deals such as reciprocal arrangements for roaming, he said.\n\"Spectrum trading and sharing will help reduce capital intensity and over time debt,\" he said. \"I am very thankful to my elder brother for his support in all these collaborations.\" A Reliance Industries spokesman declined to comment.\nReliance Communications also expects to announce the sale of its tower assets in the next month or two, he said. The assets have drawn interest from companies including American Tower Corp, people with knowledge of the matter said in May, and the business could be valued at about Rs200bn (3.04bn) including debt, two of the people said.\nNet debt of Reliance Communications was Rs386bn as of end-June, up from Rs320bn in March 2011, according to a company statement.\nTelecom operators were allowed to trade wireless airwaves in September by the government if they were acquired through an auction since 2010 or the holder paid market value initially.\nUnder the government's conditions, carriers can only sell spectrum after two years of ownership and will need to clear all dues before any transaction.\nReliance Communications, which said in June that it was in exclusive discussion to buy AFK Sistema's Indian wireless unit through an all-stock deal, is in advanced discussions on the merger and will complete it in the next few weeks, Ambani said. A deal may mark the start of consolidation in the world's second-largest wireless market, where competition among 12 carriers have pushed tariffs to among the lowest globally.", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-01T16:38:25.932+03:00", "highlightTitle": ""}