{"organizations": [], "uuid": "eb3090a828b6670eb3b73e385ecfb55d5b31d0b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/Natera-to-Present-at-ASRM-Annual-Meeting-34382-1/", "country": "US", "title": "Natera to Present at ASRM Annual Meeting", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Natera to Present at ASRM Annual Meeting", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T15:55:00.000+03:00", "replies_count": 0, "uuid": "eb3090a828b6670eb3b73e385ecfb55d5b31d0b5"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/Natera-to-Present-at-ASRM-Annual-Meeting-34382-1/", "ord_in_thread": 0, "title": "Natera to Present at ASRM Annual Meeting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Navigation Links HOME >> BIOLOGY >> TECHNOLOGY Natera to Present at ASRM Annual Meeting ... SAN CARLOS Calif. Oct. 16 2015 /PRNewswir... Size Matters: SNP-based Chromosome Analysis of POC Samples Identifi...Ms. Maisenbacher will present findings illustrating the ability of SNP... Cytogenetics SNPs or aCGH. What is the best testing modality for c... http://feeds.bio-medicine.org/latest-biology-technology Date:10/16/2015 \nSAN CARLOS, Calif. , Oct. 16, 2015 /PRNewswire/ -- Natera, Inc., ( NTRA ), a leader in non-invasive genetic testing and the analysis of circulating cell-free DNA, today announced that clinical research associated with its suite of reproductive genetic tests and screens will be highlighted during three scientific sessions at the American Society of Reproductive Medicine (ASRM) annual meeting, to be held October 17 – 21 in Baltimore , MD. \nNatera Presentations at ASRM \nSize Matters: SNP-based Chromosome Analysis of POC Samples Identifies Clinically Significant Deletions/Duplications Below Karyotype Resolution Melissa Maisenbacher , MS, CGC , Genetic Counselor, NateraOral Presentation #218: Wednesday, October 21, 11:30 AM \nMs. Maisenbacher will present findings illustrating the ability of SNP microarray with bioinformatics for products of conception (POC) analysis to detect deletions/duplications below the resolution of standard karyotype analysis. This study highlights that SNP-array-based POC studies allow for identification of small but clinically significant chromosome findings, that may be related to the cause of miscarriage and/or carry significant reproductive risks for a couple. \nCytogenetics, SNPs or aCGH. What is the best testing modality for chromosome testing of miscarriage specimens? Meera Shah , MD, Fellow, Stanford Fertility and Reproductive Medicine CenterOral Presentation #86: Monday, October 19, 11:30 AM \nDr. Shah will present a head-to-head comparison of three different testing platforms for products of conception (POC) testing: SNP array (Anora TM ), array CGH, and traditional karyotype highlighting discordant results, turn-around time for testing and the limitations of each test type. \nAnalyses of 37,000+ Embryos with 24-Chromosome SNP-based PGS Michelle Kiehl , MSc, ELD, Program Director, PGD, NateraPoster #519: Wednesday, October 21, 7:00-8:45 AM \nFor more information about these presentations and Natera's genetic tests and screens, visit booth #1001 at ASRM. \nAbout Natera \nNatera is a genetic testing company that develops and commercializes non-invasive methods for analyzing DNA. The mission of the company is to transform the diagnosis and management of genetic disease. In pursuit of that mission, Natera operates a CAP-accredited laboratory certified under the Clinical Laboratory Improvement Amendments (CLIA) in San Carlos, CA , and it currently offers a host of proprietary genetic testing services primarily to OB/GYN physicians and fertility centers, as well as to genetic laboratories through its cloud-based Constellation™ software system. Tests include the Spectrum™ pre-implantation genetic test for embryo selection during IVF; the Anora™ miscarriage test to understand the genetic causes of a pregnancy loss; the Horizon™ carrier screen to detect inherited mutations; and the Panorama™ non-invasive prenatal test (NIPT) to screen for common chromosomal anomalies in a fetus as early as nine weeks of gestation. Natera is also applying its unique technologies to develop non-invasive screening and diagnostic tools for earlier detection and improved treatment of cancer. These tests have not been cleared or approved by the U.S. Food and Drug Administration. \nForward-looking statements \nThis release contains forward-looking statements. All statements other than statements of historical facts contained in this press release, including statements regarding Natera's plans to develop and launch commercially available diagnostics and monitoring technology for cancer, are forward-looking statements. Any forward-looking statements contained in this press release are based upon Natera's historical performance and its current plans, estimates, and expectations, and are not a representation that such plans, estimates, or expectations will be achieved. These forward-looking statements represent Natera's expectations as of the date of this press release. Subsequent events may cause these expectations to change, and Natera disclaims any obligation to update the forward-looking statements for any reason after the date of this press release. These forward-looking statements are subject to a number of known and unknown risks and uncertainties that may cause actual results to differ materially, including uncertainty in the development and commercialization of Natera's planned future cancer products or other new products or if the results of its clinical studies do not support the use of its tests, or cannot be replicated in later studies required for regulatory approvals or clearances. Additional risks and uncertainties are discussed in greater detail in the sections entitled \"Risk Factors\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Natera's Form 10-Q for the quarter ended June 30, 2015. Further information on potential risks that could affect actual results will be included in other filings Natera makes with the SEC from time to time. These documents are available for free on the company's website at www.natera.com under the Investor Relations section, and on the SEC's website at www.sec.gov . \nContacts", "external_links": [], "published": "2015-10-16T15:55:00.000+03:00", "crawled": "2015-10-16T16:22:28.358+03:00", "highlightTitle": ""}