{"organizations": [], "uuid": "188f6ea42720ab30dfe7b45f3fb98a5baaa19bf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1136273/mizuno-rolls-out-shopatron-s-local-product-search-u-s-market-offer-best-class-consumer", "country": "US", "title": "Mizuno Rolls Out Shopatron’s Local Product Search in U.S. Market to Offer a Best-in-Class Consumer Experience Online", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Mizuno Rolls Out Shopatron’s Local Product Search in U.S. Market to Offer a Best-in-Class Consumer Experience Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:29:00.000+03:00", "replies_count": 0, "uuid": "188f6ea42720ab30dfe7b45f3fb98a5baaa19bf8"}, "author": "admin", "url": "http://www.freshnews.com/news/1136273/mizuno-rolls-out-shopatron-s-local-product-search-u-s-market-offer-best-class-consumer", "ord_in_thread": 0, "title": "Mizuno Rolls Out Shopatron’s Local Product Search in U.S. Market to Offer a Best-in-Class Consumer Experience Online", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Finderbot™ technology Program performance data \nShopatron’s Local Product Search is a first-of-its-kind solution that can find products at local retailers with and without store inventory feeds. The patent-pending Finderbot™ technology submits real-time stock requests to retailers without inventory feeds and aggregates their responses with available retailer inventory data feeds, providing consumers with same-day in-store pickup for all local products. \n“Mizuno is a world-class brand and visionary leader in the sporting goods industry,” says Shopatron Founder and CEO, Ed Stevens. “We are honored to continue our partnership with Mizuno with the launch of Local Product Search. This exciting technology will help them continue to grow their ecommerce presence, delight their customers and dealers, and allow them to lead the industry in innovative omnichannel offerings.” \nClick here to find out more about Shopatron’s Local Product Search solution. \nAbout Shopatron \nOrder Management at the Speed of Now - Shopatron is the world’s leading SaaS platform for distributed order management, enabling enterprise retailers and branded manufacturers worldwide to quickly deploy and evolve dynamic, omnichannel fulfillment models that delight customers and drive profitable growth. With the retail industry’s only truly open, multi-tenant SaaS architecture for distributed order management, Shopatron is redefining standards of shopper convenience at a dramatically lower cost than with licensed software. Over 1,000 retailers and brands around the globe use Shopatron every day to optimize inventory performance, save sales, and increase enterprise profitability. \nAbout Mizuno USA \nMizuno USA, Inc. is a wholly owned subsidiary of Mizuno Corporation, one of the largest specialty sporting goods manufacturers in the world. Mizuno USA, Inc. manufactures and distributes golf, baseball, softball, running, and volleyball equipment, apparel, and footwear for North America. Mizuno USA, Inc. is based in Norcross, Georgia. View source version on businesswire.com: http://www.businesswire.com/news/home/20151005006222/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-05T18:29:00.000+03:00", "crawled": "2015-10-05T19:50:52.589+03:00", "highlightTitle": ""}