{"organizations": [], "uuid": "bffc5a361af2b681ec041e95dc0c5cd13b7e1506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/Elsevier-Launches-Online-Subscription-Service-for-Dorlands-Illustrated-Medical-Dictionary-34306-1/", "country": "US", "title": "Elsevier Launches Online Subscription Service for Dorland's Illustrated Medical Dictionary", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Elsevier Launches Online Subscription Service for Dorland's Illustrated Medical Dictionary", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T15:00:00.000+03:00", "replies_count": 0, "uuid": "bffc5a361af2b681ec041e95dc0c5cd13b7e1506"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/Elsevier-Launches-Online-Subscription-Service-for-Dorlands-Illustrated-Medical-Dictionary-34306-1/", "ord_in_thread": 0, "title": "Elsevier Launches Online Subscription Service for Dorland's Illustrated Medical Dictionary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PHILADELPHIA , October 12, 2015 /PRNewswire/ -- \nDorlandsOnline.com offers user-friendly, multi media alternative to print version for enriched online experience \nElsevier , a world-leading provider of scientific, technical and medical information products and services, announced today that it has launched a new subscription service, DorlandsOnline.com , to offer online access to Dorland ' s Illustrated Medical Dictionary for both individual purchase and organizational licensing. \nAn alternative to the print version, DorlandsOnline.com is based on the latest 32 nd edition of the legendary medical dictionary. It contains nearly 124,000 entries, the largest number to be found in a single-volume medical dictionary. Subscribers will enjoy an enriched user experience, including the following features: New advanced search and navigation tools make the search process effortless and convenient; A new browser plugin enables access to Dorland's definitions from the user's web browser search window to make access faster; A new audio tool enables browsing and quick lookup of pronunciations for more than 35,000 terms; More than 1,500 illustrations of terms, nearly all in full color, enhance the entries; and Additional reference materials supplement the search. \n\"Elsevier launched DorlandsOnline.com subscription service to meet the needs of our customers who would like to access the dictionary without purchasing the hard copy,\" said Linda Belfus , Senior Vice President and General Manager Content, Elsevier Clinical Solutions. \"The ease of use, immediate access and sophisticated technology powering the site, combined with the most up-to-date content from a source that has been trusted for more than 115 years, make DorlandsOnline.com a go-to place for anyone who needs to look up medical terminology.\" \nExisting customers who have access to Dorlands.com , as part of their print edition purchase will be eligible to receive a free six-month trial to DorlandsOnline.com. A subscription to DorlandsOnline.com can be purchased without purchasing the print copy of the dictionary. \n--- \nAbout Elsevier \nElsevier is a world-leading provider of information solutions that enhance the performance of science, health, and technology professionals, empowering them to make better decisions, deliver better care, and sometimes make groundbreaking discoveries that advance the boundaries of knowledge and human progress. Elsevier provides web-based, digital solutions - among them ScienceDirect , Scopus , Elsevier Research Intelligence and ClinicalKey - and publishes more than 2,500 journals, including The Lancet and Cell , and more than 33,000 book titles, including a number of iconic reference works. Elsevier is part of RELX Group plc , a world-leading provider of information solutions for professional customers across industries. http://www.elsevier.com '/>\"/>", "external_links": [], "published": "2015-10-12T15:00:00.000+03:00", "crawled": "2015-10-12T16:17:05.120+03:00", "highlightTitle": ""}