{"organizations": [], "uuid": "fda7e0cbeaf45c08c96d7b7d2a92048e9ecc8085", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/562e246d4f772.png", "site_section": "http://phys.org/rss-feed", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-spacecraft-thousands-doomed-comets.html", "country": "US", "title": "Spacecraft discovers thousands of doomed comets", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Spacecraft discovers thousands of doomed comets", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T16:20:00.000+02:00", "replies_count": 0, "uuid": "fda7e0cbeaf45c08c96d7b7d2a92048e9ecc8085"}, "author": "", "url": "http://phys.org/news/2015-10-spacecraft-thousands-doomed-comets.html", "ord_in_thread": 0, "title": "Spacecraft discovers thousands of doomed comets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spacecraft discovers thousands of doomed comets October 26, 2015 \nFor an astronomer, discovering a comet can be the highlight of a lifetime. Great comets carry the names of their discoverers into history. Comet Halley, Comet Lovejoy, Comet Hale-Bopp are just a few examples…. \nImagine the frustration, though, if every time you discovered a comet, it was rapidly destroyed. \nBelieve it or not, this is what happens almost every day to the most prolific comet hunter of all time. \nThe Solar and Heliospheric Observatory, better known as \"SOHO\", is a joint project of the European Space Agency, or ESA, and NASA. Orbiting the sun at 1.5 million km, or 932,000 miles from Earth, the distant observatory has just discovered its 3000th comet—more than any other spacecraft or astronomer. And, just about all of SOHO's comets have been destroyed. \n\"They just disintegrate every time we observe one,\" said Karl Battams, a solar scientist at the Naval Research Labs in Washington, D.C., who has been in charge of running the SOHO comet-sighting website since 2003. \"SOHO sees comets that pass very close to the sun—and they just can't stand the intense sunlight.\" \nThe overwhelming majority of SOHO's comet discoveries belong to the Kreutz family. Kreutz sungrazers are fragments from the breakup of a single giant comet thousands of years ago. They get their name from 19th century German astronomer Heinrich Kreutz, who studied them in detail. On average, a new member of the Kreutz family is discovered every three days. Unfortunately for these small comets, their orbits swoop perilously close to the sun. \n\"There's only one Kreutz comet that made it around the sun – Comet Lovejoy. And we are pretty confident it fell apart a couple of weeks afterwards,\" says Battams. \nAlthough SOHO's comets are rapidly destroyed, they nevertheless have great scientific value. For instance, the comets' tails are buffeted and guided by the sun's magnetic fields. Watching how the tails bend and swing can tell researchers a great deal about the sun's magnetic field. \nPrior to the launch of SOHO in 1995, only a dozen or so comets had ever even been discovered from space, while some 900 had been discovered from the ground since 1761. SOHO has turned the tables on these figures, making itself the greatest comet hunter of all time. \nBut SOHO hasn't reached this lofty perch alone. The spacecraft relies on people who sift through its data. Anyone can help because SOHO's images are freely available online in real time. Many volunteer amateur astronomers scan the data on a daily basis for signs of a new comet. The result: 95% of SOHO comets have been found by citizen scientists. \nWhenever someone spots a comet, they report it to Battams. He goes over the imagery to confirm the sighting and then submits it to the Central Bureau for Astronomical Telegrams, which gives it an official name. \nAnd the name is…you guessed it. \"SOHO.\" \nWhile comets spotted from the ground are named after the person who first discovered them, comets first observed by a space-based telescope are named after the spacecraft. The 3000th comet discovered was named \"SOHO-3000.\" \nNaturally, it has already been destroyed. SOHO doesn't mind though. The Greatest Comet Hunter Ever has already moved on to the next sungrazer. \n\"SOHO-4000,\" anyone?", "external_links": [], "published": "2015-10-26T16:20:00.000+02:00", "crawled": "2015-10-26T16:25:40.662+02:00", "highlightTitle": ""}