{"organizations": ["Panasonic"], "uuid": "7b663f79efeab33225355e8222b9baeaf9f76960", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techxplore.com", "main_image": "http://img.techxplore.com/newman/gfx/news/2015/1-highefficien.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://techxplore.com/news/2015-10-high-efficiency-panasonic-solar-panel.html", "country": "US", "title": "High efficiency rating shines on Panasonic solar panel", "performance_score": 0, "site": "techxplore.com", "participants_count": 0, "title_full": "High efficiency rating shines on Panasonic solar panel", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T20:00:00.000+03:00", "replies_count": 0, "uuid": "7b663f79efeab33225355e8222b9baeaf9f76960"}, "author": "", "url": "http://techxplore.com/news/2015-10-high-efficiency-panasonic-solar-panel.html", "ord_in_thread": 0, "title": "High efficiency rating shines on Panasonic solar panel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nancy Owano"], "text": "High efficiency rating shines on Panasonic solar panel October 13, 2015 by Nancy Owano weblog \nHow to get more electricity from a given area of solar panels—this is an important question that scientists explore as companies focus on the future of solar panels. Inhabitat said Panasonic has developed the most efficient solar panel as it offers 22.5% sunlight conversion . \nThe pairing up of lower pricing with higher energy conversion can lift solar power higher as a solution for renewable energy. Cat Distasio in Inhabitat said Panasonic's numbers (22.5 percent) represented a record-breaking efficiency rating. SolarCity had announced an efficient rooftop PV module – at 22.04%. \nThe company created a prototype (a 72-cell, 270-watt prototype) of a commercial-sized solar panel with this conversion efficiency. The Japanese National Institute of Advanced Industrial Science and Technology confirmed it in testing. It will eventually be scaled into volume production. \nMeanwhile, Panasonic Eco Solutions made another recent announcement about the launch of the photovoltaic module HIT N330. This is described as an addition to the company's \"heterojunction photovoltaic module\" product line. It features 19.7% module-level efficiency and a nominal power output of 330 watts, said Panasonic. The new PV module will be available in the UK and other European markets from March 2016, said the Panasonic Eco Solutions announcement. \nPanasonic is not the only company making news in solar efficiency. CleanTechnica said that \"Recently, SolarCity announced it will begin manufacturing the 'world's most efficient solar panels ' at its factory in Buffalo, New York, starting in 2016. It claims it has designed a panel that converts 22.1% of sunlight into electricity .\" \nOn October 2, SolarCity announced its efficient solar panels. SolarCity will begin producing the first of the new panels this month; it expects to build up to 10,000 solar panels every day at that facility when the Buffalo facility reaches full capacity, according to a news release. \nAnalyzing what the announcements mean in the bigger picture, Clayton Handleman in his blog, The Handleman Post , had this to say. \"The benefits of high efficiency include reduced footprint and reduced balance of system costs on a dollars per kwhr basis and amortization of fixed costs over a larger system capacity .\" \nTravis Hoium writing about the solar industry in The Motley Fool commented: \"The industry's focus is now on high efficiency . For years, the solar industry has been focused on cutting costs as quickly as possible. But costs can only go so low; as you see above even a 5% or 10% reduction in cost won't have a big impact on a solar system's total cost—at least in the residential side of the business .\" 0 shares", "external_links": [], "published": "2015-10-13T20:00:00.000+03:00", "crawled": "2015-10-13T20:16:15.329+03:00", "highlightTitle": ""}