{"organizations": ["Genie Gateway", "U.S. Securities and Exchange Commission", "Summit Digital Inc.", "LAS VEGAS", "NV", "Summit Digital", "FINRA", "GGWY", "CTO"], "uuid": "9be17acb8961d2efd15dd315e1515692daaa08fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.consumerelectronicsnet.com", "main_image": "", "site_section": "http://feeds2.feedburner.com/Cen-ConsumerElectronicsNet-technologyNews", "section_title": "CEN - Consumer Electronics Net-Technology News", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4108405", "country": "US", "title": "Genie Gateway Solidifies Brand with a New Stock Ticker Symbol (OTC: GGWY)", "performance_score": 0, "site": "consumerelectronicsnet.com", "participants_count": 0, "title_full": "Genie Gateway Solidifies Brand with a New Stock Ticker Symbol (OTC: GGWY)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T22:00:00.000+03:00", "replies_count": 0, "uuid": "9be17acb8961d2efd15dd315e1515692daaa08fd"}, "author": "", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4108405", "ord_in_thread": 0, "title": "Genie Gateway Solidifies Brand with a New Stock Ticker Symbol (OTC: GGWY)", "locations": ["Las Vegas", "South Eastern Avenue", "U.S.", "Nevada"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Newgreen", "Nix", "Thomas E. Skala", "Stuart Scamman", "Tom Nix", "Randall L. Skala"], "text": "Genie Gateway Solidifies Brand with a New Stock Ticker Symbol (OTC: GGWY) October 08, 2015 -- LAS VEGAS, NV - 08 Oct, 2015 - Genie Gateway a U.S. registered company, trading on the U.S. OTC stock market, and filing regular reports with the U.S. Securities and Exchange Commission (SEC), has taken the next step in brand consolidation and development, winning authorization from FINRA to change its OTC trading symbol from WWAGD toGGWY. Under the new, more fitting stock symbol, Genie Gateway will continue its detailed plan of consolidating and expanding its new and existing products under a unified banner. These plans include the announced roll out this quarter, of theGenie CashBox - Debit Card. An extension of the CashBox and Check 22, the Genie CashBox - Debit Card will make it even easier for unbanked merchants and their customers to do businesswithout using cash. Thomas E. Skala, Genie Gateway CEO said Imagine a debit card, with complete privacy, convenience, and security,designed specifically for unbanked merchants and their customers. Every day we are robbed of a little more of the privacy that we all cherish so much. Most people do not like living in a glass house, and are fighting to preserve what precious little privacy they have left. Smart shoppers wisely prefer not to share their credit card, banking information - or even their home phone number - online or when making purchases by phone. The Genie CashBox Debit Card can be a major game changer and everyone over the age of 18, with a valid checking account at any U.S. bank can qualify. No Activation Fee No credit card needed Merchants get paid in Real-Time Given the high level of technology being used by hackers, as well as the potential for more sophisticated advancements, the time to take steps to ensure the protection of your privacy is now! Genie CashBox Debit Card is that next step, added Randall L. Skala, Genie Gateways COO. Stuart Scamman, CTO of Genie Gateway, explained, The CashBox Debit Card is the fastest and safest way to send payments online, via mobile devices, in store or by phone without sharing your financial information. The Genie CashBox Debit Card will change transaction processing for unbanked merchants; customers get to shop with privacy and convenience, and merchants get paid in real-time, added Mark Newgreen, Genie Gateway CFO. Tom Nix, president of Genie Gateways cable TV and Internet subsidiary, Summit Digital, expanded on the companys wider plans for integrated offerings. Summit plans to introduce and advertise the Genie CashBox Debit Card with GenieChecking ( https://GenieCashBox.com/CheckingVideo ), jointly with other cable television, high speed Internet and wireless Internet service providers (WISPs) to their subscribers, on their respective systems as the next generation of unified services, while creating a new way to build additional high-margin revenues. This will be the first time that cable TV, high speed Internet and wireless Internet service providers will actually be in position to offer merchants and other advertisers a way to complete a sale for their goods and services advertised, and get paid in real-time anytime 24x7x365, continued Nix. About the Genie Gateway Genie Gatewayis U.S. registered company, trading on the U.S. OTC stock market under the symbol GGWY and filing regular reports with the U.S. Securities and Exchange Commission (SEC). Genie Gateway has two operating subsidiaries, Summit Digital Inc., and Genie Gateway: Summit Digital Inc., is a Multi-System Operator providing Cable TV, High Speed Internet, and related services, targeting rural communities as a specific high-growth market within the Cable Television and high speed internet industry. Genie Gateway is a forward-looking unified communications and payment processing platform,blending the products and services needed to operate a business, traditionally purchased from several vendors, into one seamless service.Genie Gateway is aimed squarely at businesses and individuals who want a fully rounded presence on the internet and by phone, without the cost and complexity of the build-it-yourself approach. Genie Gateway is an interactive multimedia communications hub, featuring a digital buffet of unified solutions; combining the benefits of having a website fully accessible from any internet enabled device, with voice, text, video, document messaging, virtual fax, group communications,including an online store, a shopping cart with a virtual point of sale, and a CashBox with a GenieChecking account,plus the most robust Virtual Office, as one unified solution. CONTACT : Address: 4570 South Eastern Avenue - Suite 26-221,Las Vegas, Nevada 89119 USAPhone:(877) 327-3400", "external_links": [], "published": "2015-10-08T22:00:00.000+03:00", "crawled": "2015-10-09T08:30:19.678+03:00", "highlightTitle": ""}