{"organizations": [], "uuid": "0e46bfc32ec992f5dd7c4248013a759d2d8f02c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myrtlebeachonline.com", "main_image": "http://www.myrtlebeachonline.com/static/images/myrtlebeachonline/facebook.jpg", "site_section": "http://www.myrtlebeachonline.com/news/business/technology/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Technology News | MyrtleBeachOnline.com &", "url": "http://www.myrtlebeachonline.com/news/business/technology/article38723214.html", "country": "US", "title": "AP News in Brief at 7:58 p.m. EDT", "performance_score": 0, "site": "myrtlebeachonline.com", "participants_count": 1, "title_full": "AP News in Brief at 7:58 p.m. EDT", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T04:04:00.000+03:00", "replies_count": 0, "uuid": "0e46bfc32ec992f5dd7c4248013a759d2d8f02c4"}, "author": "The Associated Press", "url": "http://www.myrtlebeachonline.com/news/business/technology/article38723214.html", "ord_in_thread": 0, "title": "AP News in Brief at 7:58 p.m. EDT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order Reprint of this Story \nTurks and Kurds trade blame for deadly blasts as chaos in Syria bleeds across long border \nANKARA, Turkey (AP) — Thousands mourned the 95 victims of Turkey's deadliest attack in years as state inspectors tried Sunday to identify who sent suicide bombers to a rally promoting peace with Kurdish rebels. \nThe government said Kurdish rebels or Islamic State militants were likely responsible, while mourners accused President Recep Tayyip Erdogan of fomenting violence to gain votes for the ruling party. \nNo one has claimed responsibility, but the attack bears similarities to a suicide bombing the government blames on the Islamic State group that killed 33 Turkish and Kurdish peace activists near a town bordering Syria in July. \nPolice detained 14 suspected Islamic State members Sunday in the central Turkish city of Konya, but it wasn't clear if they were related. \nSome Turkish media declared that peace itself was under attack. The bombers struck hours before Kurdish rebels battling Turkish security forces followed through with plans to declare a unilateral cease-fire, to reduce tensions leading up to Nov. 1 elections. \n--- \nSelf-declared Jewish, Muslim defenders of faith stoke tensions at contested Jerusalem shrine \nJERUSALEM (AP) — Jewish and Muslim grassroots groups, self-declared defenders of their faiths, have played a key role in rising Israeli-Palestinian tensions, stepping up activities at a contested Jerusalem shrine at the heart of the current violence. \nEach side has accused the other of causing provocations, as religious activists become more organized. \nIsrael pins much of the blame on a domestic fundamentalist group, the Islamic Movement, saying it whipped up Palestinian anger with claims that Israel is plotting to take over the Muslim-run site. Those claims, dismissed by Israel as incitement, reflect widespread Palestinian fears fueled by the doubling of Jewish visits to the shrine since 2010. \nBacked by senior Israeli politicians, activists have become more vocal in demanding Jewish prayer rights on the mount. Some call for the site's partition and the rebuilding of the biblical Jewish Temple that once stood there. \n\"As more and more Jews are going up, it is clear that this is bringing us closer to the immediate goal of prayer (rights), and afterward, the Temple,\" said Elishama Sandman, 19, who has led Jewish tours on the mount. \n--- \n3 Palestinians killed by Israeli fire, 4 Israelis stabbed by Arab-Israeli in latest violence \nJERUSALEM (AP) — A wave of Israeli-Palestinian violence showed no signs of abating Sunday, as three Palestinians, including a 2-year-old and a 13-year-old, were killed by Israeli forces, and four Israelis were wounded in an evening stabbing attack. \nThe attacks have been primarily stabbings and shootings, but a Palestinian woman seriously injured herself when she detonated a gas canister on Sunday. The attack, which lightly wounded a police officer, was the first in the current round of violence to involve such an explosive device. \nThe unrest erupted last month around the Jewish New Year, with clashes beginning at a contested holy site in Jerusalem and quickly spreading to other parts of the city, across Israel and into the West Bank and Gaza Strip. At least 24 Palestinians, including eight attackers, have been killed by Israeli forces, while five Israelis have been killed in attacks. \nWith random stabbings happening each day, the violence has Israelis on edge. Officials have called on citizens to carry guns in public for self-defense, and store owners say sales of guns and pepper spray are soaring. \n\"I think everyone should come and get a gun license,\" said Idan Albilia, a Jerusalem resident who was at a gun shop purchasing his first weapon. \"We need to defend ourselves. I think this is the only thing that will help us in this situation.\" \n--- \nAP Exclusive: When Trump got fired: Panama condo details busted budgets, alleged self-dealing \nPANAMA CITY (AP) — The directors of the Trump Ocean Club met July 28 on urgent business. They needed to fire Donald Trump. \nThe building's residents and condo owners had invested in the namesake, a 70-story waterfront tower along Panama Bay, on the strength of Trump's reputation. But during the four years that Trump Panama Condominium Management LLC had managed the property, Central America's largest building, a team installed by the Trump family was accused of running up more than $2 million in unauthorized debts, paying its executives undisclosed bonuses and withholding basic financial information from owners, according to an Associated Press examination. \nThe Trumps had done all of this through fine-print chicanery, the board said. A clause in many residents' purchase agreements prevented them from voting against the Trump company's wishes. That allowed the Trumps to install their top employee as chairman and the residents' representative on the board — even though the Trumps' actual stake in the building's residential area was merely a storage closet on the 15th floor. \nThe Trump Organization sent its response days later. \"Your letter is a complete sham,\" wrote the Trumps' top lawyer, Alan Garten. He accused the board of ingratitude and criminal trespassing. After refusing to accept being fired, Garten declared that Trump's company was quitting — and demanded a $5 million termination fee. \nWhether wheeling and dealing with Wall Street bankers, debating political rivals or running a condo association, Republican presidential candidate Donald Trump has advanced his interests by leveraging his outsized reputation, canniness and aggression. The Trump Organization's adventures in Panama provide a window into how these traits have filtered into his business empire — and the style of management that could be expected in a Trump White House. Transparency and close attention to expenses are not strengths. Squeezing the most from contractual language is. \n--- \nWould-be gun violence researchers see many challenges and little hope in career path \nNEW YORK (AP) — Amid the bloodbaths of 21st-century America, you might think that there would be a lot of research into the causes of gun violence, and which policies work best against it. \nYou would be wrong. \nGun interests, wary of any possible limits on weaponry, have successfully lobbied for limitations on government research and funding, and private sources have not filled the breach. So funding for basic gun violence research and data collection remains minuscule — the annual sum total for all gun violence research projects appears to be well under $5 million. A grant for a single study in areas like autism, cancer or HIV can be more than twice that much. \nThere are public health students who want to better understand rising gun-related suicide rates, recent explosions in firearm murders in many U.S. cities, and mass murders like the one this month at an Oregon community college, where a lone gunman killed nine people. \nBut many young researchers are staying away from the field. Some believe there's little hope Congress will do anything substantive to reduce gun violence, regardless of what scientists find. And the work is stressful — many who study gun violence report receiving angry emails and death threats from believers in unrestricted gun ownership. \n--- \nGood news at the pump, bad news for older Americans: No increase in Social Security next year \nWASHINGTON (AP) — For just the third time in 40 years, millions of Social Security recipients, disabled veterans and federal retirees can expect no increase in benefits next year, unwelcome news for more than one-fifth of the nation's population. \nThey can blame low gas prices. \nBy law, the annual cost-of-living adjustment, or COLA, is based on a government measure of inflation, which is being dragged down by lower prices at the pump. \nThe government is scheduled to announce the COLA — or lack of one — on Thursday, when it releases the Consumer Price Index for September. Inflation has been so low this year that economists say there is little chance the September numbers will produce a benefit increase for next year. \nPrices actually have dropped from a year ago, according to the inflation measure used for the COLA. \n--- \nMerkel: No need for new taxes to care for flood of newcomers entering Germany \nBERLIN (AP) — Germany will not have to raise taxes to help pay for the hundreds of thousands of refugees and other migrants who have been flooding into the country, Chancellor Angela Merkel said in an interview released Sunday, and the government should have new regulations in place by November to help deal with the influx. \nGermany expects at least 800,000 newcomers this year if not more, but Merkel told top-selling Bild newspaper in a preview of an interview to be printed in Monday's edition that there would \"definitely\" be no tax increases to help care for them. \n\"We can be pleased that we have been well managed for years and that our economic situation is currently good,\" she said. \nMerkel, who has seen her popularity dip slightly amid concerns over the drastic increase in asylum seekers, also sought to allay fears that the numbers could overwhelm the country's health care system. \nNobody should \"worry that a refugee will take away from their own quality of care.\" \n--- \nProsecutor, police union still at odds after expert reports called killing of boy justified \nCOLUMBUS, Ohio (AP) — The Cleveland police union and the local prosecutor remain at odds even after the release of expert reports that found a white officer was justified in fatally shooting a 12-year-old black boy last year. \nCuyahoga County Prosecutor Tim McGinty accuses the Cleveland Police Patrolmen's Association of failing to cooperate with the investigation into the death of Tamir Rice. The union counters that McGinty is just grandstanding. \nIt is the latest clash between a prosecutor and union who fought over the prosecution of another officer in a racially-charged case in a city under federal scrutiny for how its police force interacts with the public. \n\"The union operates by a double standard,\" McGinty said. \"It rightly asks the general public to have the courage to cooperate with police in serious criminal investigations, yet when the conduct of officers is being investigated, refuses to help.\" \nUnion President Steve Loomis said McGinty is ignoring the rights that officers have to not give statements during such investigations. \n--- \nAP Exclusive: Saudi prince says kingdom will remain in charge of hajj after deadly stampede \nABU DHABI, United Arab Emirates (AP) — Saudi Prince Turki al-Faisal on Sunday rejected the idea of sharing the administration of the annual hajj pilgrimage with other Muslim nations, saying Riyadh considers it \"a matter of sovereignty\" and a \"privilege.\" \nThe senior member of the Saudi royal family spoke to The Associated Press as his country faces mounting criticism in the wake of last month's disastrous crush of pilgrims outside the holy city of Mecca, which killed over 1,400 people, according to an AP count, making it the deadliest annual pilgrimage on record. \nSaudi Arabia's regional rival Iran, which lost the largest number of pilgrims, has accused the kingdom of mismanagement and called for an independent body to oversee the hajj. \nThe royal Al Saud family, which governs Saudi Arabia and for which the country is named after, derives enormous prestige and legitimacy from being the caretakers of the hajj and Islam's holiest sites in Mecca and Medina. King Salman, in line with past Saudi monarchs, holds the title of \"Custodian of the Two Holy Mosques\" in reference to the Grand Mosque in Mecca and the Prophet Muhammad's first mosque ever built in Medina. \nOversight of these holy places and the hajj \"is a matter of sovereignty and privilege and service,\" Prince Turki said. \n--- \nPolice director: Off-duty Memphis officer fatally shot; suspect in custody \nMEMPHIS, Tenn. (AP) — An off-duty police officer died Sunday after being shot multiple times, the fourth Memphis police officer to be fatally shot in slight more than four years, authorities said. \nMemphis Police Director Toney Armstrong said 31-year-old Terence Olridge was taken to the Regional Medical Center in Memphis on Sunday where he later died. \nArmstrong said officers got a call around 1 p.m. about a shooting at a home in the Memphis suburb of Cordova. He said a male suspect is in custody, but didn't say whether the person has been charged. \nArmstrong said the investigation is ongoing and that \"details are sketchy.\" \nIn August, Memphis police officer Sean Bolton was fatally shot in the line of duty. Related content", "external_links": [], "published": "2015-10-12T04:04:00.000+03:00", "crawled": "2015-10-12T04:45:33.144+03:00", "highlightTitle": ""}