{"organizations": [], "uuid": "4e88a031f6aed3bbb91dcd8a1f86f944b95e9d24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30292110/results-in-eeoc-criminal-background-check-case-illustrate-urgent-need-for-companies-to-work-w-3rd-party-screeners-states-criminalbackgroundrecordscom", "country": "US", "title": "Results in EEOC Criminal Background Check Case Illustrate Urgent Need for Companies to Work W/ 3rd Party Screeners, States CriminalBackgroundRecords.com", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Results in EEOC Criminal Background Check Case Illustrate Urgent Need for Companies to Work W/ 3rd Party Screeners, States CriminalBackgroundRecords.com - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:11:00.000+03:00", "replies_count": 0, "uuid": "4e88a031f6aed3bbb91dcd8a1f86f944b95e9d24"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30292110/results-in-eeoc-criminal-background-check-case-illustrate-urgent-need-for-companies-to-work-w-3rd-party-screeners-states-criminalbackgroundrecordscom", "ord_in_thread": 0, "title": "Results in EEOC Criminal Background Check Case Illustrate Urgent Need for Companies to Work W/ 3rd Party Screeners, States CriminalBackgroundRecords.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Recently BMW settled legal action brought by the Equal Employment Opportunity Commission over alleged misuse of criminal history reports at a cost of $ 1.6mm dollars (US). Adam Almeida, President and CEO of CriminalBackgroundRecords.com states: “The resolution of BMW v EEOC (Case number. 7:13-cv-01583, US District Court for District of South Carolina, Spartanburg Division) highlights the potentially extreme litigation cost and greatly illustrates an urgent need for all companies and organizations to work with third-party background screening companies in order to remain compliant with the EEOC and related federal and state agencies.”\nWaltham, MA (PRWEB) October 19, 2015\nIn September of 2015 BMW settled with the Equal Employment Opportunity Commission’s lawsuit over the alleged illegal and unlawful use of criminal history reports as part of an employment screening process. This action initiated in 2013.\nFrom JDSupra.com (Oct. 06, 15):\nOn September 8, 2015, BMW Manufacturing Company, LLC entered into a consent decree with the EEOC in which it agreed to pay $1.6 million to African-American employees whom the company failed to rehire in 2008 due to their criminal histories. The EEOC sued BMW in 2013, alleging BMW's criminal background check policy prohibited employment of individuals with convictions for certain crimes, regardless of when the conviction occurred or whether it was for a felony or misdemeanor. (1) Case number. 7:13-cv-01583\nThis action is likely to further embolden the EEOC in pursuing litigation against companies over misuse of criminal history records .\nAdam Almeida, President and CEO of CriminalBackgroundRecords.com states: “The use of criminal history reports has been commonplace in employment screening for many years, until recently when Ban-the-Box legislation eliminated the question of criminal history from applications and changed when a question of criminal past could be asked, thereby creating confusion over the use of criminal histories. The EEOC as part of being tasked with enforcing Civil Rights legislation has pursued litigation over alleged discriminatory use of criminal history information.”\nBut the EEOC does not always win in court. Recently the EEOC lost a case over discrimination and criminal history reports .\nIn the case of Freeman v. EEOC (Case Number, RWT 09cv2573, US District Court for District of Maryland) a federal judge ordered the EEOC to reimburse Freeman for legal fees after failing to prove their case.\nFrom Lexology.com (Sep. 29, 15):\nAlthough, the Court recognized the validity of evaluating whether an employer’s background check policies had a discriminatory impact, it found the EEOC’s analysis and statistics so unsound that—after its 2013 decision to exclude the EEOC’s expert reports and rule in Freeman’s favor, and after the Fourth Circuit Court of Appeals upheld the decision earlier this year—it awarded $938,771.50 in attorneys’ fees to Freeman. (2)\nRegardless the outcome one thing remains clear: The EEOC is not afraid to pursue legal action.\nFrom the National Law Review (Sep. 14, 15):\nThe upshot of these cases – despite their vastly different outcomes – is that the EEOC shows no signs of abating its uber-aggressive stance toward credit and criminal background checks . If your company uses such checks to screen applicants (often a logical and necessary step), pay close attention to casting too wide a net and make sure the filtering criteria is tailored to the position in question. (3)\nAlmeida states: “The EEOC will continue their litigation and these recent results highly suggest that companies and organizations should utilize third-party background screening companies in order to remain compliant with Federal and state law and, potentially, avoid costly legal action.”\nCriminalBackgroundRecords.com is a third-party pre-employment background screening company staffed with highly trained investigators that can create custom background screening programs designed to remain compliant with local and Federal law.\nNotes:\n(1) jdsupra.com/legalnews/eeoc-criminal-background-check-cases-32775/\n(2) lexology.com/library/detail.aspx?g=736d61f1-ee12-476c-ba73-a0c8cc458990\n(3) natlawreview.com/article/rollercoaster-week-eeoc-regarding-background-checks\nCase number for EQUAL EMPLOYMENT OPPORTUNITY COMMISSION, Plaintiff, v. BMW MANUFACTURING CO., LLC Defendant, 7:13-cv-01583-HMH-JDA, US District Court for District of South Carolina, Spartanburg Division\nCase number for EQUAL EMPLOYMENT OPPORTUNITY COMMISSION, Plaintiff, v. FREEMAN, Defendant, RWT 09cv2573, US District Court for District of Maryland\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/10/prweb13021158.htm\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .", "external_links": ["http://www.criminalbackgroundrecords.com/employment-screening-pre-employment-background-check.html", "http://www.criminalbackgroundrecords.com/index.html", "http://www.prweb.com/releases/2015/10/prweb13021158.htm", "http://www.criminalbackgroundrecords.com/sample-criminal-record-search-criminal-background-records.html", "http://www.criminalbackgroundrecords.com/criminal-background-checks.html"], "published": "2015-10-19T14:11:00.000+03:00", "crawled": "2015-10-19T13:27:50.362+03:00", "highlightTitle": ""}