{"organizations": [], "uuid": "4e072805f75cfbb153a23aeec139afa83606129d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stockhouse.com", "main_image": "", "site_section": "http://www.stockhouse.com/discovery/technology", "section_title": "The Technology Report - Technology investor news and research center ", "url": "http://www.stockhouse.com/news/press-releases/2015/10/12/qualcomm-signs-definitive-agreement-to-sell-vuforia-business-to-ptc", "country": "US", "title": "Qualcomm Signs Definitive Agreement to Sell Vuforia Business to PTC", "performance_score": 0, "site": "stockhouse.com", "participants_count": 1, "title_full": "Qualcomm Signs Definitive Agreement to Sell Vuforia Business to PTC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "4e072805f75cfbb153a23aeec139afa83606129d"}, "author": "stockhouse.com", "url": "http://www.stockhouse.com/news/press-releases/2015/10/12/qualcomm-signs-definitive-agreement-to-sell-vuforia-business-to-ptc", "ord_in_thread": 0, "title": "Qualcomm Signs Definitive Agreement to Sell Vuforia Business to PTC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO Qualcomm Incorporated (NASDAQ: QCOM), through its subsidiary, Qualcomm Connected Experiences, Inc., today announced it has signed a definitive agreement to sell its Vuforia business to PTC (NASDAQ: PTC), a global provider of technology platforms and solutions that transform how companies create, operate, and service the \"things\" in the Internet of Things (IoT). Under terms of the agreement, PTC will acquire the award-winning Vuforia business, including the developer ecosystem.\n\"Qualcomm always looks to push the boundaries of what is possible with computer vision. By leveraging the Company's mobile technology leadership, Vuforia has become the platform of choice for developers of augmented reality applications,\" said Derek Aberle , President of Qualcomm Incorporated. \"We share PTC's vision for a connected world and look forward to seeing the Vuforia mobile platform continuing to flourish under PTC's leadership. Qualcomm will continue to drive computer vision technology that will unlock a wide variety of applications for consumers and businesses around the world.\"\nVuforia is a mobile vision platform that enables applications to see, connecting the physical world with digital experiences that demand attention, drive engagement and deliver value. Over the 5 years since its inception, Vuforia has become an industry leading platform that has been supported by a global ecosystem of developers.\n\"The Vuforia team has made incredible progress establishing augmented reality as a medium for leading brands to reach millions of consumers around the globe,\" said Jay Wright , vice president of Vuforia, Qualcomm Connected Experiences, Inc. \"I look forward to leading the team under PTC.\"\nThe transaction is expected to close by the end of calendar year 2015, subject to customary closing conditions.\nAbout Qualcomm Incorporated\nQualcomm Incorporated (NASDAQ: QCOM) 3G, 4G and next-generation wireless technologies. Qualcomm Incorporated includes Qualcomm's licensing business, QTL, and the vast majority of its patent portfolio. Qualcomm Technologies, Inc., a wholly-owned subsidiary of Qualcomm Incorporated, operates, along with its subsidiaries, substantially all of Qualcomm's engineering, research and development functions, and substantially all of its products and services businesses, including its semiconductor business, QCT, and its IoE businesses. For more than 30 years, Qualcomm ideas and inventions have driven the evolution of digital communications, linking people everywhere more closely to information, entertainment and each other. Qualcomm's website , OnQ blog , Twitter and Facebook pages.\nThis press release contains forward-looking statements. Any statements contained herein which do not describe historical facts, including but not limited to, statements regarding: the proposed transaction between Qualcomm Connected Experiences and PTC; the expected timetable for completing the transaction; strategic and other potential benefits of the transaction; and any other statements about Qualcomm managements' future expectations, beliefs, goals, plans, or prospects, are forward-looking statements which involve risks and uncertainties that could cause actual results to differ materially from those discussed in such forward-looking statements. Such risks and uncertainties include: the possibility that certain closing conditions to the transaction will not be satisfied; the possibility that the transaction will not be completed or will not be completed in a timely manner; and those additional factors discussed in Qualcomm's most recent Quarterly and Annual Reports on Forms 10-Q and 10-K filed with the Securities and Exchange Commission. Investors are urged not to place undue reliance on these forward-looking statements, which speak only as of the date of this press release. Qualcomm undertakes no obligation to revise or update any forward-looking statements in order to reflect any event or circumstance that may arise after the date of this press release.\nQualcomm is a trademark of QUALCOMM Incorporated, registered in the United States and other countries.\nQualcomm Contacts:\nEmily Kilpatrick , Corporate Communications\nPhone: 1-858-845-5959\nEmail: [email protected]\nWarren Kneeshaw , Investor Relations\nPhone: 1-858-658-4813\nEmail: [email protected]\n releases/qualcomm-signs-definitive-agreement-to-sell-vuforia-business-to-ptc-300157719.html\nSOURCE Qualcomm Incorporated\nPR 15 SOFTWARE - APPLICATION TECHNOLOGY", "external_links": ["http://www.qualcomm.com/", "http://www.prnewswire.com/news-releases/qualcomm-signs-definitive-agreement-to-sell-vuforia-business-to-ptc-300157719.html", "http://www.qualcomm.com/blog", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA25363&Transmission_Id=201510120815PR_NEWS_USPR_____LA25363&DateId=20151012", "http://www.facebook.com/qualcomm", "http://www.twitter.com/qualcomm"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T15:27:18.650+03:00", "highlightTitle": ""}