{"organizations": [], "uuid": "564efc7e854acc40918cdb09ddde7447571c2ebf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reviewjournal.com", "main_image": "http://www.reviewjournal.com/sites/default/files/field/media/twitter.jpg", "site_section": "http://www.reviewjournal.com/life/technology", "section_title": "Technology | Las Vegas Review-Journal", "url": "http://www.reviewjournal.com/life/technology/twitter-may-allow-users-publish-updates-more-140-characters", "country": "US", "title": "Twitter may allow users to publish updates with more than 140 characters", "performance_score": 0, "site": "reviewjournal.com", "participants_count": 1, "title_full": "Twitter may allow users to publish updates with more than 140 characters | Las Vegas Review-Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T20:54:00.000+03:00", "replies_count": 0, "uuid": "564efc7e854acc40918cdb09ddde7447571c2ebf"}, "author": "Janko Roettgers", "url": "http://www.reviewjournal.com/life/technology/twitter-may-allow-users-publish-updates-more-140-characters", "ord_in_thread": 0, "title": "Twitter may allow users to publish updates with more than 140 characters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LOS ANGELES — Twitter may be getting ready to ease up on one of its oldest restrictions: The company is looking to launch a product that would allow users to publish updates with more than 140 characters, according to a Recode report.\nLittle is known about these plans, but it sounds like the product will be separate from the existing Twitter app. The goal is to allow users to publish long-form content on Twitter, according to Recode. One could imagine this to be a separate app, which could make use of Twitter to reach audiences, similar to the way Twitter's live streaming app Periscope tweets out links for new live streams.\nSeparately, Twitter may also ease up on restrictions within its legacy app and become a bit more lenient when counting those characters, according to the report. One option mentioned: Twitter may not count links as part of those 140 characters.\nIt's worth remembering why Twitter instituted the 140-character limit in the first place: In its earliest incarnations, Twitter relied heavily on SMS, which is limited to 160 characters. By limiting tweets to 140 characters, Twitter wanted to make sure that the user name and the tweet itself were short enough for one SMS message.\nThese days, most people use apps or Twitter's website to access the service, but the company is still seeing significant activity via SMS, especially in developing countries. In fact, most of Twitter's recent growth can be attributed to so-called \"SMS fast followers\" in developing countries, which are users without registered accounts that use text messaging to follow select accounts.\nTwitter's push to go beyond 140 characters is driven by its interim CEO Jack Dorsey, according to a report by The Information. Dorsey is currently in the running to become Twitter's next permanent CEO, and it's possible that a leak like this is meant to further the narrative of him having a bold vision for the future of the company -- something that investors, wary of Twitter's stalling growth, have been demanding for some time.\nComcast to enter video... Edward Snowden has joined... ", "external_links": ["https://www.wedgies.com/widgets/embed/question/560aeb370b8fe60f0000203e?widgetVersion=v1", "http://lasvegasreviewjournal.disqus.com/?url=http%3A%2F%2Forigin-www.reviewjournal.com%2Flife%2Ftechnology%2Ftwitter-may-allow-users-publish-updates-more-140-characters"], "published": "2015-09-29T20:54:00.000+03:00", "crawled": "2015-10-03T04:21:52.688+03:00", "highlightTitle": ""}