{"organizations": [], "uuid": "f0c7db38dfbe11c5bb1a48e5e041a6e0605ad55f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144260/cipherpoint-offers-security-maturity-assessment-that-allows-ciso-s-answer-question-are", "country": "US", "title": "CipherPoint Offers Security Maturity Assessment That Allows CISO's to Answer the Question, \"Are We Secure?\"", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "CipherPoint Offers Security Maturity Assessment That Allows CISO's to Answer the Question, \"Are We Secure?\"", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:35:00.000+03:00", "replies_count": 0, "uuid": "f0c7db38dfbe11c5bb1a48e5e041a6e0605ad55f"}, "author": "admin", "url": "http://www.freshnews.com/news/1144260/cipherpoint-offers-security-maturity-assessment-that-allows-ciso-s-answer-question-are", "ord_in_thread": 0, "title": "CipherPoint Offers Security Maturity Assessment That Allows CISO's to Answer the Question, \"Are We Secure?\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  CipherPoint Software, Inc. \nDENVER, Oct. 22, 2015 /PRNewswire/ -- CipherPoint Software(TM), a data centric security solutions provider, announced that they are offering complimentary access to Forrester's Security Maturity Assessment. The Forrester assessment is designed to provide a quantitative measurement of the maturity of an organization's information security program. A short version of the assessment is available online which organizations may take before requesting access to the full assessment. CipherPoint will also analyze the short assessment results and provide a follow-on report allowing organizations to measure their information security program maturity against others in the industry. \n\"Cybersecurity is a board level concern and a daily headline,\" says CipherPoint CEO, Mike Fleck, \"but many Chief Information Security Officers lack the means to report information security to the board. The first step in any security plan is to understand the current gaps in protection, and Forrester's Information Security Maturity Model allows organizations to see where they stand.\" \nAccording to Assess Your Security Program with Forrester's Information Security Maturity Model, an October 2014 Forrester Research report, \"The [full Forrester Information Security Maturity Model] consists of four top-level domains, 25 functions, and 128 components, each with detailed assessment criteria; It provides a consistent and objective method to evaluate any security program and articulate its scope.\" \nOrganizations can access the abridged Maturity Assessment Survey via the link below and at the end have an opportunity to request the full maturity assessment. \nhttp://pages.cipherpoint.com/forrester \nAbout CipherPoint Software, Inc. \nCipherPoint Software provides data centric auditing and protection solutions for securing unstructured information in platforms such as SharePoint, Office 365, and file servers. Only CipherPoint provides the ability to locate and secure information in on-premises and Cloud environments including the ability to prevent the exposure of information to privileged IT accounts (a favorite target of outside attackers). \nThe CipherPoint Eclipse data security platform includes a centralized security policy manager and the ability to enforce policies using software agents, Cloud security gateways, and APIs. The platform provides data discovery, transparent encryption at rest and in use, role-based and attribute-based access controls, and activity logging. CipherPoint is the only solution capable of seamlessly securing information as it moves among data center, private Cloud, and public Software as a Service use cases. \nContact: Charles Smith, CipherPoint at Email or at +1-888-657-5355. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/cipherpoint-offers-security-maturity-assessment-that-allows-cisos-to-answer-the-question-are-we-secure-300164025.html \nSOURCE CipherPoint Software, Inc.", "external_links": [], "published": "2015-10-22T15:35:00.000+03:00", "crawled": "2015-10-22T16:42:48.390+03:00", "highlightTitle": ""}