{"organizations": [], "uuid": "ecdb8332ba8861a9a8e729e299ddd14627bb8967", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/2015/10/prweb13021013.htm", "country": "US", "title": "Belatrix Software’s Internet of Things Coding Marathon Challenges Agile IoT Developers at Buenos Aires’ Palermo University", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Belatrix Software’s Internet of Things Coding Marathon Challenges Agile IoT Developers at Buenos Aires’ Palermo University", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "ecdb8332ba8861a9a8e729e299ddd14627bb8967"}, "author": "Fernando Gonzalez Aguirre", "url": "http://www.prweb.com/releases/2015/10/prweb13021013.htm", "ord_in_thread": 0, "title": "Belatrix Software’s Internet of Things Coding Marathon Challenges Agile IoT Developers at Buenos Aires’ Palermo University", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Belatrix Software is challenging Argentina’s brightest developers, engineers and software students to develop and demonstrate innovations for the Internet of Things (IoT) during a daylong, judged coding marathon -- IoT Hackathon 2015 at Buenos Aires’s University of Palermo on October 17. IoT Hackathon participants can advance their IoT-inspired ideas during the daylong coding event. Each team will receive a Raspberry Pi to develop and demonstrate their concepts, before being assessed by a panel of judges. The expert panel includes: Luciana Reznik, Director of Innovation at Wolox, Débora Slotnisky, technology journalist, and Gabriel Barrera, Professor of Artificial Intelligence.\nThe winners will receive a Smartwatch Moto 360 and training courses in different technologies. Registration is open and free to any developer who’d like participate in this major coding event at http://hackatrix.belatrixsf.com/iothackathon/ .\n“The Internet of Things has the potential to improve our quality of life by making our day-to-day lives easier, richer and more productive,” said Alex Robbio, Co-Founder and President of Belatrix Software. “At our IoT Hackathon, in the heart of Buenos Aires, we’ll offer the opportunity for some of Argentina’s brightest minds to envision a future where smart, connected devices transform our lives for the better.”\nAbout Belatrix Software\nBelatrix Software helps clients achieve the full impact of their R&D capabilities developing high quality, innovative software, QA, testing and mobile solutions that enables clients to generate best-in-class software products, decrease time to market, and gain competitive edge.\nBelatrix's clients include both established Fortune level and emerging, venture backed firms. Some of the firm's clients are Disney, Adobe, SiriusXM, mFoundry, and Chatham Financial. Belatrix is a South American company with offices in Naples, New York, Mendoza, and Lima. For more information, please call +1 (855) 521-4533 or visit http://www.belatrixsf.com .\nPress contacts: Fernando Gonzalez Aguirre press(at)belatrixsf(dot)com", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2hhY2thdHJpeC5iZWxhdHJpeHNmLmNvbS9pb3RoYWNrYXRob24v", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5iZWxhdHJpeHNmLmNvbQ==", "http://hackatrix.belatrixsf.com/iothackathon/"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T12:02:18.975+03:00", "highlightTitle": ""}