{"organizations": [], "uuid": "755c37dd90f8985dcb029421e13227cbe52ada59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://photos.prnewswire.com/prnvar/20121120/MM17393LOGO", "site_section": "http://rss.prnewswire.com/industry/technology/", "section_title": "PR Newswire: Business Technology", "url": "http://www.prnewswire.com/news-releases/ruckus-showcases-future-of-public-wi-fi-300160473.html", "country": "IT", "title": "Ruckus Showcases Future of Public Wi-Fi -- SAN JOSE, Calif.", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Ruckus Showcases Future of Public Wi-Fi -- SAN JOSE, Calif.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:02:00.000+03:00", "replies_count": 0, "uuid": "755c37dd90f8985dcb029421e13227cbe52ada59"}, "author": "Ruckus Wireless, Inc.", "url": "http://www.prnewswire.com/news-releases/ruckus-showcases-future-of-public-wi-fi-300160473.html", "ord_in_thread": 0, "title": "Ruckus Showcases Future of Public Wi-Fi -- SAN JOSE, Calif.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN JOSE, Calif. , Oct. 15, 2015 /PRNewswire/ -- (WBA WI-FI GLOBAL CONGRESS) -- Ruckus Wireless (NYSE: RKUS ) today announced that it has worked with the City of San Jose and San Jose Marriott to deploy a HotSpot 2.0 network for the Wireless Broadband Alliance (WBA) Wi-Fi Global Congress event, taking place this week at the San Jose Convention Center. The new technology enables automatic and secure Wi-Fi roaming onto participating Wi-Fi hotspots for subscribers from more than 30 operators around the world. Using the venue-provided Wi-Fi, attendees can get seamless connections as they move from the convention center and hotel to downtown restaurants and even the San Jose airport . This first-of-its-kind deployment features collaboration across a local city government, a major international airport and global hospitality leader – offering a glimpse of the future as HotSpot 2.0 technology continues to roll out across all geographies. By enabling HotSpot 2.0, the existing networks deployed by the City of San Jose and the San Jose Marriott now support roaming with dozens of major service providers. When attendees step off a plane, go to a downtown restaurant, relax in their room or attend a Wi-Fi Global Congress (#WGCSJ) session, HotSpot 2.0 will be there to transparently and securely connect them to the network.\n\"HotSpot 2.0 is the future of Public Wi-Fi. It elegantly solves the issues of connection frustration and lack of security inherent to legacy Public Wi-Fi,\" said Kash Shaikh , vice president of marketing and business development at Ruckus Wireless. \"We thank the City of San Jose and San Jose Marriott for their partnership in demonstrating the potential applications and business opportunities with HotSpot 2.0. The implications for the hospitality industry are profound, both for their loyalty program members and also to support inbound roaming for operator partners.\"\nWith HotSpot 2.0, an identifier is used to match a client credential – such as the cellular SIM card or a username/password pair – with supported hotspots. When there is a match, the client device automatically connects and then uses the credential to authenticate and encrypt the airlink. This means users don't have to figure out which SSID to connect to, nor do they have to manually authenticate via a captive log-in page. In this way, HotSpot 2.0 makes the Public Wi-Fi connection experience similar to cellular – and allows one seamless experience across Wi-Fi networks hosted by hundreds of different entities.\nWi-Fi Global Congress also hosted the 2015 WBA Industry Awards. Ruckus won two, for the Best Wi-Fi Enabled Consumer Electronics Device and/or Service for causing a Ruckus with HotSpot 2.0 Release 2, and the WBA Chairman Award – Technology Partner Category.  The awards were judged independently of the WBA by a panel of prominent experts. In addition to the two awards won, Ruckus was a finalist for three others, including Best High Density Wi-Fi Deployment in a Venue, Best Wi-Fi Deployment in a City or Public Area, Best Wi-Fi Device/Application. \nWi-Fi Global Congress runs Monday through Thursday at the San Jose Convention Center, and is hosted by the WBA. More than 500 operators, analysts, media and key influencers from around the world will attend. Speakers include Mayor of San Jose, Sam Liccardo ; Ruckus SVP and GM of Emerging Technologies Steve Martin; senior representatives from AT&T, BT, Cisco, Sprint and iPass; and CIO-level representatives from San Francisco , San Jose and New York . This year's event also features the inaugural meeting of the Connected City Advisory Board , a body working to promote the development of connected cities – including city and government representatives from New York , San Francisco , San Jose , Delhi and the Philippines , among others.\nFollow Ruckus Wireless on  LinkedIn  and  Twitter  for all the latest on #SimplyBetterWireless. \nABOUT RUCKUS WIRELESS\nHeadquartered in Sunnyvale, CA , Ruckus Wireless, Inc. (NYSE: RKUS ) is a global supplier of advanced wireless systems for the rapidly expanding mobile Internet infrastructure market. The company offers a wide range of indoor and outdoor \" Smart Wi-Fi \" products to mobile carriers, broadband service providers, and corporate enterprises, and has approximately 56,000 end-customers worldwide. Ruckus technology addresses Wi-Fi capacity and coverage challenges caused by the ever-increasing amount of traffic on wireless networks due to accelerated adoption of mobile devices such as smartphones and tablets. Ruckus invented and has patented state-of-the-art wireless voice, video, and data technology innovations, such as adaptive antenna arrays that extend signal range, increase client data rates, and avoid interference, providing consistent and reliable distribution of delay-sensitive multimedia content and services over standard 802.11 Wi-Fi. For more information, visit http://www.ruckuswireless.com .\nRuckus and Ruckus Wireless are trademarks of Ruckus Wireless, Inc. in the United States and other countries. All other product or company names may be trademarks of their respective owners.\nMedia Contact\nChristine Kerst \nchristine.kerst@ruckuswireless.com \n949-705-8144\nLogo - http://photos.prnewswire.com/prnh/20121120/MM17393LOGO \n \n\nSOURCE Ruckus Wireless, Inc.\n\n\nRELATED LINKS\nhttp://www.ruckuswireless.com", "external_links": [], "published": "2015-10-15T18:02:00.000+03:00", "crawled": "2015-10-15T18:09:57.399+03:00", "highlightTitle": ""}