{"organizations": [], "uuid": "2c4e822321ad47c6361972c793991f838fca1f4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30268269/signature-home-theater-reveals-renovated-showroom", "country": "US", "title": "Signature Home Theater Reveals Renovated Showroom", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Signature Home Theater Reveals Renovated Showroom - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:02:00.000+03:00", "replies_count": 0, "uuid": "2c4e822321ad47c6361972c793991f838fca1f4f"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30268269/signature-home-theater-reveals-renovated-showroom", "ord_in_thread": 0, "title": "Signature Home Theater Reveals Renovated Showroom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Houston Integrator Provides New Immersive Experience for Guests\n(PRWEB) October 15, 2015\nSignature Home Theater , a custom electronics design and integration company, is proud to announce a newly-renovated showroom in its main Champions location at 6911 FM 1960 West. The announcement is a culmination of a month-long project to create a contemporary, immersive space that goes beyond the usual custom home-theater experience. The renovation helps to highlight Signature Home Theater’s other services including lighting control, high-end audio/video distribution, and design and installation of full home automation systems.\nThe renovated showroom features LED wall panels and a Savant automation system that converts the room into a dynamic entertainment center where you can listen to music, watch a sports game or put on a movie. As part of the modernization effort, Signature gave the room a sleek, clean look—integrating projectors into the wall and hiding connections with AudioQuest cables while making sure to highlight new equipment.\n“We are excited to open people’s eyes to the idea of digital immersion and being in a room that can have lights on, music playing and they can do whatever they want in it, not just watch movies,” said Signature Home Theater owner Jonathan Lynch. “They can control everything down to wall color to create a pleasant experience that offers a whole package.”\nAmong the new equipment on display is the latest 5.1 Wilson Audio System, which features new non-obtrusive Sabrina speakers than can be tucked away into corners of the room. The sound system is complemented by a new laser projector system from Epson. Adjacent to the newly-renovated theater, guests can also enjoy the sounds of a 2-channel listening room with wood panel acoustic treatments showcasing a new McIntosh flagship display and Wilson Audio speakers.\nAnyone interested in experiencing smart technology and high-end audio can visit the renovated showroom Tuesday through Saturday from 10 a.m. to 6 p.m. Call Signature at (281) 370-1800 to schedule an appointment for a private tour or an after-hours visit. For those interested in visiting other locations, Signature Home Theater also has showrooms in the Gulf Freeway, Stafford and The Woodlands areas.\nAbout Us:\nSignature Home Theater is a full-service residential and commercial custom electronics design and integration company with over 50 years of combined industry experience. Signature is known as the leading source for high-performance audio, video and automation systems in Houston and the surrounding areas. A Savant Gold Dealer and Control4 certified, Signature Home Theater is committed to delivering the ultimate experience to the homeowner by combining the highest quality equipment with a knowledgeable installation staff. Visit http://sigtheater.com/index.php to learn more.\n //www.prweb.com/releases/2015/10/prweb13011933.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13011933.htm", "http://sigtheater.com/index.php", "http://sigtheater.com/", "http://sigtheater.com/contact.html", "http://www.sigtheater.com/products.html"], "published": "2015-10-15T18:02:00.000+03:00", "crawled": "2015-10-15T18:27:10.270+03:00", "highlightTitle": ""}