{"organizations": [], "uuid": "ce3bbbd0da163810d9c6e114ed09b23e62f6cddf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2009/antarcticlake.gif", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-antarctic-ice-shelves.html", "country": "US", "title": "New study projects that melting of Antarctic ice shelves will intensify", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "New study projects that melting of Antarctic ice shelves will intensify", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T18:00:00.000+03:00", "replies_count": 0, "uuid": "ce3bbbd0da163810d9c6e114ed09b23e62f6cddf"}, "author": "", "url": "http://phys.org/news/2015-10-antarctic-ice-shelves.html", "ord_in_thread": 0, "title": "New study projects that melting of Antarctic ice shelves will intensify", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Achilles' heel of ice shelves is beneath the water, scientists reveal September 15, 2013 \nNew research has revealed that more ice leaves Antarctica by melting from the underside of submerged ice shelves than was previously thought, accounting for as much as 90 per cent of ice loss in some areas. Antarctic seawater temperatures rising December 4, 2014 \nThe temperature of the seawater around Antarctica is rising according to new research from the University of East Anglia. Evolution of the Antarctic ice sheet May 27, 2015 \nULB study sheds a new light on the stability of the Antarctic ice sheet. It shows for the first time that ice rises (pinning points that keep the floating parts of ice sheets in place) are formed during the transition between ... Researchers devise new way to monitor 'health' of ice shelves July 21, 2015 \nStudying an exotic form of sea ice known as platelet ice has enabled a University of Otago-led international research team to construct a century-long record of the condition of Antarctica's Ross Ice Shelf. The warmer the higher: Sea-level rise from Filchner-Ronne ice in Antarctica October 5, 2015 \nThe more ice is melted of the Antarctic Filchner-Ronne shelf, the more ice flows into the ocean and the more the region contributes to global sea-level rise. While this might seem obvious, it is no matter of course for the ... Greenland's ice sheet plumbing system revealed October 9, 2015 \nPioneering new research sheds light on the impact of climate change on subglacial lakes found under the Greenland ice sheet. Recommended for you New study projects that melting of Antarctic ice shelves will intensify October 12, 2015 \nNew research published today projects a doubling of surface melting of Antarctic ice shelves by 2050 and that by 2100 melting may surpass intensities associated with ice shelf collapse, if greenhouse gas emissions from fossil ... Could 'The Day After Tomorrow' happen? October 9, 2015 \nA researcher from the University of Southampton has produced a scientific study of the climate scenario featured in the disaster movie 'The Day After Tomorrow'. Horn of Africa drying ever faster as climate warms October 9, 2015 \nThe Horn of Africa has become increasingly arid in sync with the global and regional warming of the last century and at a rate unprecedented in the last 2,000 years, according to new research led by a University of Arizona ... Study restores consensus after controversial 2014 paper questioned direct effects of climate change October 8, 2015 \nAn international research team led by UCLA life scientists has, for the first time, quantified the direct influence of climate on the growth of ecosystems around the globe. New study indicates Earth's inner core was formed 1 - 1.5 billion years ago October 7, 2015 \nThere have been many estimates for when the earth's inner core was formed, but scientists from the University of Liverpool have used new data which indicates that the Earth's inner core was formed 1 - 1.5 billion years ago ... How we discovered that the Earth's inner core is older than previously thought October 9, 2015 \nAccording to recent estimates, the Earth's solid inner core started forming between half a billion and one billion years ago. However, our new measurements of ancient rocks as they cool from magma have indicated that it may ...", "external_links": [], "published": "2015-10-12T18:00:00.000+03:00", "crawled": "2015-10-12T18:02:38.785+03:00", "highlightTitle": ""}