{"organizations": ["NY Times", "New York Times Magazine", "Times Magazine", "Times", "Google", "New York Times"], "uuid": "8f629366dd2a73f04e62c6fa7092bd71d661857b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/NY-Times-enters-virtual-reality-world-with-Google/49481341.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/corporate-news", "section_title": "corporate - Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/corporate-news/ny-times-enters-virtual-reality-world-with-google/49481341", "country": "IN", "title": "NY Times enters virtual reality world with Google", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "NY Times enters virtual reality world with Google", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T12:15:00.000+03:00", "replies_count": 0, "uuid": "8f629366dd2a73f04e62c6fa7092bd71d661857b"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/corporate-news/ny-times-enters-virtual-reality-world-with-google/49481341", "ord_in_thread": 0, "title": "NY Times enters virtual reality world with Google", "locations": ["Syria", "Ukraine", "South Sudan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jake Silverstein", "Dean Baquet"], "text": "#android NY Times enters virtual reality world with Google The New York Times and Google announced plans to team up on a virtual reality project which will distribute more than a million of the tech firm's Cardboard viewers. AFP | 21 October 2015, 2:45 PM IST Follow ETCIO Share SAN FRANCISCO: The New York Times and Google announced plans to team up on a virtual reality project which will distribute more than a million of the tech firm's Cardboard viewers.The low-tech gadget, which sells for as little as $4 and allows people to watch immersive videos on smartphones, will be distributed to New York Times subscribers for the release of a virtual reality film, \"The Displaced,\" about children uprooted by war.The film is \"the first critical, serious piece of journalism using virtual reality,\" and is designed \"to shed light on one of the most dire humanitarian crises of our lifetime,\" New York Times executive editor Dean Baquet said in a statement.The Times said it would distribute the viewers -- a crude virtual reality device made of folded cardboard -- to print subscribers the weekend of November 7-8, and would offer digital subscribers codes to obtain the device for free.The New York Times Magazine produced the film in collaboration with virtual reality company Vrse to show the experience of children caught in the global refugee crisis. It follows the daily lives of three children from South Sudan, eastern Ukraine and Syria.\"The power of VR is that it gives the viewer a unique sense of empathic connection to people and events,\" said Jake Silverstein, editor in chief of the Times Magazine.\"In the context of international reporting and conflict reporting, where our readers rely on us to bring them news and stories from remote and inaccessible places, this has huge potential. Through this immersive video experience, we can put our readers at the center of the most important story of our time.\"A two-dimensional version of the film will also be available on the Times website.A Cardboard software kit works with Apple or Android smartphones, turning the phones into screens for the low-cost viewers.Hundreds of applications have been created to work with Cardboard, taking advantage of position-sensing capabilities in smartphones to give wearers a sense of looking around in virtual environments while turning their heads.", "external_links": [], "published": "2015-10-21T12:15:00.000+03:00", "crawled": "2015-10-21T14:38:44.598+03:00", "highlightTitle": ""}