{"organizations": [], "uuid": "4f3e68e5b5605194a2fe8b6ca559f14b1fbcd686", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.techradar.com", "main_image": "http://cdn.mos.techradar.com/art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-hero-1200-80.jpg", "site_section": "http://www.techradar.com/rss/reviews", "section_title": "TechRadar: Technology reviews", "url": "http://www.techradar.com/reviews/pc-mac/pc-mac-desktops/lenovo-yoga-home-900-1307083/review", "country": "GB", "title": "Home", "performance_score": 0, "site": "techradar.com", "participants_count": 1, "title_full": "Lenovo Yoga Home 900 hands on review | TechRadar", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T02:30:00.000+03:00", "replies_count": 0, "uuid": "4f3e68e5b5605194a2fe8b6ca559f14b1fbcd686"}, "author": "Juan Martinez", "url": "http://www.techradar.com/reviews/pc-mac/pc-mac-desktops/lenovo-yoga-home-900-1307083/review", "ord_in_thread": 0, "title": "Home", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you use your desktop computer for entertainment as much as you use it for productivity, the Lenovo Yoga Home 900 (starting at $1,549, about £1,000, AU$2,133) might be right for you. This 27-inch touchscreen all-in-one can easily serve as the centerpiece for your living room, but it's also got enough hardware under the hood to help you power through important work.\nUnlike traditional all-in-ones, the Yoga Home features a flexible hinge that enables you to position it as a standard monitor, or as a giant tabletop tablet. To add to that flexibility, the Yoga Home 900 comes with a 3-hour battery, so you can unplug this all-in-one and move it around the house. Don't want the kids playing digital air hockey at the kitchen table? You can take the Yoga Home 900 to the common room for 180 minutes on a single charge.\nIt's a rare event for me to rave about a desktop, especially when there are so many laptops capable of performing at desktop levels, but the Lenovo Yoga Home 900 is no ordinary desktop. This is a product worth getting excited about.\nDesign The Home 900 features a 27-inch full HD (FHD) 1,920x1080 10-point touchscreen that dazzles. You'll absolutely want to plug this desktop in and watch your favorite action film. Although the matted screen does have a ton of black bezel border, the silver device is incredibly thin at just 0.76 inches (19.5mm), so it will be the envy of anyone who comes to your house for movie night.\nThe Home 900 is a heavy device at 16.75 pounds (7.59kg), so you're not going to be able to easily lug this thing to your next door neighbor's house. However, it is definitely light enough to transport from room to room, especially if you have a second set of helping hands.\nPart of the heft comes from the Home's triangular hinge, which lets the device rest in an upright traditional monitor position. The hinge is a bit hefty and clunky, so you're not going to be sliding the Home 900 back and forth at the snap of a finger. In order to adjust the computer from a lay-flat to an upright position, you have to press a button and drag the monitor into place. This sounds easier than it is; at almost 17 pounds, with a sturdy metal hinge, you'll want to be mindful of your fingers. This is definitely not an adjustment you'll want your children to make.\nPerformance and specs The Home 900 can be configured with an Intel Core i5 or Core i7 Broadwell processor, an NVIDIA GeForce 940A graphics card, up to 8GB of RAM and a whopping 1TB of data. So, this is no show-piece. When I played with the Windows 10 computer, I was able to snap back and forth between apps with ease.\nIf entertainment is your end-game, the Aura software is magical, especially if you plan to socialize with friends and family while playing. When you open the software in lay-flat mode, the circular interface puts everyone immediately into the action. No matter what side of the computer you're on, you can interact with the 10-point touchscreen with clear, vibrant viewing angles.\nAura is tied directly to the Windows app store, so you can quickly access interactive games without having to leave the interface and jumping back to Windows 10. The only thing I didn't love about Aura is its washed out gray home screen. For software that's supposed to be fun and engaging, the color scheme is reminiscent of an insane asylum's walls. But once you're inside a game, the Home 900's gorgeous screen pulls you right back in.\nJust like any other 2-in-1 device, the Home 900 features a built-in microphone and a webcam. So you'll be able to access and command Cortana, and your family can Skype with the grandparents on a giant screen from the comfort of your sofa.\nThe one major knock against the Home 900 is the responsiveness of its touchscreen. My colleague and I had issues initiating actions within apps. This could be a flaw unique to the early demo model, or it could be a result of the matte touchscreen. We were told by Lenovo reps that the glass is not Corning Gorilla Glass, and that Lenovo chose to go with a matte finish in order to deflect sunlight when the device is in lay flat mode. They made the right call in terms of glare, but I'm hoping there isn't a responsiveness issue on the models that hit stores in late October.\nEarly verdict If you couldn't already tell, I'm smitten with the Lenovo Yoga Home 900. It's difficult to find high-performance desktops that look and feel as good as good as consumer laptops and tablets. But that's exactly what Lenovo has created.\nWith the Home 900, you're getting the solid performance of a high-end consumer laptop with the storage capacity and expansiveness of commercial laptops and displays. Sure, it costs a pretty penny, you'd like to see double the RAM, a 4K monitor, Skylake processors and a better touchscreen that zaps responses immediately, but there are very few perfect devices on the market.\nWhat Lenovo has done is given you a gorgeous, family-friendly, work-friendly desktop that will provide you with hours of group interactivity. Enjoy.\n ", "external_links": ["http://cdn1.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-1-320-80.jpg", "http://cdn0.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-5-320-80.jpg", "http://cdn2.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-2-320-80.jpg", "http://cdn0.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-7-320-80.jpg", "http://cdn2.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-2-650-80.jpg", "http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg", "http://cdn1.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-1-650-80.jpg", "http://cdn0.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-7-650-80.jpg", "http://cdn0.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Lenovo/Yoga%20Home%20900/Lenovo%20Yoga%20Home%20900-5-650-80.jpg", "http://www.techradar.com/us/news/software/operating-systems/windows-10-release-date-price-news-and-features-1029245", "http://www.techradar.com/us/news/world-of-tech/techradar-s-reviews-guarantee-622749"], "published": "2015-10-20T02:30:00.000+03:00", "crawled": "2015-10-19T22:11:29.597+03:00", "highlightTitle": ""}