{"organizations": [], "uuid": "cf2a40a1a303aa746a417d799f7dc4f889badcdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/jeffbezos33_600x400.jpg", "site_section": "http://www.thestreet.com/topic/47561/technology-news.html?cm_ven_int=subnavnews", "section_title": "Technology News and Product Reviews - TheStreet", "url": "http://www.thestreet.com/story/13336025/1/3-biggest-takeaways-from-amazon-s-impressive-third-quarter-earnings-report.html", "country": "US", "title": "3 Biggest Takeaways From Amazon's Impressive Third-Quarter Earnings Report", "performance_score": 0, "site": "thestreet.com", "participants_count": 1, "title_full": "3 Biggest Takeaways From Amazon's Impressive Third-Quarter Earnings Report - TheStreet", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:14:00.000+03:00", "replies_count": 0, "uuid": "cf2a40a1a303aa746a417d799f7dc4f889badcdc"}, "author": "thestreet.com/", "url": "http://www.thestreet.com/story/13336025/1/3-biggest-takeaways-from-amazon-s-impressive-third-quarter-earnings-report.html", "ord_in_thread": 0, "title": "3 Biggest Takeaways From Amazon's Impressive Third-Quarter Earnings Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Amazon crushed analysts' expectations in its third-quarter report on Thursday, sending shares soaring.\nThe Seattle-based company reported second-quarter revenue of $25.4 billion, up 23% year over year, and earnings of 17 cents per share. Analysts surveyed by Thomson Reuters were expecting Amazon ( AMZN - Get Report ) to lose 12 cents a share on $24.9 billion in revenue. This marks the second quarter in a row Amazon showed up with a surprise profit.\nThe e-commerce giant provided guidance of $33.5 billion to $36.75 billion in revenue for the fourth quarter, which would be an increase of 14%-25% year-over-year. It expects an operating income of $80 million to $1.28 billion, compared to $591 million in fourth quarter 2014.\n\"We remain heads down, focused on driving a better customer experience through price, selection and convenience,\" Amazon CFO Brian Olsavsky said during the company's earnings call. \"We believe putting customers first is the only reliable way to create lasting value for shareholders.\"\nMust Read: Amazon's One Big Advantage Over Its On-Demand Rivals\nShares were up 9.8% to $619 in pre-market trading on Friday.\n\"I think the merchandise business is on fire and ripping the lungs out of Wal-Mart ( WMT - Get Report ) , but it is the web services business (AWS) that is the driver here,\" said TheStreet's Jim Cramer , portfolio manager of the Action Alerts PLUS Charitable Trust Portfolio , in his column for RealMoney .\nHere are the three key takeaways from Amazon's third-quarter report:\nAWS Is Killing It\nAmazon Web Services, Amazon's cloud services business , brought in $2.1 billion in revenue for the quarter, up 78% year-over-year.\nAWS brought in $521 million in operating income during the third quarter, nearly as much as Amazon's North America whole e-commerce business, which brought in $528 million in the quarter. Its operating margins grew 25% in the quarter, up from 21% in the second quarter and 21% in the first quarter.\nAWS \"continues to drive strong revenue growth and leverage, and should have a long runway of growth, in our opinion,\" Needham & Company analyst Kerry Rice wrote in a note Friday morning.\nAs Wall Street Journal editor Dennis Berman said on Twitter last night, \"If you valued Amazon Web Services' $8 billion in revenue at prevailing multiples, you'd have a $70 billion standalone company.\" Amazon's current market valuation is about $264 billion.\nPrime Day Was Officially A Success\nPrime Day added about 2 percentage points to Amazon's revenue growth during the quarter, according to Olsavsky.\n\"I'll remind you that Prime Day was a global event, so we saw that in International as well, and it was a great event for -- a great day for -- customers, Amazon and sellers alike.\"\nAmazon's director of investor relations, Phil Hardin, pointed to Prime Day as a significant contributor to the company's acceleration in paid unit growth during the quarter. Olsavsky said the company is very happy with the growth in the number of Prime members and how much they're spending, though he declined to give any specific numbers.\n\"Prime has become a significant GMV [gross merchandise volume] growth driver and we expect it to continue gaining momentum as a result of greater product selection and international adoption, particularly in India,\" Kerry Rice said. \"We expect Amazon will continue to focus on ramping Prime by adding selection, expanding geographies, faster delivery options, and more content.\"\nInternational Ambitions\nFor Amazon's international segment, revenue increased 7% to $8.3 billion. For the second quarter in a row, Amazon's international revenue growth accelerated, to 24% year-over-year in the third quarter from 20% in the second quarter.\n\"What was incrementally positive was that each segment and region contributed to the acceleration,\" Canaccord Genuity analyst Michael Graham wrote in a note Friday morning. \"Even with persisting currency headwinds, international revenue was strong.\"\nMargins for the international retail business were negative 0.7%, but much of that can be attributed to currency headwinds, which contributed to $64 million of unfavorable impact, according to Olsavsky. The segment's operating loss of $56 million was an improvement over last year's third quarter loss of $174 million.\nAnd analysts were still happy with Amazon's commitment to growing its international presence even more.\nIn particular, Amazon is focusing its energy on India . On the earnings call, management said active Indian customer accounts increased 230% year-over-year in the quarter, and sellers increased 250%. Amazon has also tripled its fulfillment capacity in the region in the past year.\n\"International growth is really being driven by Prime adoption, greater selection, greater Prime selection, including FBA,\" Olsavsky said. \"So it's essentially the same playbook at the U.S., the additional Prime features.\"", "external_links": ["https://plus.google.com/share?url=http://www.thestreet.com/story/13336025/1/3-biggest-takeaways-from-amazon-s-impressive-third-quarter-earnings-report.html", "http://twitter.com/share?url=http://www.thestreet.com/story/13336025/1/3-biggest-takeaways-from-amazon-s-impressive-third-quarter-earnings-report.html&text=3", "https://twitter.com/dkberman/status/657297780017381376", "http://www.linkedin.com/shareArticle?mini=true&url=http://www.thestreet.com/story/13336025/1/3-biggest-takeaways-from-amazon-s-impressive-third-quarter-earnings-report.html", "http://www.reddit.com/submit?url=http://www.thestreet.com/story/13336025/1/3-biggest-takeaways-from-amazon-s-impressive-third-quarter-earnings-report.html&title=3", "http://www.facebook.com/sharer.php?u=http://www.thestreet.com/story/13336025/1/3-biggest-takeaways-from-amazon-s-impressive-third-quarter-earnings-report.html"], "published": "2015-10-23T17:14:00.000+03:00", "crawled": "2015-10-25T07:58:18.680+02:00", "highlightTitle": ""}