{"organizations": ["El Nino"], "uuid": "4da96759e1ba91e8f3aa8f1686e1a875fe74f778", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.spacedaily.com", "main_image": "http://www.spxdaily.com/images-bg/la-nina-cools-ocean-surface-winter-1988-el-nino-warms-winter-1997-bg.jpg", "site_section": "http://www.terradaily.com/terradaily.xml", "section_title": "Earth News, Earth Science, Energy Technology, Environment News", "url": "http://www.spacedaily.com/reports/California_2100_More_frequent_and_more_severe_droughts_and_floods_likely_999.html", "country": "US", "title": "California 2100: More frequent and more severe droughts and floods likely", "performance_score": 0, "site": "spacedaily.com", "participants_count": 0, "title_full": "California 2100: More frequent and more severe droughts and floods likely", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T01:56:00.000+03:00", "replies_count": 0, "uuid": "4da96759e1ba91e8f3aa8f1686e1a875fe74f778"}, "author": "", "url": "http://www.spacedaily.com/reports/California_2100_More_frequent_and_more_severe_droughts_and_floods_likely_999.html", "ord_in_thread": 0, "title": "California 2100: More frequent and more severe droughts and floods likely", "locations": ["California"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["La Nina"], "text": "California 2100: More frequent and more severe droughts and floods likely by Staff Writers Richland WA (SPX) Oct 23, 2015 On the left, La Nina cools off the ocean surface (greens and blues) in the winter of 1988. On the right, El Nino warms up it up (oranges and reds) in the winter of 1997. Image courtesy Jin-Ho Yoon/PNNL. For a larger version of this image please go here . \nIn the future, the Pacific Ocean's temperature cycles could disrupt more than just December fishing. A study published in Nature Communications suggests that the weather patterns known as El Nino and La Nina could lead to at least a doubling of extreme droughts and floods in California later this century. \nThe study shows more frequent extreme events are likely to occur. Other research shows the Golden State's average precipitation increasing gradually, but not enough to account for the occurrence of extreme events. A better understanding of what gives rise to El Nino and La Nina cycles - together known as El Nino-Southern Oscillation - might help California predict and prepare for more frequent droughts and floods in the coming century. \n\"Wet and dry years in California are linked to El Nino and La Nina. That relationship is getting stronger,\" said atmospheric scientist Jin-Ho Yoon of the Department of Energy's Pacific Northwest National Laboratory. \"Our study shows that ENSO will be exhibiting increasing control over California weather.\" \nRain's range California is experiencing one of the most severe droughts in its history, but it's not clear if a warmer world will make droughts worse, more frequent or perhaps even improve the situation. After all, warmer air can hold more water, and some research suggests global warming could increase California's average rain and snowfall. \nHowever, research also suggests future rain will come down more as light drizzles and heavy deluges and less as moderate rainfall. Yoon and colleagues from PNNL and Utah State University in Logan, Utah, wondered if droughts might follow a similar pattern. \nTo find out, the researchers looked at what happens to California in global climate models. They simulated two periods of time: 1920 to 2005 using historical measurements; and 2006 to 2080 using conditions in which very few efforts are made to reduce greenhouse gas emissions. They chose this future scenario to examine the most extreme case. \nTo understand how well the simulations worked, they used two tactics to show reproducibility: In one tactic, they used a compilation of 38 different models. In the other, they re-ran a single model 30 times. The more similar the results, the more sure the researchers were of the finding. \nWeather pendulum The models showed that in the future, assuming emissions continue to increase, California seasons will exhibit more excessively wet and excessively dry events. These results suggest that the frequency of droughts could double and floods could triple between the early 20th century and late 21st century. \n\"By 2100, we see more - and more extreme - events. Flooding and droughts will be more severe than they are currently,\" said Yoon. \nBut why? Yoon suspected the El Nino-Southern Oscillation. Every two to seven years, El Nino comes in and warms up the tropical Pacific Ocean a few degrees, increasing winter rain and snowpack in California. On a similar schedule, La Nina cools things off. Both disrupt regular weather in many regions around the globe. \nTo explore El Nino's connection to California precipitation, Yoon and colleagues ran a climate model with and without El Nino. In both simulations, they ramped up the concentration of carbon dioxide by 1 percent every year for 150 years. In just one of the runs, they removed El Nino's cyclical contribution by programming the sea surface temperatures to reflect only steady warming. \nWithout El Nino and La Nina, the frequency of extreme precipitation in California stayed constant for the simulation's century and a half. With ENSO, simulated California experienced wide swings in rainfall by the end of the period. \nThe results suggest that even though researchers expect rain and snowfall to increase as the climate warms, the manner in which the water hits California could be highly variable. \nThe El Nino-Southern Oscillation is still a bit of a mystery, said Yoon. Scientists only know El Nino and La Nina years, named for the Spanish terms for boy and girl, are coming by sea surface temperatures and other weather hints. Studies that investigate what controls the unruly children could help scientists predict unruly weather in the future. \nJin-Ho Yoon, S.-Y. Simon Wang, Robert R. Gillies, Ben Kravitz, Lawrence Hipps, and Philip J. Rasch. Increasing water cycle extremes in California and relation to ENSO cycle under global warming, Nature Communications, Oct. 21, 2015, DOI: 10.1038/ncomms9657. .", "external_links": [], "published": "2015-10-25T01:56:00.000+03:00", "crawled": "2015-10-25T02:58:43.369+02:00", "highlightTitle": ""}