{"organizations": [], "uuid": "7b39bb5e1a0814a67ab116bb6fb8f3126481331c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1142211/ricoh-joins-american-business-act-climate-pledge-", "country": "US", "title": "Ricoh joins 'American Business Act on Climate Pledge'", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Ricoh joins 'American Business Act on Climate Pledge'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T18:02:00.000+03:00", "replies_count": 0, "uuid": "7b39bb5e1a0814a67ab116bb6fb8f3126481331c"}, "author": "admin", "url": "http://www.freshnews.com/news/1142211/ricoh-joins-american-business-act-climate-pledge-", "ord_in_thread": 0, "title": "Ricoh joins 'American Business Act on Climate Pledge'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: Ricoh Americas Corporation \nWASHINGTON, Oct. 19, 2015 /PRNewswire/ -- Today, Ricoh Americas Corporation attended the White House Summit on Climate and the Road through Paris. The Summit gathered leaders from the government, private sector, academic, technical and scientific communities to focus on cross-sector efforts to tackle the climate change challenge here in the United States as well as on a global scale. Specifically, the event focused on how to further efforts around carbon mitigation, sustainability, and resiliency, as well as how technologies are emerging to support and scale these efforts. Additionally, participants discussed how to further engage and organize in support of the upcoming COP21 Paris climate negotiations. \nhttps://photos.prnewswire.com/prnvar/20151019/278123LOGO \nAt the event, Ricoh announced that it has joined the American Business Act on Climate Pledge, joining more than 60 companies from across the American economy that are standing with the Obama Administration to demonstrate an ongoing commitment to climate action and to voice support for a strong outcome to the COP21 Paris climate negotiations. \nTHE AMERICAN BUSINESS ACT ON CLIMATE PLEDGE: \nWe applaud the growing number of countries that have already set ambitious targets for climate action. In this context, we support the conclusion of a climate change agreement in Paris that takes a strong step forward toward a low-carbon, sustainable future. \nWe recognize that delaying action on climate change will be costly in economic and human terms, while accelerating the transition to a low-carbon economy will produce multiple benefits with regard to sustainable economic growth, public health, resilience to natural disasters, and the health of the global environment. \nWe put forth our pledges as follows: -- Reduce greenhouse gas emissions \nAdvanced nations need to reduce their environmental impact to one-eighth the fiscal 2000 levels by 2050. Based on this, the Ricoh Group has established mid- and long-term environmental impact reduction goals for three key areas: energy conservation, resource conservation, and pollution prevention. Ricoh sets the target to reduce the company's total lifecycle of CO2 emissions by 30% by 2020 and by 87.5% by 2050 from the 2000 level. \nAs part of Ricoh's commitment, we have continuously improved the energy efficiency of our products. As a result, the average energy consumption of our ENERGY STAR certified color Multifunctional Printers has decreased more than 70% over the last 7 years. \nIn addition, we will install a solar farm system at our ENERGY STAR certified corporate facility in New Jersey by 2016 in order to partially offset its energy expenditure. -- Resource Conservation and Recycling \nRicoh's goal is to reduce the new input of resources by 25% by 2020 and by 87.5% by 2050 from the 2007 level. To reach that goal, we utilize materials in the most effective way possible. We are making our products smaller and lighter, employing parts with longer lifecycles, recycling and reusing parts and products, and expanding the use of renewable resources. \nFor details on Ricoh's full line of products, services and solutions, please visit www.ricoh-usa.com . \nAbout Ricoh \nRicoh is a global technology company specializing in office imaging equipment, production print solutions, document management systems and IT services. Headquartered in Tokyo, Ricoh Group operates in about 200 countries and regions. In the financial year ending March 2015, Ricoh Group had worldwide sales of 2,231 billion yen (approx. 18.5 billion USD). \nThe majority of the company's revenue comes from products, solutions and services that improve the interaction between people and information. Ricoh also produces award-winning digital cameras and specialized industrial products. It is known for the quality of its technology, the exceptional standard of its customer service and sustainability initiatives. \nUnder its corporate tagline, imagine. change. Ricoh helps companies transform the way they work and harness the collective imagination of their employees. \nFor further information, please visit www.ricoh.com/about/ \n© 2015 Ricoh Americas Corporation. All rights reserved. All referenced product names are the trademarks of their respective companies.", "external_links": [], "published": "2015-10-19T18:02:00.000+03:00", "crawled": "2015-10-19T19:10:52.721+03:00", "highlightTitle": ""}