{"organizations": [], "uuid": "9308721bb19c7e74c922a8328ff2d89adcf1f44b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://247PRESS.images.worldnow.com/images/8918934_G.jpg", "site_section": "http://www.cbs8.com/category/278881/technology", "section_title": "Technology - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30158925/real-time-sci-fi-strategy-game-big-bang-galaxy-launches-globally", "country": "US", "title": "Real-Time Sci-Fi Strategy Game \"Big Bang Galaxy\" Launches Globally", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Real-Time Sci-Fi Strategy Game \"Big Bang Galaxy\" Launches Globally - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T11:41:00.000+03:00", "replies_count": 0, "uuid": "9308721bb19c7e74c922a8328ff2d89adcf1f44b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30158925/real-time-sci-fi-strategy-game-big-bang-galaxy-launches-globally", "ord_in_thread": 0, "title": "Real-Time Sci-Fi Strategy Game \"Big Bang Galaxy\" Launches Globally", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japan-based Ateam Inc. has today released smartphone Sci-Fi Strategy Game \"Big Bang Galaxy\" on both the App Store and Google Play in 160 Countries!\n NAGOYA, JAPAN, October 01, Ateam Inc., a leading mobile application developer, is proud to announce that its real-time strategy sci-fi game \"Big Bang Galaxy\" was released today on the iTunes App Store and Google Play in 160 countries worldwide.\nABOUT \"BIG BANG GALAXY\"\n\"Big Bang Galaxy\" is a real-time strategy game which tasks players with leading a military campaign in outer space and exploring the furthest reaches of the galaxy. Players must gather resources to expand and upgrade their bases, then strategically command hulking capital ships and drones in assaults on enemy bases to plunder additional resources. The varied capital ships each have unique skills which can be the key to victory when used wisely. Additionally, players can create and join Alliances, which allow members to send and receive reinforcement ships that warp in to defend bases when under attack.\nBecome an elite commander, cooperate with your Alliance, and save the galaxy from the evil empire known only as Nemesis!\nGAME FEATURES\n- Sci-Fi Real-Time Strategy Realized with Full 3D Graphics!\nImmerse yourself in a vivid sci-fi universe with detailed 3D graphics. Take full control of capital ships and experience horrifically beautiful space battles.\n- Highly Strategic Battles!\nThere are many different capital ships and drones that can be deployed, each with their own strengths and weaknesses. Strike at the weak points in enemy defenses and design an unbeatable base!\n- Strengthen Your Base with Resources! Research New Technology to Enhance Your Units!\nDestroying the command center of an enemy base will net you resources you can use to improve your own facilities and ships. Create a base and galactic fleet that is uniquely you!\n- Chat in Real Time! Work with Your Alliance to Take Down Titan-Class Enemy Warships!\nChat with your friends and Alliance members with the real-time chat feature. Exchange information and work together to destroy the massive Titan-class enemy starships that have invaded the galaxy!\niTunes App Store: https://itunes.apple.com/app/id944093853\nGoogle Play: https://play.google.com/store/apps/details?id=com.ateam.bigbanggalaxy\niOS 8.0 or higher recommended. Devices that come standard with Android 4.1 or later\nAbout the Company:\nAteam Inc. is a publicly traded technology company in Japan operating across a variety of industry sectors. In addition to developing games for every major mobile platform, the organization also offers both commercial and personal web service and management solutions.\nAteam currently has several smash-hit titles. \"Dark Summoner\" reached the number 1 top grossing rank on the North American Google Play store, and fantasy RPG \"War of Legions\" brought real-time global Guild Battles to the card battle game genre for the first time ever.\nAteam Inc. 2015. All Rights Reserved. Google, Google Play, and Android are registered trademarks of Google Inc. in the U.S. and/or other countries. Apple, the Apple logo, iPhone, iPod and iPad are registered trademarks of Apple Inc. in the U.S. and/or other countries.\n release/realtime-scifi-strategy-game-big-bang-galaxy-launches-globally-413518.php", "external_links": ["https://itunes.apple.com/app/id944093853", "http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/realtime-scifi-strategy-game-big-bang-galaxy-launches-globally-413518.php", "http://app.a-tm.co.jp/", "http://app.a-tm.co.jp/bigbanggalaxy/", "https://play.google.com/store/apps/details?id=com.ateam.bigbanggalaxy"], "published": "2015-10-01T11:41:00.000+03:00", "crawled": "2015-10-01T14:17:34.610+03:00", "highlightTitle": ""}