{"organizations": [], "uuid": "3572b06141c3a9543a91efa5ee30a53ea98199f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "http://www.porttechnology.org/images/made/images/uploads/news/Transas_ECDIS_308_220.jpg", "site_section": "http://feeds.feedburner.com/PortTechnologyInternational-News", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/transas_fits_20_indonesian_surveillance_vessels/?utm_source=Feeds&utm_campaign=News&utm_medium=rss", "country": "GB", "title": "Transas Fits 20 Indonesian Surveillance Vessels", "performance_score": 0, "site": "porttechnology.org", "participants_count": 1, "title_full": "Transas Fits 20 Indonesian Surveillance Vessels", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "9044dd16541cd9432df5f539ba685fe0010c3e2d"}, "author": "porttechnology.org", "url": "http://www.porttechnology.org/news/transas_fits_20_indonesian_surveillance_vessels/", "ord_in_thread": 0, "title": "Transas Fits 20 Indonesian Surveillance Vessels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Transas ECDIS has been selected for installation on board 20 Surveillance vessels under operation of the Directorate General of Marine Resources and Fisheries Surveillance, Ministry of Marine Affairs and Fisheries (PSDKP – KKP), Republic of Indonesia. During the contract signing ceremony, the Director General of Marine Resources and Fisheries Surveillance Mr Asep Burhanudin stated: “Fitting the surveillance vessels with ECDIS will help us to better monitor the Indonesian waters and support prevention of illegal fishing which is one of key issues for the Ministry of Marine Affairs and Fisheries”.\nThe systems will be supplied and installed in cooperation with the Transas long-term local partner PT MultiIntegra.\n“Transas ECDIS will be integrated with main sensors such as GPS, Gyro, Speed Log, Wind Sensor and also AIS Transponder that can be operated in silence mode”, said Director of Surveillance Vessel – Directorate General of Marine Resources and Fisheries Surveillance Ir. Budi Halomoan, M.Sci.\nAloys Sutarto, CEO of the PT MultiIntegra added: “PT MultiIntegra and Transas have been working together in the Indonesian market for many years. And the new contract is a sign of our frutiful cooperation in delivering high-class solutions to the shipping industry.”\nTransas ECDIS has been supplied to numerous customers in Indonesia, including DISHIDROS- the Indonesian Navy, PELNI, PERTAMINA, BASARNAS, private shipping companies such as Gemilang Bina Lintas Tirta (GBLT), Samudera Indonesia, and many more, with local support and after sales service provided by the PT MultiIntegra.\nReview Transas in the PTI Supplier Directory", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T19:56:59.033+03:00", "highlightTitle": ""}