{"organizations": [], "uuid": "3078ae951be0a530d61927ef28a1a0f4d0c1222f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143281/kla-tencor-reports-fiscal-2016-first-quarter-results-and-agreement-to-combine-with-lam", "country": "US", "title": "KLA-Tencor Reports Fiscal 2016 First Quarter Results And Agreement To Combine With Lam Research", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "KLA-Tencor Reports Fiscal 2016 First Quarter Results And Agreement To Combine With Lam Research", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T11:00:00.000+03:00", "replies_count": 0, "uuid": "3078ae951be0a530d61927ef28a1a0f4d0c1222f"}, "author": "admin", "url": "http://www.freshnews.com/news/1143281/kla-tencor-reports-fiscal-2016-first-quarter-results-and-agreement-to-combine-with-lam", "ord_in_thread": 0, "title": "KLA-Tencor Reports Fiscal 2016 First Quarter Results And Agreement To Combine With Lam Research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/21/2015 @ 1:00 AM   KLA-Tencor Corporation \nMILPITAS, Calif., Oct. 21, 2015 /PRNewswire/ -- KLA-Tencor Corporation (NASDAQ: KLAC) today announced operating results for its first quarter of fiscal year 2016, which ended on September 30, 2015, and reported GAAP net income of $105 million and GAAP earnings per diluted share of $0.66 on revenues of $643 million. \nLogo - http://photos.prnewswire.com/prnh/20140123/SF50413LOGO \n\"KLA-Tencor posted solid results for the first quarter of fiscal year 2016, with new orders and earnings per share finishing above the range of guidance, and with revenue finishing at the top end of the range of guidance, demonstrating our market leadership, the resilience of our business model, and effective operational execution,\" said Rick Wallace, President and Chief Executive Officer. \"The strong demand we are experiencing affirms KLA-Tencor's ongoing focus on providing superior value to customers both in terms of meeting market requirements and delivering superior competitive offerings.\" GAAP Results Q1 FY 2016 Q4 FY 2015 Q1 FY 2015 Revenues $643 million $756 million $643 million Net Income $105 million $142 million $72 million Earnings per Diluted Share $0.66 $0.89 $0.43 Non-GAAP Results Q1 FY 2016 Q4 FY 2015 Q1 FY 2015 Net Income $112 million $159 million $79 million Earnings per Diluted Share $0.71 $0.99 $0.47 \nA reconciliation between GAAP operating results and non-GAAP operating results is provided following the financial statements that are part of this release. Non-GAAP results include the impact of stock-based compensation, but exclude the impact of acquisitions, restructuring, severance and other related charges. \nKLA-Tencor to Combine with Lam Research KLA-Tencor also announced today that it has entered into a definitive agreement with Lam Research Corporation (NASDAQ: LRCX) pursuant to which KLA-Tencor would combine with Lam Research, and KLA-Tencor stockholders would be entitled to elect to receive the economic equivalent of $32.00 in cash and 0.5 of a share of Lam Research common stock for each share of KLA-Tencor stock they hold. \nConference Call information: KLA-Tencor and Lam Research will host a joint conference call to discuss the results for KLA-Tencor's fiscal year 2016 first quarter, along with its outlook, and the transaction to combine with Lam Research. Please refer to the separate joint press release issued by KLA-Tencor and Lam Research today for additional details regarding the conference call. \nForward-Looking Statements: Statements in this press release other than historical facts, such as statements regarding: our ability to benefit from our market leadership position; the resilience of our business model; operational execution; our ability to provide superior value to customers, meet market requirements and deliver superior competitive offerings, are forward-looking statements, and are subject to the Safe Harbor provisions created by the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on current information and expectations, and involve a number of risks and uncertainties. Actual results may differ materially from those projected in such statements due to various factors, including but not limited to: the demand for semiconductors; the financial condition of the global capital markets and the general macroeconomic environment; new and enhanced product and technology offerings by competitors; cancellation of orders by customers; the ability of KLA-Tencor's research and development teams to successfully innovate and develop technologies and products that are responsive to customer demands; KLA-Tencor's ability to successfully manage its costs; market acceptance of KLA-Tencor's existing and newly issued products; changing customer demands; and industry transitions. \nFor other factors that may cause actual results to differ materially from those projected and anticipated in forward-looking statements in this release, please refer to KLA-Tencor's Annual Report on Form 10-K for the year ended June 30, 2015, and other subsequent filings with the Securities and Exchange Commission (including, but not limited to, the risk factors described therein). KLA-Tencor assumes no obligation to, and does not currently intend to, update these forward-looking statements. \nAbout KLA-Tencor: KLA-Tencor Corporation, a leading provider of process control and yield management solutions, partners with customers around the world to develop state-of-the-art inspection and metrology technologies. These technologies serve the semiconductor, LED and other related nanoelectronics industries. With a portfolio of industry-standard products and a team of world-class engineers and scientists, the company has created superior solutions for its customers for nearly 40 years. Headquartered in Milpitas, California, KLA-Tencor has dedicated customer operations and service centers around the world. Additional information may be found at www.kla-tencor.com . (KLAC-F) \nUse of Non-GAAP Financial Information : The non-GAAP and supplemental information provided in this press release is a supplement to, and not a substitute for, KLA-Tencor's financial results presented in accordance with United States GAAP. \nTo supplement KLA-Tencor's condensed consolidated financial statements presented in accordance with GAAP, the company provides certain non-GAAP financial information, which is adjusted from results based on GAAP to exclude certain costs and expenses, as well as other supplemental information. The non-GAAP and supplemental information is provided to enhance the user's overall understanding of KLA-Tencor's operating performance and its prospects in the future. Specifically, KLA-Tencor believes that the non-GAAP information provides useful measures to both management and investors regarding financial and business trends relating to KLA-Tencor's financial performance by excluding certain costs and expenses that the company believes are not indicative of its core operating results. The non-GAAP information is among the budgeting and planning tools that management uses for future forecasting. However, because there are no standardized or generally accepted definitions for most non-GAAP financial metrics, definitions of non-GAAP financial metrics (for example, determining which costs and expenses to exclude when calculating such a metric) are inherently subject to significant discretion. As a result, non-GAAP financial metrics may be defined very differently from company to company, or even from period to period within the same company, which can potentially limit the usefulness of such information to an investor. The presentation of non-GAAP and supplemental information is not meant to be considered in isolation or as a substitute for results prepared and presented in accordance with United States GAAP. KLA-Tencor Corporation Condensed Consolidated Unaudited Balance Sheets (In thousands) September 30, 2015 June 30, 2015 ASSETS Cash, cash equivalents and marketable securities $2,269,447 $2,387,111 Accounts receivable, net 460,813 585,494 Inventories 650,496 617,904 Other current assets 294,662 314,067 Land, property and equipment, net 302,868 314,591 Goodwill 335,218 335,263 Purchased intangibles, net 8,242 11,895 Other non-current assets 249,577 259,687 Total assets $4,571,323 $4,826,012 LIABILITIES AND STOCKHOLDERS' EQUITY Current liabilities: Accounts payable $107,363 $103,342 Deferred system profit 134,188 148,691 Unearned revenue 63,700 71,335 Current portion of long-term debt - 16,981 Other current liabilities 609,990 661,414 Total current liabilities 915,241 1,001,763 Non-current liabilities: Long-term debt 3,151,046 3,173,435 Unearned revenue 44,970 47,145 Other non-current liabilities 165,625 182,230 Total liabilities 4,276,882 4,404,573 Stockholders' equity: Common stock and capital in excess of par value 385,633 474,374 Accumulated deficit (45,055) (12,362) Accumulated other comprehensive income (loss) (46,137) (40,573) Total stockholders' equity 294,441 421,439 Total liabilities and stockholders' equity $4,571,323 $4,826,012 KLA-Tencor Corporation Condensed Consolidated Unaudited Statements of Operations Three months ended September 30, (In thousands, except per share amounts) 2015 2014 ---- ---- Revenues: Product $460,739 $476,598 Service 181,905 166,303 Total revenues 642,644 642,901 Costs and expenses: Costs of revenues 270,244 288,467 Engineering, research and development 119,943 143,637 Selling, general and administrative 91,663 101,644 Interest expense and other, net 26,495 10,146 Income before income taxes 134,299 99,007 Provision for income taxes 29,402 26,774 Net income $104,897 $72,233 Net income per share: Basic $0.67 $0.44 Diluted $0.66 $0.43 Cash dividends declared per share $0.52 $0.50 Weighted-average number of shares: Basic 156,820 164,845 Diluted 157,984 166,580 \nKLA-Tencor Corporation Condensed Consolidated Unaudited Statements of Cash Flows Three months ended September 30, (In thousands) 2015 2014 ---- ---- Cash flows from operating activities: Net income $104,897 $72,233 Adjustments to reconcile net income to net cash provided by operating activities: Depreciation and amortization 19,735 21,159 Non-cash stock-based compensation expense 12,248 15,483 Excess tax benefit from equity awards (10,159) (14,223) Net gain on sales of marketable securities and other investments (1,233) (1,635) Changes in assets and liabilities Decrease in accounts receivable, net 124,925 39,261 Increase in inventories (31,243) (23,445) Decrease (increase) in other assets 34,381 (2,732) Increase in accounts payable 4,158 5,276 Decrease in deferred system profit (14,504) (59,122) Decrease in other liabilities (49,423) (17,329) Net cash provided by operating activities 193,782 34,926 Cash flows from investing activities: Capital expenditures, net (7,341) (13,445) Purchases of available-for- sale securities (343,358) (624,860) Proceeds from sale of available- for-sale securities 200,353 732,337 Proceeds from maturity of available-for-sale securities 184,973 135,097 Purchases of trading securities (18,267) (22,567) Proceeds from sale of trading securities 15,540 18,986 Net cash provided by investing activities 31,900 225,548 Cash flows from financing activities: Repayment of debt (40,000) - Issuance of common stock - 4,677 Tax withholding payments related to vested and released restricted stock units (21,526) (27,168) Common stock repurchases (142,592) (124,839) Payment of dividends to stockholders (101,674) (82,413) Excess tax benefit from equity awards 10,159 14,223 Net cash used in financing activities (295,633) (215,520) Effect of exchange rate changes on cash and cash equivalents (4,377) (6,132) Net increase (decrease) in cash and cash equivalents (74,328) 38,822 Cash and cash equivalents at beginning of period 838,025 630,861 Cash and cash equivalents at end of period $763,697 $669,683 Supplemental cash flow disclosures: Income taxes paid, net $7,844 $20,361 Interest paid $3,149 $136 Non-cash activities: Purchase of land, property and equipment -investing activities $1,490 $3,571 Unsettled common stock repurchase -financing activities $9,610 $5,844 Dividends payable -financing activities $20,892 $ - KLA-Tencor Corporation Condensed Consolidated Unaudited Supplemental Information (In thousands, except per share amounts) Reconciliation of GAAP Net Income to Non-GAAP Net Income Three months ended September 30, June 30, 2015 September 30, 2015 2014 104,897 GAAP net income $ $142,019 $72,233 Adjustments to reconcile GAAP net income to non-GAAP net income Acquisition related charges a 3,581 3,578 3,998 Restructuring, severance and other related charges b 7,066 22,417 4,057 Income tax effect of non-GAAP adjustments c (3,348) (9,159) (1,539) 112,196 Non-GAAP net income $ $158,855 $78,749 === 0.66 GAAP net income per diluted share $ $0.89 $0.43 === 0.71 Non-GAAP net income per diluted share $ $0.99 $0.47 === Shares used in diluted shares calculation 157,984 159,965 166,580 Pre-tax impact of items included in Condensed Consolidated Unaudited Statements of Operations Acquisition Restructuring, Total pre-tax related severance and GAAP to non- charges other related GAAP charges adjustments Three months ended September 30, 2015 Costs of revenues $2,285 $2,770 $5,055 Engineering, research and development 650 1,010 1,660 Selling, general and administrative 646 3,286 3,932 Total in three months ended September 30, 2015 $3,581 $7,066 $10,647 Three months ended June 30, 2015 Costs of revenues $2,282 $7,458 $9,740 Engineering, research and development 650 6,310 6,960 Selling, general and administrative 646 8,649 9,295 Total in three months ended June 30, 2015 $3,578 $22,417 $25,995 Three months ended September 30, 2014 Costs of revenues $2,577 $355 $2,932 Engineering, research and development 700 2,933 3,633 Selling, general and administrative 721 769 1,490 --- --- Total in three months ended September 30, 2014 $3,998 $4,057 $8,055 =", "external_links": [], "published": "2015-10-21T11:00:00.000+03:00", "crawled": "2015-10-21T12:28:36.489+03:00", "highlightTitle": ""}