{"organizations": [], "uuid": "c7a55e28e0fd52b96e1250fdc0dc885089f1bbaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "http://www.porttechnology.org/images/made/images/uploads/news/psa_lay_indian_terminal_foundations_360_210.jpg", "site_section": "http://feeds.feedburner.com/PortTechnologyInternational-News", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/psa_lay_foundations_for_new_indian_terminal/?utm_source=Feeds&utm_campaign=News&utm_medium=rss", "country": "GB", "title": "PSA Lay Foundations for New Indian Terminal", "performance_score": 0, "site": "porttechnology.org", "participants_count": 1, "title_full": "PSA Lay Foundations for New Indian Terminal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "e3ad957ebbc90d35f62a0096087a1a70cbb02026"}, "author": "porttechnology.org", "url": "http://www.porttechnology.org/news/psa_lay_foundations_for_new_indian_terminal/", "ord_in_thread": 0, "title": "PSA Lay Foundations for New Indian Terminal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bharat Mumbai Container Terminals (BMCT), a wholly-owned subsidiary of PSA Bharat Investments Pte (which is a subsidiary of PSA International) celebrated the laying of the foundation stone to mark an important chapter in the development of the fourth container terminal in Jawaharlal Nehru Port (JNPT), India. Tan Chong Meng, CEO of PSA International, said: “Today's ceremony marks a key milestone in the joint efforts between PSA and JNPT to develop this new container terminal called Bharat Mumbai Container Terminal in Jawaharlal Nehru Port, India's largest and premier container gateway.\n“The Indian government has identified sustainable economic growth as a key pillar in the country's 'Vision 2022' and the development of BMCT, PSA's latest port project in India, will help facilitate that. I wish to thank JNPT and other stakeholders in India for the opportunity to work alongside them to develop this monumental project in India.”\nBMCT will be completed in two phases with each phase of the terminal having an annual capacity of 2.4 million TEU.\nThe development of phase one is expected to be completed in three years. Upon full completion of both phases, BMCT will have a quay length of 2,000 metres, 24 quay cranes and a designed annual capacity of 4.8 million TEU.\nBMCT will help facilitate trade and cater to the demand for container handling capacity at JNPT. The new terminal will serve the important industrial and manufacturing centres and cities in India's largest hinterland, and play a role in supporting India's fast-growing economy.\nEquipped with the deepest berths in JNPT and advanced port technologies, BMCT will be able to handle and ensure swift turnaround of the large container vessels plying our oceans today.\nFact File: As one of the leading global port groups, PSA participates in around 40 terminals in 16 countries across Asia, Europe and the Americas with flagship operations in PSA Singapore Terminals and PSA Antwerp.\nFor all the latest on PSA, click here", "external_links": [], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T19:58:23.001+03:00", "highlightTitle": ""}