{"organizations": [], "uuid": "db6154995fb0ebc5cb300981c31f3ea1c7e87088", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/technology.html", "section_title": "Technology", "url": "https://www.prbuzz.com/technology/349931-synqor-at-pacific-and-ausa-2015.html", "country": "US", "title": "SynQor exhibiting at PACIFIC and AUSA 2015", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "SynQor exhibiting at PACIFIC and AUSA 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "db6154995fb0ebc5cb300981c31f3ea1c7e87088"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/technology/349931-synqor-at-pacific-and-ausa-2015.html", "ord_in_thread": 0, "title": "SynQor exhibiting at PACIFIC and AUSA 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boxborough, MA – September 30, 2015 – SynQor , Inc. is exhibiting at both the biennial PACIFIC International Maritime Exposition and the Association of the United States Army (AUSA) 2015 Annual Meeting and Exposition. PACIFIC takes place Oct 6th - 8th at the Sydney Convention and Exhibition Centre @ Glebe Island . AUSA will take place Oct 12th - 14th at the Walter E. Washington Convention Center in Washington, D.C.\nSynQor, the go-to power supply manufacturer for the military market, continues to bring its field-proven high-efficiency synchronous rectifier technology to the industry with its Hi-Rel and Mil-COTS series of converters and filters and its extensive line of Military Power Systems. The Military Power Systems include Military-Grade Uninterruptible Power Supplies (UPS), Power Conditioners, 3-Phase input AC-DC Power Supplies, Inverters and 3U and 6U VPX Power Supplies. All products are designed and manufactured in the USA. This allows for tight control of quality and reliability while maintaining flexible factory scheduling, resulting in world-class performance.\nVisit SynQor at PACIFIC 2015 in Stand # 3G8 and at AUSA 2015 Booth # 7352 to learn more about SynQor’s industry leading power conversion products suitable for some of the most hostile environments, along with SynQor’s multi-functional Power Systems. For more information email SynQor at This email address is being protected from spambots. You need JavaScript enabled to view it. or contact your local representative.\nAbout SynQor: Located in Boxborough, MA USA, SynQor is a leading supplier of power conversion solutions to the military, avionics, transportation, medical, industrial, telecommunications and computing markets. SynQor’s innovative products are designed to exceed the demanding performance, quality, and reliability requirements of today’s power electronic engineers who develop leading-edge infrastructure hardware. SynQor provides all the power conversion modules needed to build a power system, as well as complete power systems. SynQor’s capabilities include both standard and custom solutions, which we deliver with industry-leading service and support. SynQor’s total commitment to quality, customer satisfaction and continuous improvement drives our business processes.\nAbout PACIFIC: Since its inception in 2000, the biennial Pacific International Maritime Exposition has become a fixture on the maritime industry calendar. Now, in lockstep with the Royal Australian Navy, the Pacific International Maritime Exposition will in future coincide with Navy Week, celebrated during the first week in October.\nAs the only comprehensive international exhibition of its kind in Australia, Asia and the Indo-Pacific region, PACIFIC 2015 will again provide the ideal showcase for commercial maritime and naval defense industries to promote their capabilities to decision makers from around the world. PACIFIC 2015 will be the ninth in the Pacific series.\nAbout AUSA: Since 1950, the Association of the United States Army has worked to support all aspects of national security while advancing the interests of America’s Army and the men and women who serve. AUSA is a private, non-profit educational organization that supports America’s Army – Active, National Guard, Reserve, Civilians, Retirees, Government Civilians, Wounded Warriors, Veterans, and family members. AUSA provides numerous Professional Development Opportunities at a variety of events both local and national. With 125 chapters located worldwide, made up entirely of volunteers, they provide recreational and educational opportunities to Soldiers and their families. Most importantly, they support our deployed Soldiers and families left behind. AUSA and its’ chapters have contributed over $2,000,000 to awards, scholarships, and support of soldier and family programs.", "external_links": ["http://www.pacific2015.com.au/exposition/travel.asp", "http://www.synqor.com/", "http://dcconvention.com/"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-10-01T07:27:14.164+03:00", "highlightTitle": ""}