{"organizations": [], "uuid": "63d0e34989447945d942faff6ed6131e8ead707a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.morningstar.com", "main_image": "", "site_section": "http://news.morningstar.com/all/dow-jones/technology.aspx", "section_title": "News Archive: Technology", "url": "http://news.morningstar.com/all/dow-jones/technology/201510155351/hon-hai-loses-battle-to-control-chip-company.aspx", "country": "US", "title": "Hon Hai Loses Battle to Control Chip Company", "performance_score": 0, "site": "morningstar.com", "participants_count": 1, "title_full": "Hon Hai Loses Battle to Control Chip Company", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "63d0e34989447945d942faff6ed6131e8ead707a"}, "author": "morningstar.com", "url": "http://news.morningstar.com/all/dow-jones/technology/201510155351/hon-hai-loses-battle-to-control-chip-company.aspx", "ord_in_thread": 0, "title": "Hon Hai Loses Battle to Control Chip Company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HONG KONG—Hon Hai Precision Industry Co. lost a struggle for control of a Taiwanese semiconductor company that is developing a key technology used in the latest iPhones and smartwatches, in a setback to its diversification efforts.\nShareholders of the Taiwan-based chip assembly firm Siliconware Precision Industries Co.—known as SPIL—voted down the company's plan to increase its share capital Thursday, which would have allowed Hon Hai to become the largest shareholder in SPIL.\nHon Hai, also known as Foxconn Technology Group, has been locked in a fierce battle for the past two months with the world's largest chip packaging firm, Advanced Semiconductor Engineering Inc., to gain control of SPIL, the world's No. 3 chip packaging and testing company by market share.\nSPIL is planning to expand in the market for system-in-package or SiP technology, which squeezes additional components into a tiny chip. That allows smartphones and wearable devices to be thinner, more energy efficient and more powerful. SiP design is used in the iPhone 6S and the Apple Watch, and analysts said Hon Hai, Advanced Semiconductor and SPIL are targeting billions in dollars in potential revenue and new orders from Apple.\nIn August, ASE, the No. 1 player in the chip packaging industry, made a $1 billion tender offer for shares in SPIL and subsequently obtained a 25% stake, becoming its largest shareholder. The tender offer was an attempt to take control of rival SPIL after competition intensified in the chip packaging industry as fast-growing Chinese competitor Jiangsu Changjiang Electronics Technology Co. acquired No. 4 ranked STATSChipPAC Ltd. earlier this year, analysts said.\nTo fend off what was seen as hostile takeover bid from Advanced Semiconductor, SPIL announced an alliance with Hon Hai a week later and disclosed plans for a share swap that would have given Hon Hai a 21.2% stake in SPIL. A successful alliance with Hon Hai—which assembles the majority of the world's iPhones—would have diluted ASE's stake in SPIL to 19.7%, knocking it down from its top shareholder status.\nSPIL, which failed to get enough shareholder votes to approve its share swap with Hon Hai, said late on Thursday it has filed a civil lawsuit against Advanced Semiconductor in Taiwan. It wants the court to confirm that its larger rival doesn't have the right to request registration as a shareholder of the company, citing ASE's tender offer prospectus was \"a sham.\"\nSPIL said Advanced Semiconductor claimed the tender offer was a \"pure financial investment\" but ASE has acted with a competitor's mind-set and repeatedly criticized the company's alliance with Hon Hai. SPIL says Advanced Semiconductor previously filed a petition for an injunction to block SPIL's shareholder meeting to vote on the share swap, stating that the strategic alliance with Hon Hai would affect the number of board seats ASE could obtain.\nThe alliance with SPIL was an important step for Hon Hai as it seeks new growth engines. Over the past decade, Hon Hai has been expanding in new markets beyond the labor-intensive device assembly by setting up several semiconductor units including printed-circuit-board maker Zhen Ding Technology Holding Ltd. and chip-packaging provider ShunSin Technology Holdings Ltd.\nSPIL also said Thursday it would continue to collaborate with Hon Hai to win new orders in the SiP market. The company's founders also plan to increase their stake in SPIL to fend off Advanced Semiconductor's influence on its business strategy.\nASE said it respects the outcome of the meeting. Hon Hai also said it respects the decision made by SPIL's shareholders.\nWrite to Lorraine Luk at lorraine.luk@wsj.com\nAccess Investor Kit for \"Apple, Inc.\"\nVisit http://www.companyspotlight.com/partner?cp_code=P479&isin=US0378331005\n 15, 2015 08:05 ET (12:05 ", "external_links": ["http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Checked.gif", "http://www.companyspotlight.com/partner?cp_code=P479&isin=US0378331005", "http://www.addthis.com/bookmark.php?v=250", "http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Unchecked.gif", "http://s7.addthis.com/static/btn/sm-share-en.gif"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T23:48:13.900+03:00", "highlightTitle": ""}