{"organizations": [], "uuid": "f7701939fdabc7da509bd66ce846b74cff03a03d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/16/13026468/Perform_Winners.jpg", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/2015/10/prweb13026468.htm", "country": "US", "title": "Dynatrace Honors Top Digital Performance Leaders and Innovators at PERFORM", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Dynatrace Honors Top Digital Performance Leaders and Innovators at PERFORM 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "f7701939fdabc7da509bd66ce846b74cff03a03d"}, "author": "Kayla Siefker", "url": "http://www.prweb.com/releases/2015/10/prweb13026468.htm", "ord_in_thread": 0, "title": "Dynatrace Honors Top Digital Performance Leaders and Innovators at PERFORM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dynatrace PERFORM Global User Conference – Digital Performance software company Dynatrace, today announced the PERFORM Awards 2015 winners. This program recognizes performance professionals and companies who are shaping the future of digital performance. Winners were honored at the awards ceremony dinner at the Dynatrace PERFORM Global User Conference in Orlando, Florida. “Businesses all around the world are rapidly embracing digital performance management as an essential discipline for their digital transformation,” said Nicolas Robbe, CMO of Dynatrace. “The professionals honored today are at the forefront of that transformation. They are true game changers, leading their companies, and the performance industry, into a bright digital future.”\nThrough the company’s new Digital Game Changers Program , Dynatrace honored six professionals from around the world for helping to shape the future of digital performance. Winners are leading a growing and vibrant community of digital performance transformers that thrive on innovation and building the future of application performance excellence. Awards were presented in two categories:\nDigital Game Changers - Mentors: These seasoned experts have proven their mettle in the field, transforming their organizations through DevOps, cloud and mobile, and helping to advance the digital performance landscape. They’ve also taken a leadership role among their peers, mentoring and supporting innovators inside and outside their companies. 2015 winners are:\nGopal Brugalette, Performance Architect at Nordstrom has elevated Nordstrom’s digital brand, understanding that digital performance is an underpinning to business success. Passionate about exceeding IT performance and business needs, Gopal has broken down siloes by creating a shared view of business performance metrics across Nordstrom. Gopal is a true performance ambassador, sharing his passion and expertise with companies around the world. Michael Wojcik, Vice President, Enterprise Technology Services at Panera Bread led the architecture and infrastructure team behind Panera Bread’s digital transformation. From day one, Michael believed that digital performance was critical to “Panera 2.0,” which delivers industry-leading mobile and in-café customer experience. Sandeep Shivakumar, Enterprise Monitoring Architect at Prudential Services Singapore championed digital performance management as the way to ensure superior performance in Prudential’s transformational new online portal for sales agents on the ground to connect seamlessly to the C-suite. Sandeep’s work impacts thousands of Prudential sales people and turned what was a three month reporting cycle to a real-time sales view for the CEO. As a result, Prudential now embraces the digital performance management approach to improve performance across the lifecycle as well as user experience. Digital Game Changers - Rising Stars: Innovators who have a commitment to raising the bar and changing the game from day one. These digital natives naturally see performance as a fundamental driver of digital business success and constantly look for innovative ways to leverage it. They are early in their careers and poised to achieve great things. The 2015 winners are:\nAlexander Pluim, CTO at BVA Auctions for seeing the potential for digital performance management in BVA’s marketing and SEO efforts. This innovative application of digital performance solutions has brought marketing and operations people together and speaking the same language and helped BVA become number one in SEO in their segment. Alexander is passionate about digital performance, making it an integral part of all operations and instilling a culture of continuous performance improvement. Derek Abing, Systems Engineer at Sentry Insurance for transforming the organization’s development paradigm by championing the use of digital performance management throughout the application lifecycle, delivering a shared perspective to business leaders and developers. Derek’s also contributed countless plugins that enhanced Dynatrace value to Sentry and his peers around the world. Mukesh Molugu, Performance Architect at DTCC for creating a new Performance Engineering Framework interwoven from dev to test and through production. Mukesh recognized that this approach would significantly speed and streamline the DevOps lifecycle if used throughout. A natural leader, he successfully championed and headed the initiative with a key business application. His efforts caught the attention of application leadership and he’s now working with app teams from across DTCC.\nOther PERFORM Award winners by category include:\nCommunity Rock Star Awards:\nRichard Dominguez of Prep Sportswear: Recognized for his ongoing contributions to the Dynatrace Application Monitoring and UEM communities and his unfailing willingness to help his peers. Friederike Thun of Amasol: Recognized for his outstanding commitment to the Dynatrace Data Center RUM community, and his depth of expertise in that space.\nMover & Shaker Award:\nSirius XM Radio, Inc.: Most innovative development partner. The Trail Blazer Award:\nBradesco Seguros: Most innovative use of digital performance management. The largest insurance company in Brazil and Latin America, the company uses Dynatrace solutions to monitor insurance transactions and productivity of key business processes. The Bradesco IT department is now measured on their contributions to business results. The company has achieved sales growth of 68% after deploying digital performance management to track and analyze business operations.\nThe Dynatrace Navigator Award:\nMoneyGram: The best individual business driver/use case adoption leveraging digital performance management. Since June of 2014, the MoneyGram IT team has transformed from monitoring and reporting on straight application availability to monitoring business transactions and user experience, giving the business the insight they need to make better customer-driven decisions.\nThe Ultimate Performance Journey Award:\nHumana: “Best in Show” digital performance management adoption. Humana successfully expanded their Dynatrace implementation to support their strategic business goal of providing end-to-end visibility into their users’ experiences on mission-critical applications enterprise-wide. As part of this initiative, the company implemented digital performance management across the lifecycle, in their DevOps environment and in support of their move to cloud in a performance journey of 1.5 years.\nTweet this: Top #DigitalPerformance Leaders and Innovators honored at #PERFORM2015 http://ow.ly/Tk7Zg #Dynatrace\nAbout Dynatrace\nDynatrace is the innovator behind the industry’s premier digital performance platform, making real-time information about digital performance visible and actionable for everyone across business and IT. We help customers of all sizes see their applications and digital channels through the lens of their end users. More than 7,500 organizations use these insights to master complexity, gain operational agility and grow revenue by delivering amazing customer experiences.\nFollow Dynatrace on:\n@Dynatrace About:Performance Blog CX Blog For Sales and Marketing Information\nDynatrace, 404 Wyman St., Suite 500, Waltham, MA 02451, 781-530-1000\nPress Contacts\nKayla Siefker, Sr. Global Public Relations Manager, 248-761-0304, kayla(dot)siefker(at)dynatrace(dot)com\nDerek Beckwith, Warner Communications, 617-331-3567, derek(at)warnerpr(dot)com", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5keW5hdHJhY2UuY29tL2VuL25ld3Nyb29tL3ByZXNzLXJlbGVhc2UvMjAxNS85L2R5bmF0cmFjZS1hbm5vdW5jZXMtcGVyZm9ybS0yMDE1LXRoZS13b3JsZC1sYXJnZXN0LWdhdGhlcmluZy1vZi1wcm9mZXNzaW9uYWxzLWZvY3VzZWQtb24tZGlnaXRhbC1wZXJmb3JtYW5jZS5odG1s", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5keW5hdHJhY2UuY29tL2VuL25ld3Nyb29tL3ByZXNzLXJlbGVhc2UvMjAxNS85L2R5bmF0cmFjZS1sYXVuY2hlcy1kaWdpdGFsLWdhbWUtY2hhbmdlci1yZWNvZ25pdGlvbi1wcm9ncmFtLmh0bWw=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5keW5hdHJhY2UuY29tLw==", "http://ow.ly/Tk7Zg", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2N4YmxvZy5keW5hdHJhY2UuY29tLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL293Lmx5L1RrN1pn", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2FwbWJsb2cuZHluYXRyYWNlLmNvbS8="], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T18:34:58.724+03:00", "highlightTitle": ""}