{"organizations": [], "uuid": "ec15acec1ba85debf1285cc1bfa99838aca0efcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/One-Year-Outcomes-From-the-COMBO-REMEDEE-All-Comers-Registry-Presented-at-TCT-2015-49037-1/", "country": "US", "title": "One-Year Outcomes From the COMBO REMEDEE All-Comers Registry Presented at TCT 2015", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "One-Year Outcomes From the COMBO REMEDEE All-Comers Registry Presented at TCT 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:30:00.000+03:00", "replies_count": 0, "uuid": "ec15acec1ba85debf1285cc1bfa99838aca0efcc"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/One-Year-Outcomes-From-the-COMBO-REMEDEE-All-Comers-Registry-Presented-at-TCT-2015-49037-1/", "ord_in_thread": 0, "title": "One-Year Outcomes From the COMBO REMEDEE All-Comers Registry Presented at TCT 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Date:10/19/2015 \nHONG KONG , October 19, 2015 /PRNewswire/ -- \nOrbusNeich, a global company specializing in the provision of life-changing vascular solutions, has announced today the presentation of the one-year clinical outcomes from the one-thousand patient REMEDEE* Registry by Robbert de Winter , M.D., Ph.D., of the Academic Medical Center, Amsterdam and principal investigator of the study, in the PCI Outcomes in DES session during the annual Transcatheter Cardiovascular Therapeutics (TCT) meeting, held in San Francisco , 11-15 October, 2015. The REMEDEE Registry is designed to evaluate the COMBO™ Dual Therapy Stent for the treatment of coronary lesions in the routine clinical care setting. \nThe registry's primary end point of one-year target lesion failure (TLF) was reported at the incidence of 5.7%, where TLR is defined as an independently adjudicated hierarchical composite of cardiac death (CD), target vessel myocardial infarction (TV-MI) not clearly attributable to a non target vessel, or target lesion revascularization (TLR) by percutaneous coronary intervention (PCI) or by coronary artery bypass grafting (CABG). The individual cardiac event rates reported were 1.7% CD, 0.7% TV-MI, and 4.4% ischemia driven TLR. The registry also showed a very low stent thrombosis rate of 0.6%. There was no incidence of late stent thrombosis; all thrombotic events occurred within the first 9 days after implant. \nThe REMEDEE registry is a true 'All Comers' study with patient risk factors that include 18.4% diabetics, 58% hypertension, 56.2% hypercholesterolemia and 37% prior revascularization. 30% of the patients presented with Acute Coronary Syndrome (ACS), comprised of ST-elevation myocardial infarction (STEMI), non-ST elevation myocardial infarction (NSTEMI) and unstable angina, whilst an additional 10% of the patients had stabilized ACS. Of the lesions treated, 50% were of type B2 and C. \nThe REMEDEE Registry is a prospective, multi-center, post market all comers registry that has enrolled 1,000 patients from nine European high-volume percutaneous coronary intervention centers, and is designed to evaluate COMBO's safety and performance. \"The one-year outcomes have provided real-world insights that support clinical effectiveness and safety of COMBO in terms of low ischemic and thrombotic event rates,\" said Dr. de Winter. \nOther data showcased at TCT 2015 included highlights of the clinical trial program for COMBO. During the Didactic Symposia Session focusing on the latest metallic DES technology, an update on the uniquely designed HARMONEE** trial was presented in support of the company's planned application for COMBO approval in Japan and the US. \"With enrollment well under way, we are looking forward to evaluating for the first time how both physiologic and anatomic measures can assess long-term outcomes, as well as using the most technologically advanced high-resolution imaging to show vascular healing,\" said Dr. Roxana Mehran , M.D., Director of Interventional Cardiovascular Research and Clinical Trials, Mount Sinai Medical Center, United States . \nProf. Stephen W.L. Lee , M.D., of the Queen Mary Hospital, Hong Kong also presented 2-year OCT findings and 3-year clinical follow up from the EGO-COMBO study. The results supported COMBO's early healing benefits with a near 80% coverage at 2 months. Stability in the long-term was also observed with progressive neointimal maturation without development of late stent failure up to three years. More importantly, significant neointimal regression was observed from 9 to 24 months, a phenomenon unseen with conventional metallic DES. \nNotes to Editors \n*REMEDEE Registry: Multicenter, P r ospectiv e , Clinical Outcomes After Deployment of the Ablu m inal Sirolimus Coat ed Bio-Engineered St e nt (Combo Bio-Engineered Sirolimus Eluting Stent) Post Market Registry. (ClinicalTrials.gov identifier: NCT01874002) \n**HARMONEE Stent Study: Harmonized Assessment by Randomized, Multi-center Study of OrbusNEich's COMBO StEnt (ClinicalTrials.gov identifier: NCT02073565) \nAbout COMBO Dual Therapy Stent - Repair, Regenerate, Naturally \nCOMBO is the world's first and only dual therapy stent designed to repair vessel injury and regenerate endothelium, fostering natural, true vessel healing. It does this by accelerating endothelial coverage and controlling neo-intimal proliferation. This is done through a combination of the proven EPC capture technology and a sirolimus drug elution, delivered from a bioresorbable polymer that is completely degraded within 90 days. \nOrbusNeich's patented endothelial progenitor cell (EPC) capture technology promotes the accelerated natural healing of the vessel wall after the implantation of blood-contact devices such as stents. The technology consists of an antibody surface coating that captures EPCs circulating in the blood to the device to form an endothelial layer that provides protection against thrombosis and modulates restenosis. \nAbout OrbusNeich - Pioneers in life-changing technologies \nOrbusNeich is a global pioneer in the provision of life-changing vascular solutions and offers an extensive portfolio of products that set industry benchmarks in vascular intervention. Current products are the world's first dual therapy stent, the COMBO Dual Therapy Stent, and the world's first pro-healing stent, the Genous™ Stent. Other products include stents and balloons marketed under the names of Azule™, R Stent™, Scoreflex™, Sapphire™ II, Sapphire™ II Pro and Sapphire™ II NC. OrbusNeich is headquartered in Hong Kong and has operations in Shenzhen, China ; Fort Lauderdale, Florida , USA.; Hoevelaken, The Netherlands ; and Tokyo, Japan . OrbusNeich supplies medical devices to interventional cardiologists in more than 60 countries. For more information, visit http://www.OrbusNeich.com . \nLearn more about our life-changing technologies on our social media channels:", "external_links": [], "published": "2015-10-19T14:30:00.000+03:00", "crawled": "2015-10-19T14:46:06.529+03:00", "highlightTitle": ""}