{"organizations": [], "uuid": "75fc24fc3693625cada6af3194abbc0aefb34dcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139289/assuritive-announces-support-microsoft-hyper-v-and-veeam-version-9", "country": "US", "title": "Assuritive Announces Support for Microsoft Hyper-V and Veeam Version 9", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Assuritive Announces Support for Microsoft Hyper-V and Veeam Version 9", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:23:00.000+03:00", "replies_count": 0, "uuid": "75fc24fc3693625cada6af3194abbc0aefb34dcc"}, "author": "admin", "url": "http://www.freshnews.com/news/1139289/assuritive-announces-support-microsoft-hyper-v-and-veeam-version-9", "ord_in_thread": 0, "title": "Assuritive Announces Support for Microsoft Hyper-V and Veeam Version 9", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/12/2015 @ 2:23 PM Companies mentioned in this article: Assuritive, Inc. \nLOS ANGELES, Oct. 12, 2015 /PRNewswire/ -- Assuritive, the leader in Infrastructure Replication and Disaster Recovery as a Service (DRaaS), today announced platform support for Microsoft Hyper-V, full support for Veeam Version 9, and a new management portal that it will debut at the VeeamON 2015 conference, October 26-28. \nhttp://photos.prnewswire.com/prnvar/20150315/181848LOGO \nThe addition of support for Microsoft's Hyper-V virtualization platform will broaden Assuritive's Instant Cloud Recovery portfolio of public, private and hybrid solutions. \n\"The addition of Hyper-V support to our existing services enables Assuritive to provide simplified Disaster Recovery services across the vast majority of virtualized and physical IT infrastructure,\" said Assuritive CTO, Max Duncan. \nAssuritive, a sponsor of the VeeamON 2015 conference, also announced that it will introduce a new web-based portal at the event as the latest addition to it's purpose-built DRaaS Instant Cloud Recovery solution, which enables companies to cut the high cost of legacy storage, recover from IT downtime in minutes and simplify the complexity of Disaster Recovery. \n\"We're excited to showcase Assuritive at such a highly regarded IT event,\" said Assuritive CEO, Lee Pearson. \"Our new portal, with its consolidated view of infrastructure protection, will give IT professionals a new level of control and transparency in BC / DR performance across multiple enterprise divisions or customers.\" \nAbout Assuritive: \nAssuritive, a specialized Disaster Recovery as a Service company, provides real-time infrastructure replication and disaster recovery for IT environments. Assuritive enables customers to easily replicate their servers, applications and infrastructure to the Assuritive Cloud, and in the event of a system failure or disaster, to fully recover IT systems in minutes. Assuritive is committed to supporting IT professionals in ensuring IT infrastructure integrity and its associated protection of the brand and ongoing business continuity. \nFor more information, visit http://www.assuritive.com/ \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/assuritive-announces-support-for-microsoft-hyper-v-and-veeam-version-9-300158215.html \nSOURCE Assuritive, Inc.", "external_links": [], "published": "2015-10-13T00:23:00.000+03:00", "crawled": "2015-10-13T01:13:34.166+03:00", "highlightTitle": ""}