{"organizations": [], "uuid": "719a3a86bf76cdf92b9a4257f8e9c1a94a6c6007", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "https://i.guim.co.uk/img/media/1020ffebff394bf5f2c906f550816e69c85e5422/205_5_3067_1840/master/3067.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=ed4c84a94db8a5ab05f14be89af577ba", "site_section": "http://www.theguardian.com/us/technology/rss", "section_title": "Technology | The Guardian", "url": "http://www.theguardian.com/technology/2015/oct/09/apple-removes-iphone-adblockers-facebook-third-party-apps", "country": "GB", "title": "Apple removes adblockers that work on Facebook and other third-party apps | Technology", "performance_score": 1, "site": "theguardian.com", "participants_count": 6, "title_full": "Apple removes adblockers that work on Facebook and other third-party apps | Technology | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T14:02:00.000+03:00", "replies_count": 6, "uuid": "7f0346fabe387ba016293be9926e59546e53d9c6"}, "author": "Samuel Gibbs", "url": "http://www.theguardian.com/technology/2015/oct/09/apple-removes-iphone-adblockers-facebook-third-party-apps#post-0", "ord_in_thread": 0, "title": "Apple removes adblockers that work on Facebook and other third-party apps | Technology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apple has started removing some adblockers from its App Store after they rocketed to the top of the download charts.\n\nAdblocking on the company’s iPhone and iPad was enabled within Safari by Apple’s content blocking system – a way for third-party apps to filter what is downloaded and displayed in the mobile browser.\nBut some apps, including the popular Been Choice , blocked ads not only within mobile Safari but other apps on the smartphone or tablet too .\nTo do that they installed root certificates on the devices and funnelled a user’s web traffic through a virtual private network (VPN) or proxy service, filtering out any advertising.\nThose apps have been deemed dangerous by Apple and removed from the App Store as they allow third-parties to view and interfere with a user’s browsing, even if encrypted – something that is often called a man-in-the-middle attack .\nAn Apple spokesperson said: “Apple is deeply committed to protecting customer privacy and security. We’ve removed a few apps from the App Store that install root certificates, which enable the monitoring of customer network data that can in turn be used to compromise SSL/TLS security solutions. We are working closely with these developers to quickly get their apps back on the App Store, while ensuring customer privacy and security is not at risk.”\nBlocking ads is controversial, classified as morally objectionable by some. Apple carefully crafted its content-blocking system to enable removal of content within mobile Safari only, not within third-party or other Apple apps. Apple’s News app, for instance, displays ads served by either the publisher of the content or Apple.\nThe company behind the iPhone gets a cut of every advert that it serves against publisher content, meaning that it is in Apple’s best interest to prevent wholesale adblocking outside of Safari.\nThe developer of Been Choice said that it would be changing its adblocking app to “remove ad blocking for Facebook, Google, Yahoo, and Pinterest apps” and resubmit to Apple in an attempt to be allowed back into the store.\nApple approves adblocker that even blocks Apple News Elon Musk says Apple is the ‘graveyard’ for fired Tesla staff \niPhones 6S battery life ‘varies by up to two hours depending on chip supplier’ Peace app creator pulls top ad blocker because its success ‘doesn’t feel good’", "external_links": [], "published": "2015-10-09T14:02:00.000+03:00", "crawled": "2015-10-09T14:35:35.616+03:00", "highlightTitle": ""}