{"organizations": ["Transhumanist Party", "Oxford University", "University of Nottingham", "Future of Humanity Institute", "CNN", "Green Movement"], "uuid": "890bcdbc5c15ba44e0f29e8447256f5b898653da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/151023094003-01-futurists-tease-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_tech.rss\r", "section_title": "CNN.com - Technology", "url": "http://edition.cnn.com/2015/10/26/tech/gallery/futurists/index.html?eref=rss_tech", "country": "US", "title": "Human cyborgs and the futurist movement", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Human cyborgs and the futurist movement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T15:12:00.000+02:00", "replies_count": 0, "uuid": "890bcdbc5c15ba44e0f29e8447256f5b898653da"}, "author": "", "url": "http://edition.cnn.com/2015/10/26/tech/gallery/futurists/index.html?eref=rss_tech", "ord_in_thread": 0, "title": "Human cyborgs and the futurist movement", "locations": ["Spain", "UK", "Catalonia", "United Kingdom"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Neil Harbisson", "Sandberg", "Gemma Fletcher", "Andrew Vladimirov", "Vintiner", "Sinclair", "Tiana Sinclair", "Bruere", "Caroline Falconer", "Dirk Bruere", "David Vintiner", "Harbisson", "Anders Sandberg", "Vladimirov", "Falconer"], "text": "Updated 1137 GMT (1937 HKT) October 26, 2015 9 photos: Human cyborgs and the futurist movement Human cyborg – David Vintiner and Gemma Fletcher recently photographed people interested in the relationship between futurism, technology and the human body. They met artist and self-described human cyborg Neil Harbisson, who had an antenna surgically implanted in his skull in 2004. Based in Catalonia, Spain, Harbisson says the antenna allows him to hear colors. For example, he said, blue sounds like the musical note C, or C sharp. Click through the gallery for more images of people associated with future tech and the human body. Hide Caption 1 of 9 9 photos: Human cyborgs and the futurist movement 'Prediction is really hard' – Anders Sandberg is a research fellow at the Future of Humanity Institute at Oxford University. Shown here in what he jokingly calls his \"natural environment in front of a white board,\" Sandberg describes his work as mostly \"long-range research into — literally — the state of our species.\" \"I'm essentially living in the future,\" Sandberg said. \"I'm trying to think ahead. But prediction is really hard. The interesting questions is: Can we learn what we are actually able to predict and which areas we should give up on?\" Hide Caption 2 of 9 9 photos: Human cyborgs and the futurist movement 'We are not the endpoint of evolution' – \"A futurist is someone who is not short-term thinking and who is trying to alter the course of events at least 10 years ahead or more,\" says Dr. Andrew Vladimirov. Based in the United Kingdom, Vladimirov is shown here demonstrating a device that shoots an infrared laser beam through the skull into the prefrontal cortex of the brain. The device is designed to learn more about \"what our brainwaves are for and what is consciousness,\" Vladimirov said. \"We are not the endpoint of evolution. We should enhance ourselves.\" Hide Caption 3 of 9 9 photos: Human cyborgs and the futurist movement Technology to 'overcome human flaws' – Vintiner says all the subjects of this project are interested in using technology to overcome human flaws. \"Where the body is flawed or limited, they're looking at combining technology with the human body to overcome that obstacle or to improve the human body in some way.\" Hide Caption 4 of 9 9 photos: Human cyborgs and the futurist movement 'Brain hacker' – Shown here wearing a helmet outfitted with electrical coils,Vladimirov told CNN he has no problem being called a \"brain hacker.\" He says he likes Hollywood's X-Men movie franchise, which is about evolving humans. He finds the X-Men films \"quite useful in promoting our cause.\" Hide Caption 5 of 9 9 photos: Human cyborgs and the futurist movement Future of psychology – Psychologist/neuroscientist Dr. Caroline Falconer of the University of Nottingham is developing ways to use virtual reality to treat depression. In the photo, Falconer demonstrates a head-mounted, high-definition, 3-D display with full-body tracking. Patients use this gear to spatially substitute their own bodies with an avatar. Falconer is shown reaching out to comfort a crying, virtual child in a computer program aimed at cultivating self-compassion. Hide Caption 6 of 9 9 photos: Human cyborgs and the futurist movement Future of psychology – \"As scientists, we're only beginning to look at the effects of having an avatar on the human psyche,\" Falconer said. Hide Caption 7 of 9 9 photos: Human cyborgs and the futurist movement Futurism in politics – Engineer Dirk Bruere is party secretary of the UK's Transhumanist Party, which puts emphasis on technology, health and science issues. Do futurists need their own party? \"You could have said that about the Green Movement years ago,\" he said. \"The fact that it's been very successful in influencing policy worldwide suggests maybe transhumanism can do the same. Bruere hopes to see his party get 5% of the vote in parliamentary elections next year. Hide Caption 8 of 9 9 photos: Human cyborgs and the futurist movement Mind-contolled drone – UK-based start-up founder and futurist Tiana Sinclair says she can control this small flying drone with her mind. \"Essentially the drone is like a huge biosensor. It's like a huge EEG device\" sensing alpha and beta brainwaves, Sinclair said. The drone is easier to control when she's trying to remember something structured, like an equation or a song. \"But really, futurism isn't about the gadgets, it's about the cultural change and impact. I'm kind of a big believer that the world is a little bit broken and we can solve its problems with the use of technology.\" Hide Caption 9 of 9 A whole movement is growing around the evolving connection between technology and the human body. A perfect example is self-described human cyborg Neil Harbisson, who has an antenna surgically implanted in his skull.", "external_links": [], "published": "2015-10-26T15:12:00.000+02:00", "crawled": "2015-10-26T15:24:26.446+02:00", "highlightTitle": ""}