{"organizations": [], "uuid": "ab5283519d25b234011b97f47fb25ccb16aa3c71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.innovativeretailtechnologies.com", "main_image": "", "site_section": "http://www.retailsolutionsonline.com/rssfeeds/rssnews", "section_title": "Innovative Retail Technologies News", "url": "http://www.innovativeretailtechnologies.com/doc/electronic-payments-businesses-nationwide-extends-terminal-0001?atc~c=771+s=773+r=001+l=a", "country": "US", "title": "Electronic Payments Prepares Businesses Nationwide For Upcoming EMV Liability Shift; Extends EMV Terminal Upgrade Program", "performance_score": 0, "site": "innovativeretailtechnologies.com", "participants_count": 0, "title_full": "Electronic Payments Prepares Businesses Nationwide For Upcoming EMV Liability Shift; Extends EMV Terminal Upgrade Program", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T06:36:00.000+03:00", "replies_count": 0, "uuid": "ab5283519d25b234011b97f47fb25ccb16aa3c71"}, "author": "", "url": "http://www.innovativeretailtechnologies.com/doc/electronic-payments-businesses-nationwide-extends-terminal-0001?atc~c=771+s=773+r=001+l=a", "ord_in_thread": 0, "title": "Electronic Payments Prepares Businesses Nationwide For Upcoming EMV Liability Shift; Extends EMV Terminal Upgrade Program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News | September 30, 2015 Electronic Payments Prepares Businesses Nationwide For Upcoming EMV Liability Shift; Extends EMV Terminal Upgrade Program \nContinuing its commitment to provide more secure ways to accept payments, Electronic Payments’ strategic EMV Upgrade Program gives businesses nationwide the ability to accept chip cards with a low-cost, future-proof solution that further protects against card fraud. For just $100, Electronic Payments merchants can upgrade their current processing equipment to an NFC/EMV-ready PAX S80 terminal, which has critical tools necessary to stay ahead of the upcoming liability shift in October 2015. \n“With the liability shift on the horizon, merchants need an affordable, simple plan for EMV adoption,” stated Michael Nardy, Electronic Payments Founder and CEO. “Too often, merchants are misinformed about the true impact of EMV on their businesses, and we’re taking every measure to educate our agent and merchant partners. Our EMV Upgrade Program ensures an easy, seamless transition to accept all forms of payment without inflated costs or lengthy contracts.” \nThe PAX S80 terminal delivers fast, reliable transactions and possesses superior connectivity options. With its integrated EMV and NFC capabilities, support for gift card acceptance and intuitive interface, merchants and consumers will find it both user-friendly and practical. \nMerchants may also elect to upgrade their processing systems with Clover Mini, a versatile solution that can easily replace a dated countertop terminal or function as a smart POS tablet with integration options and business-building capabilities via the Clover App Market. \n“Consumers are demanding greater flexibility and security when it comes to payment acceptance,” continued Mr. Nardy. “With our exclusive upgrade offerings, merchants will never have to turn down a sale. What’s more, our merchants will be able to educate consumers about the importance of smart card technology and how to use chip cards at the point of sale.” \nAbout Electronic Payments With “Innovation through every transaction”, Electronic Payments has distinguished itself as one of the fastest growing and highly regarded privately held payment and transaction processing companies in the United States. Electronic Payments currently serves businesses in all industry types and acquires new clients through a network of agent banks, sales agents and independent sales offices (ISOs). For more information, visit www.electronicpayments.com or www.bankcardprogram.com. \nSOURCE: Electronic Payments Like what you are reading? Sign up for our free newsletter SIGN ME UP By clicking Sign Me Up, you agree to our Terms and that you have read our Privacy Policy .", "external_links": [], "published": "2015-10-01T06:36:00.000+03:00", "crawled": "2015-10-02T15:07:06.468+03:00", "highlightTitle": ""}