{"organizations": [], "uuid": "715a8a8b9b0d22138046f4413103cf210f62a2ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/102515-Vanguard.jpg", "site_section": "http://www.philly.com/philly/business/technology/", "section_title": "Technology and tech news - Philly.com", "url": "http://www.philly.com/philly/business/20151025_Vanguard_and_the_new_federal_overtime_rules.html", "country": "US", "title": "Vanguard and the new federal overtime rules", "performance_score": 0, "site": "philly.com", "participants_count": 3, "title_full": "Vanguard and the new federal overtime rules", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 2, "uuid": "715a8a8b9b0d22138046f4413103cf210f62a2ef"}, "author": "Joseph DiStefano", "url": "http://www.philly.com/philly/business/20151025_Vanguard_and_the_new_federal_overtime_rules.html", "ord_in_thread": 0, "title": "Vanguard and the new federal overtime rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It was time to do something about inequality, President Obama said this summer.\n\"Too many Americans are working long days for less pay than they deserve,\" he told the nation June 29.\nHearing all the complaints about how the richest Americans, from hedge-fund managers to public company CEOs, have become lots richer, while purchasing power has stagnated for millions, Obama promised to strike back. He ordered the Labor Department to raise the number of U.S. workers eligible for overtime. The proposal would double the minimum yearly pay for which bosses can exempt most workers from overtime, to $50,440. Obama estimated this would mean a raise, or at least more free time, for five million American families.\nObama's goals \"were laudable: 'Let's put more money into the pockets of people working very hard at the lower end of the salary range' \" - or make them hire more people, if they don't want to pay overtime, says John P. Quirke, a lawyer representing employers for the law firm McCarter & English.\nBut Quirke says neither regulators nor most employers have done much to prepare for the \"psychological and emotional impact\" of reclassifying salaried professional and specialist staff as hourly workers, who will have to start signing time sheets again, such as when they were kids.\nAnd who's to guarantee they will be paid more?\n'Broader changes' This brings us to Vanguard Group. This month I reported that the Malvern-based mutual fund company had reclassified 2,100 U.S. employees, out of its 14,200 global staff, as hourly employees, instead of salaried.\nVanguard spokeswoman Arianna Stefanoni Sherlock told me the change was \"due in part to the anticipated Department of Labor regulatory changes, along with broader changes to our job classification structure.\"\nWill these reclassified Vanguard employees earn more, less, or about the same?\nThe company wouldn't say then, other than to promise its goal was to offer a pay and benefits package \"that is fair, reasonable, and competitive to all of our crew members whether they are hourly or salaried.\"\nWhen I posted that answer, dozens of Vanguard employees, spouses, and others wrote or called me privately to talk about what they see as the most obvious effect of the change:\nMany employees who earn less than $75,000 a year are losing year-end bonuses worth a few thousand dollars, without any guarantee they will make it up through overtime. The job reclassification also offers smaller promotion pay increases than under the old system.\nSome said they felt demoted and wanted to know why. Some \"crew\" are puzzled why Vanguard, after tripling its customer assets and vastly boosting its aggregate fee revenues since the recession without an increase in hiring, needs to be so relentless in controlling labor costs. (Vanguard's low fees and cost controls are central to its marketing.)\nIs this greed by senior managers? they asked. Was the company trying to reduce expense ratios so it could avoid raising fund fees, in case it is forced to pay higher federal income taxes, pending an IRS review?\nOthers said Vanguard, proud of its reputation for not doing mass layoffs, might be invoking the Labor Department rules as part of a larger reclassification strategy that would have the effect of persuading longtime workers to leave - so the company could more easily reduce head count, or hire new people.\nInformation-technology workers said the changes come as more work is being outsourced to providers such as India-based TCS (Tata Consulting Services).\nSherlock, the Vanguard spokeswoman, said: \"These changes have nothing to do with speculation regarding attempts to reduce head count, cover anticipated future tax costs, or outsourcing. The majority of IT work continues to be done internally at Vanguard.\"\nShe also said: \"Overtime requests will be determined as needed. We believe there will be opportunity for overtime, particularly during high-volume times for the business.\"\nOne of few Quirke praised Vanguard as one of the few U.S. companies that has started talking about the Labor Department rules in any form, before their scheduled implementation early next year (the government could still change details, such as the overtime-pay threshold).\nBetter to communicate now than make abrupt changes when the rules are final, which could leave workers hurt or suspicious, he said.\nIt shouldn't be surprising if companies use Obama's initiative to overhaul pay policies, Quirke added.\n\"If there's one positive thing to come out of this, regardless of what side of the fence you are on, it gives companies an opportunity to revisit where their priorities are, and how they are going to compensate individuals to advance those priorities,\" Quirke told me.\nOf course, \"that may end up hurting some people.\"\nJoeD@phillynews.com\n215-854-5194@PhillyJoeD\nwww.inquirer.com/phillydeals", "external_links": ["http://www.inquirer.com/phillydeals"], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-26T07:58:37.367+02:00", "highlightTitle": ""}