{"organizations": [], "uuid": "e81099cc10f8b1c3a65bd32a34b7e7baedaf0baa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1143825/arris-stockholders-approve-proposals-related-arris-s-acquisition-pace", "country": "US", "title": "ARRIS Stockholders Approve Proposals Related to ARRIS's Acquisition of Pace", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "ARRIS Stockholders Approve Proposals Related to ARRIS's Acquisition of Pace", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:00:00.000+03:00", "replies_count": 0, "uuid": "e81099cc10f8b1c3a65bd32a34b7e7baedaf0baa"}, "author": "admin", "url": "http://www.freshnews.com/news/1143825/arris-stockholders-approve-proposals-related-arris-s-acquisition-pace", "ord_in_thread": 0, "title": "ARRIS Stockholders Approve Proposals Related to ARRIS's Acquisition of Pace", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  ARRIS Group, Inc. \nSUWANEE, Ga., Oct. 21, 2015 /PRNewswire/ -- ARRIS Group Inc . (NASDAQ: ARRS) today announced that at a special meeting of stockholders held October 21, 2015, ARRIS's stockholders approved the merger agreement implementing ARRIS's pending acquisition of Pace (LSE: PIC) and the related reorganization in a cash and stock transaction. The proposal to adopt the transaction agreement and approve the merger was approved by stockholders holding 129,714,934 shares, representing approximately 88 percent of the outstanding ARRIS shares as of the record date (September 10, 2015) and over 99 percent of the shares voted at the meeting. \nEnglish law requires that Pace hold two special meetings to approve the scheme of arrangement: a court-ordered meeting and a general meeting, both of which are scheduled to be held on October 22, 2015. \nThese stockholder approvals are conditions to the closing of the acquisition and the merger. The closing of these transactions remains subject to the expiration or termination of the waiting period under the United States Hart-Scott-Rodino Antitrust Improvements Act of 1976 and the satisfaction of similar merger control requirements in Brazil and Colombia, together with satisfaction of other customary closing conditions. \nBob Stanzione, ARRIS Chairman and CEO, commented, \"We are pleased to complete another condition to the closing of the combination. We continue to believe that our strong, complementary businesses provide expanded opportunities to support our customers and increase our speed of innovation as we collaborate to invent the future.\" \nAbout ARRIS \nARRIS Group, Inc. (NASDAQ: ARRS) is a world leader in entertainment and communications technology. Our innovations combine hardware, software, and services across the cloud, network, and home to power TV and Internet for millions of people around the globe. The people of ARRIS collaborate with the world's top service providers, content providers, and retailers to advance the state of our industry and pioneer tomorrow's connected world. Together, we are inventing the future. For more information, visit www.arris.com . \nNo Offer or Solicitation \nThis document is provided for informational purposes only and does not constitute an offer to sell, or an invitation to subscribe for, purchase or exchange, any securities or the solicitation of any vote or approval in any jurisdiction, nor shall there be any sale, issuance, exchange or transfer of the securities referred to in this document in any jurisdiction in contravention of applicable law. \nForward-Looking Statements \nStatements made in this press release, including those related to the potential synergies and opportunities are forward-looking statements. Actual results may differ materially from the results suggested by these statements for a variety of reasons, including decisions made by regulatory authorities; the requirements, conditions and limitations imposed by regulatory authorities upon ARRIS and its business after completion of the transaction; and the other risk factors described in ARRIS' definitive proxy statement filed with the Securities & Exchange Commission on September 15, 2015. In providing forward-looking statements, the Company expressly disclaims any obligation to update publicly or otherwise these statements, whether as a result of new information, future events or otherwise, except as required by law. \nARRIS and the ARRIS Logo are trademarks or registered trademarks of ARRIS Enterprises, Inc. All other trademarks are the property of their respective owners. © ARRIS Enterprises, Inc. 2015. All rights reserved. \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/arris-stockholders-approve-proposals-related-to-arriss-acquisition-of-pace-300163908.html \nSOURCE ARRIS Group, Inc.", "external_links": [], "published": "2015-10-21T19:00:00.000+03:00", "crawled": "2015-10-21T20:10:43.451+03:00", "highlightTitle": ""}