{"organizations": [], "uuid": "00034459da71b8a39d01daad3528b00fd5158aee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1138577/pc-shipments-remain-depressed-by-volatile-currencies-inventory-and-os-transition-third", "country": "US", "title": "PC Shipments Remain Depressed By Volatile Currencies, Inventory, and OS Transition in the Third Quarter, Although 2016 Should Fare Better, According to IDC", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "PC Shipments Remain Depressed By Volatile Currencies, Inventory, and OS Transition in the Third Quarter, Although 2016 Should Fare Better, According to IDC", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:30:00.000+03:00", "replies_count": 0, "uuid": "00034459da71b8a39d01daad3528b00fd5158aee"}, "author": "admin", "url": "http://www.freshnews.com/news/1138577/pc-shipments-remain-depressed-by-volatile-currencies-inventory-and-os-transition-third", "ord_in_thread": 0, "title": "PC Shipments Remain Depressed By Volatile Currencies, Inventory, and OS Transition in the Third Quarter, Although 2016 Should Fare Better, According to IDC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/8/2015 @ 1:30 PM   IDC \nFRAMINGHAM, Mass. -- (BUSINESS WIRE) -- Worldwide PC shipments totaled nearly 71.0 million units in the third quarter of 2015 (3Q15), according to the International Data Corporation ( IDC ) Worldwide Quarterly PC Tracker . This volume represented a year-on-year decline of -10.8% – slightly worse than projections for a decline of -9.2%. \nThe lackluster volume of PC shipments was consistent with expectations that the third quarter would face challenging financial conditions and be a transition period. Across many regions, the channel remained focused on clearing Windows 8 inventory before a more complete portfolio of models incorporating Windows 10 and Intel Skylake processors comes on the scene. Vendors and channels were also working to limit price swings in the face of changes in currency exchange rates. Though easing a bit, currency devaluation continued to inhibit PC shipments in the third quarter. \nWhile Windows 10 has generally received favorable reviews and raised consumer interest in PCs, many users opted to upgrade existing PCs rather than purchase new hardware. In addition, the unusually short time between Windows RTM (release to manufacturing) and the official retail release hampered the ability of OEMs to launch certified new models, resulting in a limited selection of Windows 10 PCs (as well as related advertising) through much of the third quarter. \nAlthough the overall market continued to see double-digit declines, and even the top vendors saw shipments decline from a year ago, the top 4 vendors performed much better than the rest of the market. Collectively, the top 4 vendors saw shipments fall by -4.5% from a year ago compared to a decline of almost -20% for the rest of the market. The advantages of scale, concentration on portable PCs, deeper penetration of distribution channels in emerging regions, as well as smaller vendors exiting the market are all aiding the largest vendors. \n\"The PC market continues to contract as expected, but we remain optimistic about future shipments,\" said Jay Chou , Research Manager, IDC Worldwide PC Tracker. \"While PC shipments will be hampered in the short run by the availability of a free upgrade to Windows 10, the improved PC experience across user segments should drive longer-term demand for new PC hardware that is expected help stabilize the market in 2016 and beyond.\" \nThe U.S. PC market continued to suffer from soft demand in both the consumer and commercial segments. The July launch of Windows 10 had an immediate suppressive impact as many consumers took advantage of the free upgrade. In commercial, IT budgets remained focused on other projects including mobile-readiness and digital transformation initiatives. \n\"Still, there is some hope in the fourth quarter,\" stated Linn Huang , IDC Research Director, Devices & Displays. \"New designs running Windows 10 and powered by Intel's new Skylake processors are coming to market and may represent the most compelling reason we've had in years for consumers to upgrade their PCs. Whether this compulsion translates into actual sales remains to be seen.\" \nRegional Highlights \nUnited States – PC shipments in the U.S. totaled 17.3 million units, down slightly year over year. HP retained its leadership position followed by Dell. Apple reclaimed a seat in the top three, narrowly edging out Lenovo in volume. Toshiba rounded out the top five. Inventory issues lessened somewhat in September, improving the channel's appetite for new Windows 10 PC shipments ahead of the coming holidays. \nEurope, Middle East, and Africa (EMEA) – In line with second quarter trends, PC shipments in EMEA posted a double-digit decline, as vendors continued to deplete Windows 8 stock in preparation for shipments of new products for the holiday season. Inventory in the channels decreased significantly by the end of the quarter, making way for more Windows 10 machines. Nevertheless, currency fluctuations together with an ongoing economic and political turmoil in parts of the region continued to inhibit demand and constrained shipments. \nAsia/Pacific (excluding Japan) – Volume was close to expectations this quarter. The market was softer compared to the previous year due to currency impact on the region and clearing of channel inventory as the main priority for many countries. Some big projects were postponed, including an education project in India. The commercial market was soft and was generally supported by government projects in many countries. \nJapan – PC shipments maintained seasonal trends, showing solid growth compared to Q2 2015 but nonetheless fell below forecast as demand remained hampered by a weak Yen, persistent inventory, and a relative lack of Windows 10 marketing. \nVendor Highlights \nLenovo remained the number 1 vendor with 14.9 million units shipped, a decline of -4.9% compared to a year ago. Flattening performance in Asia/Pacific and lackluster volume elsewhere were offset by a strong quarter in the US, where the vendor continues to aggressively expand partnerships. \nHP remained at number 2 with shipments declining -5.5% from a year ago but still outperforming the market. HP also benefited from a stabilizing US market. \nDell at number 3 shipped more than 10 million units, registering a year-over-year decline of -2.9%. Strong results in Asia/Pacific (excluding Japan) and a flat market in the US helped to offset a relatively slow EMEA market. Notebook volume also was decent. \nApple continued to outperform other vendors, moving to number 3 in the United States and boosting share globally as well as domestically. \nAcer continued in the top 5, but saw shipments decline significantly from a strong third quarter performance a year ago as its largest regions, EMEA and Asia/Pacific, continued to see overall declines. Top 5 Vendors, Worldwide PC Shipments, Third Quarter 2015 (Preliminary) (Shipments are in thousands of units)", "external_links": [], "published": "2015-10-08T23:30:00.000+03:00", "crawled": "2015-10-09T02:48:42.437+03:00", "highlightTitle": ""}