{"organizations": [], "uuid": "794885ccabe2794134ecdde784bb9709c397715a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30268877/security-as-a-service-secaas-provider-my-digital-shield-to-host-msp-lunch-learn-sessions-on-cyber-security", "country": "US", "title": "Security-as-a-Service (SECaaS) Provider My Digital Shield to Host MSP Lunch & Learn Sessions on Cyber Security", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Security-as-a-Service (SECaaS) Provider My Digital Shield to Host MSP Lunch & Learn Sessions on Cyber Security - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T19:02:00.000+03:00", "replies_count": 0, "uuid": "794885ccabe2794134ecdde784bb9709c397715a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30268877/security-as-a-service-secaas-provider-my-digital-shield-to-host-msp-lunch-learn-sessions-on-cyber-security", "ord_in_thread": 0, "title": "Security-as-a-Service (SECaaS) Provider My Digital Shield to Host MSP Lunch & Learn Sessions on Cyber Security", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Informational luncheons will teach attendees how to strengthen security offerings and boost revenue streams\nWilmington, Del. (PRWEB) October 15, 2015\nWHAT:\nIn today’s digital age with almost every device connected to the Internet, cyber security is a concern for everyone. It has become a daily obstacle to stay secure and protected against falling victim to the hands of cyber criminals. My Digital Shield (MDS), a leading provider of Security-as-a-Service (SECaaS) for small businesses, is offering a series of complimentary “lunch and learn” sessions for MSPs and IT service providers interested in learning how MDS’ cyber security solution can help strengthen their offerings and boost recurring revenues.\nDETAILS:\nMDS CEO and Founder Andrew Bagrin will discuss today’s cyber security landscape and demonstrate how MDS can provide MSPs with complete control to protect their clients against cyber threat. Bagrin will also cover how MDS is paving the way for affordable security among IT service providers across various industries, including retail, restaurants, hospitality and professional services.\nThe attendees will learn:\n How to put the power of cyber security in their hands How to increase wallet share with their clients How MDS can pave the way for sales of other SMB services How selling MDS can deliver big dividends for their businesses, no matter the size\nWHEN and WHERE:\n Tuesday, October 20, 2015 at 11 am, MT LOCATION: Microsoft Corporation; 60 East Rio Salado Parkway #1200 Tempe, AZ 85281\nTo register: http://www.eventbrite.com/e/cyber-security-lunch-and-learn-presented-by-my-digital-shield-tickets-18705843682\n Monday, October 26, 2015 at 11 am, ET\nLOCATION: Ruth’s Chris Steak House; 148 West 51st New York, NY 10019\nTo register: http://info.mydigitalshield.com/newyork-october-26-2015-1\n Wednesday, October 28, 2015 at 11 am, ET\nLOCATION: Ruth’s Chris Steak House; 45 School Street Near the Omni Parker Hotel House, Old City Hall, Boston, MA 02108\nTo register: http://info.mydigitalshield.com/boston-october-28-2015-1-0\n Friday, October 30, 2015 at 11 am, ET\nLOCATION: Ruth’s Chris Steak House; 2525 N. Federal Highway, Fort Lauderdale, FL 33305\nTo register: http://info.mydigitalshield.com/fort-lauderdale-october-30-2015-1-0\nWHO:\nAndrew Bagrin is the CEO and founder of My Digital Shield (MDS), a leading provider of Security-as-a-Service (SECaaS) for small businesses. Bagrin has more than 17 years of experience in the IT security industry. MDS is focused on helping the underserviced and vulnerable small business market secure itself against cyber attacks. Founded in 2013, the company provides affordable, easy-to-install Security-as-a-Service (SECaaS) based on industry-leading unified threat management (UTM).\nAbout My Digital Shield\nMy Digital Shield (MDS) is a leading provider of Security-as-a-Service (SECaaS) that delivers enterprise-level security technology to small businesses. Based on industry-leading unified threat management (UTM) technology, MDS’ customizable cloud-based security solution offers continual protection against cyber threats and intrusion at an affordable price. With no bandwidth pollution, the SECaaS delivery model ensures that the latest virus definitions and threat updates are in use for continual threat assessment. Founded in 2013, MDS serves numerous managed service providers (MSPs) and small businesses in various industries including retail, restaurants, hospitality, and professional services. To learn more, visit http://www.mydigitalshield.com or follow on Twitter @MyDigitalShield.\n###\n //www.prweb.com/releases/2015/10/prweb13024824.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13024824.htm", "http://info.mydigitalshield.com/fort-lauderdale-october-30-2015-1-0", "http://www.eventbrite.com/e/cyber-security-lunch-and-learn-presented-by-my-digital-shield-tickets-18705843682", "http://info.mydigitalshield.com/newyork-october-26-2015-1", "http://info.mydigitalshield.com/boston-october-28-2015-1-0", "http://www.mydigitalshield.com/"], "published": "2015-10-15T19:02:00.000+03:00", "crawled": "2015-10-15T18:16:38.921+03:00", "highlightTitle": ""}