{"organizations": [], "uuid": "0034759ff30e3a240eb3266519846a0308754fb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/9/e/0/o/image.related.articleLeadwide.620x349.gk9dwx.png/1445468005667.jpg", "site_section": "http://www.canberratimes.com.au/digital-life", "section_title": "Technology | Tech News, Reviews &amp; Updates", "url": "http://www.canberratimes.com.au/digital-life/cartech/car-audio-sound-arguments-in-favour-of-good-gear-20151014-gk9dwx.html", "country": "AU", "title": "In-car audio doesn't have to sound crap", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "In-car audio doesn't have to sound crap", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T06:53:00.000+03:00", "replies_count": 0, "uuid": "0034759ff30e3a240eb3266519846a0308754fb7"}, "author": "Rod Easdown", "url": "http://www.canberratimes.com.au/digital-life/cartech/car-audio-sound-arguments-in-favour-of-good-gear-20151014-gk9dwx.html", "ord_in_thread": 0, "title": "In-car audio doesn't have to sound crap", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Units such as the Pioneer DEH P99RS can deliver top quality sound inside the car. Photo: supplied\nThere are many people who believe you can never achieve good audio in a car so it's useless even to try. They're so 20th century.\nThey'll start their rant by telling you that because you can't sit equidistant from the left and right speakers (unless you sit on the handbrake) you can't get accurate stereo imagery. This may have been the case when people bought Kingswoods, but electronics have come a ways since then.\nThese days you simply fit a sound processor with time alignment. Some car audio head units (the thing in the dash that controls everything) have time alignment built in. This is a clever feature that measures the distance of each speaker from the listeners and adjusts accordingly. The speaker furthest away fires out its signal straight away while every other speaker is delayed by the appropriate number of milliseconds so that the sound from each reaches your ears just when it should, as if you're sitting mid-way between them.\nUnits such as the Pioneer DEH P99RS can deliver top quailty sound inside the car. Photo: Supplied\nMost can adjust the sound for the driver, the front-seat passenger, both, or a full complement of occupants. When you switch between these settings you'll be amazed at the differences. .\nAdvertisement Sound processors do more than this. They also adjust the equalisation so that if you're into rock music you can turn up the bass and reduce the mids and highs, or if you listen to classical music you can do the opposite. Many people like to turn up both the lows and the highs and reduce the mids, giving the equaliser graphic a smiley-face look. Most equalisers also have pre-sets for various styles of music, and many can give you the sonic atmosphere of everything from an intimate supper club to an open-air stadium.\nThe next complaint you'll hear about car audio is that a car is too noisy for proper listening. But again this can be addressed, and not just with extra sound-proofing. Much of the noise comes from wind, tyres and suspension, and, to a lesser extent, engine and transmission. A small subwoofer can be used to counteract this.\nDon't be scared of subs, they don't have to mean deep thumping bass. If a sub has been installed skilfully you won't even hear it. What you will hear is greater precision, definition and spaciousness from all your other speakers. Mind you, if you're into bass the sub can be tuned for that, too.\nMany committed audiophiles will tell you huffily that cars present too many acoustical challenges in too small a space to work. Glass and plastics reflect soundwaves, making the sound much too bright, while upholstery and carpeting soak it up like sponges. Further, there are differing numbers of people, which alter the acoustics again.\nBut even when you're this far into audio there are clever solutions. Some head units test the acoustics every time they're started and adjust the equalisation appropriately, building up the weak spots across the audible spectrum and reducing the overly strong spots. These things can even adjust for a blanket or a cushion on the back seat. The feature is called various names by different manufacturers, but asking for automatic equalisation gets you there.\nFinally, audiophiles pooh-pooh car audio because they say the only way to get CD quality music is to slide in a CD, but both cabled and wireless connections are such now that many premium car audio systems can reproduce better than CD quality from phones and other compatible devices. At the same time, they give you all the other features on those devices, such as navigation, pictures, videos and social media.\nIt used to be that getting software updates necessitated going online and downloading them on to a USB or burning it to a disc, but these days the updates come to smartphones automatically, and are loaded into the car system when the phone is paired.\nGood car audio these days is, in a word, terrific. Get into a car with a great system and it becomes uncannily like driving around inside a premium pair of headphones.", "external_links": [], "published": "2015-10-22T06:53:00.000+03:00", "crawled": "2015-10-22T15:09:39.493+03:00", "highlightTitle": ""}