{"organizations": [], "uuid": "a1fd79db7ba0509f96f8e61db9c76ff10ae34d8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03480/boomerang2_3480096k.jpg", "site_section": "http://www.telegraph.co.uk/technology/rss", "section_title": "Technology", "url": "http://www.telegraph.co.uk/technology/social-media/11948231/Instagram-launches-gif-like-app-Boomerang.html", "country": "CH", "title": "Instagram launches gif-like app Boomerang", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Instagram launches gif-like app Boomerang", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T17:03:00.000+03:00", "replies_count": 0, "uuid": "a1fd79db7ba0509f96f8e61db9c76ff10ae34d8e"}, "author": "Rhiannon Williams", "url": "http://www.telegraph.co.uk/technology/social-media/11948231/Instagram-launches-gif-like-app-Boomerang.html", "ord_in_thread": 0, "title": "Instagram launches gif-like app Boomerang", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nInstagram has launched Boomerang, a standalone app for its own take on gifs, created by stitching together photos to create a brief video. \nOnce downloaded, users simply tap a button to start the photo -taking process. Videos shot within Boomerang play forwards, then backwards, resulting in a gif-like effect. The app is now available to download for both iOS and Android. \nThe technology is fairly similar to Apple's recently-announced Live Photos feature for the iPhone 6s and 6s Plus, which also stitches together images to create a few seconds of footage. \nThe new apps join Layouts and Hyperlapse among Instagram's standalone apps for framing multiple pictures within one Instagram and shooting fast-motion hyperlapse footage. \nThe photo-sharing platform introduced the ability to shoot video two and a half years ago, before which its primary focus was on photos. Janet Jackson has been embroiled in controversy after a number of fans who posted videos of her live perfomances had their footage deleted, and in one instance, a full account . \n\"My team is passionate about protecting the intellectual property we are creating for the tour and possible future projects... It was never their intention, acting on my behalf, to have social media accounts removed. \" the singer wrote in a message posted on Twitter. Hey you guys, I have been listening... I love and appreciate my fans. I want you to know that I enjoy (cont) https://t.co/BWucAbFdtW \nThe ten most popular Instagram accounts: in pictures \nOne Directioner Harry Styles was recently named as the UK's most followed Instagram account , followed by David Beckham, Niall Horan, Gareth Bale and Liam Payne. \nInstagram recently announced it had hit 400 million users, and was purchased by Facebook for $1bn (£660m) back in 2012 , although its estimated worth is now many times that. \nAround 80 million photos are shared on Instagram daily, with users able to edit them with a number of artistic filter options and indicate their approval by 'liking' or commenting on the images. According to Instagram, around 3.5 billion likes are made daily. \nThe picture on Instagram with the most likes is currently Kendall Jenner lying on the floor with her hair in a heart-shaped pattern, which has garnered more than 3m likes. She toppled her sister Kim and Kanye West's wedding day as the most-liked snap back in June.", "external_links": [], "published": "2015-10-22T17:03:00.000+03:00", "crawled": "2015-10-22T18:38:05.286+03:00", "highlightTitle": ""}