{"organizations": [], "uuid": "ed127c0755a44f95bd90ccd2695309b3522c02ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139292/c-w-networks-executes-20-year-agreement-allied-fiber-s-southeast-network", "country": "US", "title": "C&W Networks Executes 20-Year Agreement on Allied Fiber's Southeast Network", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "C&W Networks Executes 20-Year Agreement on Allied Fiber's Southeast Network", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T00:30:00.000+03:00", "replies_count": 0, "uuid": "ed127c0755a44f95bd90ccd2695309b3522c02ad"}, "author": "admin", "url": "http://www.freshnews.com/news/1139292/c-w-networks-executes-20-year-agreement-allied-fiber-s-southeast-network", "ord_in_thread": 0, "title": "C&W Networks Executes 20-Year Agreement on Allied Fiber's Southeast Network", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/12/2015 @ 2:30 PM Companies mentioned in this article: Allied Fiber \nJACKSONVILLE, Fla., Oct. 12, 2015 /PRNewswire/ -- Allied Fiber , the United States' first open-access, integrated, network-neutral colocation and dark fiber superstructure, today announced a 20-year Indefeasible Right of Use (IRU) agreement with C&W Networks , one of the largest telecommunications service providers in the Pan Caribbean region. As a result of the partnership, C&W Networks will utilize colocation space and dark fiber from Allied Fiber in order to expand its route between Miami and Jacksonville. \nC&W Networks will leverage Allied Fiber's recently completed Southeast Network to meet its customer demands for greater capacity, network diversity and more efficient service offerings. C&W Networks will have long-term use to two of Allied Fiber's express fibers, local fibers in North Miami, Boca Raton, and Jacksonville and its five colocation sites. These local fibers allow Cable & Wireless to connect its ARCOS-1, CFX, and PCCS submarine cables/landing stations in Florida to the Allied Fiber system. This agreement with Allied Fiber, reaffirms C&W Networks' ongoing commitment towards offering higher capacities, greater network resilience and more affordable Internet solutions for customers. \n\"As the demand for reliable, high speed broadband infrastructure and network access increases in every country and continent, the need for additional submarine cables and subsea capacity to connect them naturally increases as well,\" said Hunter Newby, CEO of Allied Fiber. \"By connecting to and through Allied Fiber, C&W Networks is able to efficiently and cost effectively interconnect its own cable landing stations in the United States, providing control over service quality, cost and scalability.\" \n\"Allied Fiber's business model provides new and exciting opportunities for us to expand our footprint and better service our valued customers,\" said Paul Scott, President of C&W Networks. \"We are delighted that this neutral colocation and dark fiber network exists so that we can improve our own network operations and performance to better meet the ever evolving needs of our customers.\" \nThis announcement highlights a key component of the Allied Fiber strategy to provide a neutral colocation and dark fiber thoroughfare for global network operators through the United States, and a significant customer utilizing it for its exact intended purpose. \nFor more information on Allied Fiber, please visit www.alliedfiber.com . For more information on C&W Networks, please visit www.cwnetworks.com , www.cwc.com . \nAbout Allied Fiber Allied Fiber was created as the first national, open access, integrated, network-neutral colocation and dark fiber superstructure in the United States. Allied Fiber offers a combined long haul and multi-access point; short haul fiber optic system coupled with its own colocation facilities to provide control of the underlying physical assets to all network operators. Established in 2008, the Allied Fiber system is designed to link the international subsea cable landing points in the United States while also providing intermediate access along the route for the inclusion of local networks in to the global network architecture. By managing communications infrastructure as a real estate business for network operators the company has developed a unique platform that enables its customers' growth and profitability, which drives its own. Follow Allied Fiber on LinkedIn and Twitter . \nAbout C&W Networks C&W Networks is a wholly owned subsidiary of Cable & Wireless Communications and a wholesale telecommunications service provider that offers broadband, IP capacity and a growing portfolio of managed services and integrated solutions to global, regional and local telecom carriers, TV cable companies, Internet Service Providers and Network Integrators. C&W Networks operates the largest subsea multi-ring fibre-optic network throughout the greater Caribbean, Central American and Andean region along with the most comprehensive fully meshed MPLS network in the region. Reaching 42 countries, the company's fully protected ringed submarine fibre optic network spans more than 48,000km. Cable routes include the Caribbean Optical-ring System (ARCOS-1), Colombia-Florida Express (CFX-1), EC-Link cable system, Fibralink, Maya 1, Eastern Caribbean Fiber Express (ECFS), Taino-Carib, East-West, Cayman-Jamaica Fibre system, Caribbean-Bermuda U.S (CBUS), Americas II, Gemini Bermuda, Pan America (PAN-AM), Antillas 1 and Pacific Caribbean Cable System (PCCS). For more information visit: www.cwnetworks.com . \nAbout C&W Communications Cable & Wireless Communications Plc (CWC) is a full service communications and entertainment provider, operating in the Caribbean and Latin America. With annual sales of over US$2.4 billion, it operates both mobile and fixed networks, supported by submarine and terrestrial optical fibre backhaul capacity. Through the acquisition of Columbus International Inc on 31 March 2015, C&W now delivers superior high-speed mobile data, broadband and TV/video services. It has leading market positions in Mobile, Fixed Line, Broadband and TV consumer offers. \nThrough its business division, C&W provides data centre hosting, domestic and international managed network services, and customised IT service solutions, utilising cloud technology to serve business and government customers. \nThe company also operates a state-of-the-art subsea fibre optic cable network that spans more than 48,000 km - the most extensive in the region - as well as 38,000 km of terrestrial fibre providing wholesale and carrier backhaul capacity and a growing suite of wholesale managed services. \nC&W has more than 7,500 employees serving over 6 million customers (Mobile 3.8m; Fixed Line 1.1m; Video 460k and Broadband 665k) as well as over 125k corporate clients and 225 wholesale customers across 42 countries. The Company's leading brands include: LIME and Flow in the Caribbean; BTC in The Bahamas; Mas Movil in Panama; C&W Business and C&W Networks. C&W is the market leader in most products offered and territories served. It is a major contributor to local communities through its corporate social responsibility programs. \nCable & Wireless Communications' shares are quoted on the London Stock Exchange under the ticker CWC. The company is headquartered in London with its operational hub located in Miami, within close proximity to the Caribbean and Latin America. For more information visit: www.cwc.com . \nContacts: Cable & Wireless Communications Media Grace Silvera +1 786 353 8156 (m); +1 305 570 1640 (o) Claudia Restrepo +1 786 218 0407 (m); +1 305 364 8327 (o) Investors Kunal Patel +44 20 7315 4083 Mike Gittins +44 20 7315 4184", "external_links": [], "published": "2015-10-13T00:30:00.000+03:00", "crawled": "2015-10-13T01:51:00.924+03:00", "highlightTitle": ""}