{"organizations": [], "uuid": "3e730be1b807aebd847bab6421edda926190b2fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144515/mashape-acquires-gelato-io-provide-developer-portals-everyone", "country": "US", "title": "Mashape acquires Gelato.io to provide Developer Portals for everyone", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Mashape acquires Gelato.io to provide Developer Portals for everyone", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T20:44:00.000+03:00", "replies_count": 0, "uuid": "3e730be1b807aebd847bab6421edda926190b2fd"}, "author": "admin", "url": "http://www.freshnews.com/news/1144515/mashape-acquires-gelato-io-provide-developer-portals-everyone", "ord_in_thread": 0, "title": "Mashape acquires Gelato.io to provide Developer Portals for everyone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/22/2015 @ 10:44 AM   Mashape \nSAN FRANCISCO, Oct. 22, 2015 /PRNewswire/ -- Mashape , the company powering the API marketplace and API tools, Galileo for API analytics and Kong, an open-source API Gateway, is pleased to announce the acquisition of Gelato.io , which provides white-label developer portals as a service. \n\"Most existing developer portals are old, based on legacy software, expensive, hard to use and they don't support the modern API development life cycle,\" - said Augusto Marietti, CEO of Mashape. \"Then we found Gelato, the only easy to use and beautifully designed solution with support for Swagger and API-blueprint. Gelato also features auto-generated code samples and a powerful API explorer to test requests live. Devs will find many high level customization options.\" \nGelato enables everyone from small startups to large enterprises to build simple developer portals for both internal and external use cases. The platform facilitates developer on-boarding and integration with the most popular API Gateway, Kong ; as well as makes it easy to provide key provisioning and user management. Also, integration with the Galileo API analytics platform provides easy monitoring and chart generation for both Admins and Developers. \n\"You can go from zero to a full fledged developer portal with docs, code snippets, explorer, guides, support and an on-boarding dashboard for your developers in just a few hours. What used to take months is done in half a day.\" \nGelato is simple to use. While focusing on the DX (Developer Experience) the platform boasts a wide range of powerful features, including: -- Markdown Editor - Developers can write any guide in a markdown format -- Swagger/API-blueprint Import - Generate docs on the fly -- Code Example Generation - Multiple language code snippets -- API Reference & Explorer - Beautifully designed documentation and testing console -- Versioning - Support for multiple versions of your API -- Private/Internal Docs - Keep your API docs private behind access control systems \n\"Gelato combined with Mashape's tools creates a full-service API Tooling suite that is poised to take the industry by storm,\" - said Nik Wakelin, founder of Gelato. \nGelato is the ultimate solution for Dev Evangelists. The platform is easy to use, powerful, and affordable; best of all, with Mashape integration we can now accelerate the development to support more enterprises. \nPricing and Availability Mashape Gelato is available as a SaaS offering as well as an on-premise option. Starting with a free plan for open-source projects, Gelato also offers an Enterprise edition for large scale applications. Try Mashape Gelato today at https://gelato.io \nABOUT MASHAPE \nMashape is transforming how software is created in the digital business era by streamlining the distribution and consumption of data and services through APIs and developer tools such as Kong, Galileo and Mockbin. Mashape Marketplace is the world's biggest API hub, processing billions of API requests for more than 180,000 developers worldwide and managing and distributing 15,000 APIs from startups like Imgur to enterprises such as Best Buy, and thousands of API consumers including Citibank, Hyatt, Accenture, NASA, Target and DHL. Based in San Francisco, Mashape was founded in 2010 and is backed by Jeff Bezos, Eric Schmidt, CRV, NEA, Index Ventures, and Stanford University. To learn more, please visit www.mashape.com . \nABOUT GELATO LTD \nGelato.io is a pioneer in the Software-as-a-Service developer portal market, serving customers all over the world and delivering great documentation for thousands of developers. With seed funding from notable investors and an experienced team, Gelato.io is poised to provide the best developer onboarding, testing and documentation platform bar none. \nContact:", "external_links": [], "published": "2015-10-22T20:44:00.000+03:00", "crawled": "2015-10-22T21:51:52.992+03:00", "highlightTitle": ""}