{"organizations": [], "uuid": "bc29e78fc265a062f48c92707a71feaab5bccecf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/subcat-technology.xml", "section_title": "BusinessWire India.com - Technology", "url": "http://businesswireindia.com/news/news-details/hank-summy-joins-liquidhub-as-partner-vertical-markets-lead/45607", "country": "US", "title": "Hank Summy Joins LiquidHub as Partner, Vertical Markets Lead", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Hank Summy Joins LiquidHub as Partner, Vertical Markets Lead", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T06:30:00.000+03:00", "replies_count": 0, "uuid": "bc29e78fc265a062f48c92707a71feaab5bccecf"}, "author": "", "url": "http://businesswireindia.com/news/news-details/hank-summy-joins-liquidhub-as-partner-vertical-markets-lead/45607", "ord_in_thread": 0, "title": "Hank Summy Joins LiquidHub as Partner, Vertical Markets Lead", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hank Summy Joins LiquidHub"], "text": "Thursday, October 8, 2015 9:00AM IST (3:30AM GMT) Hank Summy Joins LiquidHub as Partner, Vertical Markets Lead LiquidHub Hires Former MRM/McCann and SapientNitro Leader to Continue Aggressive Vertical Market Expansion Hyderabad, India \nLiquidHub, a digital transformation company providing customer engagement and technology solutions to global corporations, announced today that Hank Summy has joined as Partner, Vertical Markets, leading global sales and client services for LiquidHub. Summy has over twenty-five years of experience in leadership roles spanning agency and next generation consulting organizations. He joins LiquidHub having worked most recently at MRM/McCANN as President of North America. Prior to McCANN, Summy was Senior Vice President and Managing Director at SapientNitro for sixteen years, where he focused on creating innovative solutions for the clients he served. At LiquidHub, Summy will be focused on expanding existing customer relationships and establishing new ones across LiquidHub’s vertical industries, with a distinct focus on financial services, insurance, healthcare, life sciences, and retail. “Hank’s joining LiquidHub is a testament to our continued investment in exceptional talent and to our commitment to expanding our customer engagement leadership team. As we continue to establish ourselves as the leading Digital Integrator, Hank’s proven track record in building teams which combine digital agency capabilities with technology will further our capacity for combining great customer experience with innovative technology solutions,” stated Jonathan Brassington, CEO and co-Founder of LiquidHub. “I have been tracking Hank’s career for many years, and his depth of knowledge will be an asset not only to the LiquidHub team, but more importantly to both CMOs and CIOs challenged with creating customers for life.” “What attracted me to LiquidHub was its deep origins in technology combined with exceptional experience design skills. LiquidHub is not only able to design the experience for our clients to create meaningful, engaging relationships with their customers but also is able to implement the technology necessary to bring that design to life. The company is at an exciting inflection point -driving growth and transformation for our customers.” said Summy. Summy will be based in LiquidHub’s Pennsylvania Headquarters. About LiquidHub LiquidHub is a digital integrator that partners with businesses to improve customer engagement and drive growth. With operations in North America, Asia, and Europe, we serve companies globally, helping them solve their most complex challenges through technology innovation. Our customer successes are the result of a culture rooted in thought leadership and delivery excellence. For more information about LiquidHub, please visit www.liquidhub.com . For News Release background on LiquidHub click here Suzanne Lentz, LiquidHub, 215.603.0489 , slentz@liquidhub.com ‘PD’ Prabhanjan Deshpande, LiquidHub, +91-9886790109, PD@liquidhub.com", "external_links": [], "published": "2015-10-08T06:30:00.000+03:00", "crawled": "2015-10-08T17:02:33.936+03:00", "highlightTitle": ""}