{"organizations": ["FAA"], "uuid": "ee24de6ace74199cb2ccf76acb5af96c9f63ca5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "fcw.com", "main_image": "", "site_section": "http://fcw.com/rss-feeds/all.aspx", "section_title": "FCW: The business of federal technology", "url": "https://fcw.com/articles/2015/10/19/faa-drones-rules-rockwell.aspx", "country": "US", "title": "FAA aims to have drone registration in place by Christmas", "performance_score": 0, "site": "fcw.com", "participants_count": 0, "title_full": "FAA aims to have drone registration in place by Christmas", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T22:45:00.000+03:00", "replies_count": 0, "uuid": "ee24de6ace74199cb2ccf76acb5af96c9f63ca5c"}, "author": "", "url": "https://fcw.com/articles/2015/10/19/faa-drones-rules-rockwell.aspx", "ord_in_thread": 0, "title": "FAA aims to have drone registration in place by Christmas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Rockwell"], "text": "FAA aims to have drone registration in place by Christmas By Mark Rockwell Oct 19, 2015 \nClose encounters between drones and commercial aircraft are becoming more and more frequent, and the federal government is planning new rules to keep planes safe. \nThe Department of Transportation and Federal Aviation Administration aim to have a web-based registration portal for privately owned unmanned aerial vehicles up and running before Christmas, said Transportation Secretary Anthony Foxx. \nThe portal is part of a wider drone regulation plan, including registration process for unmanned aerial vehicle systems. A task force of public officials and private stakeholders has been formed to deliver policy recommendations on drone issues, with a report due out by Nov. 20. \nThe effort is separate from the FAA's current work to integrate drones into national airspace. Commercial drones already must be registered with the FAA, and the agency has issued thousands of permits for those aircraft. \nFoxx and FAA Administrator Michael Huerta unveiled the plan at an Oct. 19 event, which included trade groups and associations representing such stakeholders as drone manufacturers, commercial pilots, airport administrators and model plane hobbyists. \nRegistration would apply retroactively to all privately purchased drones, not just new purchases. \nThe intent is \"to send a signal that this is serious,\" Foxx said in a news conference. \"This isn't driving your ATV on your property,\" Foxx said, adding that there could be penalties for those not registering their aircraft. \nIncreases in pilot sightings of drones \"signal a troubling trend,\" Huerta said in an accompanying statement. \"Registration will help make sure that operators know the rules and remain accountable to the public for flying their unmanned aircraft responsibly. When they don't fly safely, they'll know there will be consequences.\" \nThe aim of the registration is to trace drone ownership in the event pilotless aircraft are seen violating flight rules in restricted areas or operating in an unsafe manner. Exactly what information the web portal will collect from private drone owners is part of what the task force will explore, said Foxx. \nThe group will also advise DOT officials on what aircraft should be exempt from registration because of low safety risk, including toys and certain other small UAS. The task force also will explore options for a streamlined system that would make registration less burdensome for commercial UAS operators. \nDespite buy-in from many key stakeholders, there are concerns ahead for the task force. \n\"Any new regulation that the task force advises for drones also will have long-term implications for free speech, privacy, and the commercial development and deployment of this nascent technology,\" said Daniel Castro, vice president at the Information Technology and Innovation Foundation. \n\"A new system to register each private drone would be unprecedented in size and scope,\" he said, \"especially given the millions already in circulation. So regulators should not create new rules hastily.\" About the Author \nMark Rockwell is a staff writer covering acquisition, procurement and homeland security. Contact him at mrockwell@fcw.com or follow him on Twitter at @MRockwell4 . <>", "external_links": [], "published": "2015-10-19T22:45:00.000+03:00", "crawled": "2015-10-20T17:52:42.811+03:00", "highlightTitle": ""}