{"organizations": [], "uuid": "fb3093192acf4c52208e0a0a5d67fe4cfa0c987c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/tmpl/v5/img/phys_308px.png", "site_section": "http://phys.org/xml-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-climate-benefit-northern-lizards.html", "country": "US", "title": "Climate change could benefit northern lizards", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Climate change could benefit northern lizards", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "fb3093192acf4c52208e0a0a5d67fe4cfa0c987c"}, "author": "", "url": "http://phys.org/news/2015-10-climate-benefit-northern-lizards.html", "ord_in_thread": 0, "title": "Climate change could benefit northern lizards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Climate change could benefit northern lizards October 7, 2015 \nHigher temperatures result in Swedish sand lizards laying their eggs earlier, which leads to better fitness and survival in their offspring, according to research published in the open access journal BMC Evolutionary Biology . \nThe findings indicate that climate change could have positive effects on this population of high-latitude lizard, but the authors warn that climate change is likely to affect a whole suite of traits, in addition to egg-laying date, which together would have an unknown combined effect on survival and reproductive success. \nThe global climate is changing more rapidly than ever before, with large effects on ecosystems, species and populations worldwide. Some species are able to adjust to these changes by adapting or dispersing to new locations, while others have been removed from their fitness peaks and have decreased in numbers. One of the most frequently reported responses to recent climate change are shifts in timing of lifecycle events, such as emergence from hibernation, migration and breeding (including egg-laying). \nLead author Gabriella Ljungstrom from the University of Gothenburg, Sweden, said: \"Shifts in the timing of lifecycle events in response to climate change is widespread, but the crucial question is how this affects an animal or plant's fitness. Are these shifts adaptive and will thus help the population to persist under climate change, or not? \n\"For this high-latitude population, our results contrast global projections of extinction risk for lizards as a result of climate change. This highlights the importance of taking spatial differences into account when predicting future effects of climate change on species and populations.\" \nLizards rely on external sources of heat to regulate their body temperature, meaning that ambient temperature has a strong influence on many of their basic physiological functions, as well as on their timing of lifecycle events. \nAs tropical lizard species currently live in climates very close to their optimal body temperatures, their fitness is predicted to decrease with increasing temperature. In contrast, at high latitudes, warming could bring individuals closer to their optimum temperature and thereby even enhance fitness. \nThe researchers analysed records of over 350 female Swedish sand lizards ( Lacerta agilis ) over 15 years, and looked at the effects of local temperature on egg-laying date. \nEarlier egg-laying is strongly linked to reproductive success in this species and, through its relationship with hatching date, is also connected to offspring fitness and survival in reptiles at large. Shifts in this trait may therefore have potentially large effects on population survival. \nThe results showed that female sand lizards laid eggs earlier in relatively warmer years. This means that the females respond adaptively to fairly rapid annual changes in ambient temperature, and indicates that climate warming may have some positive fitness effects in this high-latitude lizard, at least in the short term. \nThe authors say that having such a long-term dataset of a wild population is rare, especially for a reptile, and is important for understanding how individuals, populations and species respond in nature today, and are likely to respond in the future. Climate change may have little impact on tropical lizards May 17, 2013 \nA new Dartmouth College study finds human-caused climate change may have little impact on many species of tropical lizards, contradicting a host of recent studies that predict their widespread extinction in a rapidly warming ... Bloom or bust as new study reveals the plants most likely to survive climate change November 19, 2013 \nNew research into the effect of climate change on plants has revealed which individuals within a species are most likely to thrive under warmer conditions and which are at risk. And it seems that plants that flower earlier ... The quick and the dead among tropical reptiles: Study suggests some faster lizards can survive climate change September 15, 2014 \nSome tropical reptiles may be able to adapt quickly to climate change rather than go extinct as widely expected, a Dartmouth-led study finds. Global warming lethal to baby lizards: Nests become heat traps August 18, 2015 \nThe expected impact of climate change on North American lizards is much worse than first thought. A team of biologists led by Arizona State University investigators has discovered that lizard embryos die when subjected to ... Climate to cause lesser of two weevils, study says September 2, 2015 \nRising temperatures may shift the gender balance of Mediterranean weevils in favour of females, said a study Wednesday into a bizarre consequence of global warming. High-arctic butterflies shrink with rising temperatures October 6, 2015 \nNew research shows that butterflies in Greenland have become smaller in response to increasing temperatures due to climate change. Recommended for you Research points to possible fungal control for leaf-cutter ants October 7, 2015 \nA 15-year study of leaf-cutter ants and their relatives across North and South America found that their nests are susceptible to infection by a diverse group of specialized fungal parasites. The discovery by biologists from ... A village of bacteria to help frogs fight disease October 7, 2015 \nThe naturally occurring bacteria on a frog's skin could be the most important tool for helping the animal fight off a deadly skin disease, according to an experiment conducted by Virginia Tech researchers. Young male chimpanzees play more with objects, but do not become better tool users October 7, 2015 \nNew research shows a difference between the sexes in immature chimpanzees when it comes to preparing for adulthood by practising object manipulation—considered 'preparation' for tool use in later life. How to manipulate the brain to control maternal behavior in females and reduce aggression in males October 7, 2015 \nMost female mammals give birth and care for their offspring, while the males often breed with multiple partners and play little role in parenting once the mating is over. Yet researchers have had a hard time pinpointing where, ... Rock-wallaby interbreeding causes rethink on evolution October 7, 2015 \nScientists have discovered that rock-wallabies living in north east Queensland are sharing genetic material despite belonging to six different species. Research reveals new clues about how humans become tool users October 7, 2015 \nNew research from the University of Georgia department of psychology gives researchers a unique glimpse at how humans develop an ability to use tools in childhood while nonhuman primates—such as capuchin monkeys and chimpanzees—remain ...", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T03:08:59.412+03:00", "highlightTitle": ""}