{"organizations": ["Swisscom"], "uuid": "a47737767865a114bb57e0d238c886fcb96a91e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tmcnet.com", "main_image": "", "site_section": "http://rss.tmcnet.com/rss/information%20technology", "section_title": "TMCnet.com RSS Service: information technology", "url": "http://www.tmcnet.com/usubmit/2015/10/15/8262033.htm", "country": "US", "title": "Axiros Orchestrates ACS Upgrade to Manage Enterprise VoIP for Swisscom", "performance_score": 0, "site": "tmcnet.com", "participants_count": 0, "title_full": "Axiros Orchestrates ACS Upgrade to Manage Enterprise VoIP for Swisscom", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:34:00.000+03:00", "replies_count": 0, "uuid": "a47737767865a114bb57e0d238c886fcb96a91e3"}, "author": "", "url": "http://www.tmcnet.com/usubmit/2015/10/15/8262033.htm", "ord_in_thread": 0, "title": "Axiros Orchestrates ACS Upgrade to Manage Enterprise VoIP for Swisscom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[October 15, 2015] Axiros Orchestrates ACS Upgrade to Manage Enterprise VoIP for Swisscom \nMUNICH , Oct. 15, 2015 /PRNewswire/ -- Axiros, the technology leader in universal device management, TR-069, and IoT solutions for service providers, enterprises, and OEMs, today announced the successful implementation of Axiros AXESS.ACS device management and provisioning server, orchestrating Swisscom's VoIP services for enterprise and business customers. \nAXESS provides Swisscom \"zero-touch\" auto configuration and general management of VoIP end devices and also a deeply integrated business VoIP back office infrastructure, including: Edge and Core SBCs Billing Systems Other VoIP-related Carrier Equipment \nWith the support of both direct CPE management and back office provisioning on one single platform, Axiros AXESS allows Swisscom to set up and run deeply integrated and (on AXESS' northbound side) highly abstracted service delivery and management flows in an ultra flexible and scalable, yet reliable, fashion with a large number of devices. By not having to travel to the customer, this fully automated solution is a huge time and cost advantage and increases end customer satisfaction. Things like initialization, reconfiguration, firmware downloads and general real-time subscriber support can all be done remotely through a self-service portal. \nThe complexity of the Swisscom integration was very high. Thre were more than ten systems including the VoIP application systems e.g. Broadworks, Swisscom's enterprise service bus system (TIBCO), that the server needed to connect to once configured. Also, the service provisioning of Swisscom's northbound system was required before implementation of ID management. Because Swisscom required a high level of flexibility with extremely large workflows, including the need to manage surrounding systems, synchronize services and devices and be flexible to changing customer needs, Axiros brought in a team early on and partnered with the operator from day one. \n\"We worked with Swisscom to ensure the project was well orchestrated, as there were a lot of moving parts and areas that Swisscom needed additional counsel in order to guarantee success,\" commented Kurt Peterhans , CEO of Axiros. \"With Axiros' high-flexibility and our open technology – meaning that we support any device vendor – plus our automation of complexity, enabling support team management and monitoring of this environment, Swisscom was able to bring AXESS.ACS in to meet their needs across their entire VoIP network.\" \nSwisscom had a number of manufacturers' devices – MITEL, Panasonic, Cisco, Media5 – which needed different protocols – from TR-069 to CONFIG file to WSMA – to consider. \nIn the future it will be very easy for Swisscom to integrate and manage new device types. With the self-service portal the customer has the possibility to configure the device via the Web and see the changes instantly on the device. In addition to the VoIP handset telephones, Swisscom is also supporting multi-user device session board controllers (SBCs). \nFor more information about AXESS.ACS , device management or provisioning, please visit the Axiros website . \nAbout Axiros The Axiros Advantage: Any protocol, any thing, any service – at any time. As a recognized leader in TR-069 and device management, Axiros has successfully transitioned into the Internet of Things, and was recently awarded as a Gartner Cool Vendor in IoT for 2015. Axiros now also provides software solutions and platforms to service providers and equipment manufacturers worldwide to manage and IoT-ize devices. By offering open, scalable, flexible, and modular device and service management solutions for fixed and mobile networks, Axiros has seen adoption by nearly 200 of the world's telecom service providers and operators and an increasing number of OEMs. Axiros manages the bridge between information technology and operations technology, allowing for complete IT/OT integration. Distinguished by domain expertise and innovation , coupled with best-in-class software design, Axiros uniquely delivers the robust management capabilities and solutions its customers need today and in the future as the demand and complexity associated with new services grows. \nFounded in 2002, Axiros has sales and service offices located in Aarau, Boston , Lisbon , Milan , Sao Paolo, Singapore and development centers in Germany and Russia – so as needs change, Axiros will always be close by to deliver. http://www.axiros.com @axiros1", "external_links": [], "published": "2015-10-15T17:34:00.000+03:00", "crawled": "2015-10-16T08:22:35.335+03:00", "highlightTitle": ""}