{"organizations": ["CSV", "Inc"], "uuid": "2d994b2abf687298e11a538a73298d62ccb715b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/tableau-launches-vizable-breakthrough-mobile-app-data-exploration.xhtml", "country": "US", "title": "Tableau Launches Vizable, A Breakthrough Mobile App for Data Exploration", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "Tableau Launches Vizable, A Breakthrough Mobile App for Data Exploration", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:42:00.000+03:00", "replies_count": 0, "uuid": "2d994b2abf687298e11a538a73298d62ccb715b8"}, "author": "", "url": "http://science-technology.news-articles.net/content/tableau-launches-vizable-breakthrough-mobile-app-data-exploration.xhtml", "ord_in_thread": 0, "title": "Tableau Launches Vizable, A Breakthrough Mobile App for Data Exploration", "locations": ["Las Vegas", "SEATTLE", "Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dave Story", "Roz Edison", "Vizable"], "text": "Tableau Launches Vizable, A Breakthrough Mobile App for Data Exploration   Tableau Launches Vizable, A Breakthrough Mobile App for Data Exploration -- SEATTLE, Oct. 20,   Vizable, an entirely new application from Tableau Vizable, an entirely new application from Tableau <-  ><- stripped tags -> SEATTLE , Oct. 20,   Tableau Software (NYSE: [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QU2RvZEhSd09pOHZjM1IxWkdsdkxUVXVabWx1WVc1amFXRnNZMjl1ZEdWdWRDNWpiMjB2Y0hKdVpYZHpQMUJoWjJVOVVYVnZkR1VtVkdsamEyVnlQVVJCVkVFbklISmxiRDBuYm05bWIyeHNiM2NuSUhSaGNtZGxkRDBuWDJKc1lXNXJKeUIwYVhSc1pUMG5SRUZVUVNjZ2IyNWpiR2xqYXowbmJHbHVhMDl1UTJ4cFkyc29kR2hwY3lrbklISmxiRDBuYm05bWIyeHNiM2NuUGtSQlZFRThMMkUrfA==]]) today announced Vizable, an entirely new mobile application designed to help people see and understand data with just an iPad. Tableau Vice President of Mobile and Strategic Growth, Dave Story , unveiled the app at the 2015 Tableau Conference in Las Vegas . With Vizable, Tableau brings fun and approachable data analysis to even more people. The free iPad app makes it possible to explore data by using gestures such as pinching, swiping and dragging, allowing people to sculpt data into visualizations in seconds. Tableau has already put Vizable in the hands of a number of businesses and organizations who previously had data and questions, but no easy tool to answer those questions. They now find insights to drive and improve their business, even while they're on the go. \"We started with a food truck, so the very nature of our business is mobile,\" said Roz Edison , owner of Marination, a Hawaiian-Korean fusion cuisine business with one food truck and three restaurants in Seattle . \"Since we've started using Vizable, if someone asks me how Marination is doing this week, I can pull out my iPad, start swiping and dragging my cash register data, and boom! It's that easy.\" \"There is no great app to see and understand a spreadsheet visually, using only a tablet,\" said Story. \"This is an incredibly common scenario. Whether you're a teacher with students' test data, a small business with the day's sales, a cyclist with ride stats, or an executive with the past hour's web site traffic - Vizable brings analytics to more people by engaging them with their data like never before.\" Vizable is ideal for people with personal or business data they want to analyze. The first version works with data in CSV files and Excel (xls or xlsx) files. Visualizations created in Vizable can be shared with friends and colleagues through email, instant message, or social media. Vizable is currently available worldwide in the Apple iTunes store in English. It supports data in many international formats today, and will be translated to other languages in the future. Learn more about the app at vizable.tableau.com. About Tableau Tableau Software (NYSE: DATA ) helps people see and understand data. Tableau helps anyone quickly analyze, visualize and share information. More than 32,000 customer accounts get rapid results with Tableau in the office and on-the-go. And tens of thousands of people use Tableau Public to share data in their blogs and websites. See how Tableau can help you by downloading the free trial at www.tableausoftware.com/trial . Tableau and Tableau Software are trademarks of Tableau Software, Inc. All other company and product names may be trademarks of the respective companies with which they are associated.", "external_links": [], "published": "2015-10-20T19:42:00.000+03:00", "crawled": "2015-10-20T19:27:05.886+03:00", "highlightTitle": ""}