{"organizations": [], "uuid": "f1ba53fce758c869b22377522ee82d204099b9c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Comm_Tech_Technologies.xml", "section_title": "MENAFN.com Comm_Tech_Technologies", "url": "http://www.menafn.com/1094395631/Middle-East-Connected-Sports-Can-Win-in-the-Digital-Economy&src=RSS", "country": "", "title": "Middle East Connected Sports Can Win in the Digital Economy", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Middle East Connected Sports Can Win in the Digital Economy | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "f1ba53fce758c869b22377522ee82d204099b9c2"}, "author": "Press", "url": "http://www.menafn.com/1094395631/Middle-East-Connected-Sports-Can-Win-in-the-Digital-Economy&src=RSS", "ord_in_thread": 0, "title": "Middle East Connected Sports Can Win in the Digital Economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Worldwide Big-Data Market Predicted to Grow Six Times Faster Than General IT SAP HANA Platform Running on Intel Provides Real-Time Analytics for Transforming Player Fan Media and Venue Experience \nDUBAI United Arab Emirates – 21 October 2015 — Connected sports will be the pioneering vertical for Middle East digital transformation as big-data solutions can transform the player fan media and venue experience industry heavyweights SAP and Intel have announced at GITEX Technology Week 2015. \nIn the Internet of Things (IoT) era Middle East players coaches and venue operators face new challenges in using advanced technology to improve team performance provide new insights for fans and media and maximize revenue sources. \nUsing insights that analyze data from sensors on players and throughout stadiums combined with location-based data from mobile devices the sports and entertainment industry can simplify operations and enhance player performance fan loyalty and marketing and merchandising to fans and advertisers. \nDemonstrating the potential for big data in the digital economy the global big-data market is predicted to grow at six times the rate of the general IT market by 2018 reaching USD 41.5 billion in 2018 according to IDC[1]. \nOne sports pioneer using big data is the German National Football Team which has used SAP solutions to analyze player and team performance since its championship run in the 2014 FIFA World Cup Brazil. \n“The Middle East has a strong sports culture with a roster of international events coming up” said Oliver Bierhoff general manager of the German National Football Team and SAP Brand Ambassador. “Thanks to a strong technology infrastructure and visionary leaders who are embracing innovation and early adoption big data has the potential to completely transform the fan experience at sporting events across the region. \n“Big data served as the twelfth man on the pitch during our World Cup championship run last year” added Bierhoff. “Now these innovations are available to the Middle East’s sports industry to transform the experiences for players fans coaches and the media.” \nSAP is committed to co-innovating with its partners to deliver the latest solutions that can help the Middle East’s sporting world to simplify their operations enhance the fan experience and exchange best practices across additional industry verticals. \n“Football matches and training sessions can produce a huge amount of data. For example in a 10-minute football practice session 10 players with three balls can produce over 7 million data points” explained Jonathan Becher chief digital officer and head of SAP Digital. \n“As the Middle East ups its sporting game mega-events such as 2022 FIFA World Cup Qatar Abu Dhabi Formula 1 Grand Prix and the Dubai World Cup can demonstrate the latest big-data and digital innovations on the global stage” added Becher. \nDemonstrating the demand for cloud-based analysis of big data in sports the SAP Sports One solution has been adopted across the sports world including FC Bayern Munich and the Allianz Arena in Munich Germany; the National Hockey League (NHL); and the Czech national ice hockey team. \nAdditional sporting organizations using SAP analytics solutions have included the ICC Cricket World Cup 2015 organizing committee the National Basketball Association (NBA) the international Extreme Sailing Series and CHIO Aachen a popular equestrian festival held in Germany. \nSupporting big-data innovation in the region SAP and Intel have teamed up on the Middle East and North Africa debut of the global Run Simple Tour at GITEX Technology Week 2015. \n“With Middle East organizations facing a deluge of different types of data from IT systems and applications managing the complexity consumes resources prevents innovations and puts business at risk” said Taha Khalifa General Manager - Middle East and North Africa Intel. \n“Intel and SAP worked closely together during the development of SAP HANA and as a result the Intel Xeon processor E7 family is the reference architecture design platform for SAP HANA. With the availability of the Intel Xeon processor E7 v3 family released earlier this year SAP HANA deployments now deliver superior performance with larger memory capacity and an enhanced range of RAS features to help businesses gain real-time insights for better decision making improved operational efficiency and a greater competitive edge” added Taha Khalifa. \nInside the Run Simple Truck at the Dubai World Trade Centre attendees can experience more than 40 real-life big-data demos running on the real-time SAP HANA platform the SAP Business Suite 4 SAP HANA (SAP S/4HANA) and Intel Xeon processor E7 family. \nSAP will exhibit at GITEX Technology week 2015 under the theme of “Run Simple.” More than 16 of SAP’s partners will also showcase their co-innovation products and solutions at the SAP booth located in Hall 6 MAC 6-15. \n\n\nAbout Dubai PR Network", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-24T03:29:13.564+03:00", "highlightTitle": ""}