{"organizations": [], "uuid": "42ed6f0f5c852a0d9f4100f3a9e6b3c6e846d022", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.govtech.com", "main_image": "http://media2.govtech.com/images/Twitter-Poll.JPG", "site_section": "http://www.govtech.com//rss/app_rss", "section_title": "Government Technology", "url": "http://www.govtech.com/social/Twitters-New-Polling-Feature-Just-Fun-and-Games-or-Valuable-Tool-for-Government.html", "country": "US", "title": "Twitter’s New Polling Feature: Just Fun and Games, or Valuable Tool for Government?", "performance_score": 0, "site": "govtech.com", "participants_count": 1, "title_full": "Twitter’s New Polling Feature: Just Fun and Games, or Valuable Tool for Government?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T19:45:00.000+03:00", "replies_count": 0, "uuid": "42ed6f0f5c852a0d9f4100f3a9e6b3c6e846d022"}, "author": "Eyragon Eidam", "url": "http://www.govtech.com/social/Twitters-New-Polling-Feature-Just-Fun-and-Games-or-Valuable-Tool-for-Government.html", "ord_in_thread": 0, "title": "Twitter’s New Polling Feature: Just Fun and Games, or Valuable Tool for Government?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Center for Digital Government Center for Digital Education Digital Communities Future Structure Public CIO Social Innovation Nation Twitter’s New Polling Feature: Just Fun and Games, or Valuable Tool for Government? Twitter’s newly announced polling feature looks like a lot of fun for its throngs of avid users, but could it also bring value to savvy organizations looking for instant feedback from the public? by Eyragon Eidam / October 23, 2015 Twitter \nOver the course of the next few days, millions of tweeters will be given the option to create and respond to public polls in a few short steps. \nThe wildly popular social network announced its plans to roll out the feature in a blog post Wednesday and said the anonymized voting system would allow users to weigh in on the topics that matter most to them. \nWhile we are sure to see a fair amount of pop culture-centric polls as a result of the new function, we are also likely to see governments putting it to work as a means of directly connecting with their citizens. RELATED Should Governments Trademark Twitter Hashtags? \nIn Austin, Texas, a city well-known for its abundant use of networking sites, news of the polling feature hadn’t yet made its way to city spokesperson Alicia Dean. \nThough Dean was not aware of the details of the most recent Twitter feature, she said it could end up as part of the city’s larger social media program if it proves to offer a real value to the city’s more than 60,000 followers. \n“Our whole thing here is shortening the distance between our citizens and their government, and access to city services,” she said. “We’re always looking for new tools and techniques that can actually help us shorten that distance. Twitter is something that is very popular for us, so we’re always interested in looking at new features they are rolling out and seeing if it’s a fit for us.” \nThe growing technology scene — and the presence of Google Fiber — makes Austin an ideal proving ground for many new facets of widely used networking platforms. But at the end of the day, the new features have to show they are bringing something to the table before the city will buy in. \n“The thing that is important for us is that we recognize that once you start something, you have to be able to manage it effectively. You can’t start a conversation and then not be there,” Dean said. “For us, because we do so much with social media, we want to be sure that if we were to use that particular feature, that we were able to keep our level of engagement either the same or improve it.” \nAccording to the spokesperson, the city actively gathers input from residents through a variety of other sources. \nFrom the perspective of the Center for Technology in Government at the University at Albany in New York state, Twitter’s latest addition is a mixed bag when it comes to exactly what it will offer government agencies. \nProgram Director Meghan Cook said the ability to create a poll about pressing issues within the public sector will mean another way to ask the public for input, but she warned that input may not be totally valid when it comes to translating that information into policy decisions. \n“I think it will go along the lines of what Twitter already does — it gathers feedback from those who subscribed to be a follower of an agency,” Cook said. “So the population is confined to those who are already paying attention to that agency and what they’re doing. It’s the same population, just another channel, a faster channel to assess a very quick question.” \nAs to whether the ability to quickly poll citizens will be an immediately valuable tool for agencies, Cook is not completely convinced. She advocates that agencies compare results against all of the input they are receiving for a more global view of each issue. \n“When an agency is already invested in using Twitter, they’re understanding the cross-section of people that they’re getting information from,\" she said. \"I don’t see it as a risk, but I don’t see it as a benefit yet either, because it allows less information from the citizens and provides more of an aggregate, which no one has really determined is representative.” Eyragon Eidam | Staff Writer \nEyragon Eidam is a staff writer for Government Technology magazine. He lives in Sacramento, Calif., with his wife and three dogs. He can be reached at eeidam@erepublic.com . RELATED STORIES", "external_links": [], "published": "2015-10-23T19:45:00.000+03:00", "crawled": "2015-10-24T00:48:36.857+03:00", "highlightTitle": ""}