{"organizations": [], "uuid": "22eefef01569bccf02a6380fcd2ca930bc810d7c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/t/m/d/b/image.related.articleLeadwide.620x349.gk9h4i.png/1444869184252.jpg", "site_section": "http://www.canberratimes.com.au/technology", "section_title": "Technology | Tech News, Reviews &amp; Updates", "url": "http://www.canberratimes.com.au/digital-life/smartphone-apps/facebook-app-is-draining-iphone-batteries-say-users-20151014-gk9h4i.html", "country": "AU", "title": "Facebook app is draining iPhone batteries, say users", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Facebook app is draining iPhone batteries, say users", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T08:33:00.000+03:00", "replies_count": 0, "uuid": "22eefef01569bccf02a6380fcd2ca930bc810d7c"}, "author": "", "url": "http://www.canberratimes.com.au/digital-life/smartphone-apps/facebook-app-is-draining-iphone-batteries-say-users-20151014-gk9h4i.html", "ord_in_thread": 0, "title": "Facebook app is draining iPhone batteries, say users", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook is chewing up battery power on iPhones and people aren't happy. Photo: Bloomberg\nHaving your smartphone run out of juice is definitely one of the more annoying first-world problems out there.\nBut you may be surprised to know that Facebook, along with its separate Messenger app, is chewing through big chunks of your iPhone's battery life ... even while you're sleeping.\nTech entrepreneur Matt Gilligan first brought the issue to the public's eye in a post on Medium , saying Facebook was draining more battery life than any other app on his new iPhone 6s thanks to extraneous \"background activity\" — a total of 15 per cent over a week's use.\nA radio app should register a big amount of background audio activity, but what's Facebook's excuse? Photo: Hannah Francis\nThis was despite having turned off the \"background app refresh\" option in the phone's settings.\nAdvertisement \"That extraneous background usage, despite not providing any value to me at all, is keeping the app alive 2x longer than my actual usage,\" Gilligan wrote.\nThe result is that Facebook can end up eating more battery power than an app which you spend much more active screen time on.\nFacebook chews up more battery power than an app with more active screen use, thanks to mysterious background activity. Photo: Hannah Francis\nOne Reddit user said they had used the Facebook app for 40 minutes, but clocked up background activity worth more than two hours, \"costing me almost a 20 per cent hit to the battery\", despite location services and background app refresh being switched off.\nWe checked this out on a brand new iPhone 6s and found that Messenger also clocked up inexplicable amounts of \"background activity\" proportionate to the actual screen time spent on the app.\nOn another iPhone 6s Plus we found that while Facebook had been used for 21 minutes, it had clocked up 57 minutes of background activity, costing 10 per cent of battery life.\nFacebook on another iPhone, using 57 minutes in the background. Photo: Ben Grubb\nThere are various theories as to what exactly the \"background activity\" is.\nSome have suggested it is because Facebook is \"abusing\" a VoIP (voice over internet protocol) background audio loophole .\nApple news blog MacStories suggests the problem lies in autoplay videos somehow \"hijacking\" background audio to continue activity even when the app is not actively being used. It suggests turning off autoplay as a way to save data consumption.\niOS does display audio-only phone usage as background activity in an iPhone's battery settings. For instance, my ABC Radio app showed 1 minute of screen time as I switched the radio on, and 30 minutes of background activity while I was listening to the radio.\nOthers have suggested push notifications are draining power, but that's doubtful. I don't use push notifications and Facebook still registers more background activity than it does screen time.\nMore sinister suggestions include that Facebook may be listening to its users via their phone's microphone , although Facebook has previously denied its microphone function is \"always listening\", saying it asks for permission before switching on.\nWhile critics have slammed Facebook for failing to address the issue — one tech blogger called it \" user-hostile \" — it's unclear whether Facebook is doing this intentionally and if so, what the reason behind it is.\nWe've contacted Facebook and Apple for comment and will keep you updated as soon as we hear more.", "external_links": ["http://newsroom.fb.com/news/2014/05/a-new-optional-way-to-share-and-discover-music-tv-and-movies/", "https://www.reddit.com/r/iphone/comments/3kvfta/how_is_facebook_doing_so_much_background_activity/", "https://www.macstories.net/linked/the-background-data-and-battery-usage-of-facebooks-ios-app/", "http://www.theguardian.com/technology/2014/jun/04/facebook-audio-identification-function-listening", "http://pxlnv.com/linklog/facebook-background-data/", "http://medium.com/@mg/battery-life-load-times-and-actually-giving-a-shit-about-your-customers-c3738386bded", "https://twitter.com/marcoarment/status/651098938645217280"], "published": "2015-10-15T08:33:00.000+03:00", "crawled": "2015-10-15T17:18:00.322+03:00", "highlightTitle": ""}