{"organizations": [], "uuid": "ce0b1de4383b0ede3efdaa600ceb02a58fc00141", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1145391/b-communications-announced-that-bezeq-received-approval-outline-plan-use-70-dunams-app", "country": "US", "title": "B Communications Announced That Bezeq Received an Approval for an \"Outline Plan\" for the Use of a 70 Dunams (Approximately 18 Acres) Parcel of Land Owned by Bezeq", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "B Communications Announced That Bezeq Received an Approval for an \"Outline Plan\" for the Use of a 70 Dunams (Approximately 18 Acres) Parcel of Land Owned by Bezeq", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T17:59:00.000+02:00", "replies_count": 0, "uuid": "ce0b1de4383b0ede3efdaa600ceb02a58fc00141"}, "author": "admin", "url": "http://www.freshnews.com/news/1145391/b-communications-announced-that-bezeq-received-approval-outline-plan-use-70-dunams-app", "ord_in_thread": 0, "title": "B Communications Announced That Bezeq Received an Approval for an \"Outline Plan\" for the Use of a 70 Dunams (Approximately 18 Acres) Parcel of Land Owned by Bezeq", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Companies mentioned in this article: B Communications Ltd. \nRAMAT-GAN, Israel -- (BUSINESS WIRE) -- B Communications Ltd. (Nasdaq and TASE: BCOM ) (“ B Communications ”) announced today that Bezeq - The Israel Telecommunication Corp. Ltd. (\" Bezeq \"), a controlled subsidiary of B Communications, received an approval from the \"Local Committee for Planning and Construction\" for an \"outline plan\" for the use of a 70 dunams (approximately 18 acres) parcel of land owned by Bezeq which is designated for use as offices and storage building purposes in \"Sakiya\", which is adjacent to the “Mesubim\" Junction. \nBezeq is examining the implications of the approval and the various possibilities which Bezeq may have in order to fully realize the value of the property, including selling the property or portions of it. \nBezeq is also examining the accounting implications that may arise from the determination of the property’s status and any disposition or future action with respect to it. A possible implication, which according to a very preliminary estimation and before professional examination, is that Bezeq may record a very significant accounting profit. \nDoron Turgeman, B Communications' CEO stated : \"During the last few years Bezeq is acting intensively in order to upgrade its property portfolio and, in a very careful and qualitative manner, is disposing non-essential properties. We are pleased with the Committee's approval, and we are certain that Bezeq's management will make the right decision with respect to this opportunity.\" \nAbout B Communications Ltd. \nB Communications is a holding company with a controlling interest in Israel’s largest telecommunications provider, Bezeq, The Israel Telecommunication Corp. (TASE: BEZQ). B Communications shares are traded on NASDAQ and the TASE under the symbol “BCOM.” For more information please visit the following Internet sites:", "external_links": [], "published": "2015-10-26T17:59:00.000+02:00", "crawled": "2015-10-26T19:41:42.728+02:00", "highlightTitle": ""}