{"organizations": [], "uuid": "f68fd9f4f9d48154f2852da6afe6a8645a99ac43", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/13/13021128/Senet-logo-with-tag-RGB JPEG Sm.jpg", "site_section": "http://www.prweb.com/rss2/electronics.xml", "section_title": "Technology: Electronics", "url": "http://www.prweb.com/releases/2015/10/prweb13021128.htm", "country": "US", "title": "Senet Continues its Commitment to IoT Innovator Support Adding Northeast Innovation District for the Boston Area.", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Senet Continues its Commitment to IoT Innovator Support Adding the Northeast Innovation District for the Boston Area.", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "f68fd9f4f9d48154f2852da6afe6a8645a99ac43"}, "author": "Paula Allen", "url": "http://www.prweb.com/releases/2015/10/prweb13021128.htm", "ord_in_thread": 0, "title": "Senet Continues its Commitment to IoT Innovator Support Adding Northeast Innovation District for the Boston Area.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Senet announced today that it continues to expand its national public IoT network with the addition of over 2,000 square miles of coverage in the Boston metropolitan and suburban areas. The expanded network coverage not only services existing and future Senet Network clients, the expanded coverage offers IoT innovators and developers in the Boston area access to Senet’s LoRaTM-based Low Power Wide Area Network (LPWAN). As the first and only public LoRaTM network provider in the US, Senet’s Network as a Service offering is critically important to IoT solution providers as they develop and prove their innovative offerings and bring them to market.\nDEVELOPER’S WORKSHOP\nNovember 2, 2015 Waltham, MA\nTo further support IoT innovators and developers in the Boston area, Senet in partnership with Microchip and Semtech is sponsoring a one-day Developer’s Workshop in Waltham, MA on November 2nd for companies interested in developing and connecting IoT solutions to the Senet LoRaTM network. Workshop participants will receive a development kit and be given complimentary access to the Senet public network to develop and test their IoT applications.\nTo Register for the Developer’s Workshop visit http://www.senetco.com/events or click here\nGeorge Dannecker, CEO said, “Our network expansion plans continue on target as we install new towers and bring tenants onboard across the country. It is an exciting time for IoT solution providers and their customers, and Senet is happy to be contributing in a major way helping developers create their solutions and bring them to market. The addition of the Boston area innovation district is a great resource for developers in the Northeast and closely follows the successful roll-out of the San Francisco Bay area innovation district.”\nGeographic coverage of the Senet Network will continue to expand as its base of network tenants grows. Network expansion will grow to more than 100,000 square miles by year-end, servicing network clients across the country and ranking as one of the largest LPWAN deployments in the world.\nAbout Senet:\nSenet, Inc. is the only public provider of Low Power Wide Area Networks (LPWANs) with class leading LoRaTM modulation for IoT/M2M applications. LPWANs enable value-driven solutions which can unlock immediate ROI by enabling devices to connect over very long ranges (~15 miles) while delivering very long battery power life (~10 years) with an extremely low device cost. Low-cost, low-power and secure, the Senet network has distinct advantages over cellular, WiFi, and other emerging connectivity technologies for the IoT market.\n©2015 Senet, All rights reserved. Information is subject to change without notice. Senet assumes no liability for errors that may appear in this document. For additional information, visit http://www.senetco.com or contact Senet at +1.603.821.0003.\nSenet is headquartered in Portsmouth, NH (USA).\nMedia Contact:\nSenet\n100 Market St.\nPortsmouth, NH 03801\nPhone +1.603.821.0003 info(at)senetco.com", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5zZW5ldGNvLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5ldmVudGJyaXRlLmNvbS9lL3Jldm9sdXRpb25hcnktaW90LWxvcmF0bS13b3Jrc2hvcC1ib3N0b24tbWEtcmVnaXN0cmF0aW9uLTE4ODg4ODgwMTQ5", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5zZW5ldGNvLmNvbS9ldmVudHM=", "http://www.senetco.com/events"], "published": "2015-10-15T03:00:00.000+03:00", "crawled": "2015-10-15T10:21:30.228+03:00", "highlightTitle": ""}