{"organizations": [], "uuid": "23da93409db7ba518cdd9e9970f4a4fad2dddde2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "http://www.porttechnology.org/images/made/images/uploads/blogs/Eddie_Stobart_Joins_London_Gateway_360_166.jpg", "site_section": "http://feeds.feedburner.com/PortTechnologyInternational-News", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/london_gateway_in_eddie_stobart_collaboration/?utm_source=Feeds&utm_campaign=News&utm_medium=rss", "country": "GB", "title": "London Gateway in Eddie Stobart Collaboration", "performance_score": 0, "site": "porttechnology.org", "participants_count": 1, "title_full": "London Gateway in Eddie Stobart Collaboration", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "a6ab0d95686aef66192987df238d0b1aa8e12535"}, "author": "porttechnology.org", "url": "http://www.porttechnology.org/news/london_gateway_in_eddie_stobart_collaboration/", "ord_in_thread": 0, "title": "London Gateway in Eddie Stobart Collaboration", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UK trucking firm Eddie Stobart has announced a new container transport base at DP World London Gateway Port and Park in order to provide new and existing customers with competitive container transport solutions from the south of the UK, for which they are renowned in the north. As well as being on the doorstep of London and the South East, DP World London Gateway will allow Eddie Stobart to serve destinations across the UK, using their road and rail solution to provide shipping lines and cargo owners with the opportunity to reduce mileage and costs as well as supporting their overall carbon reduction agendas and increasing supply chain reliability.\nAlex Laffey, CEO at Eddie Stobart, said: “We see the potential at DP World London Gateway and the opportunity to offer our customers greater cost efficiencies and environmentally-friendly supply chain solutions.\n“As a multimodal transport and warehouse provider, we believe that London Gateway provides a natural strategic fit with the growth plans for our business. We look forward to working in partnership with the DP World team so that we can jointly offer world class transport solutions.”\nSimon Moore, CEO of DP World London Gateway, said: “It’s great to see a leading brand realise their growth plans here at Britain’s newest port and logistics park, which reduces costs from supply chains by allowing customers to ship closer and save money.\n“The team are highly professional and I’m confident Eddie Stobart will provide UK cargo owners and shippers the very best in service and deliver real savings across the industry.”\nPTI recently covered a video showing DP World’s vision for London Gateway, outlining the development work that will be taking place between now and 2018. \nFor all the latest on DP World London Gateway, click here", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T19:23:24.696+03:00", "highlightTitle": ""}