{"organizations": [], "uuid": "9269d1831a75a2ef652b7e2bd8536e1ab9186680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "campustechnology.com", "main_image": "", "site_section": "http://campustechnology.com/rss-feeds/all-articles.aspx", "section_title": "Campus Technology: All Articles", "url": "https://campustechnology.com/articles/2015/10/02/quincy-u-streamlines-administrative-work-improves-student-services-with-new-erp.aspx", "country": "US", "title": "Quincy U Streamlines Administrative Work, Improves Student Services With New ERP", "performance_score": 0, "site": "campustechnology.com", "participants_count": 0, "title_full": "Quincy U Streamlines Administrative Work, Improves Student Services With New ERP", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:08:00.000+03:00", "replies_count": 0, "uuid": "9269d1831a75a2ef652b7e2bd8536e1ab9186680"}, "author": "", "url": "https://campustechnology.com/articles/2015/10/02/quincy-u-streamlines-administrative-work-improves-student-services-with-new-erp.aspx", "ord_in_thread": 0, "title": "Quincy U Streamlines Administrative Work, Improves Student Services With New ERP", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rhea Kelly"], "text": "By Rhea Kelly 10/02/15 \nQuincy University is simplifying administrative processes, improving student-facing tools and boosting data analytics with a new ERP system. The private liberal arts Catholic university in Illinois is rolling out Jenzabar EX in an effort to improve the overall student experience. \n\"Quincy University strives to provide a high quality student experience coupled with rigorous academic programs,\" said Tony Hayes, director of information technology at the university, in a statement. \"We need to provide simple and easy-to-use tools to our students to make tasks as easy as shopping online; for instance, class registration. Jenzabar's student portal will significantly improve the student experience by simplifying many processes and providing a centralized point of service.\" \nThe Jenzabar EX system provides Quincy with an \"integrated package and single data source used by all the components, reducing issues with propagation delays or duplicate data,\" according to a press release. Adminstrative staff can quickly and easily access data for analysis and better-informed decision-making. \n\"Jenzabar EX provides us accurate and timely data to allow us to be more agile in making data-driven decisions about our programs,\" said Hayes. The university has also used the ERP implementation as an opportunity to streamline its administrative processes. \"The Jenzabar team was helpful in bringing best practices to the table during our training, assisting us in our efforts to improve our processes and provide the best possible educational opportunities and outcomes,\" Hayes added. \"Jenzabar EX gives us the agility we need to stay effective and competitive in the rapidly evolving higher education arena.\" About the Author \nAbout the author: Rhea Kelly is executive editor for Campus Technology. She can be reached at rkelly@1105media.com .", "external_links": [], "published": "2015-10-02T19:08:00.000+03:00", "crawled": "2015-10-09T06:50:52.323+03:00", "highlightTitle": ""}