{"organizations": [], "uuid": "b2bd8f898cc81d41fe7cff40ef525362a1a5ccf4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.crainsnewyork.com", "main_image": "http://www.crainsnewyork.com/apps/pbcsi.dll/storyimage/CN/20151006/RETAIL_APPAREL/310049994/AR/0/Macy", "site_section": "http://feeds.crainsnewyork.com/crainsnewyork/technology", "section_title": "Technology - Crain's New York Business News Feed", "url": "http://www.crainsnewyork.com/article/20151006/RETAIL_APPAREL/310049994", "country": "US", "title": "Macy's and Best Buy are now best buds", "performance_score": 0, "site": "crainsnewyork.com", "participants_count": 1, "title_full": "Macy's and Best Buy are now best buds", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T08:01:00.000+03:00", "replies_count": 0, "uuid": "b2bd8f898cc81d41fe7cff40ef525362a1a5ccf4"}, "author": "Adrianne Pasquarelli", "url": "http://www.crainsnewyork.com/article/20151006/RETAIL_APPAREL/310049994", "ord_in_thread": 0, "title": "Macy's and Best Buy are now best buds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Newscom The iconic clothing retailer is inviting the electronics giant into its stores \nConsumers hoping to snag the latest Skullcandy headphones, Pebble smartwatch or Samsung tablet will soon find them at a handful of Macy's stores. Beginning next month, the department-store chain will host 300-square-foot shops from Best Buy in 10 of its stores—one or two of which will be in the New York metro area—as a pilot program designed to spur sales, which have been sluggish for both retail giants. “Our customers have expressed interest in electronics for self-purchase and gift-giving, and this collaboration ... reinforces Macy's as a shopping destination throughout the year for the products that are most in demand,” said Jeff Gennette, Macy's president, in a statement. Theoretically, Macy's and Best Buy will enjoy a synergistic relationship in which both will attract new customers and foot traffic. The clear winner, though, is Macy's, which used to be the go-to place for everything from television sets to sofas to lipstick, but began -losing that status decades ago with the rise of specialty stores. By licensing space to Best Buy—which will staff the mini-shops with its own tech-savvy employees—the 885-unit chain can attract gadget-loving millennials, an all-important demographic that has traditionally viewed the department-store sector as a relic. Macy's is also embracing a -banding-together attitude through its shop-in-shop program. In addition to Best Buy, the chain has announced it will be featuring Men's Wearhouse and Bluemercury, a cosmetics company that Macy's bought earlier this year. Analysts said that by using its stores as a distribution site for other brands, Macy's will become more similar to competitor Amazon, which has staked its name on selling everything to everyone. “Macy's can literally put all kinds of other retail brands and products and services in that space on their distribution platform as long as the products are relevant to their consumers, which electronics certainly are,” said Robin Lewis, chief executive of retail strategy newsletter The Robin Report. Avoiding customer confusion \nPartnerships carry a risk, however, of diluting the quality and value associated with an established brand. Experts warned that although Macy's can devote some store space to other concepts, it still needs to cultivate its own identity as a shopping destination—otherwise customers could get confused. “Yes, you can bring in third- party brands, but there's a responsibility to curate things from your own brand,” said Neil Saunders, chief executive of Conlumino, a midtown-based retail consultancy, noting the danger of Macy's going “too far down this track of relying on other retailers to draw in sales rather than reinvigorating its own store.” The partnerships with Best Buy and others come at a time of weakness for the $28.1 billion Macy's. For its second quarter ended Aug. 1, the company reported sales of $6.1 billion, a 2.6% decline over the year-earlier period. Net income fell 26%, to $217 million. Given those numbers, the same-store sales decline of just 1.5% almost qualifies as good news. CEO Terry Lundgren recently announced he will prune the fleet by as many as 40 locations. The always-crucial holiday season might not provide much relief. Retail observers predict only a modest 3% to 4% gain industrywide, powered by online sales. Brick-and-mortar stores could see traffic drop as much as 7%, according to Shelley Kohan, vice president of retail consulting at -RetailNext, a data supplier. “The decline in brick-and--mortar comes from the sheer fact of so many digital choices and options,” she said. The concept of teaming up is not a new one, and it has worked out well for other department stores, notably JCPenney, which began hosting 1,500-square-foot Sephora sites more than a decade ago. There are now about 500 Sephoras in Penney locations, totaling more than a million square feet. In recent years, Nordstrom has led the way by hosting spaces from trendy brands Bonobos and Topshop. Yet such partnerships typically complement what the department store already sells: Consumers already flock to Nordstrom for clothing, but now they're able to find more exclusive brands of apparel, too. Other alliances \nThe Best Buy collaboration at Macy's is different. It is designed to lure customers who have not roamed the 157-year-old retailer's storied halls. And targeting the digital generation may be the best way to attract new sales. “It adds some credibility to Macy's with a bit younger audience beyond Hanes underwear,” said Kevin Meany, chief executive of BFG Communications, a branding agency. “There's that halo effect of bringing technology into the stores—you don't feel any of that in Macy's usually, which is just racks of clothes and cosmetics.” Macy's is testing the concept during the holiday season, and retail experts expect it to succeed and be rolled out to additional locations. “Previously, department stores were department stores—it was very black and white,” said Ms. Kohan. “Now in the retail landscape, the lines are very blurred.” A version of this article appears in the October 5, 2015, print issue of Crain's New York Business as \"Macy's, Best Buy now best buds\".", "external_links": [], "published": "2015-10-06T08:01:00.000+03:00", "crawled": "2015-10-06T08:50:23.337+03:00", "highlightTitle": ""}