{"organizations": [], "uuid": "4f2551a9908bb15f629719c919bb46fb97461722", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "techxplore.com", "main_image": "http://img.techxplore.com/newman/gfx/news/2015/djiosmovideo.jpg", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://techxplore.com/news/2015-10-dji-osmo-videos-stills-blur.html", "country": "US", "title": "DJI Osmo: Videos, stills without the shakes and blur", "performance_score": 0, "site": "techxplore.com", "participants_count": 0, "title_full": "DJI Osmo: Videos, stills without the shakes and blur", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T20:30:00.000+03:00", "replies_count": 0, "uuid": "4f2551a9908bb15f629719c919bb46fb97461722"}, "author": "", "url": "http://techxplore.com/news/2015-10-dji-osmo-videos-stills-blur.html", "ord_in_thread": 0, "title": "DJI Osmo: Videos, stills without the shakes and blur", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nancy Owano"], "text": "DJI Osmo: Videos, stills without the shakes and blur October 10, 2015 by Nancy Owano weblog \nA new camera product from DJI may motivate photographers to lighten up on tripods. The product is the Osmo, a 4k, 3-axis stabilized handheld camera. \nA key attribute being promoted by DJI is that it replaces shaky video and photographs with smooth results, in a design that delivers the shots you would hope for—minus the blurs, wobbles and shakes—no matter how you move it. ( The Wall Street Journal said that the \"motorized three-axis gimbal that surrounds Osmo's eyeball-shaped camera works to keep shots level, even as your hand moves .\") \nRyan Connolly, director, Film Riot, in a video praised the camera for bringing professional-quality stabilization. \nTravelers and those wanting to capture scenic moods will like the Automatic Panorama mode for shooting 360° panoramas. You hold the Osmo up above your head and tap the shutter button. The camera rotates, capturing images as it goes while staying level. \nAnother plus is convenience when after long exposure shots; the company said you can get them as crisp as you want without a tripod. The Osmo stabilization system keeps the camera still; you can freehand capture stills of up to 2 seconds. \nStill another draw is obvious; the camera is small enough to fit the palm of your hand. You perform various functions via buttons and controls. \nPaul Pan, lead engineer, made note of the camera's three-axis gimbal. \nThe BBC remarked that while other companies sell gimbals for GoPros and other action cameras, \"they can be fiddly to set up and sometimes require post-processing of the resulting video to make it truly smooth .\" This video is not supported by your browser at this time. \nThe BBC said you are looking at \"a handheld device that integrates a video camera and a stabilization gimbal.\" Fundamentally, said Daniel Terdiman in Fast Company , you are looking at a 4K camera mounted atop a handheld stabilizer. \"Built with DJI's three-axis gimbal stabilization technology and a 94-degree field of view, the $649 Osmo was designed to shoot 60 minutes of no-shake 4K video with its built-in battery, or can be used to take high-quality still photos .\" \nWhen you put the Osmo down, it automatically goes into sleep mode after a set amount of time, which extends the Osmo's battery life. A fully charged battery lasts for 60 minutes when recording video, and 6 hours of standby. It takes 60 minutes to charge the battery. The listed price is $649 for a \"fully stabilized 4K, 12Mp camera optimized for ground use .\" \n.", "external_links": [], "published": "2015-10-10T20:30:00.000+03:00", "crawled": "2015-10-10T20:37:52.851+03:00", "highlightTitle": ""}