{"organizations": [], "uuid": "a00b62e42e37ed3216b189d5bcc39cc9f7e88b32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/technologysectorNews", "section_title": "Reuters: Technology", "url": "http://www.reuters.com/article/2015/10/05/norsk-titanium-usa-idUSL1N1211UT20151005", "country": "US", "title": "New York state to build large-scale 3D printing plant-sources", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "New York state to build large-scale 3D printing plant-sources | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T21:23:00.000+03:00", "replies_count": 0, "uuid": "a00b62e42e37ed3216b189d5bcc39cc9f7e88b32"}, "author": "Andrea Shalal", "url": "http://www.reuters.com/article/2015/10/05/norsk-titanium-usa-idUSL1N1211UT20151005", "ord_in_thread": 0, "title": "New York state to build large-scale 3D printing plant-sources", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON Oct 5 New York state will invest $125 million to build the world's first industrial-scale 3D printing facility as part of a private-public partnership with Norway's Norsk Titanium AS, according to sources familiar with the deal.\nA groundbreaking for the plant is expected in late October or November in Plattsburgh, New York, about 160 miles north of the state capital of Albany, said the sources, who could not speak publicly before an announcement by the state.\nThey said the plant is slated to be fully operational by the end of 2016 when it will be able to \"print\" large components for aircraft manufacturers and weapons makers at much lower cost than current technologies. Additive manufacturing, or 3D printing, is used to build 3D objects by adding layers of material, such as plastic, metal or concrete.\nNorsk Titanium, also known as NTi, declined comment. No comment was immediately available from SUNY Polytechnic Institute, the New York university that will manage the program.\nNTi received a half dozen other bids from other states to build the facility, but ultimately chose New York, according to the sources. The site is due to open with several dozen large 3D printers, but that number will grow over time, they said.\nNew York is aggressively seeking to expand its high-technology footprint. In July, it won a $610 million competition to build a research hub dedicated to photonics, an emerging light science that could revolutionize communications, medicine and defense.\nNorsk Titanium's chief executive, Warren Boley, a former executive with Aerojet Rocketdyne, told Reuters in July that the 200,000-square-foot 3D printing plant would be government-owned but operated by NTi. At the time, Boley did not say where the plant would be located.\nNTi says its technology uses titanium wire to make components at a cost up to 70 percent less than current technologies, in about 10 percent of the time. Proponents of 3D printing or additive manufacturing say it can help aircraft manufacturers cut the cost of parts made from titanium, which costs seven times more than aluminum.\nBoley said the multiyear project aim to build large-scale components for commercial aircraft, with launch orders expected by the first quarter of 2016.\nNorsk last month said Christopher Kubasik, a former Lockheed Martin Corp president and chief operating officer who has been a member of NTi's board since June 2013, would take over as chairman of the board effective January 2016. (Reporting by Andrea Shalal; Editing by Christian Plumb )", "external_links": [], "published": "2015-10-05T21:23:00.000+03:00", "crawled": "2015-10-05T22:10:29.318+03:00", "highlightTitle": ""}