{"organizations": [], "uuid": "f644a4ae67cb8f18b3a2edbfcc37772863ca58a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizbot.com", "main_image": "http://www.gizbot.com/img/2015/10/08-1444286249-honor-band-z1-pictures.jpg", "site_section": "http://www.gizbot.com/rss/apps-fb.xml", "section_title": "Wearable Technology | Wearable Devices | Wearable Technology Fashion | Wearables News - GizBot", "url": "http://www.gizbot.com/wearable-technology/reviews/huawei-honor-band-z1-first-impressions-minimalistic-design-looks-elegant-tough-028659.html", "country": "IN", "title": "Huawei Honor Band Z1 first impressions: Minimalistic Design, Looks Elegant, Tough from Inside", "performance_score": 0, "site": "gizbot.com", "participants_count": 0, "title_full": "Huawei Honor Band Z1 first impressions: Minimalistic Design, Looks Elegant, Tough from Inside", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T09:48:00.000+03:00", "replies_count": 0, "uuid": "f644a4ae67cb8f18b3a2edbfcc37772863ca58a0"}, "author": "", "url": "http://www.gizbot.com/wearable-technology/reviews/huawei-honor-band-z1-first-impressions-minimalistic-design-looks-elegant-tough-028659.html", "ord_in_thread": 0, "title": "Huawei Honor Band Z1 first impressions: Minimalistic Design, Looks Elegant, Tough from Inside", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We had hands on experience of the Band Z1, and here are our first impressions: \nDesign: \nThe round dial has become quite popular ever since Motorola's Moto 360 donned a circular dial. The Band Z1 too flaunts a circular-dial smartwatch, which however does not come with any physical button. The Band Z1 combines metal and plastic chassis. The dial has a disk-like shape with a 1.06-inch (128x128pixels) POLED touchscreen surrounded by brushed metal bezel which gives it a little style. The straps are made of rubbery material which is similar to what you see on traditional sports bands. However, Huawei has put texture on bands to make them look different from regular rubbery bands. Overall, the device looks nice and feels light on wrist, as the metal adds to the looks and rubbery bands make it light. And, it is pretty thin as well. \nPerformance: \nAs we said that there are no physical keys present on the Band Z1, you will have to give it touch inputs to wake the screen or do more. Double tapping on screen wakes it up from sleep. You can swipe up and down to go to other controls and options. It is powered by Cortex M4 STM32F411 chipset. The touch interface is not smooth, and we found the device a bit sluggish. Huawei claims that there are not many smartwatch options available with such features, in this price range, which we think does not justify the device's sluggish performance. \nConnectivity: \nIn terms of connectivity and compatibility, the Band Z1 supports Bluetooth 4.1 version and works with Android and iOS based devices. The watch shows time, track steps, count calories burnt and other fitness activities. Also, it can be used to put alarm, and get message notifications and incoming call alerts. \nOthers: \nWhat gives it an edge is the IP68 certification which makes it water and dust proof. It runs on 70mAh battery, which as per the company, can last for up to 4 days and up to 14 days on standby. \nThe band is available in Black, Beige, and White color strap options. \nConclusion: \nThe Huawei Honor Band Z1 looks like a traditional yet stylish watch with smart functions. It does come pretty thin and light, but still lacks that appeal which we were hoping to see in a Rs. 5,499 smartwatch. We are not even impressed with its touch interface. We will reserve our take on its performance for our extensive review of the device.  ", "external_links": [], "published": "2015-10-08T09:48:00.000+03:00", "crawled": "2015-10-08T13:53:37.496+03:00", "highlightTitle": ""}