{"organizations": ["NASA"], "uuid": "ca0356d057519847c403be541a8ed0c996296f02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/hires/2015/swriledstudy.jpg", "site_section": "http://www.physorg.com/rss-feed/", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-comet-tail-solar.html", "country": "US", "title": "Study finds that a comet's tail may shed light on solar wind heating", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Study finds that a comet's tail may shed light on solar wind heating", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:48:00.000+03:00", "replies_count": 0, "uuid": "ca0356d057519847c403be541a8ed0c996296f02"}, "author": "", "url": "http://phys.org/news/2015-10-comet-tail-solar.html", "ord_in_thread": 0, "title": "Study finds that a comet's tail may shed light on solar wind heating", "locations": ["Delaware"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Study finds that a comet's tail may shed light on solar wind heating October 13, 2015 Individual clumps of tail material bob and twist in the turbulent solar wind, in this highly processed image of Comet Encke from the HI-1 instrument on board NASA's STEREO-A spacecraft. The circular dots mark individual clumps that where tracked by the SwRI/University of Delaware team to measure the flow of the solar wind. Credit: NASA/SwRI \nWe can't see the wind, but we can learn about it by observing things that are being blown about. And by studying changes in a comet's bright tail of gas and ions, scientists are on the trail to solving two big mysteries about the solar wind, the supersonic outflow of electrically charged gas from the Sun's million-degree upper atmosphere or corona. \nA team of scientists led by the heliophysics group at Southwest Research Institute (SwRI) has used observations of Comet Encke's tail using NASA's Solar and Terrestrial Relations Observatory, or STEREO, revealed that the solar wind flows through the vacuum of interplanetary space much as the wind blows on Earth: not smoothly, but with gusting turbulence and swirling vortices. \nThat turbulence can help explain two of the wind's most curious features: its variable nature and unexpectedly high temperatures. A paper on the STEREO results was published in The Astrophysical Journal on Oct. 13, 2015. \n\"The solar wind at Earth is about 70 times hotter than one might expect from the temperature of the solar corona and from how much it expands as it crosses the void,\" said Dr. Craig DeForest, a solar physicist at SwRI in Boulder, Colo., and lead author on the study. \"The source of this extra heat has been a mystery of solar wind physics for several decades.\" \nScientists know a lot about the properties and behavior of the solar wind but don't agree about how it is accelerated, especially at its fastest speeds. Moreover, the solar wind can be highly variable, so that measurements just short times or distances apart can yield quite different results. It is also very, very hot - hotter than it should be at such great distances from the Sun's corona. \nThe SwRI-led team took advantage of some of Comet Encke's more unusual characteristics to study the solar wind. Unlike most comets, Comet Encke has what is called a compact tail. Rather than feathering out loosely, creating a wide spray of ions, Comet Encke's ion tail streams out in a tight, bright ribbon of glowing gas with compact features. \nUsing the Heliospheric imager onboard STEREO, scientists studied the movements of hundreds of dense \"clumps\" of glowing, ionized gas within the ribbon of Comet Encke's tail, which passed by STEREO in 2007. Fluctuations in the solar wind are mirrored in changes in the tail. By tracking these clumps, scientists were able to reconstruct the motion of the solar wind, catching an unprecedented look at its turbulence. \nTurbulence in the solar wind could provide one of the answers to the mystery of the solar wind heating. Based on analysis of the comet tail motions, the researchers calculated that large-scale turbulence provides sufficient kinetic energy to drive the high-temperatures observed in the solar wind. \nTurbulence may also explain solar wind variability. \"Turbulent motion mixes up the solar wind, leading to the rapid variation that we see at Earth,\" said DeForest. \n\"In situ measurements are limited because they cannot follow the turbulence along its path,\" said William Matthaeus, a professor of physics and astronomy at the University of Delaware and co-author on the study. \"Now, for the first time, we observed the turbulent motions along their complex paths and quantified the mixing. We actually see the turbulence .\" \nThese observations provide a preview of what NASA plans to observe more directly with the Solar Probe Plus mission, which will travel within 10 solar radii of the Sun. However, because comets go closer to the Sun than any spacecraft can, they provide unique information about the solar wind and interplanetary space . \nSTEREO is the third mission in NASA's Solar Terrestrial Probes program, which is managed by the Goddard Space Flight Center for NASA's Science Mission Directorate.", "external_links": [], "published": "2015-10-13T22:48:00.000+03:00", "crawled": "2015-10-13T22:53:21.217+03:00", "highlightTitle": ""}