{"organizations": ["Georgia Tech Information Security Center"], "uuid": "59540e58c8bd118a5c9244794c763d4c25a9ab4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/CIOs-reporting-directly-to-CFOs-can-create-massive-cybersecurity-headaches/49490334.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/recentstories", "section_title": "Latest Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/cios-reporting-directly-to-cfos-can-create-massive-cybersecurity-headaches/49490334", "country": "IN", "title": "CIOs reporting directly to CFOs can create massive cybersecurity headaches", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "CIOs reporting directly to CFOs can create massive cybersecurity headaches", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T07:33:00.000+03:00", "replies_count": 0, "uuid": "59540e58c8bd118a5c9244794c763d4c25a9ab4d"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/cios-reporting-directly-to-cfos-can-create-massive-cybersecurity-headaches/49490334", "ord_in_thread": 0, "title": "CIOs reporting directly to CFOs can create massive cybersecurity headaches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#CFO CIOs reporting directly to CFOs can create massive cybersecurity headaches Many companies need technology upgrades but are \"starving\" for the cash necessary to upgrade critical systems.That's the message from the author of a new study sponsored by the Georgia Tech Information Security Center. Business Insider | 22 October 2015, 10:03 AM IST Follow ETCIO Share Many companies need technology upgrades but are \"starving\" for the cash necessary to upgrade critical systems. That's the message from the author of a new study sponsored by the Georgia Tech Information Security Center. \nStudy author Jody Westby, the chief executive officer of consulting firm Global Cyber Risk, tells CFO.com, \"When you start looking at why [a] company had a weak security program, it usually comes down to allocation of resources.\" \n\"The CFO should be very concerned, because often it's the security programs that have been starved for cash,\" she says. \nWestby explains that many complaints about malfunctioning computer security systems never reach the CFO because the chief information officer (CIO) intercepts those messages and tables them. CFOs are often viewed to be \"cost obsessed\" and more willing to ditch projects that will cost the company money, she says. \nRegardless of the chain of reporting, Westby says finance chiefs must include security programs - and the material and human resources they require - in the company's annual budget review. This allows the board to directly examine the cost of security risks and assign the necessary resources to stop cyber threats as they occur. \n\"If a security team is starved for funding, that always comes back to the CFO,\" Westby tells CFO.com. \nConfusing the issue is the reporting structure. Chief information security officers (CISOs) and chief security officers (CSOs) most often report to the CIO (40%). However, they also sometimes report to a CEO (22%), and 8% of the time they report to the CFO. That reporting structure has remained fairly consistent from 2010 through 2015. George Tech College of Computing \nIf the CIO reports directly to the CFO, Westby says it's important that the CFO \"really tries to understand the cyber risk and tries to ensure there is adequate funding - within reason.\" \nThe study lists four major cybersecurity challenges: # Lack of focus on cyber breach prevention puts critical assets at risk . Building security that simply detects threats, with no other option than incident response, is too little, too late.# Security has been categorized as simply an IT problem for too long . Cyber risks are too important not to discuss in the boardroom - this is an existential issue for the entire enterprise.# Too many point security products leave gaping holes in security postures. Piecemeal security systems and point products that don't share context across the entire cyberattack life cycle are inadequate.# Too many manual steps and cycles impede prevention and can't scale. Most enterprise security teams are not resourced to manually handle thousands of daily alerts. \nHalf of the cybersecurity issue clearly focuses on boardroom and funding considerations. \nThere is, however, some good news for CFOs and their boards. The 2015 survey found that most boards have finally established \"risk committees and shifted risk oversight from the audit committee to the risk committee. Additionally, boards are now undertaking key oversight activities related to governance of cybersecurity.\" \nBy removing the cybersecurity equation from the auditing department, a company can settle on must-have cybersecurity needs before passing that information along for financial approval. \nPerhaps the most useful tip from the survey is to remove a single point of contact from making the final decision on security. \"Evaluate the existing organizational structure and establish a cross-organizational team that is required to meet at least monthly to coordinate and communicate on privacy and security issues,\" Westby writes. \n\"This team should include senior management from human resources, public relations, legal, and procurement, as well as the CFO, the CIO, CISO/CSO, CRO, the CPO, and business line executives,\" she says.", "external_links": [], "published": "2015-10-22T07:33:00.000+03:00", "crawled": "2015-10-22T11:40:30.814+03:00", "highlightTitle": ""}