{"organizations": ["JOHNSTOWN Ohio Oct.", "Ohio Cannabis", "Apeks Supercritical Johnson"], "uuid": "07e63c55332ef6fb7c4ae41e5fd8b0640c2bdec3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Ohio-Cannabis-botanical-oil-extraction-manufacturer-wants-legalization-of-marijuana-but-calls-Issue-3-a-recipe-for-disaster-49259-1/", "country": "US", "title": "Ohio Cannabis botanical-oil extraction manufacturer wants legalization of marijuana but calls Issue 3 'a recipe for disaster'", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Ohio Cannabis botanical-oil extraction manufacturer wants legalization of marijuana but calls Issue 3 'a recipe for disaster'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:44:00.000+03:00", "replies_count": 0, "uuid": "07e63c55332ef6fb7c4ae41e5fd8b0640c2bdec3"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Ohio-Cannabis-botanical-oil-extraction-manufacturer-wants-legalization-of-marijuana-but-calls-Issue-3-a-recipe-for-disaster-49259-1/", "ord_in_thread": 0, "title": "Ohio Cannabis botanical-oil extraction manufacturer wants legalization of marijuana but calls Issue 3 'a recipe for disaster'", "locations": ["Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY Ohio Cannabis botanical-oil extraction manufacturer wants legalization of marijuana but calls Issue 3 'a recipe for disaster' ... JOHNSTOWN Ohio Oct. 23 2015 /PRNewswire/ ...Apeks Supercritical Johnson's company is the #2 fastest-growing comp...All of the non-defined elements of Issue 3 could put Ohio... I'm not a huge activist but I would hate to see the marijuana indust... http://feeds.bio-medicine.org/latest-medical-technology Date:10/23/2015 \nJOHNSTOWN, Ohio , Oct. 23, 2015 /PRNewswire/ -- Entrepreneur, Andy Joseph , has argued that Ohio should legalize marijuana for both medical and recreational uses, or the state will miss out on economic opportunity. But Joseph strongly opposes the current Issue 3 marijuana initiative in his home state. Ohio would be the first state to jump past no legal use to recreational use, instead of a controlled rollout of just medical marijuana first. And the amendment does not spell out the qualifications such as background checks for issuing growth or sales licenses. He predicts the proposed constitutional amendment could be a \"disaster\" for the marijuana industry in Ohio . \nApeks Supercritical, Johnson's company, is the #2 fastest-growing company in central Ohio and manufactures botanical-oil extraction equipment. Apeks is on track to exceed $13 million in sales this year – up from $750,000 just three years ago – all because of legalized marijuana in other states. \nAll of the non-defined elements of Issue 3 could put Ohio in conflict with the Cole Memo and potentially cause legalization issues for other states across America. The Cole Memo specifically prevents the distribution to minors, preventing revenue to cartels, gangs, resale, etc. \n\"I'm not a huge activist, but I would hate to see the marijuana industry make all the strides it has, only to have a big black eye from the state of Ohio ,\" Joseph said. \nJoseph is speaking out after a long period of silence like a half-dozen other Ohio businesses who supply and serve the marijuana industry in other states. \"It's risky for me to come out here and say, 'Hey, I don't agree,'\" Joseph said. \"I just can't sit back anymore and let a constitutional hijacking happen just for the opportunity for business gain.\" \nIssue 3 was put on the ballot by ResponsibleOhio, backed by a group of investors who own 10 properties in the state whose parcel ID numbers are listed in the proposed amendment as the only sites for legal pot farms. \n\"This is a fantastic wake-up call. ... It's forcing us to have this conversation that's really needed to happen for a long time,\" said Joseph. \"But my deeper concern is about the law-and-order issues. An overwhelming 90 percent of Ohio voters support the legalization of medical marijuana and responsible organizations and activists are ready to push new legislation for the 2016 ballot.\" \n\"Issue 3 is not Ohio's only chance at legalizing marijuana. However, it is the wrong chance for Ohioans.\" \nAbout Apeks: Apeks Supercritical has been designing and manufacturing botanical oil extraction systems that utilize subcritical and/or supercritical CO2 as a solvent since 2001. We are veteran owned, have several degreed engineers on staff and all of our systems are proudly built in Johnstown, Ohio with as many American made parts and components as possible. \nFor more information:", "external_links": [], "published": "2015-10-23T17:44:00.000+03:00", "crawled": "2015-10-24T10:48:52.238+03:00", "highlightTitle": ""}