{"organizations": [], "uuid": "d02de1c4467358f98369d9a3ecbd8c2ea8a0a26f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139116/judy-macnamee-creates-online-program-help-teens-suffering-from-adhd-overcome-common-ro", "country": "US", "title": "Judy MacNamee Creates Online Program to Help Teens Suffering From ADHD to Overcome Common Roadblocks to Learning", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Judy MacNamee Creates Online Program to Help Teens Suffering From ADHD to Overcome Common Roadblocks to Learning", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:00:00.000+03:00", "replies_count": 0, "uuid": "d02de1c4467358f98369d9a3ecbd8c2ea8a0a26f"}, "author": "admin", "url": "http://www.freshnews.com/news/1139116/judy-macnamee-creates-online-program-help-teens-suffering-from-adhd-overcome-common-ro", "ord_in_thread": 0, "title": "Judy MacNamee Creates Online Program to Help Teens Suffering From ADHD to Overcome Common Roadblocks to Learning", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/12/2015 @ 7:00 AM   ADHD CoachConnect \nCOLUMBUS, Ohio, Oct. 12, 2015 /PRNewswire/ -- October is National ADHD Awareness Month. According to the Centers for Disease Control and Prevention, approximately 11% of children 4-17 years of age have been diagnosed with ADHD as of 2011. That's 6.4 million children dealing with ADHD. In addition, the study showed that the percentage of children with an ADHD diagnosis continues to increase, from 7.8% in 2003 to 9.5% in 2007 and to 11.0% in 2011. \nPhoto - http://photos.prnewswire.com/prnh/20151009/275888 \nThis is not news to Judy MacNamee of ADHD CoachConnect in Columbus, Ohio. As a special education teacher in the Columbus, Ohio and other state public school systems for over fifteen years, she sees the impact that this unique brain wiring makes on students. \"ADHD students are needlessly struggling to keep up in school. Most people don't realize that high school students with ADHD are four times more likely to drop out of school than the general population,\" says MacNamee. \"The daily processes of organization; planning, prioritizing, and time management are real struggles for ADHD students, especially if they don't get the help they need to succeed.\" \nTo help teens who are struggling with ADHD, MacNamee is offering a five-week course called SAILS of STRENGTH(TM) . The goal of the program is to provide tools and strategies that will empower teens with ADHD to manage their own lives with greater ease. The program is delivered one on one via Skype or Google Hangout. Learning styles and other assessments are administered then privately and confidentially analyzed by MacNamee, which allow her to help determine where the teen is struggling the most so the rest of the training can focus on those areas. A few common areas of focus include organization, practical study skills, time management skills and test taking skills. The process incorporates the whole family by developing strategies that harness the teen's strengths and build skills for academic and life success. The program concludes by reviewing the progress and providing further action steps to help both the parent and the teen to continue to move positively forward. \n\"Sitting down, going over strategies to feel more comfortable, learning little cheats and practicing the timing of the test made me go into the test feeling much more confident than I would have without,\" said Meredith Grilliot, a teen client of MacNamee. \nParents agree with the positive assistance that MacNamee's programs deliver. Speaking of her son, Denise Scott said, \"He has told me that he is grateful that we connected with Judy and so am I. Judy is a high-energy positive force that knows how to connect with kids this age and give them skills that will serve them well for the rest of their lives.\" \nThe program tuition is $399 and runs from October 20, 2015 - November 20, 2015. More information on SAILS of STRENGTH(TM) Program can be found at http://adhdcoachconnect.getresponsepages.com/ . \nABOUT JUDY MACNAMEE \nFounder and ADD/ADHD Coach of ADHD CoachConnectLLC , in Columbus, Ohio, Judy has earned both a B.S. and M.B.A from Ashland University along with an M.S. from Illinois State University. This education provided her with the groundwork to spend the last 15 years working side by side with middle and high school teens struggling with ADD, ADHD and related disabilities and to establish her company. \nJudy is a contributor of the Amazon best-selling book, Inspirational Ways to Succeed with ADHD , and is also a contributor of the upcoming book Wacky Ways to Succeed at ADHD . She speaks frequently so she can spread ADHD Awareness and lives in the Columbus, OH area. Her expertise has been featured in Business First Columbus, NBC4 Daytime Columbus, and Cityscene Magazine. \nJudy's company was awarded the Jon Peterson Scholarship for 2016 which provides scholarships to students in Ohio who are eligible to attend kindergarten through 12th grade and have an Individualized Education Program (IEP) from their district of residence. \nYou can find out more at http://www.adhdcoachconnect.com . \nContact: Judy MacNamee", "external_links": [], "published": "2015-10-12T17:00:00.000+03:00", "crawled": "2015-10-12T18:20:51.222+03:00", "highlightTitle": ""}