{"organizations": [], "uuid": "6785e9a98d86b62fdab33f0fe264dfb34b7e8c97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/3/i/2/l/image.related.afrArticleLead.620x365.gkcbzz.png/1445547237621.jpg", "site_section": "http://www.afr.com/technology", "section_title": "Technology News | afr.com", "url": "http://www.afr.com/technology/inside-malcolm-turnbulls-big-name-innovation-roundtable-20151018-gkcbzz", "country": "AU", "title": "Inside Malcolm Turnbull's big name innovation roundtable", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Inside Malcolm Turnbull's big name innovation roundtable | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T04:53:00.000+03:00", "replies_count": 0, "uuid": "6785e9a98d86b62fdab33f0fe264dfb34b7e8c97"}, "author": "Yolanda Redrup", "url": "http://www.afr.com/technology/inside-malcolm-turnbulls-big-name-innovation-roundtable-20151018-gkcbzz", "ord_in_thread": 0, "title": "Inside Malcolm Turnbull's big name innovation roundtable", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malcolm Turnbull gathered together some of the biggest names in Australian tech, startup and venture capital for an innovation summit. Dallas Kilponen Share on twitter Share on Google Plus by Yolanda Redrup Incentive structures to encourage investment in productive assets and opening up government data were among suggestions raised at Malcolm Turnbull's Liberal Party innovation roundtable.\nEntrepreneurs, including Freelancer chief executive Matt Barrie and Square Peg Capital's Paul Bassat, who attended last Friday's innovation roundtable applauded Liberal Party ministers Arthur Sinodinos, Christopher Pyne and Prime Minister Malcolm Turnbull for being forward thinking in the creation of policy ideas to buoy the start-up sector .\nMr Barrie said the ministers suggestions would bring about \"systematic change, not piecemeal\".\n\"Minister Sinodinos proposed looking at how we can change incentive structures that the government provides to get people to invest in things like productive assets, rather than unproductive assets such as the family house,\" he said.\nFreelancer chief executive Matt Barrie says new incentive structures and opening government data were discussed at the Coalition's innovation roundtable on Friday. Louie Douvis \"There was also a discussion about open data initiates. I suggested that all government services and data should be accessible by an API so we can build products using it.\"\nBig picture Mr Barrie said he was surprised that the ministers were thinking big picture, with long-term mindsets.\n\"In these sessions you expect the start-ups and tech companies to come in and make all these suggestions, but it was the other way around and that was a shock,\" he said.\nMr Barrie said government ministers such as Arthur Sinodinos had forward-thinking policy ideas. Alex Ellinghausen \"Some of the most intelligent things came from Ministers Pyne, Sinodinos and the Prime Minister.\"\nIt was high praise from Mr Barrie, who has previously criticised both sides of government for talking the talk but not walking the walk.\nIn May he said the Liberal Party no longer stood for \"entrepreneurship, start-ups or small business\", suggesting policy reforms were just \"lip service\" .\nDiscussions at the innovation roundtable on Friday were framed around themes: Collaboration, culture, start-ups and capital, talent and skills and government as an exemplar.\nSquare Peg Capital co-founder Paul Bassat said reforms to the education curriculum and specific policies to supportive innovative young companies were tabled. Jesse Marlow Education reform Mr Bassat was hesitant to mention specific ideas which were proposed, but he said reforms to the education curriculum and specific policies to supportive innovative young companies were tabled.\n\"I would be surprised if we don't see a bunch of different changes in the next six, 12 or 18 months,\" he said.\n\"It's not just about grants and tax policy, it's about a broad suite of policies to help Australia become more innovative.\"\nAndrew Bassat said he hoped Australia would undergo a cultural shift to allow for a longer term focus in business. Josh Robenstone In November Labor will be also hosting its own meeting with the start-up community, bringing them together with representatives of the venture capital and superannuation sectors to discuss ways to encourage more superannuation money to be invested in venture capital.\nEngagement with the sector from both sides of politics has increased since Malcolm Turnbull become Prime Minister and flagged his focus on innovation.\nBig names Also attending the Liberal Party's roundtable was CHAMP Private Equity founder Bill Ferris, Google Australia managing director Maile Carnegie, Telstra chief operating officer Kate McKenzie and Reinventure Group co-founder Danny Gilligan.\nA number of people from universities and research institutions also attended, such as CSIRO chief executive Larry Marshall and the dean of management at the University of Technology Sydney, Roy Green.\nSEEK co-founder and chief executive Andrew Bassat said all the right people were in the room.\n\"The second positive thing was that they were there to listen,\" he said. \"Even in the lead up to the roundtable they had very good awareness of the issues and challenges and they were very aware of what the government could and couldn't do.\"\nMr Bassat said he hoped Australia would undergo a cultural shift to allow for a longer term focus in business.\n\"When a CEO makes a mistake, everyone says they shouldn't be CEO,\" he said.\n\"But people should be encouraged to have a crack and know it won't always come of.\"\nof", "external_links": ["https://twitter.com/YolandaRedrup", "https://plus.google.com/https://plus.google.com/114369306974649582739/about"], "published": "2015-10-23T04:53:00.000+03:00", "crawled": "2015-10-23T05:13:45.947+03:00", "highlightTitle": ""}