{"organizations": [], "uuid": "ac64c8d30d5e2f809d69124d8829ea0793fbc329", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://graph.facebook.com/10227041841/picture", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/MyNews24/The-harsh-reality-of-being-poor-in-South-Africa-20151021", "country": "ZA", "title": "The harsh reality of being poor in South Africa", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "The harsh reality of being poor in South Africa | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T04:15:00.000+03:00", "replies_count": 0, "uuid": "ac64c8d30d5e2f809d69124d8829ea0793fbc329"}, "author": "news24.com", "url": "http://www.news24.com/MyNews24/The-harsh-reality-of-being-poor-in-South-Africa-20151021", "ord_in_thread": 0, "title": "The harsh reality of being poor in South Africa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So, our economy is shrinking and shedding jobs faster than anyone can say JOB. Our cost of living is rising due to rising food prices (I read somewhere that food inflation was hovering around 4.4% in September).\nIt would seem that for a while yet, the poor of this country will continue to bear the brunt of this harsh economy its harsh realities.\nThe other day, as I was travelling from Gauteng to Limpopo, passing through Mpumalanga, I started pondering this situation, trying to think of the best way to maneuver my family and me around its challenges. Still in this pondering mode, I was struck by the visible differences and/or opportunities each province holds for the betterment of its citizens. These provinces have the potential and hold opportunities to provide a better life for their citizens. It is sad though, that we do not seem to be able to identify those opportunities, and as a collective work towards turning them into reality.\nI have to admit, it was a difficult thing to ponder and I have not figured out any quick solutions to the issue, however I have a few observations that could perhaps steer my and everyone’s thinking in the right direction. My biggest concern is that despite all the loud proclamations to improve their livelihood, the poor are remaining poor in this country. This is a ticking time bomb because it applies to a big majority of the citizens of this country.\nThere are 3 key things that struck me as common between these provinces:\nAbundant labour : as a country we have an abandonment of labour, across all provinces, which we could potentially rally around a common objective and utilize to make a better life for all.\nArable land: in a varying degree of availability, all 3 provinces have available farmable land. It is a pity that most of this land is going to waste due to either under-utilization or no utilization at all for a host of reasons, some fathomable and some not.\nPositive energy among the people : it is amazing how positive the people in this country are. Yes, we do get the negative sentiment now and again coming through in service protests and crime, but we are generally a positive nation, always hoping for the best.\nI also just want to acknowledge that, for all its faults and political challenges, our government is not to blame for the gloomy global economy and its impact on under-developed nations (I insist that South Africa is not yet a developing economy). However, we all know that they could do things better, where they have the power to change things. My intention with this piece is not to apportion blame, but to try and find solutions that the poor can find useful in turning their situation around.\nIn Limpopo, I bumped into some youngsters; some of them have passed matric and some of them had even acquired a post matric qualification of some sort; a few of them did business studies post matric. These youngsters all had one thing in common: they were all hoping for an opportunity to make it and better themselves and their families. I do not mean hoping as in sitting there and hoping that someone brings something to them; I mean they mostly get up in the morning, freshen up and head out there to try and find opportunities.\n23 years ago, I was in exactly the same spot as these youngsters. It was by a divine intervention that I made it to Johannesburg and found a job. It was the fear of going back to point zero that spurred me on to study, to work hard and to push tenaciously through life and be the man that I am today. What struck me as sad though, was how the more things change, the more they remain the same for the poor of this country.\nContrary to what some politicians would like us to believe, South Africa is one of the most unequal societies in the world and it seems that is not going to change in a hurry. For the poor person, this means they are going to be poor for long time yet, before things change for the better. Again, this piece is not to rant about what the government should be doing and what it should not be doing, it is about my experiences out there, when I engage with people down at the lowest level of the economy, where I used to be two decades ago.\nIf I had the authority to mandate change in this country, I would first focus on these 3 areas:\nEducation : I would mandate a system overhaul of the education program in this country. I would copy with pride from the Zimbabwean system, which gives its candidates skills for survival and self-help, rather than the skill to seek a job. If it works for the Zimbabweans, there is no reason it would not work for South Africans.\nFood Farming : I would increase the effort into local food production, focusing on staple foods to improve food availability; this would reduce food costs in this country due to lower factors of production and therefore reduce food inflation, which would put back some change in the pockets of the poor.\nI would mandate that the unemployed youth of this country be employed at entry level salaries, and be paid at minimum for at least a year. I would mandate these projects to have a proper skills development program designed, so that these youths can acquire life skills, while making some living out of the projects. From where I stand, this would be way better than what they are getting right now, which is zero.\nSever the triangular relationship with the union : the three-way relationship between government, the private sector and the unions is largely hampered by the fact that our government is in bed with the biggest union in the land. Oddly enough, this union used to stand for the rights of the under-privileged, against the government; but these days they seem to be fighting for the privileged few in the echelons of power to remain privileged.\nUp until this relationship is severed and there is a clear standpoint by either party, these players will always be suspicious of each other’s intentions and therefore would hamper better economic development policies and activities in the land.\nAgain, I am saying this as a man that was once at level zero (the poorest of the poor) and now I am standing at the top looking down to the same view, or probably the worst state of affairs, considering that the slice of the cake is getting thinner and is in the hands of a privileged few due to political indifference.\nAt least back in my day, it was due to political interference that the wealth of this country was in the hands of the privileged few and this cut across the spectrum of the poor. It hurts more when those we have put in power to look out for us, have now become indifferent to our dire situation because they are too busy looking out for themselves.\nMan, it is tough being poor in this country", "external_links": [], "published": "2015-10-22T04:15:00.000+03:00", "crawled": "2015-10-22T00:54:28.594+03:00", "highlightTitle": ""}