{"organizations": [], "uuid": "cb6542f1dfa580b13cd682663fe0e1aa09b3d1de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wearable-technologies.com", "main_image": "https://www.wearable-technologies.com/wp-content/uploads/2015/10/beyonce-banner.png", "site_section": "https://www.wearable-technologies.com/feed/", "section_title": "Wearable Technologies", "url": "https://www.wearable-technologies.com/2015/10/wearables-in-the-limelight/", "country": "", "title": "Wearables in the Limelight", "performance_score": 0, "site": "wearable-technologies.com", "participants_count": 1, "title_full": "Wearables in the Limelight", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T18:39:00.000+03:00", "replies_count": 0, "uuid": "cb6542f1dfa580b13cd682663fe0e1aa09b3d1de"}, "author": "Ayliffe Brown", "url": "https://www.wearable-technologies.com/2015/10/wearables-in-the-limelight/", "ord_in_thread": 0, "title": "Wearables in the Limelight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 16, 2015 Wearables in the Limelight \nThe truth is: trends are set by the people that are in the limelight. WT | Wearable Technologies believes wearables are the pioneering innovative technology that can help shape a better, more fit, and more aware future for humanity. However in the meantime – it is fun to see which celebrities are in the front line for purchasing the newest wearable tech. \nLoyal customers are what drive the exponential revenue of Apple. Some of their most loyal customers are also the most popular in the world, celebrities. Apple Watch is expected to be the most popular wristable – despite its high price. According to IDC Apple Watch sold 3.6 million units in the second quarter of 2015. No wonder the celebs are showing off their new wearable smart watch. Just to name a few that look flashy and fit: Ludacris, Kanye West, Beyoncé, Katy Perry, Karl Lagerfeld, Sophie Turner, Drake, Pharrell… even Wan Jianlin dog is rocking two Apple Watches! \nMr. President Barack Obama is taking the stage with wearables on his side. You can spot photos of the American President with Game Golf wristable, and Google Glass . Not a huge surprise when you consider that the military were the first to pioneer the creation of wearable computers. Even so, government officals are in full support of wearables assisting with lowering cost for the healthcare market. \nNearly a year ago will.i.am released i.am/PLUS ; a smart watch that looks like a fat black circle with an LCD screen. His ability to become one with the public consumer demand and the “technologic” world is short-term. In 2011 he was the Director of Creative Innovation for Intel. But after a year, he has yet to place a price and distribution for i.am/PLUS . His contract is said to be up in 2016. Let’s wait a few months and see if will.i.am will remain in this high ranking position. In the meantime, enjoy this drumline music based promotion video for the i.am/PLUS. \nShaq the famous basketball player – stopped working out once he stopped playing for the NBA (hard to believe – we know). But one day he was walking through Best Buy and bought a FitBit . It’s his favorite! He enjoys how it keeps him aware and motivated to stay fit – on or off the court. Shaq says the best part of how FitBit is how you can poke your friends when you realize they haven’t been training. In the future you can expect Shaq to be riding the quantified-self train. No reason to be unaware of your body if you have wearables on your side! \nAshton Kutcher is quoted in mashable saying,”In a world of AR and VR, you can walk down the street and have monsters jump around corners. I can leave virtual notes for my wife on the refrigerator… The entire world becomes the playground of our technology, and we can place things in space and recall them whenever we want.” Kutcher has his feet dangling with investors into the wearable market. It will be interesting to see how his magic hands can affect the growth of wearables. \nThere are other more well known activites recording celeberties wearing light-up customes (Lady GaGa, Black-Eye Peas ..), however in this article WT wanted to bring you the latest and most up-to-date news. Sure, there are many more celebrities that use wearables – but do not necessarily market it on their social media. You know, being hot isn’t easy and neither is being a public figure. Yet, we have a feeling that most fit celebrities use an activity tracker to ensure they are gaining enough sleep and steps throughout their busy day. Stay tuned for more updates soon.", "external_links": [], "published": "2015-10-16T18:39:00.000+03:00", "crawled": "2015-10-17T08:14:04.205+03:00", "highlightTitle": ""}