{"organizations": [], "uuid": "c91d425731bd3297b3f975897cd310b4830cd898", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/5f04e8ab-7187-427c-9251-b853492f8c4d.img", "site_section": "http://www.ft.com/rss/companies/technology", "section_title": "Technology", "url": "http://www.ft.com/cms/s/0/a75023bc-735f-11e5-bdb1-e6e4767162cc.html?ftcamp=published_links%2Frss%2Fcompanies_technology%2Ffeed%2F%2Fproduct", "country": "US", "title": "SciSys rises as ‘Operation Crater’ ends", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "SciSys rises as ‘Operation Crater’ ends", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:06:00.000+03:00", "replies_count": 0, "uuid": "c91d425731bd3297b3f975897cd310b4830cd898"}, "author": "", "url": "http://www.ft.com/cms/s/0/a75023bc-735f-11e5-bdb1-e6e4767162cc.html?ftcamp=published_links%2Frss%2Fcompanies_technology%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "SciSys rises as ‘Operation Crater’ ends", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Burgess Aga"], "text": "SciSys shares rise as it draws a veil over ‘Operation Crater’ Kate Burgess Aga’s good fortune boosts shareholders \nSciSys has had a rubbish summer. In June, the Chippenham-based software business that helped to land the Rosetta space probe on Comet 67P Churyumov-Gerasimenko last year, disclosed that an unidentified fixed price contract — let’s call it “Operation Crater” — had gone wrong. Badly. As a result, SciSys warned, profits would be well short of expectations and it would not meet the terms on its debt. \nSciSys suspended its dividend, analysts cut their profit forecasts from £3m to £300,000 and the company’s shares fell a third. The group’s bosses then spent the summer reviewing contracts and processes and persuading lenders to be kind. “We’ve been making sure nothing else was in the cupboard,” says Klaus Heidrich, chief executive. \nSciSys had locked itself into a mispriced project. It is a blunder that has brought down many builders and developers over many years. \nProject Crater is not SciSys’s first bungle of this sort. But what is surprising is how a relatively small deal could have such a big effect. Operation Crater was just one of 100 contracts on which the company was working and the fees would have been less than £1m spread over several years. \nMr Heidrich says the job was a one-off and well outside SciSys’s core divisions working for the media, defence and space industries. \nBut for all that, SciSys is a tech business founded in 1980 and employing 400 staff in Germany and the UK. The group is titchy. Its market value is just £19m and it turns over about £40m. A bigger company with a more solid record of rising revenues and profitability would have fared better. Operation Crater’s timing was unfortunate. SciSys was putting the losses made during the 2008 crisis behind it. Brokers were forecasting £3.3m pre-tax profits in 2015 and £3.8m in 2016 \nOperation Crater’s timing was unfortunate. SciSys was putting the losses made during the 2008 crisis behind it. Brokers were forecasting £3.3m pre-tax profits in 2015 and £3.8m in 2016. \nThe next stage was to bulk up revenues by acquisitions and boost profitability. The board even talked jauntily of SciSys being a business with a predictable revenue stream earning “reasonable margins” above 10 per cent. \nThose dreams were dashed in June. SciSys was well into Crater when defects emerged that, it realised, would cost millions and mean pulling resources from other jobs. The pain was compounded by the weakness of the euro. \nAbout half the software company’s revenues are paid in that currency. Analysts promptly slashed 2015 forecasts and pencilled in about £2.4m in pre-tax profits for 2016. \nA big mistake, Mr Heidrich suggests, was SciSys’s system of reviewing projects based on value rather potential awkwardness. “We mispriced the project in the sense that it was a misjudgment of its trickiness,” he says earnestly. \nAccounting rules made it worse by forcing the company to provide for the loss immediately and causing it to breach the ratio of profits to borrowings set by the banks. \nBetter news came last week when SciSys negotiated an end to Operation Crater and its shares rose 10 per cent. At 70p, they are trading at just above six times next year’s earnings. They will linger at that level, though, until investors are sure that SciSys’s will not bungle again. \nMotoring to the land of pandas \nVmoto is vamoosing. Last week the Chinese scooter company said it was quitting London’s Alternative Investment Market and heading east. It is keeping its Aussie listing but London has become too expensive. \nVmoto has not had an easy ride on Aim. Shares are down 55 per cent this year and it was suspended last month pending a profit warning. But unlike other Chinese companies that have been forced off London’s junior market recently, Vmoto is choosing to go because, it says, its shareholders are mostly Australian and trading volumes on Aim were too low to be worth staying. \nThe London Stock Exchange says most Chinese groups being ejected from the junior market are owned by Chinese executives or their friends and family, which limits the damage done by their performance. \nBut more than a tenth of Vmoto’s shares are owned by Brits whose money will now be stranded on the other side of the world. \nGeorge Osborne, the UK chancellor, can smile sweetly at his political counterparts in China and talk in cuddly terms about Chinese companies listing in London. But there will be nothing cuddly about the way City investors welcome new arrivals from the land of pandas. Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-10-18T20:06:00.000+03:00", "crawled": "2015-10-19T02:36:59.426+03:00", "highlightTitle": ""}