{"organizations": [], "uuid": "cff0058d0a017813c83519604142e53bae6dc21f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/1-studyfindsmo.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-tunnels-ant-food-colony.html", "country": "US", "title": "Study finds more tunnels in ant nests means more food for colony", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Study finds more tunnels in ant nests means more food for colony", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T01:50:00.000+03:00", "replies_count": 0, "uuid": "cff0058d0a017813c83519604142e53bae6dc21f"}, "author": "", "url": "http://phys.org/news/2015-10-tunnels-ant-food-colony.html", "ord_in_thread": 0, "title": "Study finds more tunnels in ant nests means more food for colony", "locations": ["San Diego"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kim Mcdonald Harvester"], "text": "Study finds more tunnels in ant nests means more food for colony October 20, 2015 by Kim Mcdonald Harvester ant with seed. Credit: Noa Pinter-Wollman/UC San Diego \nA UC San Diego study of the underground \"architecture\" of harvester ant nests has found that the more connected the chambers an ant colony builds near the surface entrance, the faster the ants are able to collect nearby sources of food. \nThe reason is simple: Increased connectivity among chambers leads to more social interactions among the ants within the nest. So when one group of ants within a colony—comprised of individuals working toward a common goal—finds a particularly good source of food, it's able to more quickly communicate that finding to the rest of the colony. \n\"The volume of the chambers has little influence on the speed of recruitment, suggesting that the spatial organization of a nest has a greater impact on collective behavior than the number of workers it can hold,\" said Noa Pinter-Wollman, a biologist at UC San Diego who conducted the study, which was published in this week's issue of the journal Biology Letters . \nBecause these nests are occupied by extremely cooperative societies, she believes they can potentially inspire architectural designs that promote collaboration among humans. \n\"One straightforward lesson that will probably not surprise many architects is that having more corridors connecting offices or rooms will facilitate easier movement of people among them, both promoting interactions and expediting evacuation in emergency,\" she said. \"However, a less obvious potential addition to this lesson would be that increasing the connectivity of locations with an important function, such as break rooms, where people interact—similar to the entrance chamber of the ants—could increase interactions and collaborations.\" \nNoa Pinter-Wollman, a research scientist at UC San Diego's BioCircuits Institute, found that as both the connectivity of chambers within the ant nests and the redundancy of connections among chambers increase, so does a colony's speed of recruitment to food. Using a form of mathematical analysis known as \"network theory,\" she analyzed the structures of different ant nests and related them to the collective behavior of the colonies residing in them—in this case, the foraging of harvester ants. \nThese native species of ants, known to scientists as Veromessor andrei, live in grasslands and chaparral throughout California, including San Diego. They frequently move into existing nests abandoned by other colonies that built those nests when they were young or \"renovated\" them after a rainstorm loosened the soil. The ants feed on seeds they collect from the ground or directly from plants, but will also bring back to their nests larger food items such as termites or caterpillars. \n\"My earlier work on this ant species showed that colonies change their collective behavior as they relocate among nest sites,\" said Pinter-Wollman. \"I wanted to know what causes this change in behavior and one likely hypothesis was that the behavioral change was closely related to the nest site.\" \nStudies conducted recently by other scientists had determined that finding food quickly was critical to the reproductive success of harvester ants. So Pinter-Wollman measured how rapidly ants were able to recruit their nest mates to a small piece of apple placed 10 to 15 centimeters from the entrance of 106 nest sites in the Elliot Chaparral Reserve near the UC San Diego campus. \nWith the assistance of two UC San Diego undergraduate environmental systems students, Annamarie Go and James Huettner, she tracked 28 harvester ant colonies, some of which occupied several nest sites. The team then obtained both behavioral data and plaster casts (which revealed the underground chambers and other structures) of 32 nest sites occupied by 17 different ant colonies. \nPinter-Wollman said her study was the first to find a link between a \"naturally occurring nest architecture and the collective actions of the colony that resides in it.\" While more interconnected chambers near the entrance to the nest provides an advantage to food recruitment, she noted that there is also a downside to having too many chambers near the surface. Such an architecture could introduce structural instabilities that would cause the chambers to collapse during rains when the ground is softened, she noted. \n\"After a prolonged drought like the one we're experiencing in California, severe storms, such as those anticipated later this year, could cause flooding and destroy these upper structures,\" she said. \"It would be interesting to see if, after the predicted El Niño, harvester ants build deeper chambers than they have in previous years.\"", "external_links": [], "published": "2015-10-21T01:50:00.000+03:00", "crawled": "2015-10-21T02:08:04.287+03:00", "highlightTitle": ""}