{"organizations": [], "uuid": "dade6b51561c43a5449836fb319a6657b66d37a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/news/features/science-technology/", "section_title": "The Tribune: Science/technology/gadgets/environment ", "url": "http://www.tribuneindia.com/news/spectrum/food-for-sal-i-vation/149604.html", "country": "US", "title": "Food for sal(i)vation", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Food for sal(i)vation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "dade6b51561c43a5449836fb319a6657b66d37a2"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/spectrum/food-for-sal-i-vation/149604.html", "ord_in_thread": 0, "title": "Food for sal(i)vation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rahul Verma\nPicture an average neighbourhood in Delhi – or in any of the bigger cities. In the daytime, it tends to look a bit listless. Men and women at work; a vegetable seller goes by with his cart. All in all, it seems quiet – with just the sounds of car horns a reminder of city lives. In the evenings, the same area springs to life. The chaatwallah is doling out golgappas to salivating customers, while his assistant puts together plates of chaat. In another corner, a young boy sits with an aluminium steamer, selling vegetable/chicken momos with red hot and garlicky chutney. Elsewhere, a woman sits on the pavement, roasting a cob of corn over a coal fire with a hand fan. That India’s streets are full of food — and food lovers — becomes apparent if you walk down any busy locality in the evenings. In some areas, of course, the daytime is equally busy. In an area of Kolkata where there is a large population of people of Chinese-origin, street breakfast is a living tradition. You will find vendors lining up the streets of Tiretta Bazaar selling various kinds of Chinese breakfast fare — from pork dimsums to fish-ball soups and steamed, filled buns. In Delhi, too, there are areas up at the dawn with the most heavenly of food aromas. In some corners of Old Delhi, you’ll find an old ustaad standing by his sealed smoking cauldron, with a large group of people, impatiently waiting. And when the cover is finally removed, you get the most delicious fragrance of nihari – shanks cooked overnight, often with besan or atta. A bowl of that nourishing gruel and people will be ready for work. There is the kachoriwallah, with his freshly fried kachoris, the bedmi pithi-stuffed pooris with spicy aloo bhaji, or, if you are lucky, khatta-meetha kaddu, not easily available these days. You can wash it down a tall glass of sweet lassi or milk with a crisp, juicy jalebi dunked in it. Breakfast on the streets is serious business! But street food, like everything else, is not static. As more and more people from different regions settle down in a place, street food evolves to suit changing palates, or pockets. Chowmein, for instance, is a veritable part of street food in India these days. In recent years, it has become the poor man’s street staple, cooked and served from carts. A large helping usually costs Rs 15- Rs 20. Often, it is the hard-working rickshaw wallah’s or labourer’s main meal. It is interesting to see how street food has been changing with time. In Delhi, for instance, once street food meant chaat papri, dahi bhalla and golgappa, and kachori and bedmi in some select areas such as Chandni Chowk. In the Jama Masjid area, the evenings bustled with kabachis, who would grill succulent kebabs or tikkas over a charcoal fire. These delicacies are still there, but a great many new items have been added to the street menu. As people came in from the South, southern idlis, dosas and vadas became readily available. As more and more young people came from Kolkata and other parts of the East, the streets welcomed them with kathi rolls — egg-lined paranthas stuffed with chicken or meat pieces, laced with chutney and onion rings. Even Mumbai’s famous pav bhaji, vada pav and bhelpuri and the Gujarati dhokla and khandvi can be had all over India now. People of Bihar brought with them litti-chokha — baked sattoo-filled flour dumplings served with mashed potatoes. The city’s growing Nepalese, Tibetan and North-Eastern communities have introduced momos to the rest of India. You can find momo counters almost anywhere in the country. These are today are as popular as the golgappas or the tikkis. Even the malls have woken up to the worthiness of the street food. You can find chholey bhaturey to chaat to even sushi and shawarma. Global warming may have turned our weather upside down, but street food in India is always a reminder of the seasons. Summer comes with fruit kulfis and chaat with iced yoghurt or drinks such as jaljeera. The rains bring in pakoras – onion, potato, paneer, chillies, eggplant, spinach, lotus stem and all kinds of vegetables. There are some special corners in Delhi which specialise just in pakoras, and the crowds here are humongous during the rains. Winter is the time for hot kachoris or smoky kebabs, served with green chutneys and spiced onion slashes. Winter also brings out the man selling daulat ki chaat — a delightful sweet dish prepared with the foam of milk, sweetened with powdered sugar and flavoured with saffron. The vendor usually walks in the shadows, for the sweet is so delicate that it collapses in the sun. You’ll seldom find it in the harsh summers. Legend has it that daulat ki chaat has to be prepared on moonlit nights between autumn and spring. And those are the two seasons that celebrate food of all kind. This is the time when the occasional cool breeze in the air fills you with the urge to eat that hot and spicy samosa, mashed atop a bed of chholey covered with tangy chutney. Street food tells you about a place, as well as about its people. And street food makes no distinction – it is as much the food of the rich, as it is of the poor, loved as much by senior citizens and the young school kids. It is the food for dating couples, for families on an outing, for the labourer after a hard day’s work, for the loner who doesn’t cook and for the giggling teenaged girls. It is for everybody. The streets may change over the years, but their heart beats as always. This is where India lives — and eats.", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T06:54:34.605+02:00", "highlightTitle": ""}