{"organizations": [], "uuid": "9d866a939938c3475c1aa3021b5e5c14f60c0d90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://www.iol.co.za/polopoly_fs/iol-pic-july10-computer-keyboard-1.1883517!/image/1324296527.jpg_gen/derivatives/box_600/1324296527.jpg", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNFaZTOSHWjxZiC6qjDljBS2vRVQVQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778963811338&ei=efUQVsC3LKHWadSjq8gC&url=http://www.iol.co.za/business/news/technology-challenges-teaching-methods-1.1924265", "country": "IL", "title": "Technology challenges teaching methods - Independent Online", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Technology challenges teaching methods - Independent Online", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T07:01:00.000+03:00", "replies_count": 0, "uuid": "9d866a939938c3475c1aa3021b5e5c14f60c0d90"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNFaZTOSHWjxZiC6qjDljBS2vRVQVQ&clid=c3a7d30bb8a4878e06b80cf16b898331&cid=52778963811338&ei=efUQVsC3LKHWadSjq8gC&url=http://www.iol.co.za/business/news/technology-challenges-teaching-methods-1.1924265", "ord_in_thread": 0, "title": "Technology challenges teaching methods - Independent Online", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By . Comment on this story SUPPLIED \nJohannesburg - In this information age, where 24-hour connectivity is as much a part of our modern lives as wearing shoes, one key aspect of society struggling to keep up with these changes is education institutions. \nSchools and tertiary institutions, and the learning therein, have remained largely unchanged since the 19th century. Pupils still sit in rows of desks, reading words on a board in the front of the class – words put there by a well-educated adult, sometimes several years ago. But how many of us went to work this morning wearing top hats or leopard skin – or riding a horse and cart for that matter? \nWith the dawn of the cellphone, digital information and wireless connectivity, society is changing faster than it possibly ever has. Indeed, a staggering 90 percent of the data in the world today was created in the past two years, according to IBM. \nSchools have the responsibility to educate the next generation and to prepare that generation with the skills and knowledge required for learning, life and work. But society now moves at such a fast pace that the jobs which will one day be filled by our current students have not yet been invented. It is imperative then that schools provide pupils with the ability to learn for themselves, to adapt to new technologies and systems, and to create their own strategies for coping. \nBeing online comes naturally to most of our pupils these days, but they tend to see their time online as “social” rather than “useful”. Why not tap into that space? Connected learners of the future will use everyday web tools and social media platforms to enhance learning and teaching. \nCellphones will become a medium of instruction, and learning will be localised as well as globalised, according to Delvin Munsamy, digital marketing manager at Rosebank College. \nLet us explore the top 10 trends to watch out for that will become a reality for connected learners of the future: \nMobile-based courses \nMobile technology is a growing and powerful trend. As an indication, Africa is dubbed the mobile continent and researchers predict that internet use on cellphones will increase 20 fold on the continent in the next five years – double the ratio of growth than in the rest of the world. With this said, cellphones will be used in the same way as computers to house and disseminate learning material for pupils of the future. \nMobile app analytics \nWith the proliferation of mobile- based courses, mobile analytics will play a vital role in understanding pupils’ interaction and behaviour with such courses by monitoring app traffic and engagement. \nBite-sized learning \nMobile is being projected as the ultimate medium for immediate support, which should come in easily digestible and immediately useful information nuggets. One of the criticisms of the digital generation is that they have short attention spans. Educators are taking note and are creating learning tools that offer snack-sized bites of learning for pupils. \nGamefication of course work \nAccording to a survey conducted by M2 Research, almost 80 percent of learners say they would be more productive if their institution were more game-like. \nLearners remember 90 percent if they do the work themselves, even if it’s only a simulation. Taking short quizzes and assessments on the cellphone is on the rise, and this trend is likely to continue. \nAugmented reality \nAugmented reality is already making big waves. With new apps such as Aurasma, learning is literally coming to life. In the future, pupils will be able to scan a page of their homework and a video of their teacher explaining a related concept could pop up, or book reviews will be available by simply scanning a barcode on the book. \nE-books dominate \nAmazon.com is one of the largest retailers of books, but in the past year, its sales of ebooks has outstripped that of traditional books. The ebook is steadily becoming a popular part of everyday life for many around the globe, and the digital book is slowly making its way into the classroom as well. In the future, ebooks are likely to dominate virtual bookshelves. \nBring your own device to classrooms \nSince most learners today already have access to mobile devices, schools are seizing the opportunity to turn these distractions into learning tools by incorporating these devices into classroom lessons and projects. From cellphones to laptops, teachers and pupils are increasingly bringing their own technology into the classroom. \nOnline collaborative learning \nMost places these days have internet connection, and many people can now access the web from almost anywhere they can get a cell- phone signal. Schools are embracing the web as a learning tool in a variety of ways, but a particularly exciting one has to be the growth of online collaborative learning. \nThis can mean a variety of things, but in many cases it involves pupils each participating in a project on the web. \nSocial media learning \nWhen it was first created, Facebook was solely a place for college students to connect with one another. Today just about everyone has a profile on the site. Educators have begun using it as a way to connect with learners, spark discussion and relay important assignment information. \nWhile social media in education is still a tricky area, as sites like Twitter and Facebook evolve, the ways they’re used in the classroom will likely become more refined and more powerful in creating a better educational experience. \nThe rise of the tablet \nTablet computers come in many shapes and sizes, but as they grow smaller and more portable, they are becoming a fairly common addition to the classroom. They’re great for doing everything from studying the periodic table to playing educational games. The app-based device has become a necessity in schools across the world. \nWith the proliferation of technology, educators are challenged to deliver and facilitate teaching in many new ways, and are discovering the potential that technology has in advancing learning. \nSTAR WORKPLACE", "external_links": [], "published": "2015-10-04T07:01:00.000+03:00", "crawled": "2015-10-04T12:46:34.038+03:00", "highlightTitle": ""}