{"organizations": [], "uuid": "190bb65e6c0f52435e521714037aa9da0da7e425", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135414/icdlogic-advisor-stanley-nachimson-receives-prestigious-2015-ten-leadership-award-icd1", "country": "US", "title": "ICDLogic Advisor Stanley Nachimson Receives Prestigious 2015 Ten Leadership Award from ICD10 Monitor", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "ICDLogic Advisor Stanley Nachimson Receives Prestigious 2015 Ten Leadership Award from ICD10 Monitor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T20:17:00.000+03:00", "replies_count": 0, "uuid": "190bb65e6c0f52435e521714037aa9da0da7e425"}, "author": "admin", "url": "http://www.freshnews.com/news/1135414/icdlogic-advisor-stanley-nachimson-receives-prestigious-2015-ten-leadership-award-icd1", "ord_in_thread": 0, "title": "ICDLogic Advisor Stanley Nachimson Receives Prestigious 2015 Ten Leadership Award from ICD10 Monitor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/1/2015 @ 10:17 AM Companies mentioned in this article: ICDLogic \nHARRISON, N.Y., Oct. 1, 2015 /PRNewswire/ -- ICDLogic , a clinical documentation innovator offering ICD-10 compliant solutions today announced that Stanley Nachimson, ICDLogic Strategic Advisor , was named the recipient of the \"Ten Leadership Award\" from ICD10 Monitor , the popular online news and information source that attracts tens of thousands of clinicians and healthcare administrators to its website and weekly news show about ICD-10, \"Talk-10 Tuesday.\" \nNachimson is co-chair of the WEDI-SNIP ICD-10 Testing Workgroup and previous co-chair of the ICD-10 Taskforce for the Health Information Management and Systems Society (HIMMS) where he now serves on the Healthcare Business Systems Committee. Nachimson is an undisputed thought leader in ICD-10, and the author of the pivotal whitepaper, Impact of Implementing ICD10 on Physician Practices and Clinical Laboratories commissioned in 2008 by the AMA and multiple other medical associations, and updated in 2014. He spent nearly a decade at the Centers for Medicare and Medicaid Services (CMS) where he helped influence the adoption of electronic standards that are the backbone for current electronic claims submission between healthcare providers and insurance payers. \n\"I had the honor of meeting Stanley in 2011, two years before our Cypher software was conceived,\" says ICDLogic CEO, Monique Fayad . \"His mantra that ICD-10 was fundamentally about clinical documentation specificity and not coding, helped me see that coder queries to physicians kept them from doing what they wanted to do most - provide excellent patient care. We at ICDLogic are thrilled to see Stanley receive this recognition of his decade's long commitment to the vision of accurate, comprehensive and interoperable electronic patient records.\" \nCypher is an intuitive, web-based clinical documentation and ICD-10 workflow tool built for speed, ease of use and to provide expert clinical documentation guidance. Designed by clinicians, coders and documentation experts, Cypher requires virtually no education in ICD-10 coding as it automatically generates the most specific ICD-10 and ICD-9 code based on clinical thinking. Cypher reminds users to document relevant underlying causes, additional factors, complications and comorbidities that signal a patient's severity of illness. Coding and billing staff can use the tool to develop more targeted queries and improve workplace productivity. \nAbout ICDLogic ICDLogic builds intuitive, web-based clinical documentation and coding software that enables providers to easily comply with complex healthcare reimbursement regulations, and to receive timely and fair reimbursement for the care they provide. Focused on improving documentation accuracy and efficiency, ICDLogic's fast, easy and affordable tools empower providers to avoid lost productivity and protect cash flow by minimizing the queries and denials that are forecast to increase with the ICD-10 implementation transition in October 2015. For more information visit us at www.icdlogic.com or call 844-452-0808. Please direct all ICDLogic inquiries to: Jackie Morey at 908-268-8451 or jmorey@icdlogic.com . \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/icdlogic-advisor-stanley-nachimson-receives-prestigious-2015-ten-leadership-award-from-icd10-monitor-300152746.html \nSOURCE ICDLogic", "external_links": [], "published": "2015-10-01T20:17:00.000+03:00", "crawled": "2015-10-01T21:04:46.603+03:00", "highlightTitle": ""}