{"organizations": [], "uuid": "537e10430e5128f4ecffd7d6f85e26ffa0eb0f92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150916115959&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10833841/amgen-and-xencor-announce-strategic-collaboration-in-cancer-immunotherapy-and-inflammation", "country": "US", "title": "Amgen And Xencor Announce Strategic Collaboration In Cancer Immunotherapy And Inflammation", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "Amgen And Xencor Announce Strategic Collaboration In Cancer Immunotherapy And Inflammation", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "537e10430e5128f4ecffd7d6f85e26ffa0eb0f92"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10833841/amgen-and-xencor-announce-strategic-collaboration-in-cancer-immunotherapy-and-inflammation", "ord_in_thread": 0, "title": "Amgen And Xencor Announce Strategic Collaboration In Cancer Immunotherapy And Inflammation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THOUSAND OAKS , Calif. and MONROVIA, Calif. Amgen (NASDAQ:AMGN) and Xencor, Inc. (Xencor) (NASDAQ:XNCR) announced today that the two companies have entered into a research and license agreement to develop and commercialize novel therapeutics in the areas of cancer immunotherapy and inflammation. The research collaboration brings together Amgen's capabilities in target discovery and protein therapeutics with Xencor's XmAb ® bispecific technology platform.\nThe collaboration includes molecular engineering by Xencor and the preclinical development of bispecific molecules for five programs proposed by Amgen, leveraging XmAb bispecific Fc domains to make half-life extended T cell engagers and dual targeting bispecific antibodies. The agreement also includes a preclinical bispecific T cell engager program directed at CD38 and CD3 for multiple myeloma.\nAmgen will be fully responsible for preclinical and clinical development and commercialization worldwide. Under the terms of the agreement, Xencor will receive a $45 million upfront payment and up to $1.7 billion in clinical, regulatory and sales milestone payments in total for the six programs. Xencor is eligible to receive mid to high single-digit royalties for candidates directed against Amgen's targets, and high single to low double-digit royalties for Xencor's CD38 bispecific T cell engager.\n\"We are pleased to be joining forces with Xencor to expand our immuno-oncology and inflammation position by leveraging Amgen's antibodies and Xencor's bispecific antibody platform,\" said Sean E. Harper , M.D., executive vice president of Research and Development at Amgen. \"We are especially excited about the T cell engaging bispecific antibody directed against CD38, which complements Amgen's BiTE ® platform, while growing our hematology and oncology portfolio that includes two bispecific T cell engager antibodies, BLINCYTO ® (blinatumomab) and AMG 330, as well as Kyprolis ® (carfilzomib) for relapsed multiple myeloma.\"\nBispecific technologies seek to engineer monoclonal antibodies to bind two unique drug targets, as opposed to traditional antibodies designed to bind to a single antigen target. This approach represents a powerful opportunity in immuno-oncology to simultaneously engage immune cells and tumor cells to localize anti-tumor immune activity where it is needed most.\n\"Amgen, which has pioneered the use of bispecific antibodies, has chosen to access our XmAb bispecific technology for its robustness, long half-life, and the plug and play ease-of-development of our platform,\" said Bassil Dahiyat , Ph.D., president and chief executive officer of Xencor. \"This opportunity expands the reach of our technology with a partner that has proven experience in bispecifics and immuno-oncology. Xencor will continue to focus on its internal programs including its immuno-oncology XmAb bispecifics, XmAb14045 in acute myeloid leukemia and XmAb13676 in B-cell malignancies, which are expected to enter clinical development in 2016.\"\nAbout Xencor's XmAb ® Bispecific Technology\nAs opposed to traditional monoclonal antibodies that target and bind to a single antigen, bispecific antibodies are designed to elicit multiple biological effects that require simultaneous binding to two different antigen targets. Xencor's XmAb bispecific Fc domain technology is designed to maintain full-length antibody properties in a bispecific antibody, potentially enabling favorable in vivo half-life and simplified manufacturing.\nEfforts at bispecific antibody design are typically frustrated by poor molecular stability, difficulties in production and short in vivo half-life. Xencor has engineered a series of Fc domain variants that spontaneously form stable, heterodimeric bispecific antibodies and that can be made and purified with standard antibody production methods. These bispecific Fc domains are used to generate a broad array of novel drug candidates in a range of molecule formats.\nXencor's initial bispecific programs are tumor-targeted antibodies that contain both a tumor antigen binding domain and a cytotoxic T-cell binding domain (CD3 binding domain). These bispecific antibodies activate T cells at the site of the tumor for highly potent killing of malignant cells. The XmAb Fc domain format allows Xencor to tune the potency of the T-cell killing, potentially improving the tolerability of tumor immunotherapy. Xencor plans to begin clinical testing for two internal programs, XmAb14045 and XmAb13676, in 2016.\nAbout Xencor Inc.\nXencor is a clinical-stage biopharmaceutical company developing engineered monoclonal antibodies for the treatment of asthma and allergic diseases, autoimmune diseases and cancer. Currently, eight candidates that have been engineered with Xencor's XmAb ® technology are in clinical development internally and with partners. Xencor's internally-discovered programs include: XmAb5871, which completed a Phase 1b/2a clinical trial for the treatment of rheumatoid arthritis and is in preparation for a clinical trial in IgG4-related disease in 2015; XmAb7195 in Phase 1a development for the treatment of asthma; and XmAb5574/MOR208 which has been licensed to Morphosys AG and is in Phase 2 clinical trials for the treatment of acute lymphoblastic leukemia and non-Hodgkin's lymphoma. Xencor's XmAb antibody engineering technology enables small changes to the structure of monoclonal antibodies resulting in new mechanisms of therapeutic action. Xencor partners include Merck, Janssen R&D LLC, Alexion, Novo Nordisk and Boehringer Ingelheim. For more information, please visit www.xencor.com .\nAbout Amgen's Immuno-Oncology Focused Partnerships\nAmgen's recent immuno-oncology focused partnerships include:\nA collaboration with Merck on developing talimogene laherparepvec and KEYTRUDA ® (pembrolizumab) in melanoma and small cell cancer of the head and neck. A strategic research collaboration and license agreement to develop and commercialize the next generation of novel Chimeric Antigen Receptor (CAR) T cell immunotherapies with Kite Pharma. A research collaborative agreement focusing on Amgen's bispecific T cell engager (BiTE ® ) antibody constructs with MD Anderson's Moon Shots Program . A collaboration with Roche on a cancer immunotherapy study with investigational medicines talimogene laherparepvec and atezolizumab. About Kyprolis ® (carfilzomib) for Injection\nKyprolis ® (carfilzomib) for Injection is indicated in combination with lenalidomide and dexamethasone for the treatment of patients with multiple myeloma who have received one to three prior lines of therapy.\nKyprolis is also indicated under FDA accelerated approval as a single agent for the treatment of patients with multiple myeloma who have received at least two prior therapies including bortezomib and an immunomodulatory agent and have demonstrated disease progression on or within 60 days of completion of the last therapy. Approval is based on response rate. Clinical benefit, such as improvement in survival or symptoms, has not been verified.\nKyprolis is a product of Onyx Pharmaceuticals, Inc. Onyx Pharmaceuticals is a subsidiary of Amgen and holds development and commercialization rights to Kyprolis globally, excluding Japan . Kyprolis is also approved for use in Argentina , Israel , Mexico and Thailand . For more information about Kyprolis, visit www.kyprolis.com\nImportant Safety Information Regarding Kyprolis ® (carfilzomib) for Injection\nWARNINGS AND PRECAUTIONS\nCardiac Toxicities:\nNew onset or worsening of pre-existing cardiac failure (e.g., congestive heart failure, pulmonary edema, decreased ejection fraction), restrictive cardiomyopathy, myocardial ischemia, and myocardial infarction including fatalities have occurred following administration of Kyprolis. In clinical studies with Kyprolis, these events typically occurred early in the course of Kyprolis therapy ( Acute Renal Failure:\nCases of acute renal failure have occurred in patients receiving Kyprolis. Renal insufficiency adverse events (renal impairment, acute renal failure, renal failure) have occurred with an incidence of approximately 8% in a randomized controlled trial. Acute renal failure was reported more frequently in patients with advanced relapsed and refractory multiple myeloma who received Kyprolis monotherapy. This risk was greater in patients with a baseline reduced estimated creatinine clearance (calculated using Cockcroft and Gault equation). Monitor renal function with regular measurement of the serum creatinine and/or estimated creatinine clearance. Reduce or withhold dose as appropriate.\nTumor Lysis Syndrome:\nCases of tumor lysis syndrome (TLS), including fatal outcomes, have been reported in patients who received Kyprolis. Patients with multiple myeloma and a high tumor burden should be considered to be at greater risk for TLS. Ensure that patients are well hydrated before administration of Kyprolis in Cycle 1, and in subsequent cycles as needed. Consider uric acid lowering drugs in patients at risk for TLS. Monitor for evidence of TLS during treatment and manage promptly including interruption of Kyprolis until TLS is resolved.\nPulmonary Toxicity:\nAcute Respiratory Distress Sndrome (ARDS), acute respiratory failure, and acute diffuse infiltrative pulmonary disease such as pneumonitis and interstitial lung disease have occurred in less than 1% of patients receiving Kyprolis. Some events have been fatal. In the event of drug-induced pulmonary toxicity, discontinue Kyprolis.\nPulmonary Hypertension:\nPulmonary arterial hypertension (PAH) was reported in approximately 1% of patients treated with Kyprolis and was Grade 3 or greater in less than 1% of patients. Evaluate with cardiac imaging and/or other tests as indicated. Withhold Kyprolis for pulmonary 11 hypertension until resolved or returned to baseline and consider whether to restart Kyprolis based on a benefit/risk assessment.\nDyspnea:\nDyspnea was reported in 28% of patients treated with Kyprolis and was Grade 3 or greater in 4 % of patients. Evaluate dyspnea to exclude cardiopulmonary conditions including cardiac failure and pulmonary syndromes. Stop Kyprolis for Grade 3 or 4 dyspnea until resolved or returned to baseline. Consider whether to restart Kyprolis based on a benefit/risk assessment.\nHypertension:\nHypertension, including hypertensive crisis and hypertensive emergency, has been observed with Kyprolis. Some of these events have been fatal. Monitor blood pressure regularly in all patients. If hypertension cannot be adequately controlled, withhold Kyprolis and evaluate. Consider whether to restart Kyprolis based on a benefit/risk assessment.\nVenous Thrombosis:\nVenous thromboembolic events (including deep venous thrombosis and pulmonary embolism) have been observed with Kyprolis. In the combination study, the incidence of venous thromboembolic events in the first 12 cycles was 13% in the Kyprolis combination arm versus 6% in the control arm. With Kyprolis monotherapy, the incidence of venous thromboembolic events was 2%. Thromboprophylaxis is recommended and should be based on an assessment of the patient's underlying risks, treatment regimen, and clinical status.\nInfusion Reactions:\nInfusion reactions, including life-threatening reactions, have occurred in patients receiving Kyprolis. Symptoms include fever, chills, arthralgia, myalgia, facial flushing, facial edema, vomiting, weakness, shortness of breath, hypotension, syncope, chest tightness, or angina. These reactions can occur immediately following or up to 24 hours after administration of Kyprolis. Administer dexamethasone prior to Kyprolis to reduce the incidence and severity 12 of infusion reactions. Inform patients of the risk and of symptoms and to contact a physician immediately if symptoms of an infusion reaction occur.\nThrombocytopenia:\nKyprolis causes thrombocytopenia with platelet nadirs observed between Day 8 and Day 15 of each 28-day cycle with recovery to baseline platelet count usually by the start of the next cycle. Thrombocytopenia was reported in approximately 40% of patients in clinical trials with Kyprolis. Monitor platelet counts frequently during treatment with Kyprolis. Reduce or withhold dose as appropriate.\nHepatic Toxicity and Hepatic Failure:\nCases of hepatic failure, including fatal cases, have been reported ( Thrombotic Thrombocytopenic Purpura/Hemolytic Uremic Syndrome:\nCases of thrombotic thrombocytopenic purpura/hemolytic uremic syndrome (TTP/HUS) including fatal outcome have been reported in patients who received Kyprolis. Monitor for signs and symptoms of TTP/HUS. If the diagnosis is suspected, stop Kyprolis and evaluate. If the diagnosis of TTP/HUS is excluded, Kyprolis may be restarted. The safety of reinitiating Kyprolis therapy in patients previously experiencing TTP/HUS is not known.\nPosterior Reversible Encephalopathy Syndrome (PRES):\nCases of PRES have been reported in patients receiving Kyprolis. Posterior reversible encephalopathy syndrome (PRES), formerly termed Reversible Posterior Leukoencephalopathy Syndrome (RPLS), is a neurological disorder which can present with seizure, headache, lethargy, confusion, blindness, altered consciousness, and other visual and neurological disturbances, along with hypertension, and the diagnosis is confirmed by neuro-radiological imaging (MRI). Discontinue Kyprolis if PRES is suspected and evaluate. The safety of reinitiating Kyprolis therapy in patients previously experiencing PRES is not known.\nEmbryo-fetal Toxicity:\nKyprolis can cause fetal harm when administered to a pregnant woman based on its mechanism of action and findings in animals. There are no adequate and well-controlled studies in pregnant women using Kyprolis. Kyprolis caused embryo-fetal toxicity in pregnant rabbits at doses that were lower than in patients receiving the recommended dose. Females of reproductive potential should be advised to avoid becoming pregnant while being treated with Kyprolis. If this drug is used during pregnancy, or if the patient becomes pregnant while taking this drug, the patient should be apprised of the potential hazard to the fetus.\nADVERSE REACTIONS\nThe most common adverse events occurring in at least 20% of patients treated with Kyprolis in monotherapy trials: anemia, fatigue, thrombocytopenia, nausea, pyrexia, decreased platelets, dyspnea, diarrhea, decreased lymphocyte, headache, decreased hemoglobin, cough, edema peripheral.\nThe most common adverse events occurring in at least 20% of patients treated with Kyprolis in the combination therapy trial: decreased lymphocytes, decreased absolute neutrophil count, decreased phosphorus, anemia, neutropenia, decreased total white blood cell count, decreased platelets, diarrhea, fatigue, thrombocytopenia, pyrexia, muscle spasm, cough, upper respiratory tract infection, decreased hemoglobin, hypokalemia.\nUSE IN SPECIFIC POPULATIONS\nPatients on dialysis: Administer Kyprolis after the dialysis procedure.\nPOST-MARKETING EXPERIENCE\nThe following adverse reactions were reported in the post-marketing experience: dehydration, thrombotic thrombocytopenic purpura/hemolytic uremic syndrome (TTP/HUS), tumor lysis syndrome including fatal outcomes, and posterior reversible encephalopathy syndrome (PRES). Because these reactions are reported voluntarily from a population of uncertain size, it is not always possible to reliably estimate their frequency or establish a causal relationship to drug exposure.\nFull prescribing information is available at www.kyprolis.com .\nAbout BLINCYTO ® (blinatumomab)\nBLINCYTO ® (blinatumomab) is the first bispecific CD19-directed CD3 T cell engager (BiTE ® ) antibody construct product, and the first single-agent immunotherapy to be approved by the U.S. Food and Drug Administration (FDA) for the treatment of patients with Philadelphia chromosome-negative (Ph-) relapsed or refractory B-cell precursor acute lymphoblastic leukemia (ALL), a rare and rapidly progressing cancer of the blood and bone marrow. 1,2 Prior to approval, BLINCYTO was granted breakthrough therapy and priority review designations by the FDA. BLINCYTO has a BOXED WARNING in its product label regarding Cytokine Release Syndrome (CRS) and Neurological Toxicities. (Please see Important Safety Information below).\nAbout BiTE ® Technology\nBispecific T cell engager (BiTE ® ) antibody constructs are a type of immunotherapy being investigated for fighting cancer by helping the body's immune system to detect and target malignant cells. The modified antibodies are designed to engage two different targets simultaneously, thereby juxtaposing T cells (a type of white blood cell capable of killing other cells perceived as threats) to cancer cells. BiTE ® antibody constructs help place the T cells within reach of the targeted cell, with the intent of allowing T cells to inject toxins and trigger the cancer cell to die (apoptosis). BiTE ® antibody constructs are currently being investigated for their potential to treat a wide variety of cancers. For more information, visit www.biteantibodies.com .\nImportant U.S. Product Information\nBLINCYTO ® is indicated for the treatment of Philadelphia chromosome-negative relapsed or refractory B-cell precursor acute lymphoblastic leukemia (ALL).\nThis indication is approved under accelerated approval. Continued approval for this indication may be contingent upon verification of clinical benefit in subsequent trials.\nIMPORTANT SAFETY INFORMATION\nWARNING: CYTOKINE RELEASE SYNDROME and NEUROLOGICAL TOXICITIES\nCytokine Release Syndrome (CRS), which may be life-threatening or fatal, occurred in patients receiving BLINCYTO ® . Interrupt or discontinue BLINCYTO ® as recommended. Neurological toxicities, which may be severe, life-threatening or fatal, occurred in patients receiving BLINCYTO ® . Interrupt or discontinue BLINCYTO ® as recommended. Contraindications\nBLINCYTO ® is contraindicated in patients with a known hypersensitivity to blinatumomab or to any component of the product formulation.\nWarnings and Precautions\nCytokine Release Syndrome (CRS): Life-threatening or fatal CRS occurred in patients receiving BLINCYTO ® . Infusion reactions have occurred and may be clinically indistinguishable from manifestations of CRS. Closely monitor patients for signs and symptoms of serious events such as pyrexia, headache, nausea, asthenia, hypotension, increased alanine aminotransferase (ALT), increased aspartate aminotransferase (AST), increased total bilirubin (TBILI), disseminated intravascular coagulation (DIC), capillary leak syndrome (CLS), and hemophagocytic lymphohistiocytosis/macrophage activation syndrome (HLH/MAS). Interrupt or discontinue BLINCYTO ® as outlined in the Prescribing Information (PI). Neurological Toxicities: Approximately 50% of patients receiving BLINCYTO ® in clinical trials experienced neurological toxicities. Severe, life-threatening, or fatal neurological toxicities occurred in approximately 15% of patients, including encephalopathy, convulsions, speech disorders, disturbances in consciousness, confusion and disorientation, and coordination and balance disorders. The median time to onset of any neurological toxicity was 7 days. Monitor patients for signs or symptoms and interrupt or discontinue BLINCYTO ® as outlined in the PI. Infections: Approximately 25% of patients receiving BLINCYTO ® experienced serious infections, some of which were life-threatening or fatal. Administer prophylactic antibiotics and employ surveillance testing as appropriate during treatment. Monitor patients for signs or symptoms of infection and treat appropriately, including interruption or discontinuation of BLINCYTO ® as needed. Tumor Lysis Syndrome (TLS): Life-threatening or fatal TLS has been observed. Preventive measures, including pretreatment nontoxic cytoreduction and on treatment hydration, should be used during BLINCYTO ® treatment. Monitor patients for signs and symptoms of TLS and interrupt or discontinue BLINCYTO ® as needed to manage these events. Neutropenia and Febrile Neutropenia, including life-threatening cases, have been observed. Monitor appropriate laboratory parameters during BLINCYTO ® infusion and interrupt BLINCYTO ® if prolonged neutropenia occurs. Effects on Ability to Drive and Use Machines: Due to the possibility of neurological events, including seizures, patients receiving BLINCYTO ® are at risk for loss of consciousness, and should be advised against driving and engaging in hazardous occupations or activities such as operating heavy or potentially dangerous machinery while BLINCYTO ® is being administered. Elevated Liver Enzymes: Transient elevations in liver enzymes are associated with BLINCYTO ® treatment. The majority of these events were observed in the setting of CRS. The median time to onset was 15 days. Grade 3 or greater elevations in liver enzymes occurred in 6% of patients outside the setting of CRS and resulted in treatment discontinuation in less than 1% of patients. Monitor ALT, AST, gamma-glutamyl transferase (GGT), and TBILI prior to the start of and during BLINCYTO ® treatment. BLINCYTO ® treatment should be interrupted if transaminases rise to > 5 times the upper limit of normal (ULN) or if TBILI rises to > 3 times ULN. Leukoencephalopathy: Although the clinical significance is unknown, cranial magnetic resonance imaging (MRI) changes showing leukoencephalopathy have been observed in patients receiving BLINCYTO ® , especially in patients previously treated with cranial irradiation and anti-leukemic chemotherapy. Preparation and administration errors have occurred. Follow instructions for preparation (including admixing) and administration in the PI strictly to minimize medication errors (including underdose and overdose). Adverse Events\nThe most commonly reported adverse reactions (≥ 20%) in clinical trials were pyrexia (62%), headache (36%), peripheral edema (26%), febrile neutropenia (26%), nausea (25%), hypokalemia (23%), rash (21%), tremor (20%) and constipation (20%). Serious adverse reactions were reported in 65% of patients. The most common serious adverse reactions (≥ 2%) included febrile neutropenia, pyrexia, pneumonia, sepsis, neutropenia, device-related infection, tremor, encephalopathy, infection, overdose, confusion, Staphylococcal bacteremia, and headache. Dosage and Administration Guidelines\nBLINCYTO ® is administered as a continuous intravenous infusion at a constant flow rate using an infusion pump which should be programmable, lockable, non-elastomeric, and have an alarm. It is very important that the instructions for preparation (including admixing) and administration provided in the full Prescribing Information are strictly followed to minimize medication errors (including underdose and overdose). Please see full Prescribing Information and medication guide for BLINCYTO ® at www.BLINCYTO.com .\nAbout AMG 330\nAMG 330 is a novel CD33/CD3 BiTE ® antibody developed to recruit T cells to recognize and kill CD33 expressing acute myeloid leukemia (AML) target cells.\nAbout Amgen\nAmgen is committed to unlocking the potential of biology for patients suffering from serious illnesses by discovering, developing, manufacturing and delivering innovative human therapeutics. This approach begins by using tools like advanced human genetics to unravel the complexities of disease and understand the fundamentals of human biology.\nAmgen focuses on areas of high unmet medical need and leverages its biologics manufacturing expertise to strive for solutions that improve health outcomes and dramatically improve people's lives. A biotechnology pioneer since 1980, Amgen has grown to be one of the world's leading independent biotechnology companies, has reached millions of patients around the world and is developing a pipeline of medicines with breakaway potential.\nFor more information, visit www.amgen.com and follow us on www.twitter.com/amgen .\nAmgen Forward-Looking Statements\nThis news release contains forward-looking statements that are based on the current expectations and beliefs of Amgen Inc. and its subsidiaries (Amgen) and are subject to a number of risks, uncertainties and assumptions that could cause actual results to differ materially from those described. All statements, other than statements of historical fact, are statements that could be deemed forward-looking statements, including estimates of revenues, operating margins, capital expenditures, cash, other financial metrics, expected legal, arbitration, political, regulatory or clinical results or practices, customer and prescriber patterns or practices, reimbursement activities and outcomes and other such estimates and results. Forward-looking statements involve significant risks and uncertainties, including those discussed below and more fully described in the Securities and Exchange Commission (SEC) reports filed by Amgen Inc., including Amgen Inc.'s most recent annual report on Form 10-K and any subsequent periodic reports on Form 10-Q and Form 8-K. Please refer to Amgen Inc.'s most recent Forms 10-K, 10-Q and 8-K for additional information on the uncertainties and risk factors related to Amgen's business. Unless otherwise noted, Amgen is providing this information as of Sept. 16, 2015, and expressly disclaims any duty to update information contained in this news release.\nNo forward-looking statement can be guaranteed and actual results may differ materially from those Amgen projects. Discovery or identification of new product candidates or development of new indications for existing products cannot be guaranteed and movement from concept to product is uncertain; consequently, there can be no guarantee that any particular product candidate or development of a new indication for an existing product will be successful and become a commercial product. Further, preclinical results do not guarantee safe and effective performance of product candidates in humans. The complexity of the human body cannot be perfectly, or sometimes, even adequately modeled by computer or cell culture systems or animal models. The length of time that it takes for Amgen and its partners to complete clinical trials and obtain regulatory approval for product marketing has in the past varied and Amgen expects similar variability in the future. Amgen develops product candidates internally and through licensing collaborations, partnerships and joint ventures. Product candidates that are derived from relationships may be subject to disputes between the parties or may prove to be not as effective or as safe as Amgen may have believed at the time of entering into such relationship. Also, Amgen or others could identify safety, side effects or manufacturing problems with Amgen's products after they are on the market. Amgen's business may be impacted by government investigations, litigation and product liability claims. If Amgen fails to meet the compliance obligations in the corporate integrity agreement between Amgen and the U.S. government, Amgen could become subject to significant sanctions. Amgen depends on third parties for a significant portion of its manufacturing capacity for the supply of certain of its current and future products and limits on supply may constrain sales of certain of its current products and product candidate development.\nIn addition, sales of Amgen's products are affected by the reimbursement policies imposed by third-party payers, including governments, private insurance plans and managed care providers and may be affected by regulatory, clinical and guideline developments and domestic and international trends toward managed care and healthcare cost containment as well as U.S. legislation affecting pharmaceutical pricing and reimbursement. Government and others' regulations and reimbursement policies may affect the development, usage and pricing of Amgen's products. In addition, Amgen competes with other companies with respect to some of its marketed products as well as for the discovery and development of new products. Amgen believes that some of its newer products, product candidates or new indications for existing products, may face competition when and as they are approved and marketed. Amgen's products may compete against products that have lower prices, established reimbursement, superior performance, are easier to administer, or that are otherwise competitive with its products. In addition, while Amgen and its partners routinely obtain patents for their products and technology, the protection of Amgen's products offered by patents and patent applications may be challenged, invalidated or circumvented by its competitors and there can be no guarantee of Amgen's or its partners' ability to obtain or maintain patent protection for Amgen's products or product candidates. Amgen cannot guarantee that it will be able to produce commercially successful products or maintain the commercial success of its existing products. Amgen's stock price may be affected by actual or perceived market opportunity, competitive position and success or failure of its products or product candidates. Further, the discovery of significant problems with a product similar to one of Amgen's products that implicate an entire class of products could have a material adverse effect on sales of the affected products and on Amgen's business and results of operations. Amgen's efforts to integrate the operations of companies it has acquired may not be successful. Amgen may experience difficulties, delays or unexpected costs and not achieve anticipated cost savings from its ongoing restructuring plan. Amgen's business performance could affect or limit the ability of Amgen's Board of Directors to declare a dividend or their ability to pay a dividend or repurchase Amgen common stock.\nThe scientific information discussed in this news release related to Amgen's product candidates is preliminary and investigative. Such product candidates are not approved by the U.S. Food and Drug Administration (FDA), and no conclusions can or should be drawn regarding the safety or effectiveness of the product candidates.\nXencor Forward-Looking Statements\nStatements contained in this press release regarding matters that are not historical facts are forward-looking statements within the meaning of applicable securities laws, including the quotation from Xencor's officers and any expectations relating to its business, research and development programs, including the XmAb bispecific antibody technology, partnering efforts or its capital requirements. Such statements involve known and unknown risks, uncertainties and other factors that may cause actual results, performance or achievements and the timing of events to be materially different from those implied by such statements, and therefore these statements should not be read as guarantees of future performance or results. Such risks include, without limitation, the risks associated with the process of discovering, developing, manufacturing and commercializing drugs that are safe and effective for use as human therapeutics and other risks described in Xencor's public securities filings. All forward-looking statements are based on Xencor's current information and belief as well as assumptions made by Xencor. Readers are cautioned not to place undue reliance on such statements and Xencor disclaims any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.\nCONTACT: Amgen, Thousand Oaks\nKristen Davis , 805-447-3008 (media)\nKristen Neese , 805-313-8267 (media)\nArvind Sood , 805-447-1060 (investors)\nCONTACT: Xencor, Monrovia\nJohn Kuch , 626-737-8013 (investors)\nJason I. Spark , 619-849-6005 Canale Communications for Xencor (media)\nReferences\n1 Mayo Clinic. \"Acute lymphocytic leukemia.\" Available at: http://www.mayoclinic.org/diseases-conditions/acute-lymphocytic-leukemia/basics/definition/con-20042915 Accessed on July 15, 2015.\n2 BLINCYTO ® US Prescribing Information.\nLogo - http://photos.prnewswire.com/prnh/20081015/AMGENLOGO\nLogo - http://photos.prnewswire.com/prnh/20110105/XENCORLOGO\n releases/amgen-and-xencor-announce-strategic-collaboration-in-cancer-immunotherapy-and-inflammation-300143894.html\nSOURCE Amgen", "external_links": ["http://photos.prnewswire.com/prnvar/20081015/AMGENLOGO", "http://wwwext.amgen.com/media/media_pr_detail.jsp?releaseID=2054439", "http://wwwext.amgen.com/media/media_pr_detail.jsp?year=2015&releaseID=2054587", "http://www.blincyto.com/", "http://wwwext.amgen.com/media/media_pr_detail.jsp?year=2015&releaseID=2006998", "http://www.prnewswire.com/news-releases/amgen-and-xencor-announce-strategic-collaboration-in-cancer-immunotherapy-and-inflammation-300143894.html", "http://photos.prnewswire.com/prnh/20081015/AMGENLOGO", "http://photos.prnewswire.com/prnh/20110105/XENCORLOGO", "http://www.twitter.com/amgen", "http://www.xencor.com/", "http://www.mayoclinic.org/diseases-conditions/acute-lymphocytic-leukemia/basics/definition/con-20042915", "http://photos.prnewswire.com/prnvar/20110105/XENCORLOGO", "http://www.amgen.com/", "http://www.kyprolis.com/", "http://www.biteantibodies.com/", "http://wwwext.amgen.com/media/media_pr_detail.jsp?year=2015&releaseID=2002967"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-10-11T21:51:57.770+03:00", "highlightTitle": ""}