{"organizations": [], "uuid": "12249e3269183d789fc82a1dd435807a9d7054ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "timesofindia.indiatimes.com", "main_image": "http://timesofindia.indiatimes.com/photo/49285102.cms", "site_section": "http://timesofindia.indiatimes.com/tech/articlelist/13357270.cms", "section_title": "Technology News | Software, Internet, Hardware &amp; ITES News – InfoTech", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Novak-Djokovic-says-no-sacrifice-no-Slams-for-Chinese-men/articleshow/49285078.cms", "country": "IL", "title": "Novak Djokovic says no sacrifice, no Slams for Chinese men", "performance_score": 0, "site": "indiatimes.com", "participants_count": 2, "title_full": "Novak Djokovic says no sacrifice, no Slams for Chinese men - The Times of India", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T20:48:00.000+03:00", "replies_count": 1, "uuid": "8fdb9e28deb487525a03c33a8b0a3dd2ba9f7da9"}, "author": "timesofindia.indiatimes.com", "url": "http://timesofindia.indiatimes.com/sports/tennis/top-stories/Novak-Djokovic-says-no-sacrifice-no-Slams-for-Chinese-men/articleshow/49285078.cms#post-0", "ord_in_thread": 0, "title": "Novak Djokovic says no sacrifice, no Slams for Chinese men", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BEIJING: Novak Djokovic said China's male tennis players can overcome their shortcomings and start making an impact on the sport -- but only with commitment, sacrifice and year-round dedication.\nThe world number one said China's men needed to start following the tennis circuit around the world, with its different surfaces and conditions, if they want to succeed.\nThe 10-time Grand Slam-winner was speaking at the China Open, where he easily beat home hope Zhang Ze for his 26th straight win at the tournament.\n\"I would assume that my opponent today is playing most of his Challenger-level tournaments around Asia, which is good in a way, but he also needs to travel around the world, play on clay, hard court, grass,\" Djokovic said.\n\"It's probably one of the longest seasons of any sport, 10, 11 months out of 12. If you want to be at a higher level, say top 50, you need to play well throughout the entire year, kind of dedicate your life to that.\n\"It's a question of commitment, sacrifice. It's a question also of quality of the practice and overall your career, how much quality you're putting into that, who you're surrounded with. There's many factors that can play an important role of success.\"\nWomen's player Li Na retired with two Grand Slam singles titles but no Chinese man has even won a main-draw match at a major tournament. Zhang, China's current male number one, is ranked at 219 in the world.\nDjokovic said China should have no problem attracting coaching talent, but that it would take a long-term, systematic approach to develop champions.\n\"It's not something that can happen overnight. You need to invest in a systematic planning and development of the men's tennis. It all starts from a very young age, the way they approach tennis, they approach life,\" he said.\n\"Of course, the fact that only at this time of the year you're playing in China or Asia, for example, and other than that you have to travel, maybe that's also playing a crucial role in their commitments or dedication to tennis.\"\nSerbia's Djokovic pointed to Japanese world number six Kei Nishikori, who is no giant at 5ft 11ins (1.80m), as an example of how smaller players can still be successful.\n\"I think the height in Asia, the players are shorter, maybe that's one of the reasons why they're not able to, you know, use that kind of potential... like some guys from eastern Europe, they would have a better serve,\" he said.\n\"Yeah, it can be the case. But, again, if you look at Nishikori, he's also not that tall, but he's number (six) of the world. I guess all is possible if you are trying to work with what you have.\n\"Everybody has their advantages and their flaws. You try to work on them and correct the flaws and try to improve yourself. Again, going back to the last question, it's about commitment, how much you really want it.\" Stay updated on the go with Times of India News App. Click here to download it for your device.", "external_links": ["https://play.google.com/store/apps/details?id=com.toi.reader.activities"], "published": "2015-10-09T20:48:00.000+03:00", "crawled": "2015-10-09T12:25:24.130+03:00", "highlightTitle": ""}