{"organizations": [], "uuid": "ef804590e10a633cb72a92ddcd4aa3c1fa732910", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30347246/paycommerce-announces-the-first-open-cross-border-faster-payments-network-for-banks-in-2016", "country": "US", "title": "PayCommerce Announces the First Open Cross-Border Faster Payments Network for Banks in 2016", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "PayCommerce Announces the First Open Cross-Border Faster Payments Network for Banks in 2016 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T13:11:00.000+02:00", "replies_count": 0, "uuid": "ef804590e10a633cb72a92ddcd4aa3c1fa732910"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30347246/paycommerce-announces-the-first-open-cross-border-faster-payments-network-for-banks-in-2016", "ord_in_thread": 0, "title": "PayCommerce Announces the First Open Cross-Border Faster Payments Network for Banks in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The leading cross-border payments, messaging and network provider to launch a faster payments initiative; enabling real-time clearing and same-day settlement.\nLas Vegas, NV (PRWEB) October 26, 2015\nPayCommerce today announced that it is launching a faster payment initiative which will enable the same-day, account-to-account settlement across the globe. The firm will roll-out Phase 1 in late 2016, starting with a pilot program between two major banks in countries that have domestic, faster payment capabilities. Phase 2 of the rollout is scheduled to include seven to nine countries, with the final phase to enable global settlement among all market participants.\nThe PayCommerce technology model will leverage its existing real-time messaging infrastructure integrated with a SaaS-based [centralized] 'Live ledger' for each member on the network. PayCommerce will provide open API interfaces for collaboration between members' systems and its network.\nAbdul Naushad, CEO and founder of PayCommerce, explains, \"We are excited to be the first to introduce the technology infrastructure and network which will enable global faster payments for our members. We consistently develop innovative solutions to give our members a competitive edge in the marketplace. In addition to our existing cross-border disbursements and collections solutions, our members need both a rich, accurate messaging infrastructure and a faster payments imperative. This is a game-changing innovation in the payments industry.\"\nAbout PayCommerce\nPayCommerce is the fastest-growing cross-border, open payments network which connects over 80 correspondent banks and acquiring institutions in 72+ countries and enables payments, collections and settlement in 80+ currencies. PayCommerce is the only managed, open cross-border payments network that enables both disbursements and collections transactions through a single point of connectivity for members. Members include: banks, financial institutions, global corporates and alternate channel providers. It is an open network where eligible institutions can join and there are no up-front costs.\nHeadquartered in Edison, NJ, the firm has branches across 4 continents with employees strategically placed around the globe to support customers. Its vision is to create the largest correspondent bank network that enables faster payments for disbursements and collections globally. For more information on the company, please visit http://www.paycommerce.com .\nMedia Contacts:\nKaren Morgan\nkmorgan(at)paycommerce(dot)com\n917-921-8685\n //www.prweb.com/releases/2015/10/prweb13037304.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13037304.htm"], "published": "2015-10-26T13:11:00.000+02:00", "crawled": "2015-10-26T12:20:11.900+02:00", "highlightTitle": ""}