{"organizations": [], "uuid": "5448b5da7aaa542d623dae993aa8ae27815f8839", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/review-optoma-nuforce-be6-bluetooth-earphones-8.JPG?fit=max&h=594&rect=0%2C171%2C1619%2C911&w=1060&s=dfcf9bf05adb5365e0c5d2e28f06fe23", "site_section": "http://feeds.feedblitz.com/Gizmag", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/review-optoma-nuforce-be6-bluetooth-earphones/39709/", "country": "US", "title": "Review: Optoma NuForce BE6 Bluetooth earphones", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "Review: Optoma NuForce BE6 Bluetooth earphones", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:31:00.000+03:00", "replies_count": 0, "uuid": "5448b5da7aaa542d623dae993aa8ae27815f8839"}, "author": "Paul Ridden", "url": "http://www.gizmag.com/review-optoma-nuforce-be6-bluetooth-earphones/39709/", "ord_in_thread": 0, "title": "Review: Optoma NuForce BE6 Bluetooth earphones", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (15 images) \nOptoma has today released the BE6 earphones, its fourth since acquiring the NuForce brand late last year, and its first wireless models. The stylish bullets are reported smaller than Bluetooth market leaders and are being aimed squarely at mobile music lovers with an ear for quality. Gizmag was sent a pre-release pair for review. \nIt really wasn't too long ago that those wanting to ditch the dangling cables to listen to music on the move had to make do with serious dips in sound quality, constant background hiss, and annoying pops and dropouts. As wireless technology improved and the default SBC codec started to get nudged out by more widespread adoption of aptX and AAC, so the annoying noise began to clear and the words quality and Bluetooth started to be uttered in the same breath. With the release of its new NuForce BE6 in-ear headphones, Optima is promising to deliver the kind of audio quality over Bluetooth that was previously the exclusive domain of wired-for-sound audioholics. \nThe BE6 earphones use a \"state of the art\" Bluetooth 4.0+EDR receiver, with support for both aptX and AAC audio technologies. This heady combination should result in top notch streaming sound quality from most modern source devices over a wireless range of up to 30 m (100 ft). \nThough touted as smaller than other leading wireless earphones, the Optoma NuForce BE6 in-ear headphones are still quite chunky monkeys. Each housing measures 27.2 mm (1.07 in) nose to tail (minus the silicone tip) and 13 mm (0.51 in) in diameter at its thickest stretch, and the whole shebang – both ear pieces, the cable, medium silicone tips and stabilizers – weighs just 17 g (0.6 oz). \nWithin the cool and stylish machined aluminum housings are brand new 10 mm dynamic drivers, with 95 dB sensitivity, 20 ohm impedance and a frequency range of 20 Hz to 20 kHz. \nThe inline remote hangs to the right, and is used to power on the BE6 earphones, put them into Bluetooth discovery mode, control playback, and take calls. It also facilitates communication with smartphone-based virtual assistants like Siri. \nPairing was surprise-free and straightforward for all sources devices tested, which included iOS and Android smart devices, laptops and computers. The only slightly awkward point being that discovery mode can only be activated from a powered off state, so you have to switch them off and on again with a long press of the power button before they're ready for pairing. \nThe remote is also home to a microphone with -42 dB sensitivity and, though we found the audio on test calls over Skype via a laptop and on a smartphone to be received loud and clear, in both cases signal breakup, crackles and pops were reported at the other end. \nThe remote contains a cylindrical 3.7 V/80 mAh Li-ion battery. Optoma claims up to 5.5 hours of up time between charges, though we found that continuous playback at comfortable volume levels yielded a little over 5 hours for every 2.5 hours on charge. The earphones will power off automatically after 3 minutes of inactivity. \nTwo quick-fire beeps sound periodically during playback to announce that it might be a good idea to start looking for a wall outlet, but the LED can be consulted for a rough estimate of remaining battery life at any time by simultaneously pressing all three buttons. Two flashes indicate a low battery, three for 50 percent and four or five for full. If plugged in users have enabled voice prompts (by pressing the power and volume up buttons at the same time), battery life information will be delivered through the drivers in a human voice when the three buttons are pressed. \nOptoma says that the supplied proprietary silicone tips have been specifically designed for a more balanced and comfortable fit, though two pairs of (sweat- and moisture-resistant) Comply foam tips are also included for a more secure fit. \nOn the subject of comfort and fit, I found the combination of shortened bud (custom designed with wider flare for optimum sound projection) and thick nozzle meant that I couldn't really push the earphones down into the ear canal like, say, with the T20 cabled in-ear headphones from RHA. This inevitably resulted in the BE6 earphones falling out mid-jog, but, more importantly, meant that the passive isolation from the sounds of the outside world was not particularly effective (which could arguably be a good thing for the safety of plugged in runners . And cyclists). \nSlotting a squishy stabilizer onto each housing helped keep the earphones in position. Optoma recommends a 45 degree from north orientation for each stabilizer, then plugging the BE6s in with a twist to lock in place. However, I found 70-75 degrees suited me better so would advise some positioning experimentation if the suggested fit doesn't work out. \nThe rear of each earpiece is magnetic, so that the earphones can be snapped together around the neck when not in use. A small but useful detail, and quite a relief not to have buds bouncing around when bounding down the street toward the train station. The BE6 earphones are also reported splash-proof, meaning that they don't have to be quickly packed away if you're caught out by a quick shower while out on the morning run. The high points, and the lows \n\"NuForce is all about natural sound,\" Jon Gordem, Senior Director of Product Management, Optoma told us. \"We want to be loyal to the source material and make sure we play audio in the way the artist intended it, regardless of the genre. This means that our sound signature needs to have explosive bass and crystalline highs all in full balance.\" \nSo did the BE6 earphones live up to that ambitious \"cord-less experience without compromising on sound quality\" promise? Well, we found the audio to be as clean as a whistle, with no background hiss or detectable distortion, even at unhealthy volume levels. The in-ears proved pretty good all-round performers, offering lively reproduction across genres such as blues, pop, folk, jazz, classical and rock. \nWe weren't presented with a huge soundstage, but it was by no means cramped. The sound signature treated all audible frequencies and instrumentation well, though in a similar fashion to the company's NE750M wired earphones, the mid-range was boosted slightly so that some guitar solos and vocals got a little more emphasis than expected. This can be a drawback for well-worn favorites, but can also be a bonus for quietly-spoken dialog in movies. While the NE750Ms offer a solid, though by no means booming, lower end performance, the BE6s do not. \nPersonally, I'm not overly fond of bass-heavy tuning, steering clear of Beats-like thunder-punchers in favor of a flatter, neutral response. But I found the BE6 earphones to be a little too lacking in the bass department. It was certainly present in all the tunes listened to during the review, but the arresting thump on tracks like Ain't nothing wrong with that from Robert Randolph just wasn't there, Roger Waters was resigned to a backing member of Pink Floyd rather than a loud and proud key player and Three 6 Mafia didn't come even close to generating the familiar chest-filling warm glow. \nMore bottom end could be brought in by tinkering with source hardware or software settings, of course, but in the interests of fairness and consistency, we opt for a flattened EQ in listening tests. The bottom line \nThe BE6 bullets were feather light to wear, but not the most comfortable in-ears we've ever plugged in. The flat cable is just over half a meter from cable relief to boxy relief (around 22 inches), a nice length. There was little physical noise when it was handled or it brushed against clothing while running, but taps and scrapes on the remote did cut through the tunes. \nThe battery fell just short of the claimed 5.5 hours during review testing, managing over 5 hours of continuous playback – though you might get seven, eight or more hour long sessions at the gym before needing to break out the supplied USB cable and locate a power source. \nThe wireless range of up to 30 m or so meant that the source player could be left on the patio table while wandering around the garden or in the kit bag when jumping from machine to machine at the gym. Streamed audio came through clean, clear and lively, let down only by a somewhat lackluster bass presence. \nThe Optoma NuForce BE6 Bluetooth earphones are available from today at a suggested retail price of US$129. We were sent gray earphones for review, but they're also available in gold.", "external_links": [], "published": "2015-10-05T16:31:00.000+03:00", "crawled": "2015-10-05T16:43:11.548+03:00", "highlightTitle": ""}