{"organizations": [], "uuid": "19d208932800089d4a3f36adfcdeeedc4dfa03b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.ubc.ca", "main_image": "http://news.ubc.ca/wp-content/uploads/2015/10/Ventura-560.jpg", "site_section": "http://news.ubc.ca/category/science-health-technology/feed", "section_title": "UBC News » Science, Health and Technology", "url": "http://news.ubc.ca/2015/10/14/ubc-expert-helps-b-c-prepare-for-an-earthquake/", "country": "CA", "title": "UBC expert helps B.C. prepare for an earthquake", "performance_score": 0, "site": "ubc.ca", "participants_count": 1, "title_full": "UBC expert helps B.C. prepare for an earthquake", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T19:55:00.000+03:00", "replies_count": 0, "uuid": "19d208932800089d4a3f36adfcdeeedc4dfa03b1"}, "author": "Peter Meiszner", "url": "http://news.ubc.ca/2015/10/14/ubc-expert-helps-b-c-prepare-for-an-earthquake/", "ord_in_thread": 0, "title": "UBC expert helps B.C. prepare for an earthquake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UBC expert helps B.C. prepare for an earthquake October 14, 2015 \nOctober 15 is officially ShakeOut BC Day, and more than 750,000 British Columbians are expected to participate in this year’s drill. In this Q&A, UBC earthquake safety expert Carlos Ventura talks about the nature of earthquakes and what’s being done to ensure that the buildings where we live, study and work are earthquake-ready. \nThere’s a lot of talk about B.C. being overdue for the Big One: an earthquake of 9.0 magnitude or greater. Is the province ready for a major quake? \nIt’s important to understand that it’s not only the magnitude of the earthquake that determines its impact. Smaller earthquakes, if they occur near urban areas, can cause significant damage. \nThat said, the province is more prepared for an earthquake in the sense that government, scientists, educators, and the news media have been actively spreading safety awareness. \nEveryone should know the drill by heart: drop, cover and hold on. Recognize quickly that it is an earthquake and don’t panic. Hide under a sturdy table or desk, or crouch near an inside corner of the building. Stay there until the shaking stops. Many earthquake-related injuries in North America are due to falling objects, not buildings collapsing. Once the shaking has stopped, leave your house or building if you can do so safely, and grab your emergency kit if you have one. \nHow important are emergency kits? What’s in yours? \nBecause an earthquake can affect a wide region, you could lose power, water, heat and food for a period of time. An emergency kit will help you stay warm and treat minor injuries. \nMy survival kit at home and in the office contains water, dried food, a blanket, a hand radio, and some simple medical supplies. Some people think of their camping gear as a survival kit. \nThere’s concern that not all B.C. schools are earthquake-ready. \nVancouver has made great strides, but for a number of reasons, a significant number of school buildings in the city are still in the high-risk category. However, many school districts outside Vancouver have done or are completing their seismic upgrades. Earthquake shelters have also been identified in many schools, such as gyms or other large spaces that are designed to perform very well and stay operational during an earthquake. \nFor new buildings, seismic readiness is not as big an issue because they are designed to comply with building standards, which specify the amount of shaking that a building must be able to withstand. But most of the older buildings, especially those built before the 1970s, need to be retrofitted to become compliant. \nYou say it’s impossible to accurately predict when an earthquake will happen. Does B.C. have an early warning system at least? \nYes. At the Earthquake Engineering Research Facility at UBC, we’re working on an early warning system consisting of sensors installed at many different locations to detect and measure the different waves generated by an earthquake: the P (primary) waves, the S (secondary) waves and the surface waves, which are more damaging. \nDepending on the waves’ characteristics, the system will generate an alarm, and people will have a few seconds or almost a minute to take shelter, depending on their distance from the epicentre of the earthquake. A few seconds’ warning could be enough to save your life. \nThis early warning system was tested in a pilot project with Vancouver’s Catholic schools and is currently being rolled out across the Lower Mainland. Eventually we hope to add Vancouver Island into this warning system as well. \nWe’re also working with the Ministry of Transportation and Infrastructure to install sensors near highways and other public structures. The more sensors there are, the more warning we’ll get and the safer we’ll be. Imagine being able to shut down trains quickly during an earthquake, postpone surgery, or stop machinery. An early warning system will allow us to do that and minimize damage. \nUBC, the City of Vancouver, and the Vancouver Public Library are holding Earthquake Day on October 15 to raise earthquake awareness. This community outreach event complements ShakeOut BC Day and is one of UBC’s many Centennial initiatives.", "external_links": [], "published": "2015-10-14T19:55:00.000+03:00", "crawled": "2015-10-15T15:12:09.946+03:00", "highlightTitle": ""}