{"organizations": ["Commvault Data Platform", "Hitachi Data Systems", "Commvault", "Hitachi", "Hitachi Data Systems Commvault Brings Innovations in Data Replication", "Hitachi Universal Replication"], "uuid": "d65b8908ab8e4880b6dcd79c42d8408ca0e27118", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "science-technology.news-articles.net", "main_image": "", "site_section": "http://science-technology.news-articles.net/content/rss.php", "section_title": "Science and Technology @ News Articles Network", "url": "http://science-technology.news-articles.net/content/commvault-brings-innovations-data-replication-customers-launch-the-platform-integration-hitachi-systems.xhtml", "country": "US", "title": "Commvault Brings Innovations in Data Replication to Customers with Launch of the Commvault Data Platform and Integration with Hitachi Data Systems", "performance_score": 0, "site": "news-articles.net", "participants_count": 0, "title_full": "Commvault Brings Innovations in Data Replication to Customers with Launch of the Commvault Data Platform and Integration with Hitachi Data Systems", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:48:00.000+03:00", "replies_count": 0, "uuid": "d65b8908ab8e4880b6dcd79c42d8408ca0e27118"}, "author": "", "url": "http://science-technology.news-articles.net/content/commvault-brings-innovations-data-replication-customers-launch-the-platform-integration-hitachi-systems.xhtml", "ord_in_thread": 0, "title": "Commvault Brings Innovations in Data Replication to Customers with Launch of the Commvault Data Platform and Integration with Hitachi Data Systems", "locations": ["United States", "Tinton Falls", "New Jersey", "N.J."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Commvault", "Don Foster", "Tim Butchart"], "text": "Commvault Brings Innovations in Data Replication to Customers with Launch of the Commvault Data Platform and Integration with Hitachi Data Systems   06:00:12 Commvault Brings Innovations in Data Replication to Customers with Launch of... -- TINTON FALLS, N.J.  Commvault is the leader in enterprise data protection and information management Commvault is the leader in enterprise data protection and information management <-  <- stripped tags -> TINTON FALLS, N.J.   [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCdmJtTnNhV05yUFNkc2FXNXJUMjVEYkdsamF5aDBhR2x6S1NjZ2FISmxaajFjSW1oMGRIQTZMeTkzZDNjdVkyOXRiWFpoZFd4MExtTnZiUzgvZFhSdFgzTnZkWEpqWlQxd2NtVnpjeTF5Wld4bFlYTmxKblYwYlY5dFpXUnBkVzA5YzI5amFXRnNKblYwYlY5allXMXdZV2xuYmoxbFptWnBZMmxsYm5RdGFYUmNJaUJ5Wld3OVhDSnViMlp2Ykd4dmQxd2lJSFJoY21kbGREMWNJbDlpYkdGdWExd2lQanhpUGtOdmJXMTJZWFZzZER3dllqNDhMMkUrfA==]] (NASDAQ: [[UEdFZ2NtVnNQVndpYm05bWIyeHNiM2RjSWlCb2NtVm1QU2RvZEhSd09pOHZjM1IxWkdsdkxUVXVabWx1WVc1amFXRnNZMjl1ZEdWdWRDNWpiMjB2Y0hKdVpYZHpQMUJoWjJVOVVYVnZkR1VtVkdsamEyVnlQVU5XVEZRbklISmxiRDBuYm05bWIyeHNiM2NuSUhSaGNtZGxkRDBuWDJKc1lXNXJKeUIwYVhSc1pUMG5RMVpNVkNjZ2IyNWpiR2xqYXowbmJHbHVhMDl1UTJ4cFkyc29kR2hwY3lrbklISmxiRDBuYm05bWIyeHNiM2NuUGtOV1RGUThMMkUrfA==]]), a global leader in enterprise data protection and information management, today announced new innovations in the Commvault Data Platform to extend hardware array support for replication to joint enterprise customers through integration with Hitachi Data Systems (HDS) enterprise storage arrays. Through the innovation of Commvault's new software, Commvault and HDS can help customers address the evolving challenges of managing data and information in highly changing, fast-paced global business environments. As a result of Commvault's strategic partnership with HDS, the newly launched Commvault Data Platform features IntelliSnap integration with the Hitachi Virtual Storage Platform (VSP) G Series enterprise storage arrays to include Hitachi Universal Replication (HUR). This integration into HDS arrays provides local and integrated remote replicated application aware snapshots across an HDS managed replication architecture, adding in the complex lifecycle of snapshot management across the replication pair into one seamless framework. This approach makes it quicker, easier and more affordable to harness the power of HDS array-based snapshots and active replication, accelerating backup and recovery of applications, systems, virtual machines and data. \"With the continued, rapid growth of data, some customers struggle with meeting service level agreements,\" said Tim Butchart , Vice President Data Protection Sales at Hitachi Data Systems. \"The integration of Hitachi replication technology with Commvault's Data Platform enables us to provide our customers with fast access and recovery not just for data loss events, but also to drive development, test, and analytical queries in their storage arrays. We're excited for this extended partnership and the snapshot and replication management benefits our customers will continue to reap.\" The Commvault Data Platform enables customers to achieve a number of data protection and information management goals within today's compressed budgets, timeframes and resources. Now more than ever, extrapolating more value across information technology assets has become paramount to success and agility in the transforming IT landscape. Snapshot and replication technology has long been identified as the fastest and most efficient way to recover data and applications, particularly when dealing with large and growing data volumes. \"The Commvault Data Platform provides customers with a completely orchestrated solution to manage active Hitachi Unified Replication on HDS Enterprise Storage arrays,\" said Don Foster , Senior Director, Solutions Marketing and Technical Alliances, Commvault. \"As a result, they have access to a complete end-to-end solution for data management, leveraging the advanced abilities of the storage environment and the HDPS/Commvault integration to provide near instant recoverability across the replication framework for any applications stored on the array.\" About the Commvault Data Platform and Solutions Portfolio The eleventh version of Commvault solutions portfolio is uniquely positioned to help customers activate their data by accelerating the transformation from legacy data management to a modern data environment to unlock critical business insight and drive new value from customers' technology investments. The Commvault solutions portfolio is comprised of an industry-leading product offering in the areas of data protection and recovery, cloud, virtualization, archive, and file sync and share that addresses evolving market trends, growth areas, and customer use cases. The Commvault Data Platform is open and standards-based, helping customers better leverage data, improve IT operations, and enabling 3 rd party innovation. About Commvault Commvault is a leading provider of data protection and information management solutions, helping companies worldwide activate their data to drive more value and business insight and to transform modern data environments. With solutions and services delivered directly and through a worldwide network of partners and service providers, Commvault solutions comprise one of the industry's leading portfolios in data protection and recovery, cloud, virtualization, archive, file sync and share. Commvault has earned accolades from customers and third party influencers for its technology vision, innovation, and execution as an independent and trusted expert. Without the distraction of a hardware business or other business agenda, Commvault's sole focus on data management has led to adoption by companies of all sizes, in all industries, and for solutions deployed on premise, across mobile platforms, to and from the cloud, and provided as-a-service. Commvault employs more than 2,000 highly skilled individuals across markets worldwide, is publicly traded on NASDAQ (CVLT), and is headquartered in Tinton Falls, New Jersey in the United States . To learn more about Commvault — and how it can help make your data work for you — visit commvault.com . Resources", "external_links": [], "published": "2015-10-20T16:48:00.000+03:00", "crawled": "2015-10-20T16:33:34.690+03:00", "highlightTitle": ""}