{"organizations": ["NANOG Conference Arbor Networks"], "uuid": "4eb1feced64ebed0e0d0d703c469bd509388b9d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtQXg==", "section_title": "Business Wire Technology: Mobile/Wireless News", "url": "http://www.businesswire.com/news/home/20151005005048/en/Arbor-Networks-Present-DDoS-Bitcoin-Extortion-Campaign", "country": "US", "title": "Arbor Networks to Present on DDoS for Bitcoin Extortion Campaign at 65th NANOG Conference", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Arbor Networks to Present on DDoS for Bitcoin Extortion Campaign at 65th NANOG Conference", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:35:00.000+03:00", "replies_count": 0, "uuid": "4eb1feced64ebed0e0d0d703c469bd509388b9d0"}, "author": "", "url": "http://www.businesswire.com/news/home/20151005005048/en/Arbor-Networks-Present-DDoS-Bitcoin-Extortion-Campaign", "ord_in_thread": 0, "title": "Arbor Networks to Present on DDoS for Bitcoin Extortion Campaign at 65th NANOG Conference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Arbor Networks to Present on DDoS for Bitcoin Extortion Campaign at 65 th NANOG Conference October 05, 2015 06:35 AM Eastern Daylight Time \nBURLINGTON, Mass.-  Arbor Networks Inc. , the security division of NETSCOUT (NASDAQ:NTCT), announced today that Roland Dobbins, principal engineer on Arbor’s Security Engineering & Response team and one of the world’s leading experts on distributed denial-of-service (DDoS) attacks, will speak on the ongoing DDoS for Bitcoin attack campaign at the 65 th North American Network Operators’ Group (NANOG) conference taking place October 5-7, 2015 in Montreal, Canada. \nWho : Roland Dobbins, Arbor Networks \nWhat : An analysis of the ongoing DDoS for Bitcoin (DD4BC) Extortion Campaign \nWhen : Monday, October 5 th , 2015 from 11:15 a.m. – 12:00 p.m. ET \nWhere : 65 th NANOG Conference, Fairmont Queen Elizabeth Hotel, Montreal, Canada. The presentation will also be available via a live webcast . \nPresentation Overview : Your Bitcoins or Your Site: An Analysis of the DDoS for Bitcoin (DD4BC) DDoS Extortion Campaign \nIn this presentation, Roland Dobbins will discuss details of the ongoing DDoS for Bitcoins (DD4BC) DDoS extortion campaign, which has targeted multiple organizations in North America, Europe, Asia, Australia and New Zealand. The attack methodologies, evolution of the attack campaign, and discussion of the nature of the attacker(s) will be covered, along with a discussion of successful DDoS mitigation techniques which have proven effective against these attacks. \nBIO : Roland Dobbins has 30 years of operational experience in the service provider and large enterprise arenas, designing, deploying, operating, securing, maintaining, troubleshooting and defending many of the highest-visibility networks in the world. He is a recognized industry leader in the fields of operational security and network telemetry, and has an extensive background in security product/feature innovation, devising operational security requirements for network infrastructure devices, and protocol design. His focus is on extending the availability, scalability and security of the network infrastructure and the applications/services it enables, with an emphasis on flexible and resilient global service delivery capabilities. \nAGENDA: The full conference agenda is available here . \nNANOG is the premier meeting for network operators in North America. Meeting three times each year, the NANOG conferences provide a forum for information exchange among network operators, engineers, and researchers. The meetings include individual and panel presentations, tutorial sessions, tracks, and opportunities for networking with industry peers. NANOG attendees include operators from networks of all sizes, enterprise operators, peering coordinators, transport and switching equipment vendors, in addition to network researchers. Attendees will share ideas and interact with leaders in the field of network operations, discuss current operational events and issues, and learn about state-of-the-art operational techniques. \nAbout Arbor Networks \nArbor Networks, the security division of NETSCOUT, helps secure the world’s largest enterprise and service provider networks from DDoS attacks and advanced threats. Arbor is the world’s leading provider of DDoS protection in the enterprise, carrier and mobile market segments, according to Infonetics Research. Arbor’s advanced threat solutions deliver complete network visibility through a combination of packet capture and NetFlow technology, enabling the rapid detection and mitigation of malware and malicious insiders. Arbor also delivers market-leading analytics for dynamic incident response, historical analysis, visualization and forensics. Arbor strives to be a “force multiplier,” making network and security teams the experts. Our goal is to provide a richer picture into networks and more security context - so customers can solve problems faster and reduce the risk to their business. \nTo learn more about Arbor products and services, please visit our website at arbornetworks.com and follow on Twitter @ArborNetworks . Arbor’s research, analysis and insight, together with data from the ATLAS global threat intelligence system, can be found at the ATLAS Threat Portal . \nTrademark Notice: Arbor Networks, the Arbor Networks logo and ATLAS are all trademarks of Arbor Networks, Inc. All other brands may be the trademarks of their respective owners. Contacts", "external_links": [], "published": "2015-10-05T13:35:00.000+03:00", "crawled": "2015-10-05T13:51:59.622+03:00", "highlightTitle": ""}