{"organizations": [], "uuid": "999e1de5bd1938984495e2cf20d35c9236b5aba3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/22/13037928/Voddler.png", "site_section": "http://www.prweb.com/rss2/techsoftware.xml", "section_title": "Technology: Software", "url": "http://www.prweb.com/releases/2015/10/prweb13037928.htm", "country": "US", "title": "Voddler Group Partners VUBIQUITY to Distribute Content in Asia", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Voddler Group Partners with VUBIQUITY to Distribute Content in Asia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "999e1de5bd1938984495e2cf20d35c9236b5aba3"}, "author": "Filippa Hasselstrom | Voddler PR", "url": "http://www.prweb.com/releases/2015/10/prweb13037928.htm", "ord_in_thread": 0, "title": "Voddler Group Partners VUBIQUITY to Distribute Content in Asia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Voddler Group AB, the cloud-streaming innovator, and VUBIQUITY, the leading global provider of premium content services, today entered into a long-term partnership to allow VUBIQUITY to use Voddler's next-generation distribution network. The partnership will enable the delivery of video content to consumers in Asia, particularly in regions with poor or low connectivity. The partnership leverages Voddler’s award-winning proprietary VoddlerNet™, a patented, peer-assisted video delivery solution. VoddlerNet combines controlled peer-to-peer with direct video streaming from the source provider. The result is a unique hybrid streaming solution that greatly expands the reach of streaming video services and enhances the Quality of Experience (QoE), providing a perfect solution for regions with limited and congested networks. VoddlerNet also ensures against network peaks and minimizes the impact of CDN outages, resulting in a more robust and resilient streaming solution. It is easily integrated into customers existing platforms, and supports Linux, Mac, and Windows clients, as well as Android and iOS devices.\nVoddlerNet is specifically optimised for delivering video over the mobile network to handheld devices, turning every customer device into a lightweight self-aware edge server and creating an intelligent swarm of video sharing nodes. The VoddlerNet solution monitors the customer’s connection type and also the device performance, ensuring that the end customers enjoy a seamless, high quality viewing experience. VoddlerNet is DRM agnostic and all communication between the nodes in the swarm is encrypted, making the solution ideal for VOD providers delivering high quality video entertainment anywhere.\nThe partnership will focus on combining the ability of VUBIQUITY to deliver their highly scalable and modular online video platforms with VoddlerNet’s ability to provide dramatically enhanced Quality of Service (QoS) and virtually limitless user scalability into its secure mesh network. Together, the companies will give more consumers the ability to enjoy a better video experience, anywhere, any time.\nThe leading global provider of premium content services, VUBIQUITY works with local service providers, managing everything from content licensing to multiple language subtitling, enabling telecom businesses and others to launch and monetise content services quickly. It provides capabilities for linear and on demand viewing that supports rental, sell-through, ad-supported and subscription business models for multi-screen purposes.\nLicensing content from all the Hollywood studios, large independents, and a wealth of boutique content providers, VUBIQUITY delivers more than 500,000 hours of content annually to more than 109 million households worldwide. It has experienced rapid growth in the emerging markets, including Asia Pacific, the Middle East, and Latin America.\n“The growth of video content consumption globally has surpassed a critical inflection point, where demand is outpacing the ability to deliver great content in a great way,” said Voddler Group’s CEO, Adam H. Lewis. “Video consumers around the world are demanding constant access to premium and original content, with a consistently excellent playback experience.\n“The combination of VUBIQUITY’s Premium Content Services solutions and VoddlerNet brings a whole new paradigm to video streaming and Quality of Service, particularly to mobile viewers in regions with poor or little network infrastructure. VUBIQUITY’s ReelVu and CoreVu solutions perfectly complement VoddlerNet, providing customers with a massively scalable VOD solution from the platform all the way to the end user.”\nLewis continues, “Our commitment to deliver exceptional media experiences to consumers in Asia while aggressively reducing our customers’ video delivery costs is very much enhanced by this partnership.”\n“VUBIQUITY is very excited to welcome Voddler to its consortium of partners. We are all time-poor and increasingly want to watch our favourite TV shows and films where and when we want. This partnership will empower our service operators to deliver an amazing video experience on any device, at any time,” said Adam Poulter, VUBIQUITY’s EVP & MD for EMEA, LATAM, and Asia Pacific.\n“With more video streamed to mobile devices than ever before, hybrid peer-assisted video delivery networks are becoming critically important,” added David Cody, VUBIQUITY’s Business Development Director for Asia Pacific. “Combining Voddler’s VoddlerNet with VUBIQUITY’s Premium Content Services ensures that high-quality content is seamlessly delivered, regardless of the network used to access content. We are excited to see the experience changing multi-screen video distribution solution created by our two leading innovative companies partnering in the space.”\n####\nTrademarked company and product names are the property of their respective companies.\nAbout Voddler\nBased in Stockholm, Sweden, Voddler Group AB is the creator of the next generation video streaming solution VoddlerNet, an award winning peer-assisted video delivery solution. VoddlerNet, extends our partner’s streaming solutions globally, delivering an unparalleled viewing experience to any Internet-connected device with stunning quality of service at a fraction of today’s streaming cost. VoddlerNet integrates seamlessly with existing streaming solutions to unleash their full potential. VoddlerNet has streamed millions of movies from dozens of content owners, including the Hollywood majors, to millions of users worldwide.\nFor more information, contact:\nFilippa Hasselström, VP of Product Marketing\nfilippa(dot)hasselstrom(at)voddler(dot)com\n+46 708 96 51 02\nAbout VUBIQUITY\nVUBIQUITY is the leading global provider of Premium Content Services. From licensing to delivery, VUBIQUITY offers a full scope of managed services including digital and OTT distribution to every major media provider. The company provides capabilities for linear and on demand viewing that supports rental, sell-through, ad-supported and subscription business models for multiscreen purposes. A global organization, VUBIQUITY utilizes a Content-as-a-Service model to enable cost-effective end-to-end solutions for monetization. VUBIQUITY is a privately held company with primary offices in Los Angeles and London. Visit us at http://www.vubiquity.com and follow us on Twitter @Vubiquity.\nFor more information, contact:\nJordan Greenaway\nRight Angles\njordan(dot)greenaway(at)90degrees(dot)co(dot)uk\n+44 7554 380927", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52dWJpcXVpdHkuY29t"], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T17:09:36.261+03:00", "highlightTitle": ""}