{"organizations": [], "uuid": "f106a5805f3a13d53b8ef3bb730927a9cc8dec89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-15/best-north-american-technology-ipo-leaps-from-tattoos-to-tesla", "country": "US", "title": "Best North American Technology IPO Leaps From Tattoos to Tesla", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Best North American Technology IPO Leaps From Tattoos to Tesla - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T12:01:00.000+03:00", "replies_count": 0, "uuid": "f106a5805f3a13d53b8ef3bb730927a9cc8dec89"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-15/best-north-american-technology-ipo-leaps-from-tattoos-to-tesla", "ord_in_thread": 0, "title": "Best North American Technology IPO Leaps From Tattoos to Tesla", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shopify Inc. Chief Executive Officer Tobi Lutke pulled off North America’s best-performing technology listing this year helping small-time merchants set up online stores. Now he’s aiming beyond wooden iPhone covers and temporary tattoos .\nThe Ottawa-based company, which makes software that helps retailers sell their wares online, has almost doubled in the U.S. since its initial public offering in May. Shopify started out catering to small businesses but is now targeting larger merchants and well-known brands to use its product instead of building and running their own websites. It has already signed up Tesla Motors Inc. and Red Bull GmbH and is aiming for other established brands with millions in sales.\nTobi Lutke\nPhotographer: Jacob Park via Shopify Inc. “We now realize just what an atrocious process people are going through to try to solve their problems in the space,” Lutke said in an interview at the company’s new Waterloo, Ontario office, a former whiskey distillery used by Al Capone during the Prohibition Era.\nShopify has surged 98 percent to $33.64 on the New York Stock Exchange since its IPO, ahead of Fitbit Inc.’s 78 percent gain and Appfolio Inc.’s 58 percent advance among technology IPOs, according to data compiled by Bloomberg through Wednesday’s close. Its performance stands behind only Global Blood Therapeutics Inc. in all North American IPOs this year.\nThe Waterloo office will focus on developing the \"Shopify Plus\" product for big business users, said Lutke, 35, leaning up against a giant boiler in the building’s foyer. “We want it to be its own product that’s clearly defined that’s going to take the enterprise market and put it on its head.”\nAmazon Deal Shopify, the first of a new wave of Canadian technology startups to go public, is working to sign up merchants to monthly subscriptions for its software as it seeks to maintain year-over-year revenue growth of 90 percent in the second quarter. The majority of its 175,000 customers are run by individuals who pay $30 to $200 a month for a website and everything required to facilitate sales, including payment processing, shipping labels and the ability to take payments in-person if they also have a physical store.\nThe company has deals with Twitter Inc., Facebook Inc. and Pinterest Inc. so its customers can sell directly on those social networks with \"buy buttons.\" Its stock surged more than 20 percent last month when Amazon shuttered a competing online store service and signed a deal to send its remaining customers to Shopify. That deal lets Shopify merchants use the e-commerce giant’s warehouses and list their products on Amazon as well as their Shopify store.\nHigh-End Customers\nShopify has some competition for the big-business space, said Ross MacMillan, a New York-based analyst at RBC Capital Markets. The biggest retailers use software from tech giants like Oracle Corp. and SAP SE or build their own custom websites with design firms and in-house developers, he said.\n“Shopify doesn’t really come up in the conversation,” MacMillan said by phone. It doesn’t offer as many services tailored to bigger customers, like helping them run marketing campaigns or letting them post two different versions of a website to see which is more successful, he said.\nShopify Waterloo Office\nPhotographer: Jacob Park via Shopify Inc. Still, the rewards for winning high-end customers are substantial. Demandware Inc., which sells its software through the Internet like Shopify, posted second-quarter revenue of $53.9 million with 295 customers, including Adidas AG and L’Oreal SA. Shopify reported $44.9 million in sales in the quarter. A spokesman for Demandware declined to comment on the potential for more competition from Shopify.\nSnowboard Start The Waterloo office’s 300 employees will be focused on Shopify Plus and building the tools potential customers need, like integration with supply chain management software, Lutke said. He said he is targeting companies that are spending hundreds of thousands of dollars on their own website design and the employees that maintain them.\n“People spend unbelievable amounts of money on these systems which are vastly inferior to what we’re giving them for nine bucks a month,” said Lutke, who founded the company in 2004 because he wanted to start an online snowboard store but couldn’t find the software to set it up.\nForty percent of the world’s top 100 retailers are still building and running their own e-commerce websites, MacMillan said. “They basically have built their own infrastructure, it’s amazing how much of that still exists so there’s a ton of money thrown at this problem,” he said.", "external_links": ["http://grovemade.com/shop/\\", "http://tattly.com/\\"], "published": "2015-10-15T12:01:00.000+03:00", "crawled": "2015-10-15T14:29:17.194+03:00", "highlightTitle": ""}