{"organizations": [], "uuid": "e0c4de689355ec200d00b93258e87a1f1c147f7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150915155959&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10805610/dynasil-announces-linda-zuckerman-ph-d-as-new-ceo-of-xcede-technologies-inc", "country": "US", "title": "Dynasil Announces Linda Zuckerman, Ph.D. as New CEO of Xcede Technologies, Inc.", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "Dynasil Announces Linda Zuckerman, Ph.D. as New CEO of Xcede Technologies, Inc.", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "e0c4de689355ec200d00b93258e87a1f1c147f7f"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10805610/dynasil-announces-linda-zuckerman-ph-d-as-new-ceo-of-xcede-technologies-inc", "ord_in_thread": 0, "title": "Dynasil Announces Linda Zuckerman, Ph.D. as New CEO of Xcede Technologies, Inc.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEWTON, Mass. , Sept. Dynasil Corporation of America (NASDAQ: DYSL) today announced the appointment of Linda Zuckerman , Ph.D. as CEO of Xcede Technologies, Inc., Dynasil's majority owned subsidiary.\nDr. Zuckerman brings to Xcede more than 15 years of biotechnology experience in developing biologics, pharmaceuticals and medical devices from discovery to licensure in both the EU and US. Her expertise and leadership in both early and late stage product development resulted in several US and EU approvals for topical hemostats such as RECOTHROM® and Raplixa® and related medical devices.\nIn 2008, Dr. Zuckerman joined the senior management team at ProFibrix a Seattle /Leiden, NL start-up and assumed the role as President in 2010, overseeing all US- based operations. Prior to joining ProFibrix, Dr. Zuckerman was a director at ZymoGenetics for seven years overseeing preclinical development and a product development lead. She received her Ph.D. in 1995 from University of Chicago and completed a post-doctoral fellowship at University of California San Francisco before joining Genentech in 2000.\n\"I'm thrilled to be working on Xcede's hemostatic patch which will be the foundation to develop products ranging from adjuncts to hemostasis to severe, traumatic bleeding,\" said Dr. Zuckerman.\n\"We are delighted that Linda has joined the Xcede team,\" said Peter Sulick , Chairman and CEO of Dynasil. \"She brings start-up, fundraising and business development expertise to Xcede, as well as extensive experience with EU and US regulatory processes for biologics and medical devices.\"\nAbout Dynasil\nDynasil Corporation of America (NASDAQ: DYSL) develops and manufactures optical detection and analysis technology and components for the homeland security, medical and industrial markets.\nCombining world-class expertise in research and materials science with extensive experience in manufacturing and product development, Dynasil is commercializing products, including dual-mode radiation detection solutions for Homeland Security and commercial applications and sensors for non-destructive testing. Dynasil has an impressive and growing portfolio of issued and pending U.S. patents. The Company is based in Watertown, Massachusetts , with additional operations in Mass., Minn., N.Y., N.J. and the United Kingdom . More information about the Company is available at www.dynasil.com .\nSafe Harbor\nThis news release may contain forward looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements regarding future events and our future results are based on current expectations, estimates, forecasts, and projections and the beliefs and assumptions of our management, including, without limitation, our expectations regarding results of operations, the commercialization of our technology, in particular the Xcede patch, the success of efforts to fund Xcede, positive outcomes of our pre-clinical and planned clinical trials, regulatory approvals and the strength of our intellectual property portfolio. These forward-looking statements may be identified by the use of words such as \"plans\", \"intends,\" \"may,\" \"could,\" \"expect,\" \"estimate,\" \"anticipate,\" \"continue\" or similar terms, though not all forward-looking statements contain such words. The actual results of the future events described in such forward looking statements could differ materially from those stated in such forward looking statements due to a number of important factors. These factors that could cause actual results to differ from those anticipated or predicted include, without limitation, our ability to develop and commercialize the Xcede patch, including obtaining regulatory approvals, the size and growth of the potential markets for our products and our ability to serve those markets, the rate and degree of market acceptance of any of our products, general economic conditions, costs and availability of raw materials and management information systems, our ability to obtain and maintain intellectual property protection for our products, competition, the loss of key management and technical personnel, our ability to obtain timely payment of our invoices to governmental customers, litigation, the effect of governmental regulatory developments, the availability of financing sources, our ability to identify and execute on acquisition opportunities and integrate such acquisitions into our business, and seasonality, as well as the uncertainties set forth in the Company's 2014 Annual Report on Form 10 K, as filed on December 16, 2014 and from time to time in the Company's other filings with the Securities and Exchange Commission. The Company disclaims any intention or obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise. The Company disclaims any intention or obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.\nContacts:\nPatty Kehe\nCorporate Secretary\nDynasil Corporation of America\nPhone: (617) 668-6855\npkehe@dynasil.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/dynasil-announces-linda-zuckerman-phd-as-new-ceo-of-xcede-technologies-inc-300143078.html\nSOURCE Dynasil Corporation of America", "external_links": ["http://www.dynasil.com/", "http://www.prnewswire.com/news-releases/dynasil-announces-linda-zuckerman-phd-as-new-ceo-of-xcede-technologies-inc-300143078.html"], "published": "2015-09-15T03:00:00.000+03:00", "crawled": "2015-10-12T05:17:59.795+03:00", "highlightTitle": ""}