{"organizations": [], "uuid": "5fc87275a1dcf99ec4d4d2b992e2cc83c41bbce0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jobs.ac.uk", "main_image": "http://www.jobs.ac.uk/images/global/jobs_ac_uk-logo-with-strapline.jpg", "site_section": "http://www.jobs.ac.uk/jobs/engineering-and-technology/?format=rss", "section_title": "Engineering and Technology Jobs - jobs.ac.uk", "url": "http://www.jobs.ac.uk/job/AME423/phd-studentship-on-the-development-of-low-cost-pressed-metal-sensors/", "country": "GB", "title": "PhD Studentship on the development of low cost pressed metal sensors", "performance_score": 0, "site": "jobs.ac.uk", "participants_count": 0, "title_full": "PhD Studentship on the development of low cost pressed metal sensors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "5fc87275a1dcf99ec4d4d2b992e2cc83c41bbce0"}, "author": "", "url": "http://www.jobs.ac.uk/job/AME423/phd-studentship-on-the-development-of-low-cost-pressed-metal-sensors/", "ord_in_thread": 0, "title": "PhD Studentship on the development of low cost pressed metal sensors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Closes: 30th November 2015 \nThis is an opportunity to work on a Birmingham City University PhD project supported by C. Brandauer & Co Ltd, one of the largest contract presswork and stampings companies in Europe, who manufacture precision metal components for customers all around the world. \nYou will be working on the design and development of a new range of cost effective sensors, fabricated using Brandauer’s core manufacturing capabilities. You will need to be able to, or have the desire to, work across a broad range of engineering disciplines, including electronics, mechanical and manufacturing engineering. \nWorking closely with manufacturing experts at Brandauer you will study the current market for sensors (Internet of Things), Brandauer’s existing manufacturing technology, sensor design, and associated electronics. You will then be expected to produce working demonstrators. Technically, you will need to have a passion for engineering science, computer simulation (FEA) and practical work. \nIdeally you will have, or be about to receive, a 2.1 or higher, in an engineering or suitable physical science. An appropriate master’s level (merit/distinction) degree will also be considered. There will be opportunities to participate in international conferences and you will be actively encouraged to patent and publish your work. \nA full studentship is available to cover the cost of tuition fees at the UK/EU rate or, in exceptional circumstances, the overseas rate, and a stipend. In the 2015/2016 academic year, the stipend is £14,057. The studentship is available to support three years' full-time study, subject to satisfactory progress. As part of the studentship you will be expected to act as a Graduate Teaching Assistant, supporting teaching within the department for up to six hours per week. \nStudentships are awarded based upon academic excellence, alignment of expertise with the outlined research interests, and potential for future achievement. You are encouraged to informally contact Professor Michael Ward michael.ward@bcu.ac.uk to discuss the project. \nInterviews for shortlisted candidates to be held: 14-18 December 2015. \nStart: February 2016. \nTo apply for this studentship, please follow the link below and go to the ‘How to apply for a PhD’ section of the page.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-14T01:54:31.360+03:00", "highlightTitle": ""}