{"organizations": [], "uuid": "230f37540a1097524136e3e4a9deb09a634375ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1136243/lieberman-software-privileged-identity-management-solution-achieves-scalability-milest", "country": "US", "title": "Lieberman Software Privileged Identity Management Solution Achieves Scalability Milestone With Over 1 Million Managed Endpoints at a Single Deployment", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Lieberman Software Privileged Identity Management Solution Achieves Scalability Milestone With Over 1 Million Managed Endpoints at a Single Deployment", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T18:00:00.000+03:00", "replies_count": 0, "uuid": "230f37540a1097524136e3e4a9deb09a634375ad"}, "author": "admin", "url": "http://www.freshnews.com/news/1136243/lieberman-software-privileged-identity-management-solution-achieves-scalability-milest", "ord_in_thread": 0, "title": "Lieberman Software Privileged Identity Management Solution Achieves Scalability Milestone With Over 1 Million Managed Endpoints at a Single Deployment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/5/2015 @ 8:00 AM Companies mentioned in this article: Lieberman Software \nLOS ANGELES, CA--(Marketwired - October 05, 2015) - Lieberman Software Corporation’s adaptive privileged identity management platform, Enterprise Random Password Manager™ (ERPM ), achieved a major milestone recently by passing a million managed endpoints in a single customer deployment. \n\"Many of our customers have deployments in the hundreds of thousands of endpoints, but this is the first time we’ve passed a million with one customer,\" said Philip Lieberman, President of Lieberman Software. \"This customer uses ERPM to secure everything from applications to routers, and they plan to roll out ERPM to over a million more endpoints throughout the enterprise.\" \n\"Doing automated cyber defense at scale is what we get really excited about,\" said Jonathan Sander, Lieberman Software’s VP of Product Strategy. \"Reaching the million endpoint milestone for a single deployment is amazing, but not surprising. ERPM has been designed for this kind of scale from the very start.\" \nPrivileged Identity Management Security at Scale \nAs technology pushes everything to cloud and IoT (Internet of Things) scale, it becomes increasingly challenging to secure every endpoint organizations must manage. In \"How Managing Privileged Access Reduces the Risk of a Data Breach,\" Aberdeen Group stated that 58% of privileged accounts have not had a credential refresh in 90 days. 46% of privileged accounts have not had a credential change in a year or more. 1 \n\"We know 9 out of 10 data breaches use privileged accounts, which means protecting these critical resources is paramount,\" Sander said. \"Providing this protection at massive scale will be an absolute requirement as organizations scale up to meet their own customers’ demands. ERPM is ready to meet the needs of automated privileged account security for the enterprise today.\" \nAbout Enterprise Random Password Manager \nERPM is a proactive cyber defense solution that protects access to systems with sensitive data. It automatically discovers, secures and audits privileged identities throughout the cross-platform enterprise -- either on-premises, in the cloud or as a hybrid model. With ERPM, intruders cannot extract and leverage the elevated credentials they require to gain unrestricted and anonymous movement throughout the network. The key to blocking cyber attacks with ERPM is its ability to discover, document and eliminate privileged account security threats in real time, before they can be exploited. \nAccording to research published by IDC, ERPM has \"the largest verified deployment of a password manager/vault, consisting of hundreds of thousands of machines for privileged access management.\" 2 \nFor more information on Lieberman Software’s adaptive privileged identity management solution go to www.liebsoft.com/erpm . \nAbout Lieberman Software Corporation \nLieberman Software proactively blocks cyber attacks that bypass conventional enterprise defenses and penetrate the network perimeter. The company provides award-winning privilege management and security management products to more than 1,400 customers worldwide, including nearly half of the US Fortune 50. By automatically locating, securing and auditing privileged identities -- both on-premises and in the cloud -- Lieberman Software controls access to systems with sensitive data, and defends against malicious insiders, zero day attacks and other advanced cyber threats. Lieberman Software is headquartered in Los Angeles, CA, with offices and channel partners located around the world. For more information, visit www.liebsoft.com . \n1 Derrk Brink, How Managing Privileged Access Reduces the Risk of a Data Breach, Aberdeen Group, Sep 2015 \n2 Product and company names herein may be trademarks of their registered owners. Contact: \nFor more information, please contact: Kevin Franks", "external_links": [], "published": "2015-10-05T18:00:00.000+03:00", "crawled": "2015-10-05T19:52:01.272+03:00", "highlightTitle": ""}