{"organizations": ["Philippines"], "uuid": "0bda6d3eb86b91f0d853a8129bb64a26eae1abcc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.porttechnology.org", "main_image": "http://www.porttechnology.org/images/made/images/uploads/news/729_i_1_340_220.png", "site_section": "http://www.porttechnology.org/rss_feeds/news/", "section_title": "Port Technology International - News", "url": "http://www.porttechnology.org/news/transas_takes_training_to_philippines/", "country": "GB", "title": "Transas Takes Training to Philippines", "performance_score": 0, "site": "porttechnology.org", "participants_count": 0, "title_full": "Transas Takes Training to Philippines", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T16:09:00.000+03:00", "replies_count": 0, "uuid": "0bda6d3eb86b91f0d853a8129bb64a26eae1abcc"}, "author": "", "url": "http://www.porttechnology.org/news/transas_takes_training_to_philippines/", "ord_in_thread": 0, "title": "Transas Takes Training to Philippines", "locations": ["Philippines"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "01 Oct 2015 Automation and Optimisation , Going Places , Mega Ship Ready The rapid growth and development of the Philippine maritime training market caused a dramatic increase in demand for state-of-the-art simulation systems compliant with the latest MARINA and CHED training requirements. Being the leading provider of the maritime simulation and training solutions, Transas is a logical choice for a most academies, colleges, and training centres in the Philippines. \nIn order to enhance its range of services offered to the MET organisations in the Philippines, Transas has partnered with Philippine Lifesaving Equipment Inc., a local company with a vast experience in the maritime market. Together, the companies are providing training solutions for the Philippine market compliant with all international, as well as local standards set by the Maritime Industry Authority (MARINA). \nVarious projects have already been successfully implemented, namely extension of the NTPRO 5000 simulator with the Transas ERS 5000 TechSim for the Mariana Maritime Center, the Far East Foundation, Inc. and the Western Shipping training center in Manila, and installation of the navigational desktop workstations in addition to the Transas GMDSS simulator at the Mariner Polytechnic Legazpi Campus. \nTransas has also delivered new simulators for the Italian Maritime Academy Phils., Inc.,. The simulator complex includes NTPRO 5000 DNV Class A with 240 degrees visualization, NTPRO 5000 navigational desktop workstations, ERS 5000 TechSim Tanker LCCH full mission engine room and ERS classroom. \nThe Panglao-based Cristal e-College will be equipped with Transas bridge simulator system DNV Class A with 240 degrees visualization, and navigational simulator desktop workstations. Similar setup was also supplied to the Mariners’ Polytechnic Colleges Foundation in Canaman. \nMr. Dell Supapo, President of the Philippine Lifesaving Equipment Inc., comments: “Being a key Transas partner in the Philippine maritime simulation market, we jointly pursue excellence in providing quality products and services to our valued customers in this market.”", "external_links": [], "published": "2015-10-01T16:09:00.000+03:00", "crawled": "2015-10-01T19:06:12.255+03:00", "highlightTitle": ""}