{"organizations": [], "uuid": "3ed2dbf8c2d7e769ec39a9966233d664dac50239", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whatech.com", "main_image": "", "site_section": "http://www.whatech.com/?format=feed&type=rss", "section_title": "WhaTech -  Technology News | Supplier Sourcing |  Community - WhaTech", "url": "https://www.whatech.com/medical-technology/news/103493-medical-imaging-players-all-set-for-picture-perfect-wedding", "country": "AU", "title": "Medical imaging players all set for picture perfect wedding", "performance_score": 0, "site": "whatech.com", "participants_count": 1, "title_full": "Medical imaging players all set for picture perfect wedding", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:44:00.000+02:00", "replies_count": 0, "uuid": "3ed2dbf8c2d7e769ec39a9966233d664dac50239"}, "author": "webmaster@whatech.com.au (Staff Writers)", "url": "https://www.whatech.com/medical-technology/news/103493-medical-imaging-players-all-set-for-picture-perfect-wedding", "ord_in_thread": 0, "title": "Medical imaging players all set for picture perfect wedding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published on Monday, 26 October 2015 11:44 Submitted by Staff Writers Page views: 99 times \nNigel Finch and Albert Liong 3D Medical Limited (ASX:3DM) (3DM or the Company) has announced it has entered into a binding Heads of Agreement to merge with Mach7 Technologies Pte. Ltd. (Mach7) through acquisition of 100% of the issued capital of Mach7. Mach7 is the parent company of Mach7 group. - Advertisement - \nMach7 is a global provider of enterprise image management systems that allow healthcare enterprises to identify easily, connect, and share diagnostic image and patient care intelligence where and when needed. The solutions improve patient care, compliance and clinician satisfaction. In October, Frost & Sullivan named Mach7 the Medical Imaging Informatics Company of the Year in the Asia Pacific region. \nMach7’s global customer base includes leading healthcare organisations such as Penn Medicine, Raffles Hospital and Massachusetts General and has operations in 10 countries. Mach7 has 43 employees with the majority located in Burlington, Vermont USA, and generates strong contractual cash flow from software licenses and support agreements with the majority denominated in US dollars. For the nine months ending September 2015, Mach7 generated revenue of US$4.1 million and is nearing cash flow breakeven. \nIn June this year, 3DM announced an agreement with Telstra Health, a division of Telstra Corporation Ltd (ASX:TLS) (Telstra Health), whereby Telstra Health became a reseller of the Mach7 image management software, integrating the technology to create new products for the Australian healthcare market and also allowed for the supply of specific Telstra Health products to 3DM’s new and existing customers. \nThe proposed merger is subject to certain closing conditions including 3DM obtaining shareholder approval, 3DM raising a minimum of $10 million as well as other customary conditions. - Advertisement - The proposed merger is expected to complete in January 2016 after a general meeting of 3DM's shareholders convened for the purpose of obtaining approval of the proposed merger.\nThe merger with Mach7 will involve the issue of 459.5m shares to the owners of Mach7 in return for 100% of the shares in Mach7, giving 3DM ownership of Mach7's assets and intellectual property. Four separate tranches totaling 300,000 performance-related shares will also be made available to the owners of Mach7 subject to achievement of agreed financial milestones relating to a combination of revenue targets and share price performance. \nUnder the Heads of Agreement, 3DM will undertake a series of capital raisings to raise a minimum of AUD$10 million in new capital to provide working capital to support further research and development, sales and marketing activities for Mach7, build out 3DM’s value-added data offerings, retire the debt in Mach7 (~USD$2 million) and pay for the costs of the transaction and capital raisings. \nAs part of this capital raising, 3DM intends to raise up to $4 million with the issue of 53 million shares under a share placement to institutional investors. The placement will be made within 3DM's existing placement capacity under Listing Rule 7.1 and, accordingly, will not require shareholder approval. 3DM will also undertake a Share Purchase Plan (SPP) to enable existing shareholders to subscribe on the same terms as the institutional placement. The SPP will not be underwritten. 3DM has also received indications that existing holders of options in 3DM intend to exercise their options, which would raise further funds. \nSubject to approval by Shareholders, and upon completion of the acquisition, 3DM will propose to change the name of the company to \"Mach7 Technologies Ltd\" and appoint Albert Liong as Managing Director of the group. Currently, Mr. Liong is the chief executive officer of Mach7 Technologies. \nDetails of the proposed transaction, capital raising and proposed Board changes are included in the accompanying presentation. \nDr. Nigel Finch, chairman of 3DM commented, “We are delighted to have secured agreement to bring our companies together. We have enjoyed a close working relationship with Mach7 and have seen their outstanding success in the USA and Asia. This transaction delivers a material revenue boost to 3DM and importantly allows 3DM shareholders to benefit from the ownership of best-in-breed healthcare imaging intellectual property. The transaction will drive earnings and transform 3DM into a global operation, allowing significant opportunities to scale 3DM’s value- adding data activities to leading healthcare institutions globally.” \nMr. Albert Liong, chief executive officer of Mach7, stated, “We are thrilled to be deepening our relationship with our valued partner 3DM. Mach7 has enjoyed substantial growth in recent times, and we feel this will be enhanced as part of 3DM. Australian investors appreciate world leading healthcare technology, and we look forward to this new phase as we continue to build our impressive global customer base.” For more information:", "external_links": [], "published": "2015-10-26T02:44:00.000+02:00", "crawled": "2015-10-26T23:49:04.669+02:00", "highlightTitle": ""}