{"organizations": [], "uuid": "cc055d0b5232eea9407feb86c9dbc7b65bacafe6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://www.jamaicaobserver.com/assets/12242934/Anthony-Hylton_w400.jpg", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNHNKeEO2UjB_pI3azABRDu-APCncA&clid=c3a7d30bb8a4878e06b80cf16b898331&ei=MjEqVoj9DZHNa_KhnaAM&url=http://www.jamaicaobserver.com/news/Technology-centres-to-assist-innovators--researchers_19235031", "country": "IL", "title": "Technology centres to assist innovators, researchers - Jamaica Observer", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Technology centres to assist innovators, researchers - Jamaica Observer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T11:53:00.000+03:00", "replies_count": 0, "uuid": "cc055d0b5232eea9407feb86c9dbc7b65bacafe6"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNHNKeEO2UjB_pI3azABRDu-APCncA&clid=c3a7d30bb8a4878e06b80cf16b898331&ei=MjEqVoj9DZHNa_KhnaAM&url=http://www.jamaicaobserver.com/news/Technology-centres-to-assist-innovators--researchers_19235031", "ord_in_thread": 0, "title": "Technology centres to assist innovators, researchers - Jamaica Observer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Technology centres to assist innovators, researchers \nFriday, October 23, 2015 Tweet \nTHE Government has embarked on creating a network of technology and innovation support centres (TISCs) to strengthen its work in promoting science, technology, and innovation as key target sectors for Jamaica's development. \nThe first of its kind in the English-speaking Caribbean, the network will assist innovators and researchers with easier access to data on patents, which are exclusive rights granted to innovators for a limited period of time, in exchange for detailed public disclosure of an invention. \nIt is anticipated that this will result in the creation of better products and, in the process, further strengthen Jamaica's intellectual property regime, said Industry, Investment and Commerce Minister Anthony Hylton, at the launch of the TISC programme in Jamaica at the Mona Visitors' Lodge, University of the West Indies on Wednesday. \nDescribing patent databases as \"valuable sources\" of technical and \"potentially rich\" information for researchers, Hylton noted that these are not easily accessible locally by the general public. \nFurther, he said where persons are able to tap into these, they are often unable to simultaneously access both local and international databases. \n\"With these limitations, we risk losing opportunities to develop new inventions and create useful purposes. The establishment of this network of Technology Innovation and Support Centres will change that. Innovators and researchers will be able to use the disclosures from products and procedures to create better products, which will enhance our innovative potential to create, protect and manage our intellectual property,\" the minister pointed out. \nAdditionally, he said the TISCs will also provide opportunities for overseas researchers and inventors to engage and utilise the services of local persons involved in research. \n\"This presents a unique opportunity for outsourcing - an industry in which Jamaica has proven itself a leader,\" Hylton said. \nThe minister explained that the TISCs will facilitate online access to patent and non-patent (scientific and technical) data and intellectual property publications, and on-demand searches; provide assistance in searching and retrieving technology information; offer training in database research; and provide basic information on industrial property laws, management and strategy, and technology commercialisation. \nHe advised that the Jamaica Intellectual Property Office (JIPO), an agency of the ministry, is the designated focal point to coordinate the centres' development and activities, adding that \"we foresee that the TISCs will be located in a range of academic, industrial and business organisations\". ADVERTISEMENT", "external_links": [], "published": "2015-10-23T11:53:00.000+03:00", "crawled": "2015-10-23T16:09:36.458+03:00", "highlightTitle": ""}