{"organizations": [], "uuid": "9a7b774137d7a31f2afb4934be3504828bec4a47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/09/28/12999819/1.jpg", "site_section": "http://www.prweb.com/rss2/techsoftware.xml", "section_title": "Technology: Software", "url": "http://www.prweb.com/releases/transcosmos/DAConsortium/prweb12999819.htm", "country": "US", "title": "D.A.Consortium Inc. and transcosmos inc. Jointly Start Service to Offer Incentives and Gifts through “LINE”", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "D.A.Consortium Inc. and transcosmos inc. Jointly Start Service to Offer Incentives and Gifts through “LINE”", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "9a7b774137d7a31f2afb4934be3504828bec4a47"}, "author": "Public Relations", "url": "http://www.prweb.com/releases/transcosmos/DAConsortium/prweb12999819.htm", "ord_in_thread": 0, "title": "D.A.Consortium Inc. and transcosmos inc. Jointly Start Service to Offer Incentives and Gifts through “LINE”", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "D.A.Consortium Inc.（hereafter, DAC） and transcosmos inc. have tied a business partnership, and transcosmos’ “ E-Commerce One-Stop Service ” and DAC’s messaging service management solution “DialogOne” are to collaborate with each other. The two companies will start a service to provide incentives and gifts in one stop on the LINE messaging service. Background and Nature of Partnership\n“DialogOne” is a messaging service management solution DAC has been offering, and it has been used by many corporations to their advantage since October 2014. It delivers an appropriate message to each user, by utilizing LINE Business Connect (*1), combines user information maintained by the corporate clients and LINE account information.\nOn the other hand, “E-Commerce One-Stop Service” is a comprehensive service in a high-security environment to offer everything from procurement to marketing, call-center service, customer data management, and marketing automation. “E-Commerce One-Stop Service” is capable of covering promotion design, product procurement, inventory management, and shipment all in one-stop.\nCharacteristics of this collaboration between “DialogOne” and “E-Commerce One-Stop Service” are that it is possible to deliver gifts to users for whom verification was completed, and that operations are simple.\nSince it is possible to differentiate the messages on the LINE platform through DialogOne, it is possible to optimize the incentives and gifts by target. In addition, it would not be necessary to procure incentives and gifts individually, and through “E-Commerce One-Stop Service,” necessary items could be prepared at the right timing when it is necessary.\nFuture Development\n“DialogOne” has been continuously expanding through adding various tools and solution partnership.\nThese cooperated services are the conversational function with an artificial intelligence (AI)(*2), technical partnership with a marketing platform “Experian Cross-Channel Marketing Platform (CCMP),” which manages multi-screen/multi-device campaign comprehensively (*3), and partnering with a sales promotion platform for the Smartphone (*4). Also, through cooperation with messaging services other than LINE and further expanding its reach, we are aiming at total management solution for our clients’ marketing needs.\n“E-Commerce One-Stop Service” currently serves 34 countries all over the world. We will continue to accelerate our business development along with expansion of the world’s E-Commerce expansion.\nDAC and transcosmos will continue to work on reinforcement of the service functions in order to maintain an environment where the advertisers and users could enjoy smooth communication through cross channels.\n(*1) About LINE Business Connect\n“LINE Business Connect” is a service where various functions of an official LINE account are provided by LINE Corporation for corporations with API, and each corporation could customize it for usage. By utilizing “LINE Business Connect,” Corporations could not only send one-sided messages to the LINE users as with traditional LINE message, but it would be possible to deliver optimized messages for specific users and to communicate both ways with the users. Since it enables corporations to deliver the information users want based upon the user’s communication contents and behaviors, one-on-one communication between the corporations and the users would be possible.\n(*2) February 18, 2015 Press release “Announcement of Business Partnership with Jibe Mobile and Starting ‘DialogOne Agent’ Service”\nhttp://www.dac.co.jp/press/2015/20150218-DOne-JM.html\n(*3) February 18, 2015 Press release “DAC’s ‘DialogOne,’ Responding to Business Connect to Tie Up with Experia Japan’s ‘CCMP’”\nhttp://www.dac.co.jp/press/2015/20150218-DOne-CCMP.html\n(*4) March 26, 2015 Press Release “DialogOne,’ a Messaging Service Management Solution, and ‘Flipdesk,’ a Sales Promotion Platform for the Smartphone to Collaborate with Each Other”\nhttp://www.dac.co.jp/press/2015/done-flipdesk.html\n(*5) Features of “E-Commerce One-Stop service”\ntranscosmos’ “E-Commerce One-Stop Service” provides all the services from research/analysis to E-Commerce website design/management, promotion, and fulfillment in one-stop, in order to support the corporate client’s E-Commerce development. Moreover, the corporate client’s products are procured and sold, utilizing E-Commerce sales channels possessed by transcosmos. transcosmos owns warehouses and international distribution to various overseas countries and its management system, and transcosmos is able to cover all the duties to deliver the products to consumers.\n-Global sales channel\nSales channels which “sell” based on the local characteristics are pursued, and E-Commerce websites would be established in various countries in the world.\n-Operations\nServices to make product sales to various countries in the world, including global logistic service, are provided in a one-stop service.\n-Procurement\n“Popular products” from the various countries of the world are ascertained, and corporate client’s excellent products are procured and delivered to the consumers all over the world.\nAbout the Company\nD.A.Consortium Inc. Representative: President and CEO Hirotake Yajima\nHeadquarters: 33th Floor, YGP Tower, 4-20-3 Ebisu, Shibuya-ku, Tokyo\nEstablishment: December 2, 1996\nNature of Business: Online media representative business, ad technology business, ad operations business, etc.\ntranscosmos inc. Representative: President and COO Masataka Okuda\nTokyo headquarters: 3-25-18 Shibuya, Shibuya-ku, Tokyo\nEstablishment: June 18, 1985\nNature of Business: BPO business", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50cmFucy1jb3Ntb3MuY28uanAvZW5nbGlzaC8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kYWMuY28uanAvcHJlc3MvMjAxNS8yMDE1MDIxOC1ET25lLUpNLmh0bWw=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kYWMuY28uanAvcHJlc3MvMjAxNS8yMDE1MDIxOC1ET25lLUNDTVAuaHRtbA==", "http://www.dac.co.jp/press/2015/done-flipdesk.html", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kYWMuY28uanAvcHJlc3MvMjAxNS9kb25lLWZsaXBkZXNrLmh0bWw=", "http://www.dac.co.jp/press/2015/20150218-DOne-CCMP.html", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50cmFucy1jb3Ntb3MuY28uanAvZW5nbGlzaC9lYy8=", "http://www.dac.co.jp/press/2015/20150218-DOne-JM.html"], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T10:14:10.217+03:00", "highlightTitle": ""}