{"organizations": [], "uuid": "163742ac741a84c538aeffe9374939cb473e2c64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/elizabeth__hr_conference_3.png", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=20", "section_title": "Technology", "url": "http://www.modernghana.com/news/648958/1/leverage-technology-for-employee-engagement-tigo-h.html", "country": "US", "title": "Leverage Technology For Employee Engagement -Tigo HR Director", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Leverage Technology For Employee Engagement -Tigo HR Director", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T17:52:00.000+03:00", "replies_count": 0, "uuid": "163742ac741a84c538aeffe9374939cb473e2c64"}, "author": "", "url": "http://www.modernghana.com/news/648958/1/leverage-technology-for-employee-engagement-tigo-h.html", "ord_in_thread": 0, "title": "Leverage Technology For Employee Engagement -Tigo HR Director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tigo"], "text": "Technology | 13 October 2015 15:52 CET Leverage Technology For Employee Engagement -Tigo HR Director Source: ModernGhana.Com \nThe Director of Human Resources at Tigo Ghana, Elizabeth Arhin, has urged the human resources community in the country to embrace technology to engage employees. \nSpeaking on a topic “ Employee Engagement in a Digital Age” at the fourth edition of HR Focus Conference and Awards in Accra, she said business today happens at lightning speed and, as a result, Human Resource practitioners should deploy innovative ways of engagement. \nShe noted: “The days when employee engagement consisted of an outing for the team or an end of year soiree are long gone.” \n“Employees want – and expect - to be constantly engaged by their employer, in new, diverse and captivating ways.” \nShe said that many things have been tried by many companies, but noted that many HR practitioners would be asking themselves “why, at all, is employee engagement important to the business?” She explained that there is a direct correlation between employee engagement and company performance. \n“It stands to reason that happy and engaged employees give of their best to their employer and this feeds into how well that company achieves its objectives in any given month or year.” \nMs. Arhin further quizzed the participants of the conference. In this current digital age in which we find ourselves, how are we maximizing the availability and capability of technology in our employee engagement activities? \nCiting Tigo, she disclosed how the company has developed innovative solutions to ensure that its employees live the company’s digital lifestyle agenda. One such instance is how the company has provided employees with opportunities to purchase smartphones at reduced rates and on flexible payment terms. \n“This makes it possible for them to access many of the apps that most of us now access to make our hectic lives easier and more productive.”She also noted that employees’ learning is done online via a learning management system which allows them the flexibility to complete courses at their own pace and at any location. \n“We leverage digital means to send out information to staff and run online employee engagement surveys which help us to ‘hear’ our people and address their issues. We also hold Town Hall Meetings with digital connections to all our regional offices.” \nConcluding her thought-provoking speech, Ms. Arhin commented that, “employee engagement is key; it will help us to retain our key employees, maintain a happy workforce and build and maintain a productive workforce.” \nThe conference was organised by L’aine Services Limited on the theme: “Creating People Advantage; A Must for HR” . The event also gave organisations the opportunity to showcase their recruitment processes, products and services.", "external_links": [], "published": "2015-10-13T17:52:00.000+03:00", "crawled": "2015-10-14T01:25:12.077+03:00", "highlightTitle": ""}