{"organizations": [], "uuid": "01a91ba3d242ad66fa70f3f6c27253764b50de56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/09/13015346/DTT_BurgerKing_Logo.png", "site_section": "http://www.prweb.com/rss2/technology.xml", "section_title": "Technology", "url": "http://www.prweb.com/releases/2015/10/prweb13015346.htm", "country": "US", "title": "DTT Customers Celebrate Achievements at Burger King North America Convention", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "DTT Customers Celebrate Achievements at Burger King North America Convention", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "01a91ba3d242ad66fa70f3f6c27253764b50de56"}, "author": "Nadine Malek", "url": "http://www.prweb.com/releases/2015/10/prweb13015346.htm", "ord_in_thread": 0, "title": "DTT Customers Celebrate Achievements at Burger King North America Convention", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Los Angeles, CA | Leading surveillance and loss prevention provider DTT is excited to announce the recognition of two customers, Patrick Sidhu and Kevin Newell, at this year’s Burger King North America Convention. Held October 3 – 8, 2015 in New Orleans, the Convention is one of the brand’s largest events showcasing restaurant technology and training tools, operational improvements and updates, and top performers in the Burger King system. Awarded Burger King Franchisee of the Year, Patrick Sidhu has been working with DTT since 2011. “The service and support we’ve received from DTT is unmatched,” states Patrick, operator of Premier Kings, which operates 80 plus Burger King Restaurants in AL, GA and TN. “As a multi-store operator, I need eyes on lots of different things at once. DTT’s loss prevention experts give me data in a simple format that I can view in the office or on-the-go from MyDTT™. We’ve been able to take action on various issues and make several improvements to our operation since implementing DTT.”\nKevin Newell of Supreme Foods was presented with Burger King Developer of the Year and has been a DTT customer for almost 6 years. Kevin is currently Chairperson of DTT’s Steering Committee, a critical group of DTT customers that provides feedback on tools and future developments. “DTT has really helped us streamline our operation and alter employee habits,” says Kevin. “The SmartAudits™ have enabled us to pinpoint several instances of theft and terminate staff members who are negatively impacting profits. We can also easily review and verify customer complaints, which saves us a ton of time and effort.”\n“We’re honored to have played even a small role in the success of these two thriving franchisees,” says Tom Moran, EVP of Sales and Marketing for DTT. “It’s always exciting to begin a relationship with a new client, but even more so to watch the relationship grow over the years and see the positive impact of DTT. Customers like Patrick and Kevin are vital to our business due to their consistent comments that help us better our services. We sincerely congratulate these gentlemen on their continued achievements!”\nDTT has been a Premier Alliance vendor for Burger King Corporate for over 5 years and maintains strong relationships with Burger King operators across the country, currently supporting over 800 Burger King stores.\nAbout DTT\nHeadquartered in Las Vegas, Nevada, DTT provides digital video surveillance solutions to the hospitality and specialty retail industries. DTT was founded in 1999 by Sam Naficy, leveraging the power of emerging digital technology to support the needs of a broad base of clientele. Since first launched, DTT has equipped, serviced and supported more than 35,000 clients. Every day, software provided by DTT protects trillions of dollars in assets and oversees nearly 2 million employees. Some of the world’s most popular and respected restaurant brands use DTT including McDonald’s, SUBWAY®, Dairy Queen, Burger King, Dunkin Brands, Taco Bell, KFC, Auntie Anne’s, and Potbelly Sandwich Works, to name a few. Please visit http://www.dttusa.com for more information.\nAbout Burger King\nFounded in 1954, Burger King is the second largest fast food hamburger chain in the world. The original HOME OF THE WHOPPER®, the Burger King system operates more than 14,000 locations in approximately 100 countries and U.S. territories. Almost 100 percent of Burger King restaurants are owned and operated by independent franchisees, many of them family-owned operations that have been in business for decades. The Burger King brand is owned by Restaurant Brands International Inc., one of the world's largest quick service restaurant companies with more than $23 billion in system sales and over 19,000 restaurants. To learn more about Burger King, please visit http://www.bk.com or follow us on Facebook and Twitter.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5iay5jb20=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kdHR1c2EuY29t"], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T10:29:08.986+03:00", "highlightTitle": ""}