{"organizations": [], "uuid": "0662ece1f60c5c6d719578bf0c8ed4ed6144fae6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/shutterstock_209102161.jpg", "site_section": "http://feeds.feedburner.com/TechnologyOrgInformationProcessingNews", "section_title": "Technology Org » Information processing news", "url": "http://www.technology.org/2015/10/06/statistics-dont-lie-when-it-comes-to-the-threat-of-identity-theft/", "country": "", "title": "Statistics Don’t Lie When It Comes to the Threat of Identity Theft", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Statistics Don’t Lie When It Comes to the Threat of Identity Theft", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T10:40:00.000+03:00", "replies_count": 0, "uuid": "0662ece1f60c5c6d719578bf0c8ed4ed6144fae6"}, "author": "Alius Noreika", "url": "http://www.technology.org/2015/10/06/statistics-dont-lie-when-it-comes-to-the-threat-of-identity-theft/", "ord_in_thread": 0, "title": "Statistics Don’t Lie When It Comes to the Threat of Identity Theft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Statistics Don’t Lie When It Comes to the Threat of Identity Theft Posted Today \nThe media portrays cybercrime as a big issue, in the sense that it happens to big agencies and big corporations. There is truth to this — reputable companies, organizations and institutions like Anthem Blue Cross Blue Shield, Harvard University, LastPass and even the Army National Guard suffered massive data breaches in 2015 . \nThe Federal Trade Commission (FTC) and even Department of Homeland Security (DHS) are on high alert regarding hackers targeting America’s wealthiest institutions, but the people looking to steal our money and information haven’t forgotten about the little guy — you and me. Identity theft is still the FTC’s top consumer complaint , which means it’s happening to the average Americans every day. \nTo protect yourself from the most common methods of identity theft, it’s important to know the facts of this crime that threaten millions of Americans and billions more around the world. \n17.6 Million \nThat’s the number of Americans who experienced identity theft in 2014, according to the Bureau of Justice Statistics (BJS) . That’s roughly five percent of the United States population that had their financial, medical or other personal data stolen, possibly without their knowledge. Nearly seven percent of people age 16 or older were victims of identity theft. Eighty-six percent of victims experienced the fraudulent use of existing credit card or bank account information. The number of elderly victims is increasing by hundreds of thousands each year. Roughly 14 percent of victims suffer out-of-pocket, monetary losses. Half of identity theft victims who were able to resolve any problems did so in a day or less. \nWe are All Vulnerable \nThe statistics from the BJS might make you want to throw your computer out the window and live in the woods, but that may not necessarily protect you. Even people who “make all the right moves” are open to theft because the people who are after your identities are constantly finding new ways to obtain the information they want, according to CNN Money . Fraudsters set up fake Wi-Fi networks in public places and wait for unsuspecting patrons to connect. Once they do, the thief has access to their computers, smartphones or tablets. Some identity thieves will pose as census bureau workers and come right to your front door, asking for valuable information that many hand over without question. In the age of social media, our profiles and accounts often carry valuable information that can be pieced together to steal our identities. In the event of a big data breach, your credit card information can be bought and sold on the black market if you made a recent purchase from that company. \nWhat Can I Do? \nThe fight against identity theft is not hopeless. Far from it, actually. First, determine your online risk with this simple calculator that determines how vulnerable you are based on the services you use and certain everyday habits. Next, purchase a credit monitoring service. These services keep watch over your information such as credit reports and banking activity and send you an alert if there is any suspicious activity. \nThe best defense against identity theft is a quick reaction to anyone trying to take a peek inside your personal information. Combined with best practices, this is the best way to keep your identity safe: Always think twice about handing over your personal information in order to keep those identity thieves at bay.", "external_links": [], "published": "2015-10-06T10:40:00.000+03:00", "crawled": "2015-10-06T13:55:10.551+03:00", "highlightTitle": ""}