{"organizations": [], "uuid": "88c76f4d57ffa3f233f42ad6f606165226e96ce9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.biosciencetechnology.com", "main_image": "http://www.biosciencetechnology.com/sites/biosciencetechnology.com/files/bt1510_washington_virus.jpg", "site_section": "http://www.biosciencetechnology.com/rss-feeds/all/rss.xml/all", "section_title": "Bioscience Technology All", "url": "http://www.biosciencetechnology.com/news/2015/10/study-reveals-new-potent-way-boost-immunity-and-fight-viruses", "country": "US", "title": "Study Reveals New, Potent Way to Boost Immunity and Fight Viruses​​​", "performance_score": 0, "site": "biosciencetechnology.com", "participants_count": 1, "title_full": "Study Reveals New, Potent Way to Boost Immunity and Fight Viruses​​​", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:56:00.000+03:00", "replies_count": 0, "uuid": "88c76f4d57ffa3f233f42ad6f606165226e96ce9"}, "author": "bfletcher", "url": "http://www.biosciencetechnology.com/news/2015/10/study-reveals-new-potent-way-boost-immunity-and-fight-viruses", "ord_in_thread": 0, "title": "Study Reveals New, Potent Way to Boost Immunity and Fight Viruses​​​", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Study Reveals New, Potent Way to Boost Immunity and Fight Viruses Wed, 10/21/2015 - 10:56am   \nMany viral infections, such as the common cold, cause mild illnesses that the body’s immune system eventually defeats. But when viruses cause severe disease, doctors have few options for effective treatment. \nStudying mice with a variety of viral infections, scientists at Washington University School of Medicine​ in St. Louis have demonstrated a way to dial up the body’s innate immune defenses while simultaneously attacking a protein that many viruses rely on to replicate. \nThe findings, published Oct. 19 in Nature Immunology , reveal previously unknown weapons in the body’s antiviral immune arsenal and provide guidelines for designing drugs that could be effective against a broad range of viruses. The strategy involves enhancing the body’s interferon signaling system, long understood to be a vital part of antiviral defenses. \n“We’ve discovered a new component of the interferon system,” said senior author Michael J. Holtzman, M.D., the Selma and Herman Seldin Professor of Medicine. “It does something that other components don’t do, and it works on both sides of the fence: It dials up the body’s internal genes that fight viruses, and it attacks viral proteins directly.” \nHoltzman and lead author Yong Zhang, Ph.D., an instructor in pulmonary medicine, suspect that the researchers’ one-two punch against the virus may explain the large difference in survival rates between control mice and mice genetically engineered to have increased signaling in their interferon systems. \nWhen infected with encephalomyocarditis virus, which causes severe damage to vital organs including the brain, heart and pancreas, 97 percent of the genetically engineered mice survived, compared with none of the control mice. Even when the concentration of the injected virus was increased 100-fold, 82 percent of the genetically altered mice survived. And at 100-fold lower concentrations, all genetically engineered mice survived the infection, compared with only 25-28 percent of the control mice. \nHoltzman pointed out that past research by other groups has shown that increasing the amount of interferon directly results in some improvements in fighting viruses, but not to the same extent as the current work. In addition, more modest improvements shown by other investigators usually are accompanied by autoimmune problems resulting from the chronically activated immune response. Despite the strong antiviral immune response seen in the new study, Holtzman and his colleagues reported no evidence of autoimmune disease in these mice. \nHoltzman said a possible explanation for the impressive survival rates and absence of destructive autoimmunity could be that the researchers’ strategy did not involve increasing the amount of interferon, the first step of this important antiviral signaling cascade. Instead, it dialed up amounts of the protein STAT1, the second component of this cascade, without altering the system’s overall interferon on/off switch. \n“Past work to boost this system just kept the interferon signal on all the time,” Holtzman said. “When the system is chronically activated, it is no longer regulated, and that’s where the autoimmune problems may come from. Our system is still regulated by the presence or absence of interferon. Interferon amounts increase when there is an infection and decrease when there is no infection. We’re not boosting interferon itself, but the secondary signal that interferon activates, which sets off the rest of the antiviral cascade. It’s like greasing the wheels. We’re not pushing the system any harder. But when we do push, we get a bigger effect.” \nAnalyzing the mice, the researchers found that the genetic alteration that confers these benefits turns on a set of molecules called PARP9-DTX3L. This molecular complex activates genes specifically designed to fight viruses. And, separate from its role in activating genes, the complex also seeks out and destroys an important viral protein called 3C protease, the scientists found. Many viruses including the common cold virus rely on this protein to replicate and continue their destructive march through the body. \n“This dual mechanism of action is a great guideline for how we would like to build a new antiviral drug,” Holtzman said. “We want something that affects both host and virus. We already have drug candidates we can screen to see if they target this part of the system.” \nAnother potential advantage of this system, according to Holtzman, is that a drug with this dual function could be effective against different kinds of viruses that affect a variety of tissues, and especially those viruses that rely on 3C protease proteins for survival. In addition to testing mice with encephalomyocarditis virus, the researchers showed their system was effective in mice with equine encephalitis virus and with strains of influenza virus relevant to public health, including H5N1 and H1N1. \nThis work was supported by the Martin Schaeffer Fund and by the National Institutes of Health (NIH).", "external_links": [], "published": "2015-10-21T17:56:00.000+03:00", "crawled": "2015-10-21T21:16:40.838+03:00", "highlightTitle": ""}