{"organizations": ["IEDC", "Economic Development Council and Chamber of Commerce for Clark and Floyd Counties", "Indiana Economic Development Corporation", "Louisville Metro", "Inc", "Inc.", "Department of Commerce", "Vertical Authority", "Company, Inc.", "UPS", "Caterpillar", "IEDC Board of Directors", "Southern Indiana", "Indiana Economic Development Corporation The Indiana Economic Development Corporation", "Louisville Metro Area", "Amazon.com", "Louisville Metropolitan Area"], "uuid": "ef0c82465857187ef46338d84417eb21bc1555d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://feeds.bio-medicine.org/latest-biology-technology", "section_title": "Latest Biology Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/biology-technology-1/Knipper-Announces--u201CWestward-Expansion-u201D-Constructing-New-State-of-the-Art-Distribution-Center-in-the-Southern-Indiana--u2013-Louisville-Metro-34484-1/", "country": "US", "title": "Knipper Announces “Westward Expansion” Constructing New State of the Art Distribution Center in the Southern Indiana – Louisville Metro Area", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Knipper Announces “Westward Expansion” Constructing New State of the Art Distribution Center in the Southern Indiana – Louisville Metro Area", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T13:37:00.000+02:00", "replies_count": 0, "uuid": "ef0c82465857187ef46338d84417eb21bc1555d7"}, "author": "", "url": "http://www.bio-medicine.org/biology-technology-1/Knipper-Announces--u201CWestward-Expansion-u201D-Constructing-New-State-of-the-Art-Distribution-Center-in-the-Southern-Indiana--u2013-Louisville-Metro-34484-1/", "ord_in_thread": 0, "title": "Knipper Announces “Westward Expansion” Constructing New State of the Art Distribution Center in the Southern Indiana – Louisville Metro Area", "locations": ["Kansas City", "U.S.", "Louisville", "Indiana", "Southern Indiana", "Kentucky", "Charlestown", "Lakewood", "Indianapolis", "New Jersey", "Memphis"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Knipper", "Michael Pence", "J Knipper", "Mike Laferrera", "Jim Knipper", "Victor Smith", "J. Knipper"], "text": "Date:10/26/2015 Lakewood, New Jersey (PRWEB) October 26, 2015 J. Knipper and Company, Inc. formally announced today that the company has broken ground on a new high volume distribution center in Charlestown, Indiana. Charlestown is part of the burgeoning Southern Indiana – Louisville Metropolitan Area which continues to experience extraordinary economic growth. Alongside distribution centers for other companies such as Caterpillar and Amazon.com, this new state of the art distribution center will provide innovative expanded distribution capabilities for many of Knipper’s pharmaceutical, biotech, and medical device customers. The new facility will be optimized to manage Knipper’s high volume Direct to Practitioner (DTP) fulfillment business primarily for drug samples and medical devices. With warehouse and fulfillment capabilities to manage prescription, controlled substance, and cold chain products, the new facility is targeted to open in May of 2016. \"Our east coast facilities continue to provide the high quality and exceptional service that our customers have come to expect. The new Midwest expansion provides unique opportunities to exceed current expectations providing even greater specialization in DTP and broader flexibility in logistics,\" said Jim Knipper, Owner and CEO of J. Knipper and Company. “Experiencing continued year after year growth, and on the heels of many recent acquisitions, further expansion of our distribution capacity is a natural next step. Expanding westward however is a very strategic decision. One that we have very carefully planned, and that we are confident will provide the greatest added value to our customers.” “Given the continued increase in direct to practitioner and direct to consumer fulfillment throughout Pharma, the Midwest provides some extraordinary advantages,” said Mike Laferrera, President and COO of Knipper. \"Being central to the majority of the U.S. population, and having such close proximity to interstate access and major UPS and FedEx hubs make Southern Indiana an ideal location for our new DTP fulfillment center. We analyzed a number of other locations including Kansas City, Indianapolis and even Memphis. Without question the Louisville Metro area provides the greatest overall value to our DTP customers, especially when it comes to freight. Our new DC will be able to reach over 75% of the U.S. population with 2 day ground service. And by extending our daily shipping window and reducing transit times we can increase our customers’ satisfaction by getting their product to their customers faster.\" “The incentives that the IEDC makes available in the way of tax and training credits made this location very attractive from the start,” said Mr. Knipper. With assistance from One Southern Indiana, the Indiana Economic Development Corporation offered J. Knipper and Company up to $385,000 in performance-based tax credits and up to $40,000 in training grants based on the company’s plan to create 56 new full-time positions for Indiana residents. With nearly 30 years’ experience in the sampling vertical, and customers including many of the world’s largest pharmaceutical and biotech organizations, J Knipper and Company has become an authority in sampling services. Through the prism of Knipper's Vertical Authority in pharmaceutical sampling, customers will be able to extend their investments in DTP and DTC programs with access to one of the industry’s most efficient high volume direct fulfillment distribution centers. About J. Knipper and Company, Inc. Founded in 1986, J. Knipper and Company, Inc., provides the healthcare industry with solutions in direct marketing, sampling, compliance, information technology and sales force productivity. Going beyond its roots in direct marketing fulfillment and sample distribution, J. Knipper and Company continues to offer innovative solutions to brand marketing and sales force challenges as well as robust and comprehensive compliance data services. The Company has invested considerably in its physical and data infrastructure over the years. Knipper now maintains 1,000,000 square feet of facilities, including significant storage capacity for refrigerated product and controlled substances, along with an advanced data center protected for the secure and safe management of client data and application services. About the Indiana Economic Development Corporation The Indiana Economic Development Corporation (IEDC) is the State of Indiana's lead economic development agency. The IEDC was officially established in February 2005 to replace the former Department of Commerce. In order to respond quickly to the needs of businesses, the IEDC operates like a business. Led by Indiana Secretary of Commerce Victor Smith, the IEDC is organized as a public private partnership governed by a 12-member board. The IEDC Board of Directors is chaired by Governor Michael Pence and reflects the geographic and economic diversity of Indiana. About One Southern Indiana One Southern Indiana is the combined Economic Development Council and Chamber of Commerce for Clark and Floyd Counties on the Indiana side of the Louisville, Kentucky metropolitan area. One Southern Indiana proactively works to grow our regional economy through business attraction, retention and expansion; through encouraging and supporting entrepreneurs; and through providing government and workforce advocacy, business education, networking opportunities and other business services to our investors. \nRead the full story at http://www.prweb.com/releases/2015/10/prweb13040602.htm . '/>\"/>", "external_links": [], "published": "2015-10-26T13:37:00.000+02:00", "crawled": "2015-10-26T16:25:12.687+02:00", "highlightTitle": ""}