{"organizations": [], "uuid": "9e4146d053a64026a62686b0d4e1b0429850b76f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theaustralian.com.au", "main_image": "http://resources1.news.com.au/images/2015/10/05/1227558/027157-012333e6-6af7-11e5-95d3-14a82c556d0b.jpg", "site_section": "http://www.theaustralian.com.au/business/technology/news", "section_title": "NEWS | Technology News | IT News &amp; Tech Reviews | The Australian | The Australian", "url": "http://www.theaustralian.com.au/business/in-depth/promising-start-turnbull-places-innovation-at-the-heart-of-economy/story-fnw66tov-1227558026635", "country": "US", "title": "Promising start: Turnbull places innovation at the heart of economy", "performance_score": 0, "site": "theaustralian.com.au", "participants_count": 1, "title_full": "Promising start: Turnbull places innovation at the heart of economy | The Australian", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T08:00:00.000+03:00", "replies_count": 0, "uuid": "9e4146d053a64026a62686b0d4e1b0429850b76f"}, "author": "The Australian", "url": "http://www.theaustralian.com.au/business/in-depth/promising-start-turnbull-places-innovation-at-the-heart-of-economy/story-fnw66tov-1227558026635", "ord_in_thread": 0, "title": "Promising start: Turnbull places innovation at the heart of economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VIDEO: What is the ‘industrial internet’?\nGRAPHIC: How does Australia compare with the rest of the world?\nQUIZ: How much do you really know about startups?\nBack in June, I wrote about the need for greater intervention by government to support technology start-ups and effectively prosecute the case for Australia to play a leading role in the global information economy. At the time, I said a whole-of-government response was needed to deliver the kind of reform that would produce an environment conducive to driving the creation of new businesses and industries based on digital technologies and skilled ICT professionals.\nThe elevation of Malcolm Turnbull to Prime Minister and his decision to align key portfolios with his digital aspirations are encouraging signs that we just might be moving in the right direction.\nWhat’s really interesting is how the language and the sentiment emanating from Canberra has changed and the resultant optimism is good news for the local ICT sector. The most obvious trend of the recent revamp to the Coalition frontbench is the way innovation and ICT-related themes have been sprinkled across the portfolios, allowing Turnbull to drive his digital agenda on multiple fronts.\nIn the Communications portfolio, Mitch Fifield might lack the ICT background and experience of his predecessor, but we can be fairly confident that Turnbull plans to keep a close watch on developments and will be guiding his decisions. Fifield’s additional role as Minister Assisting the Prime Minister for Digital Government also reinforces the close alignment between the two men as they plan the foundations for a 21st century government.\nThe addition of innovation to the industry and science portfolio under Christopher Pyne sends a clear message about the connectedness of these areas. Pyne’s previous role as education minister should have also primed him to the importance of STEM subjects and computational thinking in ­developing skills for the future.\nSimon Birmingham has taken over as Education Minister having previously assisted this role, and he’s already talking about the impacts of technological disruption and the need to ensure our education system is better at delivering the skills employers need. Pyne and Birmingham now face the daunting task of transforming the very foundations of our education system. This will take time and require a significant reskilling of educators as well as a rethink of how we prepare students for the unfolding digital revolution.\nOne particularly encouraging move is the appointment of Jamie Briggs to the new portfolio of ­Minister for Cities and the Built Environment. In flagging greater government involvement in urban planning, Turnbull said, “We often overlook the fact that liveable cities, efficient, productive cities, the environment of cities, are economic assets.”\nThe rise of knowledge-intensive industries has been accompanied by greater urbanisation, putting pressure on the world’s biggest cities to manage their populations and supporting infrastructure. Turnbull’s clear agenda to leverage knowledge sectors for economic growth means it will be important to carefully plan urban development to ensure the necessary infrastructure is in place to meet the needs of knowledge workers and their communities.\nWith much of the industrial and economic wealth already centred in Sydney and Melbourne, greater focus on ways to make those cities function more ­efficiently can only benefit their citizens and help drive economic growth, while providing useful ­lessons for other cities.\nTurnbull has made a promising start and has certainly generated considerable excitement in the technology and start-up communities with his clear focus on innovation and the need for our nation to fully embrace digital technologies.\nThe ACS looks forward to working with his government to help turn the promise into reality. A highly skilled and growing ICT profession will be at the heart of delivering these outcomes. There’s been plenty of talking — it’s now time for some decisive action. On that note, it’s encouraging to see that NSW Minister for Innovation, Victor Dominello, has travelled to South Korea for the IFIP World Computer Congress 2015 to present a keynote on the importance of data analytics for government policy development.\nHe plans to visit several big data facilities and talks with Korean officials about their experiences in working with data analytics to drive services and growth. Since South Korea is the most connected nation in the world with multinationals like Samsung, LG and Hyundai, let’s hope he also explores strategies to encourage the development of similar tech giants here in Australia.\nBrenda Aynsley OAM is president of the ACS, principal consultant with ICT management firm Oz Business Partners and chair of IFIP’s IP3 International Professional Practice Partnership.", "external_links": [], "published": "2015-10-06T08:00:00.000+03:00", "crawled": "2015-10-07T17:25:11.585+03:00", "highlightTitle": ""}