{"organizations": [], "uuid": "79b9f6d6234de83076040ceb71980e2e2734c6da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/technology.html", "section_title": "Technology", "url": "https://www.prbuzz.com/technology/351510-feelingsa-unique-social-media-app-for-emotions-is-announced.html", "country": "US", "title": "Feelings—A Unique Social Media App For Emotions is Announced", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Feelings—A Unique Social Media App For Emotions is Announced", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "79b9f6d6234de83076040ceb71980e2e2734c6da"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/technology/351510-feelingsa-unique-social-media-app-for-emotions-is-announced.html", "ord_in_thread": 0, "title": "Feelings—A Unique Social Media App For Emotions is Announced", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VALLETTA, Malta—October 12, 2015—Feelings, a unique social media application about emotions has been announced. Already available on android via the Google Play store (click here to check out the app), this innovative app is like an anonymous ‘Instagram’ for expressing emotions.\nFeelings was created because of you and for your emotional well-being. Your daily stresses, doubts, untold unhappiness and ultimate need for free expression inspired us to create a safe-haven in cyberspace for all the emotions we want to express.\nThis is more than just social media; Feelings can be the first step in reaching out for those who are struggling on a day to day basis. If someone is feeling weak, lonely, troubled, depressed or unloved, the app gives them the opportunity to anonymously share their story using both pictures and text. More often than not, sharing what they feel is enough to make a person feel better about a situation. It can be the push they need to start on the road to recovery or to ask for help! But it not just about the negative feelings we have, it’s about the positive ones too!\nHowever, before everyone can anonymously post their emotions, Feelings needs help. That’s why they launched this Kickstarter campaign . The goal of this project is to raise €10,000 by November 16, 2015. The funds raised will go towards completing the iOS version of the application.\nTo help bring this innovative app to a wider market, please visit the Kickstarter campaign or click here . Perks will be delivered between December 2015 and April 2016.\nPlease keep in mind this is an “all-or-nothing” deal, which means that if the campaign does not reach the funding goal then the project cannot move forward. So any amount given can make a difference, and this is an incredible opportunity to be a part of a special campaign! Help Feelings reach the goal by sharing this on Facebook, Twitter, and other social networks, or by simply making a pledge!\nContact: Michelle Trabelsi\nTitle: Public Relations\nPhone: +356 9932 8347\nEmail: This email address is being protected from spambots. You need JavaScript enabled to view it.\nWebsite: www.thefeelingsapp.com", "external_links": ["https://www.kickstarter.com/projects/siliconmalta/feelings-an-app-to-anonymously-share-your-emotions?ref=project_link", "https://play.google.com/store/apps/details?id=com.thefeelingsapp.feelings"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-13T17:05:50.332+03:00", "highlightTitle": ""}