{"organizations": [], "uuid": "aaed7f655ab01aef20a78ffa60b6aa70631dcb8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mnn.com", "main_image": "http://media.mnn.com/assets/images/2015/10/dogs%20playing.jpg.600x315_q80_crop-smart.jpg", "site_section": "http://www.mnn.com/feeds/tag/technology/", "section_title": "Technology", "url": "http://www.mnn.com/family/pets/stories/app-helps-you-find-pal-your-pup", "country": "US", "title": "App helps you find a pal for your pup", "performance_score": 0, "site": "mnn.com", "participants_count": 1, "title_full": "App helps you find a pal for your pup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T19:46:00.000+03:00", "replies_count": 0, "uuid": "aaed7f655ab01aef20a78ffa60b6aa70631dcb8f"}, "author": "Laura Moss", "url": "http://www.mnn.com/family/pets/stories/app-helps-you-find-pal-your-pup", "ord_in_thread": 0, "title": "App helps you find a pal for your pup", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "App helps you find a pal for your pup Many dogs enjoy the company of other canines, and now technology can help. October 16, 2015, 12:46 p.m. 1 0 0 It's best to pair your pooch with a dog of similar size that enjoys the same activities. (Photo: Adya/Shutterstock) \nDogs are social animals just like us, and while they enjoy human companionship, they may also appreciate spending time with friends of their own species. Playing with other dogs is mentally stimulating and a great way for your dog to exercise , and it also keeps your canine’s communication and social skills polished. \nThere are numerous places to find a playmate for your pooch, including visiting dog parks and doggy day cares or simply meeting up with friends and neighbors with canine companions. \nAnd now there’s also an app for that. \nPHOTO BREAK: 7 inspiring tales of loyal service animals \nPoochPal is a social network for dogs and their owners that uses location-based technology to help you find a pal for your pup. Users can view and comment on dogs’ photos and even arrange meet-ups with potential playmates. \nHowever, before you set up a playdate for your dog, make sure he enjoys playing with members of his own species. \nWhen your dog meets other dogs, how does he react ? If he wags his tail, play bows, sniffs the other dog and whines with excitement, your dog will probably be thrilled to have a puppy pal. \nOn the other hand, if your pooch indicates that he’s not interested in other dogs by trying to avoid them, hiding behind you or showing aggression by growling or snapping teeth, then your dog is likely happy enough with human companionship alone. \nWhen looking for a playmate for your dog, the ASPCA recommends pairing opposite-sexed dogs as they’re more likely to get along. However, there are always exceptions to this rule. \nAlso, look for dogs that are similar in build to your dog, so neither one is likely to be harmed during highly physical play . \nIf you have a dog that’s 2 years of age or younger, he’ll probably enjoy playing with other young, energetic friends, but older dogs may prefer more mature companions. \nObserve your dog in play and see what he enjoys. Some dogs like to wrestle while others prefer stalking and chasing each other. Pairing your pup with a dog that enjoys similar activities will ensure their play sessions will be fun and fulfilling for both of them. \nOverall, the most important thing you can do when pairing your dog with a new friend is to pay attention to what your dog wants. \n“Note which [dogs] she seems most excited to see and which ones she plays with the longest,” the ASPCA suggests. “If she consistently ignores another dog or tries to stop play — by leaving the area, hiding, growling, showing her teeth or snapping at the other dog — listen to what she’s saying. She might prefer another playmate.” \nLearn more about PoochPal in the video below. Related on MNN:", "external_links": [], "published": "2015-10-16T19:46:00.000+03:00", "crawled": "2015-10-16T20:18:59.601+03:00", "highlightTitle": ""}