{"organizations": ["Clean Diesel Technologies, Inc", "PACCAR"], "uuid": "90b98889afda535ba22a3ba83944bb0cb9d1ccff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/324115?filename=324115.jpg&amp;size=1", "site_section": "http://globenewswire.com/SubscribeToRss/6_hz_cuyxYM4FsjSa6_E8w%3d%3d", "section_title": "GlobeNewswire: Clean Diesel Technologies, Inc.", "url": "http://globenewswire.com/news-release/2015/10/08/774556/10152018/en/CDTi-and-PACCAR-Parts-Sign-Multi-Year-Distribution-Agreement-for-DuraFit-TM.html?f=22&fvtc=4&fvtv=7434", "country": "US", "title": "CDTi and PACCAR Parts Sign Multi-Year Distribution Agreement for DuraFit(TM)", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "CDTi and PACCAR Parts Sign Multi-Year Distribution Agreement for DuraFit(TM)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T15:00:00.000+03:00", "replies_count": 0, "uuid": "90b98889afda535ba22a3ba83944bb0cb9d1ccff"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/08/774556/10152018/en/CDTi-and-PACCAR-Parts-Sign-Multi-Year-Distribution-Agreement-for-DuraFit-TM.html?f=22&fvtc=4&fvtv=7434", "ord_in_thread": 0, "title": "CDTi and PACCAR Parts Sign Multi-Year Distribution Agreement for DuraFit(TM)", "locations": ["North America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CDTi and PACCAR Parts Sign Multi-Year Distribution Agreement for DuraFit(TM) PACCAR Parts North America to Sell DuraFit(TM) Through Its Extensive Truck Dealership Network October 08, 2015 08:00 ET | Source: Clean Diesel Technologies, Inc. \nOXNARD, Calif., Oct. 8, 2015 (GLOBE NEWSWIRE) -- Clean Diesel Technologies, Inc. (Nasdaq: CDTI ) (\"CDTi\" or \"the Company\"), a leader in advanced emission control technology, signed a multi-year contract with PACCAR Parts to distribute CDTi's DuraFit™ diesel particulate filters (DPFs) to its North American network of more than 670 Peterbilt and Kenworth dealerships. PACCAR Parts operates a network of parts distribution centers offering aftermarket support to Peterbilt, Kenworth and DAF dealers and customers around the world. Shipments to PACCAR Parts are expected to commence during the current quarter. \n\"Our agreement with PACCAR represents a key milestone in our plan to secure national distribution channels for DuraFit original equipment manufacturer (OEM) replacement DPFs in North America,\" stated Eric Bippus, CDTi's Executive Vice President of Sales and Marketing. \"PACCAR has earned a reputation for unsurpassed quality and PACCAR Parts is a leader in the distribution, sales and marketing of aftermarket parts that provide higher levels of quality and value. DuraFit DPFs are available for almost every major diesel OEM. PACCAR's national network provides a premier platform for CDTi to pursue the multi-million dollar opportunity for replacement DPFs.\" \nDesigned and manufactured in North America, DuraFit DPFs are exact-fit OEM replacements that meet or exceed OEM emissions requirements. DuraFit DPFs are backed by an industry-leading 2-year, unlimited mileage warranty and are fully-supported by a growing distributor network and field application specialists. \nDuraFit DPFs address the fast-growing heavy duty aftermarket to replace original equipment DPF units. According to market analysis firm Power System Research, North American OEMs have produced an average of 250,000 heavy duty on-road diesel vehicles equipped with DPFs each year since 2007 to comply with U.S. Environmental Protection Agency requirements. The typical 5-year OEM warranty on DPFs has expired for many of these vehicles which are now owned by second or third owners. In many medium and heavy duty diesel vehicles, the DPF is expected to be replaced two or three times during the vehicle's lifetime. According to a 2012 industry report, the market for medium and heavy duty vehicle after-treatment maintenance and repair is projected to grow to $3.0 billion by 2017. \nFor more information on CDTi's line of DuraFit™ products, please visit www.durafit-exhaust.com , email us at info@durafit-exhaust.com or call us toll free at 1-800-753-3212. \nAbout PACCAR and PACCAR Parts \nPACCAR is a global technology leader in the design, manufacture and customer support of premiumlight-, medium- and heavy-duty trucks under the Kenworth, Peterbilt and DAF nameplates. PACCAR also designs and manufactures advanced diesel engines, provides financial services, information technology, and distributes truck parts related to its principal business. PACCAR reported total worldwide Revenue of $18.99 billion in 2014 and delivered 142,900 new trucks to its customers. \nPACCAR Parts, a division of PACCAR, is a global leader in the distribution, sales and marketing of aftermarket parts for heavy and medium-duty trucks, trailers, buses, and engines. Featuring state-of-the-art distribution processes, award-winning sales and marketing programs and industry-leading quality management, PACCAR Parts provides aftersales support to DAF, Kenworth and Peterbilt dealer locations around the world. PACCAR Parts reported total worldwide Aftermarket Parts Revenue of $3.1 billion in 2014. \nAbout CDTi \nCDTi manufactures and distributes vehicle emissions control products that leverage its advanced materials technology. CDTi utilizes its proprietary technology to provide high-value sustainable solutions to reduce emissions, increase energy efficiency and lower the carbon intensity of on- and off-road combustion engine systems. Continuing its focus on innovation and a strategy to scale its business globally, CDTi is pursuing a Powder-to-Coat (P2C™) business model that exploits high-performance, advanced low-platinum group metal (PGM) emission reduction catalysts. Key technology platforms include Mixed Phase Catalyst (MPC®), Base Metal Activated Rhodium Support (BMARS™), Synergized PGM (SPGM™), Zero PGM (ZPGM™) and Spinel™. CDTi is headquartered in Oxnard, California and has operations in Canada, Japan, the United Kingdom and Sweden. For more information, please visit www.cdti.com . \nForward-Looking Statements \nCertain information contained in this press release constitutes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including any statements that are not statements of historical fact. You can identify these forward-looking statements by the use of the words \"believes\", \"expects\", \"anticipates\", \"plans\", \"may\", \"will\", \"would\", \"intends\", \"estimates\", \"promises\", and other similar expressions, whether in the negative or affirmative. Forward-looking statements are based on a series of expectations, assumptions, estimates and projections which involve substantial uncertainty and risk. In this press release, the Company includes forward looking statements regarding the potential benefits of CDTI's DuraFit replacement DPFs, the ability of PACCAR Parts to distribute CDTI's products, the potential market size for medium and heavy duty vehicle after-treatment maintenance and repair, and the anticipated further testing, development, potential applications, commercialization opportunities and potential benefits of CDTi's catalyst technologies. In general, actual results may differ materially from those indicated by such forward-looking statements as a result of risks and uncertainties, including, but not limited, to (i) any inability of the Company to (a) decrease costs, (b) increase sales, (c) obtain adequate funding, (d) retain existing or secure new customers (e) protect its intellectual property, (f) successfully evolve into an advanced materials supplier or, even if successful, achieve profitability, (g) successfully market its DuraFit replacement DPFs and other new products; (h) obtain required product verification or approvals, (i) attract or retain key personnel, or (j) realize benefits from investments; (ii) prices of PGM and rare earth metals; (iii) supply disruptions or failures; (iv) regulatory, marketing and competitive factors; (v) environmental harm or damages, (vi) changes in domestic and international market and political conditions; and (vii) other risks and uncertainties discussed or referenced in the Company's filings with the Securities and Exchange Commission, including its most recent Annual Report on Form 10-K. In addition, any forward-looking statements represent the Company's estimates only as of the date of such statements and should not be relied upon as representing the Company's estimates as of any subsequent date. The Company specifically disclaims any obligation to update forward-looking statements. All forward-looking statements in this press release are qualified in their entirety by this cautionary statement. \nContact Information: \nBecky Herrick or Cathy Mattison LHA (IR Agency)", "external_links": [], "published": "2015-10-08T15:00:00.000+03:00", "crawled": "2015-10-12T12:37:30.954+03:00", "highlightTitle": ""}