{"organizations": [], "uuid": "956484a548cad9c1b097903ef88e637632383f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.tribuneindia.com", "main_image": "", "site_section": "http://www.tribuneindia.com/news/features/science-technology/", "section_title": "The Tribune: Science/technology/gadgets/environment ", "url": "http://www.tribuneindia.com/news/travel/soaking-in-the-wettest-place-on-earth/149620.html", "country": "US", "title": "Soaking in the wettest place on earth", "performance_score": 0, "site": "tribuneindia.com", "participants_count": 1, "title_full": "Soaking in the wettest place on earth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "956484a548cad9c1b097903ef88e637632383f24"}, "author": "tribuneindia.com", "url": "http://www.tribuneindia.com/news/travel/soaking-in-the-wettest-place-on-earth/149620.html", "ord_in_thread": 0, "title": "Soaking in the wettest place on earth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chitvan Singh Dhillon\nI hear leaves drinking rain; I hear rich leaves on top Giving the poor beneath\nDrop after drop;\n’Tis a sweet noise to hear These green leaves drinking near Looking around at the sweeping view of the undulating topography, subterranean gorges and luscious emerald green valley’s with boisterous, grand waterfalls all over the place, one feels like the fresh fronds in William Henry Davies’s poem — though tad bit luckier because it does not pour heavily but a light drizzle pervades the atmosphere. Geography textbooks taught us that a scenic village called Mawsynram is the wettest place on earth. That information, however, has to be rationalised: because Cherrapunjee or Shora, as it is locally called, has seized the coveted ‘Wettest place on planet earth’ title from Mawsynram after a decade! The delightfully wet hill station of Cherrapunjee is 56 km away from Shillong and it takes an enjoyable drive of about 90 minutes on a clear day. However, during the monsoon, the drive may take longer! In which case, you’d be luckier, because you get to spot innumerable waterfalls around each corkscrew bend curve, each unique in its own way. After whizzing past little hamlets, occasionally stopping by petite kiosks for a cuppa hot, fragrant cardamom chai, one reaches the mighty Mawdok Bridge, the entrance beckoning your arrival to Cherrapunjee. You find yourself wrapped in a misty chiffon-like veil with the light as air clouds descending at your feet only adding to the enthusiasm and thrill. You will realise then as to why Meghalaya is called the abode of clouds and Cherrapunjee as the “Crescent jewel of Meghalaya”. After some more winding drenched roads and precipitous landscape later, you arrive at a diminutive hamlet called Sohrarim. This was the original Cherrapunjee village. One can spot many waterfalls bursting out of the mountains, like nature’s live magic show-free of cost! The drive to Cherrapunjee goes through magnificently undulating grasslands, spreading far and wide and gigantic stretches of striking rocks. It is satisfying to watch groups of rose-cheeked schoolchildren with colourful umbrellas merrily walking back home from school, with a spring in their walk and sunny smiles on their faces. As one stares at the desolate mighty cliffs from the car window, perhaps, the first thing that meets the travellers’ eyes is an imposing yellow billboard which read as follows, “Cherrapunjee — The wettest place on planet earth” set against the backdrop of petite shops and kiosks. Cherrapunjee was the administrative capital until the British shifted the capital to Shillong. What was once a bustling settlement now resembles a ghost town with a population of only 10,000! A walk around the bazaar clearly demonstrated that womenfolk manned the show here. Women are single-handedly running shops, selling pork and beef, vegetables, and grocery items. Well, three cheers to women power! During the orange spell, one can get not only the famous saccharine oranges but also preserved bottles of orange honey. Just a few kilometres beyond the main city, one encounters the most stunning of waterfalls of Meghalaya, the 1000 ft Kynrem Falls that descend in three stately stages, thundering down the high cliff. Like an imposing swashbuckler, it puts the much-hyped Niagara Falls to shame! Most of the time it is enclosed in thick twirling mist and you can hear its rowdy reverberations as it cascades like a mighty giant at incredible speed. It puts your patience to test. If you pass with flying colours, it will lift its veil only for you, affording an extraordinary sight — one that your mind immediately photographs and permanently stores it in your memory folder. Just when you think you’ve seen them all, Cherrapunjee surprises you with the Khoramah Falls in the Thangkarang Park constructed over the cliffs overlooking the vast flood plains of Bangladesh. Then there are the Mawsmai Caves — the famed limestone caves with fossils and steatites hidden inside them. Cherrapunjee also houses the famous living roots bridge. Driving up to Mawlong village, an hours’ drive from Cherrapunjee, there is a small headland above the road from where you can see almost a dozen waterfalls tumbling down in all directions. Mawlong boasts of the tag of ‘Asia’s cleanest village’ and rightly so. Pretty little hutments on either side of the pathway, villagers greet you with smiling faces, their children running after chickens. You walk down a moss-infested path to the living roots bridge, a forest replete with wild orchids, epiphytes, fresh ferns and other tropical forest trees for company. After walking down for about 10 minutes — an engineering marvel of the Khasis, leaves you too stunned to react. The centuries-old living roots bridge is developed from intertwining roots of a rubber tree. It grows across the stream to safely anchor on the opposite bank. In time, it made a strong platform for the villagers to reach the other side of the village. Those of you nature lovers, who are planning a trip to Cherrapunjee, have at least a week with you to do all this at a more realistic pace!", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T07:04:33.839+02:00", "highlightTitle": ""}