{"organizations": [], "uuid": "785fa51445846e5f07156d93aaa3114f9fefa9e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139056/kodak-capture-pro-software-helps-businesses-eliminate-hidden-cost-bad-data-", "country": "US", "title": "Kodak Capture Pro Software Helps Businesses Eliminate the Hidden Cost of Bad Data", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Kodak Capture Pro Software Helps Businesses Eliminate the Hidden Cost of Bad Data", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T16:00:00.000+03:00", "replies_count": 0, "uuid": "785fa51445846e5f07156d93aaa3114f9fefa9e1"}, "author": "admin", "url": "http://www.freshnews.com/news/1139056/kodak-capture-pro-software-helps-businesses-eliminate-hidden-cost-bad-data-", "ord_in_thread": 0, "title": "Kodak Capture Pro Software Helps Businesses Eliminate the Hidden Cost of Bad Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/12/2015 @ 6:00 AM   Kodak Alaris \nROCHESTER, NY -- (Marketwired) -- 10/12/15 -- Poor data quality as a result of incorrect, missing, or duplicate data costs businesses on average $14.2 million annually . One way to ensure the accuracy of data is to leverage optical character recognition (OCR) technology that can capture, index and eliminate data entry fails from the start. \nToday, Kodak Alaris releases its new Kodak Capture Pro Software v5.1 with point and click OCR that virtually eliminates costly errors from manual entry by allowing users to click on a word to add it to an index data field. Supporting 17 GUI languages and 126 OCR languages, the solution integrates seamlessly with any scanner from Kodak Alaris as well as most third-party scanners (more than 200 are supported), making it a versatile solution for busy office environments and service bureaus that serve a variety of industries including finance, healthcare, transportation, manufacturing and government. \nA proven solution for today's connected enterprise \nKodak Capture Pro Software is an established scanning solution that helps businesses automate their paper intensive business processes by transforming paper documents into critical business information. With Capture Pro, businesses can run complex jobs with push-button ease, enhance data integrity and reduce the time and cost spent on document management. For example: Chesapeake Document Services (CDS), a service bureau in White Plains, Maryland, serves two regional hospitals as its largest clients. Kodak Alaris scanners and Capture Pro software have helped CDS to reduce data entry time by approximately 50% and speed up turnaround times significantly -- providing faster data access for hospital clients. MISL , a document management company in the UK tasked with digitizing hundreds of thousands of patient records for The Royal Free London NHS Foundation Trust -- one of the most prominent hospitals in the country -- is leveraging scanners from Kodak Alaris and Capture Pro Network Edition to convert some 750,000 records, including 300 million images, to digital records. The project is slated to be complete by end of year, a full two years ahead of schedule. Clark County Department of Family Services , a public agency in Nevada, employs a complete document management solution from Kodak Alaris, including scanners and Capture Pro software to manage its continuously growing document volumes. The solution has enabled Clark County to achieve much greater efficiency and reduce process times to expedite benefit eligibility and other key decisions. \nKodak Capture Pro Software is a proven solution, having shipped more than 340,000 licenses worldwide. \n\"Its longevity and market acceptance can be attributed to Kodak Alaris' ongoing investment in improving the application and continuous focus on responding to customer needs,\" said Emma Isichei, Director of Capture Solutions for Kodak Alaris' Information Management division. \"Users benefit by streamlining the process of scanning documents and routing information into ECM systems and business applications, which enables a host of productivity enhancements that lead to faster, smarter business decisions.\" \nA closer look at Capture Pro v5.1 \nIn addition to point-and-click OCR indexing, enhancements to the new release of Kodak Capture Pro Software include: Active Directory Support - A new feature that allows IT departments to control who has access to the application, leading to better security. Support for Windows 10 - Provides users with a smooth transition to the latest Microsoft operating system. Output to Office 365 - Interoperable with SharePoint Server and SharePoint online for easy connectivity with external applications. \nStanding out from the crowd \nKodak Capture Pro Software was selected as the winner of a Buyers Laboratory (BLI) Summer 2015 Pick Award for Outstanding Production Scan Solution. Capture Pro v5.0 was recognized for its ease of use, feature set, productivity, integration capabilities and overall value. BLI previously selected Capture Pro v4.5 as its Summer 2014 Pick Award winner in the same category, making this the second year in a row that Kodak Alaris has received this recognition. BLI also gave Capture Pro Software a 4.5 out of 5 star rating in a Solutions Report published earlier this year. To read the full report, please visit http://bit.ly/1H6sjOZ . \nFor more information, and to get started on the journey from basic document scanning to advanced capture solutions, download the Kodak Alaris whitepaper, The Future of Intelligent Document Capture . \nAbout the Information Management Division of Kodak Alaris Kodak Alaris is a new company driven by the simple belief that \"we can always find a better way.\" Our Information Management division helps organizations capture content from digital and paper sources, extract insights, and deliver the right information to the right place at the right time for better business outcomes. Our portfolio includes award-winning document scanners, a global service and support team, and software and solutions that capture and intelligently manage information. For small offices and large-scale organizations, we provide new ways to automate processes, improve customer interactions and make smarter business decisions. \nTo learn more, please visit www.kodakalaris.com/go/IMnews . Follow us on Twitter at twitter.com/kodakdi and twitter.com/KodakDI_EAMER and visit our blog at informationdynamix.com . \nThe Kodak trademark and trade dress are used under license from Eastman Kodak Company. Contact:", "external_links": [], "published": "2015-10-12T16:00:00.000+03:00", "crawled": "2015-10-12T16:45:00.179+03:00", "highlightTitle": ""}