{"organizations": [], "uuid": "a6d38fc0401b373fc11a67444bd527edb491acf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278881/technology", "section_title": "Technology - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30302138/cablevision-monterrey-selects-tethrons-enterprise-mobility-platform", "country": "US", "title": "Cablevision Monterrey Selects TethrOn's Enterprise Mobility Platform", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Cablevision Monterrey Selects TethrOn's Enterprise Mobility Platform - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T11:07:00.000+03:00", "replies_count": 0, "uuid": "a6d38fc0401b373fc11a67444bd527edb491acf1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30302138/cablevision-monterrey-selects-tethrons-enterprise-mobility-platform", "ord_in_thread": 0, "title": "Cablevision Monterrey Selects TethrOn's Enterprise Mobility Platform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Robust offline sync, rapid deployment model, flexibility to grow, and ease of in-house maintenance key factors in selection.\n SAN RAMON, CA, October 20, TethrOn announced today that Mexico-based telecommunications company Cablevision Monterrey, has selected TethrOn as its chosen mobility enablement platform. TethrOn's enterprise mobility platform will allow Cablevision to rapidly build robust mobile apps.\nCablevision selected TethrOn after an extended review of options, including custom app development and other mobile development platform solutions.\nDirector of I.T. Jose Quinonez Lopez, speaking on behalf of Cablevision, reports, \"Our requirement was to get a framework to accelerate mobile applications development. Our first project is a door-to-door selling application. We need the project implemented in less than two months. We chose TethrOn to handle this challenge.\"\nTethrOn's \"no code\" development approach means that comprehensive mobile applications can be built rapidly. The TethrOn enterprise mobility platform includes prebuilt backend connectors, data access code, synchronization of data and security. This frees developers to focus on defining business processes and creating a branded user interface.\nWhen making their decision, Cablevision was satisfied with the ease of building mobile apps using TethrOn's technology. The end-to-end process for developing an app using TethrOn's enterprise mobility platform, encompasses data integration, app development and configuration in a single, point and click development environment.\nFurthermore, the TethrOn platform includes a high performance offline sync engine, which outperformed competing products that were evaluated by Cablevision. This combination of rapid app deployment, and high performance sync, made the TethrOn solution stand out as the best path for Cablevision in developing enterprise-grade mobile applications.\nQuinonez confirmed the selection of TethrOn's platform, \"We look forward to using TethrOn as the platform to meet our upcoming needs for mobile business applications.\"\nAbout TethrOn\nTethrOn's enterprise mobility platform delivers enterprise-grade mobile apps with zero code. The platform makes it quick to turn legacy, cloud, and custom enterprise systems into data-rich next generation mobile apps. TethrOn is privately held and headquartered in San Ramon, California. www.tethron.com\nAbout Cablevision\nTelevision Internacional, S.A. de C.V. (TVI) is one of Mexico's largest telco providers in Mexico offering Broadband, telephony and Digital TV services in Mexico's Northeast region. The Company is partially owned by Televisa Group and Multimedios Group. TVI coverage includes the States of Nuevo Leon, Coahuila, Tamaulipas and San Luis Potosi with solutions for Residential and Corporate markets.\nWith more than 40 years in the market, over 600,000 subscribers and more than 1,300,000 services installed, TVI leads the market in the Region, serving the Residential Market with izzi and Cablevision brands and the Corporate Market with TELUM brand. For more information, visit www.cablevision.com.mx and www.telum.mx\nPress contacts:\nTethrOn\nPamela Swingley\nTethrOn Media Liason\nTethrOn a division of aMind Solutions LLC\n5000 Executive Pkwy Suite 305, San Ramon, CA 94583\nTelephone: +1 (925) 804-6139\nEmail: pswingley@tethron.com\nCablevision\nMatias Bahena\nMarketing Director\nTelevision Internacional, S.A. de C.V.Paricutin 550\nCol. Nuevo Repueblo\nMonterrey, NL 64700\nMexico\nTelephone: +52-81-8880-1101\nEmail: matias.bahena@mmredes.com\n release/cablevision-monterrey-selects-tethrons-enterprise-mobility-platform-414427.php", "external_links": ["http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/cablevision-monterrey-selects-tethrons-enterprise-mobility-platform-414427.php"], "published": "2015-10-20T11:07:00.000+03:00", "crawled": "2015-10-20T13:47:28.357+03:00", "highlightTitle": ""}