{"organizations": [], "uuid": "eea69861cfae11aba039f63a751e78a3a2bd4c70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.naval-technology.com", "main_image": "", "site_section": "http://www.naval-technology.com/feeds/site-feed.xml", "section_title": "Naval Technology-Updates", "url": "http://www.naval-technology.com/contractors/patrol/cnim/", "country": "", "title": "CNIM-Landing Craft and Multipurpose Patrol Craft", "performance_score": 0, "site": "naval-technology.com", "participants_count": 0, "title_full": "CNIM-Landing Craft and Multipurpose Patrol Craft", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T18:23:00.000+03:00", "replies_count": 0, "uuid": "eea69861cfae11aba039f63a751e78a3a2bd4c70"}, "author": "", "url": "http://www.naval-technology.com/contractors/patrol/cnim/", "ord_in_thread": 0, "title": "CNIM-Landing Craft and Multipurpose Patrol Craft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Make An Enquiry \nCNIM Group designs and produces turnkey industrial solutions with high technological content and offers expertise, services and operating solutions in the fields of Environment, Energy, Defense and Industry. \nCNIM is based on a stable family shareholding, guaranteeing its development. CNIM has 2660 employees in 14 countries and generated sales of €665m in 2011. 58.5% of sales are from exports. CNIM is listed on the Eurolist of Euronext Paris - Compartment B. \nIn the field of Defence, CNIM provides major state and industrial players, both in France and abroad, with high-performance systems for the following: Dissuasion: nuclear submarine missile launcher tubes; Laser MegaJoule simulation program; Bridging systems: modular assault bridge (SPRAT) and motorized pontoon bridge (PFM) ; Sea landing systems: L-CAT landing craft and its derivates. \nFor the naval sector, CNIM has developed and patented a new concept of landing craft for LCU, LCT and LST. It is based on the concept of a variable draft system. The concept is particularly innovative, catamaran in navigation mode, the ship transforms, thanks to its mobile central platform being lowered, to a landing barge for landing and entering in a well deck. L-CAT® - Landing Catamaran \nL-CAT® is a fast landing craft dockable adapted to modern LPD or LHD. With is patented lift platform, L-CAT® developed by CNIM is the only vessel able to accomplish amphibious operation with high payload in rough seas or shallow water, Chosen by the French Navy in 2009, L-CAT® is a new generation of expeditionary transport system for military purposes, humanitarian operations, and civilian logistics support. \nMain characteristics: Length: 30 m - Beam: 12.60 m Fore draft for landing: 0.60 m Speed: up to 28 kts according the payload L-Cat® S \nL-Cat® S is a fast landing craft dockable in modern LPD and LHD. Issue from the L-Cat® experience, the L-Cat® S is a vessel with increased payload (loading capacity up to two main battle tanks) keeping same extraordinary performances of manoeuvrability, beaching and loading / unloading from any slipway / quay. \nMain characteristics: Length: 35 m - Beam: 12.60 m Fore draft for landing: 0.76 m Max. payload: 125 t Speed: up to 25 kts according the payload L-Cat® 44 \nL-Cat 44 is a Multi Purpose Landing Catamaran optimized for shore to shore operations with a high payload. Based on the L-Cat technology, with its patented lift platform, it is the only one vessel able to accomplish amphbious operations with high payload in rough seas or shallow water. It is adapted to LHD/LPD for the « stern marriage » operations, transforming into a fast ship to shore connector with very high capacities. \nMain characteristics: Length: 44 m - Beam: 17.4 m Autonomy: 2,000 Nm Speed: 21 kts MPC - Multipurpose Patrol Craft \nMultipurpose Patrol Craft (MPC) is designed for all the tasks of law enforcement at sea. It's a versatile ship, a patrol ship with cargo and landing capabilities. It can operate as a small mother ship for launching of high speed RHIBs, It brings a global oil spill response from offshore to coastal area. \nMain characteristics: Length: 40 m - Beam: 17.4 m Autonomy: 1,500 Nm", "external_links": [], "published": "2015-10-15T18:23:00.000+03:00", "crawled": "2015-10-16T12:08:40.932+03:00", "highlightTitle": ""}