{"organizations": [], "uuid": "a66c474024e7f61747c22db4cc1deabd32348936", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/i9cPMODrA.SA/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-01/homeland-security-adviser-lisa-monaco-on-battling-islamic-state", "country": "US", "title": "Homeland Security Adviser Lisa Monaco on Battling Islamic State", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Homeland Security Adviser Lisa Monaco on Battling Islamic State - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T06:03:00.000+03:00", "replies_count": 0, "uuid": "a66c474024e7f61747c22db4cc1deabd32348936"}, "author": "Charlie Rose", "url": "http://www.bloomberg.com/news/articles/2015-10-01/homeland-security-adviser-lisa-monaco-on-battling-islamic-state", "ord_in_thread": 0, "title": "Homeland Security Adviser Lisa Monaco on Battling Islamic State", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vladimir Putin told me he’d rather fight Islamic State in Syria than back home, but he clearly still supports Assad. How do you respond to that?\nThe Assad government and what it has done to its people through the use of barrel bombs and other atrocities is a magnet for extremists. And indeed, foreign fighters flow into Syria. Assad is not a counterterrorism partner. He’s not going against ISIL. If the Russians want to make some constructive contributions to the fight against ISIL, that’s a good thing. I would say, however, there’s no need to reinvent the wheel. The president began—and continues to lead—a coalition of60-some-odd nations countering ISIL.\nHow is Islamic State different from what we’ve come up against in the past?\nIt’s a threat different in kind from al-Qaeda and its affiliates. They’ve displayed an almost apocalyptic ambition, certainly a brutality that’s been unprecedented. They’ve shown the ability to take and hold territory. ISIL’s also different in its vision of a caliphate, but the most distinguishing feature is the success and ability with social media. A few years ago, my colleagues and I were focused on al-Qaeda in the Arabian Peninsula’s use of a magazine to reach followers. That looks like the eight-track version of propaganda now.\nAre social media used mainly for recruiting?\nPeople use the term recruiting, but it’s more like enlistment, because they put the messages out there. There are some 90,000 Twitter accounts that are associated with ISIL and are sympathetic to it. A smaller number of those may be real, true ISIL members. But they themselves will have 50,000 followers at a shot, so just do the math. It’s a brutal irony, when you think about it. ISIL is a group that’s dedicated to rejecting modernity. And what they use is one of the greatest innovations that the U.S. has brought to the world.\n“They’ve displayed an almost apocalyptic ambition, certainly a brutality that’s been unprecedented”\nAnd countering this sort of propaganda falls to the State Department?\nThe State Department runs, under the leadership of Rick Stengel, something called the CSCC, which is basically a strategic communications center to provide messaging that seeks to counter ISIL’s narrative. Rick’s doing a tremendous job on that, and he’s worked to set up the Gulf version of this in the UAE. But what really needs to happen is we have to lift up the voices of those people who have traveled and found that ISIL is being hypocritical. It can’t govern. It’s not a romantic jihad. It’s a savage undertaking where women are enslaved and raped and beaten.\nWhat happened with the moderates in Syria we planned to train and equip?\nIt’s very difficult to build up, in essence, an infantry among people who are worried about their families, fighting for their lives, figuring out how to sustain themselves, even as they wonder whether or not to stay in Syria. In the cauldron of extremists and those trying to fight the regime and ISIL, it’s a very difficult challenge to vet these individuals, to make sure they can be trained, that they can be trusted. That’s the effort we’re undertaking with coalition partners, with Turkey, with Saudi Arabia, with Jordan.\nTell me about the successes you’ve had against Islamic State’s leadership.\nWe’ve been putting a tremendous amount of pressure on ISIL in Iraq and increasingly in Syria. Abu Sayyaf, who was a key finance leader, was killed during the course of a capture operation. In that raid a tremendous amount of intelligence was gathered, and that helps us understand what ISIL is doing with its finances. Also in Iraq, during coalition operations, the U.S. military was able to remove from the battlefield Haji Mutazz, the No. 2 in ISIL.\nWhat’s an example of their success with social media?\nThere are several examples of those who are in contact with ISIL here in the U.S. In fact, the FBI has made about 50 arrests in the last year of individuals who are either in contact with ISIL or they’re inspired by and seeking to travel and lend their support to ISIL. Some 30 percent of them are under the age of 21.\nWatch Charlie Rose on Bloomberg TV weeknights at 6 p.m. and 9 p.m. ET.", "external_links": [], "published": "2015-10-02T06:03:00.000+03:00", "crawled": "2015-10-02T01:22:45.889+03:00", "highlightTitle": ""}