{"organizations": [], "uuid": "3be0cdb784731782443f5fd3b9e002e81839d6b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/07/13009892/2015 EDD WINN LOGO.jpg", "site_section": "http://www.prweb.com/rss2/technology.xml", "section_title": "Technology", "url": "http://www.prweb.com/releases/2015/10/prweb13009892.htm", "country": "US", "title": "eSchoolPLUS 4.0 Named Best Online Student Information System in ComputEd Gazette’s EDDIES", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "eSchoolPLUS 4.0 Named Best Online Student Information System in ComputEd Gazette’s EDDIES", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "3be0cdb784731782443f5fd3b9e002e81839d6b1"}, "author": "Lori Hixon", "url": "http://www.prweb.com/releases/2015/10/prweb13009892.htm", "ord_in_thread": 0, "title": "eSchoolPLUS 4.0 Named Best Online Student Information System in ComputEd Gazette’s EDDIES", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SunGard K-12 Education today announced eSchoolPLUS 4.0 was named Best Online Student Information System in ComputEd Gazette’s 20th Annual Education Software Review Awards Program (EDDIE Awards). The next-generation student information system, eSchoolPLUS 4.0 is a forward-thinking solution for student information management that helps educators directly and positively impact student achievement. This solution provides advanced tools and at-a-glance insights that promote collaboration between administrators, teachers, parents, and students. Highly customizable smart search functionality throughout the software puts ad-hoc reporting capabilities at the fingertips of educators. And, with SunGard K-12’s hallmark PLUS 360 Notifications, eSchoolPLUS 4.0 mines student data to help increase user efficiency by allowing educational stakeholders to choose to be automatically alerted when certain events occur or criteria are met.\nThe solution’s smart user interface supports usability with features including responsive design, advanced navigation tools, and mobile-first design concepts, such as tablet-friendly icons and pages and gesture-friendly screens. With HTML5 as its core technology, eSchoolPLUS 4.0 offers the same application and user experience across any browser and choice of PC, Mac®, Chromebook™ notebook computer, and iPad® or other tablet.\nThe EDDIES target innovative and content-rich programs (including apps for iPad and Android) and websites that augment the classroom curriculum and improve teacher productivity, providing parents and teachers with the technology to foster educational excellence. Some selection criteria are academic content, potential for broad classroom use, technical merit, subject approach, and management system. Winners were selected from titles submitted by publishers worldwide.\nJoel Hames, SunGard K-12 Education’s vice president of product, says the K-12 administrative software and technology services company is honored by this recognition. “We are pleased that eSchoolPLUS 4.0 has been recognized in the EDDIE Awards Program. More than a year in development, eSchoolPLUS 4.0 also has been well-received by schools and school districts,” he says. “eSchoolPLUS 4.0 leverages the latest technology to create a progressive, highly usable, and forward-thinking solution for student achievement.”\nAbout SunGard K-12 Education\nSunGard K-12 Education offers software solutions designed to help teachers, administrators, and parents support student achievement. The PLUS 360 products are a single integrated suite of software solutions for the management of student information, assessment and curriculum, special education, and financial and human resources. The suite—which provides district staff with anytime, anywhere access to important district information—can be deployed to work together to help meet educational goals and requirements or implemented as stand-alone systems. For more information, visit SunGard K-12 Education at sungardk12.com .\nAbout SunGard\nSunGard is one of the world’s leading financial software companies, with annual revenue of $2.8 billion. We provide solutions for financial services, the public sector, and education. Our software is delivered via Software as a Service (“SaaS”), in the cloud and on premises, surrounded by an extensive suite of service offerings. Through the depth and breadth of our solution portfolio, global capabilities, and domain expertise, we are uniquely capable of supporting virtually every type of financial organization, including the largest and most complex institutions in the world. SunGard’s approximately 13,000 employees proudly serve approximately 14,000 customers in more than 100 countries, bringing fresh ideas and inventive solutions to help our customers adapt and thrive. For more information, please visit http://www.sungard.com .\nTrademark Information: SunGard, the SunGard logo, eSchoolPLUS, and PLUS 360 are trademarks or registered trademarks of SunGard Data Systems Inc. or its subsidiaries in the United States and other countries. All other trade names are trademarks or registered trademarks of their respective holders.\nMac and iPad are registered trademarks of Apple Inc. Chromebook is a trademark of Google Inc.\n© SunGard 2015. All rights reserved.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5zdW5nYXJkLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3N1bmdhcmRrMTIuY29tL3N0dWRlbnQtaW5mb3JtYXRpb24tc3lzdGVtLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2NvbXB1dGVkZ2F6ZXR0ZS5jb20vcGFnZTUuaHRtbA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3N1bmdhcmRrMTIuY29t"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T14:34:03.918+03:00", "highlightTitle": ""}