{"organizations": [], "uuid": "852a2176a9d3f10eedcb312756b5fad94081b511", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3247075.1443458607!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/mars-body-of-water.jpg", "site_section": "http://rss.cbc.ca/lineup/technology.xml", "section_title": "CBC | Technology News", "url": "http://www.cbc.ca/news/technology/spelunkers-cliff-climbers-needed-for-mars-mission-bob-mcdonald-1.3252809?cmp=rss", "country": "IL", "title": "Spelunkers, cliff climbers needed for Mars mission: Bob McDonald", "performance_score": 0, "site": "cbc.ca", "participants_count": 1, "title_full": "Spelunkers, cliff climbers needed for Mars mission: Bob McDonald", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T16:39:00.000+03:00", "replies_count": 0, "uuid": "852a2176a9d3f10eedcb312756b5fad94081b511"}, "author": "Bob McDonald", "url": "http://www.cbc.ca/news/technology/spelunkers-cliff-climbers-needed-for-mars-mission-bob-mcdonald-1.3252809?cmp=rss", "ord_in_thread": 0, "title": "Spelunkers, cliff climbers needed for Mars mission: Bob McDonald", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Water discovery on Mars an 'important step,' says Winnipeg astronomer \nIt's been all-Mars, all-the-time this week, with first the announcement of evidence of flowing liquid water on the Red Planet, and then the release of the movie The Martian . But if we are to search for life in that water, it's going to take mountaineering skills that are beyond the visions of both NASA and Hollywood. \nThe dark streaks running down hillsides on Mars, which indicate seasonal water flows, are oozing out of steep cliff faces. \nYou can see similar features on mountains on Earth, where glacial water, or water from an underground stream, emerges from between layers of rock part-way down a cliff face and forms vertical streams sometimes called weeping walls. When that water freezes in winter, it forms spectacular ice cliffs, clinging to the mountainsides. Water flows that appear in spring and summer on a slope inside Mars' Newton crater are shown in this combination of orbital imagery with 3-D modeling. This image has been composed to show a view of a slope as it would be seen from a helicopter inside the crater, with a synthetic Mars-like sky. (University of Arizona/JPL-Caltech/NASA/Reuters) \nWhile the scientists do not yet know the source of the streams on Mars — whether it is melting ice, an aquifer, or a subsurface stream — it is definitely underground. That means if we want to search for life in that water, we have to either drill down from above, or do some cliff climbing to get at it. \nAnd cliff climbing on Mars presents unique challenges not found on Earth. \nAs a planet, Mars is smaller than the Earth, so its surface gravity is lower, roughly one-third what we feel here. That means getting around on Mars would be easier and faster, as you take bigger steps when walking, longer strides running and higher jumps. \nSo, you would think that scaling a cliff under low gravity would be easier as well. That's true, except that cliffs on Mars are the tallest and steepest in the solar system. \nAn extreme example is Valles Marineris , close to where the streaks were found. It's a 4,000-kilometre-long rift valley that extends a quarter of the way around the planet. On Earth, it would run from Vancouver to Toronto, making the Grand Canyon look like a crack in the sidewalk by comparison. \nCliffs on the sides of the canyon are up to 7 kilometres high, with extremely steep slopes. Again, under low gravity, soil is not pulled downward on hills as strongly as on Earth, so slopes can be at a much steeper angle. \nThe roughness of that terrain is why all the robots sent to Mars, so far, have landed in flat areas for safety, even though the canyons are much more interesting. The movie The Martian shows the same thing, where the human habitat is on the flats and astronauts use long-range rovers to reach the hills. \nHaving spent a little time in the rugged high alpine of the Canadian Rockies, I know how difficult it can be just hiking around on steep slopes, or scrambling across loose scree, or trekking up the face of a glacier. Scaling cliffs takes it to another level, literally, requiring specialized equipment, skill and strength to avoid injury. Now, imagine doing all that while wearing a space suit. Astronaut Mark Watney (Matt Damon) finds himself stranded and alone on Mars, in the film The Martian. (20th Century Fox) \nThe other option for following the liquid water on Mars is to search for caves, which could harbour underground streams. \nMars has the largest volcanoes in the solar system, with the very largest, Olympus Mons, rising 26,000 metres above the surrounding plains — three times the height of Mt. Everest. The Martian volcanoes are extinct, which means they could have empty lava tubes running throughout, similar to those seen on the big Island of Hawaii. Except on Mars, those caves could run for hundreds of kilometres underground. \nExploring caves takes another set of specialized equipment and skills. \nThe last time humans walked on another world, during the Apollo missions to the moon, astronauts only had to collect rocks that were lying on the ground, and even that wasn't easy, as they frequently fell over while bending down in their bulky space suits. \nWhen humans search for life on Mars, they are going to need the skills of spelunkers, the strength of cliff climbers, the knowledge of drillers and biologists, while working in a very cold and hostile environment. New, more flexible and rugged space suits will be required, as well as specialized equipment for scaling the extreme geography. \nThe hazards of exploring our neighbouring planet go well beyond the dust storm portrayed in the movie. (By the way, this is one area where the movie got it wrong. Winds on Mars are indeed much faster than on Earth, but the Martian atmosphere is so thin that even hurricane-scale winds do not produce much force). Martian colonists will face the threat of falling from great heights, getting buried by landslides, being trapped underground, all the while out of reach of immediate help from Earth. Survival skills, as portrayed in the movie, will be vital. \nBut if, after all that effort, we do find life in that underground water on Mars, it will be one of the greatest achievements in human exploration — finally proving that we are not alone in the universe. \nAnd that, in turn, will provide a field day for scientists, theologians, philosophers, and the makers of the sequel to The Martian. \n( Quirks & Quarks will have more on how to get to Mars, and how to survive once we get there, on the program this week.)", "external_links": [], "published": "2015-10-02T16:39:00.000+03:00", "crawled": "2015-10-02T17:05:38.937+03:00", "highlightTitle": ""}