{"organizations": [], "uuid": "52bd24d68c785760466b54096f667fe819607154", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/business", "section_title": "Vindy.com stories: Business & Technology", "url": "http://www.vindy.com/news/2015/oct/20/employers-offer-cash-back-for-health-car/", "country": "US", "title": "Employers offer cash back for health care Shopping for SAVINGSSClB", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Employers offer cash back for health care Shopping for SAVINGSSClB", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T07:00:00.000+03:00", "replies_count": 0, "uuid": "52bd24d68c785760466b54096f667fe819607154"}, "author": "", "url": "http://www.vindy.com/news/2015/oct/20/employers-offer-cash-back-for-health-car/", "ord_in_thread": 0, "title": "Employers offer cash back for health care Shopping for SAVINGSSClB", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Tue, October 20, 2015 @ 12:00 a.m. \nBy TOM MURPHY \nAP Business Writer \nPaula Bennett pockets about $3,000 a year from her employer mainly for driving about 80 miles roundtrip for a deal on doses of her Crohn’s disease treatment Remicade. \nThe extra income comes through SmartShopper, a program offered by some employers to provide cash to workers who choose quality health care options with lower prices. \n“I absolutely love the program,” said Bennett, 43, a fiscal specialist with New Hampshire’s Division for Children, Youth and Families. \nSmartShopper represents a twist in how corporate America is dealing with rising health care expenses. It’s part of a push by employers to heap more responsibility for costs onto the people who are covered by their health care plans. \nCompanies for years have raised deductibles, or the amount employees pay before most of their coverage begins. They’ve also given workers online tools to help them shop for the best deals on things like imaging exams and bloodwork. Now, some are using cash to nudge employees toward those deals. \n“We’re in the process of changing habits,” said Mitch Rothschild, founder of the health care data firm Vitals, which created SmartShopper. “And frankly there’s nothing better for changing habits than to give somebody money.” \nSmartShopper works by offering financial incentives for about 40 categories, from lab tests to some surgeries. It steers clear of areas like cancer care, though, because Rothschild says “you don’t want to hear from us on an economic incentive when your life is at stake.” \nThe program gives workers a list of potential providers in their insurance network. It rates them using standards based on the specialty, government data and patient reviews. It also tells patients providers to avoid because they may be low quality. \nIt then offers cash incentives for many of the remaining options. The incentive size depends on the care being performed and the difference in cost compared with other options. A blood test may garner a $25 reward for a worker picking a lower-cost provider. Meanwhile, someone getting bariatric surgery, which can cost upward of $20,000, could get a $500 check. \nRothschild said patients generally make a few hundred dollars each year. The biggest earner last year brought in around $3,500. The money is considered income, so anything over $600 has to be declared on a patient’s income tax return. \nBennett, the New Hampshire employee, gets about $500 every couple of months after traveling to an IV infusion center for a dose of Remicade. \nVitals, citing laws protecting patient privacy, declined to detail the savings that Bennett generates for her employer by using the infusion center. Vitals says the SmartShopper program saves, on average, about $8,000 per Remicade infusion, which a company spokeswoman says can cost anywhere from about $3,000 to $22,000 in New Hampshire. \nBennett also earns incentive payments from regular blood testing she needs to have as a thyroid cancer survivor. She’s used her extra income to help pay for a Florida trip and Christmas gifts. \nThe idea of providing an incentive for choosing care is not new. Nearly a quarter of large firms nationally provide insurance coverage with a network that groups providers with good quality ratings, according to the nonprofit Kaiser Family Foundation, which studies health care issues. Patients often get an enticement like a smaller co-payment for using providers in those networks. \nAside from shopping for the best price, employers and insurers also want patients to choose good doctors because quality care with fewer complications can help cut costs. \nThese programs have potential to grow as employers look to cut costs ahead of a health care overhaul tax on expensive benefits plans that starts in 2018. \n“It’s really a win-win, because it benefits the consumer, and it also benefits the employer,” said Susan Rider, an insurance broker for Gregory & Appel in Indianapolis. \nThe prospect of earning extra income and receiving help shopping for care may prove popular, says Kit Yarrow, a psychology and marketing professor with Golden Gate University. \n“I think it’s a pretty irresistible combination,” she said. \nThe cash incentive could also be enticing because middle-class wages have largely been stagnant for the past decade, noted Paco Underhill, CEO of Envirosell, a New York-based company that studies consumer behavior. However, he also said consumers are crunched more for time than money, so they may not opt for a financial incentive if it involves too much travel. \n“Convenience is the driving force in modern consumption,” he said. \nVitals, which charges a fee to employers to run SmartShopper, started testing the program in New Hampshire and Kentucky a few years ago. It currently offers it in 10 states, mostly in the East. The company plans to double that total by the end of next year and expand into Florida and Oregon, among other states. \nThe New Hampshire Health Trust, which runs medical coverage for several government entities in the state, made about 47,000 people eligible for the SmartShopper program last January. Trust executives estimate that the program netted about $826,000 in savings through August. They hope to top $1.4 million by the end of the year. \n“There’s still a lot of opportunity for growth and savings,” said Scott Weden, the program’s benefits manager. \nVitals says SmartShopper served more than 16,000 patients last year and reaped $10.7 million in savings. Ultimately, though, the savings have a ceiling. \nMuch of the cost in the health care system comes from hospital stays and complex surgeries. A financial incentive will have little impact on that kind of care, says Paul Keckley, managing director of the Navigant Center for Healthcare Research and Policy Analysis. \nFor instance, a patient with advanced prostate cancer and insurance that limits how much he has to pay for care annually won’t be motivated to shop for the best deal. \n“For the more expensive elements of health care, incentives alone will not move the cost needle down,” Keckley said. Other stories of interest", "external_links": [], "published": "2015-10-20T07:00:00.000+03:00", "crawled": "2015-10-20T07:13:52.888+03:00", "highlightTitle": ""}