{"organizations": ["Reuters/Rick Wilking", "Wal-Mart Supercenter", "Wal-Mart"], "uuid": "5cebb3446fa962ecd8fe7da5f899dff3cca9d617", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151026&t=2&i=1089958351&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9P19N", "site_section": "http://feeds.reuters.com/reuters/technologyNews\r", "section_title": "Reuters: Technology News", "url": "http://www.reuters.com/article/2015/10/26/us-wal-mart-stores-drones-exclusive-idUSKCN0SK2IQ20151026?feedType=RSS&feedName=technologyNews", "country": "US", "title": "Exclusive: Wal-Mart seeks to test drones for home delivery, pickup", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Exclusive: Wal-Mart seeks to test drones for home delivery, pickup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T23:20:00.000+02:00", "replies_count": 0, "uuid": "5cebb3446fa962ecd8fe7da5f899dff3cca9d617"}, "author": "", "url": "http://www.reuters.com/article/2015/10/26/us-wal-mart-stores-drones-exclusive-idUSKCN0SK2IQ20151026?feedType=RSS&feedName=technologyNews", "ord_in_thread": 0, "title": "Exclusive: Wal-Mart seeks to test drones for home delivery, pickup", "locations": ["New York", "Manhattan", "Springdale", "Paris", "CHICAGO", "Bois de Boulogne", "Arkansas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nathan Layne"], "text": "CHICAGO | By Nathan Layne A 'Phantom 2' drone by DJI company flies during the 4th Intergalactic Meeting of Phantom's Pilots (MIPP) in an open secure area in the Bois de Boulogne, Paris, in this March 16, 2014 file photo. Reuters/Charles Platiau/Files 1 of 3 right A family shops at the Wal-Mart Supercenter in Springdale, Arkansas June 4, 2015. Wal-Mart will hold its annual meeting June 5, 2015. Reuters/Rick Wilking 2 of 3 right The DJI Phantom 3, a consumer drone, takes flight after it was unveiled at a launch event in Manhattan, New York April 8, 2015. Reuters/Adrees Latif 3 of 3 right \nCHICAGO Wal-Mart Stores Inc applied Monday to U.S. regulators for permission to test drones for home delivery, curbside pickup and checking warehouse inventories, a sign it plans to go head-to-head with Amazon in using drones to fill and deliver online orders. \nThe world's largest retailer by revenue has for several months been conducting indoor tests of small unmanned aircraft systems – the term regulators use for drones - and is now seeking for the first time to test the machines outdoors. It plans to use drones manufactured by China's SZ DJI Technology Co Ltd. \nIn addition to having drones take inventory of trailers outside its warehouses and perform other tasks aimed at making its distribution system more efficient, Wal-Mart is asking the Federal Aviation Administration for permission to research drone use in \"deliveries to customers at Walmart facilities, as well as to consumer homes,\" according to a copy of the application reviewed by Reuters. \nThe move comes as Amazon.com Inc, Google and other companies test drones in the expectation that the FAA will soon establish rules for their widespread commercial use. FAA Deputy Administrator Michael Whitaker said in June that the agency expected to finalize regulations within the next 12 months, faster than previously planned. Commercial drone use is currently illegal, though companies can apply for exemptions. \nThe FAA will review Wal-Mart's petition to determine whether it is similar enough to earlier successful applications to be fast-tracked, or whether it would set a precedent for exemptions, requiring regulators to conduct a detailed risk analysis and seek public comment, agency spokesman Les Dorr said. The FAA normally aims to respond to such petitions in 120 days.Amazon has said it would be ready to begin delivering packages to customers via drones as soon as federal rules allow. \nWal-Mart spokesman Dan Toporek said the company would move quickly to deploy drones depending on its tests and regulations. \n\"Drones have a lot of potential to further connect our vast network of stores, distribution centers, fulfillment centers and transportation fleet,\" he said. \"There is a Walmart within five miles of 70 percent of the U.S. population, which creates some unique and interesting possibilities for serving customers with drones.\" \nFinding ways to more efficiently warehouse, transport and deliver goods to customers has taken on new importance for Wal-Mart, which this month projected a surprise decline in earnings next year as it copes with costs to increase wages, beat back price competition and boost online sales. \nIn the FAA application, Wal-Mart said it wanted to test drones for taking stock of trailers and other items in the parking lot of a warehouse using electronic tagging and other methods. A Wal-Mart distribution center could have hundreds of trailers waiting in its yard, and a drone could potentially be used to quickly account for what each one is holding. \nThe retailer also wants to test drones for its grocery pickup service, which it has recently expanded to 23 markets with plans to add another 20 markets next year. The test flights would confirm whether a drone could deliver a package to a pick-up point in the parking lot of a store, the application says. \nWal-Mart also said it wants to test home delivery in small residential neighborhoods after obtaining permission from those living in the flight path. The test would see if a drone could be deployed from a truck \"to safely deliver a package at a home and then return safely to the same,\" the application says. \nTo date the FAA has approved more than 2,100 exemptions allowing for commercial drone testing and use. \n(Reporting by Nathan Layne in Chicago and David Morgan in Washington, editing by Eric Effron and John Pickering)", "external_links": [], "published": "2015-10-26T23:20:00.000+02:00", "crawled": "2015-10-26T23:59:21.650+02:00", "highlightTitle": ""}