{"organizations": [], "uuid": "f24800ab91618000bb7ac53a4023ed43e1599753", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/internet.xml", "section_title": "Technology: Internet", "url": "http://www.prweb.com/releases/2015/10/prweb13039073.htm", "country": "US", "title": "BTCC Announces New Chief Technology Officer Mikael Wang", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "BTCC Announces New Chief Technology Officer Mikael Wang", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "f24800ab91618000bb7ac53a4023ed43e1599753"}, "author": "Greg Wolfson", "url": "http://www.prweb.com/releases/2015/10/prweb13039073.htm", "ord_in_thread": 0, "title": "BTCC Announces New Chief Technology Officer Mikael Wang", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BTCC, the world’s longest-running bitcoin exchange, today announced the promotion of Mikael Wang to the position of chief technology officer. Wang, who has spearheaded the development of BTCC’s entire current line-up of secure cryptocurrency solutions, will lead BTCC’s adoption of the latest software advancements in optimizing and expanding its comprehensive set of digital currency services.\nWang has a history of innovative leadership in software engineering that started with running a popular IT consultancy while attending university in his home country of Sweden. After earning his master’s degree, he created vehicle cloud computing solutions and service delivery platforms while working at Ericsson.\nWang discovered bitcoin in early 2013 after moving to China and immediately started a bitcoin mining operation in Shanghai. In April 2013, he attended a lecture on cryptocurrencies where he met BTCC’s chief executive officer, Bobby Lee, and ended up joining the founding team.\n“Mikael is a rare talent whose track record of innovative leadership will take BTCC to new heights as the leading bitcoin financial platform worldwide,” Lee said.\nA major part of Wang’s responsibilities over the next few months will be to deliver software solutions to support BTCC’s international expansion following its rebranding from BTCChina to BTCC in September.\n“As we grow our business and operations, we need people with Mikael’s drive, abilities, and technical leadership,” said Samson Mow, BTCC’s chief operating officer. “Working with Mikael in the last few months, we’ve not only doubled the size of our engineering team, but also have several major projects close to launch.”\nWang said he is ready to lead BTCC’s engineering department in developing innovative, high-quality solutions to meet customer’s needs.\n“I am pleased and excited to serve as BTCC’s chief technology officer,” Wang said. “We are adapting the latest technologies to give our users the best experience possible and will fight hard to maintain BTCC’s position as the top bitcoin company in the world.”\nWang holds a bachelor’s degree in computer engineering from Chalmers University of Technology and a master’s degree in mobile informatics from the IT University of Gothenburg. Wang was previously director of software engineering at BTCC. He joined BTCC after five years of working as a certified solution architect for Ericsson in Sweden.\nAbout BTCC’s Leadership\nBTCC’s leadership consists of a diverse team of industry professionals with experience working at the world’s leading internet, ecommerce, and payment-processing companies. Chief Executive Officer Bobby Lee was born in the Ivory Coast, educated at Stanford, and worked as vice president of technology of Walmart before taking leadership of BTCC in 2013. Chief Operating Officer Samson Mow is a leading Canadian game industry executive who worked as a director of production at Ubisoft and started a mobile game development company before joining BTCC in February 2015. Chief Technology Officer Mikael Wang operated an IT consultancy company in Sweden and developed innovative cloud computing solutions at Ericsson before joining BTCC in 2013. Together, they bring an innovative mindset, international perspective, and the highest quality standards to BTCC.\nAbout BTCC\nBTCC was originally founded as BTCChina in 2011. It is the longest-running bitcoin exchange and among one of the largest in the world. BTCC plays a leading role in every segment of the bitcoin ecosystem, offering a digital currency exchange, a mining pool, payment processing, consumer wallets, and blockchain engraving. The diverse products and services BTCC offers allow its customers to engage in all aspects of the digital currency spectrum in one integrated platform.\nHeadquartered in Shanghai, BTCC serves a global customer base and has become an industry leader for security, risk mitigation, credibility, and technological innovation. BTCC’s mission is to provide the world with the most convenient and trustworthy digital currency services. More information about BTCC and its products can be found at http://www.btcc.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5idGNjLmNvbQ=="], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T12:19:21.266+03:00", "highlightTitle": ""}