{"organizations": [], "uuid": "53c8d17f2a4b691fdaaff26fb0b63f0d1cfabd78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3188942.1445262278!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/kim-kardashian-and-kanye-west.jpg", "site_section": "http://rss.cbc.ca/lineup/technology.xml", "section_title": "CBC | Technology News", "url": "http://www.cbc.ca/news/technology/kanye-west-in-app-purchases-1.3277695?cmp=rss", "country": "IL", "title": "Kanye West's angry tweets on in-app purchases highlight problem in kids' games", "performance_score": 0, "site": "cbc.ca", "participants_count": 1, "title_full": "Kanye West's angry tweets on in-app purchases highlight problem in kids' games", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T16:53:00.000+03:00", "replies_count": 0, "uuid": "53c8d17f2a4b691fdaaff26fb0b63f0d1cfabd78"}, "author": "The Canadian Press", "url": "http://www.cbc.ca/news/technology/kanye-west-in-app-purchases-1.3277695?cmp=rss", "ord_in_thread": 0, "title": "Kanye West's angry tweets on in-app purchases highlight problem in kids' games", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kim Kardashian cashing in with new app \nActor Jack Black has also been affected by costly in-app purchases, lamenting on The Tonight Show Starring Jimmy Fallon in May that his young son spent $3,000 on just one game. \nIn-app purchasing is typically available in games that are advertised as free to download. Sometimes just the first few minutes of play are free, or users may be tempted with the option to buy more lives, bonus features or premium content with real money. App store descriptions provide info \nDigital media expert Aimee Morrison, associate professor of English at the University of Waterloo, says the problem improved somewhat after developers of \"free\" games started indicating in app store descriptions when in-app purchases were available. \nBut the total cost of in-app purchases can vary wildly, she adds. Some games offer dozens of hours of fun for just a few bucks, while others require substantially more. \nThe biggest piece of advice from experts is for parents to change settings on their devices to prevent children from making such purchases. \nParents can also seek out kids' games that don't have such traps. In-app purchasing is typically available in games that are advertised as free to download. Sometimes just the first few minutes of play are free, or users may be tempted with the option to buy more lives, bonus features or premium content with real money. (iStockphoto) \nToronto-based studio Sago Sago, for instance, makes apps that are free of in-app purchases and third-party ads for children ages two to four. Instead, most of the apps cost $2.99 for the entire game upfront. \n\"It creates challenges for us but the reality is that we've won the trust of a lot of parents,\" says CEO Jason Krogh. \nMorrison says she would like to see more transparency from developers, with kids' apps disclosing how much it would cost to achieve full functionality in a game. \nThe Samuelson-Glushko Canadian Internet Policy & Public Interest Clinic, based at the University of Ottawa, has defended several clients dealing with this very issue. \nDirector David Fewer says one client had a child rack up over $800 in purchases on what was at the time a popular kid-focused gaming platform. \n\"Usually the first response is to go back to whoever it is that's taking your money and say, 'We didn't agree to this. You shouldn't be charging me this. This is outrageous,\"' says Fewer. \n\"And usually the companies are good enough to reverse the charges.\" In the U.S., the Federal Trade Commission has sued Amazon, Google and Apple for not doing enough to prevent kids' in-app purchases. Apple and Google both settled with the FTC in 2014, agreeing to refund $32.5 million US and $19 million US respectively to parents. (CBC) \nFewer says he'd like to see more safeguards in place, such as a secondary confirmation prompt telling the card holder that their account is about to be used. \n\"Because it is abusive of consumers,\" he says. \"Most people will contest an $800 bill, but how many people will contest an $8 bill or even an $80 bill?\" \nCount Holmes among those who \"ate the cost\" of the bill and learned from it. \n\"I should've been more aware,\" she says. \"I went online and I told all my friends ... and they were all like, 'Oh my God, I didn't even think of that.\"' \nIn the U.S., the Federal Trade Commission has sued Amazon, Google and Apple for not doing enough to prevent kids' in-app purchases. Apple and Google both settled with the FTC in 2014, agreeing to refund $32.5 million US and $19 million US respectively to parents . The Amazon case is still ongoing. With files from CBC News", "external_links": [], "published": "2015-10-19T16:53:00.000+03:00", "crawled": "2015-10-19T17:37:28.257+03:00", "highlightTitle": ""}