{"organizations": [], "uuid": "ca3407dffcb9d93846b9c4ec71cb34ca855b5a35", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iqMXiDFoYmzs/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-08/why-biggest-china-internet-deal-didn-t-need-two-sets-of-bankers", "country": "US", "title": "Why Biggest China Internet Deal Didn't Need Two Sets of Bankers", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Why Biggest China Internet Deal Didn't Need Two Sets of Bankers - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T19:29:00.000+03:00", "replies_count": 0, "uuid": "ca3407dffcb9d93846b9c4ec71cb34ca855b5a35"}, "author": "Jonathan Browning", "url": "http://www.bloomberg.com/news/articles/2015-10-08/why-biggest-china-internet-deal-didn-t-need-two-sets-of-bankers", "ord_in_thread": 0, "title": "Why Biggest China Internet Deal Didn't Need Two Sets of Bankers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "This week’s $15 billion merger of two Chinese startups stood out for a number of reasons. It’s the largest-ever combination in the nation’s Internet industry, it forms a dominant player in the booming local services market -- and just one bank brokered the deal.\nBoutique investment bank China Renaissance Partners advised both discount site Meituan.com and restaurant-review service Dianping.com on their merger this week, earning fees from each of the two companies backed by rival tech billionaires. It’s the second time this year Beijing-based China Renaissance, which has focused on Internet deals since its 2004 founding, has worked both sides in a multibillion-dollar transaction.\nSuch dual mandates leave less room for the bulge-bracket investment banks in an industry populated with the nation’s most active acquirers. China Renaissance worked on more Internet transactions in the country than any other adviser since the start of 2013, surpassing far larger Western competitors like Goldman Sachs Group Inc. and Morgan Stanley, data compiled by Bloomberg show.\n“Our role is as a middleman, as a moderator, more of a mediator -- and sometimes it’s as a judge,” Fan Bao, the founder of China Renaissance, said in a phone interview Thursday. “The banker’s role is less to negotiate a great deal for one side, than it is making sure the deal gets done.\"\nCanceled Trip A commercial agreement between Meituan and Dianping had been broadly worked out in advance, allowing transaction details to be ironed out in just 2 1/2 weeks, according to Bao. The banker gave up tickets to the Singapore Formula One Grand Prix race, canceling his plans at the last minute to lead the deal negotiations, he said.\nBao’s advisory firm had to help the two competitors, locked in a costly battle to attract customers, come up with a governance structure both sides could agree on. Meituan is part-owned by billionaire Jack Ma’s Alibaba Group Holding Ltd., while Dianping is backed by Alibaba’s biggest rival, Tencent Holdings Ltd.\nWhile Meituan shareholders will own about 60 percent of the combined company, according to people familiar with the matter, the chief executive officers of Meituan and Dianping will serve as co-chairmen and co-CEOs. A representative for Meituan declined to comment on sharing an adviser, while a spokeswoman for Dianping didn’t immediately respond to requests for comment.\nRide Hailing China Renaissance also advised both sides in a similar merger earlier this year, when the nation’s two-largest taxi apps agreed to combine. Under Bao’s watch, Alibaba and Tencent brought together the Didi and Kuaidi services they had backed in order to establish a dominant player in ride-hailing services.\nDeals between two Chinese companies that know each other don’t require the “match-making process” traditionally provided by investment banks, and they present fewer regulatory complexities than cross-border transactions, said EY’s Keith Pogson.\n“A number of roles that bankers played just aren’t there any more,” Pogson, a senior partner for financial services in Asia Pacific at EY, said by phone Thursday. “They’re the guys putting the wrapping paper on the present.”\nChina Renaissance, which charges a fixed fee per deal that’s six figures in U.S. dollars, has both sides pay the same amount in order to ensure it represents them equally, according to Bao.\n“We have to be very impartial,” he said. “Our role is to bridge the gap and get them to an agreement.”", "external_links": [], "published": "2015-10-08T19:29:00.000+03:00", "crawled": "2015-10-08T15:12:53.165+03:00", "highlightTitle": ""}