{"organizations": [], "uuid": "27c394811458dd0cc8ae54fdd02565745941ce60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/1001/20151001__appledeal~1.JPG", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200770.xml", "section_title": "Technology", "url": "http://www.mercurynews.com/business/ci_28908674/apple-plans-huge-sunnyvale-campus-eyes-further-expansions?source=rss", "country": "IL", "title": "Apple plans huge Sunnyvale campus, eyes fresh San Jose expansions", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Apple plans huge Sunnyvale campus, eyes fresh San Jose expansions", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T05:32:00.000+03:00", "replies_count": 0, "uuid": "27c394811458dd0cc8ae54fdd02565745941ce60"}, "author": "George Avalos\n\ngavalos@bayareanewsgroup.com", "url": "http://www.mercurynews.com/business/ci_28908674/apple-plans-huge-sunnyvale-campus-eyes-further-expansions?source=rss", "ord_in_thread": 0, "title": "Apple plans huge Sunnyvale campus, eyes fresh San Jose expansions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apple plans huge Sunnyvale campus, eyes fresh San Jose expansions By George Avalos Posted: 10/01/2015 05:01:25 PM PDT Updated: 10/01/2015 07:32:58 PM PDT Courtesy HOK Architects and Landbank -- An artist's rendering depicts an aerial view of the Central & Wolfe office development proposed to redevelop a business park currently occupying the 18-acre parcel located at Central Expressway and North Wolfe Road. Apple is said to have entered into an agreement to lease the entire 777,000-square foot campus. HOK Architects, and developers Landbank, Cassidy Turley and CB Richard Ellis have filed an application to redevelop the property. SUNNYVALE -- Apple is eyeing fresh expansions here and in north San Jose that would add about 1 million square feet to what has turned into a stunning growth spurt for the tech giant, sources and experts said Thursday. \nApple has agreed to lease a 777,000-square-foot building in Sunnyvale where it could have 4,000 workers just four miles from the \"spaceship\" headquarters the company is building in Cupertino. The new Sunnyvale complex at the corner of Wolfe Road and Central Expressway has its own futuristic flavor, with a curving outline, interior courtyards and rooftop gardens. \nSources who are familiar with the deal say that Apple has agreed to lease the entire site from developer Landbank Investments. Apple declined to comment. Courtesy HOK Architects and Landbank -- An artist's rendering depicts the Central & Wolfe office development proposed to redevelop a business park currently occupying the 18-acre parcel located at Central Expressway and North Wolfe Road. Apple is said to have entered into an agreement to lease the entire 777,000-square foot campus. HOK Architects, and developers Landbank, Cassidy Turley and CB Richard Ellis have filed an application to redevelop the property. \nIn addition, Apple is scouting for even more office sites in north San Jose. These offices would be in addition to what Apple had previously agreed to purchase or lease there. These maneuvers would create a third campus for the company besides Cupertino and Sunnyvale. \n\"This is an unprecedented run of growth for Apple,\" said David Vanoncini, a senior vice president and managing partner with the San Jose office of commercial realty brokerage Kidder Mathews. \nIndustry insiders also point out that Apple is undertaking lease and purchase deals that suggest it will retain nearly all of these offices and sites even after the company completes the spaceship campus. Advertisement \n\"This expansion exceeds anything that the spaceship was meant to accommodate,\" said Terry Bell, a senior vice president with Colliers International, a commercial realty brokerage. \"This is a mindset for permanent growth, because Apple is purchasing properties.\" \nIn recent days, Apple took a major step forward in solidifying its presence in north San Jose with the purchase of land parcels and a building that together could accommodate 18,000 workers for the tech titan. The various north San Jose sites could eventually contain 3.77 million square feet, space equivalent to a pair of major regional shopping centers. \nApple is the most profitable company in the Bay Area and the largest by market value. Despite that lofty perch, all of this activity raises the bare question: Why does Apple need all of this space? \n\"Apple is clearly staffing up for something else besides the iPhone to supplement its income,\" said Rob Enderle, an analyst who tracks the technology sector. \"My guess is that it's probably a car.\" \nApple has been rumored to be interested in self-driving cars or car-related technology. Last month, California's Department of Motor Vehicles revealed that the agency met with Apple about the state's rules for testing autonomous vehicles on public streets. \nApple's push to occupy the Sunnyvale campus was first reported by the San Jose Business Journal and The Registry. \nNorth San Jose is getting interest from another high-profile tech firm. Google is seeking about 100,000 square feet or more in north San Jose, development insiders say. A deal in San Jose would represent the search giant's first major foray into the Bay Area's most populous city. \n\"This technology boom is being led by well-known, highly profitable and very tangible corporations, as opposed to the dot-com boom, that was, on some levels, smoke and mirrors,\" Vanoncini said. \"These are real companies, making real money, selling real products, with a real need for expansion.\" Contact George Avalos at 408-859-5167. Follow him at Twitter.com/georgeavalos .", "external_links": [], "published": "2015-10-02T05:32:00.000+03:00", "crawled": "2015-10-02T05:38:13.348+03:00", "highlightTitle": ""}