{"organizations": [], "uuid": "aab87f99e894fc7d6727fde071d256731c0b07e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chron.com", "main_image": "http://ww2.hdnux.com/photos/41/56/44/8841493/3/rawImage.jpg", "site_section": "http://www.chron.com/rss/feed/AP-Technology-and-Science-266.php", "section_title": "AP Technology and Science", "url": "http://www.chron.com/news/science/article/Riders-round-up-one-of-nation-s-biggest-public-6587476.php", "country": "US", "title": "Riders round up one of nation's biggest public bison herds", "performance_score": 0, "site": "chron.com", "participants_count": 1, "title_full": "Riders round up one of nation's biggest public bison herds - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T05:44:00.000+03:00", "replies_count": 0, "uuid": "aab87f99e894fc7d6727fde071d256731c0b07e5"}, "author": "chron.com", "url": "http://www.chron.com/news/science/article/Riders-round-up-one-of-nation-s-biggest-public-6587476.php", "ord_in_thread": 0, "title": "Riders round up one of nation's biggest public bison herds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Rick Bowmer, AP Image 1 of / 9 Caption\nClose\nImage 1 of 9 Riders on horseback herd bison during an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. Riders on horseback herd bison during an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals ... more Image 2 of 9 A bison stands in a corral following an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. A bison stands in a corral following an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals ... more Image 3 of 9 A rider wears a bison hat during the annual bison roundup Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. A rider wears a bison hat during the annual bison roundup Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be ... more Image 4 of 9 Bison are move in a corral following an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. Bison are move in a corral following an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals ... more Image 5 of 9 A riders cracks his whip before the start of the annual bison roundup Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. A riders cracks his whip before the start of the annual bison roundup Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they ... more Image 6 of 9 A herd of bison moves during the annual bison roundup Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. A herd of bison moves during the annual bison roundup Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, ... more Image 7 of 9 Riders on horseback herd bison during an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. Riders on horseback herd bison during an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals ... more Image 8 of 9 Riders on horseback ride to a herd bison during an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the animals from across the island on Friday so they can be weighed, tagged and given health checkups. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City. Riders on horseback ride to a herd bison during an annual roundup of one of the country's largest and oldest public herds Friday, Oct. 23, 2015, on Antelope Island, Utah. Utah State Parks workers are moving the ... more Image 9 of 9 Riders round up one of nation's biggest public bison herds 1 / 9 Back to Gallery SALT LAKE CITY (AP) — Riders on horseback are herding bison on Utah's Antelope Island in an annual roundup of one of the country's largest and oldest public herds.\nUtah State Parks workers are moving the 750 animals from across the island Friday so the bison can be weighed, tagged and given health checkups.\nThis year marks the 29th annual bison roundup. Excess animals are typically sold to make sure the available food can support the population. Antelope Island is on the Great Salt Lake, about 50 miles north of Salt Lake City.\nBison were first brought there in 1897 with a group of a dozen animals that would form the foundation for today's free-ranging herd.\nThe island is named for its native pronghorn antelope.", "external_links": ["http://ww2.hdnux.com/photos/41/56/44/8841493/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/56/65/8842568/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/56/44/8841496/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/56/44/8841500/3/square_gallery_thumb.jpg", "http://ww2.hdnux.com/photos/41/56/44/8841497/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/56/44/8841498/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/56/44/8841497/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/56/44/8841496/3/920x920.jpg", "http://ww1.hdnux.com/photos/41/56/65/8842568/3/square_gallery_thumb.jpg", "http://ww1.hdnux.com/photos/41/56/44/8841500/3/920x920.jpg", "http://ww4.hdnux.com/photos/41/56/44/8841495/3/square_gallery_thumb.jpg", "http://ww3.hdnux.com/photos/41/56/44/8841498/3/square_gallery_thumb.jpg", "http://ww4.hdnux.com/photos/41/56/44/8841495/3/920x920.jpg", "http://ap.org/schemas/03/2005/apnm", "http://ww4.hdnux.com/photos/41/56/44/8841499/3/square_gallery_thumb.jpg", "http://ap.org/schemas/03/2005/apcm", "http://ww4.hdnux.com/photos/41/56/44/8841499/3/920x920.jpg", "http://ww2.hdnux.com/photos/41/56/44/8841493/3/square_gallery_thumb.jpg"], "published": "2015-10-24T05:44:00.000+03:00", "crawled": "2015-10-24T06:00:42.987+03:00", "highlightTitle": ""}