{"organizations": [], "uuid": "73842cebc78c6c1ecfd6d9a7dcaafc6ef684fd39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maritimeglobalnews.com", "main_image": "", "site_section": "http://www.maritimeglobalnews.com/technology", "section_title": "Technology - maritime global news ", "url": "http://www.maritimeglobalnews.com/news/billions-juvenile-under-arctic-bwrbk1", "country": "US", "title": "Billions of Juvenile Fish under Arctic Ice", "performance_score": 0, "site": "maritimeglobalnews.com", "participants_count": 1, "title_full": "Billions of Juvenile Fish under Arctic Ice - maritime global news", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "73842cebc78c6c1ecfd6d9a7dcaafc6ef684fd39"}, "author": "Joseph R. Fonseca", "url": "http://www.maritimeglobalnews.com/news/billions-juvenile-under-arctic-bwrbk1", "ord_in_thread": 0, "title": "Billions of Juvenile Fish under Arctic Ice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Using a new net, marine biologists from the Alfred Wegener Institute have, for the first time, been able to catch polar cod directly beneath the Arctic sea ice with a trawl, allowing them to determine their large-scale distribution and origin. This information is of fundamental importance, as polar cod are a major source of food for seals, whales and seabirds in the Arctic. The study, which was recently published in the journal Polar Biology, shows that only juvenile fish are found under the ice, a habitat the researchers fear could disappear as a result of climate change.\nBeluga whales, narwhals, ringed seals and numerous Arctic seabirds have one thing in common: their preferred food is polar cod, Boreogadus saida. As such, the fish is one of the Arctic Ocean's most ecologically important animals. Despite its importance, there are still gaps in our understanding of it. For example, biologists have known for years that juvenile polar cod live under the sea ice. However, to date it was not known just how many live there. The journal Polar Biology has now published important new findings by researchers from the Alfred Wegener Institute, Helmholtz Centre for Polar and Marine Research, Universität Hamburg and the Dutch research institute IMARES.\n\"For the first time, we've been able to use a special net directly below the sea ice to catch a large number of polar cod, and therefore to estimate their prevalence over a large area. If you extrapolate these findings, there could be more than nine billion polar cod living under the ice in the Eastern Arctic. What's more, we have also collected fundamental biological and physical data,\" explains Carmen David, an AWI biologist and first author of the article.\nThe data was gathered in summer 2012, during an Arctic expedition on board the research icebreaker Polarstern. The researchers dragged a specially developed under-ice net next to the ship at 13 stations between Greenland, Svalbard and Russia. The net, developed by AWI's Dutch partner IMARES, is about the size of a car and designed so that its large frame quickly sinks beneath the sea ice every time it's cast. Floats then push it towards the water's surface so that it is directly under the ice floe. In addition, this trawl net, known as SUIT (Surface and Under Ice Trawl) is equipped with a camera and various other equipment for measuring ice thickness, temperature and salinity beneath the ice.\nThis allows the researchers to make catches that provide completely new insights into the polar cod's lifecycle. \"Up until our expedition, catches had only been made at specific points and observations made on individual polar cod caught beneath the ice by divers,\" says David. \"Now we know: there are mainly one- or two-year-old juvenile fish living directly below the ice, and these feed on, among other things, amphipod crustaceans. Since some of the polar cod live in overhangs and cracks under the ice, it's likely that we didn't manage to catch all of them with our net - which means that the polar cod population beneath the ice may be even bigger than our figures suggest.\"\nTo find out where the young polar cod come from, the researchers used satellite data and computer models, which can retrace the slow movement of the drifting sea ice. It has long been surmised that the young fish reach the Central Arctic from their spawning grounds under drifting ice. These spawning grounds are found in the coastal waters of the Laptev and Kara Seas in northern Siberia. In autumn new sea ice forms there, and is gradually pushed northwards into open waters by the wind. The juvenile fish are assumed to travel along under the ice.\n\"We analysed the satellite data to determine how far the ice in that particular area has travelled,\" says AWI biologist and co-author of the study, Hauke Flores. \"It took the ice between 240 and 340 days to travel from the coast to our measurement stations in the sea. These figures correspond with the age and size of the juvenile polar cod that we caught.\" These results indicate that the fish caught in the west could have come from the Kara Sea, while those caught at the stations in the east are more likely from the Laptev Sea.\nTo discover how well fed the fish under the ice are, the scientists analysed their tissue in the laboratory. All the fish were in top condition, which suggests that there was enough food under the ice, making the sea ice a true nursery ground for polar cod.\nAbove all, the new insights into the juvenile fish under the ice are important because it's still impossible to say how polar cod populations will change in the face of climate change. The largest and most important population lives in the Barents Sea, to the north of Norway. As climate change causes the Barents Sea to grow warmer, for some years now other fish species like capelin and Atlantic cod have moved further northward, creating new competition that could reduce the polar cod population. In fact, Norwegian researchers recently confirmed that, in a regularly monitored fjord on the island Spitsbergen, for the first time ever there were no polar cod found - but plenty of Atlantic cod.\nIf the polar cod population in the Barents Sea actually does shrink, the juvenile fish under the ice of the Eastern Arctic could become even more important - especially in order to make up for losses elsewhere. \"We want to determine whether or not the young fish under the ice serve as a form of 'polar cod reserve', increasing the overall chances of survival for the coastal populations through genetic exchanges with populations in Siberia and elsewhere,\" explains Flores.\nAfter all, the estimated nine billion juvenile fish under the ice represent a substantial population. By way of comparison: the Barents Sea, the region with one of the world's largest polar cod populations, is home to only twice as many one- to two-year-old fish of the species. Carmen David and Hauke Flores now hope to learn even more about the fate of the polar cod in the course of further expeditions.", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-13T22:04:39.034+03:00", "highlightTitle": ""}