{"organizations": [], "uuid": "233bc6a36f5d0c790059b50c4cbc1d8edea30301", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/technology.html", "section_title": "Technology", "url": "https://www.prbuzz.com/technology/352560-hytrol-conveyor-customer-care-earns-praise-from-integration-partner-rh-brown-company.html", "country": "US", "title": "Hytrol Conveyor Customer Care Earns Praise from Integration Partner RH Brown Company", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Hytrol Conveyor Customer Care Earns Praise from Integration Partner RH Brown Company", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "233bc6a36f5d0c790059b50c4cbc1d8edea30301"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/technology/352560-hytrol-conveyor-customer-care-earns-praise-from-integration-partner-rh-brown-company.html", "ord_in_thread": 0, "title": "Hytrol Conveyor Customer Care Earns Praise from Integration Partner RH Brown Company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hytrol Conveyor Company, Inc., manufacturer of advanced conveyor systems, controls, and solutions has the industry’s strongest integration partner network. Integration partners allow Hytrol a competitive advantage: familiarity with local customers and accessibility to immediate assistance.\nTony Sartin heads up the Customer Care Center at Hytrol and ensures the needs of the 100+ integration partners are met and addressed quickly, efficiently, and accurately. One integration partner is RH Brown Company. Chelsea Serna, Operations Manager at RH Brown Co, noted, “Everyone that I had the chance to work with in Customer Care has been fantastic. Hytrol has the right people doing the right jobs! Thanks for all the help and service over the years. Keep up the good work.”\nR. H. Brown Co. is a fourth generation family owned business with offices in Seattle, Washington and Portland, Oregon. The company dates back to 1911 when it was founded under the name, Washington Cycle and Supply in Tacoma by Richard H. Brown; at that time the company primarily sold bicycles and miscellaneous industrial equipment. Today the company offers a wide variety of industrial supplies and material handling equipment.\nAbout Hytrol Conveyor Company, Inc.\nHytrol Conveyor Co., Inc. (www.hytrol.com) designs and manufactures advanced conveyor systems, controls, and solutions for customers with processing, manufacturing, warehousing, and distribution needs. For almost 70 years, Hytrol has demonstrated an unwavering dedication to understanding the unique material handling needs of businesses. Hytrol is focused on creating innovative, customized conveyor solutions that help companies achieve their goals.\nHytrol is experiencing consistent growth; 2015 will be the company’s best year ever and significant plant expansion continues. Hytrol is strengthened by its Integration Partner Network with 100+ locations worldwide.\nHytrol’s Technology Center is the birthplace for many industry-changing innovations, such as EZLogic® zero-pressure accumulation and E24™, an energy efficient, 24-volt solution.\nThese technologies are complemented by Hytrol’s extensive line of advanced sortation offerings, the ProSort 400 Elite series high speed shoe sorter, as well as the ProSort MRT series narrow belt sorter. Hytrol sortation technology can accommodate any product or market requirements, while ensuring the highest throughput at minimum speed.\nHytrol Conveyor is a proud member of MHI, CEMA (Conveyor Equipment Manufacturers Association), along with IABSC (International Association of Baggage System). Follow Hytrol on Twitter @hytrol.", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T18:12:47.948+03:00", "highlightTitle": ""}