{"organizations": [], "uuid": "76b90a767b149192406178b3fb47db32319aa622", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/23/13041343/MR_bonuses.png", "site_section": "http://www.prweb.com/rss2/internet.xml", "section_title": "Technology: Internet", "url": "http://www.prweb.com/releases/2015/10/prweb13041343.htm", "country": "US", "title": "200% Extra Credit as A Gift on International Top Ups to Mobiles in Jamaica and Honduras with MobileRecharge.com", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "200% Extra Credit as A Gift on International Top Ups to Mobiles in Jamaica and Honduras with MobileRecharge.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "76b90a767b149192406178b3fb47db32319aa622"}, "author": "Aura Badiu", "url": "http://www.prweb.com/releases/2015/10/prweb13041343.htm", "ord_in_thread": 0, "title": "200% Extra Credit as A Gift on International Top Ups to Mobiles in Jamaica and Honduras with MobileRecharge.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MobileRecharge.com offers Jamaicans and Hondurans who live abroad the chance to send 200% free extra mobile credit when they top up a mobile phone in their native countries. The offer is valid until the end of October, 2015. The Bonus applies on international top ups to mobiles pertaining to Digicel network in Jamaica and Tigo in Honduras. The process takes less than 1 minute on MobileRecharge.com and all offers are available on: https://mobilerecharge.com/promotions The 200% applies to the basic amount ordered on MobileRecharge.com. This way, not only does someone send mobile credit to friends and family in some other country as a gift or material support, but he or she also sends a Bonus without having to pay for it. More details on how the bonus can be acquired and used can be found on MobileRecharge.com.\nThere are more than 1 billion and a half Jamaicans worldwide, far away from motherland, and this offer addresses them all. Such mobile credit deals are a good time to save money, since such country-to-country top ups are not that frequent when it comes to loading Digicel mobiles in Jamaica.\nThe bonus on top ups to Digicel Jamaica mobiles can be of 100% extra or 200% extra credit. The bonus reaches the phone abroad in approximately 15 minutes after the top up was finalized. The Bonus is valid for 7 days and can be used for data, local Digicel-to-Digicel calls. It also includes International Plan destinations such as USA, Canada and China, and landlines only in the UK and Spain.\nThis 200% Bonus for Digicel mobiles in Jamaica is the maximum bonus and it applies until the end of October. The condition to send/get the Bonus is to credit the mobile phone with a minimum of $29. If the top up amount refilled through MobileRecharge.com is somewhere between $22 and $29, only 100% free extra credit is added to the basic amount recharged. For more details on this promotion can be found on the website: http://jamaica.mobilerecharge.com/buy/mobile_recharge\nHondurans on the other hand get more of these promotions on MobileRecharge.com. It seems Tigo is a generous operator, since weekly bonuses are hosted by MobileRecharge.com for all Honduran expats and their relatives and friends who benefit from these offers.\nThe current offer on top ups to Tigo Honduras is valid until the end of October and brings 200% extra Tigo credit for top ups of minimum $6. Yet the Bonus applies to different numbers on different days. To avoid any misunderstanding, one needs to check the promotional calendar on the website before, under the operator's logo: http://honduras.mobilerecharge.com/buy/mobile_recharge\nEvery two seconds someone new joins MobileRecharge.com as they claim. According to customer reviews on such platforms as Trustpilot.com, most of those who use the service refill their relatives' phones abroad. Yet, some also use it to support their family and friends regularly with mobile credit for their local calls as well as for international ones. Many try not to miss the regular promotions since these bring extra credit automatically. On the other hand, there are many people who send mobile credit as a last minute gift.\nThere is also a large number who top up their own mobiles for at least 2 reasons:\n-Instead of going to the store, they top up online because it is the easier and saves them time and money\n-They live temporarily in some other country or travel a lot and use local SIMs they find easy to recharge online\nMobileRecharge app makes available all benefits of a website like MobileRecharge.com in one simple app: Daily Offers running on and on, phone Contacts automatically imported in the app interface, FAQ, recharge history, invoice history, direct access to one's account, different settings like a shortcut to a number recharged using a nickname, etc. More details can be found on App Store.\nTop ups can be made from the website as well as from the app called MobileRecharge, available for both iOS and Android. The app satisfies 5 basic needs:\n-Top ups on the go and online are easy to make; the online purchase is easy too, and only takes few seconds.\n-The app saves money and time; especially helpful when money transfers take hours or days.\n-Top ups are fast or instant and the processing fee is the lowest on the market.\n-No contract is needed.\n-Access to all invoices and history is possible without having to pay anything.\nAny currency is accepted as long as one makes the payment using paypal or any major card like Visa, American Express, JCB, Mastercard and Discover.\nOther reasons why customer appreciate the mobile top up service on MobileRecharge.com are the following:\n-Transactions are 100% safe.\n-Paypal accounts are accepted besides all major cards, no matter the currency or country of the sender.\n-The service is among the easiest to use on the global market.\n-MobileRecharge app is free to install, and it is available for Spanish or English speakers who want to refill on the go.\n-The website is available in several languages: English, Spanish, German, French and Italian.\n-There are daily promotions always running on the website's \"Promotions\" page, or on the MobileRecharge app.\n-The Facebook fans and the G+ or Twitter followers are automatically notified about the on-going promotions as they happen.\n-The Customer Service is seen as highly supportive (reviews prove this) and it is available 24/7 in both Spanish and English.\n-Potential customers and existing ones have an expat community on MobileRecharge.com Facebook page: https://www.facebook.com/MobileRecharge.Fan\n-Video tutorials are available on YouTube for independent users.\n-Interesting How-to articles and fun stuff is available on their blog as well: http://blog.mobilerecharge.com/\nMobileRecharge.com or MobileRecharge app is thus a solution for anyone, whether expat or resident, who needs to send credit to a mobile online in less than 1 minute without any hassle or even on the go. At present one can send credit to mobiles in over 120 countries, and choose from a list of more than 350 mobile operators, including Airtel, Claro, Cubacel, Digicel, Lime, Movistar, MTN, Orange, Telcel, Tigo and many more. Promotions bring weekly Bonuses, just as the 200% extra credit to Digicel Jamaica mobiles and Tigo Honduras late October.\nAbout MobileRecharge.com\nMobileRecharge.com is an interactive website designed by KeepCalling, a global telecommunication company registered in 2002 in USA. Presently, KeepCalling provides its services to hundreds of thousands of consumers and businesses, with a focus on customer satisfaction. KeepCalling has been listed by Inc 5000 as one of the fastest growing companies in the USA for 5 consecutive years. In 2015 the company registered a revenue increase of over 200% from 2011 to 2014.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuZmFjZWJvb2suY29tL01vYmlsZVJlY2hhcmdlLkZhbg==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2phbWFpY2EubW9iaWxlcmVjaGFyZ2UuY29tL2J1eS9tb2JpbGVfcmVjaGFyZ2U=", "https://mobilerecharge.com/promotions", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2hvbmR1cmFzLm1vYmlsZXJlY2hhcmdlLmNvbS9idXkvbW9iaWxlX3JlY2hhcmdl", "https://www.facebook.com/MobileRecharge.Fan", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2Jsb2cubW9iaWxlcmVjaGFyZ2UuY29tLw==", "http://jamaica.mobilerecharge.com/buy/mobile_recharge", "http://honduras.mobilerecharge.com/buy/mobile_recharge", "http://blog.mobilerecharge.com/", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9tb2JpbGVyZWNoYXJnZS5jb20vcHJvbW90aW9ucw=="], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T16:32:26.834+02:00", "highlightTitle": ""}