{"organizations": [], "uuid": "1ea41b18d909ba41864f8aa00602bcff89bc09ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141672/resitrader-announces-whole-loan-mortgage-trading-platform", "country": "US", "title": "Resitrader Announces Whole Loan Mortgage Trading Platform", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Resitrader Announces Whole Loan Mortgage Trading Platform", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T17:11:00.000+03:00", "replies_count": 0, "uuid": "1ea41b18d909ba41864f8aa00602bcff89bc09ce"}, "author": "admin", "url": "http://www.freshnews.com/news/1141672/resitrader-announces-whole-loan-mortgage-trading-platform", "ord_in_thread": 0, "title": "Resitrader Announces Whole Loan Mortgage Trading Platform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/16/2015 @ 7:11 AM Companies mentioned in this article: Resitrader, Inc. \nLOS ANGELES, Oct. 16, 2015 /PRNewswire/ -- Resitrader, Inc., a Calabasas, California-based provider of whole loan mortgage trade management software, announced that it has launched an online marketplace that will enable loan originators, banks, servicers, brokers and financial advisors to exchange loan data, documents and pricing information in order to buy and sell whole loans. \nThe platform allows secondary marketing professionals to scale more quickly by automating many activities currently supported through spreadsheets. This combination of secondary operations support with connectivity between buyers and sellers is believed to be unique in the mortgage industry. \nIn a seller-controlled auction format, the online platform will enable sellers of mini-bulk or specified pools of loans to structure offers while buyers either respond directly or build their own pools based on investment criteria. The system allows multiple buyers and sellers to offer, bid and transact simultaneously, and includes an easy-to-use trade settlement process. The Resitrader platform will initially emphasize Community Reinvestment Act-eligible loans but expects to quickly expand into other types of loans. \n\"With the rise of mini-bulk transactions and active price negotiation taking such a prominent role in today's market, a platform like Resitrader is long overdue, and not just for CRA-eligible loans,\" said Bill Dallas, CEO of Skyline Home Loans. \"Long-term, this might transform the way loans are priced with real-time market data.\" \n\"We're starting with CRA as that seems like a natural first step, given their geographic emphasis,\" said John Ardy, CEO of Resitrader. \"Buyers can search by census tract, income or other criteria to meet their investment needs. Resitrader provides the perfect context for offering, finding and purchasing loans needed to meet CRA audit findings.\" \n\"We're also seeing jumbo and expanded criteria loans loading onto the platform, so we know the process will work for those loan products as well,\" he added. \nResitrader is partnering with a national technology service provider to launch the trading platform. \n\"Our national partners will accelerate our growth as we strive to become the industry utility for whole loan mortgage trading,\" said Chris Saitta, strategic advisor to Resitrader. \"We are excited about the growth of purchase lending and innovative lending products that are sure to evolve in the next few years.\" \nAbout Resitrader \nResitrader, Inc. is a Calabasas, California-based provider of whole loan mortgage trade management software. Its online whole loan marketplace enables loan originators, banks, servicers, brokers and financial advisors to exchange loan data, documents and pricing information in order to buy and sell whole loans. The system enables multiple buyers and sellers to offer, bid and transact simultaneously, and includes an easy-to-use trade settlement process. For more information, visit www.resitrader.com \nPRESS CONTACT: Strategic Vantage Marketing & Public Relations(203) 378-5187 \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/resitrader-announces-whole-loan-mortgage-trading-platform-300161193.html \nSOURCE Resitrader, Inc.", "external_links": [], "published": "2015-10-16T17:11:00.000+03:00", "crawled": "2015-10-16T18:01:39.950+03:00", "highlightTitle": ""}