{"organizations": [], "uuid": "060940fd478c6c0a0ad90aab113df2b56cff2514", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/HP-India-to-split-into-two-by-Nov-1-says-it-will-be-business-as-usual/49404971.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/recentstories", "section_title": "Latest Information Technology News | Latest IT Industry News, Information and Updates: ET CIO : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/corporate-news/hp-india-to-split-into-two-by-nov-1-says-it-will-be-business-as-usual/49404971", "country": "IN", "title": "HP India to split into two by Nov 1; says it will be business as usual", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "HP India to split into two by Nov 1; says it will be business as usual", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:07:00.000+03:00", "replies_count": 0, "uuid": "060940fd478c6c0a0ad90aab113df2b56cff2514"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/corporate-news/hp-india-to-split-into-two-by-nov-1-says-it-will-be-business-as-usual/49404971", "ord_in_thread": 0, "title": "HP India to split into two by Nov 1; says it will be business as usual", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#HP HP India to split into two by Nov 1; says it will be business as usual In line with the split of Hewlett Packard into two businesses globally from next month, the company said that its India arm has also aligned itself into two entities. ET Bureau | 16 October 2015, 11:37 AM IST Share NEW DELHI: In line with the split of Hewlett Packard into two businesses globally from next month, the company said that its India arm has also aligned itself into two entities, which are ready to function separately from November 1. The California headquartered firm said that it has been working on a separation plan for the company for the last sixth months to make sure there are minimum glitches post the split.While HP Enterprise will be headed by Neelam Dhawan, HP Inc, which will cater to PCs, printers, etc will be headed by Rajiv Srivastava. The India operations will continue to be headquartered out of Gurgaon, said officials of the firm. While HP expects business to be as usual since both the companies were already functioning as separate divisions in the past, a few handful of operational changes have been taken care of.Lloyd Mathias, marketing head for personal computers for the Asia Pacific and Japan region said that all the existing government contracts have been reworked to include the new nomenclature. As far as future dealing with the government is concerned, Mathias said that there is unlikely to be any trouble. \"We have drawn up revenues for the last five years for each of the divisions which can be shown as proof of past track records while bidding in contracts,\" he said.In India, the company sees huge opportunity for its products with the current Digital India push of the Narendra Modi government said Ron Coughlin, Senior Vice President, Personal Systems, PPS, HP. He added that the company continues to bet big on PCs and new form factors of laptops despite the popularity of smartphones since it is not a very financial rewarding business. \"We are shipping two PCs every second, when the business is commoditised, scale matters,\" he added.Srivastava added that as far as manufacturing is concerned, the company already has a facility is Pant Nagar and will consider scaling it up in line with the demand in the market. It is currently used to assemble laptops and notebooks for the Indian market.", "external_links": [], "published": "2015-10-16T09:07:00.000+03:00", "crawled": "2015-10-16T16:10:48.857+03:00", "highlightTitle": ""}