{"organizations": [], "uuid": "8e3163547d4f7776a842d380da1c06c72e843195", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "", "site_section": "http://www.wcax.com/category/13536/technology-news", "section_title": "Technology &amp; Science News - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/30314156/congress-proposes-giveaways-to-auto-trucking-industries", "country": "US", "title": "Congress proposes giveaways to auto, trucking industries", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Congress proposes giveaways to auto, trucking industries - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "8e3163547d4f7776a842d380da1c06c72e843195"}, "author": "wcax.com", "url": "http://www.wcax.com/story/30314156/congress-proposes-giveaways-to-auto-trucking-industries", "ord_in_thread": 0, "title": "Congress proposes giveaways to auto, trucking industries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By JOAN LOWY\nAssociated Press WASHINGTON (AP) - At a time of record auto recalls and rising highway deaths, safety advocates say the Republican-run Congress is snubbing their agenda and taking sides with the auto and trucking industries in favor of legislation that could worsen matters.\nA House Energy and Commerce subcommittee held a hearing Wednesday on a GOP draft bill. One provision would require the National Highway Traffic Safety Administration to prepare recall notices in coordination with automakers and prevent the agency from making safety defects public until automakers supply a complete list of identification numbers for all affected vehicles. That would effectively give automakers control over the disclosure and timing of recalls, Mark Rosekind, head of the safety administration, told the hearing.\nThe bill also requires that a majority of the members of NHTSA committees developing cybersecurity and technology standards for increasingly computerized and connected vehicles be made up of officials from industries the agency regulates. That could \"seriously undermine NHTSA's efforts to ensure safety,\" Rosekind said. \"Ultimately, the public expects NHTSA, not industry, to set safety standards.\"\nThe bill would also give automakers a break on greenhouse gas emission and fuel economy requirements if they install new safety technologies in vehicles even though NHTSA has already said it intends to require some of those technologies. Manufacturers would effectively get \"a pass on pollution\" for \"doing things they are already doing,\" said Rep. Frank Pallone, D-N.J.\nThe provision is \"essentially a congressionally sanctioned defeat device,\" he said, referring to hidden software Volkswagen put in its cars to cheat on emissions tests.\nSafety advocates were most critical of what's not in the bill. For example, there's no increase in the maximum fine of $35 million per violation that can be levied against automakers who don't report safety defects or flout recall rules. The administration has recommended the limit be raised to $300 million, and safety advocates called for elimination of any limit.\nThere's also no increase in money for NHTSA to hire more staff to investigate potential safety defects and oversee automakers despite testimony that the agency doesn't have enough people to follow up on safety complaints.\nThe agency \"just doesn't have the capacity to do its job,\" said Joan Claybrook, a former NHTSA administrator and co-chair of Advocates for Highway and Auto Safety.\nThe bill also doesn't include provisions long sought by safety advocates to require that rental car agencies and used car dealers repair recalled vehicles before renting or selling them. A transportation bill passed by the Senate in July would require rental car agencies, but not used car dealers, to make the repairs.\nThere was a record 63.7 million vehicles recalled in the U.S. last year, more than double the previous record set in 2004. So far, 40 million cars and trucks have been recalled this year, putting 2015 on track for the second most recalled vehicles. Congress has held 10 hearings on auto safety defects over the past two years.\nCritics are overstating the ability automakers would have to delay recalls under the GOP bill's provision requiring the government to coordinate with manufacturers, said Wade Newton, a spokesman for the Alliance of Automobile Manufacturers. Manufacturers would still have to provide NHTSA with vehicle numbers within five days, he said.\nAutomakers oppose increasing the limit on fines NHTSA can levy because the Justice Department already has the authority \"to go well beyond\" the NHTSA cap, he said, pointing to a $1.2 billion fine for hiding safety defects agreed to by Toyota last year under a settlement with the department.\nOn Thursday, the House transportation committee is scheduled to consider a bipartisan bill that would force the government to remove safety ratings of truck and bus companies from a public website and lower the minimum age for interstate truck drivers to 19 1/2.\nThe ratings system was created by the Federal Motor Carrier Safety Administration in 2010 in response to deadly truck and bus accidents to help people learn about the safety record of companies they may want to use. The trucking industry, which objects to the government's methodology, has been lobbying against disclosure of the safety scores, saying they don't necessarily reflect a carrier's overall safety record.\nThe trucking industry has also been pushing for lowering the minimum age for interstate truckers, currently set at 21, to help relieve a shortage of drivers. The minimum age for truck drivers who don't cross state lines is 18. Safety advocates say teen drivers don't have enough experience to safely drive big rigs long distances.\nThe Senate transportation bill would lower the interstate age to 18 for a limited number of states who join a pilot program. The House bill sets a higher age, but effectively allows all states to participate in the pilot program, said safety advocate Jackie Gillan.\n\"You're talking about 18 and 19 year-olds driving cross country for long hours under grueling circumstances,\" she said. \"Truck driving isn't easy at all.\"\nThe two House bills are expected in the next few weeks to be wrapped into a larger measure that lays out federal transportation policy for the next six years. Lawmakers are also pushing proposals to in extend the length and increase the weight of tractor-trailer trucks.\n___\nFollow Joan Lowy on Twitter at http://www.twitter.com/AP_Joan_Lowy\n ", "external_links": ["http://www.twitter.com/AP_Joan_Lowy"], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-22T05:26:04.462+03:00", "highlightTitle": ""}