{"organizations": [], "uuid": "cc5a3c0248febaa1b5b207c44957fa8f9ddab4a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/technology", "section_title": "Technology | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/10/usa/us-lawmakers-advance-efforts-reauthorise-ex-im-bank", "country": "US", "title": "US lawmakers advance efforts to reauthorise Ex-Im Bank", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "US lawmakers advance efforts to reauthorise Ex-Im Bank | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T11:38:00.000+03:00", "replies_count": 0, "uuid": "cc5a3c0248febaa1b5b207c44957fa8f9ddab4a0"}, "author": "Dow Jones newswires", "url": "https://www.businessspectator.com.au/news/2015/10/10/usa/us-lawmakers-advance-efforts-reauthorise-ex-im-bank", "ord_in_thread": 0, "title": "US lawmakers advance efforts to reauthorise Ex-Im Bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House lawmakers backing the US Export-Import Bank said Friday they have enough support to force a vote to renew the agency's charter, a blow to conservative Republicans who sought to shutter the bank this summer.\nRepublican supporters of the agency, which finances US exports, filed a discharge petition in the House on Friday to force a vote on a measure to reauthorise the bank. Backers said they expected it would gain the required 218 signatures.\nMore than 40 Republicans had signed the measure on Friday morning, meaning that if most of 188 Democrats joined as expected, the petition would easily clear that hurdle. Procedural rules require seven legislative days to pass before it would come up for a vote, which could occur as soon as October 26.\nA discharge petition is a rarely effective procedural move aimed at bringing legislation to the floor over the wishes of House leadership. It requires a majority of the House's 435 members. The last successful discharge petition was in 2002, to force a vote on campaign-finance overhaul legislation.\nThe discharge petition adds to the turmoil consuming congressional Republicans. Majority Leader Kevin McCarthy (Republican, California)--who had supported the bank in the past but came out against it last year after he was elected to his current position--on Thursday abruptly withdrew from the race to replace House Speaker John Boehner (Republican, Ohio). He said he didn't think he was the right leader to unite a faction of frustrated conservatives with more moderate Republicans.\nThe fight over the Ex-Im Bank has exposed deep divisions between Republicans. Supporters say the US can't be competitive in emerging markets without it because foreign competitors rely on similar backing from their governments. The US Chamber of Commerce and industrial giants such as Boeing and General Electric have rallied to revive the bank.\nGOP supporters of the bank have faulted Republican leaders for refusing to allow debate on measures earlier this year that would have overhauled the bank, and said it left them no option but to seek a discharge of the bill.\n\"This was not something we smiled and celebrated,\" said Rep Adam Kinzinger (Republican, Illinois). \"A lot of us felt like we needed to get to a point where something so important to the economy was authorised.\"\nCritics of the bank say it primarily benefits a handful of large corporations, exposes taxpayers to unnecessary risks and amounts to picking winners and losers.\n\"A few dozen GOP pawns of K Street are working with Nancy Pelosi to advance the Chamber of Commerce's agenda. It is bad for the party and bad for the country,\" said Michael Needham, chief executive of Heritage Action for America, the lobbying arm of a think tank that has championed the Republican Party's most conservative lawmakers.\nMr Boehner hasn't taken a public position on the Ex-Im Bank except to say that it should be handled by the House Financial Services Committee, whose chairman opposes the bank and has championed the effort to shut it down. Other House GOP leaders have publicly supported the bid to shutter Ex-Im Bank, but the bank's Republican backers say at least 100 GOP lawmakers would vote to reauthorise its charter.\nThe Senate would still have to approve the measure, and it isn't clear how or when that would happen. Senate Majority Leader Mitch McConnell (Republican, Kentucky) opposes the bank, but the Senate approved a measure to reauthorise the bank's charter in July. That measure, which has the same language as the House bill, was amended to a separate bill that hasn't come up in the House.", "external_links": [], "published": "2015-10-10T11:38:00.000+03:00", "crawled": "2015-10-09T20:18:25.118+03:00", "highlightTitle": ""}