{"organizations": ["CTA"], "uuid": "6ac72c11912be0e8dedaad9dc7bb6656d7c5fd93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.grants-gov.net", "main_image": "", "site_section": "http://www.topgovernmentgrants.com/feeds/recent_grants_sector_rss.php?activity=ST", "section_title": "Grants Gov | Federal Grant Money for Science and Technology", "url": "http://www.grants-gov.net/grants_gov_display.php?program=W81XWH-15-VRP-CTA", "country": "US", "title": "DoD FY15 Vision Research Program Clinical Trial Award", "performance_score": 0, "site": "grants-gov.net", "participants_count": 0, "title_full": "DoD FY15 Vision Research Program Clinical Trial Award", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "6ac72c11912be0e8dedaad9dc7bb6656d7c5fd93"}, "author": "", "url": "http://www.grants-gov.net/grants_gov_display.php?program=W81XWH-15-VRP-CTA", "ord_in_thread": 0, "title": "DoD FY15 Vision Research Program Clinical Trial Award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The FY15/16 Vision Research Program (VRP) Clinical Trial Award (CTA) supports research with the potential to have a major impact on the treatment or management of visual injury and/or dysfunction.Funding from this award mechanism must support a clinical trial and should not be used for preclinical credit: research studies. To meet the intent of the FY15/16 VRP CTA, the research proposals must address one or more of the Capability Gaps listed below: Inadequate mitigation and treatment of damage to ocular structures and the visual system consequent to military-relevant injuries and diseases incident to military service.Research into ocular damage that occurs in the general public will also be considered, as there may be similarities and related treatments in the two populations. This includes but is not limited to:inadequate treatments and technologies for injuries and diseases to ocular structures and visual systems to include, optic neuropathy, retinal injury, lid and adnexal injuries and ocular polytrauma; inadequate strategies and techniques for controlling scarring and/or pathological healing response in traumatized ocular tissues. Inadequate vision restoration and regeneration:inability to restore form and function of lids, adnexal, orbital and ocular tissues (optic nerve, cornea, retina, and uvea) following injury; inadequate vision surrogates and appropriate rehabilitation. Lack of knowledge, capabilities, and equipment for early responders to diagnose and mitigate military-relevant eye injuries and diseases in austere or remote environments:lack of methods and/or devices to assist in the location of entrance wounds and rupture sites in traumatic eye injuries; lack of portable diagnostic tools and technologies for field use to detect ocular injuries and diseases. The five Focus Areas are listed below and have been developed to address the Capability Gaps listed above. All applications are highly encouraged to address at least one of the following Focus Areas: Phase I/Phase II clinical trials to evaluate safety and/or efficacy of treatments or technologies to reduce/control scarring and/or pathological healing response(s) after military-relevant ocular/visual system injury; Phase I/Phase II clinical trials to evaluate safety and/or efficacy of treatments or technologies restoring form and function to:(1) orbit and ocular tissues (optic nerve, retina, and uvea), (2) eyelid, and/or (3) adnexal structures; Phase I/Phase II clinical trials to demonstrate feasibility and safety and/or efficacy of vision surrogates for those with low or no vision post-injury and appropriate rehabilitation; Phase I/Phase II clinical trials for evaluation of technologies to identify the location of entrance wounds and rupture sites in traumatic eye injuries; Phase I/Phase II clinical trials for evaluation of technologies to detect and quantify white blood cells, red blood cells and proteins in both the aqueous and vitreous humor. Related Programs", "external_links": [], "published": "2015-10-13T03:00:00.000+03:00", "crawled": "2015-10-15T00:39:52.730+03:00", "highlightTitle": ""}