{"organizations": [], "uuid": "ad1563864b8ed5365a3fcac1df4b0e5dfc0cc629", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.morningstar.com", "main_image": "", "site_section": "http://news.morningstar.com/all/dow-jones/technology.aspx", "section_title": "News Archive: Technology", "url": "http://news.morningstar.com/all/dow-jones/technology/201510095462/investors-to-scrutinize-indias-information-technology-company-earnings.aspx", "country": "US", "title": "Investors to Scrutinize India's Information Technology Company Earnings", "performance_score": 0, "site": "morningstar.com", "participants_count": 1, "title_full": "Investors to Scrutinize India's Information Technology Company Earnings", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad1563864b8ed5365a3fcac1df4b0e5dfc0cc629"}, "author": "morningstar.com", "url": "http://news.morningstar.com/all/dow-jones/technology/201510095462/investors-to-scrutinize-indias-information-technology-company-earnings.aspx", "ord_in_thread": 0, "title": "Investors to Scrutinize India's Information Technology Company Earnings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Newley Purnell\nInvestors will be scrutinizing the results of India's big information-technology outsourcing companies in the next week for signs of their ability to thrive as cloud computing and other forces reshape the industry.\nAnalysts expect Infosys Ltd. and Tata Consultancy Services Ltd., India's two largest outsourcers by sales, to show healthy growth when they report earnings on Monday and Tuesday.\nMore important for gauging the companies' future prospects will be the popularity of services in emerging fields that, for instance, allow their customers to collect and analyze vast troves of data.\nInfosys hasn't broken out the amount of sales it receives from these so-called digital services, but TCS did so for the first time in July, noting that it received 12.5% of its quarterly revenue from such offerings.\nTCS's chief executive, N. Chandrasekaran, told investors at the time that he was \"convinced that in the next three to five years, every one of our service offerings will be predominantly digital.\"\nMoving into such sophisticated services is increasingly important as a widening shift toward cloud computing--where servers and software are accessed via the Internet rather than on local networks or personal computers--and other changes threaten to erode what has long been outsourcers' business model: using relatively cheap labor to write custom code and run databases.\n\"There is significant pressure on traditional IT services demand,\" said Dinesh Goel, a partner at outsourcing consultancy ISG India. Data analytics and other more sophisticated services \"are becoming more and more important in the revenue mix for these service providers.\"\nAn outsourcing company could, for example, Mr. Goel said, help an oil company outfit wells with digital sensors, analyze production and enable the company's workforce to make better use of mobile devices.\nThe value of outsourcing deals signed in 2014 shrank 17% to $120.4 billion from $145.5 billion a year earlier, according to consulting company KPMG LLC. India's National Association of Software and Services Companies, a trade group, estimates that the country's outsourcing industry will see revenue grow 13% this year. That is a sharp deceleration from 30%-plus growth less than a decade ago.\nBig-data and analytics services, which industry experts see as a potential driver of new growth, now account for about 10% of the Indian outsourcing industry's revenue, according to the software-and-services trade group and consultancy McKinsey & Company. But they project that figure will climb to 35% in five years and 60% a decade from now.\nIndian brokerage Motilal Oswal Securities Ltd. estimates Infosys's net income for the quarter will be 33.19 billion rupees ($512 million), up 7.2% from a year ago. It projects Tata Consultancy Services' net income will rise 18.2% to 62.49 billion rupees.\nBank of America Merrill Lynch estimates Infosys's revenues for the quarter will be 152 billion rupees, up 14% from a year earlier. It projects Tata Consultancy Services' revenues will rise 15% to 273 billion rupees.\nWrite to Newley Purnell at newley.purnell @wsj.com\n 09, 2015 10:37 ET (14:37 ", "external_links": ["http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Checked.gif", "http://s7.addthis.com/static/btn/sm-share-en.gif", "http://www.addthis.com/bookmark.php?v=250", "http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Unchecked.gif"], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-10T10:52:35.676+03:00", "highlightTitle": ""}