{"organizations": [], "uuid": "c37e647ae7b5050ef0742cc2de6141f1831532a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iafb9hy7vYck/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-16/nestle-burberry-show-how-era-of-easy-growth-in-china-is-over", "country": "US", "title": "Nestle, Burberry Show How Era of Easy Growth in China Is Over", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Nestle, Burberry Show How Era of Easy Growth in China Is Over - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T20:32:00.000+03:00", "replies_count": 0, "uuid": "c37e647ae7b5050ef0742cc2de6141f1831532a9"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-16/nestle-burberry-show-how-era-of-easy-growth-in-china-is-over", "ord_in_thread": 0, "title": "Nestle, Burberry Show How Era of Easy Growth in China Is Over", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Whether they sell tea or trenchcoats, consumer-goods companies can no longer count on easy business in China, where success now requires a more nimble approach.\nSluggish Chinese sales hurt Nestle SA, Hugo Boss AG and Burberry Group Plc, which all reported disappointing quarterly revenue this week. With China set to disclose its slowest economic growth since 2009 next week, European companies are searching for demand via new avenues.\nNestle and France’s Danone now cater to Chinese mothers who forgo locally produced baby formula and order it from abroad via Internet sites. Chinese luxury aficionados are traveling to Japan to buy TAG Heuer timepieces and Louis Vuitton handbags at better exchange rates. German retailer Metro AG has struck a deal with a local partner, picking Alibaba Group Holding Ltd. to let Chinese consumers snap up German brands of coffee and cookies over the Web.\nConsumer companies “need to be flexible to meet where the market is going,” said James Roy, associate principal at China Market Research Group. “The era of everybody buying the same big-name, signature items is going away.”\nThe yuan’s devaluation and a pullback in the Chinese stock market this year have weakened consumer confidence in a market that’s been suffering from a three-year campaign by the government against graft and extravagant spending among government officials.\n“There is no question China has slowed down,” Wan Ling Martello, Nestle’s head of its business unit that includes Asia, said at a press conference Friday. “My priority is to get growth back.”\nBurberry is in a weaker position than most. The maker 1,995-pound shearling trenchcoats gets more than 30 percent of revenue from Chinese consumers, yet only 2 percent from Japan, where many of those shoppers are traveling for bargains. In contrast, Hermes International SCA reported a 20 percent increase in first-half earnings as sales growth accelerated in Japan for the French luxury handbag maker.\nWestern Spirits Consumer companies have been trying to crack the Chinese market for decades. Nestle was one of the first to enter, opening a distribution office in 1908. Others, like Unilever and Pampers diapers maker Procter & Gamble Co., entered in the late 1980s. For years, they enjoyed double-digit growth rates, and today Greater China is Nestle’s second-largest market, accounting for 7 percent of sales.\nBeverage companies have lost sales to China’s anti-graft crackdown, yet there are now reasons for optimism. Demand for western spirits, including those from Diageo Plc, is expected to grow 3 percent this year, compared with an estimated 10 percent decline in the second half of 2014, according to a Goldman Sachs report.\nTraditionally, most of Diageo’s sales in China were at karaoke bars and nightclubs, where government officials would entertain each other and order lots of expensive spirits like the fiery white liquor baijiu and single-malt scotch. Now, officials fear being seen splurging at public expense, so they’re drinking more at home. Both Diageo, the maker of Johnnie Walker scotch, and French rival Pernod Ricard SA have introduced lower-priced spirits in response.\nWatchmakers have also seized the opportunity. The Greater China market first surpassed the U.S. as the largest market for Swiss timepieces in 2008. The Swiss watch industry will face a tougher year in 2016 because of dependence on that market, Jean-Claude Biver, head of watch brands for LVMH Moet Hennessy Louis Vuitton SE, said Sept. 29.\nThe French luxury-goods conglomerate has closed a TAG Heuer store in Hong Kong, where high rental costs are making luxury-goods makers rethink if they get enough sales there. Instead, LVMH is adding stores in locations such as Tokyo’s Ginza shopping district and Melbourne, Australia, as Chinese tourists increasingly shop there.\nFollowing Consumers “We will follow the Chinese consumer wherever he goes,” Biver said.\nChina hasn’t lost all its allure. Nestle Chief Executive Officer Paul Bulcke said he remains “extremely optimistic” for the country’s long-term prospects. The company built China into its second-largest market through the $11.9 billion acquisition of Pfizer Inc.’s Wyeth Nutrition infant formula business in 2012 and investments in two local companies in 2011.\nThe Swiss company said Friday it’s reformulating its ailing Yinlu brand, which sells a peanut milk beverage and a rice porridge called congee. Still, not all categories have been hurt, and growth rates vary widely. Soluble coffee sales are rising 8 percent and a new ready-to-drink Nescafe beverage is growing at about 25 percent, according to Martello.\nUnilever and Nestle are also boosting e-commerce in China, where McKinsey forecasts annual online-retail sales will reach about $610 billion in 2018, surpassing Europe and the U.S. combined.\n“I’m optimistic for the future,” CEO Bulcke said at a press conference at the Nespresso maker’s headquarters in Vevey, Switzerland. “It’s not going to be a flip-flop all of a sudden. It is a momentum that’s building up. Once we have that, it’s going to be solid.”", "external_links": [], "published": "2015-10-16T20:32:00.000+03:00", "crawled": "2015-10-16T16:00:09.737+03:00", "highlightTitle": ""}