{"organizations": [], "uuid": "d3ddac90f2d436eced2f53bd5fa617fab2938bb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/a/9/s/w/image.related.afrArticleLead.620x365.gkdnuz.png/1445322999135.jpg", "site_section": "http://www.afr.com/technology", "section_title": "Technology News | afr.com", "url": "http://www.afr.com/technology/how-the-tech-changes-from-david-murrays-financial-system-inquiry-rated-20151020-gkdnuz", "country": "AU", "title": "How the tech changes from David Murray's financial system inquiry rated", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "How the tech changes from David Murray's financial system inquiry rated | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T13:58:00.000+03:00", "replies_count": 0, "uuid": "d3ddac90f2d436eced2f53bd5fa617fab2938bb0"}, "author": "Paul Smith", "url": "http://www.afr.com/technology/how-the-tech-changes-from-david-murrays-financial-system-inquiry-rated-20151020-gkdnuz", "ord_in_thread": 0, "title": "How the tech changes from David Murray's financial system inquiry rated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Murray's financial system inquiry had many relevant recommendations that could shape the financial technology landscape in Australia. Share on twitter Share on Google Plus by Paul Smith From crowdfunding startups to digital identities, a number of changes have been promised in the government's response to David Murray's financial system inquiry, but the long awaited answers have left some underwhelmed and others seeking more details.\nCrowdfunding The desire from startups to see rules in place to facilitate crowd sourced equity funding have been well documented, and the government has consistently pledged to make it a reality.\nWhat Murray recommended: Graduate fundraising regulation to facilitate crowdfunding for both debt and equity and, over time, other forms of financing.\nIBRS advisor James Turner said there was a lot of buzz in the cyber security industry about private sector and government collaboration. Jim Rice Government response: \"The Government agrees and committed to develop a regulatory framework to facilitate crowd-sourced equity funding through the 2015-16 Budget. The Government consulted widely on options in early 2015. The Minister for Small Business and Assistant Treasurer will consult on draft legislation to implement this framework by the end of 2015. The Government will consult the community on crowd-sourced debt funding in parallel with legislation to implement crowd-sourced equity funding.\"\nExpert reaction King and Wood Mallesons partner Shannon Finch said that while this was a welcome response the success or failure of the reforms would depend on the significance of the changes proposed, and the recognition that greater fundraising flexibility is needed across the board.\n\"Pure retail crowdsourcing models are not the whole solution to supporting startups, but streamlined regulatory frameworks for licensing and disclosure, across the board, could make a real difference,\" she said.\nAustralian chief executive of peer to peer lender Ratesetter Daniel Foggo said the government's response to the report was a missed opportunity to form a committee to look at a range of issues related to fintech Australian managing director of accounting software maker Xero Chris Ridd meanwhile said he was pleased to see the government recognising the importance of assisting small businesses and startups, by continuing develop equity crowdfunding.\n​He said it was important for growing companies to have greater access to capital from alternative sources.\n\"There is a lot of innovation in alternative lending sources and increased competition will only continue to benefit those seeking additional capital. While these first steps are important, we are looking forward to seeing the tangible results of the consultations, and what they mean for the businesses accessing funding in the future.\"\nPartner at startup accelerator Pollenizer Daniel Ringrose meanwhile said policy legislation needed to provide proactive ways to make transacting with crowdfunding easier, while also defining practices for regulation such as anti-money laundering.\nPeer to peer lender SocietyOne's CEO Matt Symons said ASIC was starting to do a great job in reaching out and create an unstructured and open dialogue with innovative startups Michele Mossop \"Crowd funding concepts may have started with fun gizmo's from platforms like Kickstarter, but has rapidly grown into a major source of business funding, he said.\n\"Supporting this initiative makes funding in early stage startups accessible to everyone, and not just the high net worth individuals and venture capital investors who invest today.\"\nCo-founder of online customer service startup LeadChat Michael Jankie said the government's response showed the government understood that the nature of building a business was changing.\n\"The future round of smart investors are not the current qualifying high net worth individuals, they are the kids who have a YouTube channel, play poker online and have found hundreds of other ways to make money,\" he said.\n\"The PM gets this. He didn't become rich from being a high net worth individual and being the only one who could sink or fund a company, he became rich because he traded cash for equity in amongst other things, a startup.\"\nIBRS analyst Guy Cranswick meanwhile said the moves could be significant and unlock funding for business where its needed a standard channels have been less than efficient.\n\"Obviously we have to see the draft but the motives are solid and a draft by end of 2015 shows intent,\" Mr Cranswick said.\nDigital identity The Murray inquiry recommended the national digital identity so that citizens can more easily interact with financial institutions and government departments online, without maintaining an impossibly long list of user names and passwords.\nWhat Murray recommended: Develop a national strategy for a federated-style model of trusted digital identities.\nGovernment response: \"The Government agrees that a national digital identity strategy will help to streamline individuals' engagement with government and provide efficiency improvements. The Digital Transformation Office will work across government and with the private sector to develop a Trusted Digital Identity Framework to support the Government's Digital Transformation Agenda.\"\nExpert reaction Mr Ringrose said that while Australians had once rejected a proposal for an 'Australia Card' technology had moved on significantly since, and people had become accustomed to digital identities from Google, Apple and Facebook, which could be used to sign in to numerous online sites and services.\n\"None of these are regulated by government policy, yet we trust them, so why would we be fearful about a controlled identity with government?\" he asked.\nHe said Australia could look to Estonia as a great example of the benefits that can be gained through an online identity. In 2000 it implemented the Identity Documents Act and Digital Signatures Act, which simplified interactions with citizens and had evolved to transport tickets, pensions and tax.\nHe said new policy would allow the government to catch up to private sector and other countries.\nGartner analyst and former Australian government chief information officer Glenn Archer said a reliable, secure and easily used credential - available to both citizens and businesses would go beyond simply enabling better interactions with government.\n\"It is an essential requirement for any nation aspiring to establish a strong digital economy. In the absence of a mandatory national government issued credential, Australia will need to look to a federated model that can be adopted and leveraged by all sectors,\" Mr Archer said.\nMr Jankie said Australian's needed to be able to move fast and transact quickly, and that existing efforts for citizens to deal with government online were well below the required standard.\n\"I laugh every time I have to sign a document for the bank, in original form and post it back to them. Do we really think a scribble on a piece of paper is still an appropriate way of checking our identity?\" he asked.\n\"While some inroads have been made, has anyone actually tried to setup and use AUSKey, or the myGov system, or the myriad of other different processes needed for government and financial industry access?\"\nCyber security What Murray recommended: Update the 2009 Cyber Security Strategy to reflect changes in the threat environment, improve cohesion in policy implementation, and progress public-private sector and cross-industry collaboration. Establish a formal framework for cyber security information sharing and response to cyber threats.\nGovernment response: \"The Government agrees that an updated Cyber Security Strategy that is able to minimise the risk of a cyber-crisis in Australia is important for the resilience of the financial system. The Government announced a review of the Cyber Security Strategy on 27 November 2014. This recommendation will be progressed through that review.\"\nExpert reaction IBRS advisor James Turner said there was a lot of buzz in the cyber security industry about private sector and government collaboration. He said reviews and frameworks could be useful, but it was more important for government and businesses to start working together in the real world to address growing security concerns.\n\"The government is saying cyber security is not a problem that it can solve, and private sector organisations agree, but then everyone stops talking and looks around hoping for someone to actually lead,\" Mr Turner said.\n\"The challenge that the government recognises it has, is sharing sensitive information without disclosing methods to people that do not have security clearance. A further challenge is finding people who can speak about cyber to non-technical people, and then talk about national security and business interests to security people. These people are rare, but their numbers are growing.\"\nAccess to government data What Murray recommended: \"Review the costs and benefits of increasing access to and improving the use of data, taking into account community concerns about appropriate privacy protection.\"\nGovernment response: \"The Government agrees to improve the use of data. This has the potential to unlock significant efficiency improvements in the financial system. We will task the Productivity Commission with reviewing options to improve accessibility to data, taking into account privacy concerns and other existing Government processes.\"\nExpert reaction Mr Cranswick said this represented a good step and the Productivity Commission would provide groundwork for organisations to assess the potential.\nHe said a cost benefit analysis would have to look ahead as data access of this type would yield more value over time, and that risk issues, not just security also needed to be assessed.\nHis IBRS colleague Mr Turner however said it was worth noting the vagueness of the requirements for data governance, and specifications about who would coordinate and control data sharing\n\"Generally speaking, the recommendations are long on rhetoric and short on details. It's easy for us all to agree that we ought to get along better, and everything should be wonderful,\" Mr Turner said.\n\"But the fact we're recognising we're not there yet is an indicator that someone has to actually get up from the sofa and do more than shout at the TV. If we're going to start passing data between the public and private sector, we need to have a clear and transparent process for understanding who is making decisions about what can be shared.\"\nMr Archer said the recommendation was laudable but too narrow. He said the Productivity Commission needed to be asked to consider the wider implications to Australia's future prosperity in the context of an increasingly digital world.\n\"While making better use of data can extract greater value from it, the fact remains that the internet and the Digital Economy go much further than this. While other countries have established quite explicit strategies to pursue the opportunities here, the Productivity Commission has done very little in this space in recent years,\" Mr Archer said.\nPublic/private sector collaborative committee What Murray recommended: \" Establish a permanent public-private sector collaborative committee, the 'Innovation Collaboration', to facilitate financial system innovation and enable timely and coordinated policy and regulatory responses. \"\nGovernment response: \"The Government agrees to establish an Innovation Collaboration committee. Innovation is critical to unlocking productivity improvements in the financial system. However, emerging firms and start-ups often struggle to find a way of engaging with government. A permanent innovation committee will provide this point of entry. To avoid unnecessary duplication for industry, the Innovation Collaboration committee will be linked with ASIC's Digital Finance Advisory Committee.\"\nExpert reaction Australian chief executive of peer to peer lender Ratesetter Daniel Foggo said the government's response to the report was a missed opportunity to form a committee to look at a range of issues related to fintech, tax incentives and international access.\nHe was disappointed the government did not make it compulsory for banks to contribute extra data under the new comprehensive credit reporting regime, which allows banks to contribute \"positive data\" like loan repayments history. He also questioned the decision to link the committee to ASIC.\n\"I am underwhelmed – there's a lot of warm and fuzzy words about fintech, but no tangible evidence of anything changing,\" Mr Foggo said.\n\"They are looking to link the innovation committee with ASIC's digital finance advisory committee, which is focused on regulation. That is just a small piece of the puzzle… What we need is support not regulation.\"\nMs Finch from King & Wood Mallesons however said she was delighted at the committee being set up, saying connectivity with the market and industry would be key to the success of the initiative.\nMr Jankie said the committee would be useful in facilitating financial system innovation and enabling timely and coordinated policy and regulatory responses.\n\"I still cannot believe we have a PM who actually used the words \"innovation\" and \"disruption\" in his first remarks when becoming PM. Of course we need to add innovative and disruptive thinkers into the government's knowledge base,\" he said.\n\"We should be properly talking about ideas that have spent the past decades on the 'no' list because of one-liner political sound bites. Words like hacking, disruption, deficit and agile all have their place in positive short and long-term growth of our nation.\"\nPeer to peer lender SocietyOne's CEO Matt Symons said the response was a way for startups to think freely rather than adapt their ideas to fit existing regulations.\n\"ASIC is starting to do a great job in reaching out and create an unstructured and open dialogue with innovative startups and this is opening the door to real competition,\" he said.\n\"But ASIC only have a finite set of resources, what this response does is prompt people to come and ask questions of the regulator rather than go away talk to a lawyer and then second guess how the regulation might fit their idea. If we don't encourage this we might default to global platforms dominating the fintech space in Australia, and the truth is, we can build most of this locally.\"", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/101552183386293013225/posts", "https://twitter.com/@SaysSmithy"], "published": "2015-10-20T13:58:00.000+03:00", "crawled": "2015-10-20T16:34:35.093+03:00", "highlightTitle": ""}