{"organizations": [], "uuid": "9e35211649d635d725df522b8a9f6df4e492aba1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144232/rivet-radio-adds-podcasts-launches-new-follow-feature-provide-a-more-personalized-list", "country": "US", "title": "Rivet Radio Adds Podcasts, Launches New 'Follow' Feature to Provide A More Personalized Listening Experience", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Rivet Radio Adds Podcasts, Launches New 'Follow' Feature to Provide A More Personalized Listening Experience", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T15:17:00.000+03:00", "replies_count": 0, "uuid": "9e35211649d635d725df522b8a9f6df4e492aba1"}, "author": "admin", "url": "http://www.freshnews.com/news/1144232/rivet-radio-adds-podcasts-launches-new-follow-feature-provide-a-more-personalized-list", "ord_in_thread": 0, "title": "Rivet Radio Adds Podcasts, Launches New 'Follow' Feature to Provide A More Personalized Listening Experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Rivet Radio, Inc. \nCHICAGO, Oct. 22, 2015 /PRNewswire/ -- Rivet Radio , the smart audio platform, brings greater personalization to audio listening with today's launch of a 'Follow' feature in its iOS mobile app. Users now have the ability to follow specific topics, shows, hosts or producers from Rivet's feed of robust audio content. Listeners can easily stay informed about what matters to them most by curating their own personal channel of 'followed' content. \nhttp://photos.prnewswire.com/prnvar/20150424/201547LOGO \nThe launch of the feature complements Rivet's expansion of its spoken word programming by giving listeners access to hundreds of the most popular podcasts, such as Wait Wait...Don't Tell Me, This American Life, 99% Invisible, TED Radio Hour, Freakonomics Radio, and Radio Lab. \n\"The new Follow feature, coupled with our addition of premiere podcasts, creates an even richer and more tailored listening experience for all users,\" said Judy MacLeod, VP of Podcasts at Rivet Radio. \"We recognize the remarkable demand for a thriving form of audio storytelling like podcasts, and are working to bring 200 leading podcasts to our listeners by the end of this month.\" \nRivet Radio creates bespoke playlists for each user based on their unique preferences and listening habits, and aims to become a one-stop-shop for all spoken-word programming. Listeners can hear trending national and world news, enjoy a fresh mix of podcasts and receive current traffic and weather reports from the Rivet Radio app. \nRivet Radio, Inc. Featured by Apple as \"The Best in Bite-Sized News\" and a \"Start Up To Watch\" by Chicago Innovation & Built in Chicago in 2015, Rivet delivers customized, multiplatform audio news and feature stories worldwide. Rivet has grown from iPhone , Android , Amazon and car apps into a platform powering the global Audio of Things for millions of listeners. It's radio reimagined. \nFor more information and to download Rivet Radio, visit www.rivetnewsradio.com .Rivet Radio:", "external_links": [], "published": "2015-10-22T15:17:00.000+03:00", "crawled": "2015-10-22T16:43:00.017+03:00", "highlightTitle": ""}