{"organizations": [], "uuid": "b451499c44051465c9d91d32e1f5b1fc5cd760c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.consumerelectronicsnet.com", "main_image": "", "site_section": "http://feeds2.feedburner.com/Cen-ConsumerElectronicsNet-technologyNews", "section_title": "CEN - Consumer Electronics Net-Technology News", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4114107", "country": "US", "title": "Synology Plans New OS, Virtual DSM, Apple Watch?? App, First Router & More In 2016", "performance_score": 0, "site": "consumerelectronicsnet.com", "participants_count": 0, "title_full": "Synology Plans New OS, Virtual DSM, Apple Watch?? App, First Router & More In 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T22:00:00.000+03:00", "replies_count": 0, "uuid": "b451499c44051465c9d91d32e1f5b1fc5cd760c8"}, "author": "", "url": "http://www.consumerelectronicsnet.com/articles/viewarticle.jsp?id=4114107", "ord_in_thread": 0, "title": "Synology Plans New OS, Virtual DSM, Apple Watch?? App, First Router & More In 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Synology Plans New OS, Virtual DSM, Apple Watch App, First Router & More In 2016 Private Cloud Leader Unveils Big Changes for Business and Personal Tech October 13, 2015 -- \nBELLEVUE, Wash. , Oct. 13, 2015 /PRNewswire/ --To meet increasing demands for professional and personal technology, Synology Inc. will make sweeping changes in 2016. Next year, the company will launch the new DiskStation Manager (DSM) 6.0 operating system, apps for wearables, advanced network attached storage (NAS) products, and its first router the Synology RT1900ac. \nPhoto - http://photos.prnewswire.com/prnh/20151013/276538 \nChanges Focus on Two Audiences Business and Home Users \"Synology is more than NAS devices,\" said Synology Marketing Manager Jason Bonoan . \"Many of our business customers use our DiskStations and RackStations as replacement servers. So, it makes sense that SMEs and SMBs asked for more features for virtualization, data protection, disaster recovery, and productivity apps. We've listened and redesigned our OS and hardware to meet their demands.\" \nSynology has launched the DSM 6.0 beta to gain input for the new OS, which is scheduled for release in 2016. \nBonoan continued, \"Still, Synology products are also very popular at home, so we're adding new software and hardware for those users, too. In the coming months, you'll see integration for Apple Watch, better streaming for Video Station, and our first router the RT1900ac.\" \nA Better OS for Work and Home All Synology NAS use the same intuitive DiskStation Manager (DSM) operating system from the two bay BeyondCloud, up to the RC18015xs+ which has over 1 PB of raw storage. Synology's new OS will have innovations for both business and home users. Since customers don't have to learn a different DSM for work and play, it's easier to stay connected to their entire digital life. To try out the new DSM 6.0 beta go to: www.synology.com/en-us/dsm/6.0beta . For more on the new DSM 6.0 highlights and hardware launches for business and personal use, read on. DSM AND HARDWARE CHANGES FOR BUSINESS USERS \nDSM For Business: Improved Architecture to Support More Enterprise Features With an upgrade of its software architecture, Synology's new DSM will help companies store more data, process it quicker, maintain better backups, and recover data faster in the event of a disaster all while saving money and improving office productivity. Highlights include: Rolled up OS architecture: will support expanded 64-bit computing in more components of DSM 6.0. For components that will utilize 64-bit computing, over 4GB of memory can be used which can increase concurrent users from 1,000 to more than 10,000; while adding performance advantages. Modularization of previously built-in applications: also delivers higher system reliability and flexibility when adopting updates. Petabyte-level shared folder: the Synology PetaSpace technology allows users to create a shared folder with petabyte capacity on multiple volumes, serving as the ideal solution to manage and archive cold data. Enhanced security: For each DSM update, Synology will implement the Qualys Vulnerability Management solution, ensuring all potential issues are rectified before DSM changes are made available to the public. Accessibility features: striving to provide a smooth, intuitive experience to all users, Synology will be the first to offer support for NVDA (NonVisual Desktop Access). The screen reader will help visually impaired people have more access to private clouds. \nDSM For Business: Synology Will Launch the First Docker DSM & Virtual DSM To help businesses save time and money, Synology will release virtualization apps so IT admin create highly efficient virtual storage that is reliable and easy to manage. Lightweight Docker DSM : by running multiple DSM instances (as Docker containers), on one single NAS, IT administrators can effortlessly create a multi-tenant environment. You choose a CPU priority level and Docker will dynamically allocate the resource based on your choice. Docker DSM instances will also greatly increase the overall system reliability as all containers run independently and do not interfere with each other. Powerful Virtual DSM: in addition to Docker DSM advantages, Virtual DSM will offer greater control over CPU resources and includes live migration capability allowing businesses to migrate DSM services to another host without any downtime. This will contribute to better reliability and flexibility for deployment and maintenance. \nDSM For Business: Better Cloud Synchronization, Data Protection, and Disaster Recovery For the first time, Synology will create a Cloud Station suite to separate functions for bi-directional and standard synchronization. It will contain a wizard to help users easily set up hybrid clouds for disaster recovery. The suite is also ideal for organizations that have remote or branch offices that need to share up-to-date information, through a secure connection. Snapshot-based replication enables local and remote recovery: the Snapshot and Replication technology that comes with the advanced Btrfs file system reduces the impact of massive reading / writing on hard drives and high bandwidth consumption caused by traditional backup. Snapshots can be taken as frequent as every five minutes. Failover is performed through one-click migration, so businesses can easily achieve uninterrupted data protection and immediate disaster recovery. All-around disaster recovery solution through a hybrid cloud: being able to sync with public clouds, the Cloud Sync package adds support for several business-grade cloud services. Not only can users now set up multiple syncing tasks within a single account, but they can also upload the same sets of files to multiple public clouds. In the case of a catastrophic event, a company can recover its data from the cloud. Extensive data synchronization with Cloud Station: Cloud Station offers cross-platform, cross-device data syncing tools. Synology developed an Intelliversioning algorithm that determines if a file version is important based on: if changes were saved, how frequently saving occurred, and when. The proprietary filter only keeps the most important historical versions of each file. The block-level and cross-version deduplication, exclusive to Synology's backup feature, will provide the most effective and efficient recovery points. Also, the newly released Cloud Station Backup package introduces easy backups for personal computers. \nDSM For Business: Cloud & Productivity Apps Will Help Companies Own and Manage Data In the last five years, companies have become increasingly concerned about using public clouds to host email servers, network servers, and vital company files. To address this problem, Synology designed new apps to give companies complete control over their data and work products. All-new active-active mail server solution, MailPlus: the newly designed MailPlus service will allow businesses to enjoy the benefits of cross-platform support and comprehensive management features, while managing their data privacy. Furthermore, MailPlus Server will provide an active-active high-available framework that can guarantee uninterrupted service and maintain high productivity for enterprise users. SpreadSheet makes collaboration easier than ever: SpreadSheet will offer comprehensive collaboration, tag, and privilege management features. Accidentally deleting data is a common problem that Synology has solved in Spreadsheets. The new app will keep unlimited historical versions, so users can easily restore previous versions, themselves. Rich business applications in Note Station: the Presentation feature has evolved and is able to convert raw data into easy-to-understand charts. A new Chrome extension will make offline editing possible, freeing users from the limitations of their devices and the Internet when working on the go. Full content search in File Station: File Station will index approximately 700 common file formats, including the metadata of multimedia files. A quick search will identify the exact document, music, video, or photo you need immediately. \nNew NAS Hardware for Business: DS716+ NAS Server with 4K Video Transcoding Making its first appearance in 2016, the DS716+ NAS server is perfectly designed for advertising companies, videographers, creative firms and any business that needs to transcode large videos files, quickly. Highlights include: Featuring Intel's next-generation processor: the 14nm Intel Braswell quad-core processor reduces power consumption by 40 percent. Real-time video transcoding: able to transcode 4K video on the fly. High Availability capability: for increased reliability. Excellent scalability: can be expanded to seven disks by connecting a DX513 expansion unit to offer up to 56TB of raw storage. Uncompromising performance: compared with its predecessor, the DS716+ has increased its read / write performance at least 160 percent for AES-256 bit encrypted data transfer. DSM AND HARDWARE CHANGES FOR HOME USERS \nDSM For Home and Personal Use: New and Improved Multimedia Apps Synology's mobile and multimedia apps have helped users enjoy their music, videos, and photos on the go. Continuing that tradition, Synology will be the only NAS company to support Apple Watch integration. Users will also see improvements in the widely popular Video Station app. First to support Apple Watch, heading on to the world of wearable devices: in observing users' habits, DSM 6.0 becomes the first to support Apple Watch with DS note and DS audio mobile apps. Users can use simple gestures or voice control to quickly check or create notes, or enjoy their favorite music whenever and wherever they want. Video Station refreshingly new, strikingly intuitive: the completely redesigned Video Station will use a popular on-screen button layout, making navigation smoother and more intuitive than ever. New support for offline transcoding and Windows 10 enables users to switch between different devices and platforms - so they can enjoy an uninterrupted viewing experience. \nHardware for Personal Use: The Synology Router RT1900ac Creates an Unparalleled User Experience Synology will take its first entry into networking with the RT1900ac router. Designed for the ultimate user experience, the RT1900ac router has the most desktop-like interface in the industry; easy 3-step setup for mobile devices and PCs; and options to control traffic by device, application, and bandwidth. Other highlights include: Robust performance: provides up to 1900 Mbps combined transfer speeds and supports beamforming which can maximize Wi-Fi signal for specific devices. Revolutionary user interface: Synology users who are familiar with the DSM OS, will enjoy the Synology Router Manager (SRM) operating system. Designed to be similar to the original DSM, SRM comes with a DS router mobile app, DS file, and DS download for accessibility and easy file management. Advanced network management: includes application-based traffic control and DNS-based, customizable web filters. Exclusive Synology add-ons: supports several popular Synology packages such as VPN Server, Radius Server, and Download Station. Connect the router with an external storage device and it immediately turns into a personal cloud. \nSynology DSM 6.0 Beta Program Synology will award a DS215j to the beta testers who provide the most valuable assistance and feedback for Beta 1 and Beta 2 respectively. Three winners will be selected at each stage. Please visit https://www.synology.com/dsm/6.0beta/ReleaseNote for more details. \nAvailability Synology DSM 6.0 Beta is free to download for users who own a DiskStation or RackStation x11 series and onward. Supported models include: 16-series: RS18016xs+, RS2416(RP)+ 15-series: RC18015xs+, RS815(RP)+, RS815, DS3615xs, DS2415+, DS2015xs, DS1815+, DS1515+, DS1515, DS715, DS415+, DS415play, DS215+, DS215j, DS115, DS115j, BC115j 1300, BC115j 1200 14-series: RS3614xs+, RS3614(RP)xs, RS2414(RP)+, RS814(RP)+, RS814, RS214, DS414, DS414j, DS414slim, DS214+, DS214, DS214play, DS214se, DS114, BC214se 2300 13-series: RS10613xs+, RS3413xs+, DS2413+, DS1813+, DS1513+, DS713+, DS413, DS413j, DS213+, DS213, DS213air, DS213j 12-series: RS3412(RP)xs, RS2212(RP)+, RS812(RP)+, RS812, RS212, DS3612xs, DS1812+, DS1512+, DS712+, DS412+, DS212+, DS212, DS212j, DS112+, DS112, DS112j 11-series: RS3411(RP)xs, RS2211(RP)+, RS411, DS3611xs, DS2411+, DS1511+, DS411+II, DS411+, DS411, DS411j, DS411slim, DS211+, DS211, DS211j, DS111 \nSynology at a Glance Synology creates network attached storage and IP surveillance solutions that transform the way users manage data and conduct surveillance in the cloud era. By taking full advantage of the latest technologies, Synology aims to help users centralize data storage and backup, share files on the go, and implement professional surveillance solutions in reliable and affordable ways. Synology is committed to delivering products with forward-thinking features and the best in class customer services. For more on Synology, visit: www.synology.com \nPress Contact:", "external_links": [], "published": "2015-10-13T22:00:00.000+03:00", "crawled": "2015-10-14T08:46:25.310+03:00", "highlightTitle": ""}