{"organizations": ["CIVCO Medical Solutions", "New Exclusive Pearltec AG Partnership Pearltec AG"], "uuid": "09c1276bc239fd85c0e6f82dd31876fc449bec52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/CIVCO-will-Launch-Exclusive-Partnerships-at-2015-ASTRO-Meeting-in-San-Antonio-48999-1/", "country": "US", "title": "CIVCO will Launch Exclusive Partnerships at 2015 ASTRO Meeting in San Antonio", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "CIVCO will Launch Exclusive Partnerships at 2015 ASTRO Meeting in San Antonio", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:56:00.000+03:00", "replies_count": 0, "uuid": "09c1276bc239fd85c0e6f82dd31876fc449bec52"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/CIVCO-will-Launch-Exclusive-Partnerships-at-2015-ASTRO-Meeting-in-San-Antonio-48999-1/", "ord_in_thread": 0, "title": "CIVCO will Launch Exclusive Partnerships at 2015 ASTRO Meeting in San Antonio", "locations": ["CORALVILLE Iowa", "San Antonio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY CIVCO will Launch Exclusive Partnerships at 2015 ASTRO Meeting in San Antonio ... CORALVILLE Iowa Oct. 15 2015 /PRNewswire/...New Exclusive Sentient Partnership The Sentient experience brings ...New Exclusive Pearltec AG Partnership Pearltec AG offers innovativ... CIVCO Medical Solutions is honored to partner with Sentient and Pearl... http://feeds.bio-medicine.org/latest-medical-technology Date:10/15/2015 \nCORALVILLE, Iowa , Oct. 15, 2015 /PRNewswire/ -- ASTRO Booth #1047 -- CIVCO Medical Solutions, the leading provider of comprehensive motion management solutions for radiation oncology, will introduce its new exclusive partnerships with Sentient and Pearltec AG along with new innovative solutions to attendees of the American Society for Radiation Oncology (ASTRO) Annual Meeting in San Antonio, Texas , Oct. 18-21. \nNew Exclusive Sentient PartnershipThe Sentient experience brings the comforting power of nature and personalized treatment experience to every patient by offering them control and choice. With the tap of a finger on an IPad, a patient can choose their favorite lighting color, music, and video for a soothing, personal experience. \nNew Exclusive Pearltec AG PartnershipPearltec AG offers innovative and patented technologies that provide placement, positioning and fixation solutions. Pearltec products are adaptable to the individual patient, optimizing patient comfort. Pearltec cushions feature soft and moveable polystyrene pearls combined with adjustable air chambers to reduce the amount of patient movement. \n\"CIVCO Medical Solutions is honored to partner with Sentient and Pearltec AG to improve patient care,\" said Nat Geissel , Senior Vice President and General Manager, Radiation Oncology. \"CIVCO is committed to positively impacting patient care by offering integrated solutions that increase patient comfort and satisfaction and these partnerships strengthen that commitment.\" \nNew C-Qual M™ Breastboard Featuring the Monarch™ Overhead Arm Positioner This enhanced breastboard is indexable for efficient, accurate setups and features a newly designed bottom stop and optional Pearltec lumbar cushion to comfortably support patient position. The new Monarch Overhead Arm Positioner is designed to match body contours for optimal arm support and includes dual function hand grips allowing for enhanced wrist comfort and increased positioning options. These new innovations are made from image-friendly materials that are optimized for multi-modality use. \nNew Wide Respiratory Plate and Pearltec Cushion for CIVCO's Body Pro-Lok ONE™ Bridge for SBRTThe Body Pro-Lok ONE provides one simple solution for complex SBRT patient setups featuring the ONE Bridge with innovative lateral and tilting offset and variable height adjustment capability. The newly designed Wide Respiratory Plate provides abdominal compression and diffuses pressure across the abdominal region, resulting in a more tolerable compression for the patient. The Pearltec cushion provides an added dimension of customized comfort during compression. The cushion forms to the contours of the patient during inflation, providing an additional level of comfort and contoured pressure between the patient and the respiratory plate. \nThe company's team of motion management experts will demonstrate how these and many other newly released treatment solutions improve patient outcomes, simplify the clinician's workday and improve workflow and efficiency between imaging and treatment. \nAbout CIVCOCIVCO Medical Solutions has over 30 years of experience and offers cutting-edge medical technology to a diverse group of medical professionals. CIVCO's Radiation Oncology (RO) division designs, manufactures and markets comprehensive motion management solutions to improve patient outcomes and increase clinical productivity for head & neck, breast, lung, abdomen, prostate and other treatment sites. RO's products include couchtops and overlays for linear accelerators and imaging systems, advanced patient immobilization solutions, robotic patient positioning, advanced fiducial markers, and immobilization/positioning equipment and consumables. The Multi-Modality Imaging (MMI) unit designs and manufactures accessories for use in diagnostic and therapeutic imaging and interventional procedures, with a strong focus on ultrasound. MMI's products range from infection control products including a wide range of ultrasound and CT covers to device guidance, positioning and electromagnetic needle tracking. CIVCO offers patients and clinicians the newest and best technology available to improve patient care. \nCorporate information is available at www.CIVCO.com . \nFor further information please contact: Shelli Locklear", "external_links": [], "published": "2015-10-15T15:56:00.000+03:00", "crawled": "2015-10-16T04:24:59.781+03:00", "highlightTitle": ""}