{"organizations": ["US Army"], "uuid": "0d9ad8d99f2ebb20ccf208173e07fe5493ac0cd3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ibtimes.co.uk", "main_image": "http://d.ibtimes.co.uk/en/full/1463558/xm25-counter-defilade-engagement-system-smart-grenade.jpg", "site_section": "http://www.ibtimes.co.uk/rss/technology", "section_title": "IBTimes.co.uk : Technology", "url": "http://www.ibtimes.co.uk/us-army-tests-smart-grenade-launcher-that-can-take-out-hidden-targets-500m-away-1523971", "country": "US", "title": "US Army tests smart grenade launcher that can take out hidden targets 500m away", "performance_score": 0, "site": "ibtimes.co.uk", "participants_count": 0, "title_full": "US Army tests smart grenade launcher that can take out hidden targets 500m away", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T17:05:00.000+03:00", "replies_count": 0, "uuid": "0d9ad8d99f2ebb20ccf208173e07fe5493ac0cd3"}, "author": "", "url": "http://www.ibtimes.co.uk/us-army-tests-smart-grenade-launcher-that-can-take-out-hidden-targets-500m-away-1523971", "ord_in_thread": 0, "title": "US Army tests smart grenade launcher that can take out hidden targets 500m away", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mary-Ann Russon"], "text": "By Mary-Ann Russon October 14, 2015 15:05 BST The US Army is carrying out final tests on a small smart grenade launcher that would reduce the need for expensive air strikes and collateral damage Orbital ATK \nThe US Army is to commence final testing of a \"smart\" shoulder-fired weapon in early 2016 that enables soldiers to hit and blow up objects and people hidden beneath cover from a distance of over 500m away. \nThe XM25 Counter Defilade Engagement System is a semi-automatic smart grenade launcher that looks like a large fancy weapon taken from a Call Of Duty or Battlefield video game. It includes a \"target acquisition and fire control system\" – basically a computer – that uses a laser rangefinder to calculate distances and figure out where the best place to aim is. \nDeveloped by Orbital Sciences subsidiary Orbital ATK, the weapon weighs 6.4kg and comes with a five-round magazine of 25mm dual-warhead grenades that shoots at low velocity with a flat trajectory. The grenade does not have to hit anything – it can also detonate in the air in what is known as an airburst over the target to cause damage. Saving money and reducing air strikes \nThe US Army has been testing prototypes of the XM25 since 2009, and an article by the Army News Service from May 2009 states the technology is ahead of its time because it is the \"first smart weapon system with a smart round in small weapons\". \n\"The way a Soldier operates this is you basically find your target, then laze to it, which gives the range, then you get an adjusted aim point, adjust fire and pull the trigger. Say you've lazed out to 543m. When you pull the trigger it arms the round and fires it 543m plus or minus a one-, two- or three-meter increment, then it explodes over the target,\" Richard Audette, deputy programme manager for Soldier weapons said in the 2009 article. \n\"For example, in Iraq we had many instances where there was a sniper firing from a rooftop and you have a squad trying to engage that target, but the soldiers couldn't get to him with the weapons they had, so they'd call in the Air Force to drop a joint direct attack munition (JDAM). We can take out the target at $25 per XM round as opposed to a $20,000 to $50,000 JDAM.\" \nAnother article from 2010 states the XM25 makes the centuries-old defensive measure of combatants hiding behind rocks, trees, walls or trenches obsolete, and it also means that soldiers will no longer need to expose themselves in order to fire on covered targets. No more hiding behind rocks and walls \n\"Our soldiers can remain covered/protected and use their XM25 to neutralise an enemy in his covered position. This will significantly reduce the risk of US casualties and change the way we fight,\" Lt Col Chris Lehner, product manager for Individual Weapons, wrote in PEO Soldier . \n\"Finally, the system is less expensive, more precise, quicker to deploy, and causes less collateral damage than mortars, artillery or air strikes. This makes the weapon especially valuable in Afghanistan where protecting the lives and property of the civilian population is critical while defeating the insurgency.\" \nOrbital ATK says the XM25 is able to accurately hit a \"point target\" at 500m, while it can hit targets using airbursts at a distance of up to 700m. At the moment, the grenades being developed are primarily training ammunition and high explosive air bursting ammunition, but in the future, the firm plans to create grenades that can breach doors, pierce armour and are less than lethal when they hit targets or used in a targeted airburst. More about military technology", "external_links": [], "published": "2015-10-14T17:05:00.000+03:00", "crawled": "2015-10-14T17:23:47.848+03:00", "highlightTitle": ""}