{"organizations": ["Pepsi", "Major League Baseball", "Facebook", "Google for Work"], "uuid": "291f86417175702f2bf6a1b346b56c708a608c52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cio.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/Startup-founded-by-Facebook-s-cofounder-Dustin-Moskovitz-wants-to-kill-long-email-threads/49191592.cms", "site_section": "http://cio.economictimes.indiatimes.com/rss/digital-security", "section_title": "security - Information Technology News, Information and Updates : ETCIO.com", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/startup-founded-by-facebooks-cofounder-dustin-moskovitz-wants-to-kill-long-email-threads/49191592", "country": "IN", "title": "Startup founded by Facebook's cofounder Dustin Moskovitz wants to kill long email threads", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Startup founded by Facebook's cofounder Dustin Moskovitz wants to kill long email threads", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T08:03:00.000+03:00", "replies_count": 0, "uuid": "291f86417175702f2bf6a1b346b56c708a608c52"}, "author": "", "url": "http://cio.economictimes.indiatimes.com/news/digital-security/startup-founded-by-facebooks-cofounder-dustin-moskovitz-wants-to-kill-long-email-threads/49191592", "ord_in_thread": 0, "title": "Startup founded by Facebook's cofounder Dustin Moskovitz wants to kill long email threads", "locations": ["Silicon Valley"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eugene Kim Asana", "Moskovitz", "Dustin Moskovitz", "Peter Thiel", "Chris Farinacci", "Marc Andreessen"], "text": "#asana Startup founded by Facebook's cofounder Dustin Moskovitz wants to kill long email threads Moskovitz was particularly upbeat about the new \"conversation\" feature which lets teams form a conversation around specific work projects or tasks. Business Insider | 02 October 2015, 10:33 AM IST By Eugene Kim Asana, the work tracking app founded by Facebook cofounder Dustin Moskovitz, just made a number of updates on Wednesday at a press event held at its headquarters.The updates are largely split into three categories: a redesigned layout that gives it a more simplified look, a new \"conversation\" feature that lets users leave comments under specific projects, and a new tracking feature that turns Asana into a bigger platform.\"This is the biggest project we've done to date for sure,\" Moskovitz said.Moskovitz was particularly upbeat about the new \"conversation\" feature which lets teams form a conversation around specific work projects or tasks. It basically adds more clarity to who's working on what, and on the progress of the project, without having to go through long, cluttered email threads.\"It's a simplified form of email thread, with enhanced features like being able to control the follower list, tracking work, and status updates,\" Moskovitz said.But Moskovitz made it clear the new updates were not aimed at replacing Slack or any of the messaging apps. \"Conversations is what you'd do in a mailing list, around a particular project or a subject. It's pretty different from a Slack channel,\" he said. \"It's really meant to be an email killer.\"Moskovitz also gave some updated numbers around its business. Currently more than 140,000 companies are using Asana in one way or another, and the company is adding another 10,000 new companies every month. Some of the biggest customers include Major League Baseball, Pepsi, and Verizon.He wouldn't disclose the specific sales figures, but said that its annual recurring revenue is in the \"low tens of millions of dollars,\" with revenue having grown 2.3X since last year. He also said Asana is \"tracking towards profitability,\" suggesting it's not profitable yet.In a sign that it's beefing up its business unit, Asana also hired Chris Farinacci, former senior director of Google for Work, to lead its business operations earlier this week.Asana made a huge splash in the work collaboration space when it first launched in 2009. It's raised over $38 million from some top Silicon Valley tech investors including Peter Thiel and Marc Andreessen.", "external_links": [], "published": "2015-10-02T08:03:00.000+03:00", "crawled": "2015-10-02T12:11:11.465+03:00", "highlightTitle": ""}