{"organizations": [], "uuid": "8c9c7709d8f06c3aaec6b1568bac6bc02cd4338f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.technology.org", "main_image": "http://www.technology.org/texorgwp/wp-content/uploads/2015/10/banana-lectinsm.png", "site_section": "http://feeds.feedburner.com/TechnologyOrg", "section_title": "Technology Org", "url": "http://www.technology.org/2015/10/24/drug-engineered-bananas-fight-many-deadly-viruses-new-results-show-promise/", "country": "", "title": "Could a drug engineered from bananas fight many deadly viruses? New results show promise", "performance_score": 0, "site": "technology.org", "participants_count": 1, "title_full": "Could a drug engineered from bananas fight many deadly viruses? New results show promise", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T14:05:00.000+03:00", "replies_count": 0, "uuid": "8c9c7709d8f06c3aaec6b1568bac6bc02cd4338f"}, "author": "Raminta Šulskutė", "url": "http://www.technology.org/2015/10/24/drug-engineered-bananas-fight-many-deadly-viruses-new-results-show-promise/", "ord_in_thread": 0, "title": "Could a drug engineered from bananas fight many deadly viruses? New results show promise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Could a drug engineered from bananas fight many deadly viruses? New results show promise Posted Today \nA banana a day may not keep the doctor away, but a substance originally found in bananas and carefully edited by scientists could someday fight off a wide range of viruses, new research suggests. Bananas contain a substance that, when changed slightly by scientists, shows promise as an anti-virus drug. \nAnd the process used to create the virus-fighting form may help scientists develop even more drugs, by harnessing the “sugar code” that our cells use to communicate. That code gets hijacked by viruses and other invaders. \nThe new research focuses on a protein called banana lectin, or BanLec, that “reads” the sugars on the outside of both viruses and cells. Five years ago, scientists showed it could keep the virus that causes AIDS from getting into cells – but it also caused side effects that limited its potential use. \nNow, in a new paper published in the journal Cell , an international team of scientists reports how they created a new form of BanLec that still fights viruses in mice, but doesn’t have a property that causes irritation and unwanted inflammation. \nThey succeeded in peeling apart these two functions by carefully studying the molecule in many ways, and pinpointing the tiny part that triggered side effects. Then, they engineered a new version of BanLec, called H84T, by slightly changing the gene that acts as the instruction manual for building it. \nThe result: a form of BanLec that worked against the viruses that cause AIDS, hepatitis C and influenza in tests in tissue and blood samples – without causing inflammation. The researchers also showed that H84T BanLec protected mice from getting infected by flu virus. \n“What we’ve done is exciting because there is potential for BanLec to develop into a broad spectrum antiviral agent, something that is not clinically available to physicians and patients right now,” says David Markovitz, M.D., co-senior author of the new paper and a professor of internal medicine at the University of Michigan Medical School. “But it’s also exciting to have created it by engineering a lectin molecule for the first time, by understanding and then targeting the structure.” \nA global project tackles a global problem \nThe 26 scientists on the team – from Germany, Ireland, Canada, Belgium and the United States – worked together over several years to figure out exactly how BanLec worked against viruses, and then to build a better version. They were funded by the U.S. and European governments, and by foundations. \nThey used a wide range of scientific tools – including X-ray techniques used by the U-M Center for Structural Biology that let them figure out the location of every atom in the original and new forms of BanLec. \nTheir efforts helped them understand how BanLec connects to both viruses and to sugar molecules on the outside of cells, and how it leads to irritation and other side effects by triggering signals that call in the “first responders” of the body’s immune system. \nThis understanding is what allowed them to change the gene in a way that fine-tuned the BanLec molecule. The new one still kept viruses out of cells, but doesn’t have the property that triggers the immune system response. \nThe new version of BanLec has one less tiny spot on its surface for sugars to attach, called a “Greek key” site. This makes it impossible for sugars on the surface of immune system cells called T cells to attach in multiple spots at once and trigger inflammation. But it still allows BanLec to grab on to sugars on the surface of viruses and keep them from getting into cells. \nSeveral years of research still lie ahead before BanLec can be tested in humans. But Markovitz and his co-senior author Hashim M. Al-Hashimi, Ph.D., professor of biochemistry at Duke University and formerly professor of chemistry and biophysics at U-M, hope that their team’s work can help address the lack of antiviral drugs that work well against many viruses or against viruses that change rapidly, such as influenza. \n“Better flu treatments are desperately needed,” says Markovitz, who treats patients with infectious diseases at the U-M Health System. “Tamiflu is only modestly effective, especially in critically ill patients, and influenza can develop resistance to it. But we also hope that BanLec could become useful in situations such as emergency pandemic response, and military settings, where the precise cause of an infection is unknown but a viral cause is suspected.” \nThe team continues to test H84T BanLec against other viruses in mice and tissue samples. Cracking the sugar code \nEven while work on H84T BanLec continues, the team’s achievement in engineering a lectin molecule opens doors to other work on other lectins. Lectin molecules read the sugar code of sugar molecules that cover the surface of many viruses and cells. \nScientists still don’t fully understand all the things that the sugar code controls – but suspect it may be almost as powerful for controlling how our cells work as the DNA code inside cells. Sugars, and the lectins that attach to them, seem to play a key role in how cells “talk” to one another, call for help, and perform other functions. \nIn fact, one of the mysteries remaining for BanLec work is just how the T cells of the immune system actually attach to it. Hans-Joachim Gabius, Ph.D., the leader of the German part of the team, is working to explore this further, and to use this newly-engineered tool to look at other aspects of the sugar code. \nMarkovitz also notes that U-M professor emeritus Irwin Goldstein, Ph.D., a co-author on the new paper, was a key pioneer in sugar code work, or glycobiology. His work and that of others paved the way for innovations that harness the sugar code in new ways to fight disease. \nThe University of Michigan has intellectual property related to BanLec, and is actively working to bring the technology to market. The study’s co-lead authors, Michael Swanson, Ph.D., and Daniel Boudreaux, Ph.D., worked in Markovitz’s and Al-Hashimi’s laboratories as doctoral student and postdoctoral fellow, respectively. \nAn important part of the work to decode the structure of the BanLec molecules was done by Jeanne Stuckey, Ph.D. and Jennifer Meagher, Ph.D. of the Center for Structural Biology at the U-M Life Sciences Institute, using the Advanced Photon Source synchrotron at Argonne National Laboratory and funding in part from the Michigan Economic Development Corporation. The BanLec crystal structure has been deposited in the Protein Data Bank (3RFP). \nFunding for the work included National Institutes of Health grants to U-M CA144043, AI096138, AI073146, and AI50410, as well as other grants held by collaborating researchers.", "external_links": [], "published": "2015-10-24T14:05:00.000+03:00", "crawled": "2015-10-24T14:51:19.484+03:00", "highlightTitle": ""}