{"organizations": [], "uuid": "6b27cad6510d4e9d0af4eae03657d373654747ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/2015/developingna.jpg", "site_section": "http://www.physorg.com/rss/rssbycategory.php?categ=16", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-climate-regroup-rocky-key.html", "country": "US", "title": "Climate negotiators regroup after rocky start to key talks", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Climate negotiators regroup after rocky start to key talks", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T12:32:00.000+03:00", "replies_count": 0, "uuid": "6b27cad6510d4e9d0af4eae03657d373654747ae"}, "author": "", "url": "http://phys.org/news/2015-10-climate-regroup-rocky-key.html", "ord_in_thread": 0, "title": "Climate negotiators regroup after rocky start to key talks", "locations": ["Paris"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mariette Le Roux"], "text": "Climate negotiators regroup after rocky start to key talks October 20, 2015 by Mariette Le Roux Developing nations are balking at the latest draft of a global climate agreement to be inked in Paris in December, negotiators and experts say \nDiplomats crafting a global climate pact will on Tuesday try to bounce back from an acrimonious start to the final negotiating session before a UN summit to seal the ambitious deal. \nThere were heated moments as the talks opened on Monday when developing nations accused rich ones of sidelining their interests, even as UN chief Ban Ki-moon warned: \"We don't have any 'plan B' because we don't have any 'planet B'.\" \nThe five-day meeting in the German city of Bonn must craft a workable blueprint for the climate rescue pact to be signed at the November 30-December 11 summit in Paris, meant to crown more than two decades of fraught negotiations. \nIt must serve as a working document for ministers and heads of state who need to take the tough political decisions needed for the agreement to take shape. \nBut instead of getting down to line-by-line bartering on Monday, the crucial first day of the 195-nation talks was spent rehashing well-rehearsed divides between rich and developing nations, with Ban describing the process as \"frustrating\". \nThe vast G77 developing nation bloc, led by South Africa, complained of \"apartheid\" treatment at the hands of rich nations, saying their core demands had been summarily excised from the draft. Greenhouse gas emissions reduction targets \nThe document had been slimmed down from 80 pages to 20 by two diplomats guiding the process. \nBut the 130-plus G77 group of countries, which include China and India, insisted on reinserting dropped phrases on finance and fairness, a process which took the whole day and grew the text back again to 34 pages. \nIn Paris, French President Francois Hollande cautioned against an empty deal coming out of the forthcoming summit, saying countries' actions will have to be reviewed \"regularly\" to make sure progress is being made. \n\"There will be a deal in Paris. The question is at what level the agreement will be reached,\" he said. \nA key pillar of the pact will be a list of national pledges to cut greenhouse gas emissions to limit global warming to two degrees Celsius (3.6 degrees Fahrenheit) over pre-Industrial Revolution levels. \n'The whole world is looking' Rich nations have pledged to mobilise $100 billion per year from 2020 to help vulnerable countries cope with the impacts of global warming and reduce greenhouse gases \nScientists warn that pledges submitted by more than 150 nations so far place Earth on course for warming closer to 3 C—a world of dangerous rises in sea levels, superstorms and the spread of disease. \nA key disagreement at the talks concerns a mechanism to regularly review and ramp up countries' actions so that the 2 C goal is achieved. \nAnother cause for dispute is developing countries' demand for money to finance a shift to less carbon-polluting economies, and to shore up their defences against the impact of climate change. \nThe Paris pact, due to take effect in 2020, will be the first climate agreement to include all the world's nations. \n\"The whole world is looking at us,\" Peruvian Environment Minister Manuel Bulgar Vidal told negotiators on Monday.", "external_links": [], "published": "2015-10-20T12:32:00.000+03:00", "crawled": "2015-10-20T13:07:52.108+03:00", "highlightTitle": ""}