{"organizations": [], "uuid": "b09140678bcb9ff50789d9ce3112b17b2fcc1a3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonexaminer.com", "main_image": "http://cdn.washingtonexaminer.biz/cache/r620-89737ca72c5d90b2265d3cc8c92a9645.jpg", "site_section": "http://washingtonexaminer.com/rss/technology", "section_title": "WashingtonExaminer.com RSS - technology", "url": "http://www.washingtonexaminer.com/report-sheds-light-on-why-euro-companies-get-hacked/article/2574144?custom_click=rss", "country": "US", "title": "Report sheds light on why Euro companies get hacked", "performance_score": 0, "site": "washingtonexaminer.com", "participants_count": 1, "title_full": "Report sheds light on why Euro companies get hacked | Washington Examiner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T20:56:00.000+03:00", "replies_count": 0, "uuid": "b09140678bcb9ff50789d9ce3112b17b2fcc1a3f"}, "author": "Rudy Takala", "url": "http://www.washingtonexaminer.com/report-sheds-light-on-why-euro-companies-get-hacked/article/2574144?custom_click=rss", "ord_in_thread": 0, "title": "Report sheds light on why Euro companies get hacked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new survey finds that a large number of European companies haven't planned for cyberattacks, which may shed some light on why so many are getting hacked.\nJust one-quarter of companies surveyed said they have a \"clear understanding\" of their \"exposure to cyberrisk,\" according to the European Cyber Risk Survey released this month by insurance company Marsh, which collected the data \"from risk professionals from large and medium-size corporations from across the continent.\"\n\"Organizations across Europe are growing increasingly concerned about the likelihood and impact of cyberattacks,\" the report states, but they aren't sure what to do about it. Just 36 percent of respondents said they have a response planned for the event of an attack, while 22 percent said they had no plan and 17 percent had no idea. The remainder reported having \"partial\" plans.\nRelated Story: http://www.washingtonexaminer.com/article/2574118/ Sally Roberts, director of media relations for Marsh in the U.S., said the survey included 706 participants, mainly risk managers, across Europe.\nMore from the Washington Examiner Carson on Holocaust comments: 'Never intended' to 'diminish' tragedy Ben Carson responded to criticism of his recent comments about the Holocaust and guns.\nBy Al Weaver • 10/14/15 5:49 PM The figures could explain why companies suffer from so many many high-profile breaches, one of which was referenced by the report. The U.S.-based Target, the report notes, had its systems penetrated in 2013 when hackers managed to obtain credentials from a third-party HVAC contractor that had an IT link with the company.\nEuropean companies could learn from that story, the report authors suggested, and go to greater lengths to ensure that those they work with have appropriate cybersecurity measures in place. The survey found that 77 percent of respondents still did not assess the cybersecurity practices of their suppliers or customers, and 67 percent were not asked to demonstrate their own practices by anyone else, including their banks.\nConsequently, the authors predicted, third-party-enabled breaches \"will only rise in frequency until organizations place greater focus on setting out the basic technical controls that all suppliers/contractors should have in place.\"\nThe companies that are unable to articulate their security situation, Marsh noted, are \"in a poor position to approach the insurance market.\" As a result, only 12 percent of companies reported having cyberattack coverage, and only 33 percent have alternative funding in place in the event their financials are compromised by hackers.\nA separate study published by the Ponemon Institute and Hewlett-Packard suggests that the cost of cybercrime, at least for U.S. companies, has risen by 82 percent since 2009, reaching an average cost of $15.4 million per incident for large companies in 2015.\nAlso from the Washington Examiner The companies collecting $370B in student loan debt don't help students The report casts private servicers like Navient, Genesis Lending and Wells Fargo in a negative light.\nBy Joseph Lawler • 10/14/15 6:07 PM Top  ", "external_links": [], "published": "2015-10-14T20:56:00.000+03:00", "crawled": "2015-10-15T01:18:22.849+03:00", "highlightTitle": ""}