{"organizations": ["Microsoft", "CTO"], "uuid": "b5967fab0145e0a5e4ecaa80b43e6d0a5874175f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.globalbx.com", "main_image": "", "site_section": "http://www.globalbx.com/rss/US/byIndustry/Technology.rss", "section_title": "Technology - Internet Related Businesses For Sale in the US", "url": "http://www.globalbx.com/listing.asp?bId=249104", "country": "US", "title": "Microsoft And Other Custom Software Developer", "performance_score": 0, "site": "globalbx.com", "participants_count": 0, "title_full": "Microsoft And Other Custom Software Developer", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:30:00.000+03:00", "replies_count": 0, "uuid": "b5967fab0145e0a5e4ecaa80b43e6d0a5874175f"}, "author": "", "url": "http://www.globalbx.com/listing.asp?bId=249104", "ord_in_thread": 0, "title": "Microsoft And Other Custom Software Developer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Summary Very Profitable and Growing ! This company is the #1 source for professional IT Services. They develop custom business applications specializing in web and mobile technologies on multiple platforms. They have been providing business software solutions for over 24 years. Under great leadership, this IT company has continued to grow and prosper in a challenging industry. They are very proud of their record of delivering high-quality software to their clients' on-time and on budget. The company provides a wide variety of IT services to their clients. Not only do they offer outsourcing and custom programming, but they also offer virtual CIO and CTO services. These services allow the company to gain a better understanding of their clients' needs, putting them in an ideal position to grow that client by upselling that client to more services. The client pays for these services with an agreed-upon monthly budget. This gives them a great source of recurring revenue. The company provides professional guidance in the form of on-going mentoring and training. Unlike other training companies, they approach their training as ''Professional Development''. This means their goal is to assess the client's programmers first, then develop a curriculum that best suits the students and the goals of what the client is trying to achieve. They then follow up the training with on-going mentoring to ensure that the client's employees are using the skills they learned in their day-to-day operation. The on-going mentoring services are a great source of recurring revenue. The company offers key productivity improvement products for the IT professional. These products give them a great source of revenue to help them offset any bench-time. When the developers are not billable, the company has them work on the proprietary products to give them more value and to provide the company with more revenue downstream. In this way the developers are always billable. Don't miss this opportunit", "external_links": [], "published": "2015-10-14T08:30:00.000+03:00", "crawled": "2015-10-14T09:43:24.098+03:00", "highlightTitle": ""}