{"organizations": ["AP"], "uuid": "65426b1b8595c33626e13f42e6972b8057260e38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hamodia.com", "main_image": "", "site_section": "http://hamodia.com/category/technology/", "section_title": "Technology Archives - Hamodia", "url": "http://hamodia.com/2015/10/22/u-s-home-sales-rebound-in-september-after-august-slump/", "country": "US", "title": "U.S. Home Sales Rebound in September After August Slump", "performance_score": 0, "site": "hamodia.com", "participants_count": 0, "title_full": "U.S. Home Sales Rebound in September After August Slump - Hamodia", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "65426b1b8595c33626e13f42e6972b8057260e38"}, "author": "", "url": "http://hamodia.com/2015/10/22/u-s-home-sales-rebound-in-september-after-august-slump/", "ord_in_thread": 0, "title": "U.S. Home Sales Rebound in September After August Slump", "locations": ["U.S.", "WASHINGTON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) - Americans snapped up more homes in September, suggesting that the U.S. housing sector remains insulated from global economic turmoil.\nThe National Association of Realtors said Thursday that sales of existing homes jumped 4.7 percent last month to a seasonally adjusted annual rate of 5.55 million. Buying activity rebounded after slipping in August, indicating that demand for housing continues despite a series of recent economic hits: stock market declines, a slowdown in China, struggles in emerging nations such as Brazil and Turkey, and stagnation in Europe.\nThe real estate market appears to have reached a stable plateau in recent months, aided by mortgage rates near historic lows and steady job gains. Yet first-time buyers remain scarce and relatively few properties are being listed for sale, capping the potential growth of the sector.\nSales have advanced 8.8 percent over the past 12 months, while the number of listings has declined 3.1 percent. The housing market contains 4.8 months’ supply of homes, significantly lower than the 6 months associated with a healthy market.\nTight inventories have fueled rising home values. The median home sales price was $221,900 in September, a 6.1 percent annual increase.\nThe rising prices have created affordability pressures that could cap sales growth. Prices have increased at nearly three times the annual 2.2 percent increase in hourly average earnings.\nAll four geographic regions — Northeast, Midwest, South and West — experienced higher sales last month on a seasonally adjusted basis.\nYet first-time buyers are largely missing from the market.\nOnly 29 percent of sales last month went to first-time buyers, a percentage that continues to be significantly lower than the historical share of 40 percent. The younger millennial generation, ages 18 to 34, suffers from a shortage of down payment savings as they cope with lower starting salaries and high student debt loads.\nA recent survey shows that 20 percent of millennials say they need financial help from their parents to buy a home, compared to just 8 percent of the older baby boomer generation who needed parental assistance, according to the finance company Credit Karma.", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-23T02:27:39.230+03:00", "highlightTitle": ""}