{"organizations": [], "uuid": "41a21313f2ada47b260f99e88b686415e6a169b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mirror.co.uk", "main_image": "http://i4.mirror.co.uk/incoming/article6649972.ece/ALTERNATES/s1200/Back-to-the-Future-II.jpg", "site_section": "http://www.mirror.co.uk/news/technology-science/technology/rss.xml", "section_title": "mirror - Technology", "url": "http://www.mirror.co.uk/tv/tv-news/back-future-ii-top-10-6651722", "country": "IE", "title": "Back to the Future II: Top 10 inventions that we really use in 2015", "performance_score": 0, "site": "mirror.co.uk", "participants_count": 1, "title_full": "Back to the Future II: Top 10 inventions that we really use in 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:57:00.000+03:00", "replies_count": 0, "uuid": "41a21313f2ada47b260f99e88b686415e6a169b6"}, "author": "Patrick Hill", "url": "http://www.mirror.co.uk/tv/tv-news/back-future-ii-top-10-6651722", "ord_in_thread": 0, "title": "Back to the Future II: Top 10 inventions that we really use in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Watch Next Flat screen wall mounted TVs \nThis was a pretty bold prediction back in the 1980s when TVs still had bulky backs and took up a large amount of space and Marty couldn’t believe his eyes when he saw them in the film. \nFlatscreen TV \nThey are now commonplace in most British homes, with old style tubed TVs now virtually a thing of the past. Tablets \nIn the movie, Doc Brown was seen walking around holding a tablet style computer. \nTablets are now common place in 2015. More than 100 million Apple iPad’s were sold following its release in April 2010 and mid-October 2012. \nMarty McFly with Biff and a tablet Video conferencing \nAn older Marty McFly speaks to Douglas J Needles and his supervisor Ito Fujitsu using live video conferencing on a giant TV. \nIt looked like a far flung fantasy in the 1980s. \nVideo conferencing \nBut from FaceTime to Skype, it is now an everyday technology that most people have in their own homes and can use to speak to anyone in the world. Facial recognition \nDoc Brown’s futuristic style binoculars were able to use facial recognition technlogy to track their subject and appeared ridiculous at the time. \nHowever, facial recognition software is now available on the iPhone and on most digital cameras. Facial recognition Fingerprint recognition \nIn the film a payment can be made just by the touch of a fingerprint. It is also used to open doors. \nFinger print recognition \nThis is now possible, with Apple’s latest products and the Samsung Galaxy S5 among other technology, showing how convenient fingerprint recognition is. \nThumb print security systems also now exist. Online banking \nWhen an older Marty places a bet online, he does so by putting his his bank card into a reader at home. \nIn 2015, the public can use online banking and PayPal to transfer cash using an at home card reader, similar to that used in the movie. \nOnline banking 3D movies \nMarty is left stunned when he spots a 3D advert for movie Jaws 19. \nBut although, we’ve never got as far as that many Jaws sequels, 3D movies do now exist and many people now even have the technology on their TVs at home. \n3D movies \n3D movie blockbusters include Avatar and Jurassic World. Motion controlled video games \nIn the movie, two young boys mock Marty for playing a video game which needs him to use his hands, describing it as being “like a baby’s toy”. \nEven though we do still use controllers for most games, some are motion-activated. \nMotion detection video games \nMicrosoft Kinect, an added system used to connect to an Xbox, allows gamers to play games using their own motions, rather than a control pad.", "external_links": [], "published": "2015-10-20T10:57:00.000+03:00", "crawled": "2015-10-20T12:06:40.930+03:00", "highlightTitle": ""}