{"organizations": [], "uuid": "618af4791edb6d46a95945a8091dcbb3789a89e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/02/05/13041332/ConnectedWorld-1311106639.jpg", "site_section": "http://www.prweb.com/rss2/techindustrial.xml", "section_title": "Technology: Industrial", "url": "http://www.prweb.com/releases/2015/10/prweb13041332.htm", "country": "US", "title": "DataOnline Holds Strong on", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "DataOnline Holds Strong on the 2016 CW 100", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "618af4791edb6d46a95945a8091dcbb3789a89e2"}, "author": "Laura Black", "url": "http://www.prweb.com/releases/2015/10/prweb13041332.htm", "ord_in_thread": 0, "title": "DataOnline Holds Strong on", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In the tech world, building something from the ground up is difficult. Doing it year after year is even more difficult, but DataOnline has shown it is not only possible, but necessary. thrilled to celebrate DataOnline, http://www.dataonline.com , and its commitment to the IoT (Internet of Things) world for more than 25 years with its ninth consecutive appearance on the 2016 CW 100, moving up to 55 on this year’s diverse list of technological achievers.\nWhat started as a small company between cofounders Martin Adams and Rob Barnacle, has turned into a global company providing quality M2M solutions all across the world. The company has transformed several times throughout its staggering run, becoming a smarter company for it. A resurgence in the company since 2000 has showed no signs of slowing down and set the stage for what is capable in M2M technology.\nPeggy Smedley, editorial magazine singled out the company for its longevity and progression throughout the years. “The CW 100 is built to recognize and applaud companies like DataOnline that have been at the forefront of M2M/IoT throughout some of the industry’s most formative years. DataOnline is an established name and brand that just keeps striving to up its game to bring more value to its customers. That’s a respectable business model and one more companies should emulate.”\nDataOnline is being acknowledged for its innovative thinking in the world of M2M and what many are calling IoT. This past year, its rigorous team has introduced a platform, DOLV3, for fortune 500 companies to trace data and assets in industrial gas, new energy, chemical product, water and waste for increased management and analytics. The company has been creative in its approach by seeking out smaller markets with fewer assets and has been lauded for an increased attention to quality and customer service.\n“DataOnline is continuing to grow globally and is more excited than ever about the industrial M2M space. In 2015 our end-to-end M2M solutions for fixed and mobile industrial assets have seen particular growth in the global LNG marketplace. We are also seeing that our solutions for PLC data access have allowed the industrial shop floor to leverage DOLV3, DataOnline’s fully redundant, high availability, global platform delivering connected information for any industrial machine,” says Robert Barnacle, cofounder and president, DataOnline.\nHe adds, “DataOnline is now crossing the boundary between the remote industrial asset and industrial automation. Machine operators, who are used to a traditional SCADA environment, can now realize the added value in collecting machine data in a central cloud based platform in order to manage, analyze and optimize their asset population.”\n ", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2Nvbm5lY3RlZHdvcmxkLmNvbQ==", "http://t2823608.omkt.co/track.aspx?id=402|2B15B8|7367|0|659|0|2738|1|67F9BE56&destination=http%3a%2f%2fwww.dataonline.com&dchk=51F62995", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2Nvbm5lY3RlZHdvcmxkLmNvbS9saXN0cy9jdzEwMC93YWl0LXRoZXJlcy1tb3JlLw==", "http://t2823608.omkt.co/track.aspx?id=402|2B15B8|7367|0|659|0|273A|1|67F9BE56&destination=http%3a%2f%2fconnectedworld.com&dchk=606F744", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kYXRhb25saW5lLmNvbQ==", "http://t2823608.omkt.co/track.aspx?id=402|2B15B8|7367|0|659|0|2739|1|67F9BE56&destination=http%3a%2f%2fconnectedworld.com%2flists%2fcw100%2fwait-theres-more%2f&dchk=7EEDEF08", "http://connectedworld.com/lists/cw100/wait-theres-more/"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T10:07:37.985+02:00", "highlightTitle": ""}