{"organizations": [], "uuid": "1fae7fa35ce445ceaab907c60ccfc72aaff807e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://www.freshnews.com/news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1135706/clickpay-completes-series-b-financing-at-nearly-double-digit-multiple-price-series-a", "country": "US", "title": "ClickPay Completes Series B Financing At a Nearly Double-Digit Multiple of the Price of the Series A", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "ClickPay Completes Series B Financing At a Nearly Double-Digit Multiple of the Price of the Series A", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T18:19:00.000+03:00", "replies_count": 0, "uuid": "1fae7fa35ce445ceaab907c60ccfc72aaff807e3"}, "author": "admin", "url": "http://www.freshnews.com/news/1135706/clickpay-completes-series-b-financing-at-nearly-double-digit-multiple-price-series-a", "ord_in_thread": 0, "title": "ClickPay Completes Series B Financing At a Nearly Double-Digit Multiple of the Price of the Series A", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/2/2015 @ 8:19 AM   ClickPay \nNEW YORK, Oct. 2, 2015 /PRNewswire/ -- ClickPay, a leader in SaaS billing and payment software for the multi-family and commercial real estate industries, has completed a Series B financing. The proceeds of the financing will be used to support and accelerate the company's rapid growth, pursue potential acquisition targets, continue to invest in the product, physical and technical security infrastructure, and expand the team. ClickPay is currently processing billions of dollars of payments for clients, who represent millions of multi-family residential units across the country. \n\"Although we received a high degree of interest from numerous strategic and financial parties, we ultimately selected Thayer Street Partners, which was an existing investor in ClickPay, to provide the additional capital because of our positive experience with them to date. Thayer Street has consistently leveraged its unique network within the real estate and real estate services community and its general small business back-office software expertise to help ClickPay since its initial investment,\" said Steven Van Praagh, ClickPay president and chief operating officer. Van Praagh added, \"The additional capital will be used to expand into new markets, to innovate on the product, and ultimately deliver on our vision to shape the future of real estate payments.\" \nJosh Koplewicz, the managing partner of Thayer Street Partners, stated, \"ClickPay continues to exceed our original expectations, and we are excited to support its rapid growth.\" Koplewicz added, \"The management team's solution-oriented approach toward serving sophisticated customers continues to impress us, and we remain positive on technology-enabled innovation in real estate services, particularly as it relates to payments.\" \nA primary factor in ClickPay's rapid growth is the success of its new and existing partnerships with the largest national property management companies that are leading their own industry with best-of-breed technology. Going forward, ClickPay is planning to explore international opportunities as well. \nAbout ClickPay, a Division of NovelPay, LLC As the leading provider of innovative billing and payment solutions for the multi-family and commercial real estate industry, ClickPay offers fully integrated billing, payment processing and software services to accelerate the financial performance of its customers by reducing operating costs, creating operational efficiencies, and boosting resident satisfaction. These services provide property owners and managers with a customizable, electronic solution to bill and collect from their residents including online payments, lockbox, on-site check scanning, paper statements and e-billing. ClickPay accepts all payment methods including e-check (ACH), paper check, debit and credit card, and American Express. Utilizing years of collective experience in the real estate, electronic payment, and technology sectors, ClickPay has developed a comprehensive suite of services focused on real estate technology and financial performance. For more information about ClickPay, visit http://www.clickpay.com . \nAbout Thayer Street Partners Based in New York City, Thayer Street Partners invests private growth capital into a select group of business and financial services companies that typically are technology enabled and that exhibit attractive risk-adjusted return characteristics. Thayer Street helps companies grow by combining industry expertise with traditional or customized investment structures. In addition, Thayer Street's core team, operating partners, and highly experienced advisors can provide on-going strategic, tactical, and operational support to portfolio companies. Thayer Street's typical initial investment size is $5-$50M per opportunity. www.ThayerStreet.com . \nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/clickpay-completes-series-b-financing-at-a-nearly-double-digit-multiple-of-the-price-of-the-series-a-300153394.html \nSOURCE ClickPay", "external_links": [], "published": "2015-10-02T18:19:00.000+03:00", "crawled": "2015-10-02T22:08:17.330+03:00", "highlightTitle": ""}