{"organizations": [], "uuid": "bb21121b796104737ee0667585819d12fdb41ac0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sfgate.com", "main_image": "http://www.sfgate.com/img/pages/article/opengraph_default.png", "site_section": "http://sfgate.com//rss/feed/Business-and-Technology-News-448.php", "section_title": "Business and Technology News", "url": "http://www.sfgate.com/business/article/Congress-proposes-giveaways-to-auto-trucking-6582664.php", "country": "US", "title": "Congress proposes giveaways to auto, trucking industries", "performance_score": 0, "site": "sfgate.com", "participants_count": 1, "title_full": "Congress proposes giveaways to auto, trucking industries - SFGate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T17:43:00.000+03:00", "replies_count": 0, "uuid": "bb21121b796104737ee0667585819d12fdb41ac0"}, "author": "sfgate.com", "url": "http://www.sfgate.com/business/article/Congress-proposes-giveaways-to-auto-trucking-6582664.php", "ord_in_thread": 0, "title": "Congress proposes giveaways to auto, trucking industries", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON — At a time of record auto recalls and rising highway deaths, safety advocates say the Republican-run Congress is snubbing their agenda and taking sides with the auto and trucking industries in favor of legislation that could worsen matters.\nA House Energy and Commerce subcommittee held a hearing Wednesday on a GOP draft bill. One provision would require the National Highway Traffic Safety Administration to prepare recall notices in coordination with automakers and prevent the agency from making safety defects public until automakers supply a complete list of identification numbers for all affected vehicles. That would effectively give automakers control over the disclosure and timing of recalls, Mark Rosekind , head of the safety administration, told the hearing.\nThe bill also requires that a majority of the members of safety agency committees developing cybersecurity and technology standards for increasingly computerized and connected vehicles be made up of officials from industries the agency regulates. That could “seriously undermine” the agency’s efforts to ensure safety, Rosekind said. \nThe bill would also give automakers a break on greenhouse gas emissions and fuel economy requirements if they install new safety technology in vehicles, even though the agency has already said that it intends to require some of that technology. Manufacturers would effectively get “a pass on pollution” for “doing things they are already doing,” said Rep. Frank Pallone , D-N.J.\nThe provision is “essentially a congressionally sanctioned defeat device,” he said, referring to hidden software Volkswagen put in its cars to cheat on emissions tests.\nSafety advocates were most critical of what’s not in the bill. For example, there’s no increase in the maximum fine of $35 million per violation that can be levied against automakers who don’t report safety defects or flout recall rules. The administration has recommended the limit be raised to $300 million, and safety advocates called for elimination of any limit.\nThere’s also no increase in money to hire more staff to investigate potential safety defects and oversee automakers, despite testimony that the agency doesn’t have enough people to follow up on safety complaints.\nThe agency “just doesn’t have the capacity to do its job,” said Joan Claybrook , a former safety agency administrator and co-chairwoman of Advocates for Highway and Auto Safety.\nThe bill also doesn’t include provisions long sought by safety advocates to require that rental car agencies and used car dealers repair recalled vehicles before renting or selling them. A transportation bill passed by the Senate in July would require rental car agencies, but not used car dealers, to make the repairs.\nThere was a record 63.7 million vehicles recalled in the U.S. last year, more than double the record set in 2004. So far, 40 million cars and trucks have been recalled this year, putting 2015 on track for the second-most recalled vehicles. Congress has held 10 hearings on auto safety defects over the past two years.\nOn Thursday, the House transportation committee is scheduled to consider a bipartisan bill that would force the government to remove safety ratings of truck and bus companies from a public website and lower the minimum age for interstate truck drivers to 19½.", "external_links": [], "published": "2015-10-21T17:43:00.000+03:00", "crawled": "2015-10-22T02:26:02.200+03:00", "highlightTitle": ""}