{"organizations": [], "uuid": "1e932103503c7ddc896cf9fb63ccd4464ce07e40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thedenverchannel.com", "main_image": "http://sharing.thedenverchannel.com/sharelstv/photo/2015/10/08/Never_Write_an_IOU_Again_Using_These_3_A_3529640000_24960930_ver1.0_640_480.jpg", "site_section": "http://www.thedenverchannel.com/feeds/rssFeed?obfType=RSS_FEED&siteId=100003&categoryId=200101", "section_title": "Technology | 7NEWS", "url": "http://www.thedenverchannel.com/entertainment/the-list/never-write-an-iou-again-using-these-3-apps", "country": "US", "title": "Never write an IOU again using these 3 apps", "performance_score": 0, "site": "thedenverchannel.com", "participants_count": 1, "title_full": "Never write an IOU again using these 3 apps", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T23:51:00.000+03:00", "replies_count": 0, "uuid": "1e932103503c7ddc896cf9fb63ccd4464ce07e40"}, "author": "Jimmy Rhoades", "url": "http://www.thedenverchannel.com/entertainment/the-list/never-write-an-iou-again-using-these-3-apps", "ord_in_thread": 0, "title": "Never write an IOU again using these 3 apps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Previous Next \nWe’ve all been there: You have a meal with friends. Share a cab. Owe your share of the groceries. But you just don’t have the right amount of cash on hand to settle up on the spot. And you don’t want to say, “Hey, I’ll catch you next time.” Uh-uh. Do NOT be that guy or girl. \nHappily, there are a wide array of apps available that allow you to send funds to friends as easily as sending a text or IM. Here’s a starter list, but as with all things financial, READ THE FINE PRINT and decide for yourself. The devil is always in the details. \nThese sites all have some nuts and bolts in common. You’ll have to create an account, and connect a funding source to the service. You can send money to contacts who don’t have the app, but they’ll have to take some action on their end -- some make them sign up for the app, too; others just need them to enter their debit card numbers so the app can complete the deposit into their bank account. You can use the service via the websites, too. And they all allow you to add a comment or note so you know what the payment is for. You should note that the apps don’t have control over bank policies regarding availability of funds, so while the transaction might post immediately, the money might not also be available right away. The List 's Jimmy Rhoades with more... now on The List ! \n#1: VENMO \nVenmo holds funds in a Venmo account, which you can transfer to your bank account at any time; the transaction will post the next business day. A point of emphasis for Venmo is making transactions social – you can share the things you do and buy with your friends in real time. Just split a pizza with Julie! Just took the train downtown! It can be fun, but if you want to be more private about your financial life, you can disable that function. #2: SQUARE CASH \nIn 2010, Square was a game changer, launching their core service that turned mobile devices into credit and debit card readers. Kiosk owners everywhere rejoiced. In 2013, the folks at Square launched Square Cash, which enabled you to basically transfer funds via email. And of course, Square Cash also has an app. They emphasize that the money always goes directly into the recipient’s bank account, often within seconds – with no middle step of funds being “held” within the app. \nMore recently, Square has partnered with SnapChat to make transferring money to friends as easy as sending a Snap, and have introduced CashTags, which are like hashtags for money transfers. Instead of the # symbol, you use the dollar sign ($) followed by a unique ID. #3: FACEBOOK \nThis could be a total game-changer, because of the sheer magnitude of Facebook’s network of friends. In Facebook Messenger, send a message to a contact as usual, and below the text entry field, you’ll see a dollar sign icon. Click on it, enter an amount, and hit send. Bam. You’re done. \nThere are more services. Shop around. Be mindful of fees (READ THE FINE PRINT). And never, ever write an IOU again!  ", "external_links": [], "published": "2015-10-08T23:51:00.000+03:00", "crawled": "2015-10-10T16:17:21.989+03:00", "highlightTitle": ""}