{"organizations": ["LAVAL Quebec Oct.", "Valeant Pharmaceuticals Inter", "Valeant"], "uuid": "849cdfb227b4b555f67b1c2bf25a74012f5d9d34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bio-medicine.org", "main_image": "", "site_section": "http://www.bio-medicine.org/inc/biomed/medicine-technology.asp", "section_title": "Latest Medical Technology from Bio-Medicine.Org", "url": "http://www.bio-medicine.org/medicine-technology-1/Valeant-Provides-Update-Regarding-Government-Inquiries-48943-1/", "country": "US", "title": "Valeant Provides Update Regarding Government Inquiries", "performance_score": 0, "site": "bio-medicine.org", "participants_count": 0, "title_full": "Valeant Provides Update Regarding Government Inquiries", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T16:38:00.000+03:00", "replies_count": 0, "uuid": "849cdfb227b4b555f67b1c2bf25a74012f5d9d34"}, "author": "", "url": "http://www.bio-medicine.org/medicine-technology-1/Valeant-Provides-Update-Regarding-Government-Inquiries-48943-1/", "ord_in_thread": 0, "title": "Valeant Provides Update Regarding Government Inquiries", "locations": ["U.S.", "Valeant"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Navigation Links HOME >> MEDICINE >> TECHNOLOGY Valeant Provides Update Regarding Government Inquiries ... LAVAL Quebec Oct. 14 2015 /-...In addition Valeant recently received a subpoena from the U.S. Attorn... All of us at Valeant firmly believe in maintaining strong regulatory ...About Valeant !-- Paragraph before: Valeant Pharmaceuticals Inter... http://feeds.bio-medicine.org/latest-medical-technology Date:10/14/2015 \nLAVAL, Quebec , Oct. 14, 2015 /PRNewswire/ -- Valeant Pharmaceuticals International, Inc. (NYSE: VRX ) and (TSX: VRX) today responded to a letter from Senator Claire McCaskill (D-MO) concerning the company's products Nitropress and Isuprel. In his response to Senator McCaskill, J. Michael Pearson , the chairman of the board and chief executive officer of Valeant, addressed the history of Nitropress and Isuprel, the reimbursement process for hospital procedures involving Nitropress and Isuprel, the analysis and reasons underlying Valeant's pricing decisions, and Valeant's programs designed to improve patient access, among other topics. The company also disclosed that it is beginning outreach to hospitals where the impact of a price change was significantly greater than the average. \nIn addition, Valeant recently received a subpoena from the U.S. Attorney's Office for the District of Massachusetts and a subpoena from the U.S. Attorney's Office for the Southern District of New York. Most of the materials requested by the subpoenas relate to documents with respect to our patient assistance programs, and also include requests relating to financial support provided by the company for patients, distribution of the company's products, information provided to the Centers for Medicare and Medicaid Services, and pricing decisions. The company is reviewing the subpoenas and intends to cooperate with the investigations. \n\"All of us at Valeant firmly believe in maintaining strong regulatory and financial controls and believe we have operated our business in a fully compliant manner,\" stated Pearson. \"We remain committed to assisting eligible patients who need our products, and we will be working with the appropriate groups to submit the requested documents and plan to cooperate with the inquiries.\" \nAbout Valeant \nValeant Pharmaceuticals International, Inc. (NYSE/TSX:VRX) is a multinational specialty pharmaceutical company that develops, manufactures and markets a broad range of pharmaceutical products primarily in the areas of dermatology, gastrointestinal disorder, eye health, neurology and branded generics. More information about Valeant can be found at www.valeant.com . \nContact Information:", "external_links": [], "published": "2015-10-14T16:38:00.000+03:00", "crawled": "2015-10-15T09:47:47.488+03:00", "highlightTitle": ""}