{"organizations": ["Toyota"], "uuid": "f242c72e7372fac5028cf76315af64923ec976d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.google.com", "main_image": "http://cdn.geekwire.com/wp-content/uploads/2015/10/IMG_9099.jpg", "site_section": "http://news.google.com/news?hl=en&gl=us&q=technology&pws=0&bav=on.2,or.r_gc.r_pw.r_cp.r_qf.&bpcl=38093640&biw=1366&bih=653&um=1&ie=UTF-8&output=rss", "section_title": "technology - Google News", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNFoGHBMIE3-_tyv0eml4zGZZ3kEdw&clid=c3a7d30bb8a4878e06b80cf16b898331&ei=8-YYVvi5M9Xra9SOgugD&url=http://www.geekwire.com/2015/connected-cars-vr-headsets-computer-assisted-driving-technology-is-everywhere-at-the-seattle-international-car-show/", "country": "IL", "title": "Connected cars and VR headsets: Technology is everywhere at the Seattle ... - GeekWire", "performance_score": 0, "site": "google.com", "participants_count": 0, "title_full": "Connected cars and VR headsets: Technology is everywhere at the Seattle ... - GeekWire", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T02:15:00.000+03:00", "replies_count": 0, "uuid": "f242c72e7372fac5028cf76315af64923ec976d4"}, "author": "", "url": "http://news.google.com/news/url?sa=t&fd=R&ct2=us&usg=AFQjCNFoGHBMIE3-_tyv0eml4zGZZ3kEdw&clid=c3a7d30bb8a4878e06b80cf16b898331&ei=8-YYVvi5M9Xra9SOgugD&url=http://www.geekwire.com/2015/connected-cars-vr-headsets-computer-assisted-driving-technology-is-everywhere-at-the-seattle-international-car-show/", "ord_in_thread": 0, "title": "Connected cars and VR headsets: Technology is everywhere at the Seattle ... - GeekWire", "locations": ["Seattle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "October 9, 2015 at 4:13 pm October 9, 2015 at 4:31 pm GeekWire Gala: Early-bird tix on sale now! Toyota’s TeenDrive365 simulator helped educate people on the dangers of distracted driving. \nThere are no self-driving cars on the show floor at the Seattle International Auto Show , but technology is certainly front-and-center at the annual event this year. \nI spent some time at the CenturyLink Event Center this week checking out various company booths and looking to see how technology was featured by the car-makers. \nAlmost every company, from Toyota to Tesla — yes, Elon Musk’s company got an invite from Washington State Auto Dealers Association, the show’s organizer — had something geeky to show off to attendees. \nThe two most prominent technologies revolved around in-car connectivity and computer-powered driver assistance. For example, Chevrolet was adamant about noting that their vehicles had in-car 4G LTE Wi-Fi, along with Apple CarPlay and Android Auto compatibility. \nVolkswagen, which is embroiled in an emissions-rigging software scandal , dedicated space for its “ Car-Net ” technology, which “gives advice, helps you along the way, entertains you, and watches out for you.” It also lets drivers check fuel levels and unlock doors remotely, among other features. \nMazda, meanwhile, showed its “ i-ACTIVESENSE ” technology that uses radars and cameras around the car to automatically recognize potential hazards and avoid collisions. \nFord demoed its newest voice-activated technology, Sync 3 , which lets drivers make calls and change music with their voice. \nBut my favorite booth was Toyota, which let attendees strap on an Oculus virtual reality headset as part of its TeenDrive365 distracted driving simulator. \nAfter hopping in the front seat and strapping on the headset, I was immersed in a virtual car with passengers. Sensors on the steering wheel, brake, and gas detected my driving as I tried to maneuver through city traffic as virtual passengers and a virtual smartphone distracted me. The idea was to show people how dangerous distracted driving can be, and Toyota hopes that “you’ll come away a little wiser about what it takes to be safe behind the wheel.” \nAfter spending time on the show floor, I had a chance to catch up with Charlie Vogelheim , an auto industry vet and host of a weekly Motor Trend podcast , who shared some historical perspective. He said that the focus of these auto shows have shifted from a decade ago, when everyone was talking about safety and quality of cars. Charlie Vogelheim. \n“There isn’t a bad car sold in the U.S. anymore,” Vogelheim said. “Either through regulatory issues or these car companies really trying to do the right thing, they are as safe as they can be within a price range.” \nAbout five years ago, the conversation shifted from safety and quality to fuel mileage. While it’s still an important topic, Vogelheim said that steady gas prices have helped alleviate many concerns about mileage efficiency. \nNow, Vogelheim said attention is moving toward technology. Google’s self-driving car. \n“These cars are surrounded by cameras and sensors now,” he said. “What that has enabled us to do is create the first step toward fully-autonomous vehicles.” \nSelf-driving cars are certainly the talk of the tech world today , with Google and other automakers making steady progress on their own technologies. The impact could be massive, with a recent research paper noting that automated cars could save up to 300,000 lives per decade in the United States. \nVogelheim said he’s impressed with the advances that companies are making with self-driving innovations, whether it’s lane departure warnings or collision avoidance. But while he sees great potential, he also cautioned that issues like inclement weather, poor connectivity, and computer-powered decision-making still need to be worked out before humans can fully rely on self-driving vehicles. \n“There is an infinite number of decisions we make while driving that the self-driving cars still need to learn about,” he said. \nThe Seattle International Auto Show runs through Sunday. Check out a few more photos below. What happens when Geeks Give Back? Bank of America and GeekWire are joining forces to help raise $500,000 for the Washington State Opportunity Scholarship – providing local students interested in STEM with scholarships to fund their higher education goals. Support the next generation of scientists, engineers and mathematicians by clicking here to learn more and give back! Taylor Soper is a GeekWire staff reporter who covers a wide variety of tech assignments, including emerging startups in Seattle and Portland, the sharing economy and the intersection of technology and sports. Follow him @taylor_soper and email taylor@geekwire.com .", "external_links": [], "published": "2015-10-10T02:15:00.000+03:00", "crawled": "2015-10-10T13:23:10.837+03:00", "highlightTitle": ""}