{"organizations": [], "uuid": "4f531e6a823c359677f064f343524cd3a28ce770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/k/7/g/t/9/image.related.articleLeadwide.620x349.gk27up.png/1445386301449.jpg", "site_section": "http://www.canberratimes.com.au/digital-life", "section_title": "Technology | Tech News, Reviews &amp; Updates", "url": "http://www.canberratimes.com.au/technology/sci-tech/predicting-the-future-why-were-always-wrong-20151006-gk27up.html", "country": "AU", "title": "Predicting the future: why we're always wrong", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Predicting the future: why we're always wrong", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:11:00.000+03:00", "replies_count": 0, "uuid": "4f531e6a823c359677f064f343524cd3a28ce770"}, "author": "Drew Turney", "url": "http://www.canberratimes.com.au/technology/sci-tech/predicting-the-future-why-were-always-wrong-20151006-gk27up.html", "ord_in_thread": 0, "title": "Predicting the future: why we're always wrong", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stanley Kubrick imagined the future in 2001: A Space Odyssey , but failed to take risk aversion into account. Photo: MPTV/Metro-Goldwyn-Mayer\nWe all love astoundingly inaccurate predictions about the future, even when they're fake. You've seen the claim attributed to Charles Duell, US Commissioner of Patents ('everything that can be invented has been invented') in a hundred email forwards. Even though there's no evidence Duell said or believed it, we love to think supposedly learned experts get it so wrong.\nThe only famous Quote: about prediction we should remember might be that of veteran screenwriter William Goldman describing Hollywood's efforts to try to make hit movies: \"Nobody knows anything\".\nBut look beyond the listicle-friendly citations (like in 1943 when the IBM chairman said there'd be a market for \"maybe five computers\", or British scientist Lord Kelvin calling heavier-than-air flying machines \"impossible\") and it's worth wondering just why we get the future so wrong.\nFuture by Airbus: Morphing seats can harvest a passenger's body heat to power aircraft systems such as holographic pop-up pods.\nPart of the problem is that we have a tendency to perceive human progress as a kind of force of nature, inexorably rolling onward. We think transport will go from walking to horseback, then to the car and then the rocket sled in a process akin to biological evolution.\nAdvertisement In fact, since the Industrial Revolution, progress has been more closely tied to politics and economics than any other factors. Microsoft co-founder and former chief executive Steve Ballmer's 2007 assertion that \"there's no chance that the iPhone is going to get any significant market share\" is certainly funny now, but Ballmer had a vested interest – his job was to try to bring such a future about.\nNowhere was the idea of progress-as-natural-law so accepted than in the heady postwar period, with mass consumerism and the space race propelling us to headier heights of mechanisation and comfort than ever before.\nCommercial jet airliners flew at about 900 kilometres per hour in 1950. The breaking of the sound barrier just a few years earlier had captured the public imagination, and it was easy to think that by the end of the 20th century we'd fly between Sydney and Perth in half an hour instead of five hours, (complete with skin tight silver outfits).\nInstead, while getting a plane to fly faster isn't especially hard, the economics of ticket revenue versus fuel costs don't favour it. After 65 years of mass-market plane travel all that's really changed is that the TV is in the seat in front of you instead of the ceiling.\nBut casual futurists weren't the only ones to get 2015 air travel all wrong years ago. An unnamed Boeing engineer supposedly said of the company's twin engine, 10-passenger 247 model, introduced in May 1933: \"There will never be a bigger plane built\".\nAnother problem with predicting the future is that we're never quite prepared for tectonic shifts such as the wheel or the computer that upend the world so completely. We once assumed horseshoes, swords and the manual plough would gradually improve without any idea that the car, machine gun or mechanised harvester would one day exist.\nTake the Internet. The great sci-fi novels of the 20th century set a century hence were – however prescient in other areas – quite incomplete if they didn't take the information revolution into account.\nDigital technology is also quite invisible. Even though it so often looks like things haven't changed (like flight since the 50s), the world is completely different under the surface.\nEven though we still sit in pressurised aluminium tubes hurtling through the air at 900 kilometres per hour decades later, we used to go to a travel agent or airline and hand over cash for a paper ticket that caused a major disaster if we lost it. Today you can do the same thing without leaving your desk and never even touch a piece of paper.\nBecause what's actually changed is the kind of change. After the highly visible engineering marvels of the 20th century, the future is now creeping in via underlying programming that promises to make the existing world work better.\nIn fact, experts were spectacularly wrong about the internet too, even after it arrived. In 1995 the inventor of the Ethernet interface, on which the pre-wireless online world depended, said \"I predict the Internet will soon go spectacularly supernova and in 1996 catastrophically collapse\".\nOf course, laughing at errant futurism is always easy in hindsight when highly successful technologies seem like manifest destiny. They couldn't conceive of a need to travel any faster than a horse-drawn buggy before the car, any more than we can see the need for a personal rocket today (however awesome it would be).\nIn 1903 a bank president tried to convince Henry Ford's lawyer not to invest in Ford's newfangled transport machine because \"the horse is here to stay but the automobile is only a novelty\". Nobody had any idea the car would transform mass transit so successfully.\nThere were undoubtedly similar conversations around videotape formats in the '70s. The smart money was on the better-quality Betamax, but VHS emerged triumphant thanks to arcane, sometimes irrational, market dynamics. Any competing model can win out in the early days of a technology.\nLastly, the societal taste for invention itself also changes. The western world's postwar mood was that we'd forever reach greater heights of speed, automation, convenience and happiness. Holidays on space stations seemed right around the corner during those optimistic days, and as late as the mid-80s an aerospace industry conference was told that 30,000 people per year would pay $25,000 to travel into space by 2000, we'd fly tourists into lunar orbit by 2015, and to the lunar surface by 2035. The 2011 mothballing of NASA's space shuttle fleet made such dreams feel more remote than ever.\nThe drive to spend so much money on adventurism in the 20th century blew away with the dust of the Berlin Wall, and we now live in a world that prioritises financial return over exploration for its own sake, all of it viewed through the lens of obsessive risk aversion.\nAlong with change being the only constant, one thing's for sure – the future isn't what it used to be.", "external_links": [], "published": "2015-10-21T08:11:00.000+03:00", "crawled": "2015-10-22T15:03:22.883+03:00", "highlightTitle": ""}