{"organizations": [], "uuid": "8625c77eec1299c243a60fac4347ca107eac69c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://feeds.reuters.com/reuters/technologysectorNews", "section_title": "Reuters: Technology", "url": "http://www.reuters.com/article/2015/10/14/kenya-tech-canada-idUSL5N1202MJ20151014", "country": "US", "title": "CORRECTED-Geek teams on two continents write poverty-breaking apps for Kenya", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "CORRECTED-Geek teams on two continents write poverty-breaking apps for Kenya | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T14:35:00.000+03:00", "replies_count": 0, "uuid": "8625c77eec1299c243a60fac4347ca107eac69c7"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/14/kenya-tech-canada-idUSL5N1202MJ20151014", "ord_in_thread": 0, "title": "CORRECTED-Geek teams on two continents write poverty-breaking apps for Kenya", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Corrects 'incubator' to 'convener' in paragraph 7)\nBy Katy Migiro\nNAIROBI, Oct 7 (Thomson Reuters Foundation) - Powered by caffeine and adrenalin, hundreds of Kenyan and Canadian geeks will compete over Skype in a 28-hour 'hackathon' to develop apps to improve rural Kenyans' health, farms and access to education.\nHackathons are marathon brainstorming sessions where computer programmers get together to write software.\nThe Nov. 20-22 Poverty Hackathon will be the first international development-focused virtual hackathon - taking place on two continents simultaneously, the organisers say.\n\"While it's not common for hackathons to have virtual teams working together, we think it's a core component of actually making impact,\" said Canadian Danielle Thé, who set up the charity Devs Without Borders in Toronto earlier this year.\n\"While people want to help, our concepts of what the major problems or roadblocks are for individuals in other countries could be very biased,\" said Thé, 26.\nNew technologies brought by outsiders often fail because the donors don't understand the local context, such as whether there are teachers to show children how to use donated laptops or how to protect valuable solar panels from theft.\nDevs Without Borders is partnering with the iHub, the convener for the east African nation's blossoming technology community, to ensure the geeks don't make this mistake.\n\"It's about understanding who is going to use the application and the exact scenario in which they will use it,\" said John Paul Karijo, iHub's community manager. \"You have to think... about... the human being at the centre of the problem.\"\nA panel of judges will choose a winning idea for testing in January by the Toronto-based charity Free the Children, which has education, healthcare and agriculture projects in 18 remote villages in Kenya's Maasai Mara region.\n\"What's really unique about it (the hackathon) is it's specifically going to be developing SMS app technology,\" said Toronto-based Sarah MacIndoe, Free The Children's director of international programmes.\nThe focus on implementation is what attracted iHub. \"In the past we've had experiences where solutions from hackathons just remain hackathon solutions,\" said Karijo.\n\"They don't get applied anywhere.\"\nGROWING MARKET IN DEVELOPING WORLD\n'Hackathon' teams will work together writing code for apps that could provide information on maternal health and first aid, or encourage families to send their daughters to school.\nMost Kenyan families are off the grid but have simple mobile phones which they charge for a small fee in nearby kiosks.\nMultinationals are waking up to potential markets in the developing world and trying to boost their internet usage.\nFacebook's internet.org, recently renamed Free Basics, partners with local mobile phone providers to give users free access to online services like the encyclopedia Wikipedia, job listings and health information, as well as Facebook.\nThe project, launched in Zambia in 2013 and extended to more than a dozen other countries, has brought more than 9 million people online, Facebook says.\nGoogle is spending millions of dollars on satellites, high-altitude balloons and drones to extend internet access to an estimated 4.5 billion unwired people around the world.\n\"There is really a space for developers around the world to provide more services for individuals that are going to be on the internet for the first time in the next couple of years,\" said Thé.\n\"We need to connect developers to those opportunities.\"\nKenya is one of the most technologically advanced countries in Africa, known for its pioneering Mpesa mobile money transfer application.\nThe Maasai and Kipsigis people that Free the Children work with in the Maasai Mara are already familiar with SMS-based apps, using them for mobile banking and money transfers, MacIndoe said.\nOne Toronto participant will be Francine Navarro, a 24-year-old software developer who visited Free the Children's projects in Kenya three years ago.\nStartled on that trip by a girl asking if there was female genital mutilation in Canada, Navarro began thinking about the role technology can play in improving women's rights - for example enabling women to blog about injustices they experience.\n\"Technology can become a force for social change,\" she said.\n(Reporting by Katy Migiro, editing by Tim Pearce. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's rights, corruption and climate change. Visit www.trust.org)", "external_links": [], "published": "2015-10-14T14:35:00.000+03:00", "crawled": "2015-10-14T14:11:06.960+03:00", "highlightTitle": ""}