{"organizations": [], "uuid": "7d383f816baadfc530dbc4c37432cc499a5c16ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3244628.1443212897!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_1180/fedelxn-conservatives-20150920.jpg", "site_section": "http://rss.cbc.ca/lineup/technology.xml\r", "section_title": "CBC | Technology News", "url": "http://www.cbc.ca/news/politics/canada-election-2015-social-media-1.3277007?cmp=rss", "country": "IL", "title": "Social media's significance oversold amid election hype", "performance_score": 1, "site": "cbc.ca", "participants_count": 1, "title_full": "Social media's significance oversold amid election hype", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T20:20:00.000+03:00", "replies_count": 0, "uuid": "7d383f816baadfc530dbc4c37432cc499a5c16ba"}, "author": "Ira Basen", "url": "http://www.cbc.ca/news/politics/canada-election-2015-social-media-1.3277007?cmp=rss", "ord_in_thread": 0, "title": "Social media's significance oversold amid election hype", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Analysis Social media's significance oversold amid election hype What's striking about campaigns today is not how much they've changed, but how much they've stayed the same By Ira Basen, CBC News Posted: Oct 18, 2015 1:20 PM ET Last Updated: Oct 18, 2015 3:28 PM ET Justin Trudeau takes a selfie with a supporter in Mount Pearl, N.L., on Sept. 20. The Liberal leader has outpaced his NDP and Conservative rivals on social media during the campaign, which has seen over six million tweets and more than 33 million interactions on Facebook since June 1. But what do those numbers actually mean? (Adrian Wyld/Canadian Press) The promise and perils of digital democracy 27:52 Related Stories Political parties look closer at candidates' social media histories after recent gaffes \nThe ballots have not yet been cast in campaign 2015, but some winners have already been declared. \nIn the category of most mentions on Twitter, @justintrudeau easily outpaced rivals @thomasmulcair and @pmharper. The Liberal leader gobbled up 36 per cent of all Twitter mentions, compared to 28 per cent for the NDP leader and 25 per cent for the Conservative. \nTrudeau also triumphed on Facebook, grabbing four times more likes than Mulcair. \n​ There's no question that this campaign has generated an enormous amount of social media activity; over six million tweets and more than 33 million interactions — posts, likes, comments and shares — on Facebook since June 1 . \nBut what do those numbers actually mean? Distorted reality \nIf you were to pay attention to the mainstream media's breathless coverage of what's happened on social media during the campaign, it would be easy to get the impression that vast numbers of Canadians take to Twitter and other platforms to talk politics and that all that activity allows us to draw some conclusions about what Canadians are thinking and what might happen on election day. But several studies have shown that's simply not the case. 'Twitter matters to people who are really politically engaged.' — Harold Jansen , University of Lethbridge \nAn Ipsos Reid survey taken during the 2011 campaign found that only six per cent of Canadians over the age of 18 were logging on to a social networking site every day to discuss public policy and political issues. \nA study published last year in the Canadian Parliamentary Review came to similar conclusions. Only about seven per cent of Facebook users and four per cent of Twitter users do anything political on those sites. Wooing young voters 12:58 \nHarold Jansen, a political scientist at the University of Lethbridge and one of the authors of the study, notes that the campaign of 2011 was widely hailed as our first \"Twitter election\" because journalists were paying so much attention to what was happening on the micro-blogging platform. \nBut Jansen argues that journalists, for whom Twitter has become a very important tool, risk inflating its importance and distorting what is actually happening online. The people who are politically active on Twitter and other social media sites tend to be the small subset of people who are already very interested in politics. Analysis | Social media scandals point to a bland political future \n\"Twitter matters to people who are really politically engaged,\" Jansen commented in a recent interview, \"but it's really a small group of people talking to each other.\" \nSocial media opens up the possibility of making that group of politically engaged people much larger, but Jansen says that's not what's happening. \n\"If we believed in the past that, what was holding people back is they just didn't have access to the information, and if they just could be more informed than they would be a lot more engaged, I think by this point we would have seen that level of engagement. The fundamental problem is that if people don't feel interested or engaged in politics, no amount to digital technology is going to change that.\" \nIt wasn't supposed to be this way. An Ipsos Reid survey in 2011 found that only six per cent of Canadians over the age of 18 logged on to a social networking site every day to discuss public policy and political issues. (Credit: AP Photo/Evan Vucci) 'Shift from the top to the bottom' \nThe great promise of social media in electoral politics, when it first burst on to the scene about a decade ago, was that it would lead to a revitalized democracy and empower ordinary citizens as never before. 'Political parties are not especially interested in invigorating democracy.' — Harold Jansen , University of Lethbridge \nThe first to understand its potential power was Vermont governor Howard Dean. In 2004, he used social networking sites to go from obscurity to prominence and raise millions of dollars online in a quixotic bid for the Democratic nomination for U.S. president. \n\"The internet is the most democratizing innovation we've ever seen,\" his campaign manager Joe Trippi declared. \"We're seeing the largest shift in power in world history. A shift from the top to the bottom. Power is actually being moved by this technology.\" \nAnd Trippi's prediction seemed to come true four years later when Barack Obama, a one-term senator from Illinois, was able to mobilize a vast army of online volunteers and donors to propel him to the White House. \nBut a decade after the Dean campaign, what's striking about campaigns today is not how much they've changed, but how much they've stayed the same. \nElections are still largely won the old-fashioned way; with lots of money, relentlessly consistent messaging, TV ads, many of them negative, and an effective \"ground game\" to get supporters to the polls on election day. Resistance to change \nAs for the web shifting power from the top to the bottom, evidence of that would be hard to find. \nSocial networks have had some notable triumphs outside of electoral politics. They were instrumental in creating the Arab Spring in 2011, and millions of people around the world use the web to sign petitions, organize and get involved in protest movements. \nBut the world of electoral politics has been stubbornly resistant to change, mostly because the institutions at the centre of our political system, our political parties, have no real incentive to throw open the gates to the masses. It's too hard to keep them under control, and politicians like control. \n\"Political parties are not especially interested in invigorating democracy,\" Jansen argues. \"That's not their purpose. Their purpose is to win elections, and so they aren't especially interested in harnessing the democratic potential of digital technology, because that's not always in their interest of helping them win.\" Elections are still largely won the old-fashioned way; with lots of money, relentlessly consistent messaging, TV ads, many of them negative, and an effective 'ground game' to get supporters to the polls on election day. (Christinne Muschi/Reuters) Illusion of accountability \nSocial media platforms like Twitter or Facebook are designed to connect people to each other. They are about two-way conversations. But politicians tend to be much more comfortable using them to pump out one-way messages than engage in genuine dialogue. \nTake Twitter for example. Almost all of our MPs are now on Twitter. It makes them seem connected and accountable. They're fond of tweeting about what they eat for lunch. They also like serving up party-approved talking points, but the risk of going off message is so great that meaningful dialogue is a rarity. The promise of connection and accountability that Twitter seems to offer turns out to be more illusion than reality. \nCan that promise of genuine political empowerment through social media ever be fully realized? \nTamara Small, a political science professor at the University of Guelph, doesn't think it will happen anytime soon. Public servants warned about social media use during campaign \n\"I think that we would need different types of politics,\" she argues, \"a politics that is much more open and is much more democratic than the politics of election campaigns, of winning, and of party discipline .\" \nUntil politicians see some advantage to greater democratic engagement on the web, she believes, they are not likely to change their behaviour. \n\"Politics has a number of things that it needs to get done, and the internet doesn't really fit into getting those things done. Electoral politics is very message disciplined, very controlled, and therefore the technology is being incorporated into that ethos, not the other way around.\"", "external_links": [], "published": "2015-10-18T20:20:00.000+03:00", "crawled": "2015-10-19T08:06:00.263+03:00", "highlightTitle": ""}