{"organizations": [], "uuid": "a4596bdd8d294c45701e9c85a69ee4a1d83ca0a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144955/adobe-named-leader-digital-experience-platforms-independent-research-firm", "country": "US", "title": "Adobe Named the Leader in Digital Experience Platforms by Independent Research Firm", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Adobe Named the Leader in Digital Experience Platforms by Independent Research Firm", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T06:01:00.000+02:00", "replies_count": 0, "uuid": "a4596bdd8d294c45701e9c85a69ee4a1d83ca0a2"}, "author": "admin", "url": "http://www.freshnews.com/news/1144955/adobe-named-leader-digital-experience-platforms-independent-research-firm", "ord_in_thread": 0, "title": "Adobe Named the Leader in Digital Experience Platforms by Independent Research Firm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Adobe Systems Incorporated \nSAN JOSE, Calif. -- (BUSINESS WIRE) -- Adobe (NASDAQ:ADBE) today announced that the company has been recognized as the leader in “ The Forrester Wave™: Digital Experience Platforms, Q4 2015” report by Forrester Research, Inc. Adobe was among the select companies Forrester invited to participate in the independent report, which evaluated the ten most significant software vendors in digital experience platforms across 40 criteria. Adobe was positioned as the only leader, ranking highest in current offering. \n“Adobe’s integrated platform leads the market,” stated the Forrester report. “Adobe has established a platform of best-of-breed technologies that support marketing activities. This portfolio includes web content management (WCM), testing and optimization, analytics, audience management, social publishing, and campaign management.” \nAdobe Marketing Cloud includes a comprehensive set of market-leading solutions to support digital experience delivery. Adobe Experience Manager offers web experience management, mobile app development, digital asset management, dynamic media delivery, mobile forums and documents, and social communities across digital channels. Adobe Campaign provides email and cross-channel campaign management; Adobe Analytics delivers advanced, real-time customer analytics; Adobe Target handles A/B and multivariate testing, targeting and optimization; and, Adobe Social powers social marketing. \n“With customers connected 24/7, brands are under more pressure than ever to deliver compelling digital experiences,” said Suresh Vittal, vice president of marketing strategy, Digital Marketing at Adobe. “Adobe Marketing Cloud makes it incredibly easy for brands to create, manage, and deliver contextually relevant experiences across the entire customer journey. We believe our recognition as the only leader in this Forrester Wave™ further validates our continued innovation as the market leader.” \nAdobe Marketing Cloud empowers companies to use big data to effectively reach and engage customers and prospects with highly personalized marketing content across devices and digital touch points. The tie-in with Adobe Creative Cloud makes it easy to quickly activate creative assets across all marketing channels. Thousands of brands worldwide including two thirds of Fortune 50 companies rely on Adobe Marketing Cloud. Adobe Marketing Cloud supports 41 trillion transactions, handles 4.1 trillion rich media requests and powers more than 60 billion emails per year. \nA complimentary copy of “The Forrester Wave™: Digital Experience Platforms, Q4 2015” report is available here . \nHelpful Links:", "external_links": [], "published": "2015-10-26T06:01:00.000+02:00", "crawled": "2015-10-26T07:36:28.832+02:00", "highlightTitle": ""}