{"organizations": [], "uuid": "7441ab6879d247ca33f0d0abd8784d7500c44512", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news24.com", "main_image": "http://graph.facebook.com/10227041841/picture", "site_section": "http://www.news24.com/", "section_title": "News24, South Africa's premier news source, provides breaking news on national, world, Africa, sport, entertainment, technology &amp; more. ", "url": "http://www.news24.com/MyNews24/Freeze-May-I-search-you-20151009", "country": "ZA", "title": "Freeze - May I search you?", "performance_score": 0, "site": "news24.com", "participants_count": 1, "title_full": "Freeze - May I search you? | News24", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T18:52:00.000+03:00", "replies_count": 0, "uuid": "7441ab6879d247ca33f0d0abd8784d7500c44512"}, "author": "news24.com", "url": "http://www.news24.com/MyNews24/Freeze-May-I-search-you-20151009", "ord_in_thread": 0, "title": "Freeze - May I search you?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Can you legally refuse to be searched and if so when?\nTo be honest, this all started with \"Sorry I'm late, got pulled over by the PoPo\", and a while later \"can I refuse to allow them to search me\", well the inconvenience of getting to work late and the police doing their duty usually ends up with a lot of frustrated citizens. The theory of law and the practical application of the law are to seemingly far apart to be consider part of the same whole, to put it into plain and simple context “would you say no to a police officer who asked to search you?”, taking into account his firearm and the fact that the police official is trained to disarm.\nThe truth is that a police officer in terms of the powers conferred to them via the Criminal Procedure Act 51 of 1977 (CPA) as amended as well as the South African Police Service Act 68 of 1995(SAPS ACT), while being mindful of the Constitution of South Africa, freedom charter, Batho Pele principles and also being subjected to the Promotion of Administrative Justice Act 3 of 2000 (PAJA). “Now that’s some laws to comply with” and it would take ages to explain so simply put, the Constitution gives everyone in South Africa (not only citizens) awesome super-duper rights, in our scenario we focus on the right to privacy which is contained in Chapter 2 (Bill of Rights) section 14 of the South African Constitution provides that:\n“Everyone has the right to privacy, which includes the right not to have:\na) their person or home searched;\nb) their property searched;\nc) their possessions seized; or\nd) the privacy of their communications infringed.”\nSo it is clear that your right not be searched is fundamentally entrenched into your right of privacy, although there is specific grounds mentioned in section 14 it’s a non-exhaustive list as showcased in the case of “ Klein v Attorney-General WLD” (credit to Legalnet on this case).\nSo in a nutshell you can say no to a police officer who requests to search you, your motor vehicle and your property, its fundamentally enshrined within our constitution, however (there’s always a but) everyone’s right maybe limited in terms of Section 36 of the very same Constitution (see always a but).\nThat’s where the CPA, SAPS Act, PAJA and the rest come in play as there are provisions which limit your rights to privacy and your constitutional right to object. In the CPA, which is the big book on how the criminal justice system operates, so basically the Criminal Justice Operating Guide, it contents sections that deal with when may a police officer search a person, when and how a police officer is to detain a person, your rights as a person being detained, bail, when must a person be brought to court for their bail application, when bail will be granted, pleas of insanity, guilt and innocence, trial procedure, appeal procedure, and cost orders.\nSAPS Act , speaks to the administration and functions of the South African police, in other words THE SAPS Operating manual, that deals with everything from appointments of the National Police Commissioner, provincial commissioners down to the very bottom blue wearing run of the mill officer we see on a daily basis.\nThat really doesn't leave you here nor there does it?\nWell, the simple answer is that you may refuse when asked to be searched and that a police officer is allowed to search you without a warrant on grounds based on a reasonable suspicion (sections 19 - 36 of Chapter 2 of the CPA), however this is where the law has been blurred reasonable suspicion is a difficult thing to determine, so the first thing you should ask is the reason for you being searched as the decision taken by the police official falls within section 1 of PAJA more aptly canvassed in the Constitutional Court Case of National Director of Public Prosecutions Verses Freedom Under Law [2014] 4 All SA 147 (SCA) :\n“ The domain of judicial review under PAJA is confined to ‘administrative action’ as defined in s 1 of the Act. The definition starts out from the premise that ‘administrative action’ is ‘any decision taken, or any failure to take a decision, by . . . a natural or juristic person . . . when exercising a public power or performing a public function in terms of an empowering provision, which adversely affects the rights of any person and which has direct, external legal effect ...”\nAlthough this case deals with a number of other constitutionally valid arguments it had to deal with a question of law involving PAJA and the decision not to prosecute our previous head of Crime Intelligence Mr Mdluli.\nSo if the police officer is unable to provide you with a reason to stop and search you, your car or your home, you may validly refuse to allow them to search you, however this may be seen as resisting arrest and could result in you being detained, which would be unlawful however the inconvenience of upholding your legal rights may result in you being plunged into the criminal justice system.\nWhat can be done? The fact that you are aware of the constraints and limitations on the powers conferred to our police, will allow you, should you ever find that yourself in the unfortunate scenario of being arrested, what procedures undertaken by the police in searching you, your car or property are being observed and when they are not “as highlighted in the Oscar Pretorius investigation”, you will be able to inform your attorney, who should ensure that same is recorded on the docket and that your rights are observed.", "external_links": ["http://www.saflii.org/za/cases/ZASCA/2014/58.html", "http://www.justice.gov.za/legislation/constitution/SAConstitution-web-eng.pdf", "http://4.bp.blogspot.com/-yBFaa5g6S4M/VdsWHE2WUBI/AAAAAAAAARw/HruD9bag730/s1600/COP.png", "http://www.saps.gov.za/legislation/acts/act68of1995.pdf", "http://www.legalnet.co.za/cyberlaw/cybertext/chapter13.htm", "http://3.bp.blogspot.com/-jniyNH0KCYc/VdsWG_CPcRI/AAAAAAAAAR0/I_Uv1s1V7ww/s1600/KITTY%2BBAD.jpg", "http://1.bp.blogspot.com/-LFLaV2QXQIs/VdsWCNAaFpI/AAAAAAAAARc/qc7NFHUtsnk/s1600/plank%2Blabour%2Bblog.png", "http://3.bp.blogspot.com/-g15gTSYC1D8/VdsWGyhiyfI/AAAAAAAAARs/LvEt_xcJlOQ/s1600/CAR%2BDRUNK%2BFUNNY.jpg", "http://www.justice.gov.za/legislation/acts/1977-051.pdf", "http://3.bp.blogspot.com/-AGFH1pdhrgc/VdsWH8q-xwI/AAAAAAAAAR4/sTvD47NK-Lo/s1600/YI%2Bnothing%2Bto%2Bsee%2Bhere.jpg"], "published": "2015-10-09T18:52:00.000+03:00", "crawled": "2015-10-09T14:02:47.574+03:00", "highlightTitle": ""}