{"organizations": [], "uuid": "b9600a03575097e37b1f581c2992a3bde2b54a60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.retailtechnologyreview.com", "main_image": "", "site_section": "http://www.retailtechnologyreview.com/feed.rss", "section_title": "Retail Technology Review  RSS Feed", "url": "http://www.retailtechnologyreview.com/articles/2015/10/13/uk-showing-higher-than-average-it-budget-growth-and-itsm-maturity/", "country": "GB", "title": "UK showing higher than average IT budget growth and ITSM maturity", "performance_score": 0, "site": "retailtechnologyreview.com", "participants_count": 1, "title_full": "UK showing higher than average IT budget growth and ITSM maturity", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T00:23:00.000+03:00", "replies_count": 0, "uuid": "b9600a03575097e37b1f581c2992a3bde2b54a60"}, "author": "Retail Technology Review", "url": "http://www.retailtechnologyreview.com/articles/2015/10/13/uk-showing-higher-than-average-it-budget-growth-and-itsm-maturity/", "ord_in_thread": 0, "title": "UK showing higher than average IT budget growth and ITSM maturity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Send to friend \nIT budgets are expected to increase for nearly 40% of UK organisations, making the UK the No. 1 region globally for IT budget growth, new service management research published today by Axios Systems reveals. \nWhen IT departments are recognised as positive contributors of business efficiencies, they're more likely to get support and resources to drive business innovation further. \nThe finding is part of an industry-wide research paper on global service management trends, which highlights regional comparisons on IT budgets and IT Service Management (ITSM) maturity levels. The research also examines ITSM variations by industry and company size, and explores what these insights mean for companies with similar characteristics. Recommendations are provided to help organisations at all maturity levels discover ways to optimise their service management value. \nService management provider Axios Systems produced the paper, in partnership with one of Europe's leading business schools. \nAmong the findings critical to enterprises based in the UK, the research also reveals that: 30% of UK organisations expect their IT budget to decrease, compared to nearly 50% in the United States and 31% globally. Nearly 80% of UK organisations have an ITSM maturity level of 3 or higher. This compares to just 66% of organisations worldwide having achieved similar ITSM sophistication. \nThe research spans the United States, United Kingdom, DACH (Germany, Austria and Switzerland) and Benelux (Belgium, the Netherlands and Luxembourg). Survey respondents include ITSM professionals from large enterprises ranging from 500 to 5,000 employees. \nTasos Symeonides, CEO of Axios Systems, said: \"We make continual investment in research, and proactively seek to identify and address the challenges of our customers and industry. This research in particular aims to stimulate a blue-sky discussion within organisations about developing better service management, based on observations focused on industry, region and organisational size. The end goal, of course, is to provide C-level executives with exclusive, evidence-based resources that support a competitive service management strategy for their enterprise.\"", "external_links": [], "published": "2015-10-14T00:23:00.000+03:00", "crawled": "2015-10-14T10:19:17.052+03:00", "highlightTitle": ""}