{"organizations": [], "uuid": "c6d12c8a7a8dd3c80ee3968a1f72f42e6390fb47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://dd508hmafkqws.cloudfront.net/sites/default/files/network-782707_1280.jpg", "site_section": "http://www.deccanchronicle.com/technology", "section_title": "Technology | Deccan Chronicle", "url": "http://www.deccanchronicle.com/151009/technology-latest/article/linuxwifatch-latest-piece-code-infecting-internet-things-devices", "country": "US", "title": "Linux.Wifatch: The latest piece of code infecting Internet of Things devices", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Linux.Wifatch: The latest piece of code infecting Internet of Things devices", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T16:06:00.000+03:00", "replies_count": 0, "uuid": "c6d12c8a7a8dd3c80ee3968a1f72f42e6390fb47"}, "author": "Deccan", "url": "http://www.deccanchronicle.com/151009/technology-latest/article/linuxwifatch-latest-piece-code-infecting-internet-things-devices", "ord_in_thread": 0, "title": "Linux.Wifatch: The latest piece of code infecting Internet of Things devices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deccan Chronicle | October 09, 2015, 15.03 pm Representational Image (Photo: Pixabay) The following story could well work as the script of a Hollywood movie or superhero comic. Let us introduce you to Linux.Wifatch, one of the latest pieces of code infecting Internet of Things (IoT) devices. Symantec, a technology company, first heard of Wifatch back in 2014, when an independent security researcher noticed something unusual happening on his home router. The researcher identified running processes that didn’t seem to be part of the legitimate router software and decided to investigate further. During his analysis he discovered a sophisticated piece of code that had turned his home router into a zombie connected to a peer-to-peer network of infected devices.\nLately we’ve seen that home routers, and IoT devices in general, are becoming more interesting to cyber crooks; these devices may not hold a lot of interesting data but under the control of criminals they have proven to be quite useful, for instance, to articulate distributed denial-of-service (DDoS) attacks.\nAs well as this, it’s difficult for the average user to detect if one of these devices has become infected and so most infections go unnoticed. In April of this year, Symantec was provided with some additional information on Wifatch. At first sight there was nothing unusual about it, however, after a closer look, this particular piece of code looked somewhat more sophisticated than the average embedded threat usually spotted in the wild. Symantec’s telemetry suggests that India is impacted with 9 per cent of Linux.Wifatch infections.\nLinux.Wifatch is a piece of code that infects a device without user consent and in that regard is the same as any other piece of malware. It should also be pointed out that Wifatch contains a number of general-purpose back doors that can be used by the author to carry out potentially malicious actions.\nHowever, cryptographic signatures are verified upon the use of the back doors to verify that commands are indeed coming from the malware creator. This would reduce the risk of the peer-to-peer network being taken over by others.\nSymantec believes that most of Wifatch’s infections are happening over Telnet connections to devices using weak credentials. After monitoring Wifatch’s network for a number of months, we estimate it to include somewhere in the order of tens of thousands of devices.\nMitigation\nResetting an infected device will remove the Wifatch malware; however, devices may become infected again over time. If possible, users are advised to keep their device’s software and firmware up to date and to change any default passwords that may be in use.\n technology latest Symantec malware Also Read iPhone prices drop heavily! Sebi restrains NICL from raising funds Turn boring PPT into animated videos Robust infrastructure can revive economic growth: Pranab Mukherjee", "external_links": ["http://platform.twitter.com/widgets.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/151009/technology-latest/article/linuxwifatch-latest-piece-code-infecting-internet-things-devices", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://campaign.bharatmatrimony.com/track/clicktrack.php?trackid=00100326114361", "http://dd508hmafkqws.cloudfront.net/sites/default/files/image005.jpg", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/BharatMatrimony_texlink_banner_620x40px.gif", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/network-782707_1280.jpg", "http://vuukle.com/js/vuukle.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/network-782707_1280.jpg"], "published": "2015-10-11T16:06:00.000+03:00", "crawled": "2015-10-11T05:36:24.745+03:00", "highlightTitle": ""}