{"organizations": [], "uuid": "409bb3b16c1e0ae65e60d1cb7f3917fcb756df6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1141787/match-group-files-registration-statement-proposed-initial-public-offering", "country": "US", "title": "Match Group Files Registration Statement for Proposed Initial Public Offering", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Match Group Files Registration Statement for Proposed Initial Public Offering", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T00:30:00.000+03:00", "replies_count": 0, "uuid": "409bb3b16c1e0ae65e60d1cb7f3917fcb756df6c"}, "author": "admin", "url": "http://www.freshnews.com/news/1141787/match-group-files-registration-statement-proposed-initial-public-offering", "ord_in_thread": 0, "title": "Match Group Files Registration Statement for Proposed Initial Public Offering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/16/2015 @ 2:30 PM   IAC \nNEW YORK, Oct. 16, 2015 /PRNewswire/ -- IAC/InterActiveCorp (\"IAC\") today announced that Match Group, Inc. (\"Match Group\"), a wholly-owned subsidiary of IAC, has publicly filed a registration statement on Form S-1 with the U.S. Securities and Exchange Commission relating to the previously announced proposed initial public offering by Match Group of its common stock. The number of shares to be offered and the price range for the offering have not been determined. Match Group has applied to list its common stock on the NASDAQ Global Select Stock Market under the ticker symbol \"MTCH\". \nJ.P. Morgan Securities LLC, Allen & Company LLC and BofA Merrill Lynch are acting as the lead bookrunning managers for the offering. \nThis offering will be made only by means of a prospectus. A copy of the preliminary prospectus, when available, may be obtained from J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, Attention: Prospectus Department, 1155 Long Island Avenue, Edgewood, NY 11717, or by telephone at (866) 803-9204, from Allen & Company LLC, Attention: Syndicate Department, 711 Fifth Avenue, New York, NY 10022, or by telephone at (212) 339-2220 or from BofA Merrill Lynch, Attention: Prospectus Department, 222 Broadway, New York, NY 10038, or by e-mailing: dg.prospectus_requests@baml.com. \nA registration statement relating to these securities has been filed with the U.S. Securities and Exchange Commission but has not yet become effective. These securities may not be sold, nor may offers to buy be accepted, prior to the time the registration statement becomes effective. This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. \nAbout IAC IAC (NASDAQ: IACI) is a leading media and Internet company. It is organized into four segments: Match Group, which includes dating and education businesses with brands such as Match, OkCupid, Tinder and The Princeton Review; Search & Applications, which includes brands such as About.com, Ask.com, Dictionary.com and Investopedia; Media, which consists of businesses such as Vimeo, Electus, The Daily Beast and CollegeHumor; and eCommerce, which includes HomeAdvisor and ShoeBuy. IAC's brands and products are among the most recognized in the world reaching users in over 200 countries. IAC is headquartered in New York City and has offices worldwide. \nAbout Match Group Match Group is the world's leading provider of dating products. We operate a portfolio of over 45 brands, including Match, OkCupid, Tinder, Meetic, Twoo, OurTime, BlackPeopleMeet and FriendScout24, each designed to increase our users' likelihood of finding a romantic connection. Through our portfolio of trusted brands, we provide tailored products to meet the varying preferences of our users. We currently offer our dating products in 38 languages across more than 190 countries. In addition to our dating business, we also operate The Princeton Review, which provides a variety of test preparation, academic tutoring and college counseling services. \nSafe Harbor Statement Under the Private Securities Litigation Reform Act of 1995 This press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. The use of words such as \"anticipates,\" \"expects,\" \"intends,\" \"plans\" and \"believes,\" among others, generally identify forward-looking statements. These forward-looking statements include statements relating to: future financial performance, business prospects and strategy, anticipated trends, prospects in the industries in which our businesses operate and other similar matters. These forward-looking statements are based on management's current expectations and assumptions about future events, which are inherently subject to uncertainties, risks and changes in circumstances that are difficult to predict. Actual results could differ materially from those contained in these forward-looking statements for a variety of reasons, including, among others: changes in senior management at IAC or its businesses, changes in our relationship with Google, adverse changes in economic conditions, adverse trends in the online advertising industry, our ability to convert visitors to our websites into users, risks relating to acquisitions, technology changes, our ability to expand successfully into international markets and regulatory changes. Certain of these and other risks and uncertainties are discussed in IAC's filings with the Securities and Exchange Commission (\"SEC\"). Other unknown or unpredictable factors that could also adversely affect our business, financial condition and results of operations may arise from time to time. In light of these risks and uncertainties, these forward-looking statements may not prove to be accurate. Accordingly, you should not place undue reliance on these forward-looking statements, which only reflect the views of our management as of the date of this press release. We do not undertake to update these forward-looking statements. \nContact Us", "external_links": [], "published": "2015-10-17T00:30:00.000+03:00", "crawled": "2015-10-17T01:45:50.727+03:00", "highlightTitle": ""}