{"organizations": ["Mitsubishi Electric"], "uuid": "273ddf51b7e4d0bf36a3123b7e9fc6924666253f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVpSWw==", "section_title": "Business Wire Technology: Consumer Electronics News", "url": "http://www.businesswire.com/news/home/20151013005900/en/Mitsubishi-Electric-Introduces-EMIRAI3-xAUTO-Automated-Driving", "country": "US", "title": "Mitsubishi Electric Introduces EMIRAI3 xAUTO Automated Driving Concept Car", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Mitsubishi Electric Introduces EMIRAI3 xAUTO Automated Driving Concept Car", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T04:30:00.000+03:00", "replies_count": 0, "uuid": "273ddf51b7e4d0bf36a3123b7e9fc6924666253f"}, "author": "", "url": "http://www.businesswire.com/news/home/20151013005900/en/Mitsubishi-Electric-Introduces-EMIRAI3-xAUTO-Automated-Driving", "ord_in_thread": 0, "title": "Mitsubishi Electric Introduces EMIRAI3 xAUTO Automated Driving Concept Car", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mitsubishi Electric Introduces EMIRAI3 xAUTO Automated Driving Concept Car Full suite of technologies for next-generation all-automated driving October 13, 2015 09:30 PM Eastern Daylight Time \nTOKYO--( BUSINESS WIRE )-- Mitsubishi Electric Corporation (TOKYO:6503) announced today the EMIRAI3 xAUTO, an automated concept car incorporating a full suite of Mitsubishi Electric technologies for safe, accurate next-generation automated driving. Mitsubishi Electric aims to commercialize the technologies from 2020 onward. \nEMIRAI3 xAUTO will be exhibited during Tokyo Motor Show 2015 at Tokyo Big Sight in Tokyo, Japan from October 29 to November 8. \nThe EMIRAI3 xAUTO leverages Mitsubishi Electric’s advanced Diamond Safety technologies for proactive passenger protection, as follows: \nTechnologies for automated driving Perimeter sensing and artificial intelligence- High-level perimeter sensing technology combines sensors represented millimeter-wave radar, motion prediction and risk mapping. The two technologies, combined with artificial-intelligence monitoring of the vehicle’s perimeter, ensure that the vehicle responses appropriately to road and traffic conditions.- Millimeter-wave radar uses low-noise, high-resolution detection to recognize surrounding objects.- Artificial-intelligence technology predicts and maps visible risks based on the movements of other vehicles. It also identifies invisible, immobile risks by analyzing information about potentially dangerous road conditions, etc. acquired from the Internet. High-accuracy positioning and both road-to-vehicle and vehicle-to-vehicle communication- The vehicle uses high-precision measurements achieved with quasi-zenith satellites, accurate positioning achieved with high-definition 3D maps, and out-of-vehicle information based on road-to-vehicle and vehicle-to-vehicle communication.- 3D mapping is accomplished with Mitsubishi Electric’s own “mobile mapping system”. Precise centimeter-level measurements are achieved with quasi-zenith satellites. Road-to-vehicle and vehicle-to-vehicle communication ensure cooperation with nearby vehicles and appropriate responses to specific road conditions, such as mountainous or snowy roads, driving at night or in fog, or when merging into heavy traffic. High-precision vehicle-motion controlMitsubishi Electric’s high-precision-vehicle-motion control cultivated by electric power steering and traction-control technology experience achieve smooth, stable self-driving operations. \nAutomated-parking Perimeter monitoring, parking lot recognition and auto-guiding technologies fully automate parking. Perimeter monitoring enables the vehicle to park itself even in small, tight parking lots by remote control. \nAutonomous emergency braking system in darkness High-grade sensor-fusion of millimeter-wave radar and camera achieves accurate detection of moving and inanimate objects at long distances, even in darkness. Early detection and evasion of surrounding objects is supported by sensing and motion-prediction technologies for highly reliable collision avoidance. \nLane keeping control system Original signal-processing technology supported by the proprietary camera’s highly advanced correction functions to detects traffic lane lines even in low-visibility conditions. Steering is guided by vehicle-motion control technology to keep the vehicle positioned consistently within a lane. \nMerge assistance based on road-to-vehicle and vehicle-to-vehicle communication Road-to-vehicle and vehicle-to-vehicle communication support safe merging by informing the driver about traffic conditions and other vehicles’ positions, and by controlling vehicle speed. \nAbout Mitsubishi Electric Corporation With over 90 years of experience in providing reliable, high-quality products, Mitsubishi Electric Corporation (TOKYO:6503) is a recognized world leader in the manufacture, marketing and sales of electrical and electronic equipment used in information processing and communications, space development and satellite communications, consumer electronics, industrial technology, energy, transportation and building equipment. Embracing the spirit of its corporate statement, Changes for the Better, and its environmental statement, Eco Changes, Mitsubishi Electric endeavors to be a global, leading green company, enriching society with technology. The company recorded consolidated group sales of 4,323.0 billion yen (US$ 36.0 billion*) in the fiscal year ended March 31, 2015. For more information visit:*At an exchange rate of 120 yen to the US dollar, the rate given by the Tokyo Foreign Exchange Market on March 31, 2015 Contacts", "external_links": [], "published": "2015-10-14T04:30:00.000+03:00", "crawled": "2015-10-14T05:12:24.172+03:00", "highlightTitle": ""}