{"organizations": ["NHAI"], "uuid": "dcf61b81a8889c14f3204bc8652d56f44399949a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.roadtraffic-technology.com", "main_image": "", "site_section": "http://www.roadtraffic-technology.com/news-rss.xml", "section_title": "Road Traffic Technology-Updates", "url": "http://www.roadtraffic-technology.com/news/newsindias-mep-infrastructure-plans-tie-up-with-private-equity-firms-for-nhai-projects-4701268", "country": "", "title": "India’s MEP Infrastructure plans tie-up with private equity firms for NHAI projects", "performance_score": 0, "site": "roadtraffic-technology.com", "participants_count": 0, "title_full": "India’s MEP Infrastructure plans tie-up with private equity firms for NHAI projects", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "dcf61b81a8889c14f3204bc8652d56f44399949a"}, "author": "", "url": "http://www.roadtraffic-technology.com/news/newsindias-mep-infrastructure-plans-tie-up-with-private-equity-firms-for-nhai-projects-4701268", "ord_in_thread": 0, "title": "India’s MEP Infrastructure plans tie-up with private equity firms for NHAI projects", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India’s MEP Infrastructure plans tie-up with private equity firms for NHAI projects 26 October 2015 \nIndia-based toll collection and road maintenance firm MEP Infrastructure Developers intends to partner with private equity firms or pension funds to bid for projects of National Highway Authority of India (NHAI). \nThe road projects will be called in for tender soon by the NHAI. \nAt the end of last fiscal, the firm, which was listed in May, generated revenues of Rs9.07bn ($138m). \"The company is planning to tie-up with private equity and pension funds from countries such as Canada and Malaysia in order to bid for new projects of NHAI.\" \nMEP Infrastructure Developers vice chairman and managing director Jayant Mhaiskar was quoted by Business Line as saying that the company is planning to tie-up with private equity (PE) and pension funds from countries such as Canada and Malaysia in order to bid for new projects of NHAI. \nThe company was floated five months ago and the proceeds of Rs2.61bn ($40m) gained from the IPO were used to cut down its debt. \nOver the next few months, the company intends to come up with toll-operate-yransfer projects, with a fixed concession period of anywhere between 20 and 25 years. \nFor such projects, the company intends to secure outside funding at lower interest rate. \nMEP is believed to be holding negotiations with two pension funds, the publication reported.In India, several build-operate-transfer (BOT) road projects are facing severe financial crunch and in some projects, private equity players have acquired stakes and are operating these projects either on their own or through third-party companies. \nThe firm has a debt of approximately Rs30bn ($461m), Rs25bn ($384m) of which has been taken only for one project. \nThis project will operate for more than a decade and the debt of Rs25bn will be repaid in nine years, while remaining debt serves as working capital and to meet other operational requirements. Follow Us:", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T16:08:32.912+02:00", "highlightTitle": ""}