{"organizations": [], "uuid": "78c24af96adcc51f42528fdf242eb4b6cb39bc92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.barchart.com", "main_image": "", "site_section": "http://www.barchart.com/stocks/news.php?feed=AP,PRNW&subject=STK.TECH&date=20150916115959&section=tech", "section_title": "Stocks - News &amp; Commentary | Technology &amp; Comp", "url": "http://www.barchart.com/headlines/story/10833182/wuxi-nextcode-and-fudan-children-s-hospital-partner-to-lead-whole-genome-diagnostics-for-rare-diseases-in-china", "country": "US", "title": "WuXi NextCODE and Fudan Children's Hospital Partner to Lead Whole Genome Diagnostics for Rare Diseases in China", "performance_score": 0, "site": "barchart.com", "participants_count": 1, "title_full": "WuXi NextCODE and Fudan Children's Hospital Partner to Lead Whole Genome Diagnostics for Rare Diseases in China", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "78c24af96adcc51f42528fdf242eb4b6cb39bc92"}, "author": "PRNW", "url": "http://www.barchart.com/headlines/story/10833182/wuxi-nextcode-and-fudan-children-s-hospital-partner-to-lead-whole-genome-diagnostics-for-rare-diseases-in-china", "ord_in_thread": 0, "title": "WuXi NextCODE and Fudan Children's Hospital Partner to Lead Whole Genome Diagnostics for Rare Diseases in China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI and CAMBRIDGE, Mass. and REYKJAVIK, Iceland WuXi NextCODE , a precision medicine company using the genome to improve health worldwide, and the Children's Hospital of Fudan University (CHFU) , based in Shanghai and serving 2.3 million patients nationwide per year, today announced the signing of a landmark agreement for advancing precision medicine in China . It brings WuXi NextCODE's renowned genomic testing capabilities directly into clinical use for the first time in China , and builds on CHFU's preeminence in pediatrics to begin immediately to deliver benefits to thousands of rare disease patients across China .\nWuXi NextCODE is deploying the full range of its renowned genome testing infrastructure for CHFU: CLIA sequencing, massively scalable informatics, and the most powerful interpretation tools and clinical genetics expertise. As a result, CHFU will be able to offer Chinese rare disease patients the same sequence-based diagnostics now available to patients in the United States and Europe through partners including Boston Children's Hospital and Genomics England. CHFU, which sees as many as 7,000 patients every day, can now rapidly scale up sequence-based testing to resolve more undiagnosed cases.\n\"We share a mission with CHFU: to put the best technology in the hands of the best doctors and scientists to help patients,\" said Dr Ge Li , Chairman and CEO of WuXi AppTec, of which WuXi NextCODE is a wholly owned subsidiary. \"We are very excited to join with our friends at CHFU to take the lead in rare disease diagnosis, care and research in China , offering patients world-class testing right here.\"\n\"Looking for the genomics infrastructure that could deliver the best results for our patients, we saw that our colleagues at Harvard Medical School and other leading institutions were choosing WuXi NextCODE,\" said Guoying Huang , President of CHFU. \"We've come to the same conclusion. Using the emerging global standard for genomic data in medicine, we can move beyond static gene panels to employ the full power of the genome to address rare diseases, genetic and genetics-related disorders and eventually cancer and other conditions as well. We can also collaborate instantly with sister institutions that use WuXi NextCODE's system to push the frontiers of care and discovery.\"\n\"Our aim is to bring our technology into the clinic to deliver precision medicine to patients in every market worldwide,\" said Hannes Smarason, co-founder, President and COO of WuXi NextCODE. \" China is central to that strategy, and we couldn't have a better partner than Fudan Children's for realizing it and giving thousands of young patients and their families the best diagnostics and treatment options for inherited rare disorders.\"\nWuXi NextCODE offers uniquely comprehensive and integrated capabilities for using the genome to better diagnose disease and create better medicine. These include a full range of sequencing services through our CLIA-certified laboratory; the world's leading genome interpretation system; a novel database architecture that makes it possible to query, manage, store and share massive genomic data with unrivalled speed and efficiency; and the know-how and experience to apply genomics to optimize every aspect of drug discovery and development. With offices in Shanghai ; Cambridge, Massachusetts ; and Reykjavik, Iceland , we enable clinicians and researchers at institutions and companies worldwide to use the full power of the genome to deliver precision medicine and support health. WuXi NextCODE is a wholly owned subsidiary of WuXi AppTec, the operating subsidiaries of WuXi PharmaTech (NYSE: WX). WuXi AppTec comprises a leading open-access R&D capability and technology platform company serving the pharmaceutical, biotechnology, and medical device industries, with operations in China and the United States .\nFudan University Children's Hospital .\nChildren's Hospital of Fudan University is a prestigious tertiary academic medical center for children in China . Since its founding in 1952, it has been dedicated to providing pediatric patient care, education and research. CHFU is designated by the Ministry of Education as a key national center for pediatrics. It provides training programs for masters and doctoral degrees, as well as postdoctoral fellowships. CHFU has consistently led the field in China through the comprehensiveness of its capabilities. Its Institute for Pediatric Research has developed more than 100 tests for single-gene genetic diseases, established multidisciplinary teams of clinical experts, and is among the very first hospitals to adopt next generation sequencing. CHFU is a pioneer in the clinical diagnosis of genetic diseases in China .\nContacts:\nWuXi NextCODE\nWuXi AppTec\nEdward Farmer\nAaron Shi\nVP Communications & New Ventures\nDirector of Corporate Communications\nefarmer@wuxinextcode.com\naaron_shi@wuxiapptec.com\n+1 781 775 6206\n+86-21 5046-4362\nChildren's Hospital of Fudan University\nLiling Qian\nDirector of Administrative Office, Institute for Pediatric Research\nChildren's Hospital of Fudan University\nekyykyb@163.com\n+86-21 6493-1913\nLogo - http://photos.prnewswire.com/prnh/20150325/194344LOGO\n releases/wuxi-nextcode-and-fudan-childrens-hospital-partner-to-lead-whole-genome-diagnostics-for-rare-diseases-in-china-300143708.html\nSOURCE WuXi NextCODE", "external_links": ["http://www.wuxinextcode.com/", "http://www.prnewswire.com/news-releases/wuxi-nextcode-and-fudan-childrens-hospital-partner-to-lead-whole-genome-diagnostics-for-rare-diseases-in-china-300143708.html", "http://ch.shmu.edu.cn/", "http://photos.prnewswire.com/prnh/20150325/194344LOGO", "http://photos.prnewswire.com/prnvar/20150325/194344LOGO"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-10-11T21:50:29.762+03:00", "highlightTitle": ""}