{"organizations": [], "uuid": "a19becf661162528278c6c277b221340acfc581e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1139115/saas-partner-relationship-management-prm-leader-impartner-expands-operations-latin-ame", "country": "US", "title": "SaaS Partner Relationship Management (PRM) Leader Impartner Expands Operations into Latin America", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "SaaS Partner Relationship Management (PRM) Leader Impartner Expands Operations into Latin America", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:00:00.000+03:00", "replies_count": 0, "uuid": "a19becf661162528278c6c277b221340acfc581e"}, "author": "admin", "url": "http://www.freshnews.com/news/1139115/saas-partner-relationship-management-prm-leader-impartner-expands-operations-latin-ame", "ord_in_thread": 0, "title": "SaaS Partner Relationship Management (PRM) Leader Impartner Expands Operations into Latin America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/12/2015 @ 7:00 AM   Impartner \nSILICON SLOPES, Utah, Oct. 12, 2015 /PRNewswire/ -- Just six months after being acquired by now CEO Joe Wang and Kennet Partners and a recent expansion into EMEA, Impartner, the leading Partner Relationship Management (PRM) provider, today announced it is extending its operations into Latin America (LATAM). Impartner has tapped software and channel sales veteran Juan Munoz as LATAM vice president to bring the company's disruptive PRM solutions to the region, where the cloud remains a top five priority for CIOs and where SaaS solutions are projected to grow 50 percent in just the next few years.* \nhttps://photos.prnewswire.com/prnvar/20151008/275514 \n\"While the PRM industry in the US and the EMEA markets is fairly well developed and growing rapidly, Latin America has been relatively under served,\" said Impartner CEO Joe Wang. \"We're excited to have someone with Juan's extensive experience with both software technologies and with building powerful, Latin American channel networks to help extend our PRM technologies into this critical market.\" \nHaving shadowed the CRM industry for nearly a decade, the PRM industry is breaking from the pack in 2015 as customer experience moves to the front lines of the CEO agenda. While product quality and price remain critical components of business success, the collective corporate business agenda has zeroed in on \"too hard to do business with,\" as the new \"it\" problem that companies need to address or risk becoming obsolete. PRM solves that problem by ensuring that companies that sell through indirect channels have a world-class front door to their partner relationship, which starts with the Partner Portal. \n\"A growing list of top corporations like Rackspace, Workfront and National Instruments are making critical investments in their PRM solutions to ensure they are a partner of choice for their industry,\" said Wang. \"They know that to truly serve their existing partners and scale their channel organizations, they must have a partner portal that both delivers a differentiated, world-class partner experience AND which helps them manage onboarding, deal registration, lead distribution, MDF fund distribution and training.\" \n\"The time for this expansion is now,\" adds Munoz. \"Given the region's explosive demand for SaaS technologies that raise the bar for user experience, this market represents a tremendous growth opportunity for Impartner, the channel community and end users.\" \nIn LATAM, while Impartner will interact directly with end-users, solutions will be sold primarily through partners. As the company expands, it will be looking for highly qualified partners to help deliver its transformational software to companies who want to ignite their sales through indirect channels, with an initial, heavy focus placed on technology, manufacturing, telecom and Internet Service Provider markets. \nKey highlights of working with Impartner include: -- Strong end-user demand, driven by Impartner's market development team -- Highly scalable product, relevant to companies of all sizes -- Access to lucrative professional services -- Subscription model with generous recurring revenues \nEnd users and partners interested in Impartner's solutions should contact Impartner for more information here . \nBefore joining Impartner, Munoz was most recently head of Latin American operations for network security leader WatchGuard, where he increased sales by more than 400 percent during his tenure. Prior to WatchGuard, Munoz led a host of sales and technical leadership positions with Attachmate. Connect with Munoz on LinkedIn here . \nAbout Impartner Impartner (formerly known as TreeHouse Interactive) delivers the industry's most advanced SaaS-based Partner Relationship Management solution, helping companies worldwide manage their partner relationships and accelerate revenue and profitability through indirect sales channels. Impartner PRM is the industry's only turnkey solution that can deploy a world-class Partner Portal in 30 days, using the company's highly engineered, three-step Velocity(TM) onboarding process. For more information on Impartner, which is based in Utah's tech hotbed, the Silicon Slopes, visit www.impartner.com , or in the US call +1801 576 8428, in EMEA call +33 1 40 90 31 20, and in LATAM call +1 954 364 7883.", "external_links": [], "published": "2015-10-12T17:00:00.000+03:00", "crawled": "2015-10-12T18:19:36.746+03:00", "highlightTitle": ""}