{"organizations": [], "uuid": "851847f837126312b4a3f8ba1982b5367db5c64c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stockhouse.com", "main_image": "", "site_section": "http://www.stockhouse.com/discovery/technology", "section_title": "The Technology Report - Technology investor news and research center ", "url": "http://www.stockhouse.com/news/press-releases/2015/10/23/charlotte-tilbury-turns-to-netsuite-cloud-for-business-makeover", "country": "US", "title": "Charlotte Tilbury Turns to NetSuite Cloud for Business Makeover", "performance_score": 0, "site": "stockhouse.com", "participants_count": 1, "title_full": "Charlotte Tilbury Turns to NetSuite Cloud for Business Makeover", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "851847f837126312b4a3f8ba1982b5367db5c64c"}, "author": "stockhouse.com", "url": "http://www.stockhouse.com/news/press-releases/2015/10/23/charlotte-tilbury-turns-to-netsuite-cloud-for-business-makeover", "ord_in_thread": 0, "title": "Charlotte Tilbury Turns to NetSuite Cloud for Business Makeover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "High-end Cosmetics Manufacturer and Retailer Selects NetSuite OneWorld to Transform Business Operations and Expand Global Presence\nLONDON , Oct. 23, 2015 /PRNewswire/ -- NetSuite Inc. (NYSE: N), the industry's leading provider of cloud -based financials / ERP and omnichannel commerce software suites, today announced that Charlotte Tilbury , a fast-growing manufacturer and retailer of high-end skincare and cosmetics, has selected NetSuite OneWorld to run its mission-critical business operations. Charlotte Tilbury plans to implement NetSuite OneWorld for financial consolidation, order management, inventory management, customer relationship management (CRM), multi-currency, multi-language, and multi-country tax compliance – all from within one single system. Charlotte Tilbury is also planning to leverage NetSuite's flexible and powerful SuiteCloud development platform for its customisation needs and integration with other third-party systems to meet its specific business needs. This modernisation effort gives the brand the scalability, flexibility and agility it needs to achieve business efficiency and support its aggressive expansion plans.\nExponential Growth Presents Challenges\nAs the world's number one make-up artist, Charlotte Tilbury understands the power of make-up like no-one else. With over 20 years at the forefront of the make-up industry, working with the world's top models, photographers, celebrities and designers, Charlotte has poured her best-kept secrets into an edited 'all-you-need' skincare and make-up collection, which launched in September 2013 .\nAs the brand experiences rapid growth and expands around the globe, it requires a platform that delivers scalability, agility and flexibility and with the advanced functionality to support this growth with a real-time, unified view of the business performance across markets. In addition, it has to be able to seize new market opportunities, establishing local subsidiaries quickly and easily, trading in local currencies and aggregating into its preferred base currency at its UK parent company.\n\"The speed at which we're developing is incredible. We needed a business platform that could keep up with and help drive our business. NetSuite OneWorld is that platform,\" said James Houston , Operations Director for Charlotte Tilbury .\nWhy NetSuite?\nCharlotte Tilbury joins other successful businesses in the health & beauty sector that have turned to NetSuite to transform their business including Baylis and Harding, Epicuren Discovery, Anisa International, The Beauty Collective and Natural Labs.\n\"We underwent a rigorous process in our search for a long-term business partner to support our explosive growth,\" Houston continued. \"We needed the right balance between a user-friendly solution and one with deep functionality. NetSuite gave us an extensive demonstration of its functionality and it matched our business requirements and ambitions, perfectly.\"\nWith support for 190 currencies, 19 languages, and automated tax compliance in over 50 countries, NetSuite OneWorld is Charlotte Tilbury's business management solution of choice that can help the company achieve:\nReal-time global financial consolidation. NetSuite OneWorld can provide real-time visibility across all of Charlotte Tilbury's subsidiaries, divisions and business units with a single financial system of record. Rapid expansion. NetSuite OneWorld's powerful international capabilities can enable the business to quickly and easily establish new entities as the brand continues to expand globally. Flexible and powerful customisation and integration capabilities. NetSuite's SuiteCloud development platform provides flexible customisation tools to meet the business' needs and power integration capabilities that allow the company to integrate NetSuite OneWorld with other applications such as Dell Boomi, Adaptive Planning and DemandCaster, providing a single phase implementation that can allow Charlotte Tilbury to benefit from one platform to power its entire business. Significant savings in IT costs, over-heads and complexity. NetSuite's proven, secure cloud solution can eliminate the hassles of managing, maintaining and upgrading business applications. Real-time analytics and reporting. NetSuite's dashboards, reporting and analytical tools can enable Charlotte Tilbury to monitor, report and analyse each animation, event and product launch. The management team will also be able to quickly access the P&L for each activity to help them better evaluate and plan. About Charlotte Tilbury\nCharlotte Tilbury knows more than anyone that when you look good, you feel good and exude confidence. You carry yourself differently and, in turn, the World reacts to you in a different way. At the age of thirteen, Charlotte personally discovered the transformative power of make-up. Since then, she has been helping others – starting with her school friends to the most discerning women around the world today – look their most beautiful. Charlotte believes that beauty is not an exclusive club. Make-up is every woman's secret weapon, enabling her to dial up her natural assets and dial down the imperfections we all have to become her most beautiful and confident self. But as a busy woman herself, Charlotte knows that using this weapon must be easy and fool-proof from how you buy it to how you use it. Charlotte has created an uncompromising collection for a modern woman who is as likely to do her makeup on the run with a mobile phone in hand as she is to sit down at a vanity table. By decoding her expertise into essential make-up tricks, tips and tools that are EASY TO CHOOSE, EASY TO USE and IRRESISTIBLE, Charlotte is determined to revolutionise beauty.\nToday, more than 24,000 companies and subsidiaries depend on NetSuite to run complex, mission-critical business processes globally in the cloud. Since its inception in 1998, NetSuite has established itself as the leading provider of enterprise-ready cloud business management suites of enterprise resource planning (ERP), customer relationship management (CRM), and ecommerce applications for businesses of all sizes. Many FORTUNE 100 companies rely on NetSuite to accelerate innovation and business transformation. NetSuite continues its success in delivering the best cloud business management suites to businesses around the world, enabling them to lower IT costs significantly while increasing productivity, as the global adoption of the cloud accelerates.\nFollow NetSuite's Cloud blog , NetSuite's Facebook page and @NetSuiteEMEA Twitter handle for real-time updates.\nFor more information about NetSuite, please visit www.netsuite.co.uk .\nNOTE: NetSuite and the NetSuite logo are service marks of NetSuite Inc. Third-party trademarks mentioned are the property of their respective owners.\nLogo - http://photos.prnewswire.com/prnh/20090924/SF81218LOGO-b\n 4:00 AM EDT Tags: SOFTWARE - APPLICATION TECHNOLOGY", "external_links": ["http://www.netsuite.com/portal/uk/resource/articles/cloud-computing.shtml", "http://www.netsuite.co.uk/", "http://www.facebook.com/netsuite", "http://photos.prnewswire.com/prnh/20090924/SF81218LOGO-b", "http://www.twitter.com/netsuiteemea", "http://www.suitecommerce.com/", "http://www.netsuiteblogs.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=EN36598&Transmission_Id=201510230400PR_NEWS_EURO_ND__EN36598&DateId=20151023", "http://www.netsuite.com/portal/uk/products/netsuite/erp.shtml", "http://www.charlottetilbury.com/us", "http://www.netsuite.com/portal/products/oneworld.shtml"], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T13:02:41.094+03:00", "highlightTitle": ""}