{"organizations": [], "uuid": "6abbe984443f82ea91e6532bd3bb00b5bf683f06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gizmag.com", "main_image": "http://img.gizmag.com/dominos-delivery-expert-pizza-delivery-vehicle-2.jpg?fit=max&h=594&rect=253%2C105%2C1398%2C786&w=1060&s=4612cfa60bf7087f21f87ae2df1db263", "site_section": "http://www.gizmag.com/xml/", "section_title": "Gizmag Emerging Technology Magazine", "url": "http://www.gizmag.com/dominos-dxp/40019/", "country": "US", "title": "Domino's cooks up the perfect pizza delivery vehicle", "performance_score": 0, "site": "gizmag.com", "participants_count": 1, "title_full": "Domino's cooks up the perfect pizza delivery vehicle", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:13:00.000+03:00", "replies_count": 0, "uuid": "6abbe984443f82ea91e6532bd3bb00b5bf683f06"}, "author": "Stu Robarts", "url": "http://www.gizmag.com/dominos-dxp/40019/", "ord_in_thread": 0, "title": "Domino's cooks up the perfect pizza delivery vehicle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Gallery (5 images) \nLots of pizza parlours claim to make the best slice, but few could claim to deliver it as well as Domino's now can. The firm has unveiled a \"first-of-its-kind, purpose-built pizza-delivery vehicle\" called the Domino's Delivery Expert (DXP) that has a built-in oven to keep your stuffed crust piping hot. \nBelieve it or not, the DXP isn't just a marketing gimmick. The design and production of the DXP took over three years and included a crowdsourced design competition that launched in 2013 and was run by Local Motors . The Ultimate Delivery Vehicle Challenge received a total of 385 entries, with input from Domino's employees, customers and automotive designers from around the world. \nThe \"design\" stage generated ideas that would help delivery drivers to do their job as easily as possible and the \"packaging\" stage determined what vehicle the DXP would be based on. The following \"interior\" and \"surfacing\" stages focused on what features the DXP would have inside and how it would look outside. Finally, the \"rendering\" stage brought the design to life with the production of photorealistic renderings. \nFollowing the completion of design competition, the concept was then taken forward to development, with the final vehicle based on a Chevrolet Spark. It was felt that the 1.2-liter engine and automatic transmission of the Spark would make it fun and easy to drive, while also delivering a favorable 39 mpg (7 l/100 km) on the highway. An OnStar navigation system is fitted to give drivers turn-by-turn directions. \nThe DXP has a built-in oven that can be heated up to 140° F (60° C) to keep pizzas warm and is designed for easy loading and unloading. It is accessible to drivers only via the touch of a key fob to ensure the precious cargo remains secure. The oven can hold two of Domino's Heatwave bags and the DXP can accommodate up to 80 pizzas in total. \nThe DXP has also been designed to provide plenty of storage space. There is only one seat, for the driver, with the passenger side given over to extra storage compartments. These are variously designed to stabilize pizzas and secure other items such as drinks and sauces. There are also front and rear storage areas with non-slip, easy-to-clean surfaces. \nElsewhere, the DXP features a side-mounted light to illuminate sidewalks, as well a light on top of the vehicle that is switched on to indicate that the vehicle is making a delivery. Every DXP can also be personalized to include such things as the name of its driver, its call sign and its home base. \nDomino's is in the process of rolling out 100 DXPs across the US, including in Boston, Dallas, Detroit, Houston, Indianapolis, New Orleans, San Diego and Seattle.", "external_links": [], "published": "2015-10-23T16:13:00.000+03:00", "crawled": "2015-10-23T17:57:08.109+03:00", "highlightTitle": ""}