{"organizations": [], "uuid": "a846373ebd93067a25f32ebede8ce45887636f1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/266385/technology-general", "section_title": "Technology Press Releases from PRWeb - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30349630/certiport-names-2015-autodesk-certified-user-world-champions-from-brazil-and-usa", "country": "US", "title": "Certiport Names 2015 Autodesk Certified User World Champions from Brazil and USA", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Certiport Names 2015 Autodesk Certified User World Champions from Brazil and USA - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T18:11:00.000+02:00", "replies_count": 0, "uuid": "a846373ebd93067a25f32ebede8ce45887636f1d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30349630/certiport-names-2015-autodesk-certified-user-world-champions-from-brazil-and-usa", "ord_in_thread": 0, "title": "Certiport Names 2015 Autodesk Certified User World Champions from Brazil and USA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Inaugural Competition Recognizes Students with Marketable 2D and 3D Design Skills\nSalt Lake City, Utah (PRWEB) October 26, 2015\nCertiport ( http://www.certiport.com ), a Pearson VUE business, the leading test delivery solution provider for the global workforce and academic markets, today announces the 2015 Autodesk Certified User World Champions . The inaugural global online competition recognizes students with marketable 2D and 3D design skills who submitted a project and passed any of the following Autodesk Certified User certification exams: Autodesk Certified User - AutoCAD®, Autodesk Certified User - Inventor®, Autodesk Certified User - Revit Architecture, Autodesk Certified User - 3ds Max, or Autodesk Certified User – Maya.\nThe 2015 Autodesk Certified User World Champions are:\nKatiúcia Fontana Alano, Brazil, Architectural Design Challenge: Disaster Relief Housing Hayden Gosting, USA, Manufacturing Design Challenge: All Terrain Bicycle Asafe Souza, Brazil, 3ds Max or Maya: Digital Story Telling\n“We were impressed with the caliber of the projects submitted in the very first Autodesk Certified User World Championship, and we look forward to growing this competition over the next few years,” said Craig Bushman, vice president of marketing for Certiport. “ACU is a valuable certification that prepares students for the workforce and validates their Autodesk skills with a respected industry credential. These students went the extra mile to enter the competition and we congratulate them and look forward to watching their future success.”\nThe three champions have won a paid-trip to attend Autodesk University in Las Vegas, December 1-3, 2015.\nThe Autodesk Certified User World Championship aligns with Autodesk’s “ Design the Future ” program and the continued transformation of Autodesk’s education business model in order to fulfill its mission of helping students and educators imagine, design and create a better world. The “Design the Future” program makes available $250 million of 3D design software, project-based curricula, training and certification to every middle and high school in the United States in 2014.\nCareer and technical education programs across the United States equip students with marketable 2D and 3D design skills by teaching them to use state-of-the-art Autodesk design software. Autodesk Certified User certification confirms students have the skills necessary to continue their design careers—whether they attend college, enter the workforce or work toward additional levels of industry certification after graduation.\nFor more information about the Autodesk Certified User exams, visit http://www.certiport.com/autodesk . For more information about the 2015 Autodesk Certified User World Championship, visit http://www.ACUChampionship.com .\nAbout Certiport\nCertiport, a Pearson VUE business, is the leading provider of certification exam development, delivery and program management services delivered through an expansive network of over 13,000 Certiport Authorized Testing Centers worldwide. Certiport manages a sophisticated portfolio of leading certification programs including: the official Microsoft Office Specialist certification program, the Microsoft Technology Associate certification program, the Microsoft Certified Educator program, the Adobe® Certified Associate certification program, the Autodesk Certified User certification program, the Intuit QuickBooks Certified User certification program, and the IC3 Digital Literacy certification. Certiport reliably delivers over three million tests each year throughout the secondary, post-secondary, workforce, and corporate technology markets in more than 148 countries and 27 languages worldwide. For more information, please visit http://www.certiport.com or follow Certiport on Twitter at http://www.twitter.com/certiport .\n\"Certiport\" and \"IC3\" are registered trademarks of Certiport, Inc. in the United States and other countries. The names of actual companies and products mentioned herein may be the trademarks of their respective owners.\nFor the original version on PRWeb visit: http://www.prweb.com/releases/2015/10/prweb13041464.htm\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .", "external_links": ["http://www.certiport.com/autodesk", "http://www.autodesk.com/DesignTheFutureUS", "http://www.prweb.com/releases/2015/10/prweb13041464.htm", "http://www.twitter.com/certiport", "http://www.acuchampionship.com/"], "published": "2015-10-26T18:11:00.000+02:00", "crawled": "2015-10-26T18:29:23.903+02:00", "highlightTitle": ""}