{"organizations": [], "uuid": "7b5eeeafcb3ac7a2d18f5f932a5239942b801f9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "http://s3.reutersmedia.net/resources/r/?m=02&d=20151025&t=2&i=1089714310&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXNPEB9O0LM", "site_section": "http://www.reuters.com/news/technology", "section_title": "Technology News | Reuters.com", "url": "http://www.reuters.com/article/2015/10/25/us-valeant-pharms-lawsuit-idUSKCN0SJ11820151025", "country": "US", "title": "Legal tangle in California may shed light on specialty pharmacies", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Legal tangle in California may shed light on specialty pharmacies | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:20:00.000+02:00", "replies_count": 0, "uuid": "7b5eeeafcb3ac7a2d18f5f932a5239942b801f9c"}, "author": "David Ingram", "url": "http://www.reuters.com/article/2015/10/25/us-valeant-pharms-lawsuit-idUSKCN0SJ11820151025", "ord_in_thread": 0, "title": "Legal tangle in California may shed light on specialty pharmacies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK As Valeant Pharmaceuticals prepares to defend its drug sales practices to Wall Street on Monday, new details are emerging about the tangled relationships - and litigation - among Valeant’s specialty pharmacy partners.\nThe court cases, which have drawn media attention in recent days, are expected to be addressed during Monday morning's investor call, a person familiar with the matter said. Valeant lost more than 30 percent of its market value this past week as the company disclosed details of its relationship to a Pennsylvania-based pharmacy called Philidor Rx Services.\nSpecialty pharmacies are designed to handle medicines that require complex storage or administration, often for serious conditions such as cancer or rheumatoid arthritis. Valeant has used Philidor to dispense a range of its medications, including conventional treatments for acne and toenail fungus.\nInfluential short-seller Citron Research accused the drugmaker of using Philidor to create \"phantom sales\" of its products or push more product through distribution channels than sales would warrant, an allegation that Valeant has denied outright.\nAlthough the two companies are separate legal entities, Valeant said last week that it holds a right to purchase Philidor, which in turn said that it holds the right to acquire control of other affiliated pharmacies.\nPhilidor has not addressed questions of its sales practices. It said last week that it works with a network of pharmacies and provides them with call center functions, help with insurance claims, technical support and “certain management services.”\nOne of those affiliates is R&O Pharmacy based in California, which has been in a heated dispute with Valeant, Philidor and a related holding company for more than three months.\nR&O sued Valeant in federal court in California on Oct. 6, after receiving a demand letter from Valeant for more than $69 million, money that R&O said it didn’t owe. R&O said in court documents that it informed Valeant after receiving the payment demand that either Valeant was conspiring to perpetrate a fraud on R&O, or both companies were the victims of fraud by a third party.\nEven earlier, beginning in July, R&O owner Russell Reitz demanded that Philidor end certain practices that Reitz said were illegal, including use of R&O'S pharmacy identification numbers to bill health insurers, according to court documents.\nThe correspondence went on through the summer, culminating in a separate lawsuit in California state court brought against R&O by a Delaware holding company named Isolani.\nThe lawsuit, filed on Sept. 8, stated that Isolani had purchased a stake in R&O and an agreement to acquire full ownership, and that R&O subsequently breached a management services agreement entered into at the same time.\nThe suit alleged that R&O was unlawfully withholding more than $15 million in payments it had received from health insurers and others that belonged to Isolani. R&O alleges that Isolani is a front for Philidor, the court documents show.\nLawyers for Isolani, a lawyer for R&O, multiple officials at Philidor and spokespeople for Valeant did not respond to repeated requests for comment.\nThe state lawsuit brought by Isolani and the federal lawsuit brought by R&O are both at early stages, and there have been no rulings in either case.\nInvestment banking advisory firm Evercore drew attention to the state court case in a note to clients on Thursday. Evercore said it was hard to have a definitive view on whether what Philidor was doing was \"kosher or not,\" and it asked whether Valeant could be on the hook for any potential fine against Philidor.\nPhilidor itself is not a party to either of the two lawsuits. But R&O’s attorney, Gary Kaufman, filed copies of correspondence in the state court suit, in which his client raised concerns about Philidor’s actions and called for terminating R&O’s agreements with Isolani.\nOn Aug. 31, Kaufman sent a letter to a lawyer for Isolani alleging that Isolani and Philidor were engaging in a \"massive fraud.\"\nHe said Philidor had targeted R&O for acquisition in 2014 because Philidor needed access to valuable multi-state pharmacy licenses and payer contracts, and had subsequently used R&O’s provider numbers “to bill payers for prescriptions dispensed by Philidor.” Philidor last week said it has a contractual right to acquire R&O “subject to regulatory approval.”\nShares of Valeant rebounded somewhat on Friday after four days of steep losses. Shares closed up 5.7 percent for the day at $116.16 in trading in New York, still far short of the nearly $170 per share at which it began the week.\n(Reporting by David Ingram; Additional reporting by Edward Krudy ; Editing by Michele Gershberg and Sue Horton)", "external_links": [], "published": "2015-10-26T02:20:00.000+02:00", "crawled": "2015-10-26T01:38:07.985+02:00", "highlightTitle": ""}