{"organizations": [], "uuid": "129583e0477d8060eb74c801da41c4588fead362", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/16631cb4-5487-4257-9fa7-72b8150dd740.img", "site_section": "http://www.ft.com/rss/companies/technology", "section_title": "Technology", "url": "http://www.ft.com/cms/s/0/1f71d0d6-7327-11e5-a129-3fcc4f641d98.html?ftcamp=published_links%2Frss%2Fcompanies_technology%2Ffeed%2F%2Fproduct", "country": "US", "title": "Dorsey’s Square to test tech IPO demand", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Dorsey’s Square to test tech IPO demand", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:40:00.000+03:00", "replies_count": 0, "uuid": "129583e0477d8060eb74c801da41c4588fead362"}, "author": "", "url": "http://www.ft.com/cms/s/0/1f71d0d6-7327-11e5-a129-3fcc4f641d98.html?ftcamp=published_links%2Frss%2Fcompanies_technology%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Dorsey’s Square to test tech IPO demand", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dorsey", "Jack Dorsey", "Leslie Hook"], "text": "Jack Dorsey’s Square to test tech IPO demand Leslie Hook in San Francisco ©AFP Jack Dorsey \nSquare, the San Francisco payments start-up led by Jack Dorsey , has filed for an initial public offering on the New York Stock Exchange, kicking off a process that could see it formally list in just over a month. \nSquare is braving the IPO market at a time when other tech IPOs have struggled. This year has been the slowest for tech IPOs in the US since 2009, with just 22 new listings so far, according to Dealogic. More Start-up unlocks solution for homeowners \nPure Storage, which went public last week, saw its share price drop below the levels of its earlier private fundraising during its first days of trading. First Data, a payments processor, priced what could be the largest offering of the year at $16 a share on Wednesday, below its initial range of $18-$20. \nSquare’s decision to pursue a listing also came days after Mr Dorsey took a second role at Twitter, the messaging company he co-founded. With questions hanging over Square regarding how well he can juggle the two roles , Square’s prospectus includes the warning that “this may at times adversely affect his ability to devote time, attention, and effort to Square”. \nMr Dorsey is Square’s biggest shareholder, with a quarter of the company’s equity. “We’ve built one of the fairest and most efficient payments businesses in the world,” he wrote in an upbeat letter included in the prospectus. \nOther Square investors and directors include Lawrence Summers, former US Treasury secretary, and Earvin “Magic” Johnson, the former basketball player. \nSquare: Boxed in \nRead more \nThe company reported adjusted net revenues of $199m during the first six months of this year, which excludes payment processing costs and revenues from a deal with Starbucks . Adjusted revenues rose 67 per cent from the same period the year before. \nRead more \nWhile a pricing range has not yet been set, Square’s series E fundraising was completed in 2014 at a price of $15.46 per share, implying a valuation of around $6bn. Such deals typically come with terms that are favourable to investors, and do not necessarily equate to a public market valuation. \nFounded in 2009, Square was one of the first companies to launch credit card readers that small merchants could plug in to a smartphone or a tablet. However the payment market today is crowded and margins are razor thin, as payment processors compete to provide the best rates. Amazon, Groupon and PayPal are among the companies that offer payments processing for merchants. \n“Square squandered its first-mover advantage as the moat around the business built on a disruptive application and a slick device began to dissipate,” wrote Manhattan Venture Partners in a research report. The IPOs prospectus shows that Square’s transaction costs eat up two-thirds of its transaction revenue. \nThe fastest-growing part of the company is Square Capital, which provides cash advances to merchants who use Square, charging them fees that are the equivalent of a 40 per cent annualised interest rate or more. Square Capital, along with other software and data services, saw revenue jump tenfold during the first six months of this year, from the same period a year ago. \nMost of Square’s customers are small businesses, with nine out of 10 sellers processing less than $500,000 annually. \nSquare’s net losses narrowed to $77.6m during the first six months of this year, down 2 per cent from the same period a year ago. One big source for the company is its arrangement with Starbucks , under which Square processes Starbucks payments at losses that ran to $28m last year. That arrangement is changing soon however, and will cease entirely next year. \nA Square spokesperson declined to comment. Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-10-15T01:40:00.000+03:00", "crawled": "2015-10-15T16:03:22.836+03:00", "highlightTitle": ""}