{"organizations": [], "uuid": "b7dad50a0c24109cc2a54b000a1e65ecdf890df4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/i6StWbRfLBTw/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/technology", "section_title": "Technology - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-23/the-cloud-is-raining-cash-on-amazon-google-and-microsoft", "country": "US", "title": "The Cloud Is Raining Cash on Amazon, Google, and Microsoft", "performance_score": 9, "site": "bloomberg.com", "participants_count": 1, "title_full": "The Cloud Is Raining Cash on Amazon, Google, and Microsoft - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T08:30:00.000+03:00", "replies_count": 0, "uuid": "b7dad50a0c24109cc2a54b000a1e65ecdf890df4"}, "author": "Jack Clark", "url": "http://www.bloomberg.com/news/articles/2015-10-23/the-cloud-is-raining-cash-on-amazon-google-and-microsoft", "ord_in_thread": 0, "title": "The Cloud Is Raining Cash on Amazon, Google, and Microsoft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Amazon.com, Google, and Microsoft all topped profit estimates last quarter, highlighting the widening gulf between companies that deliver computing via server-laden warehouses and a generation of latecomers to the cloud boom. Together, the three companies added more than $90 billion in market cap in after-hours trading following their earnings reports on Thursday.\nThe trio shares a reliance on technology that comes from powerful machines lashed together in bunkers the size of football fields. These data centers are capable of providing a broad range of services at a low cost—be it Microsoft&apos;s personal and business software, Amazon&apos;s e-commerce and computing power, or Google&apos;s Web search and advertising algorithms. Contrast that with technology firms, such as IBM, Hewlett-Packard, EMC, and Oracle, which are suffering from slowing growth or declines as cloud operators shun traditional hardware, software, and services.\nGoogle, Microsoft, and Amazon get added revenue as they become sellers of computing power to a growing number of other companies on the hunt for low-cost alternatives. Compounding that, the large clouds don&apos;t buy as much hardware and software from traditional IT providers and also pull potential customers away by renting them the IT services they&apos;d typically buy from IBM, HP, EMC, Oracle, and others.\n\"You are seeing the cloud shift everyone was talking about, and Microsoft and Amazon are benefiting from it,\" said Sid Parakh, a portfolio manager at Becker Capital Management, which has about $3 billion under management. \"Oracle, IBM, even VMware are reporting very weak numbers and really no momentum in cloud.\"\nAmazon reported sales on Thursday that beat analysts&apos; estimates . Driving that performance was its Amazon Web Services division, which grew 78 percent from a year ago with sales of $2.09 billion. That helped the company report a profit when analysts had predicted a loss.\nMicrosoft, which is moving more users of Office and other corporate productivity tools to versions hosted online through its own server farms, reported profit and sales that also beat estimates . Revenue in a segment called \"intelligent cloud\" was $5.89 billion, exceeding an estimate of $5.72 billion based on the average of four analyst projections compiled by Bloomberg.\n\"While many companies are developing commercial cloud offerings, there are really only two driving enterprise cloud platform innovation at massive scale: Amazon and Microsoft,\" Microsoft Chief Executive Officer Satya Nadella said on a conference call discussing the company&apos;s results.\nDon&apos;t count Google out. Its parent company Alphabet is selling more ads and keeping spending under control, fueling better-than-projected sales and profit last quarter, the company said on Thursday. That enabled it to continue beefing up its cloud division, Google CEO Sundar Pichai said on the earnings call. \"We&apos;re investing a lot and playing for the long term,\" he said. \"When I look at new customer adoption, we&apos;re seeing tremendous momentum.\"\nAt IBM, the future doesn&apos;t look so bright. Shares dropped to a five-year low after the company cut its profit forecast earlier this week. The company cited a looming global economic slowdown and a strong dollar as factors hurting its overseas business. Another issue, which the company didn&apos;t bring up, is that the biggest players in cloud build much of their own equipment and write much of their own code.\nEMC, which agreed to merge with fellow legacy hardware company Dell, reported sales and earnings that met analysts’ relatively low expectations amid slowing demand for its storage devices. Hewlett-Packard recently partnered with Taipei&apos;s Foxconn Technology Group to produce low-cost servers to be sold to providers like Google and announced this week that it would shut down its own public cloud service by early 2016.\nEven Oracle, which is known for the stability of its business in tough times, is running into trouble as sales of its new software and hardware fall while it tries to convert customers to the cloud. Earlier this month, Amazon announced a slew of tools and services designed to make it easier for businesses to move from Oracle&apos;s software to Amazon&apos;s own cloud.\nThere&apos;s no end in sight for this trend—or at least, that&apos;s what one of the early leaders thinks. \"It just reflects a secular shift,\" said Google&apos;s Pichai. \"Every business in the world is going to run on cloud eventually.\"", "external_links": ["http://assets.bwbx.io/images/iu02ll3i.Sio/v1/460x260.png\\"], "published": "2015-10-23T08:30:00.000+03:00", "crawled": "2015-10-23T03:40:28.214+03:00", "highlightTitle": ""}