{"organizations": [], "uuid": "de53d617b4f975e68b643bfd3bc9befdd1933a93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/10/07/13010665/Store05_Persp-07-2015.jpg", "site_section": "http://www.prweb.com/rss2/techmobile.xml", "section_title": "Technology: Mobile", "url": "http://www.prweb.com/releases/2015-vxi-blueparrott/visions-electronics/prweb13010665.htm", "country": "US", "title": "VXi Corporation Agreement with Visions Electronics", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "VXi Corporation Announces Agreement with Visions Electronics", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "de53d617b4f975e68b643bfd3bc9befdd1933a93"}, "author": "Kimberly Schuman", "url": "http://www.prweb.com/releases/2015-vxi-blueparrott/visions-electronics/prweb13010665.htm", "ord_in_thread": 0, "title": "VXi Corporation Agreement with Visions Electronics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VXi Corporation today announced a new retail partnership with Visions Electronics in Canada. Visions Electronics will carry the entire line of VXi’s BlueParrott Bluetooth® headsets at its 32 stores across Canada. BlueParrott: All They’ll Hear is You\nVXi BlueParrott is the acknowledged leader in Bluetooth headsets for road warriors and mobile professionals. Vastly superior sound quality and noise canceling, combined with roadworthy reliability has made BlueParrott the headset choice of truck drivers and mobile professionals everywhere. The programmable VXi BlueParrott B350-XT, for example, delivers the unsurpassed audio that BlueParrott is famous for, plus an array of advanced technologies like its customizable Parrott Button™ that users can program on the go to perform an array of functions.\nFor fans of a smaller form factor, the extendable-boom VXi BlueParrott Reveal™ gives users the noise-canceling flexibility they need in any environment. The most recent addition to the BlueParrot line is the Point™ , the sound choice for crystal-clear sound in a super-small package.\n“We’re excited about our new partnership with Visions Electronics,” said Mike Ferguson, president and CEO of VXi. “It gives our BlueParrott brand a significantly larger retail presence across western Canada—and gives Canadian mobile professionals easier access to the headsets that are #1 with truckers everywhere.”\n“VXi BlueParrott’s reputation is second to none,” said Rick Stewart, CEO of Visions Electronics. “Our goal is 100% customer satisfaction, and we know that VXi BlueParrott shares that dedication. So Visions Electronics is happy to partner with them and bring their highly-regarded headsets to our customers, in our stores and online.”\nAbout VXi Corporation\nVXi provides the best-performing headsets, telecommunications and speech recognition solutions for the benefit of mobile professionals, small and large businesses, and contact centers around the world. From Bluetooth® to Unified Communications, they meet the highest global standards for product quality and service, backed by the industry’s best warranties. VXi designs, markets, sells and supports their products from Dover, New Hampshire, and takes pride in delivering value, excellence and innovation. That is why VXi is The Sound Choice™. Learn more at vxicorp.com.\nAbout Visions Electronics\nWith retail locations in all major markets in Manitoba, Saskatchewan, Alberta and British Columbia, Visions Electronics is dedicated to being recognized as the Best Name in Electronics in Canada. In addition to its retail operations, Visions Electronics services the wholesale market with Visions Business Solutions, and ships products all across Canada via its website, visions.ca.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52eGljb3JwLmNvbS9wcm9kdWN0cy9ibHVlcGFycm90dC1ibHVldG9vdGgtbW9iaWxlLXNvbHV0aW9ucy9ibHVlcGFycm90dC1wb2ludC8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52eGljb3JwLmNvbS9wcm9kdWN0cy9ibHVlcGFycm90dC1ibHVldG9vdGgtbW9iaWxlLXNvbHV0aW9ucy92eGktYmx1ZXBhcnJvdHQtYjM1MC14dC8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52eGljb3JwLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52aXNpb25zLmNhLw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52eGljb3JwLmNvbS9wcm9kdWN0cy9ibHVlcGFycm90dC1ibHVldG9vdGgtbW9iaWxlLXNvbHV0aW9ucy9yZXZlYWwv"], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T22:00:11.417+03:00", "highlightTitle": ""}