{"organizations": ["Siebel", "SAP", "Accenture Federal Services Location", "PeopleSoft"], "uuid": "e34bd216abcadf9c83234c182c567ccdcadea65e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.informationtechnologycrossing.com", "main_image": "http://www.employmentcrossing.com/images/employmentcrossinglogo-200x200.jpg", "site_section": "http://www.informationtechnologycrossing.com/rssfeed/xml/rssjobs.WI.xml", "section_title": "Information Technology Jobs in  | InformationTechnologyCrossing.com", "url": "http://www.informationtechnologycrossing.com/lcjsjobdetail.php?akey=a56ac45d7f6eb27b1b89126592c2dca5", "country": "US", "title": "Federal - Performance Test Admin - USA-TX-San Antonio", "performance_score": 0, "site": "informationtechnologycrossing.com", "participants_count": 0, "title_full": "Federal - Performance Test Admin - USA-TX-San Antonio", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T08:00:00.000+03:00", "replies_count": 0, "uuid": "e34bd216abcadf9c83234c182c567ccdcadea65e"}, "author": "", "url": "http://www.informationtechnologycrossing.com/lcjsjobdetail.php?akey=a56ac45d7f6eb27b1b89126592c2dca5", "ord_in_thread": 0, "title": "Federal - Performance Test Admin - USA-TX-San Antonio", "locations": ["US", "San Antonio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Federal - Performance Test Admin','00339620','!*!Organization: Accenture Federal Services Location: San Antonio, TXJoin Accenture and help transform leading organizations and communities around the world. The sheer scale of our capabilities and client engagements and the way we collaborate, operate and deliver value provides an unparalleled opportunity to grow and advance. Choose Accenture, and make delivering innovative work part of your extraordinary career. Accenture people build careers in four different areas of our business: Consulting, Technology, Operations and internal Corporate Functions. Each area offers a unique career experience and a compelling mix of work and training opportunities, work environment and structure for career progression.Technology professionals implement and lead highly complex technology projects. Working with clients, they design, develop and deliver innovative technology solutions that drive high performance. These professionals may build, test, install and maintain software across a variety of projects and industries, working with leading enterprise applications such as SAP, Siebel, PeopleSoft and Oracle or with custom-built applications, and they are involved in a wide range of challenging global technology projects. The Testing System Associate performs planning and execution of end-to-end client-based testing including Product test, Production Test, Schools Testing, and Intersystem Testing (IST). Overall Responsibilities include:Planning and executing test scriptsDeveloping functional knowledge in system applicationsDeveloping deep skills in testing mechanics Creating detailed test scripts using approved requirements, design, testing standards, and data inputCoordinating with the Development teams’ Functional and Programmer analysts in the validation of requirements and design while creating the Test Plan and ScriptsSubmitting scripts to peer and supervisor review process and presenting scripts to FSA for approval before executionIdentifying data required for executionLogging any deviations from script steps during execution to support proper QA and client reviewWorking with development teams to resolve design issues discovered during testing phasesCommunicating software issues to the development teams Coordinating environment usage and job scheduling with other test team membersRemain focused upon continuous improvement of the testing process through the use of automation tools, training, and quality/peer reviews Continue to develop own industry, functional, technical, and administrative skillsExecutes test scripts from detailed steps and scenariosFollows defined defect management process','!*!Basic Qualifications: 2 year Associate's Degree with emphasis in Technology (MIS, Computer Science, etc.) or 4 year Degree US Citizen – no dual citizenshipGood communication (written and oral) and interpersonal skillsPreferred skills and qualifications:", "external_links": [], "published": "2015-10-10T08:00:00.000+03:00", "crawled": "2015-10-16T22:28:19.681+03:00", "highlightTitle": ""}