{"organizations": [], "uuid": "1f65adf8c2a1df8e59659d6bcca059a818acc0d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/new-test-predicts-relapse-testicular-cancers", "country": "US", "title": "New Test Predicts Relapse of Testicular Cancers", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "New Test Predicts Relapse of Testicular Cancers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f65adf8c2a1df8e59659d6bcca059a818acc0d7"}, "author": "Institute of Cancer Research", "url": "http://www.mdtmag.com/news/2015/10/new-test-predicts-relapse-testicular-cancers", "ord_in_thread": 0, "title": "New Test Predicts Relapse of Testicular Cancers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Scientists have developed a new test to identify patients who are at risk of suffering a relapse from testicular cancer.\nAssessing just three features of a common kind of testicular cancer - called non-seminomatous germ cell tumor - can identify those at most at risk of relapse even where there is no evidence of tumor spread.\nThe researchers believe the test could be used in the clinic to make decisions about which patients should be given chemotherapy.\nScientists at The Institute of Cancer Research, London, analyzed 177 tumor samples from patients with stage I non-seminomatous tumors enrolled in clinical trials through the Medical Research Council (MRC) Clinical Trials Unit.\nThe work was funded by the MRC with support from the National Cancer Research Institute Testis Cancer Clinical Studies Group, and is published in Clinical Cancer Research.\nScientists at The Institute of Cancer Research (ICR) found that three different features of the tumors were important indicators of relapse risk: the levels of a molecule called CXCL12, the percentage of the tumor with an appearance of cancer stem cells and whether or not blood vessels were present in the tumor.\nThey scored tumors based on these features, and found that combining scores could divide patients up into three different risk groups based on how likely patients were to suffer a relapse of the disease within two years. It is rare for a patient to relapse from testicular cancer beyond this time.\nThey found that the vast majority of patients were in the low-risk group - where 94.3 per cent of patients were relapse free for two years. In the moderate-risk group 65.9 per cent of patients were relapse free. Strikingly, only 30 per cent of patients were relapse free in the high-risk group.\nThe researchers were able to validate the test in an additional group of 80 patients at The Royal Marsden NHS Foundation Trust.\nTesticular germ cell tumors are the most common solid malignant tumor in young Caucasian men. Patients diagnosed with early-stage disease face a choice between monitoring with treatment if relapse does occur or upfront chemotherapy with its associated long-term side-effects. Predicting who does or does not need chemotherapy up front is therefore important to minimize treatment in this largely curable disease.\nStudy leader Professor Janet Shipley, Professor of Cancer Molecular Pathology at The Institute of Cancer Research, London, said:\n\"Our research has led to the development of a test that can detect patients that will benefit from treatment up front and spare those who are at lower risk from the side-effects of chemotherapy.\n\"Chemotherapy is extremely effective in treating testicular cancer, but it can have long-term consequences for a patient's health and wellbeing. Patients deemed at low risk of relapse could simply be monitored and potentially could avoid chemotherapy. Approaches such as this to minimize chemotherapy are particularly important for cancers like testicular cancer, which affect young adults who could live with the side-effects for decades.\"\nProfessor Robert Huddart, Professor of Urological Cancer at The Institute of Cancer Research, London, and Consultant at The Royal Marsden NHS Foundation Trust, said:\n\"Patients with stage 1 non-seminomatous germ cell tumors have to make a difficult choice of whether to be watched or to receive chemotherapy to reduce the risk of relapse. Our study may help men make this decision as among the three groups of patients identified we have found one with a very low risk of relapse where surveillance would seem to be best choice and a small group of men who have a very high risk of relapse who could be targeted with chemotherapy. We now need to test this prognostic index in larger groups of men in the clinic.\"", "external_links": [], "published": "2015-10-19T03:00:00.000+03:00", "crawled": "2015-10-20T00:35:20.978+03:00", "highlightTitle": ""}