{"organizations": [], "uuid": "5f003c298587b7cb95a0915ab7c8cde08f1098c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mdtmag.com", "main_image": "", "site_section": "http://www.mdtmag.com", "section_title": "Medical Design Technology | The Medical Design Engineer’s Resource for Products &amp; Technologies", "url": "http://www.mdtmag.com/news/2015/10/first-clinical-rapid-oral-hpv-test-development", "country": "US", "title": "First Clinical Rapid Oral HPV Test in Development", "performance_score": 0, "site": "mdtmag.com", "participants_count": 1, "title_full": "First Clinical Rapid Oral HPV Test in Development", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "5f003c298587b7cb95a0915ab7c8cde08f1098c0"}, "author": "University of North Carolina Health Care System", "url": "http://www.mdtmag.com/news/2015/10/first-clinical-rapid-oral-hpv-test-development", "ord_in_thread": 0, "title": "First Clinical Rapid Oral HPV Test in Development", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A UNC Lineberger Comprehensive Cancer Center researcher is working to fight a growing type of head and neck cancer by partnering to develop a rapid oral test for HPV, a virus linked to cancer.\nJennifer Webster-Cyriaque, PhD, DDS, a UNC Lineberger member and a professor in the University of North Carolina School of Medicine and UNC School of Dentistry, is a co-investigator with Sunnyvale, Calif.,-based InSilixa Inc. for the development of a rapid oral HPV test. They plan to use company technology to adapt a test originally developed in Webster-Cyriaque’s lab so that it can detect oral HPV at the time that a patient comes in for care.\n“Right now, there isn’t a U.S. Food and Drug Administration-approved test for oral HPV that’s usable in the clinical setting,\" Webster-Cyriaque said. \"So the potential for this test is significant.\"\nInSilixa Inc. has won a $224,764 Phase I Small Business Innovation Research grant from the National Institutes of Health to support the test’s development. The company plans to use its proprietary, semiconductor-based biochip technology to develop the rapid test.\n“We are very pleased that the NIH continues to support development of the InSilixa platform; in this instance as a potential new tool to screen oral specimens such as saliva for cancer-causing HPV types and to risk-stratify those persons found to be positive,” said Gary Schoolnik, MD, chief medical officer for InSilixa, in a prepared statement in a company release.\nThe Pap smear is used to screen for cervical cancer, and last year, the FDA approved the first HPV test for primary cervical cancer screening. To-date, there is no FDA-approved test for HPV in the mouth and throat, Webster-Cyriaque said. And while some types of HPV are present in both cervical and oral cancer, she said the subtype spectrum is different in the oral cavity.\n“There is no oral HPV test, and persistence of high risk HPV types is an important risk factor for cancer development,” she said. “So this test would detect HPV in oral fluids – saliva – and that would be selective for types of the virus that are higher-risk for causing oral cancer.”\nIn the United States, there has been growth in the incidence of HPV-linked oropharyngeal cancer, which is a type of head and neck cancer that occurs at the back of the throat and base of the tongue.\nAccording to a 2011 study that drew on data from the National Cancer Institute Surveillance, Epidemiology and End Results program, HPV prevalence in oropharyngeal cancers grew 225 percent from 1988 to 2004, while the incidence of HPV negative cancers dropped by half. 1 The annual count of HPV-positive oropharyngeal cancers was expected surpass the annual number of cervical cancers by 2020 if the trend continued, the study also found.\nThe test that InSilixa will work to develop originates from a lab-based test developed in Webster-Cyriaque’s lab. 2 The lab-based test was used in a phase II clinical trial through the Oral HIV-AIDS Research Alliance/AIDS Clinical Trials Group.\nThe test is designed to identify which strains of HPV are present, and whether a person has a high or low risk for causing oral cancer.\nReferences\n1 Chaturvedi, AK, Engels EA, Pfeiffer RM et al, “Human papillomavirus and rising oropharyngeal cancer incidence in the United States,” Journal of Clinical Oncology 29 (2011): 32.\n2 William T. Seaman et al, “Detection and quantitation of HPV in genital and oral tissues and fluids by real time PCR,” Virology Journal, 7 (2010): 194.", "external_links": [], "published": "2015-10-01T03:00:00.000+03:00", "crawled": "2015-10-02T01:38:11.881+03:00", "highlightTitle": ""}