{"organizations": [], "uuid": "371b648997a372718a37dac2323ca37ccb7b2d78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.morningstar.com", "main_image": "", "site_section": "http://news.morningstar.com/all/dow-jones/technology.aspx", "section_title": "News Archive: Technology", "url": "http://news.morningstar.com/all/dow-jones/technology/201510209433/free-services-make-the-internet-a-privacy-nightmare-security-researcher-says.aspx", "country": "US", "title": "Free Services Make the Internet a Privacy Nightmare, Security Researcher Says", "performance_score": 0, "site": "morningstar.com", "participants_count": 1, "title_full": "Free Services Make the Internet a Privacy Nightmare, Security Researcher Says", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "371b648997a372718a37dac2323ca37ccb7b2d78"}, "author": "morningstar.com", "url": "http://news.morningstar.com/all/dow-jones/technology/201510209433/free-services-make-the-internet-a-privacy-nightmare-security-researcher-says.aspx", "ord_in_thread": 0, "title": "Free Services Make the Internet a Privacy Nightmare, Security Researcher Says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Danny Yadron\nLAGUNA BEACH, Calif.-- Mikko Hypponen, a Finnish security researcher wary of U.S. spies, really wanted to avoid American technology companies. He quickly realized he couldn't.\nSpeaking Tuesday at The Wall Street Journal's technology conference, WSJD Live, Mr. Hypponen, the chief research officer at F-Secure Corp., lamented that the Internet has irreparably become a privacy nightmare through reliance on \"free\" services that make money from profiling users for showing them targeted ads.\n\"I really tried getting rid of Google,\" he said. \"You can't avoid Google. We are way beyond that.\"\nFor instance, someone sent Mr. Hypponen a link to an online video during his vow of non-Googleness. The video was on YouTube. YouTube is owned by Google, which is now known as Alphabet Inc.\nFor the security researcher, it isn't that Google, Facebook Inc. or other American technology companies make bad products. But Mr. Hypponen said he wonders what the Internet would look like had technology companies not become so reliant on profiling and targeted ads. In one alternate scenario, he said, users would pay small amount, perhaps a half-cent, each time they read an article online.\n\"When the Web was young, it wasn't obvious how were going to pay for content,\" he said. \"We've now grown a whole generation of people that assume this is the way it's supposed to be.\"\nMr. Hypponen spoke at WSJD Live one day after National Security Agency Director Adm. Michael Rogers and Apple Inc. Chief Executive Tim Cook offered contrasting views on encrypted data, user privacy and national security.\nAs a foreign national, Mr. Hypponen also noted he is also nervous using American tech services because he fears it leaves him more exposed to Mr. Rogers's NSA, which vacuums up troves of data seeking clues for investigations.\nU.S. law places restrictions on scooping up data on American users in such collection, but it doesn't cover foreigners like Mr. Hypponen.\nA Google spokesman didn't immediately respond to a request for comment.\nA quick search online shows Mr. Hypponen has accounts with Facebook, LinkedIn Inc. and Twitter Inc.\nWrite to Danny Yadron at danny.yadron@wsj.com\n 20, 2015 15:54 ET (19:54 ", "external_links": ["http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Checked.gif", "http://s7.addthis.com/static/btn/sm-share-en.gif", "http://www.addthis.com/bookmark.php?v=250", "http://im.mstar.com/Im/Mbr/Form_PremCheckbox_Unchecked.gif"], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-21T07:16:39.721+03:00", "highlightTitle": ""}