{"organizations": [], "uuid": "3bd10887ec9c6848692283e4cda09268ccf6db16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessspectator.com.au", "main_image": "", "site_section": "http://www.businessspectator.com.au/technology", "section_title": "Technology | Business Spectator", "url": "https://www.businessspectator.com.au/news/2015/10/22/technology/youtube-red-offers-ad-free-subscription-offline-videos-music-service", "country": "US", "title": "YouTube Red offers ad-free subscription, offline videos, music service", "performance_score": 0, "site": "businessspectator.com.au", "participants_count": 1, "title_full": "YouTube Red offers ad-free subscription, offline videos, music service | Business Spectator", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T23:14:00.000+03:00", "replies_count": 0, "uuid": "3bd10887ec9c6848692283e4cda09268ccf6db16"}, "author": "AFP", "url": "https://www.businessspectator.com.au/news/2015/10/22/technology/youtube-red-offers-ad-free-subscription-offline-videos-music-service", "ord_in_thread": 0, "title": "YouTube Red offers ad-free subscription, offline videos, music service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Robert Kyncl, YouTube Chief Business Officer, speaks as YouTube unveils \"YouTube Red,\" a new subscription service. Credit: AP Photo/Danny Moloshok\nYouTube has announced a new paid-subscription service that will eliminate advertisements as the video service behemoth looks to better tap its vast commercial potential.\nYouTube, which is owned by search engine giant Google and claims more than one billion users worldwide, also announced an expanded music platform and original movies in a bid to encourage subscribers.\nThe new service, called YouTube Red, will offer commercial-free access for $US9.99 a month starting on October 28, initially only in the United States, but coming soon to Australia.\nYouTube Red will also let subscribers save videos to watch later on their computers or smartphones, even when they lack internet connections.\nThe traditional YouTube site backed by commercials will remain available and free.\n“YouTube Red marks an evolution in our desire to give fans more choice and features that they love and a much better experience,” Robert Kyncl, YouTube’s chief business officer, told a launch event in Los Angeles that was broadcast to its New York office.\nOriginally created by three young entrepreneurs as a way to swap videos, YouTube was bought by Google for $US1.65 billion in 2006 and is now the world’s third most visited website after Google itself and Facebook.\nYouTube also announced a new YouTube Music app, hoping to draw more dedicated users amid the rapid growth of music streaming. While YouTube is notorious for its chaotic array of videos, YouTube Music — to launch at an unspecified date later this year — will function much like a streaming platform, with organised channels that provide videos of each artist.\nYouTube Music, designed after the company offered the YouTube Music Key test platform, will also make it possible to listen solely to the music without videos, a feature aimed in part at users who want to keep listening when driving.\nKyncl credited YouTube with reviving music videos, making them a vital force for artists to promote their work.\n“We want to take that to the next level and provide a way for artists and fans to connect,” he said, voicing hope that YouTube Music would become a “primary destination for music.” Spotify remains the leader in music streaming, but newcomers Apple Music and Tidal have sought to win over users in part by offering video content.\nYouTube Music will be free with commercials.\nSubscribers to Google Play Music, the parent company’s audio streaming service, will automatically receive YouTube Red and vice versa.\nIn hopes of drawing subscribers to the paid tier, YouTube said it was developing movies and series exclusive to YouTube Red. The original programming will initially focus on content from providers who have made their name on YouTube.\nKyncl said that YouTube would share the “vast majority” of its revenue to creative partners but declined to go into details. YouTube has long come under fire from the music and other creative industries, who say that artists are rarely compensated for content uploaded from non-official sources.", "external_links": ["http://resources.newscdn.com.au/cs/australian/frameworks/prefab/latest/public/img/metros/australian/thumbnail-loading-650x366.png)", "http://resources3.news.com.au/images/2015/10/22/1227577/953287-ef7cdcba-7838-11e5-b642-5d72264fdbf2.jpg"], "published": "2015-10-22T23:14:00.000+03:00", "crawled": "2015-10-22T18:13:39.225+03:00", "highlightTitle": ""}