{"organizations": ["Reuters"], "uuid": "92f970a06ca812f04647ceb84c8bd2686f3d0b6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/c184b38c-8b47-44ae-bc8c-5fd76ff95caa.img", "site_section": "http://www.ft.com/rss/companies/technology", "section_title": "Technology", "url": "http://www.ft.com/cms/s/0/ff15c29e-6baa-11e5-aca9-d87542bf8673.html?ftcamp=published_links%2Frss%2Fcompanies_technology%2Ffeed%2F%2Fproduct", "country": "US", "title": "Dorsey’s Twitter return raises concerns", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Dorsey’s Twitter return raises concerns", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T13:58:00.000+03:00", "replies_count": 0, "uuid": "92f970a06ca812f04647ceb84c8bd2686f3d0b6e"}, "author": "", "url": "http://www.ft.com/cms/s/0/ff15c29e-6baa-11e5-aca9-d87542bf8673.html?ftcamp=published_links%2Frss%2Fcompanies_technology%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Dorsey’s Twitter return raises concerns", "locations": ["San Francisco"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dorsey", "Jack Dorsey", "Leslie Hook"], "text": "Jack Dorsey’s Twitter return raises concerns over focus on Square Leslie Hook in San Francisco ©Reuters \nWhen Starbucks signed an agreement with Square to use its mobile payment app in its US coffee shops three years ago, it was hailed as the big debut for the then small payments start-up. \nBut that partnership quietly foundered last year, as the promise of millions of customers using the Square app to pay for caffe lattes never materialised. Square Wallet, the mobile app featured in the partnership, was shut down and Howard Schultz, Starbucks chief executive, resigned from the Square board after one year. More Octopus to launch $140m ‘growth’ fund \nSquare is now a $6bn company on the verge of going public. The Starbucks partnership is largely forgotten but it illustrates some of the company’s key challenges — and the many questions which remain over its focus. Concerns are also mounting after Jack Dorsey, the company’s co-founder and chief executive, was appointed permanent chief executive of Twitter , his other start-up, on Monday. \nFor Square, having a part-time CEO has come at an inconvenient time. For two years it has been undergoing a difficult transition from being a consumer-facing payments app — the original dream behind the Starbucks partnership — to being an enterprise-facing company, whose fastest-growing services include providing capital to small businesses and selling subscriptions to business analytics software. \n“Square kept playing around with consumer-facing products, but every single one of those products has been killed,” says Zach Goldstein, founder of Thanx, a loyalty rewards company. \nPayments processing still provides most of Square’s revenue. Manhattan Venture Partners forecasts that the company will process $42bn in payments this year, generating $1.5bn in payments revenues — up 40 per cent from last year. \nIn 2010, when Square launched its first card reader, a white plastic device that connects to an iPad or an iPhone, it was one of the first such products available for small merchants, such as food trucks or farmers’ market stalls. But rising competition has put this business under threat, with rival payments processors from bigger companies such as Amazon and PayPal offering lower per-transaction fees. \nThere are also questions over how much longer merchants will rely on swiping credit cards, as mobile payments software such as Stripe and Braintree become more commonplace, and bricks-and-mortar stalls are replaced by online stores. More video \nOne of the bright spots for investors is Square Capital, which provides finance to small businesses in exchange for a fee that is repaid over time, similar to a loan. The service, launched in May 2014, has handed out more than $225m, and is lending money at a rate of $1m per day. People close to the company say that Square Capital is highly profitable, adding that its rapid growth in recent months has helped propel Square towards profitability. \nContinue reading \nThe return on these capital advances can be handsome: a $10,000 cash advance profiled on the Square Capital website generates a fee of 13 per cent. That is analogous to an annualised interest rate of more than 40 per cent, assuming the cash advance is repaid over four months. Yet Square is a relative late-comer to the boom in small business lending services: companies such as PayPal, Lending Club, OnDeck and Prosper all have fast-growing small business credit programmes as well. \nMr Dorsey issued a kind of manifesto for Square in a tweet on Monday. “Square stands for economic empowerment. We stand for financial systems that serve instead of rule. We stand for levelling the playing field.” \nHowever, the dramatic shifts the company has undergone in the past five years — from consumer-facing app to small business lender — suggest that there may be more pivots to come. \nSquare recently branched into food delivery, buying food-delivery company Caviar, and is expanding its enterprise software offerings. Some analysts worry about a lack of focus. “They have experimented with a lot of tangential business lines, and most of them haven’t worked out that well,” says Max Wolff, chief economist at Manhattan Venture Partners. \nBeing chief executive will only become harder with an IPO, as the company’s business model will be under even closer public scrutiny. Square filed confidentially for an IPO this year to test the waters, and may publicly reveal its prospectus this autumn. Square kept playing around with consumer-facing products, but every single one of those products has been killed \n- Zach Goldstein, founder of loyalty rewards company Thanx \nSquare has already raised nearly $600m from investors, but some venture capitalists believe it may be preparing to tap the public markets now because private interest has dried up. At a time when companies such as Uber, the ride-hailing app, are delaying IPOs because of plentiful private funding, Square is doing the opposite. \n“No one wants to pay a huge price any more from the private side for Square,” says one venture capitalist, who is not an investor in Square. “This may have been the best way for them to get money.” \nSquare’s investors range from well-known venture capital firms such as Sequoia and Kleiner Perkins to institutional investors including GIC and Silicon Valley heavyweights such as Yahoo chief executive Marissa Mayer. Those willing to go on the record put a positive spin on Mr Dorsey splitting his time between Twitter and Square. \n“I think this will raise the profile of Square and open up new partnership opportunities,” says Essam Abadir, chief executive of Aspire Ventures. As a chief executive, “you don’t have to be a full-time operator, you have to be a full-time visionary”. Square’s investors can only hope that is enough. \nAdditional reporting by Kadhim Shubber Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-10-06T13:58:00.000+03:00", "crawled": "2015-10-06T15:36:52.348+03:00", "highlightTitle": ""}