{"organizations": [], "uuid": "e93c2f150eb9cd268644e0a15ad4575f5b1796fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "phys.org", "main_image": "http://cdn.phys.org/newman/gfx/news/hires/2015/hundredsofne.jpg", "site_section": "http://www.physorg.com/rss/physorg-appl.xml", "section_title": "Phys.org - latest science and technology news stories", "url": "http://phys.org/news/2015-10-hundreds-species-fragile-eastern-himalayan.html", "country": "US", "title": "Hundreds of new species discovered in the fragile Eastern Himalayan region", "performance_score": 0, "site": "phys.org", "participants_count": 0, "title_full": "Hundreds of new species discovered in the fragile Eastern Himalayan region", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T13:08:00.000+03:00", "replies_count": 0, "uuid": "e93c2f150eb9cd268644e0a15ad4575f5b1796fb"}, "author": "", "url": "http://phys.org/news/2015-10-hundreds-species-fragile-eastern-himalayan.html", "ord_in_thread": 0, "title": "Hundreds of new species discovered in the fragile Eastern Himalayan region", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sanjay Sondhi"], "text": "Hundreds of new species discovered in the fragile Eastern Himalayan region October 5, 2015 Credit: Sanjay Sondhi \nA sneezing monkey, a walking fish and a jewel-like snake are just some of a biological treasure trove of over 200 new species discovered in the Eastern Himalayas in recent years, according to a new report by WWF. \nThe report, Hidden Himalayas: Asia's Wonderland released on World Habitat Day maps out scores of new species found by scientists from various organizations including 133 plants, 39 invertebrates, 26 fish, 10 amphibians, one reptile, one bird and one mammal. \nThe volume and diversity of discoveries, 211 in total between 2009 and 2014, highlight the region as one of the most biologically diverse places on Earth; the discoveries listed equating to an average of 34 new species discovered annually for the past six years. \n\"I am excited that the region – home to a staggering number of species including some of the most charismatic fauna – continues to surprise the world with the nature and pace of species discovery,\" said Ravi Singh, CEO of WWF-India and Chair of the WWF Living Himalayas Initiative. \nSome of the most striking discoveries include a vibrant blue dwarf 'walking' snakehead fish, which can breathe atmospheric air and survive on land for up to four days, although moving in a manner much clumsier than a slithering snake. The report details an unfortunate monkey whose upturned nose leads to a sneeze every time the rain falls, and a living gem - the bejeweled lance-headed pit viper, which could pass as a carefully crafted piece of jewellery. \nThe report also underscores the dire threats facing the vibrant ecosystems across a region spanning Bhutan, north-east India, Nepal, north Myanmar and the southern parts of Tibet. The report found that as a consequence of development, only 25% of the original habitats in the region remain intact and hundreds of species that live in the Eastern Himalayas are considered globally threatened. Credit: Liang Zhang \nThe region is currently facing a wide range of threats and pressures, with climate change by far the most serious. Population growth, deforestation, overgrazing, poaching, the wildlife trade, mining, pollution and hydropower development have all contributed to the pressures on the fragile ecosystems in the region, the report says. \n\"The challenge is to preserve our threatened ecosystems before these species, and others yet unknown are lost,\" said Sami Tornikoski leader of the WWF Living Himalayas Initiative. \n\"The Eastern Himalayas is at a crossroads. Governments can decide whether to follow the current path towards fragile economies that do not fully account for environmental impacts, or take an alternative path towards greener, more sustainable economic development,\" said Tornikoski. Credit: Henning Strack Hansen \nThe stakes are high as the Himalayas are home to at least 10,000 plant species, 300 mammal species, 977 bird species, 176 reptiles, 105 amphibians and 269 types of freshwater fish. In addition to this, between 1998 and 2008 in the Eastern Himalayas, at least 354 new species were discovered. \nIn a bid to protect the region's rich diversity of flora and fauna, WWF is actively involved in supporting the countries of the Eastern Himalayas' progress towards green economies that value ecosystems and the services they provide to the millions of people in the region. Located in one of the most ecologically fragile regions on Earth, the WWF Living Himalayas Initiative urges a strong regional collaboration to ensure that people in this region, live within the ecological means and remain within the boundaries of one planet.", "external_links": [], "published": "2015-10-05T13:08:00.000+03:00", "crawled": "2015-10-05T13:11:28.811+03:00", "highlightTitle": ""}