{"organizations": [], "uuid": "4627b1290c5360e1fd3e3d3416303438f244683d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.emirates247.com", "main_image": "http://cdn-wac.emirates247.com/polopoly_fs/1.606012.1444271543!/image/3513275615.jpg", "site_section": "http://www.emirates247.com/cmlink/en/mobile-technology-1.512834?localLinksEnabled=false", "section_title": "Mobile Technology", "url": "http://www.emirates247.com/business/technology/is-this-where-the-world-s-biggest-apple-store-is-opening-in-dubai-2015-10-08-1.606011", "country": "US", "title": "Is this where the world's biggest Apple Store is opening in Dubai?", "performance_score": 0, "site": "emirates247.com", "participants_count": 1, "title_full": "Is this where the world's biggest Apple Store is opening in Dubai?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T05:32:00.000+03:00", "replies_count": 0, "uuid": "4627b1290c5360e1fd3e3d3416303438f244683d"}, "author": "Vicky Kapur", "url": "http://www.emirates247.com/business/technology/is-this-where-the-world-s-biggest-apple-store-is-opening-in-dubai-2015-10-08-1.606011", "ord_in_thread": 0, "title": "Is this where the world's biggest Apple Store is opening in Dubai?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is this where the world's biggest Apple Store is opening in Dubai? Dubai’s Mall of the Emirates declines to comment, but… By Published Thursday, October 08, 2015 \nIt is no secret that Apple is preparing to soon open the doors of the world’s biggest Apple Store in Dubai, but both the mall as well as Apple itself prefer it to remain a secret until the final announcement. \nApple fans were disappointed when Mall of the Emirates recently revealed its Dh1bn Evolution 2015 extension minus the fabled Apple Store. \nWe asked Michael Cesarz, the Chief Executive Officer of Shopping Malls at Majid Al Futtaim Properties, about why Apple Store wasn’t part of the exhaustive line-up of chic stores that opened last week on Level 2 of the mall. \n“Nice try, but we will not comment,” he smiled when asked the reason for the delay in the opening of the Apple Store. \nCesarz explained that he “will not comment because it leads to speculation.” \nWell, if only he (or Apple) would clarify it, there won’t be any reason for speculation! \nNevertheless, even as the mall official remained tight-lipped about the timing or indeed a confirmation on the Apple Store opening in the Mall of the Emirates, there remain a handful of big stores on the new level that remain barricaded and haven’t opened their doors yet. \nA source, however, told us that the new store is being set up as you read this, on the first floor in the area that used to house Vox Cinemas. \nVox cinemas, of course, have now moved to their new location on Level 2, freeing up the massive area (estimated at 50,000 square feet) which rumour says is to be occupied by Apple. \nBehind the barricaded façade of Shop 277, work is going on at a rapid pace to open the world’s biggest Apple Store, said the source who did not wish to be named. \nApple is notorious for being tight-lipped about its future moves, be it new devices or store openings. With the Dubai store rumoured to be the world’s biggest, there is more reason for it – and its partners – to maintain the secrecy. \nAnd while there had been speculation earlier that the Apple Store was set to open in August or along with the reveal of Evolution 2015, the fact that Vox Cinemas only moved out of the previous location on September 28, 2015, it is only now that actual work on the site would have started. \nIf the source is correct and given the expertise of Dubai engineers to create splendid buildings in practically no time, it should not take Apple more than a few weeks to ready the store for the grand unveil. \nThe Middle East and indeed the UAE is one of Apple’s fastest growing markets. \nAccording to the Q2 2015 report from the UAE’s Telecommunications Regulatory Authority (TRA), the iPhone 6 is the most commonly used smartphone in the UAE, comprising 4.9 per cent of total handsets registered on UAE networks. \nIn fact, various iterations of the iPhone occupy three slots among the Top 5 smartphones in UAE and six slots among the Top 10 smartphones in the UAE. Interestingly, offerings from arch-rival Samsung feature on the remaining slots. \nThe iPhone 5s is the second most popular smartphone in the UAE (previously the most popular handset), with 3.5 per cent of the market share. \nThe third most commonly used smartphone was the Galaxy S Duos (2.9 per cent), followed at #4 by the iPhone 5 (2 per cent), and at #5 by Samsung S III (1.8 per cent). \n#6 Samsung Note 3 LTE (1.5 per cent) \n#7 iPhone 6 Plus (1.3 per cent) \n#7 Samsung S4 LTE (1.3 per cent) \n#9 iPhone 4S (1.2 per cent) \n#10 iPhone 4 (0.9 per cent) \nIn addition, TRA data shows that Apple iTunes was by far the most commonly visited apps website by UAE smartphone users, followed by Samsung Apps, BlackBerry App World, Android Applications and, finally, Nokia OVI. \nThe TRA highlighted that the number of visits to BlackBerry and Nokia applications websites has been declining over time while the volume of visits to Apple iTunes and Samsung has been progressively increasing. Share with a friend or colleague Your e-mail address:", "external_links": [], "published": "2015-10-08T05:32:00.000+03:00", "crawled": "2015-10-08T06:31:59.720+03:00", "highlightTitle": ""}