{"organizations": [], "uuid": "ece53d366247856706e4f9c39d6e2662baa3e29b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freshnews.com", "main_image": "", "site_section": "http://freshnews.com//news/technology/feed", "section_title": "FreshNews.com - Technology News", "url": "http://www.freshnews.com/news/1144357/run-jump-and-launch-cakes-as-steve-aoki-speedy-ninja-update", "country": "US", "title": "Run, Jump And Launch Cakes As Steve Aoki in Speedy Ninja Update", "performance_score": 0, "site": "freshnews.com", "participants_count": 1, "title_full": "Run, Jump And Launch Cakes As Steve Aoki in Speedy Ninja Update", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T16:15:00.000+03:00", "replies_count": 0, "uuid": "ece53d366247856706e4f9c39d6e2662baa3e29b"}, "author": "admin", "url": "http://www.freshnews.com/news/1144357/run-jump-and-launch-cakes-as-steve-aoki-speedy-ninja-update", "ord_in_thread": 0, "title": "Run, Jump And Launch Cakes As Steve Aoki in Speedy Ninja Update", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Submitted by admin on 10/22/2015 @ 6:15 AM Companies mentioned in this article: NetEase, Inc. \nBRISBANE, Calif. -- (BUSINESS WIRE) -- NetEase, Inc. (NASDAQ: NTES ) today announced that Grammy-nominated DJ and Producer Steve Aoki is now available as a playable character in Speedy Ninja for iPhone, iPad, iPod touch, and Android. Players will need to update their app in order to find and unlock Steve Aoki under the selectable character list of ninjas. Speedy Ninja is a fast-paced endless runner that challenges players to navigate perilous forests and dodge bizarre objects with the help of custom characters, weapons, and power-ups. \nAoki will sport his signature long hair and wield a microphone weapon, with a special DIM MAK cake power-up to help players race past their friends on the global leaderboard. Players who unlock Aoki will be able to play the character indefinitely. An additional premium skin, Neon Aoki, offers a cybernetic take on Steve Aoki as well as provide powerful abilities to destroy enemies. Neon Aoki is available for a one-time purchase of $4.99. \n“Speedy Ninja is already an amped up game; you’ve got the crazy-looking bats, flying spears, and even freakin’ dragons,” said Steve Aoki. “This is the first video game I’ve worked on and it was a total trip watching this project go from concept to launch. Download my character now and let the cakes fly!” \nWatch Steve Aoki in action in the trailer here: https://www.youtube.com/watch?v=cYMn5tjfi7w \nSpeedy Ninja is available as a free download on: Google Play: https://play.google.com/store/apps/details?id=com.netease_na.nmd2&hl=en \nAoki’s inclusion in Speedy Ninja continues his working relationship with NetEase, after headlining their 2015 PAX Prime party in August where he first announced his involvement in the game. \nFor more information about the Steve Aoki in-game activation, Speedy Ninja and NetEase North America, please visit www.netease-na.com , join us on Facebook: www.facebook.com/NetEaseOfficial , or follow us on Twitter: www.twitter.com/NetEaseOfficial . \nAbout NetEase \nNetEase, Inc. (NASDAQ:NTES) is a leading Internet technology and video game company headquartered in China. With a breadth of experience in content creation and sharing, NetEase develops and operates some of China's most popular online games (including World of Warcraft ® , Hearthstone ® : Heroes of Warcraft™ , StarCraft ® II, Heroes of the Storm™ and Diablo ® III ), e-mail services, advertising services, mobile applications and games, and web portals. The company has recently established a US office, with plans to expand their offerings by releasing mobile games for Western audiences. For more information, please visit: http://ir.netease.com/ . \nAbout STEVE AOKI \nSTEVE AOKI is a Grammy-nominated international producer/DJ, electronic dance music entrepreneur, and founder of the trendsetting record label, events/lifestyle company and apparel line Dim Mak. Since launching in 1996, Dim Mak has broken bands such as Bloc Party, The Bloody Beetroots, Klaxons, and The Gossip through deftly marketed single and full-length releases and now has nearly 500 releases to date. As a solo artist, AOKI has become a force of nature averaging over 250 tour dates per year. AOKI’s second artist album NEON FUTURE I , was released September 30, 2014 via Dim Mak/Ultra Music and features his Gold certified single “Delirious (Boneless)” with Chris Lake and Tujamo featuring Kid Ink, “Born To Get Wild” featuring will.i.am and “Rage The Night Away” featuring Waka Flocka Flame. The second part of his Neon Future album, NEON FUTURE II , was released on May 12, 2015 and features collaborations with Linkin Park, Matthew Koma, Snoop Lion, Rivers Cuomo and NERVO, plus a very special appearance by creative genius J.J. Abrams who voices the outro to close the album. AOKI is also serving as an Executive Producer and soundtrack curator of The Nerdist’s first feature film acquisition The Hive . Directed by up-and-coming writer and director David Yarovesky and produced by Cary Granat of Scream 2 and Scream 3 fame, the film was dubbed by Guardians of the Galaxy director James Gunn as “the most horrifying and disgusting love story ever.” The Hive is out now digitally. View source version on businesswire.com: http://www.businesswire.com/news/home/20151022005458/en/ Copyright © Business Wire 2015", "external_links": [], "published": "2015-10-22T16:15:00.000+03:00", "crawled": "2015-10-22T17:39:59.945+03:00", "highlightTitle": ""}