{"organizations": [], "uuid": "29a9e80f7185fd9571bfb272a77a779db04b2121", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-23/malaysia-seeks-domestic-demand-boost-in-najib-s-2016-budget", "country": "US", "title": "Malaysia Seeks Domestic Demand Boost in Najib's 2016 Budget", "performance_score": 1, "site": "bloomberg.com", "participants_count": 1, "title_full": "Malaysia Seeks Domestic Demand Boost in Najib's 2016 Budget - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T16:00:00.000+03:00", "replies_count": 0, "uuid": "29a9e80f7185fd9571bfb272a77a779db04b2121"}, "author": "Pooi Koon Chong", "url": "http://www.bloomberg.com/news/articles/2015-10-23/malaysia-seeks-domestic-demand-boost-in-najib-s-2016-budget", "ord_in_thread": 0, "title": "Malaysia Seeks Domestic Demand Boost in Najib's 2016 Budget", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malaysian Prime Minister Najib Razak is counting on domestic demand to shore up a cooling economy as global growth falters, pledging to boost consumption, spur private investment and accelerate selected public infrastructure projects next year. And he plans to achieve this without deepening the budget deficit even as oil revenue shrinks.\nThe government predicts gross domestic product will expand 4 percent to 5 percent in 2016, from 4.5 percent to 5.5 percent this year, the Ministry of Finance said in its 2015/2016 economic report released Friday as Najib began his annual budget speech. The fiscal shortfall is forecast to narrow to 3.1 percent of GDP in 2016, from a revised 3.2 percent this year.\nNajib’s administration will intensify efforts to draw foreign direct investments, build a 1,796-kilometer highway spanning the eastern Sabah and Sarawak states, boost the social safety net and enhance utilities in rural areas, according to the report.\n\"Taking into cognizance the weaker external environment, the government will implement policies that will further strengthen the resilience of the domestic economy,\" the ministry said. \"Efforts will be taken to boost consumption by raising disposable income through creating more jobs and addressing the rising cost of living.\"\nEmbattled Leader The government’s focus underscores the political and economic challenges Najib faces in keeping the nation on track to achieve high-income nation status by the end of the decade. The plunge in oil prices and a slowing global economy is hurting export earnings and government revenue, while the embattled leader faces calls to step down after a multi-million-dollar funding scandal contributed to a pullout by foreign investors from stocks and bonds and a weakening currency.\n“The challenges confronting the economy in 2015 are expected to persist in 2016,” the finance ministry said, highlighting concerns including heightened financial market volatility and a slowing Chinese economy.\nNajib reiterated a commitment to balance the budget by 2020 amid increased challenges, according to the report. The federal government debt is estimated to be 54 percent of GDP as of end-June, from 52.7 percent in 2014, and will be within the 55 percent limit in 2016, the report said.\nDelicate Balance “The government will continue to strike a delicate balance between supporting the growth momentum and ongoing reform initiatives while ensuring public finances remain sound,” Najib said in the report.\nThe ringgit strengthened 1.5 percent to 4.2207 a dollar as of 3:50 p.m. in Kuala Lumpur, following a 3.9 percent loss in the last five trading days, according to prices from local banks compiled by Bloomberg. The currency is the worst performer in Asia this year and has depreciated about 17 percent against the U.S. dollar.\nNajib is counting on a 6 percent goods and services tax started in April to offset reduced revenues from oil. The government expects to collect 27 billion ringgit from GST this year, and 39 billion ringgit in 2016, it said.\nConsumer prices are forecast to rise 2 percent to 3 percent in 2016, compared with 2 percent to 2.5 percent this year, the finance ministry said Friday. Inflation averaged 1.9 percent in the first eight months this year. Despite a weak ringgit, inflation is expected to remain benign because of low oil prices and the waning impact of GST, it said. The central bank left interest rates unchanged for a seventh meeting last month.\nAccommodative Stance “The monetary policy stance remains accommodative of economic activity,” the finance ministry said in the report. “Given the heightened uncertainties in the global environment, both external and domestic developments are closely monitored to assess their impact on macroeconomic stability and growth prospects of the economy.”\nNajib’s administration forecasts federal spending of 265.2 billion ringgit in 2016, according to the finance ministry’s report. Total expenditure for this year is estimated at 260.7 billion ringgit.\nThe government will spend 50 billion ringgit on development expenditure next year, up from an estimated 47.4 billion ringgit in 2015. Operating expenditure is projected to rise to 215.2 billion ringgit in 2016 from 213.3 billion ringgit in 2015.\nThe current account surplus is forecast to be 0.5 percent to 1.5 percent of gross national income in 2016, compared with an estimated 1.5 percent to 2.5 percent of GNI this year, the report showed. The government has urged local companies to review their asset purchases abroad and invest at home to shore up the weakening ringgit and ensure the current account remains in excess.", "external_links": [], "published": "2015-10-23T16:00:00.000+03:00", "crawled": "2015-10-23T11:20:46.036+03:00", "highlightTitle": ""}