{"organizations": [], "uuid": "01f8c728bececb7b78ab1fa254203f620b958a6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KX882_1026BA_G_20151026032221.jpg", "site_section": "http://www.wsj.com/news/world/asia", "section_title": "Asia Business, Finance &amp; Political News - The Wall Street Journal", "url": "http://www.wsj.com/articles/bangladesh-police-arrest-four-suspects-in-killing-of-italian-aid-worker-1445844591", "country": "US", "title": "Bangladesh Police Arrest Four Suspects in Killing of Italian Aid Worker", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Bangladesh Police Arrest Four Suspects in Killing of Italian Aid Worker - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T10:29:00.000+02:00", "replies_count": 0, "uuid": "01f8c728bececb7b78ab1fa254203f620b958a6f"}, "author": "Associated Press", "url": "http://www.wsj.com/articles/bangladesh-police-arrest-four-suspects-in-killing-of-italian-aid-worker-1445844591", "ord_in_thread": 0, "title": "Bangladesh Police Arrest Four Suspects in Killing of Italian Aid Worker", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS DHAKA, Bangladesh—Bangladesh arrested four suspects who allegedly said they were hired to carry out last month’s killing of an Italian citizen in the Bangladeshi capital, police said Monday.\nItalian aid worker Cesare Tavella was gunned down by motorcycle-riding assailants while jogging on the streets of the Dhaka’s diplomatic quarter. Five days later, a Japanese citizen was killed in a similar attack in northern Bangladesh.\nThe killings spooked the country’s expatriate community and threatened its fragile economy, which is heavily reliant on foreign aid and a $25 billion garment industry that supplies clothing for international brands .\nResponsibility for the attack on Mr. Tavella was quickly claimed by Islamic State, but the Bangladeshi government denied that the extremist Sunni militant group had any presence in the country. Instead, Bangladesh accused domestic Islamist militants and Islamist politicians of orchestrating the violence to destabilize the nation.\nOn Monday, Dhaka Metropolitan Police Commissioner Asaduzzaman Mia said authorities had arrested three men suspected of carrying out the killing, in addition to the owner of a motorcycle suspected of being used in the attack. They are still hunting for the alleged mastermind.\nMr. Mia said the suspects were known professional killers and were identified from closed-circuit footage from the attack site.\nThey told investigators that they were hired by “a big brother” to kill Mr. Tavella to “create chaos” in the country, Mr. Mia said.\n“We have identified that so-called ‘big brother.’ When we are able to arrest that man, it will be clear who used them” he said.\nThe attackers allegedly targeted Mr. Tavella because he was white and the suspects were promised payment for the attack, Mr. Mia said.", "external_links": [], "published": "2015-10-26T10:29:00.000+02:00", "crawled": "2015-10-26T10:20:06.514+02:00", "highlightTitle": ""}