{"organizations": ["Unilever plc", "Rio Tinto plc"], "uuid": "f70ce0dfd0d8c2a1cceeb69ff658e1beaa27365a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/3-shares-week-ahead-rio-080401374.html", "country": "GB", "title": "3 Shares For The Week Ahead: Rio Tinto plc, Unilever plc And Burberry Group plc", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "3 Shares For The Week Ahead: Rio Tinto plc, Unilever plc And Burberry Group plc", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T11:04:00.000+03:00", "replies_count": 0, "uuid": "f70ce0dfd0d8c2a1cceeb69ff658e1beaa27365a"}, "author": "", "url": "https://uk.finance.yahoo.com/news/3-shares-week-ahead-rio-080401374.html", "ord_in_thread": 0, "title": "3 Shares For The Week Ahead: Rio Tinto plc, Unilever plc And Burberry Group plc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2,791.00 +20.00 \nThe times have not been good for Rio Tinto (LSE: RIO). Struggling under the collapse of commodities prices, the diversified miner saw its share price slump by 30% in the 12 months to the end of September -- but since then there's been a 19% rebound to the £26 level. \nOn 16 October, Friday, we'll have a third-quarter operational update, which might hopefully put some meat on the bones of a recovery. At the halfway stage, Rio reported underlying earnings of $2.9bn, for a drop of 43% on the same period last year, but that was expected. We also heard that margins are stable and costs are being cut substantially. \nActual production volumes have been pretty stable, with production and shipping of iron ore actually rising steadily. On a forward P/E of around 15, Rio looks in good shape to benefit from an upswing in the commodities cycle -- but that might not be for some time yet. \nSafety in diversity \nUnilever (LSE: ULVR) has always been seen as a safe port in a storm, and over the past five years its shareholders have enjoyed a 52% share price gain together with steady dividends of around 2.5% to 3%. Some might think the current price of £27.70 per share is a bit much to pay for that, putting Unilever on a forward P/E of 21 (which is 50% above the FTSE average). \nBut people are prepared to pay for steady growth from a multinational covering a diverse range of personal products, which is expected to manifest itself in a 9% rise in EPS for the year to December 2015. And Thursday, 15 October, marks third-quarter time, when we'll get some clue as to how accurate those forecasts are. \nMe? I understand why people pay the premium, but I reckon Unilever shares are too expensive -- but then again, I've thought that for years now while they've just kept on up. \nFrom the safe to the fickle, Thursday will also bring us a first-half trading update from fashion guru Burberry (LSE: BRBY). The shares have been in a slump since late February, from when we've seen a fall of 22% to £15, even after October's mini-recovery. Nothing much has actually gone wrong at Burberry, other than annual EPS growth starting to slow -- and there's even a tiny fall forecast this year before a return to 10% growth penciled in for next. \nAnother China casualty? \nThe slowdown in Chinese growth is part of the change in sentiment, as that's been Burberry's key growth market, with Chinese lovelies wanting to be seen in little else, it seems. And we've seen the inevitable dash for the door when the growth star starts to lose just a little of its glitter -- but the shares are still trading on a relatively lofty forward P/E of 19, which suggests investors are banking on a restart of the growth engine. \nBut fashion is fashion, and that's even harder to predict than short-term stock market movements, so it's definitely not one for me -- wildly gyrating shares like Burberry's are too much for my delicate constitution. \nIf you're looking for growth ideas with real potential, our hot new report identifies 1 Top Small-Cap Stock From The Motley Fool that's looking good. \nIt's a smaller company that has already rewarded its shareholders with a stonking performance, yet the Motley Fool's top analysts reckon there could be a further 45% upside to come . \nWant to know the name of this potential small-cap winner? Just click here to get your completely free report today . \nAlan Oscroft has no position in any shares mentioned. The Motley Fool UK owns shares of and has recommended Unilever. The Motley Fool UK has recommended Burberry. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-10T11:04:00.000+03:00", "crawled": "2015-10-10T11:10:52.968+03:00", "highlightTitle": ""}