{"organizations": [], "uuid": "25d3595b8d80b2b13e90e77444ab1768108d2c6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/647*432/7265673.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/business/finance", "section_title": "Winnipeg Free Press: Personal Finance", "url": "http://www.winnipegfreepress.com/business/finance/enough-with-working-already-336544811.html", "country": "US", "title": "Enough with working already!", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Enough with working already! - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T06:00:00.000+03:00", "replies_count": 0, "uuid": "25d3595b8d80b2b13e90e77444ab1768108d2c6b"}, "author": "winnipegfreepress.com", "url": "http://www.winnipegfreepress.com/business/finance/enough-with-working-already-336544811.html", "ord_in_thread": 0, "title": "Enough with working already!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Don and Ida have slipped gradually into retirement. Both are collecting defined benefit pensions, yet they've continued to work -- much to Ida's chagrin.\n\"My husband and I cannot agree on when I can retire and it is starting to affect our relationship,\" says Ida, in her early 50s, working in health care.\n\nBORIS MINKEVICH / WINNIPEG FREE PRESS \n\"He has recently reduced his hours while I am still working full time.\"\nIn many ways the couple is on the same page. They would like to enjoy full retirement, together.\nBut they are concerned retiring in their mid-50s -- even with combined work-pension earnings of more than $2,000 after tax a month -- would put too much pressure on their savings. Besides their home worth about $300,000, Don and Ida have about $350,000 in RRSPs, TFSAs and other savings.\nMost of their savings are invested in low-risk term deposits.\n\"We both want to pull the pin, and we keep hearing about the $1-million rule and we're not anywhere close to that, but if we can live off $50,000 a year gross, the money we have should do us quite nicely,\" says Don, adding they might want to spend a month or two in the winter renting a place in the southern U.S. for about $1,500 a month.\n\"The sooner we can retire, the better,\" he says. \"And we don't need to leave any legacy: we would like to die broke.\"\nInvestment adviser Richard Kostycz with Credential Securities and Cambrian Credit Union says Don and Ida can achieve their retirement goals without having to \"die broke.\"\nIn fact, it's very likely that by the time Ida reaches her 90s, the couple would still have more than $450,000 in savings left.\n\"It helps they have good pensions and don't have a very ambitious income goals,\" says Kostycz, also a certified general accountant.\n\"My take is they could both retire this year -- full time -- and afford it.\"\nStill, the couple should make a few adjustments to their finances to make retirement work more in their favour.\nFor one, their current investment strategy of mostly term deposits is unlikely to provide them with the 4.8 per cent annual return on their money outlined in Kostycz's forecast.\nThe additional risk is a necessary evil if they want their money to grow faster than inflation, which he pegged at 2.5 per cent.\n\"People seem to think once they retire that they should stop investing and put all their savings into term deposits, but they need a long-term strategy that involves a balanced portfolio,\" he says.\nTo this end, he suggests Don and Ida build a portfolio comprising 60 per cent bonds and 40 per cent stocks throughout the course of much of their retirement.\nOne reason they can afford to take on slightly more risk with their investments is they already have good guaranteed sources of income from their work pensions.\n\"But this also means they don't have to take on tremendous risk investing their money either,\" Kostycz says.\n\"Maybe in their 80s, when they see their money piling up, they can dial back their equity risk. Then again, these days, who knows how long people will live?\"\nAnd for this reason, he recommends they do not take their CPP until age 65.\nWhile some advisers often recommend people draw on the program as soon as possible, Kostycz says it's not necessary in Don and Ida's situation.\n\"The reason being there is a good chance, like most people, that they will live into their 80s,\" he says.\n\"If you think you're going to die before 74, you should take CPP at age 60, but if you live into your 80s, you're going to leave a lot of money on the table.\"\nStill, if they find they would like to draw on the plan early to boost their income to fund a more active retirement in their 60s, it will not have a significant impact on their financial picture later on, he says.\n\"Based on the numbers, it's highly unlikely they would outlive their money -- if that's their concern.\"\nIn fact, Kostycz says the couple can probably go outside their spending \"perimeter\" of $42,000 net a year once retired and still make out all right later in life.\nThis is a nice option to have considering many people tend to spend more money earlier in retirement and less later when they're unable to travel as much.\nMoreover they have safety valves to ease pressure on their finances. They can choose to work part time, and later on, they can downsize from their home to a modest condominium or rent a small apartment.\nStill, Kostycz says it's unlikely they'll need to make those decisions for financial reasons.\n\"Don and Ida have plenty of options even when faced with big-ticket costs like a new roof for the home or buying a new car,\" he says. \"They have some breathing room, so they won't be living in retirement paycheque to paycheque.\"\njoelschles@gmail.com", "external_links": [], "published": "2015-10-24T06:00:00.000+03:00", "crawled": "2015-10-24T11:17:59.006+03:00", "highlightTitle": ""}