{"organizations": [], "uuid": "5c1ff673631979819dd204ac45edb5a5ae32a37e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/j/l/x/5/image.related.afrArticleLead.620x365.gk6msk.png/1443531128868.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/narrowing-of-pe-ratios-makes-it-harder-to-spot-sharemarket-bargains-20151011-gk6msk", "country": "AU", "title": "Narrowing of P/E ratios makes it harder to spot sharemarket bargains", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Narrowing of P/E ratios makes it harder to spot sharemarket bargains | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T14:02:00.000+03:00", "replies_count": 0, "uuid": "5c1ff673631979819dd204ac45edb5a5ae32a37e"}, "author": "Philip Baker", "url": "http://www.afr.com/markets/narrowing-of-pe-ratios-makes-it-harder-to-spot-sharemarket-bargains-20151011-gk6msk", "ord_in_thread": 0, "title": "Narrowing of P/E ratios makes it harder to spot sharemarket bargains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sharemarkets have been well and truly torched by the bearish sentiment sweeping global markets. Tamara Voninski Share on twitter by Philip Baker Sharemarkets have been well and truly torched by the bearish sentiment sweeping global markets and although a sell-off can create value for investors, and make it better for stock pickers, it doesn't necessarily mean it's easier for stock pickers.\nIt's still a very challenging environment for investors thanks to the narrow gap between the stocks with the highest price earnings ratios and the stocks with the lowest P/E ratios.\nWith all stocks trading at similar P/Es, it can look like there are no standout buys.\nBut it's been this way for some time.\nFor the past 21 months, the difference in valuations for stocks, or the valuation dispersion, has been very narrow.\nIndeed, it's the longest period of stocks trading at similar P/E multiples in the past 36 years, according to Credit Suisse quantitative analyst Richard Hitchens.\nThere have been periods in the past when the gap between stocks with the highest and lowest P/Es has been smaller, in 2007 and in the early 1990s, but it didn't last for as long as it has this time around.\nAt the same time the S&P/ASX 200 index is trading on a forward P/E of about 14.5 times which is in line with its long-term average, making stocks cheaper than earlier this year, when the P/E was closer to 16 times, but still no bargain.\n A driver of the narrow gap in P/Es has been investors chasing any sort of growth, and what they have been willing to pay for it, at a time when there hasn't been too much growth around at all.\nThe hunt for growth has been so strong it means the so-called cheaper stocks have had their P/E ratios inflated because investors have been willing to pay a premium for them. On the flipside, stocks that normally have a high P/E are now trading on a lower P/E, and are probably looking like better value.\nOf course, just because a stock has fallen in price doesn't make it cheap.\nBut normally professional investors will welcome any sort of major sell-off to see if it throws up any bargains for them.\nStocks are still down about 12.5 per cent from their peak in April, but are up almost 1 per cent so far in 2015.\nTrying to work out the relative value of a stock is contingent on many factors, but most importantly each investor's time frame and risk appetite are taken into account.\nAfter that, the professionals insist the trick to stock picking lies in traditional methods like valuations, earnings, interest rates, sustainable dividends and decent management.\nIt's about sensible stock picking and not just backing a company because its share price has fallen a long way.\nThe dynamics and fundamentals of a company will ultimately determine its share price.\nThat might sound like textbook stuff, but the rampant chase for yield and distinct lack of growth opportunities means the textbook has been tossed away for the past few years as investors struggle to generate enough income with interest rates so low.\nOne way to potentially guard against overpaying is to take the advice of Peter Lynch, a highly respected US fund manager who ran the Fidelity Magellan fund for more than a decade.\nHe advised investors to buy stocks where the estimated P/E is lower than the forecast EPS growth.\nAs for these periods of low dispersion for stocks, they have often been halted by the US Federal Reserve raising rates and that could happen again before 2015 draws to a close .\nHitchens has taken a look at what style of investing suits the current environment best and thinks investors should look at price, earnings and dividend momentum, as well as any companies that increase their earnings and dividends.\nCertainty of earnings and return on equity are also important points to consider.\nHe has looked at stocks in the top 100 through this prism and come up with a list that investors would do well to consider and another list they should avoid.\nStocks that get the nod include Qantas, Iluka Resources, TPG Telecom, Graincorp, Newcrest, Slater & Gordon, Magellan Finance, Treasury Wine Estate, Domino's, CSL, Medibank Private, ResMed, QBE, Orica and Cochlear.\nStocks that don't stack up so well include Fortescue Metals, BHP Billiton, ANZ, Crown, Rio Tinto, SEEK, CSR, Origin Energy, IAG, Perpetual and Woolworths.", "external_links": ["https://twitter.com/PhilABaker"], "published": "2015-10-12T14:02:00.000+03:00", "crawled": "2015-10-12T16:21:04.668+03:00", "highlightTitle": ""}