{"organizations": [], "uuid": "2b015d18ef99f25484bd57f083feca432c69dd5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/AdvertisingAgencies", "section_title": "Yahoo! Finance: Advertising Agencies Industry News", "url": "http://finance.yahoo.com/news/tracylocke-promotes-key-leaders-global-193300328.html", "country": "US", "title": "TracyLocke Promotes Key Leaders of Global Management Team", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "TracyLocke Promotes Key Leaders of Global Management Team - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "2b015d18ef99f25484bd57f083feca432c69dd5c"}, "author": "TracyLocke", "url": "http://finance.yahoo.com/news/tracylocke-promotes-key-leaders-global-193300328.html", "ord_in_thread": 0, "title": "TracyLocke Promotes Key Leaders of Global Management Team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Oct. 14, 2015 /PRNewswire/ -- TracyLocke, a global communications agency and a subsidiary of Omnicom Group Inc. ( OMC ), announced its new leadership structure with key staff promotions.\nView photo\n. In order to meet the demands of new international growth at TracyLocke, Hugh Boyle, Chief Executive Officer has promoted both James Verna and Mike Bartlett to the new role of Managing Partner. Verna, a 17-year veteran of TracyLocke, will be steering the international growth of the agency. Bartlett, entering his 11 th year with the agency, will continue to drive TracyLocke's 30-plus-year partnership with the beverage and snack giant PepsiCo.\nBoyle stated, \"From the moment I joined TracyLocke, it was very clear that Jay and Mike were crucial elements in the growth of this agency. They both have the passion, forward-thinking initiative and deep industry expertise necessary to lead our major client businesses.\"\nIn addition, Kyle Cleary, will take on the responsibility for leading TracyLocke's recently expanded Chicago office. Cleary joined TracyLocke in 2005 and he most recently served as Client Service Director on the Gatorade and First Data businesses. \nTracyLocke's network continues to expand internationally and in the U.S. now includes significant operations in Dallas, Wilton, New York, Chicago and Seattle. In order to oversee the rapid expansion of TracyLocke's global footprint, Boyle has named Maria Zanghetti as Executive Vice President of Network Operations. With over 20 years of multi-category retail marketing success, Zanghetti's operational experience will be key to managing TracyLocke's expansion.\nRounding out TracyLocke's leadership group (with their new titles) are:\nTyler Murray, Chief Strategy Officer \nStewart Campbell, Global Chief Financial Officer \nStephen Miller, Dallas Office General Manager \nKryslyn Burks, Dallas Office Associate General Manager\nMike Lovegrove, President and Chief Creative Officer of TracyLocke, said, \"We believe shopper marketing is the next great canvas for creativity and innovation. The management team that Hugh and I have put together ensures that we are very well positioned to partner with our clients at this exciting time for our industry and deliver the best work across the globe.\nAbout TracyLocke \nFounded in 1913, TracyLocke is a rapidly expanding global communications agency that believes in the power of design thinking to inspire people to buy and act. TracyLocke has offices in North America and international locations including Europe, Asia and Australia. Named a Top-5 Shopper Marketing Agency since 2008, TracyLocke has clients including PepsiCo, SC Johnson, Pfizer, Pizza Hut, Hewlett-Packard, Samsung and T-Mobile. TracyLocke is part of Omnicom Group Inc. ( OMC ). For more information, visit www.tracylocke.com . \nMedia Contact: \nMichael Kelly \nCommunications Director, TracyLocke \nPhone: 214.259.3839 \nEmail: michael.kelly@tracylocke.com \nPhoto - http://photos.prnewswire.com/prnh/20151014/276930 \n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/tracylocke-promotes-key-leaders-of-global-management-team-300159807.html \nProfessional Services Consumer Discretionary Mike Bartlett", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T23:30:20.481+03:00", "highlightTitle": ""}