{"organizations": [], "uuid": "f283294f1833332086e6210a33968a0c6f6e3f02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/k/d/o/x/v/image.related.articleLeadwide.620x349.gkde53.png/1445318839208.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/property/woolworths-shops-for-buyers-for-six-centres-worth-180m-20151020-gkde53.html", "country": "AU", "title": "Woolworths shops for buyers for six centres worth $180m", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Woolworths shops for buyers for six centres worth $180m", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "f283294f1833332086e6210a33968a0c6f6e3f02"}, "author": "", "url": "http://www.smh.com.au/business/property/woolworths-shops-for-buyers-for-six-centres-worth-180m-20151020-gkde53.html", "ord_in_thread": 0, "title": "Woolworths shops for buyers for six centres worth $180m", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Woolworths Seville in Victoria is part of a portfolio being sold and leased back by the supermarket giant through CBRE.\nSupermarket giant Woolworths plans to capitalise on the demand for retail property with the sale and leaseback of a collection of neighbourhood shopping centres throughout Australia, valued at about $180 million.\nInvestors are drawn to the food-anchored shopping centres which generate high-margin sales from non-discretionary tenants that perform better than their apparel-based counterparts in all economic cycles.\nIn the full-year results for the major shopping centre landlords, food tenants were the strongest performers, with supermarket sales outpacing the departments.\nNeighbourhood centres also showed a strong lift in sales growth in high-density residential developments, where occupiers didn't have cars so visited local supermarkets more frequently rather than doing a big weekly shop at a larger mall.\nAdvertisement The six Woolworths-anchored properties on offer are a mix of recently completed and partially developed retail assets in Seville and Selandra​ Rise in Victoria; Cornubia in Queensland; Mandurah​ and Dalyellup​ in Western Australia; and Bakewell in the Northern Territory.\nAs part of its capital management program – and against the backdrop of the ferociously competitive supermarket sector – Woolworths has divested more than $2.8 billion worth of property assets since mid-2010, including the creation of the Shopping Centres Australasia Property Group in 2012 and the sale of 54 freehold properties by ALH Group in September 2014.\nCBRE's national director, retail investments, Peter Rossi​, who is advising on the sale, said the campaign was expected to generate significant interest from local investors, syndicators and institutions wanting to secure the assets either as a portfolio, individually or a combination of the Woolworths assets on offer.\nRecent CBRE data shows that $1.1 billion in neighbourhood centres changed hands in the first three-quarters of 2015, a rise of 24 per cent on the corresponding period last year.\nThe senior associate director at CBRE's Victorian retail investment division, Justin Dowers, said vendors were gaining more confidence.\n\"We are experiencing significant interest across the board from a range of private, institutional and wholesale funds all looking to secure high-quality non-discretionary retail assets before further anticipated yield compression occurs,\" Mr Dowers said.\nThe state director at CBRE Melbourne city sales, Mark Wizel​, added that activity was aided by the lending appetite of the major Australian banks as a result of improved tenant demand and growing consumer confidence.\nMr Rossi said all the assets were secured by long-term, 20-year leasebacks to Woolworths and leasing on the support tenancies was strong as the centres were in high-growth corridors.\n\"The current market for retail investments is the strongest we have seen for over a decade,\" Mr Rossi said, adding that neighbourhood centres were being targeted as private investors led the charge.\nInvestors had snapped up $7.8 billion worth of retail property in the past year in the high-end malls to take advantage of the growth in consumer spending and the safe haven approach in bricks and mortar.\nSimon Rooney, head of retail investments for JLL Australasia, said that represented a 29 per cent rise year-on-year.\nHe said retail spending within the non-discretionary food category had grown 4.7 per cent year-on-year as at May 2015, and 4.2 per cent per annum over the last five years; faster than all other major retail categories except for cafes, restaurants and takeaway food.", "external_links": [], "published": "2015-10-21T03:00:00.000+03:00", "crawled": "2015-10-20T23:00:11.647+03:00", "highlightTitle": ""}