{"organizations": ["Admiral Group plc", "BHP Billiton plc", "Vedanta Resources plc & Phoenix Group Holdings"], "uuid": "465b405c657615c41994b739c935e5856e6332a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-insurance/?format=rss", "section_title": "Insurance News | Advice | Guides - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/drawn-6-yields-bhp-billiton-072434415.html", "country": "GB", "title": "Should You Be Drawn In By 6%+ Yields At BHP Billiton plc, Admiral Group plc, Vedanta Resources plc & Phoenix Group Holdings?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Should You Be Drawn In By 6%+ Yields At BHP Billiton plc, Admiral Group plc, Vedanta Resources plc & Phoenix Group Holdings?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-17T10:24:00.000+03:00", "replies_count": 0, "uuid": "465b405c657615c41994b739c935e5856e6332a4"}, "author": "", "url": "https://uk.finance.yahoo.com/news/drawn-6-yields-bhp-billiton-072434415.html", "ord_in_thread": 0, "title": "Should You Be Drawn In By 6%+ Yields At BHP Billiton plc, Admiral Group plc, Vedanta Resources plc & Phoenix Group Holdings?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Oct 17, 2015, 12:00 BST - UK Markets closed Should You Be Drawn In By 6%+ Yields At BHP Billiton plc, Admiral Group plc, Vedanta Resources plc & Phoenix Group Holdings? By Royston Wild | Fool.co.uk – 3 hours ago \nToday I am looking at the dividend potential of four FTSE heavyweights. BHP Billiton \nThanks to the uncertain outlook for commodity markets, I believe that investors should resist the pull of gigantic yields over at BHP Billiton (LSE: BLT). The business has a proud history of building dividends even in times of severe earnings stress, and the City does not expect this trend to cease any time soon -- a proposed payment of 125 US cents per share for 2015 compares with last year's 124-cent reward, and yields a spectacular 6.8% . \nBut I believe these forecasts are in danger of missing wildly. First of all BHP Billiton's projected 44% earnings slide, to 68 cents per share, is dwarfed by the predicted dividend. There is only so far cost-cutting can mitigate the effect of dragging revenues, and with the company nursing a gigantic $24.4bn net debt pile, I reckon dividend seekers could end up severely disappointed. Admiral Group \nWith conditions in the motor insurance sector continuing to improve, I believe Admiral (LSE: ADM) should continue delivering monster dividend yields. The latest Confused.com car insurance price index released last week showed the average premium leap 4.8% during July-September, to £629, the biggest rise since 2010. This is also up 8.1% from a year ago. \nWith this bubbly outlook expected to get earnings chugging higher again from next year, Admiral is anticipated to shell out a chunky dividend of 95.5p per share in the current year, yielding a stonking 6.1% . As the insurer's focus on older drivers and safer parts of the country steadily brings down claim costs, and the business boasting market-beating retention rates, I expect payments to continue climbing along with earnings. Vedanta Resources \nLike BHP Billiton, I believe Vedanta Resources (LSE: VED) should also suffer the wrath of deteriorating resources prices. At present the number crunchers expect the metals and energy giant to fork out a dividend of 65 US cents per share in the year to March 2016, keeping its progressive payout policy chugging along and yielding a formidable 7.1% . \nHowever, an environment of subdued commodity prices is expected to result in a second year of losses in 2016, this time by 4 US cents per share. Meanwhile, Vedanta Resources' gigantic net debt pile, which rose by $500m during fiscal 2015 to a mammoth $8.5bn, is casting further doubts on dividends further out. I fully expect other miners like Vedanta and BHP Billiton to follow Glencore's lead and take the scythe to dividends thanks to the murky revenues picture. Phoenix Group Holdings \nClosed life funds provider Phoenix Group (LSE: PHNX) made the headlines in September after mentioning the prospect of another blockbuster deal in the UK life insurance sector. The business confirmed reports that it was mulling a takeover of rival Guardian Financial Services , adding that \" there are a number of potential acquisition and consolidation opportunities \" that it was considering. \nA deal would attract a valuation of around £1bn, Sky News reported, and create a group with assets under management of some £70bn. On top of this, any accord would also provide Phoenix Group's balance sheet with a solid cash injection. The City currently expects the business to pay a dividend of 53.4p per share in 2015, yielding an impressive 6.5% . Regardless of the proposed Guardian takeover, I believe the firm's dominance in the closed funds sector will keep delivering big rewards. \nBut whether or not you share my take on the payout plays mentioned above, I strongly recommend you check out this totally exclusive report that highlights an array of London-listed beauties waiting to deliver explosive shareholder returns. \nOur \" 5 Dividend Winners To Retire On \" wealth report highlights a selection of incredible stocks with an excellent record of providing juicy shareholder returns. Among our picks are top retail, pharmaceutical and utilities plays that we are convinced should continue to provide red-hot dividends. Click here to download the report -- it's 100% free and comes with no further obligation . \nRoyston Wild has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-17T10:24:00.000+03:00", "crawled": "2015-10-17T14:04:20.228+03:00", "highlightTitle": ""}