{"organizations": [], "uuid": "6de3a4cf51c149bd34aedba0b5591c6eda0dc19d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/14/102921963-fantasticfour.1910x1000.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=FOXA", "section_title": "Yahoo! Finance: FOXA News", "url": "http://www.cnbc.com/2015/10/15/fox-rumors-of-superhero-swap-with-marvel-not-true.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103081179", "country": "US", "title": "Fox: Rumors of superhero swap with Marvel not true", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "Fox: Rumors of superhero swap with Marvel not true", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "6de3a4cf51c149bd34aedba0b5591c6eda0dc19d"}, "author": "yahoo", "url": "http://www.cnbc.com/2015/10/15/fox-rumors-of-superhero-swap-with-marvel-not-true.html?__source=yahoo%7Cfinance%7Cheadline%7Cheadline%7Cstory&par=yahoo&doc=103081179", "ord_in_thread": 0, "title": "Fox: Rumors of superhero swap with Marvel not true", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The superhero rumor machine kicked into high gear on Wednesday after genre website Den of Geek reported 20th Century Fox had reached a deal that would return the \"Fantastic Four\" film rights to Disney -owned Marvel Studios. \nBut fans eager to see Disney's Avengers do battle alongside Marvel's first family shouldn't hold their breath. While the rumor has spread like wildfire on comic book news and major media websites, Fox tells CNBC the report is false. \nCiting an unnamed source, Den of Geek said Fox had decided to cut its losses after its \"Fantastic Four\" reboot bombed this summer and trade the franchise for the TV rights to the X-Men. Fox only has the film rights to the X-Men. \nDen of Geek speculated that a Marvel-developed \"Fantastic Four\" could be one of the three mystery films set for 2020 the studio announced last week. \nRead More Marvel expands movie slate with 'Ant-Man' sequel in 2018 \nDisney could not immediately be reached for comment.\n\n\"Fantastic Four\" earned just $56 million at the domestic box office and $110.5 million internationally, according to data from Box Office Mojo. The film reportedly cost $120 million to make, not including marketing costs. \nFollowing a disappointing $25.6 million U.S. debut for \"Fantastic Four,\" Fox told CNBC it remained committed to the franchise. A sequel is planned for the summer of 2017.\nRead More 'Fantastic Four' flop sparks Marvel clawback rumors \n\nThe report from Den of Geek came just one day after Marvel and Fox announced they would partner to develop two television shows set in the world of the X-Men. \nFox Network has given the green light to \"Hellfire,\" a 1960s-period series that centers around a special agent's investigation into a secretive group of rich and well-connected mutants that form the inner circle of the Hellfire Club.\nThe studios will produce a pilot for FX tentatively titled \"Legion\" based on a mentally disturbed character named David Haller. In the comics, Haller is the son of X-Men founder Professor Charles Xavier. He manifests different powers as competing personalities in his mind come to the fore. \nFox and FX will handle physical production for the shows. The team behind Fox's superhero films — Bryan Singer, Lauren Shuler Donner and Simon Kinberg — will executive produce along with Jeff Loeb, who oversees Marvel's \"Agents of S.H.I.E.L.D.\" series on ABC. \nTom DiChristopher Web and TV producer Related Securities Symbol Price   Change %Change DIS ---", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T06:49:14.163+03:00", "highlightTitle": ""}