{"organizations": [], "uuid": "2293231a3944db8ba48bfb447bd1dee7ebff1b93", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/a/8/f/b/image.related.afrArticleLead.620x365.gka2yy.png/1444951320780.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/leadership/management/business-education/uni-of-queensland-and-mgsm-shine-in-new-mba-rankings-from-the-economist-20151015-gka2yy", "country": "AU", "title": "Uni of Queensland and MGSM shine in new MBA rankings from The Economist", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Uni of Queensland and MGSM shine in new MBA rankings from The Economist | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T02:00:00.000+03:00", "replies_count": 0, "uuid": "2293231a3944db8ba48bfb447bd1dee7ebff1b93"}, "author": "Tim Dodd", "url": "http://www.afr.com/leadership/management/business-education/uni-of-queensland-and-mgsm-shine-in-new-mba-rankings-from-the-economist-20151015-gka2yy", "ord_in_thread": 0, "title": "Uni of Queensland and MGSM shine in new MBA rankings from The Economist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "University of Queensland Business School head Andrew Griffith says the high MBA ranking is an \"extraordinary performance\". GLENN HUNT by Tim Dodd Macquarie Graduate School of Management's MBA degree has shot up the ladder from 49th to 28th in the latest global rankings from The Economist magazine.\nAustralia now has two MBAs in the world's top 30 in The Economist 's ranking, with Macquarie joining the University of Queensland Business School which has maintained its 16th place for the second year.\n\"We've been surprised, but it's a pleasant surprise,\" said Alex Frino, dean of the Macquarie Graduate School of Management (MGSM).\n\"My gut feel is that we are being rewarded for our investment in the career area, diversifying our cohort through scholarships and our efforts to engage alumni by offering networking opportunities,\" Professor Frino said.\nHe singled out the school's Women in MBA program, which partners with employers to offer talented women an MBA at little or no cost, as one factor driving its ranking success.\nMGSM's MBA has moved quickly up in global rankings being ranked by The Economist at 73rd in 2011, and rising every year since. It is also Australia's top-ranked business school in the Financial Times MBA rankings, coming in at 68th in 2015, followed by UNSW's Australian Graduate School of Management at 75th and Melbourne Business School at 90th.\nMGSM's performance could see it soon rival the University of Queensland Business School as Australia's most successful up-and-coming MBA school. The Economist has now ranked Queensland's MBA in its world top 20 for three consecutive years and it also currently has Australia's top MBA (for the second-consecutive year) in The Australian Financial Review 's BOSS MBA ranking . (MGSM declined to participate in the 2015 BOSS MBA ranking.)\n\"It's quite an extraordinary performance for an Australian business school to be in the top 20,\" said Andrew Griffiths, head of the University of Queensland Business School.\n Professor Griffiths said students were attracted by the Queensland MBA's strong industry engagement which gave them an \"applied and practical\" MBA experience. He said the degree had also increased its global focus, offering students consulting practicums in partnership with The Wharton School at the University of Pennsylvania and the Fudan University School of Management.\n\"This is creating its own demand,\" he said.\nThe Economist ranked Queensland highly at 8th in the world for its MBA's personal development and education experience.\nBoth the Queensland and MGSM MBAs were ranked highly for salary earned by graduates after completion. The average exchange rate in 2014 was used to compare Australian salaries with other countries and the fall in the Australian dollar this year is expected to pull down the salary score for Australian business schools in next year's Economist MBA rankings.", "external_links": [], "published": "2015-10-16T02:00:00.000+03:00", "crawled": "2015-10-16T06:06:42.819+03:00", "highlightTitle": ""}