{"organizations": ["Fed"], "uuid": "82a9fbbb36e98e22ee2d48de75490a7af03f7b6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/nPkcKJrKB.wq_AvCmxGzqg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/37fbb799b863767dd46414b895ec8819ab72c5aa_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Top stories from Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/asia-markets-rally-fed-rate-043707072.html", "country": "GB", "title": "Asia markets rally as Fed rate rise seen delayed", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Asia markets rally as Fed rate rise seen delayed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T07:37:00.000+03:00", "replies_count": 0, "uuid": "82a9fbbb36e98e22ee2d48de75490a7af03f7b6c"}, "author": "", "url": "https://uk.finance.yahoo.com/news/asia-markets-rally-fed-rate-043707072.html", "ord_in_thread": 0, "title": "Asia markets rally as Fed rate rise seen delayed", "locations": ["Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Oct 16, 2015, 06:05 BST - UK Markets open in 1 hr 55 mins Asia markets rally as Fed rate rise seen delayed AFP – 28 minutes ago View Photo \n\nAn increasing expectation the Federal Reserve will keep interest rates at record lows fed further gains in Asia's stock markets on Friday. \nInvestors were set to end a third straight week on a high as Tuesday and Wednesday's China-fuelled retreat was overshadowed by hopes the cost of US borrowing will stay near zero percent into the new year. \nSpeculation that Beijing will soon introduce more measures to stimulate the world's number two economy and key driver of world growth also provided an incentive to buy ahead of the release of growth data next week. \nGlobal markets have enjoyed a broadly strong month so far after suffering their worst quarter in four years during July-September, when trillions of dollars were wiped of valuations. \nThe main story behind the latest rally has been the likelihood the Fed will have to put off a rate hike until the new year owing to a slowdown in world economic growth. \nAfter saying in early 2015 that a rise was expected as the US economy picked up pace, bank policymakers have gradually lowered their expectations, with turmoil unleashed by China's yuan depreciation in August playing a major role. \nA recent run of weak data out of Washington -- including below par jobs growth and retail sales -- have also muddied the Fed's waters. \n\"Investors are reacting to the increasing likelihood that the Fed rate hike, which had been expected just a month ago in September, now likely won't happen during the course of this year,\" said David Levy, portfolio manager at Kenjol Capital Management. \nHowever, the dollar, which has tumbled this month against most currencies, picked up Friday after New York Federal Reserve President William Dudley said a rate increase was still possible this year if economic data stayed \"in line\" with forecasts. \n- China growth woes - \nIndonesia's rupiah dipped 0.50 percent in early trade Friday, while the Malaysian ringgit lost one percent. \nThe rupiah is up about eight percent this month, while the ringgit has gained more than five percent. The Korean won was 0.39 percent lower, the Thai baht eased 0.22 percent and Singapore's dollar was down 0.13percent. \nThe also greenback rose to 119.18 yen from 118.88 yen in New York as pick-up in confidence on trading floors saw dealers move out of safer assets. \nThe euro was at $1.1369 compared with $1.1376 in US trade and well down from $1.1480 earlier Thursday in Asia with after a European Central Bank board member said eurozone inflation was undershooting its target. \nThe comments led the speculation the ECB will widen its already huge stimulus programme. \nOn share markets, expectations the Bank of Japan will soon increase its own monetary easing scheme helped the Nikkei to close the morning session 1.36 percent higher. \nHong Kong added 0.79 percent and Sydney gained 0.89 percent. \nShanghai was 1.20 percent higher, with dealers betting on China's leaders announcing a new round of measures to shore up the stuttering economy. \nWhile weak readings this week on trade and inflation initially sent stocks lower, investors now see the possibility of another interest rate cut -- after five since November -- or other monetary loosening. \nThis week the government announced plans to reform the country's sprawling state-owned enterprises in the telecoms and utilities sectors as it looks to improve efficiency. \n\"The central bank has loosened its tap on liquidity and the SOE reform will continue through the year,\" said Wei Wei, an analyst at Huaxi Securities Co. in Shanghai. \"It (Other OTC: ITGL - news ) ?s a good time window for stocks now and the rebound will probably carry on.\" \nHowever, analysts are pessimistic about the release of July-September economic growth figures Monday, with a survey. \nA survey of 19 economists by AFP found a median forecast of expansion of 6.8 percent, which would be the worst since early 2009 at the height of the global financial crisis (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-10-16T07:37:00.000+03:00", "crawled": "2015-10-16T08:09:28.688+03:00", "highlightTitle": ""}