{"organizations": ["Volkswagen", "European Central Bank", "Bloomberg"], "uuid": "5876cc820c6309521837675131985cd1cdb5c5cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/binary-options/wp-content/uploads/sites/6/2015/10/239941588-1.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/binary-options/analysis/its-time-to-worry-about-the-european-economy/", "country": "US", "title": "It’s Time to Worry About the European Economy", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "It’s Time to Worry About the European Economy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T20:37:00.000+03:00", "replies_count": 0, "uuid": "5876cc820c6309521837675131985cd1cdb5c5cf"}, "author": "", "url": "http://www.financemagnates.com/binary-options/analysis/its-time-to-worry-about-the-european-economy/", "ord_in_thread": 0, "title": "It’s Time to Worry About the European Economy", "locations": ["Europe", "Germany", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It’s Time to Worry About the European Economy The German Engine is Sputtering It’s Time to Worry About the European Economy Figures show that all major sectors in Germany (industrial and service) are suffering the spillover effects of Chinese economic problems. Advertising Bloggers / (Photo: Bloomberg) The slowdown in economic activity in China is a major challenge to the global economy. The global market has been badly hit by this horrible development and all major central banks are trying to modify their monetary policies to adjust to this situation. Unfortunately, we might just be missing out on the fact that another major economy seems to be on the verge of a slowdown. Germany has the largest economy in Europe with a GDP of $3852.5 billion, which means that any economic slowdown in Germany would have a big impact on the European economy as a whole. Looking at some economic data released for the months of August and September, it shows some weakness in core industries in Germany. For example, German factory imports slumped from 2.3% to -3.1%, and exports also dropped from 2.2% to -5.2%. German industrial production also saw a fall from 1.2% to -1.2%, and service industry PMI data shows a downward trend too, from 54.3 to 54.1. These figures show that all major sectors in Germany (industrial and service) are suffering the spillover effects of Chinese economic problems. We should also remember that one of Germany’s major car producers also suffered a massive plunge in their share value due to emission irregularities. It should be recalled that quantitative easing is currently going on in Europe, which means that economic activities should be at their best. Economic activities are expected to be rapidly growing, driving inflation up to as high as 2%. But this is not happening- despite quantitative easing, the economy is showing signs of weakness. If this continues, the European Central Bank might have to increase the ongoing quantitative easing. The Chinese economy seems to be the only economy that the world perceives to be slowing down, but the European giants are also on the verge of a decline. A couple of weeks ago, Germany’s Volkswagen company suffered a massive slump due to some irregularities regarding emission standards in its cars. On the back of this, the company’s shares plunged by more than 10%, which also had an effect on the European share index. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-10-12T20:37:00.000+03:00", "crawled": "2015-10-12T17:42:55.974+03:00", "highlightTitle": ""}