{"organizations": [], "uuid": "557134c3c0938c8a4cac2db086230ea37a61ca98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/HeavyConstruction", "section_title": "Yahoo! Finance: Heavy Construction Industry News", "url": "http://finance.yahoo.com/news/great-lakes-domestic-dredging-business-210000070.html", "country": "GB", "title": "Great Lakes' Domestic Dredging Business Continues to Benefit From Industry Tailwinds", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Great Lakes' Domestic Dredging Business Continues to Benefit From Industry Tailwinds - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "557134c3c0938c8a4cac2db086230ea37a61ca98"}, "author": "Great Lakes Dredge & Dock Company", "url": "http://finance.yahoo.com/news/great-lakes-domestic-dredging-business-210000070.html", "ord_in_thread": 0, "title": "Great Lakes' Domestic Dredging Business Continues to Benefit From Industry Tailwinds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OAK BROOK, Ill., Oct. 22, 2015 (GLOBE NEWSWIRE) -- Great Lakes Dredge & Dock Corporation (\"Great Lakes\") ( GLDD ), the largest provider of dredging services in the United States and a major provider of environmental and remediation services, announced today the receipt of an award for a $103 million contract for the construction of the National Resources Damage Assessment (NRDA) Caillou Lake Headlands (TE-100) project from the State of Louisiana Coastal Protection and Restoration Authority (CPRA). The Company is also the apparent successful bidder for the $28 million Chenier Ronquille Barrier Island Restoration Project. \nThe Caillou Lake project includes restoring the entire shoreline of the barrier island commonly known as Whiskey Island in Terrebonne Parish. The work includes beach and dune restoration using material dredged from the offshore Ship Shoal borrow source, as well as restoring the marsh platform along the western half of the island. Utilizing a hydraulic cutter suction dredge and booster stations, approximately 10 million cubic yards of seabed sand will be dredged and pumped 14 miles through a submerged slurry pipeline to create more than 900 acres of barrier island and marsh habitat. Work on this project is expected to begin in 2016 and will be completed in 2017. \nThe Chenier Ronquille project is contracted by the U.S. Department of Commerce, National Oceanic and Atmospheric Administration (NOAA) and requires restoration of the beach/dune and back barrier marsh platform of this barrier island in Plaquemines Parish, Louisiana. The project, which has yet to be formally awarded, will use approximately 2.7 million cubic yards of material dredged from an offshore Gulf of Mexico borrow source to restore nearly 390 acres of the barrier island and habitat. Work on this project is expected to be performed in 2016.\nThese projects are the second and third of four components in the Louisiana Outer Coast Restoration being funded with Deepwater Horizon NRDA Early Restoration funds. The $76 million Shell Island West NRDA was the first component project to be contracted, and it was awarded to Great Lakes in July 2015 with work expected to commence later this year. The fourth component project will be for restoration of North Breton Island in the Breton National Wildlife Refuge.\nPresident of Dredging Operations David Simonelli stated, \"Rebuilding these barrier islands are critical pieces for the restoration of the Louisiana Gulf Coast. We look forward to working with CPRA as it executes its mission of restoring land lost and improving flood protection systems in order to protect Louisiana's coast and its many assets.\" \nMr. Simonelli added, \"Our hydraulic dredges and booster stations are well-suited to build these important barrier islands. These projects will occupy previously under-utilized cutter suction dredges. Having won a large portion of bid lettings in the domestic market through the first nine months of the year, including two major deepening and coastal protection projects on the East Coast, our core dredging business is stronger than ever. In addition, the recent severe nor'easter, coupled with Hurricane Joaquin, has led to variation orders increasing beach fill quantities on several ongoing Sandy projects.\" \nChief Executive Officer Jonathan Berger added, \"As anticipated earlier this year, the Gulf Coast states are continuing to move forward with their restoration planning and projects, and we are honored to contribute to this important effort. We continue to expect to see an elevated level of work in the region, funded by the early Deepwater Horizon funds. In addition to the elevated level of work in the Gulf, our domestic dredging business is benefitting from additional industry tailwinds, including Superstorm Sandy-related projects on the East Coast and major port deepening projects in anticipation of the Panama Canal deepening. With our extremely robust domestic backlog, our outlook remains optimistic for the domestic dredging market.\"\nThe Company \nGreat Lakes Dredge & Dock Corporation (\"Great Lakes\" or the \"Company\") is the largest provider of dredging services in the United States and the only U.S. dredging company with significant international operations. The Company is also a significant provider of environmental and remediation services on land and water. The Company employs civil, ocean and mechanical engineering staff in its estimating, production and project management functions. In its 125-year history, the Company has never failed to complete a marine project. Great Lakes has a disciplined training program for engineers that ensures experienced-based performance as they advance through Company operations. Great Lakes also owns and operates the largest and most diverse fleet in the U.S. dredging industry, comprised of over 200 specialized vessels.\nCautionary Note Regarding Forward-Looking Statements \nCertain statements in this press release may constitute \"forward-looking\" statements as defined in Section 21E of the Securities Exchange Act of 1934 (the \"Exchange Act\"), the Private Securities Litigation Reform Act of 1995 (the \"PSLRA\") or in releases made by the Securities and Exchange Commission (the \"SEC\"), all as may be amended from time to time. Such forward-looking statements involve known and unknown risks, uncertainties and other important factors that could cause the actual results, performance or achievements of Great Lakes and its subsidiaries, or industry results, to differ materially from any future results, performance or achievements expressed or implied by such forward-looking statements. Statements that are not historical fact are forward-looking statements. Forward-looking statements can be identified by, among other things, the use of forward-looking language, such as the words \"plan,\" \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"estimate,\" \"project,\" \"may,\" \"would,\" \"could,\" \"should,\" \"seeks,\" or \"scheduled to,\" or other similar words, or the negative of these terms or other variations of these terms or comparable language, or by discussion of strategy or intentions. These cautionary statements are being made pursuant to the Exchange Act and the PSLRA with the intention of obtaining the benefits of the \"safe harbor\" provisions of such laws. Great Lakes cautions investors that any forward-looking statements made by Great Lakes are not guarantees or indicative of future performance. Important assumptions and other important factors that could cause actual results to differ materially from those forward-looking statements with respect to Great Lakes, include, but are not limited to: our ability to continue to obtain federal government dredging and other contracts; our ability to qualify as an eligible bidder under government contract criteria and to compete successfully against other qualified bidders; risks associated with cost over-runs, operating cost inflation and potential claims for liquidated damages, particularly with respect to our fixed cost contracts; the timing of our performance on contracts; significant liabilities that could be imposed were we to fail to comply with government contracting regulations; changes in previously-recorded revenue and profit due to our use of the percentage-of-completion method of accounting; consequences of any lapse in disclosure controls and procedures or internal control over financial reporting; changes in the amount of our estimated backlog; our ability to comply with the Jones Act and risks to our business if provisions of the Jones Act were to be repealed or modified; our ability to obtain bonding or letters of credit; increasing costs to operate and maintain aging vessels; equipment or mechanical failures; impacts of legal and regulatory proceedings; unforeseen delays and cost overruns related to the construction of new vessels or equipment; our becoming liable for the obligations of joint ventures, partners and subcontractors; capital and operational costs due to environmental regulations; unionized labor force work stoppages; liabilities for injuries to employees or others or damage to property; maintaining an adequate level of insurance coverage; the adequacy of our information technology systems and risks regarding information technology security breaches; our substantial amount of indebtedness; restrictions imposed by financing covenants; the impact of adverse capital and credit market conditions; limitations on our hedging strategy imposed by new statutory and regulatory requirements for derivative transactions; and changes in macroeconomic indicators and the overall business climate. For additional information on these and other risks and uncertainties, please see Item 1A. \"Risk Factors\" of Great Lakes' Annual Report on Form 10-K for the year ended December 31, 2014, and in other securities filings by Great Lakes with the SEC.\nAlthough Great Lakes believes that its plans, intentions and expectations reflected in or suggested by such forward-looking statements are reasonable, actual results could differ materially from a projection or assumption in any forward-looking statements. Great Lakes' future financial condition and results of operations, as well as any forward-looking statements, are subject to change and inherent risks and uncertainties. The forward-looking statements contained in this press release are made only as of the date hereof and Great Lakes does not have or undertake any obligation to update or revise any forward-looking statements whether as a result of new information, subsequent events or otherwise, unless otherwise required by law.\nPROJ\nGreat Lakes Contact: For further information contact:\nMary Morrissey, Investor Relations\n630-574-3467", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T01:36:41.541+03:00", "highlightTitle": ""}