{"organizations": [], "uuid": "506d4ad6debe9afe1260585ae61c1047082d8f7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-DW190_columb_ZG_20151012071403.jpg", "site_section": "http://finance.yahoo.com/news/provider-marketwatch/", "section_title": "MarketWatch News Archive - Yahoo! Finance", "url": "http://www.marketwatch.com/story/super-crash-theory-says-you-shouldnt-be-chasing-these-gains-2015-10-12", "country": "US", "title": "‘Super Crash’ theory says you shouldn’t be chasing these gains", "performance_score": 0, "site": "marketwatch.com", "participants_count": 4, "title_full": "‘Super Crash’ theory says you shouldn’t be chasing these gains - MarketWatch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 3, "uuid": "280619fd96a4fec9e10421123c5d1df1e57824db"}, "author": "Barbara Kollmeyer", "url": "http://www.marketwatch.com/story/super-crash-theory-says-you-shouldnt-be-chasing-these-gains-2015-10-12#post-0", "ord_in_thread": 0, "title": "‘Super Crash’ theory says you shouldn’t be chasing these gains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It’s Columbus Day, which could be one last opportunity to stretch and take a look around before earnings start hitting us in the face, beginning with banks tomorrow. That’s coming off what was the best week for the S&P 500 so far this year, partially fueled by a rebound for commodities prices.\nBut with the gains comes more angst. What we need to figure out, says IG’s market strategist Evan Lucas, is if markets are at a “fundamental conviction buying point or a short-term cyclical move where what goes down must come up — which leads straight into the next part of the cycle, in what goes up will come down (at some point).”\nOur call of the day is pointing down for sure. It comes from a guy who’s got a reputation for predicting market selloffs. To be sure, volatility is likely not off the table as earnings start rolling in. That’s one thing to keep an eye on, but keep another eye on the dollar. Our chart of the day tells why it’s going to be compelling for this market.\nGot a third eye? Then fix it on central banks. It was a busy weekend in Lima, Peru, for the IMF. Our crashy call of the day had a contender in China’s finance minister Lou Jiwei who said the U.S. should “bear more global responsibility” and is in no shape for a rate hike. That’s opposed to his central-banker buddies who said the Fed should get on with things .\nBut really, if that China official is worried about the fallout from a U.S. rate hike, then he should be relieved by what Yi Gang, the People’s Bank of China deputy governor, had to say. Gang’s comment that his country’s stock-market correction is “almost over,” along with more stimulus, helped send China stocks on a tear. So strike China off the list of worries for Wall Street. Right?\nKey market gauges Dow YMZ5, +0.06% and S&P ESZ5, -0.02% futures are doing what could be expected on a government holiday (but not markets, sorry), showing little change. The Shanghai Composite SHCOMP, +3.28% closed up 3.3%, helped by news of a new plan from Beijing to boost bank lending . Markets are closed in Tokyo for a holiday. Europe stocks SXXP, -0.25% pulled lower, putting the longest winning streak in nearly three months at risk. Crude oil CLZ5, +0.16% continues to rise after in the wake of last week’s U.S. rig-count declines. Gold GCZ5, +1.02% is picking up where it left off last week, with prices up again nicely this morning. The dollar DXY, -0.14% is slightly lower.\nThe call Anyone chasing stock prices here is setting up to get burned, says Michael Lewitt, who is editor of The Credit Strategist newsletter and known as of the few strategists to predict the 2008 financial crisis. He believes the mini crash in August was just a foretaste of the beginning of the “Super Crash” that’s still to come.\nIn a blog post, Lewitt says much of last week’s gains can be chalked up to short covering. On the surface they look great, but “do not be fooled.” He says cap-weighted indexes are showing a pulse, but most of the rest of the market is dead, with losses of 20% or more for anything linked to commodities.\nSure, markets are right in thinking the Fed isn’t going to hike rates by the end of the year, but no one should be under the illusion that this will keep stock prices rising. “There are a lot of fund managers and pundits who have been 100% wrong about the market this year and are desperately praying for a huge fourth-quarter rally to bail out their reputations,” he says. He expects gloomy fourth-quarter growth. More from Lewitt here .\nThe chart Humble Student of the Markets Balancing out our gloomy call with a little sunshine, Humble Student of the Market blogger Cam Hui thinks we’re on the cusp of a “what’s-the-credit-limit on my VISA-card’ buy signal. He’s finding lots of signs of global healing and sees a turning point for the market — only to the upside.\nBut Hui cautions to keep an eye on the dollar, which he says is breaking down on a technical basis.\nIf the dollar is going to weaken further, that could boost earnings of U.S. companies with overseas earnings, which is something cyclical stocks have already been anticipating, he says. A dovish Fed will keep that up, but if the Fed starts making hawkish noises then the dollar bulls could find some “wind at their backs,” he warns.\nPrev Page 1 2 Next Page", "external_links": ["http://humblestudentofthemarkets.blogspot.co.uk/2015/10/a-whats-credit-limit-on-my-visa-card.html", "http://moneymorning.com/2015/10/11/trouble-ahead-stocks-gain-but-the-super-crash-is-accelerating/"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T15:26:26.458+03:00", "highlightTitle": ""}