{"organizations": [], "uuid": "eae4c5dd0e2c51d78bd4c02c83023f97b896cf37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.business-standard.com", "main_image": "http://bsmedia.business-standard.com/_media/bs/img/article/2015-10/14/full/1444767320-8549.jpg", "site_section": "http://www.business-standard.com//rss/finance-103.rss#", "section_title": "Finance", "url": "http://www.business-standard.com/article/finance/bank-of-baroda-case-court-remands-2-bank-officials-to-cbi-custody-115101400882_1.html", "country": "IN", "title": "Bank of Baroda case: Court remands 2 bank officials to CBI custody News", "performance_score": 0, "site": "business-standard.com", "participants_count": 1, "title_full": "Bank of Baroda case: Court remands 2 bank officials to CBI custody | Business Standard News", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "eae4c5dd0e2c51d78bd4c02c83023f97b896cf37"}, "author": "Press Trust of India", "url": "http://www.business-standard.com/article/finance/bank-of-baroda-case-court-remands-2-bank-officials-to-cbi-custody-115101400882_1.html", "ord_in_thread": 0, "title": "Bank of Baroda case: Court remands 2 bank officials to CBI custody News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An assistant general manager and head of the foreign exchange division of Bank of Baroda (BoB), arrested in the Rs 6,000 crore suspicious remittances case, were today remanded to two-day CBI custody by a Delhi court.\n\nAGM S K Garg and Jainish Dubey, who headed the foreign exchange division at BoB's branch in Ashok Vihar here, were produced before Special CBI Judge P K Jain where the agency sought their custodial interrogation for five days.\n\nThe agency said that both the accused were required to be quizzed to unearth the entire modus operandi which led to the alleged illegal transfer of huge amount of money.\n\nSeeking their police custody, the CBI told the court that they have to ascertain the fact as to how the foreign exchange was allowed without even informing the bank's regional office.\n\nThe counsel appearing for the accused, who were arrested by CBI yesterday, opposed the plea of the agency claiming that both these officials had informed regional office in January itself about some irregularities in the branch in foreign exchange transactions.\n\nThe court, after hearing the submissions, remanded both the accused to CBI custody till October 16. They were arrested for the alleged offences under various provisions of the IPC and the Prevention of Corruption Act.\n\nThe alleged irregularities had come to notice recently and the agency had conducted searches on the bank premises and residences of Garg and Dubey last week.\n\nCBI's FIR has alleged that \"59 current account holders and unknown bank officials conspired to send overseas remittances, mostly to Hong Kong, of foreign exchange worth approximately Rs 6,000 crore in illegal and irregular manner in violation of established banking norms under the garb of payments towards suspected non-existent imports\".\n\nCBI has found that an estimated Rs 6,000 crore was transferred through nearly 8,000 transactions done between July, 2014 and July, 2015.\n\nThe Enforcement Directorate too is probing the case and had participated in the searches conducted by CBI. ED has arrested four accused in connection with the case and they are presently in police custody till October 17.", "external_links": [], "published": "2015-10-14T03:00:00.000+03:00", "crawled": "2015-10-14T16:05:29.260+03:00", "highlightTitle": ""}