{"organizations": [], "uuid": "0af5ce7871061ca54f60ba7e02864bc7305e2b59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/25/texas-flood-idUSL1N12O0DU20151025", "country": "US", "title": "UPDATE 4-Houston braces for floods as Texas deluged by rain in Patricia's wake", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 4-Houston braces for floods as Texas deluged by rain in Patricia's wake | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T03:35:00.000+02:00", "replies_count": 0, "uuid": "0af5ce7871061ca54f60ba7e02864bc7305e2b59"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/25/texas-flood-idUSL1N12O0DU20151025", "ord_in_thread": 0, "title": "UPDATE 4-Houston braces for floods as Texas deluged by rain in Patricia's wake", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details of storm damage)\nBy Amanda Orr\nHOUSTON Oct 24 (Reuters) - Heavy rains fueled by the meeting of two strong storm systems, one the remnants of Hurricane Patricia, pounded southeastern Texas on Saturday, triggering flash floods and derailing a freight train as the heavy weather tracked toward Houston.\nNavarro County, about 50 miles (80 km) south of Dallas, was one of the hardest-hit areas, inundating the tiny town of Powell with 20 inches (50 cm) of rain over 30 hours, according to meteorologist Brett Rathbun of Accuweather.\nA flash flood was so forceful it swept a Union Pacific freight train off the tracks, pushing locomotives and some rail cars on their sides. No injuries were reported.\nCounty authorities requested sandbags for homes being evacuated due to flooding and Interstate 45 was shut down in some spots in Navarro County due to rising waters, stranding drivers.\nTaylor Bates, 19, said she had not been home since Friday, when both of the roads to her home in an unincorporated area of the county flooded and partially washed away.\n\"My mom is stuck at the house and she can't leave, but the house is OK,\" she said. \"But I can't get home. Both ways to get to our house are flooded.\"\nSome 75 water rescues from vehicles, homes and businesses had been carried out in Navarro County since Friday, Sheriff Elmer Tanner said.\nThere were no confirmed deaths from the deluge, but in San Antonio, a woman reported that her boyfriend was swept into a drainage ditch as he walked his dog early Saturday. Officials said he was considered missing.\nBut as evening fell and the storm moved eastward, cities in the state's flood-prone Gulf of Mexico region, including Houston, braced for potential floods. Rain systems intensified by Patricia, now a tropical depression after crashing into Mexico's west coast as a powerful hurricane, were pushing across the state.\nHouston, the state's second-most populous metropolitan area with 6.1 million people, was under a tornado watch until 10 p.m. (0300 GMT Sunday).\nSaturday's rainfall led to the cancellation of about 100 flights at Dallas/Fort Worth International Airport, one of the country's busiest air hubs, according to tracking service FlightAware.\nIn the Galveston area, authorities urged a voluntary evacuation of the elderly and residents with medical issues on the Bolivar Peninsula near Galveston Bay.\nThe conditions could hinder transportation to and from the peninsula. Power outages are also possible as a result of gale force winds, authorities said.\nForecasters predicted 8 to 12 inches (20 to 30 cm) of rain will hit the coastal area by Monday morning, combined with tides up to 5 feet (1.5 meter) and wind gusts up to 35 mph overnight on Saturday.\nHouston Mayor Annise Parker warned residents to stay away from wet roads after dark and be aware that flooding is likely. Even so, some residents eyed the coming storms with some indifference.\n\"In Houston it's always like that when it rains; it's going to flood,\" said Vittorio Preteroti, owner and chef of the upscale Perbacco Italian restaurant in downtown Houston, before the eatery opened for dinner.\nNonetheless, officials reminded residents of deadly flooding in the past and urged vigilance.\n\"Unfortunately some people lost their lives in high-water incidents,\" said Harris County Judge Ed Emmett, whose county includes Houston. \"We're going to get a lot of rain tonight and it's going to result in some high water situations so for heaven's sake be careful out there.\"\nRetailers in the area reported that locals made a run on supplies in anticipation of the floods.\n\"We've seen a spike in the sales of bottled water, bread, milk, canned meats, fruit and even items such as charcoal, which customers use to barbecue if there's a power outage at their homes,\" said Kristal Howard, public relations manager for Kroger Southwest.\nThe weekend deluge marked the second time in five months that severe weather hammered parts of Texas. In May, a series of storms triggered floods and led to 21 deaths, prompting President Barack Obama to declare disaster areas in parts of the state. (Additional reporting by Lisa Maria Garza in Dallas; Jim Forsyth in San Antonio, Karen Brooks in Austin, Alex Dobuzinskis and Dan Whitcomb in Los Angeles; Editing by Frank McGurty, Cynthia Osterman and Marguerita Choy)", "external_links": [], "published": "2015-10-25T03:35:00.000+02:00", "crawled": "2015-10-25T02:47:32.212+02:00", "highlightTitle": ""}