{"organizations": [], "uuid": "b795ba68aaf332fff17921882324f32d23853378", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://finance.yahoo.com/news/must-read-does-general-motors-155807463.html", "country": "GB", "title": "Must Read: How Does General Motors’ Future Look? - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Must Read: How Does General Motors’ Future Look? - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "b795ba68aaf332fff17921882324f32d23853378"}, "author": "Mark O'Hara", "url": "http://finance.yahoo.com/news/must-read-does-general-motors-155807463.html", "ord_in_thread": 0, "title": "Must Read: How Does General Motors’ Future Look? - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Key Takeaways from General Motors’ Global Business Conference \nContinual change The ever-changing automobile industry has come a long way since Ford (F) launched its revolutionary Model T in 1908. Since then, the automotive industry has never stopped innovating.\nDuring the last two decades, the automotive industry has experienced significant churn. First, Toyota Motors (TM) took as over the leading automaker from General Motors (GM). However, the largest automobile company is Germany-based Volkswagen (VLKAY). Together, General Motors and Ford (F) form ~4.4% of the Consumer Discretionary Select Sector SPDR ETF (XLY).\n\nFresh competition In the last few years, while car manufacturers were fighting for a share of global car sales, disruptive technology began to build. Many analysts view Apple and Uber as future competitors of the automobile industry.\nThe lead industry disruptor is Tesla Motors (TSLA), which is racing ahead with its electric vehicles. At current stock prices, Tesla is valued 60% higher than Fiat Chrysler (FCAU). Tesla has outperformed mainstream automakers by a wide margin, as shown in the above chart.\nSeries overview The automotive industry finds itself at a crossroads. Self-driving cars, car sharing, and electric vehicles have made leading industry players rethink their business plans. Investors need to keep track of how auto companies are steeling themselves against this onslaught of disruptive technology.\nCompany conference calls often throw light on a company’s business strategy. In this series, we’ll look at the key takeaways from General Motors’ global business conference, which was held on October 1, 2015.\nContinue to Next Part \nBrowse this series on Market Realist: \nPart 2 - Ford and General Motors Look at the Industry’s Future Part 3 - General Motors: What Headwinds Does the Core Business Face? Part 4 - How Is General Motors Positioned to Tackle the Chinese Slowdown? Automotive Industry General Motors Tesla Motors Toyota Motors automobile industry Ford", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T13:49:04.715+03:00", "highlightTitle": ""}