{"organizations": [], "uuid": "ac299baea1e4ad857ab69c602ab11e14d98643d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/h/9/w/r/image.related.afrArticleLead.620x365.gkh7v5.png/1445586071279.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/santos-takeover-will-bring-out-the-dirty-linen-20151023-gkh7v5", "country": "AU", "title": "Santos takeover will bring out the dirty linen", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Santos takeover will bring out the dirty linen | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:21:00.000+03:00", "replies_count": 0, "uuid": "ac299baea1e4ad857ab69c602ab11e14d98643d8"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/santos-takeover-will-bring-out-the-dirty-linen-20151023-gkh7v5", "ord_in_thread": 0, "title": "Santos takeover will bring out the dirty linen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When the nine royal families from the Middle East and Brunei enlisted the support of former Santos chief executive John Ellice-Flint there was bound to be a much-needed airing of some dirty linen. David Rowe Share on twitter by Tony Boyd The $7.1 billion foreign takeover bid for troubled South Australian oil and gas group Santos puts the spotlight on a wide array of issues that are rarely ventilated in the notoriously secretive Australian corporate sector.\nWhen the nine royal families from the Middle East and Brunei enlisted the support of former Santos chief executive John Ellice-Flint there was bound to be a much-needed airing of some dirty linen.\nThat is not to say that the bidders, who are using a fund management vehicle called Scepter Partners , are deliberately trying to throw muck at the target company in order to win control. But it is impossible to ignore the fact that under Ellice-Flint's eight-year leadership of the company it added about $1billion in market capitalisation each year and under recent leadership the company dropped about $1billion a month in value.\nThe involvement of Ellice-Flint means that during the period of the takeover offer investors will be reminded of the strategic mistakes made over the past few years.\nWhen the nine royal families from the Middle East and Brunei enlisted the support of former Santos chief executive John Ellice-Flint there was bound to be a much-needed airing of some dirty linen. David Rowe One obvious question is how did a company with $12 billion in equity and $1 billion debt end up, at its low point, with $4 billion in equity and $10 billion in debt?\nPart of the answer to the question is that after Ellice-Flint left the company in 2008 it embarked on the $US18.5 billion GLNG project in Gladstone.\nThat is one of three liquefied natural gas projects which will make Australia the largest exporter of LNG by 2017. No wonder the oil-rich Middle Eastern families are looking to Australia at or near the bottom of the oil price cycle.\nAustralia's corporate sector attracts more publicity per company than in other developed economies. That is obvious from the reaction of foreigners who are brought in as chief executives.\n No alone time Former Telstra chief executive Sol Trujillo could not believe it when his first press conference in Melbourne was packed out with representatives from every form of media. During his entire four-year tenure he was never left alone. But the intense scrutiny of CEOs is rarely combined with a similar intensity of coverage of the inner workings of board rooms.\nChairmen and non-executive directors somehow manage to remain aloof from the coverage of the machinations of management. But we know from recent events that boardrooms can be poisonous places. The recent sudden dumping of Ian Smith as chief executive of explosives company Orica was bound up with bitter boardroom fights.\nThe boardroom turmoil at Woolworths before and after the sudden departure of chairman Ralph Waters is said to have rivalled the cut-throat goings-on in the Liberal Party in Canberra.\nThere were some pretty hard-edged boardroom explosions at Santos in the period leading up to the departure of Ellice-Flint but they have never been properly ventilated. Former chairman Stephen Gerlach has consistently refused to talk about what happened between him and Ellice-Flint.\nThere is no guarantee that they will be made public now simply because Scepter has bid for control of Santos. But there has probably never been a better time to try to understand what went wrong as Santos.\nSouth Australians probably have a right to know what happened to a company which is the ultimate corporate citizen in the state and a critical part of its cultural life because of its sponsorship of the arts and key sporting events.\nSouth Australia was once the home to some of the country's leading brands. But you have to go back to the 1990s to find a time when Adelaide was an important place for brokers and investors to visit.\nAt one stage in the 1990s before the corporate raiders hit their straps the Adelaide Stock Exchange was home to News Corp, F.H. Faulding, Bennett & Fisher, Southcorp, Elders, Adelaide Steamship, Foster's, Adelaide Brighton Cement, Hills, Harris Scarfe and Newmont Australia.\nA loss of relevance If Santos is taken over it will remain headquartered in Adelaide under the ownership of Scepter Partners but the removal from the sharemarket will mean a loss of relevance.\nSantos has in the past 12 months been a victim of the halving of the oil price. But as the price of oil fell it chose not to go to its shareholders for more equity capital.\nIn hindsight, it should have followed the urging of Credit Suisse analyst Mark Samter. He urged the company to deal with its enormous debt by doing a heavily discounted rights issue.\nThe company's CEO David Knox pushed back against that only to find himself removed and replaced by Peter Coates who is executive chairman.\nCoates, in effect, put the company up for sale in August. He is being advised by Lazard Australia, the merchant bank chaired by former prime minister Paul Keating. The sale process has worked because it has prompted a full cash offer from Scepter. Samter says the bid will be welcomed by shareholders but poses a dilemma for the board.\n\"We have an element of sympathy for the board if this was a credible offer,\" he said in a note to clients.\n\"The risks of it falling through, and unhinging the strategic review, would see a downside case that would be extremely grim. The upside case is an offer that sits 5 per cent above our full net present value.\"\nSamter rightly says that the bid provides a far higher price from which the company could raise equity.\nThe bid does provide a welcome endorsement of the Santos LNG expansion strategy in Queensland, which was always predicated on providing gas assets that could be accessed without having to travel through the geopolitically sensitive straits in Asia.\nSantos will probably argue that is share price was smashed because of perception issues and not because of fundamental valuation issues. But only time will tell.\nTony Boyd\nTwitter: @TonyBoydAFR", "external_links": ["https://twitter.com/TonyBoydAFR"], "published": "2015-10-23T15:21:00.000+03:00", "crawled": "2015-10-23T18:11:12.977+03:00", "highlightTitle": ""}