{"organizations": [], "uuid": "a0e24c76903288a4baf08a3c59e192b6f5d0fbdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=KMB", "section_title": "Yahoo! Finance: KMB News", "url": "http://finance.yahoo.com/news/edited-transcript-kmb-earnings-conference-194512902.html", "country": "US", "title": "Edited Transcript of KMB earnings conference call or presentation 21-Oct-15 2:00pm GMT - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Edited Transcript of KMB earnings conference call or presentation 21-Oct-15 2:00pm GMT - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "a0e24c76903288a4baf08a3c59e192b6f5d0fbdf"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/edited-transcript-kmb-earnings-conference-194512902.html", "ord_in_thread": 0, "title": "Edited Transcript of KMB earnings conference call or presentation 21-Oct-15 2:00pm GMT - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Q3 2015 Kimberly-Clark Corp Earnings Call\nDALLAS Oct 21, 2015 (Thomson StreetEvents) -- Edited Transcript of Kimberly-Clark Corp earnings conference call or presentation Wednesday, October 21, 2015 at 2:00:00pm GMT\nTEXT version of Transcript\n\nCorporate Participants\n\n* Paul Alexander\nKimberly-Clark Corporation - VP IR\n* Maria Henry\nKimberly-Clark Corporation - SVP, CFO\n* Tom Falk\nKimberly-Clark Corporation - Chairman, CEO\n\nConference Call Participants\n\n* Gail Glazerman\nUBS - Analyst\n* Jason English\nGoldman Sachs - Analyst\n* Chris Ferrara\nWells Fargo Securities, LLC - Analyst\n* Olivia Tong\nBofA Merrill Lynch - Analyst\n* Lauren Lieberman\nBarclays Capital - Analyst\n* Nyet Nuin\nXbodia Capital - Analyst\n* Ali Dibadj\nBernstein - Analyst\n* Javier Escalante\nConsumer Edge Research - Analyst\n* Iain Simpson\nSociete Generale - Analyst\n* Bill Schmitz\nDeutsche Bank - Analyst\n* Caroline Levy\nCLSA Limited - Analyst\n\nPresentation\n\nOperator [1]\n\nLadies and gentlemen, thank you for your patience in holding. We now have your speakers in conference. Please be aware that each of your lines is in a listen-only mode. At the conclusion of today's presentation, we will open the floor for questions. At that time, instructions will be given as to the procedure to follow if you would like to ask a question.\nIt is now my pleasure to turn today's conference over to Paul Alexander. Sir, you may begin.\n\nPaul Alexander, Kimberly-Clark Corporation - VP IR [2]\n\nThank you and good morning everyone. Welcome to Kimberly-Clark's third-quarter earnings conference call. Here with me today are Tom Falk, Chairman and CEO, Maria Henry, CFO, and Mike Azbell, VP and Controller.\nHere's the agenda for our call. Maria will begin with a review of third-quarter results. Tom will then provide his perspectives on our results and the outlook for the full year. And we will finish with Q&A. As usual, we have a presentation of today's materials in the Investors section of our website.\nAs a reminder, we will be making forward-looking statements today. Please see the risk factors section of our latest annual report on Form 10-K for further discussion of forward-looking statements.\nWe will also be referring to adjusted results and outlook. Both exclude certain items described in this morning's news release. The release has further information on these adjustments and reconciliations to comparable GAAP financial measures.\nNow I will turn it over to Maria.\n\nMaria Henry, Kimberly-Clark Corporation - SVP, CFO [3]\n\nGreat. Thanks Paul. Good morning everyone. Thanks for joining the call today.\nLet me start with the headlines for our third-quarter results. We achieved organic sales growth of 5%. That's at the high end of our full-year target. We also delivered excellent cost savings, gross margin improvement, and a record adjusted earnings per share from continuing operations. And finally, we continued to improve our capital efficiency and return cash to shareholders.\nNow let's cover the details of our results, starting with sales. Third-quarter net sales were $4.7 billion. That's down 7%, driven by a 12 point drag from currency rates. Organic sales rose more than 5%, including a 10% increase in developing and emerging markets.\nOn profitability, adjusted gross margin was 36.1% in the third quarter, up 120 basis points year-on-year. Adjusted operating margin was 17.5%. That's up 10 basis points despite unusually low G&A spending last year and a 70 basis point drag from other expense.\nOur teams continue to deliver significant cost savings in order to improve profitability and fund the investments that we are making behind our brands. Third-quarter FORCE cost savings were $85 million. In addition, our organizational restructuring is on track and generated $20 million of savings in the quarter.\nCommodities were a $45 million benefit in the quarter, mostly in oil-based materials. Full-year deflation should be about in the middle of our previously estimated range of $100 million to $200 million.\nNow, on the other hand, we continue to experience significant currency headwinds. The total earnings drag from currency was approximately $0.45 per share in the third quarter. For the full year, it's likely that the currency headwinds on our bottom line will approach 25%. That's a more significant impact than we expected coming into the year, and when we spoke to you on our last earnings call in July.\nOn items below operating profit, we had modest benefits from a lower share count and the adjusted effective tax rate, along with higher equity income. On the bottom line, third-quarter adjusted earnings per share were $1.51. That's a new all-time quarterly high on a continuing operations basis and up 1% year-on-year.\nNow, turning to cash flow and capital efficiency, cash provided by operations in the third quarter was healthy at $849 million, although down versus a very strong year-ago quarter of $976 million. On adjusted return on invested capital, through nine months, we have improved this metric 350 basis points. That improvement includes benefits from the spinoff of Halyard Health.\nOn capital allocation, third-quarter dividend payments and share repurchases totaled nearly $0.5 billion. We expect the full-year total will be $2.1 billion, or about 5% of our current market capitalization.\nNow let's look at the segment results. In personal care, organic sales rose 9%. That included 14% growth in developing and emerging markets and a 7% increase in North America. Overall personal care operating margins were 20.5%, up 100 basis points. This improvement was enabled by organic sales growth, cost savings and lower input costs.\nIn consumer tissue, organic sales were up 1%, including volume growth of 6% in North America. Consumer tissue operating margins of 17% were up 20 basis points despite unfavorable currency effects.\nIn K-C Professional, organic sales increased 5%. Within that, developing and emerging markets grew 6% and developed markets outside of North America grew 4%. The segment topline also benefited from sales of nonwovens to Halyard Health in conjunction with a limited term supply agreement. You can see this benefit in the mix other number for this segment.\nK-C Professional margins were 18.6%, off 30 basis points year-on-year. Overall, the margins in this segment remain healthy and above the corporate average.\nTo summarize, we had another good quarter as we achieved mid-single-digit growth in organic sales, we delivered strong cost savings, gross margin improvement, and record adjusted earnings per share. And we continue to improve our balance sheet efficiency and allocate capital in shareholder friendly ways.\nI will now turn the call over to Tom.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [4]\n\nThanks Maria, and good morning everyone. I'll share my perspectives on our third-quarter results and then I'll cover our full-year outlook.\nOverall, we delivered another quarter of good financial results and we are executing our global business plan strategies well in a challenging environment. As Maria just mentioned, organic sales growth was strong at more than 5% in the quarter.\nSo let me spend a few minutes and unpack some of our topline growth strategies for you. As you know, we are focused on pursuing targeted growth initiatives. We are launching product innovations and making high return investments in our brands. These strategies are working.\nOur biggest targeted growth initiative is in the developing and emerging markets. We had another excellent quarter in this part of our portfolio with 10% organic sales growth overall. Organic sales in diapers rose double-digit in these markets. We continue to benefit from innovation, expansion of diaper pants, category development and higher net selling prices in some places.\nIn terms of some of our key growth markets, organic sales in diapers rose about 45% in Eastern Europe. That was driven by price increases in Russia and the Ukraine to offset currency declines there, along with double-digit volume growth in Russia. Organic sales in diapers increased more than 15% in China. Volume growth remained very strong, while net selling prices were down due to increased competitive activity.\nHuggies diapers are now sold in 115 cities in China. That's up from 105 at the end of last year. We are launching product improvements in the fourth quarter of this year to further improve our Huggies franchise in China.\nIn Brazil, our team continues to execute well in a very challenging economic environment. Total personal care organic sales increased more than 10%, including 5% growth in diapers.\nElsewhere in developing and emerging markets, our overall feminine care organic sales rose high teens in the third quarter. Our momentum remains strong in Latin America, led by Brazil, and we made further progress in China. Organic sales also increased double digits in baby wipes and in adult care in the developing and emerging markets.\nSo, overall, we delivered a strong organic sales growth quarter in developing and emerging markets, and we are optimistic about our future there.\nIn our developed markets business outside of North America, organic sales were down slightly in the quarter. We continue to generate solid growth in South Korea while market conditions remain relatively soft in Western and Central Europe.\nMoving now to North America and our consumer business, we had excellent volume growth in the quarter behind innovation, brand investment and good execution at retail. And baby and child care volumes were up low double digits on Huggies diapers and high single digits on Huggies baby wipes. Our second-quarter relaunch of new Snug N' Dry mainline diapers is on track and I am encouraged that our Huggies volumes are improving.\nIn our adult care business, our innovation, brand investment and category growth helped us deliver double-digit volume growth in the quarter. Pipeline shipments for Poise Impressa occurred in the last half of the quarter, and we are watching the consumer response there very closely.\nIn consumer tissue, Kleenex facial tissue volumes rose high single digits. We had very good execution around the back-to-school season and paper towel volumes were up double digits, led by promotional activity on Viva.\nShifting to K-C Professional in North America, volumes there increased mid single digits on our higher-margin, faster-growing wiper products. In washroom products, organic sales were even with last year, and that's roughly in line with the overall market and category.\nSince Maria has already discussed our profitability, the balance sheet and capital allocation, I'll just add that I am also very pleased with our performance in those areas. So all in all, I am encouraged by our results in the third quarter.\nNow let's move and talk about the outlook for the full year. Our teams continue to focus on the fundamentals that create long-term shareholder value while delivering on our near-term financial commitments.\nIn terms of our growth targets for the year, we are raising the low end of our previous guidance ranges for both organic sales growth and adjusted earnings per share. On the top line, we are now targeting organic sales growth of 4% to 5%. Our prior target was 3% to 5%. Through nine months, we delivered growth of about 4.5%, and that compares favorably to many other peer CPG companies.\nOn the bottom line, despite a worsening currency environment, we've raised the low end of our previous guidance range by $0.05 per share for the second consecutive quarter. That's largely due to our improved expectation for organic sales growth. Our updated outlook is for adjusted earnings per share this year of $5.70 to $5.80.\nSo, in summary, we delivered very good results in the third quarter, we raised the low end of our top and bottom line growth ranges for the full year, and we remain optimistic about our prospects to generate attractive shareholder returns.\nThat wraps up our prepared remarks. Now we will begin to take your questions.\n\nQuestions and Answers\n\nOperator [1]\n\n(Operator Instructions). Gail Glazerman, UBS.\n\nGail Glazerman, UBS - Analyst [2]\n\nHi. Good morning. In terms of the diaper business in the US, has any of that promotion activity started to roll off in the fourth quarter? And if so, can you give any sense of how sales have progressed?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [3]\n\nI would say it wasn't as much promotion intense as getting the everyday price and innovation fundamentals right. And so that is continuing in the fourth quarter. And we've got good momentum in the diaper business overall and expect to see that continue.\n\nGail Glazerman, UBS - Analyst [4]\n\nGreat. And I apologize if I missed it, but can you give some insight into the trends you're seeing in North America in feminine care?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [5]\n\nOur femcare business was sort of flattish on volume in the quarter. We've got some more activity coming in the fourth quarter. There was a little bit more promotion activity in tampons than some of our competition in the third quarter. That probably affected our growth a bit. But we've got more action coming in the fourth quarter.\n\nGail Glazerman, UBS - Analyst [6]\n\nOkay. In terms of developing and emerging, are you still comfortable that you can compensate for currency with price, or do you think you've kind of tapped out your ability to use price as a lever at this point?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [7]\n\nI would say -- and you saw it a little bit in this quarter -- that we have had less price overall then maybe we've had in some markets. The rate of currency deterioration hasn't been as severe as it was, say, a year ago. On the other hand, there is still some opportunity for price in some markets. As we look at particularly Latin America, where you are seeing some pretty significant currency moves, those have been places where we have been able to get some price to compensate with that. In other markets around the world, it's been a little bit tougher to get price, particularly places like Western Europe or Australia, where there's been some currency softness.\n\nGail Glazerman, UBS - Analyst [8]\n\nOkay. Thanks very much.\n\nOperator [9]\n\nJason English.\n\nJason English, Goldman Sachs - Analyst [10]\n\nHey guys. Thanks for the question. A couple of housekeeping items, and I apologize if I missed this in the prepared remarks. You referenced the deflationary number ex-fiber in the press release. Can you talk about what you are seeing in the fiber complex? And then also give us a little more color on what's driving the higher administrative cost.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [11]\n\nYes, I think a couple of things. Fiber was about a push in the quarter. It normally would be in that number, so you are seeing fairly minor movements up and down on different grades of fiber. Eucalyptus is a little higher. Northern softwood is a little lower. Secondary fiber has been a little lower. So there's not been a lot of movement on that front. As we look rolling forward, we will see how that plays out, but we haven't seen much push from fiber.\nWhat was the other part of your question, Jason?\n\nJason English, Goldman Sachs - Analyst [12]\n\nHigher administrative costs this quarter.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [13]\n\nOh yes. G&A was more of a (technical difficulty) to last year was an unusually low quarter.\n\nJason English, Goldman Sachs - Analyst [14]\n\nGot it. That's helpful. One more question just in terms of China expansion strategy. I appreciate that you continue to sort of build out brick-and-mortar presence in more markets. Can you talk about how your strategy may be evolving with the booming eComm business as well as opening in more free trade zones and more participants in those markets or in the free trade zones?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [15]\n\nWe've been a leader in eComm in China. It's probably been at least a third of our diaper sales. And eComm grew faster than our overall business in China in the quarter. So we are aggressively going after that. And China, as you may know, has been a place that's been pretty competitive for a long, long time. So, I think everyone in the world sees the opportunity in China and has been investing there pretty aggressively. So, we see the Japanese competitors, other US competitors, some of the European competitors are there, and so it's a competitive marketplace for sure.\n\nJason English, Goldman Sachs - Analyst [16]\n\nGreat. Thanks a lot guys. I'll pass it on.\n\nOperator [17]\n\nChris Ferrara, Wells Fargo.\n\nChris Ferrara, Wells Fargo Securities, LLC - Analyst [18]\n\nGood morning. So I guess, on the US, are you seeing any competitive reaction to Snug N' Dry? I know to some extent Snug N' Dry is the re-phasing (technical difficulty) is a competitive reaction as well. But are you seeing anything from competitors with respect to promo? And how optimistic are you that share gains that you're picking up are sustainable at these sharper price points?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [19]\n\nThat's a good question. I would say there was -- we saw increased coupon activity which may be not as visible to you in some of the Nielsen data. We saw a pretty heavy advertising investment by key competition and so -- which I would say is about the kind of competitive reaction we would expect in a major relaunch like that. We would be approaching it the same way if our competitors was relaunching where you try to make sure you protect your franchise as much as you can.\nI think the share gains to this point have been fairly modest. If you look at kind of our fourth-quarter share, which is maybe our low point, year-to-date we are maybe up 1 point versus that level. So this quarter, our shipment share -- our shipment volume was a little bit ahead of our share progress as we've had some retailers that have build inventory because we had a few out-of-stocks that they wanted to try to take care of. Second quarter, that was sort of a reverse situation, so we kind of caught up a bit in the third quarter.\n\nChris Ferrara, Wells Fargo Securities, LLC - Analyst [20]\n\nGot it. Thanks. Then I guess China, you said net selling prices ran a little bit lower and volume really didn't decelerate very much. I guess, A, is that right? And then can you characterize what type of competitive pressure -- I mean is this diaper pants and Procter generally I guess? Any more color on that would be really helpful.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [21]\n\nIn China, our total diaper volume was up 15% -- our total diaper organic was up 15%. Volume was north of 20%. So you can do the math. Price was the balance. I would say it was -- in some cases, some of our non-US competitors, the Unitherms and Kaos, where they've had a relatively weaker home currency, were a little bit more aggressive on price, more so than other competitors in that market.\n\nChris Ferrara, Wells Fargo Securities, LLC - Analyst [22]\n\nOkay. Thank you.\n\nOperator [23]\n\nOlivia Tong, Bank of America Merrill Lynch.\n\nOlivia Tong, BofA Merrill Lynch - Analyst [24]\n\nThank you. So clearly a pretty nice quarter in personal care. Can you comment on the sustainability of that volume growth, particularly as you move into 2016 and you start to cycle some tougher comps?\nThe just longer-term, how do you think about pricing, particularly in North America? Because it looks like the moves that you've made on price have obviously resulted in better volumes than what the track channel data would apply, but just curious how you think about the volume versus price dynamic going forward.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [25]\n\nThis was a great question. So we've got a very strong innovation pipeline coming and really good execution in emerging markets. So, we're still very bullish on that. We are still seeing the superpremium segment of our categories grow in most of our major markets, even in Brazil where there has been a pretty severe currency hit to that economy year-on-year and quite a bit of price inflation. You are still seeing mom wants the very best product for baby, and we are seeing that in Russia. We continue to see that in China.\nThere's no question that the consumer is under pressure in some of those markets from a purchasing power standpoint, so we are watching that to see if category growth decelerates. Have not seen that to a great extent on the consumer side.\nWe've seen a little bit more of a reaction on the B2B side, so our KCP business was slower in the quarter in Brazil than our consumer business was. So that is one that we are kind of watching the dynamic in those markets where you are seeing a lot of pressure.\nIn the US, the pricing that we've done has been either surgical to get our value equation right on Huggies Snug N' Dry to make sure that we've got the right price gap versus our nearest midtier competition. And we are seeing reasonable returns from that in terms of the volume growth.\nOn the tissue front, where there was a little bit of price weakness in the quarter, that's been a story that's been going on for a while. I would say sequentially it was slightly better in terms of the competitive deep promotion price points pulled up a little bit. So we are not seeing as much of that. So again, it's more about trying to make sure we are competitive on shelf with the right offer and bring the right value to the consumer.\n\nOlivia Tong, BofA Merrill Lynch - Analyst [26]\n\nGot it. Thanks. That's really helpful. And then following up on feminine care, you had mentioned some incremental activity coming in Q4. Do you mean incremental like innovation, or more pricing promotion type adjustments?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [27]\n\nI'd say some of both. We'll have some product news and then some commercial innovation. So it will be a combination of strategic marketing where we will do some things in the advertising and digital marketing front, as well as some in-store activity. But I wouldn't view it as -- it's not going to be a straight hot price promotion to move volume. It's more strategic around product news.\n\nOlivia Tong, BofA Merrill Lynch - Analyst [28]\n\nGreat. Thanks a bunch.\n\nOperator [29]\n\nLauren Lieberman, Barclays.\n\nLauren Lieberman, Barclays Capital - Analyst [30]\n\nOn North America, two questions. So, one is on the personal care volume growth. I know, Tom, you started to mention there was a little bit of a catch-up or truing-up on inventory levels at retail and shipments versus 2Q. But just if you could talk about I guess the Nielsen data, which shows something close to 3% sales growth for you guys in terms of takeaway, but you reported 7%. So how much of that do you think is sort of the Impressa pipeline filled at the end of the quarter, some catch-up where there have been out-of-stocks last quarter. So that would be one bucket of questions.\nThe other would be on pricing. The sequential deceleration, how much of that was maybe sampling or couponing on Poise? Any kind of new activity on other areas of incontinence or in femcare? Because it did -- sort of got a little bit more sequentially and I believe that all of the price adjustments on Snug N' Dry had been in there last quarter. Thanks.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [31]\n\nThat's fair. I think, on the volume front, if you think about Poise Impressa, it's fairly small dollars in the quarter, really just getting started. So if you looked at our total adult care business in North America, it was up double digits overall on organic. If you took Poise Impressa out, it was up high single digits, so it didn't move the needle even in adult care all that much. But we do think it's going to be a nice category for us as we start to roll it out.\nOn the price overall, I would say there was -- probably most of it was in diapers, and so we do have a little bit of more training pant promotion in the summer months, so you saw a little bit of that in the third quarter. We had some -- we launched an improved Pull-Ups product in August, and so we put a little bit behind that to get that going. But those were -- largely it was -- most of the price promotion activity was in the diaper category.\n\nLauren Lieberman, Barclays Capital - Analyst [32]\n\nOkay, great. And then just sorry Tom, just to finish up on the volume, the Impressa piece was small, but do you think, other than kind of I guess the true-ups versus 2Q was what we saw in terms of shipments versus takeaway if we assume Nielsen engage (technical difficulty) for take-away. Do you think you're kind of back to even 2Q, 3Q combined in 4Q is sort of shipment and consumption match a little bit better?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [33]\n\nI would think that's the case. I think a lot of the inventory that went in was either to support customer service levels. They had some high out-of-stocks with a couple of customers, and so as we added the inventory, we saw better in-stock and better performance at retail. And so hopefully that investment continues to pay off for us and our retail partners.\n\nLauren Lieberman, Barclays Capital - Analyst [34]\n\nOkay. Great. And then if I could just ask one more in personal care margins. Margins up 100 basis points in that business, even with the down-drop in North America pricing and the 13% FX headwind to top line. So, can you just talk a little bit about what's really driving that? I know you loosely said cost savings, but it just seems like an enormous gap that you guys overcame.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [35]\n\nI'd say cost savings were good. Virtually all of the deflation, the raw material deflation, hits personal care, because tissue and KCP is mostly fiber-based and fiber was basically even sequentially, and so -- or year-over-year. So they got virtually all of the benefit there. We also got some price in some markets around personal care where we had some currency devaluation, and so that helped as well.\n\nLauren Lieberman, Barclays Capital - Analyst [36]\n\nOkay. Thank you so much.\n\nOperator [37]\n\n[Nyet Nuin, Xbodia Capital]. Please go ahead.\n\nNyet Nuin, Xbodia Capital - Analyst [38]\n\nThank you for your talk. I have a question on the outlook that you have for the Q4. You said organic sales growth contribute 3% to 4%. I wonder why you dropped a percentage of growth from this quarter to next quarter. And then the second part is about the cash flow. I see that the cash free cash flow has been reducing. So I wonder what is the reason why behind that. So there are two questions I have.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [39]\n\nSure. We adjusted our organic sales growth outlook for the year, so we are at 4.5% year-to-date, and we said we would be 4% to 5% for the year, and that's up from 3% to 5% in the previous quarter. So I guess the fourth quarter by definition is going to be pretty close to our trend rate for where we have been.\nOn the free cash flow, like everything else in our financial statements has been affected by changes in currency rates. And so as currency has weakened, our sales are smaller, our profits are under pressure from it. Our balance sheet is smaller and our cash flow is a little smaller. And so we've got lower cash earnings to start, predominantly due to currency, and then that flows through the overall cash flow statement.\n\nNyet Nuin, Xbodia Capital - Analyst [40]\n\nThank you. And just a follow-up on the currency question. So I see that a lot of companies are hurt by the stronger dollar compared to other markets. And since your company has a lot of sales in the emerging markets, do you have any other remedies or any other solutions in terms of trying to improve the situation beside endure the pain by the market?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [41]\n\nEssentially we -- our strategy is to maximize our local currency net income. And so we make most of our products in the country that we sell them in. And so part of our costs are denominated in local currency, and then a part are in dollar-based commodities. And we try to hedge that where we can. But we want to win in the local market and gain market share in the local market by delivering products that are relevant and meet the essentials for mom to care for her family.\n\nNyet Nuin, Xbodia Capital - Analyst [42]\n\nGot it. Thank you.\n\nOperator [43]\n\nAli Dibadj, Bernstein.\n\nAli Dibadj, Bernstein - Analyst [44]\n\nHey guys. So I want to get some help thinking about kind of how you feel the quality of your numbers are this quarter. Usually it's pristine, and this time, the top line is still very good but driven by, as you mentioned, price promo, some inventory, some things that make it sound like the topline isn't quite as sustainable going forward, truly if there's more competition. Your margins were a little bit worse than anticipated. FORCE was a little lower, but you made it up through taxes being a little bit lower, at least (technical difficulty) we had modeled, and certainly some higher buyback. So for a company that's usually very pristine on the quality, you're clearly dealing with these tough times. I'm trying to figure out how we should think about this as a little bit different than what we've seen over the past several quarters, I guess.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [45]\n\nActually, I was pretty happy with the quality of it. So kind as we looked at the 5% organic topline as pretty solid in this environment, and have been of the high end of the range that we have been aiming at, all volume, so really not any help from price to get there where, in other quarters, we've been in the 4% to 5% range with 3% volume and 2% price. So I'm pretty happy on the topline front.\nIn this environment where we are not getting as much price and where we've still got all the transactional currency hit, to cover it with cost savings and still deliver improved gross margin and improved operating margin was a pretty good performance. We held our advertising and promotion investment rate as a percent of sales in the quarter, which is a positive. The year-over-year margin comparison, G&A was really a low watermark for us last year, and we did kind of indicate that that probably wasn't going to be repeated.\nAnd then other income and expense was about a $30 million swing year-over-year. Last year had again from an asset sale and this year, we had currency transaction losses. And so when you net all of that down, you would say pretty good performance to have margin improvement in both gross and operating margin.\nAnd then below the line, taxes were a benefit. Mexico had a good quarter though, and Mexico was a nice uptick for us, which while it doesn't show up in all the operating lines, is still a very solid performance. So all in all, I would say we feel pretty good about the quality.\n\nAli Dibadj, Bernstein - Analyst [46]\n\nOkay. So many levers to pull in a tough environment, you can pull on them differentially to get to, again, good numbers throughout. If you could comment on FORCE, it sounds like that's just this quarter a little bit lower than it's been in the past, but feels like that's just kind of ramping up and may be a transition to new plans. And then other comments, if you could share --\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [47]\n\nOn FORCE, we delivered $85 million and we are at $285 million for the year-to-date. So we are on track with a $350-ish million kind of number, which is -- $85 million is pretty close to the run rate you would expect. And so, again, I would say good, solid work on negotiated material savings. Specifications and productivity all delivered a solid result there. And we do think there is more to come as we continue to build our global supply-chain capability.\n\nAli Dibadj, Bernstein - Analyst [48]\n\nOkay. And I just want to pick your brain because you guys are usually very open and have a lot of insight on kind of the market broadly. I want to know what you thought about this whole Walmart Wednesdays we're calling it, in terms of their panic and basically saying our margins will never be this high, and trying to react to what they believe is a normal trend in the consumer. How do you think CPG companies will interpret that or feel any repercussions of it, not short-term, but longer-term?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [49]\n\nThere is certainly a lot of change going on at Walmart. And we see them investing in the store experience. And if you've been in a Walmart a year ago and were in one today, I think you would see a difference. And we are seeing our business with them has continued to perform well. They are also investing in eCommerce, so I think they're doing a lot of the right things.\nAnd our job is to make sure we are winning with all of our customers, wherever mom wants to shop, and that we've got the right product and right offer on shelf. And so we are continuing to see -- do everything we can with them and our other customers to make sure we've got the right things happening in the retail space.\n\nAli Dibadj, Bernstein - Analyst [50]\n\nOkay. Thanks very much.\n\nOperator [51]\n\nJavier Escalante, Consumer Edge Research.\n\nJavier Escalante, Consumer Edge Research - Analyst [52]\n\nI would like to have some clarifications on the emerging market piece. If you can remind us what percentage of your sales are in Eastern Europe, which is growing at 45%, and how sustainable is that? Is it that -- I can see that the double-digit volume growth in Russia suggests like there is no price elasticity, or that you have a ton of pricing power in Russia. So could you help us understand what's happening in Eastern Europe that is growing 45%? Is it that you are gaining share to competitors? Is it that the category is on fire? So that would be my first questions. And then I have a couple of follow-ups on Brazil and China. Thank you.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [53]\n\nRussia and Eastern Europe is about a couple of percent of our overall company sales, so a relatively small market for us. And when you've seen what the ruble has done over the last year, you've seen lots of price inflation in that market. It's not unlike some of the Latin American markets where you've had significant inflationary impacts. And when you've got a lot of imported materials in your product, you wind up having to take price just to kind of keep your margins reasonably whole. And we've seen good response to diaper pants in that market, and so it's not just a straight price increase. We've also brought innovation and we are trying to watch and make sure we've got the right price pack architecture to hit the purchasing power that mom has got during her monthly purchase cycle.\n\nJavier Escalante, Consumer Edge Research - Analyst [54]\n\nAnd on China now, the 5% price decline, does it have to do with increased competition from Procter as they launch this premium baby line, or is it more like price mix as you go into lower tiers, or what exactly is driving this 5% down? Should you expect this to continue, that there's going to be some price erosion? Because I have a little bit of problem understanding the trade-up dynamic that you describe with the price decline that you are also citing.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [55]\n\nI think, in China, more of the price pressure has come from our non-US competitors, particularly the couple of Japanese competitors that are in that market, where they've had a relatively weaker home currency and have invested some of that as they've lost some share in China and we have been gaining share. So we're trying to make sure we keep our volume momentum going and that we match up with the right price points.\n\nJavier Escalante, Consumer Edge Research - Analyst [56]\n\nFinally, coming back to Brazil, you basically mentioned the personal care piece that is up 10%, which is very good. The diaper growth in China, the 5%, is all pricing. Did volumes decline as other companies are mentioning that is happening in Brazil? Do you have positive volumes in Brazil in diapers or did they decline?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [57]\n\nOur volumes in Brazil were pretty flat in the quarter, so all of the improvement was price mix. And we did take share leadership on diapers in the quarter in Brazil, but it was really more of our other competitors shrinking a bit. And we've also got femcare -- our leadership in femcare in Brazil as we've driven some innovation on both tampons and pads in that market. So we continue to see, even in a challenging market, when you bring in innovation and product news and bring products that mom wants, consumers are still willing to invest in your category.\n\nJavier Escalante, Consumer Edge Research - Analyst [58]\n\nI guess what I'm trying kind of to finalize with picking up these three BRIC countries has to do with the state of emerging markets because, back in the summer, the markets sold off thinking that emerging markets after what is happening in China would decelerate further. You haven't seen at the end of the day any change on the consumer side or something, because it's certainly not reflected in your numbers. So it doesn't seem that you're gaining a significant amount of share. So do you think that -- have you seen any step down, say, in consumer demand in any of these key emerging markets, or you didn't see it versus earlier this year prior to the sell-off of Chinese equities and the world, China going bankrupt? Thank you.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [59]\n\nI think we've seen some very modest slowdown in category growth, but less than you would think and less than you have seen in some other B2B categories. And so GDP per capita is still going up in most of these markets, not the economies that are in recession, obviously, but China for sure and a lot of the Asian economies. And so consumers still have more money to invest in our categories. We are also still seeing superpremium segments growing in a lot of these markets, so even in Brazil, where the upper tiers of the diaper category are growing at a faster pace, and they haven't slowed down appreciably.\n\nJavier Escalante, Consumer Edge Research - Analyst [60]\n\nThat is very insightful. Thank you very much.\n\nOperator [61]\n\nIain Simpson, Societe Generale.\n\nIain Simpson, Societe Generale - Analyst [62]\n\nThank you very much. I missed the start of the call, so apologies if these have already been asked. But firstly, you quantified the translational currency impact on profit. Are you able to give any sort of steer as to how we should think about the transactional impact? That would be extremely helpful. Thank you.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [63]\n\nIf you look at, in the quarter, our translational was about 12 points on the top line. Translation and transaction combined was approaching or north of 30 points. If you looked at it on a year-to-date basis, Paul, what is it? 25 points, something like that?\n\nPaul Alexander, Kimberly-Clark Corporation - VP IR [64]\n\nYes, it's about 10 points on the top line for translation, and the all-in impact on earnings is approaching 25%.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [65]\n\nYes, so 2 to 2.5 multiple of the translation impact is a good rule of thumb.\n\nIain Simpson, Societe Generale - Analyst [66]\n\nThat's extremely helpful. Thank you. And just secondly, if I may, you talked about eCommerce being about a third of your China diaper business. Are you able to give any indication as to how that's I guess trended over the past sort of medium-term, what that number would've been a couple of years ago or five years ago, or just anything to give us a sense as to kind of where that's come from and perhaps where it's going? Thank you.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [67]\n\nI think five years ago, eComm in China for us was probably near zero, or if it was there, we were not tracking it. And so we have put more resources against it and have grown that part of the business. And eComm in China is growing at a faster rate than our overall business. So we continue to see good returns there. And ultimately we are trying to be present with the right offer wherever mom wants to shop, and so we are not necessarily trying to shape the category in a particular direction. We just want to be there in whatever outlet or form she wants to buy our products.\n\nIain Simpson, Societe Generale - Analyst [68]\n\nThank you very much.\n\nOperator [69]\n\nBill Schmitz, Deutsche Bank.\n\nBill Schmitz, Deutsche Bank - Analyst [70]\n\nAre you concerned at all about some of the tradedown in a lot of the emerging markets, and like will you sort of adjust to that by maybe trying to launch some stuff at lower end, specifically in Brazil and China?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [71]\n\nWe were just talking about that on one of the other questions. So far, we are not seeing as much of the tradedown as you would think. We are still seeing -- we launched boy/girl diaper pants in some of the superpremium tiers. We are seeing good response and growth there. So we are watching it. And obviously particularly the economies that are in recession, like Brazil and Russia, we are watching that to see how the consumer performs and make sure we've got the right offer. But we are also seeing that when you bring really good innovation, mom still wants the best for her baby. These are not expensive products relative to other things, and she is still willing to buy those little luxuries for her family.\n\nBill Schmitz, Deutsche Bank - Analyst [72]\n\nOkay. Just because if you look in China and in Brazil, it's like Hypermarcas has taken a bunch of share, and I know they're for sale. We talked about that last time. But even like Jiangnan, it seems like they're making a pretty big comeback in some of the Nielsen data. Obviously, your share is growing as well. It seems like some of mid-tier players are the ones that are getting hit.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [73]\n\nAnd eComm and superpremium baby stores in China is stuff that isn't tracked as well, and that's where a lot of the growth in the category is.\n\nBill Schmitz, Deutsche Bank - Analyst [74]\n\nOkay. That's helpful. And then I know you don't want to give guidance for next year, but when do you think you're going to get sort of the peak benefit from falling commodities sort of net of the currency becoming less onerous? And I know you sort touched on it a little bit, but has there been any sort of pushback by retailers on some of the pricing stuff, especially on the diaper side, because obviously polypropylene prices are way down?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [75]\n\nWe'll give you guidance in January. At this point, it's still a pretty volatile environment. If you look at exchange rates at the end of September and then today, they've moved quite a bit in both directions depending on where you are at. Commodity costs have been a little more stable if you still look at a lot of the forward forecast for oil at $20 a barrel higher next year than it is right now. And so we are still wrestling through that and we will have a point of view for you in January when we are a little closer to the year actually getting underway. At this point, we still believe our model is right, continuing to look to 3% to 5% organic and delivering a positive result and margin improvement in that kind of an environment.\n\nBill Schmitz, Deutsche Bank - Analyst [76]\n\nOkay. And the retail discussions, are they getting any more aggressive? Because obviously they see what's happened, at least with some of the spot prices in some of your categories on the commodity side.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [77]\n\nI would say not in the US. And I think that -- and in emerging markets, the currency impact dwarfs any commodity cost benefit in most markets.\n\nBill Schmitz, Deutsche Bank - Analyst [78]\n\nOkay. That's very helpful. Thank you very much.\n\nOperator [79]\n\nCaroline Levy, CLSA.\n\nCaroline Levy, CLSA Limited - Analyst [80]\n\nGood morning. I'm wondering if you can talk a little bit about adult care in the US, and just how P&G's entry has impacted you. I think Impressa is a different issue I guess. It only just launched. But in general sort of the non-diaper personal-care business, specifically looking at adult as well.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [81]\n\nSince Procter has launched, the category has grown a little faster. And so we've seen -- we went from kind of mid to high single-digit growth to double-digit growth and have seen that happen pretty consistently. We had double-digit growth in the quarter, including the benefits of Impressa, which were relatively modest but still helped us. We've launched a lot of innovation in the last year to make sure that our consumers have the very best products we can offer available. And so as a result, I think we'd probably say we've successfully defended? We've lost less than our fair share as Procter has come in and delivered solid growth. I'm sure P&G talks about this later this week. They'll talk about a successful launch. And they have probably hit their share goal. So private label and some of the other brands have taken a disproportionate hit from the P&G entry. So in the meantime, we just are keeping our foot on the gas to make sure we've got great innovation coming in that space, and Poise Impressa is just another good example of that.\n\nCaroline Levy, CLSA Limited - Analyst [82]\n\nThat's great. Thank you. I know you talked about Mexico getting better again. I also missed part of the call because Coke was going on at the same time. But it seems like Brazil is deteriorating as an economy. What is going on in Mexico that you see, good and bad, over the next 12 months from where you stand?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [83]\n\nMexico is -- I'm cautiously optimistic there. Pablo and the team will be on a call later this week and can give you more color, but that team is executing well and they are getting some price to cover some of the currency impact that they have hit, seen good volume growth and good cost savings, and good margin performance. So, we are encouraged by what we are seeing there. The economic growth and the economy has been a little slower than they would have hoped at the beginning of the year, but we also see some optimism that that's going to improve going forward a bit, particularly as the US economy improves a bit.\n\nCaroline Levy, CLSA Limited - Analyst [84]\n\nThank you. And then just China, briefly. I think you started to talk a bit about femcare, which was not really in the conversation before. Can you talk about that in more detail?\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [85]\n\nYes. We are still a very small player in femcare in China. We relaunched probably a little over a year, probably a year and a half ago now, Paul?\n\nPaul Alexander, Kimberly-Clark Corporation - VP IR [86]\n\nYes.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [87]\n\n-- and saw double-digit growth in the quarter, and we are seeing some share improvements. We are not in as many cities with femcare yet as we are with our diaper business, but we are growing nicely and have good innovation there. And it's around the U by Kotex type positioning with -- aimed at the late teen/early 20s young woman as she is taking some brand choices for her life, and making sure we've got a relevant, interesting product with a good commercial execution for her.\n\nCaroline Levy, CLSA Limited - Analyst [88]\n\nThanks so much.\n\nOperator [89]\n\nWe have no further questions at this time. I'll turn the conference back over to you.\n\nPaul Alexander, Kimberly-Clark Corporation - VP IR [90]\n\nWe thank everyone for your questions today and we will end with a comment from Tom.\n\nTom Falk, Kimberly-Clark Corporation - Chairman, CEO [91]", "external_links": [], "published": "2015-10-22T03:00:00.000+03:00", "crawled": "2015-10-22T08:06:29.993+03:00", "highlightTitle": ""}