{"organizations": [], "uuid": "5b5f687c284b7bd57f47679aa3aea086a6b61b08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/michael-gove-needs-tough-crime-193122678.html", "country": "US", "title": "Michael Gove needs to be tough on crime and tough on the causes of crime", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Michael Gove needs to be tough on crime and tough on the causes of crime", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:31:00.000+03:00", "replies_count": 0, "uuid": "5b5f687c284b7bd57f47679aa3aea086a6b61b08"}, "author": "", "url": "https://uk.finance.yahoo.com/news/michael-gove-needs-tough-crime-193122678.html", "ord_in_thread": 0, "title": "Michael Gove needs to be tough on crime and tough on the causes of crime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael Gove"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Oct 14, 2015, 21:03 BST - UK Markets closed Michael Gove needs to be tough on crime and tough on the causes of crime By Allister Heath | Telegraph – 32 minutes ago 0.00 0.00 \nViolent assaults may have fallen but now is not the time to get complacent about crime \nOne of Britain’s greatest social triumphs of the past 20 years has been the dramatic reduction in crime. \nBurglary, violent crime and theft are down by around two-thirds since 1995, the year when crime peaked; vehicle break-ins have slumped by over three quarters. \nPreviously no-go areas are bustling , our urban centres have become places where the middle classes want to live and London, now a much safer place to live than Paris, is booming. \nYet this remarkable achievement has gone largely uncelebrated, for understandable reasons. The war will never be won: far too many people still fall victims to callous thuggery every day while the digital revolution has given rise to a new generation of lawbreakers. \nThe latest British Crime Survey , our least unreliable annual measure, will include for the first time an estimate of the level of cybercrime , adding millions of offences to the analogue total of under 7m. \nThe authorities’ incompetence hasn’t helped: they turned a blind eye to disgraceful sex abuse by some 1970s celebrities and latterly chose to ignore the horrific going-ons in Rotherham . They are now over-compensating by allowing unfounded accusations to ruin lives and reputations, while continuing to behave in a way which suggests that they no longer take “low-level” theft seriously. It’s a shameful mess. \nPerhaps the greatest reason why nobody is celebrating our two-decade drop in crime is that it is unclear whether it will continue. \nThe explosion in cybercrime is one major risk; another is that the police and prison authorities may be unwilling or unable to reorganise themselves to cope with austerity. The government rightly needs to slash spending, and yet it cannot afford to go soft on crime. The protection of life, liberty and property is the state’s core function; it would be unforgivable were a Tory administration to forget this. \nThe government needs to learn the lessons from the past 20 years, work out what it got right and what it got wrong, and devise new ways of doing more with less. Michael Gove, the Lord Chance llor, is approaching the task with his usual gusto , but he must tread carefully. \nMuch of the decline in crime has been due to factors not in the government’s control; cutting spending will have no impact on these. Second-hand goods prices have fallen, making it less worthwhile for people to steal. Alcohol consumption has slumped. The public has taken crime prevention into its own hands, fitting better locks, shelling out for monitored burglar alarms and being generally much more careful. \nBut a dramatic change in public policy, initiated by Michael (now Lord) Howard in the 1990s when he was Home Secretary, also made a crucial difference. \nHe launched a historic fight-back against the cultural Marxism that had infected British criminal justice from the 1960s. In its extreme form, this held that criminals were the oppressed crusaders for justice engaged in a form of freelance socialism, redistributing wealth from the undeserving bourgeoisie. \nInstead, the Tories argued that with only a very few exceptions, individuals should be held responsible for their crimes. We should never be indulgent towards those who defy our civilisation’s fundamental rules; criminals should pay a heavy price for their actions. \nThe real victims are those who have suffered the crime, not the perpetrators; any society that loses the ability to make this key moral distinction will condemn itself to catastrophic decline. \nTwo sets of factors explain why people commit crimes. The first relate to self-interest and the perception that it pays to break the law; the second involves values. The answer to the former is to drastically increase the cost of crime: lock up criminals for longer or fine them more heavily, increase the chance of them being caught, or both. \nThe answer to the latter is far trickier: it requires strengthening families, shifting values, improving education and engaging with those whose background suggests they are likely to become criminals. \nThe Tories and then New Labour successfully pursued the first strategy, emboldened by New York’s embrace of zero tolerance policing; criminals were punished severely and the prison population shot up. But both failed to address the second set of factors. \nMr Gove’s challenge is to try to tackle them while not giving up on the need to deter potential wrongdoers, all with reduced budgets. \nContrary to what some have claimed, he has not gone soft on crime. He rightly argues that prisons “do work in isolating dangerous offenders from the rest of society, contributing to safer homes and streets”. But he adds, just as correctly, that they are failing to rehabilitate offenders: 45 per cent of adult prisoners reoffend within one year of release, and two-thirds of minors. \nSo what can he do? He must start off by finding additional efficiency gains in the running of our prisons. \nThe overall cost of a place was £36,237 in 2013/14 (though it’s a little less per actual prisoner): while this has already fallen significantly, it remains above the fees for Eton, currently £35,721 per year. Old inner-city prisons could be sold to developers, paying for larger ones in cheaper locations. \nPaul Kirby, a KPMG partner, has some great ideas that Mr Gove should examine. Technology could allow a far greater use of house arrests; these could be cheap yet harsh and involve webcams in every room, bans on visitors, censored communication, blood tests and compulsory literacy lessons via Skype. \nSome inmates could be forced to find weekend jobs while spending the week in prison; some parents could be allowed to look after their children in the evening while being forced to work or remain confined during the rest of the day. \nSome offenders could be given flexi-prison terms, allowing more people to be incarcerated in total. Inmates would not mix as much with other criminals, and there would be a much greater emphasis on rehabilitation, yet such programmes, if structured properly, would nevertheless be seen as a harsh punishment and deterrent. \nIt (Other OTC: ITGL - news ) should pain all good Tories to admit it, but Mr Gove’s task is to take Tony Blair’s infamous slogan and actually deliver on it: he must be tough on crime and tough on the causes of crime.", "external_links": [], "published": "2015-10-14T22:31:00.000+03:00", "crawled": "2015-10-14T23:03:14.457+03:00", "highlightTitle": ""}