{"organizations": [], "uuid": "408fbdbbbba0d35748b275993e8fae9a72e3f7eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l.yimg.com/bt/api/res/1.2/zKHLkq0jbnWfemb8F6Qn5g--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://globalfinance.zenfs.com/en_us/News/Reuters/980b4860d32f3b3cae48acd3aaafefb2.cf.png", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/goldman-sachs-oil-rally-not-105226428.html?l=1", "country": "GB", "title": "Goldman Sachs: This Oil Rally Is Not Going to Last", "performance_score": 0, "site": "yahoo.com", "participants_count": 2, "title_full": "Goldman Sachs: This Oil Rally Is Not Going to Last - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:00:00.000+03:00", "replies_count": 10, "uuid": "2f997f6774e692dd5cf06872229c78a2bdf0eec8"}, "author": "Luke Kawa", "url": "http://finance.yahoo.com/news/goldman-sachs-oil-rally-not-105226428.html?l=1#post-0", "ord_in_thread": 0, "title": "Goldman Sachs: This Oil Rally Is Not Going to Last", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nPumping jacks stand near an Anadarko Petroleum Corp. oil rig site in Fort Lupton, Colorado, U.S., on … \nOil has been surging this week but Goldman Sachs is calling for gains to be short-lived.\nThe front-month West Texas Intermediate futures contract enjoyed a double-digit advance in recent days, breaking above $50 per barrel on Thursday for the first time since July:\n\"While this rally has occurred alongside a broader re-risking across assets after last week's U.S. non-farm payrolls release, the oil move has been larger, exacerbated by still large short positioning and the break of key technical levels,\" wrote Jeffrey Currie, head of commodities research at Goldman Sachs. \nCurrie writes that we've seen this play before, pointing to the parabolic surge in oil prices in late August that occurred following the massive equity market selloff.\nThe problem, according to Goldman, is that the fundamentals have not changed: in spite of the start of a roll-over in U.S. production, the market remains oversupplied. While the shale revolution was what provided the impetus for the plunge in oil prices seen over the past year, Currie claims that the oil glut is now being sustained by production outside the U.S.\nMore from Bloomberg.com: In North America's Costliest City, Rich Chinese Take the Blame \nThe U.S. dollar index has given back ground over the past two weeks amid growing confidence that the Federal Reserve will refrain from lifting interest rates in 2015. But Currie claims continued inaction from the central bank isn't necessarily a boon for crude prices; in fact, he contends that it would have the opposite effect.\nWhile \"a Fed on hold could offer some reprieve to the emerging market rebalancing, this decision would ultimately be driven by weaker underlying activity, leaving risks to oil demand and our forecast skewed to the downside,\" he wrote. \"Net, we expect this rally to reverse and reiterate our forecast for lower prices for longer.\"\nMore from Bloomberg.com: Man Who Called China's Boom and Bust Says Use This Rally to Sell \nOne month ago, Goldman's commodities team indicated that the price of crude could fall as low as $20 per barrel and stay at relatively depressed levels for up to a decade and a half . \nMore from Bloomberg.com\nGross to Sue Pimco for 'Hundreds of Millions' Over Ouster It’s Apple’s World, So Why Do Other Smartphone Makers Even Bother? Billionaire’s Dropout Grandson Wants to Kill Work E-mail Read Goldman Sachs: This Oil Rally Is Not Going to Last on bloomberg.com\nGoldman Sachs", "external_links": [], "published": "2015-10-09T03:00:00.000+03:00", "crawled": "2015-10-09T23:55:42.147+03:00", "highlightTitle": ""}