{"organizations": ["BP plc & Royal Dutch Shell Plc"], "uuid": "fcee82c372affd21224b5ad2718a9baeb6a338c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/bp-plc-royal-dutch-shell-105311145.html", "country": "GB", "title": "BP plc & Royal Dutch Shell Plc Are Up 15% In A Week. Are They Still Cheap Enough To Buy?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "BP plc & Royal Dutch Shell Plc Are Up 15% In A Week. Are They Still Cheap Enough To Buy?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:53:00.000+03:00", "replies_count": 0, "uuid": "fcee82c372affd21224b5ad2718a9baeb6a338c8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/bp-plc-royal-dutch-shell-105311145.html", "ord_in_thread": 0, "title": "BP plc & Royal Dutch Shell Plc Are Up 15% In A Week. Are They Still Cheap Enough To Buy?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 8, 2015, 11:57 BST - UK Markets close in 4 hrs 33 mins BP plc & Royal Dutch Shell Plc Are Up 15% In A Week. Are They Still Cheap Enough To Buy? By Harvey Jones | Fool.co.uk – 4 minutes 48 seconds ago 1,821.9999 +6.9999 \nIt has been a rough few years for FTSE 100 listed oil giants BP (LSE: BP) and Royal Dutch Shell (LSE: RDSB), but suddenly the downwards trend has reversed. Both stocks are up around 15% in the last week, driven by higher oil prices as Brent crude creeps above $50 a barrel. This offers much-needed respite for investors, but it will come as a shock to those who expected prices to fall even further. Can it continue? \nOil bounced this week as Vladimir Putin ratcheted up tensions with his aggressive Syria intervention, and was given a further lift by as yet unsubstantiated rumours of Chinese stimulus. Russia is keen to open talks with OPEC over current high production levels, and with OPEC members hurting as well, they might be open to persuasion. \nCrude Facts \nYet a recovering oil price is far from a one-way bet. Latest figures show US crude inventories rising by 3.1 million barrels in recent weeks, suggesting that supplies remain high. Supply is only one side of the equation, however, and the US Energy Information Administration (EIA) recently forecast that demand in 2016 could rebound at the fastest rate for six years. \nI would normally expect the oil price crash to have fuelled demand but these are strange times. The EIA also noted that demand is down year-on-year even though prices are $40 a barrel lower than 12 months ago. Unless there are fresh reasons driving oil higher, the price recovery could stall. \nBP Or Not BP \nI expected BP to be cheaper, given its troubles, but it trades at a forecast P/E of more than 16 times earnings, against a more reasonable 12 times at Shell. Both companies offer juicy dividends, yielding around 6.5%, and those look safe enough for now. Unless the oil price substantially recovers they could eventually prove too much of a drain on company resources. \nIf the IMF is right to scare everybody about an impending $3 trillion global crunch, then the oil price could struggle to make headway. Personally, I would be surprised to see oil anywhere near today's lows this time next year, but, as we have seen, oil has a remarkable ability to surprise. \nVolatile Times \nAt least BP has now finally settled all major claims from the Gulf of Mexico oil spill, which gives investors a bit more clarity. Investors in Shell may be reassured by chief executive Ben van Beurden's recent claim that the company is \"pulling out all the stops\" to safeguard its dividends and buy-back programme, and to keep its investment programme steady for the future. \nAt 387p and 1825p respectively, BP and Shell are both trading way below their 52-week highs of 487p and 2408p. They remain a recovery play even if you missed out on the latest rally. But there seems little need to panic buy. This week's resurgence is welcome, but there is plenty more volatility to come. \nThere are plenty more top dividend stocks on the FTSE 100 if you know where to look. \nThe Motley Fool's 5 Shares To Retire On don't just offer long-term growth, but juicy yields of more than 4% as well. \nIf you'd like to find out the identity of these five top companies, and how their shares could fuel your retirement, simply click here now for instant access. \nHarvey Jones has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-08T13:53:00.000+03:00", "crawled": "2015-10-08T13:57:46.979+03:00", "highlightTitle": ""}