{"organizations": [], "uuid": "c561f6bfa86813480101da1b582293853b4e1e3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/laurengensler/2015/10/22/retirement-plans-fiduciary-change-impact-investing/", "country": "US", "title": "Coming Soon: More Green And Social Options In Your 401(k)", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "Coming Soon: More Green And Social Options In Your 401(k)", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:55:00.000+03:00", "replies_count": 0, "uuid": "c561f6bfa86813480101da1b582293853b4e1e3d"}, "author": "Lauren Gensler", "url": "http://www.forbes.com/sites/laurengensler/2015/10/22/retirement-plans-fiduciary-change-impact-investing/", "ord_in_thread": 0, "title": "Coming Soon: More Green And Social Options In Your 401(k)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Employees could soon begin to see more investment options in their 401(k)s -- namely, the kind that seek to make both a financial return and a positive impact on the world. On Thursday, U.S. Secretary of Labor Thomas Perez said that the fiduciaries who manage employer-sponsored retirement plans should no longer harbor any prejudices against investments just on the basis that they seek to make an environmental or social impact.\" Investing in the best interests of a retirement plan and in the growth of a community can go hand in hand,\" Perez said at a press conference in New York City, noting that he rejects the notion there is a false choice involved.[caption id=\"\" align=\"\" width=\"4000\"] Thomas Perez: It's A-OK for fiduciaries to consider investments with a double bottom line (David Banks/Bloomberg)[/caption]This announcement paves the way for more people, through their workplace 401(k)s as well as pension funds, to invest in things like green bonds and mutual funds that take into account environmental, social and governance factors.The government has backtracked on 2008 guidance that discouraged these investments by making them sound unsuitable under fiduciary obligations. Managers of employer retirement plans steered away from investments that touted non-financial returns because they feared running afoul of government guidelines.\"We've been told this has had a chilling effect,\" said Perez. \"It gave cooties to impact investments.\"Since 2008, though, this space has exploded. The big Wall Street banks have gotten on board and there are more investment options available across all asset classes than ever before. Demand has been rising, too. As of 2014, one out of every six dollars under professional management in the U.S. took into account environmental, social or governance issues, according to U.S. SIF.Still, people saving for retirement through an employer plan have been left on the sidelines. \"A large number of investors want to invest for both social impact and financial return, and today’s announcement will enable Americans saving for retirement to more easily do exactly that,\" said Audrey Choi, CEO of the [entity display=\"Morgan Stanley\" type=\"organization\" subtype=\"company\" active=\"true\" key=\"morgan-stanley\" ticker=\"MS\" exchange=\"NYSE\" natural_id=\"fred/company/2944\"]Morgan Stanley[/entity] Institute for Sustainable Investing.The new guidance \"democratizes\" the ability for more people to use their dollars for financial and real world impact, as Matthew Patsky, CEO of Trillium Asset Management, puts it.Of course, the government is just giving fiduciaries the green light to consider these investments along with all the others out there. \"Financial return should be the yardstick,\" said Perez. \"Fiduciaries may take social impact into account as 'tie-breakers' when investments are otherwise equal with respect to their economic and financial characteristics.\"Investments that seek a so-called double bottom line have gotten a bad rap and have long been seen as delivering lower returns than traditional investments. Yet, recent research has sought to bust this myth. In a recent study of 10,000 mutual funds by Morgan Stanley , sustainable stock funds were found to have met or even exceeded median returns of traditional stock funds 64% of the time.Ultimately it will be up to fiduciaries to assess whether these investment options are in the best interest of employees, and, for 401(k) participants, whether or not they want to invest.\"One of the hallmarks of defined contribution plans is choice,\" said Judy Mares, Deputy Assistant Secretary with the Employee Benefits Security Administration. \"Participants in those plans choose with their dollars when they get a fund line-up.\" For more, read: Double Duty Dollars: Behind The Crazy Idea That Investors Can Make Money And Change The World At The Same Time", "external_links": ["http://specials-images.forbesimg.com/imageserve/35117006/x.jpg"], "published": "2015-10-23T03:55:00.000+03:00", "crawled": "2015-10-23T00:16:30.668+03:00", "highlightTitle": ""}