{"organizations": ["Brain Health Initiative Canada", "WBHI", "Global Alliance on Women's Brain Health", "Alzheimer's Research UK", "Geoffrey Beene Foundation Alzheimer", "Cleveland Clinic/Lou Ruvo Brain Institute", "Global Alliance", "Brain Health", "United Kingdom Announce Global Alliance on Women's Brain Health Unprecedented", "United Kingdom Announce Global Alliance"], "uuid": "1fc2bfb6655815ee6b57398f1473917f525de9ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newswire.ca", "main_image": "", "site_section": "http://rss.newswire.ca/en/newswire/rls_fnc_en.xml?0E4CAE8E599E11E2B9D5B34A46C71D46", "section_title": "CNW :  Financing Agreements", "url": "http://www.newswire.ca/news-releases/leaders-from-canada-united-states-and-united-kingdom-announce-global-alliance-on-womens-brain-health-537059151.html", "country": "CA", "title": "Leaders from Canada, United States, and United Kingdom Announce Global Alliance on Women's Brain Health", "performance_score": 0, "site": "newswire.ca", "participants_count": 0, "title_full": "Leaders from Canada, United States, and United Kingdom Announce Global Alliance on Women's Brain Health", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T14:00:00.000+02:00", "replies_count": 0, "uuid": "1fc2bfb6655815ee6b57398f1473917f525de9ed"}, "author": "", "url": "http://www.newswire.ca/news-releases/leaders-from-canada-united-states-and-united-kingdom-announce-global-alliance-on-womens-brain-health-537059151.html", "ord_in_thread": 0, "title": "Leaders from Canada, United States, and United Kingdom Announce Global Alliance on Women's Brain Health", "locations": ["United States", "North America", "USA", "Canada", "TORONTO", "Africa", "UK", "Asia", "U.K."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jill Lesser", "Lynn Posluns", "Hilary Evans"], "text": "Not for profit Leaders from Canada, United States, and United Kingdom Announce Global Alliance on Women's Brain Health Unprecedented partnership to raise awareness of women's brain health challenges and significantly expand funding for sex-based brain health research TORONTO , Oct. 26, 2015 /CNW/ - The Women's Brain Health Initiative Canada, WomenAgainstAlzheimer's USA , Alzheimer's Research UK, and 21st Century BrainTrust® announced that they have formed the Global Alliance on Women's Brain Health to raise awareness of women's brain health challenges and significantly expand funding for sex-based brain health research, that benefits both men and women.The Global Alliance on Women's Brain Health will define a scientific agenda, drive new funding for research, and convene scientific leaders to assure the most rapid and effective scientific strategies in women's brain health. It will also raise awareness at the public and private levels of the health, economic and social tsunami that will result without gender-sensitive focus and investment. \"The latest research confirms dementia develops faster in women than in men, women are more vulnerable to Alzheimer's, and not just because we live longer,\" said Lynn Posluns , President, Women's Brain Health Initiative. \"What is not clear, though, is why. If scientists can figure out the mechanism that causes more Alzheimer's disease in women, they might be able to develop treatments that halt the process. This is the type of research the Global Alliance will fund, for a healthier outcome for both men and women.\" With the population of the world aging and much of the increase in dementia taking place in low- and middle-income countries, the Global Alliance on Women's Brain Health also plans to expand to regions outside of North America and the U.K., including Africa and Asia .\"Today, there is virtually no concerted drive to fund research on women's brain health around the world and no global cooperation among women leaders. Yet, the data reveals that women's brains are more vulnerable to Alzheimer's disease and other problems associated with cognitive function,\" said Jill Lesser , President of WomenAgainstAlzheimer's. \"The time is now to mobilize a global sense of urgency and to advance an understanding of why women experience dementia differently and to develop effective treatments and a cure that meet women's needs.\"\"Women have been looking into the wrong mirror when it comes to Alzheimer's. We are either in denial or overwhelmed. It's a disease that emotionally and financially jeopardizes families and makes us all 'second-hand victims'. It is time we are empowered as active partners in research. It's critical that what happens to us be factored into the data,\" said Meryl Comer , co-founder of the 21st Century BrainTrust and president of the Geoffrey Beene Foundation Alzheimer's Initiative. \"The way to beat the odds is for women leaders globally to leverage their economic and political clout.\" Worldwide, 46.8 million people have Alzheimer's or a related dementia with numbers set to increase to 74.7 million by 2030 and 131.5 million by 2050. In Canada , the combined direct (medical) and indirect (lost earnings) costs of dementia total $33 billion per year . The global cost of Alzheimer's and dementia is estimated to be $605 billion , which is the equivalent to 1% of the entire world's gross domestic product. Women's brains are more vulnerable to Alzheimer's disease and other problems associated with cognitive function. Women are twice as likely as men to have Alzheimer's and dementia and twice as likely to care for a loved one with the disease. Yet, until now, there has been virtually no concerted drive to fund research on women's brain health around the world and no global cooperation among women leaders.\"Alzheimer's disease and dementia have a devastating impact on all those whose lives it touches, but it's a 'triple whammy' for women: more women are dying of dementia, more women are having to bear the burden of care and more women are leaving dementia research careers. The experiences of these women underline the urgent need to tackle the diseases that cause this life-shattering condition. In recent decades we've seen increased investment in areas like cancer have a real impact, and we need to emulate that success for dementia. Only through research can we find ways to treat and prevent dementia, and transform the lives of the hundreds of thousands affected,\" said Hilary Evans , Chief Executive of Alzheimer's Research UK. Women's Brain Health Initiative (WBHI) is a Canadian charitable organization inspired to combat women's brain health disorders through investment in focused, innovative research at leading institutions around the world. WBHI supports urgently-needed, leading-edge, peer-reviewed research on women's health and brain aging, to improve diagnostic and treatment methods. Ultimately, this research will improve brain health outcomes for women throughout the world. WBHI's awareness and fundraising initiatives include education programs and sales of the iconic Hope-Knot. All monies raised are managed by the WBHI in accordance with its board-approved governance policies on investments and distribution of funds. Connect with the WBHI @womensbrains and facebook.com/womensbrains. WomenAgainstAlzheimer's , a network of UsAgainstAlzheimer's, unites women across the globe to find a cure for Alzheimer's. Our growing network of women is impatient with the slow progress being made in the Alzheimer's fight. Driven by our passion we are committed to disrupting current \"business as usual\" approaches to funding, research, and advocacy in order to bring Alzheimer's out of the shadows and into the spotlight. We will aim to bring the energy and commitment from the Global Alliance to our other priority areas in driving public funding for research in gender sensitivity, clinical trial recruitment, lessening the burden of care and promoting dementia friendly communities. Because women won't wait. www.womenagainstalzheimers.org , Twitter @WomenAgstAlz Alzheimer's Research UK is the UK's leading dementia research charity, and the second largest charity funder of dementia research in the world. We are funding £26 million in world-class research at leading universities and research institutions across the UK and to date have funded nearly £62 million in research projects. Our goal is a world free from dementia. As research experts, we are committed to finding new ways to diagnose, prevent, treat and cure dementia. Our research strategy is targeted to deliver research that offers most potential for health benefit. Increased and sustained investment in research is critical to help deliver the treatments and outcomes that will offer hope to people living with dementia and reduce the huge societal and economic burden. The 21st Century BrainTrust® (21CBT) is a virtual research ecosystem designed to empower personal brain health and support early diagnosis using self-administered mobile applications for personal measurement and monitoring of cognition. Its' mission is to engage a new generation of innovation: think new digital biomarkers, mapped using the power of self-administered cognitive testing as a sensitive, early screening tool for all brain traumas, Alzheimer's and related dementias. 21CBT promotes novel technologies that offer low-cost screening capabilities for future prevention trials to facilitate enrollment as well as exploratory trial endpoints. The 21st Century BrainTrust® is a collaboration by the Geoffrey Beene Foundation Alzheimer's Initiative, BrightFocus Foundation, Cleveland Clinic/Lou Ruvo Brain Institute and UsAgainstAlzheimer's. \nSOURCE Women's Brain Health Initiative (WBHI) \nFor further information: For media inquiries please contact: Fiona Robinson, 416-484-1132 ext. 6, fiona@brown-cohen.com, Brown & Cohen Communications & Public Affairs Inc. Release contains wide tables.", "external_links": [], "published": "2015-10-26T14:00:00.000+02:00", "crawled": "2015-10-26T14:44:33.838+02:00", "highlightTitle": ""}