{"organizations": [], "uuid": "fde409264776e883b23f768df573d954410c3f13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.euractiv.com", "main_image": "http://www.euractiv.com/sites/default/files/466579905_bff383bbfe_o.jpg", "site_section": "http://www.euractiv.com/sections/euro-finance", "section_title": "Euro &amp; Finance | EurActiv", "url": "http://www.euractiv.com/sections/euro-finance/juncker-eyes-single-seat-eurozone-imf-318744", "country": "GB", "title": "Juncker eyes single seat for eurozone at IMF", "performance_score": 0, "site": "euractiv.com", "participants_count": 2, "title_full": "Juncker eyes single seat for eurozone at IMF | EurActiv", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:18:00.000+03:00", "replies_count": 1, "uuid": "fde409264776e883b23f768df573d954410c3f13"}, "author": "Jorge Valero", "url": "http://www.euractiv.com/sections/euro-finance/juncker-eyes-single-seat-eurozone-imf-318744", "ord_in_thread": 0, "title": "Juncker eyes single seat for eurozone at IMF", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The European Commission presented a “realistic” proposal on Wednesday (21 October) to create a single seat for the eurozone in the International Monetary Fund - a controversial idea that has been put aside for many years.\nIn light of the opposition of the largest eurozone economies, and the lack of appetite for further integration at this stage, the legislative text eyes 2025 as the deadline for the establishment of this representation.\nCommission Vice-President for the Euro, Valdis Dombrovskis, insisted that “it is in the interest of all euro member states” to progress toward this single seat. He stressed that the eurozone punches below its economic weight at the IMF due to the national divisions. Despite similar proposals which have been on the table for more than two decades, the Latvian Commissioner hoped that “this time we can move faster”.\nIn order to reach this goal, the executive proposes a gradual process in which one or several constituencies of eurozone members will be created with the ultimate goal of setting up a single seat. However, the details are still vague on how the process will move forward, and what criteria will be followed to create the constituencies.\nThis euro-seat will not impede member states being eligible for an IMF loan, as national governments would remain individual members of the Fund, according to the Commission’s proposal.\nPresident Jean-Claude Juncker made a more coherent external representation of the euro among his priorities when he took office in 2014. The idea was included in the Five Presidents’ Report to complete the economic and monetary union (EMU).\n>>Read: EU's 'Five Presidents' lay out eurozone vision, with timetable\nHowever, the biggest European economies sitting in the Fund’s Executive Board (Germany, France and Italy) consider that they have a better chance of influencing the decision-making process and of protecting their national interests by acting individually. In addition, some institutional differences complicate the harmonization process. While France sends its representatives from the Ministry of Finance, Germany’s envoys come from the Bundesbank. Therefore, Berlin’s views are dominated by its monetary policy priorities, while Paris keeps a broader economic view.\nEU officials explained that 2025 is a “realistic” timetable to reach this goal, although they acknowledged that the discussion has yet to start with the various capitals. In their view, this long deadline does not represent “lack of ambition” but it is rather a “pragmatic approach”, they argued.\n>>Read: Juncker and Draghi fail to win support for euro zone reform\nIn order to progress, there will be new rules concerning the internal governance of the eurozone constituency or constituencies; and a coordination mechanism to guide positions to be taken at the IMF’s Executive Board on behalf of the zone. This could rely on upgraded structures in Brussels, including the Eurogroup and the Eurogroup Working Group. Dombrovskis told reporters that coordination mechanisms should be “more binding” since now the member states are not obliged to follow coordinated positions.\nIn the meantime, the executive proposes an observer status for the eurozone in the Executive Board, represented by the envoy of a eurozone member state already sitting at the Board, and supported by the Commission and the European Central Bank.\nConcerning representation, the head of the Eurogroup will present the views of the eurozone in the IMF Board of Governors. Once one of several constituencies are set up, the executive director of one of them will represent the euro in the Fund’s Executive Board.\nThis legislative proposal was part of a broader package to start implementing some of the less controversial elements of the Five President’s report. This includes a revision of the EU economic governance (European Semester) to streamline the process and make it more democratic; the creation of national competitiveness boards, and a new advisory European fiscal board. The Commission also flagged the setting up of a European Deposit Guarantee Scheme. However, the legislative proposal is expected to come in December, and has been already attacked by Germany.\n>>Read: Berlin and London play hardball in shaping vision for the EMU\nThe national competitiveness boards have also been subject to close scrutiny by social partners. Veronica Nilsson, Deputy Secretary General of the European Trade Union Confederation, warned that “Setting up competitiveness boards that focus mainly on wages will not help.\" Despite the fact that the proposal indicates that these boards should not affect the right of workers and employers to negotiate and conclude collective agreements, “my fear is that the long-term aim is to influence wage settlements more strongly, and that’s a no-no for trade unions\".\nThe Five Presidents’ report initially proposed that the new “competitiveness authorities” should “assess whether wages are evolving in line with productivity and compare with developments” elsewhere, and expected trade unions and employers to “use the opinions of the authorities as guidance during wage setting negotiations”. Although the executive watered down the influence of these authorities in the wage-setting process, the unions are “concerned” about the “too much emphasis” on wages and labour cost, while other relevant factors such as education, or research and development are largely neglected.\nThe Commission's package was presented in the midst of a renewed interest among European citizens to further progress EMU integration. According to a survey conducted by the Bertelsmann Stiftung, and published on Wednesday (21 October), 59% of EU citizens feel that the Union’s political and economic integration should be increased, a figure that rises to 64% when the same question was posed to people living in the eurozone.\n>>Read: Commission lays the groundwork for post-2017 eurozone reforms", "external_links": [], "published": "2015-10-22T14:18:00.000+03:00", "crawled": "2015-10-22T21:14:20.414+03:00", "highlightTitle": ""}