{"organizations": [], "uuid": "262696ccc090b8af557737fa02effbc36a87193f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510030077.html", "country": "US", "title": "Mozambique: Chokwe Receives 40 Tractors", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Mozambique: Chokwe Receives 40 Tractors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-03T13:00:00.000+03:00", "replies_count": 0, "uuid": "262696ccc090b8af557737fa02effbc36a87193f"}, "author": "", "url": "http://allafrica.com/stories/201510030077.html", "ord_in_thread": 0, "title": "Mozambique: Chokwe Receives 40 Tractors", "locations": ["Mozambique", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chokwe"], "text": "South Africa: A Look Into SA's Relationship With Drug Trafficking \nMaputo — The Mozambican government's Agricultural Development Fund (FDA) on Thursday delivered 40 tractors and their accessories to Chokwe district, in the southern province of Gaza, in a ceremony that marked the launching of the National Agricultural Mechanisation Programme. \nThe equipment is part of a total of 513 tractors imported by the Ministry of Agriculture and Food Security, under its “Programa Mais Alimentos” (“More Food Programme”), with the support of the Brazilian government. \nThe tractors will be installed in 47 Agricultural Service Centres. These Centres, farmed out to private management, will hire the tractors to farmers. The establishment of the Centres and the acquisition of the tractors cost 97.6 million US dollars, provided as a Brazilian line of credit. This loan is to be repaid over 15 years at an interest rate of 0.2 per cent. \nThe FDA's vision of the centres is that they will become integrated units which also provide agricultural inputs, technical assistance, transport and marketing services. Funding for the subsequent phases of the centres, which will include irrigation equipment and food processing, is still under negotiation. \nAt the Thursday ceremony, the chairperson of the FDA board, Setina Tiniosse, said the purpose of the tractors is to help farmers increase their levels of food production. She said that the tenders for selecting private managers of the centres have been concluded in the central and southern provinces, and will soon be completed in the north. \nChokwe district, on the banks of the Limpopo river, contains the largest irrigation scheme in the country, with great potential for rice production. In the 2014/15 agricultural year, an irrigated area of 9,600 hectares was worked in Chokwe. Further rehabilitation of the irrigation infrastructures should lead to an expansion of the area under cultivation in the 2015/16 year to at least 14,000 hectares. \nThe tractors come from the Brazilian company LS, which claims that they use state of the art technology. Its coordinator of services, Odair Correa, said that, after South Africa, Mozambique is tthe second largest market in Africa for LS. \nHe said that the tractors are accompanied by enough spare parts for maintenance for the next twelve months. \n15 Mozambican mechanics are being trained in maintenance of the machines. Mozambique \nIn the wake of last Friday's attack against the motorcade of Afonso Dhlakama, leader of Mozambique's former rebel … see more » Copyright © 2015 Agencia de Informacao de Mocambique. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-03T13:00:00.000+03:00", "crawled": "2015-10-03T16:36:59.774+03:00", "highlightTitle": ""}