{"organizations": [], "uuid": "8124fedfba4495c8b67a3bfbee076a4e9da8207e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nz.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://nz.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Latest business and finance news from New Zealand and the world's key markets - Yahoo New Zealand Finance", "url": "https://nz.finance.yahoo.com/news/commodities-markets-summary-201405450.html", "country": "US", "title": "Commodities markets summary", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Commodities markets summary", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T23:56:00.000+03:00", "replies_count": 0, "uuid": "8124fedfba4495c8b67a3bfbee076a4e9da8207e"}, "author": "", "url": "https://nz.finance.yahoo.com/news/commodities-markets-summary-201405450.html", "ord_in_thread": 0, "title": "Commodities markets summary", "locations": ["New Zealand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tue, Oct 13, 2015, 10:42 AM NZDT - New Zealand Markets close in 6 hrs 18 mins Commodities markets summary \nA summary of trading in key commodities markets overseas: \nENERGY \nGlobal oil prices have fallen sharply on worries about excessive supply and profit-taking after last week's rally. \nUS benchmark West Texas Intermediate for November delivery tumbled $US2.53 ($A3.45) to $US47.10 a barrel on the New York Mercantile Exchange on Monday, about a five per cent decline. \nEuropean benchmark Brent oil for November delivery shed $US2.79 to $US49.86 a barrel in London. \nOil prices had gotten a lift early in the day from a report by the Organization of the Petroleum Exporting Countries that pointed to deeper cuts in non-OPEC oil output and said factors that have depressed crude prices are \"starting to show signs of alleviation.\" \nHowever, oil prices soon turned negative, a decline partly attributed to profit-taking after US crude prices jumped nine per cent last week. \nAnalysts also still see plenty of evidence the oil glut will persist. \nPRECIOUS METALS \nGold rose to its highest level since early July as expectations that the Federal Reserve will postpone an expected US interest rate hike beyond the end of the year. \nThe dollar index was down 0.1 per cent on the day, stung by doubts that US rates will rise this year. \nSpot gold reached a peak of $US1,169.00 an ounce and was up 0.6 per cent at $US1,163.96 an ounce, while US gold futures for December delivery settled up $US8.60 an ounce at $US1,164.50. \nBets that US rates would rise this year, increasing the opportunity cost of holding gold while lifting the dollar, pushed gold prices to five and a half year lows in July. \nHowever, mixed US economic data and fears that a broader global economic slowdown would affect US growth have since dampened those expectations. \nBASE METALS \nCopper prices are higher as production cuts by Glencore continued to boost base metals, but analysts warned the output shift may not be enough to offset weak demand growth in China. \nBenchmark copper on the London Metal Exchange closed 0.5 per cent up at $US5,315 a tonne, after nearing Friday's three-week high of $US5,356 in early trade. \nThe metal rose more than three per cent in the previous session, swept higher in a broad metals rally triggered by news that Glencore will cut zinc output by 500,000 tonnes, or 4 per cent of global supply. \n\"People are still pretty positive over the story with Glencore and some other supply-side cutbacks,\" said Mu Li, senior metals analyst at CPM Group. \n\"The rally in prices is sort of an upward correction to the previous bearish sentiment.\" \nCopper prices have recently rebounded from six-year lows below $US5,000 touched in August, helped partially by production cuts. @YahooNZBusiness on Twitter, become a fan on Facebook", "external_links": [], "published": "2015-10-12T23:56:00.000+03:00", "crawled": "2015-10-13T00:47:41.162+03:00", "highlightTitle": ""}