{"organizations": [], "uuid": "581efedc41f19dfcdf00b1c78b0b77383eb0be75", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/11/belarus-election-idUSL8N12B0B220151011", "country": "US", "title": "UPDATE 1-Belarus poised to re-elect last dictator in Europe", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Belarus poised to re-elect last dictator in Europe | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T16:10:00.000+03:00", "replies_count": 0, "uuid": "581efedc41f19dfcdf00b1c78b0b77383eb0be75"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/11/belarus-election-idUSL8N12B0B220151011", "ord_in_thread": 0, "title": "UPDATE 1-Belarus poised to re-elect last dictator in Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Lukashenko comment, voter Quote: , background)\nBy Andrei Makhovsky\nMINSK Oct 11 (Reuters) - Belarus President Alexander Lukashenko appeared certain to be re-elected on Sunday for a fifth term that could see an easing of relations with the West and raise questions about his ties to Vladimir Putin's Russia.\nLukashenko's re-election five years ago led to mass protests and the imprisonment of leading opposition figures, but support for his 20-year-old regime has risen since he cast himself as a guarantor of stability in the face of economic crisis and a pro-Russian separatist conflict in neighbouring Ukraine.\nThe West has long ostracised Lukashenko's Belarus, described in 2005 by U.S. Secretary of State Condoleezza Rice as \"Europe's last dictatorship\", over its human rights record and clampdown on political dissent. It has imposed economic sanctions on some Belarussian officials and companies.\nNevertheless, his criticism of Russia's annexation of Ukraine's Crimea peninsula last year, his hosting of Ukraine peace talks and his pardoning of the six opposition leaders in August suggest he is seeking to improve his image in the West, observers say.\n\"We have carried out everything the West wanted on the eve of the elections. If there is a desire in the West to improve our relations, nobody and nothing can prevent that,\" Lukashenko said as he cast his vote.\n\"The ball is now firmly in the West's court,\" he said.\nTIES WITH RUSSIA\nRelations with former Soviet master Moscow have shown some signs of strain. In September, President Vladimir Putin approved a plan to build an airbase in Belarus, but early this month Lukashenko said his country had no need for such a base, appearing to bow to public protests on the eve of the election.\nThe European Union will lift its sanctions on Belarus, including those on Lukashenko, for four months after Sunday's vote, barring any last-minute crackdown, diplomatic sources said on Friday.\nPrevious elections in Belarus were considered unfair by Western observers and the Organization for Security and Cooperation in Europe (OSCE), which is monitoring Sunday's vote, said in September the ballot represented a \"pivotal moment\" for Belarus to demonstrate a willingness to hold free and fair elections.\nThe OSCE will present a report on their election monitoring on Monday, after which Brussels will release a formal statement, an EU spokesman said.\nThe lifting of EU sanctions would be welcome to Belarus, whose economy has been battered this year by a slump in the currency of Russia, a key trading partner and source of remittances from migrant workers.\nNone of the three candidates running against Lukashenko in Sunday's poll represent a serious challenge to his rule and opposition figures have called for a boycott of the election.\n\"Lukashenko and his system is a dead-end. There is no choice, but there is the choice not to be a sheep,\" said Anatoly Lebedko, a leading opposition figure at an anti-government rally on Saturday that attracted a crowd in the low hundreds.\nSome of those who voted on Sunday did not express much faith in the political process. \"I voted because it is the duty of every citizen ... What good is there in this country? They spin their lies and we pretend that we believe them,\" 68-year-old pensioner Alexander said, declining to give his last name.\nWhile the president has been making some conciliatory gestures towards the opposition in recent months, it is unlikely the regime will become more welcoming of political dissent if Lukashenko remains in power.\n(Additional reporting by Francesco Guarascio in Brussels; Writing by Alessandra Prentice; editing by Ralph Boulton )", "external_links": [], "published": "2015-10-11T16:10:00.000+03:00", "crawled": "2015-10-11T15:22:41.578+03:00", "highlightTitle": ""}