{"organizations": [], "uuid": "8a2c3eb13ac16e125ff8d73c96a07ffb37b7ace5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-businesswire/?format=rss", "section_title": "Finance News | Business Wire - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/nice-evaluation-tariff-code-announcements-220000018.html", "country": "GB", "title": "NICE Evaluation and Tariff Code Announcements to Increase UroLift® System Availability in UK NHS Patients With Enlarged Prostate", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "NICE Evaluation and Tariff Code Announcements to Increase UroLift® System Availability in UK NHS Patients With Enlarged Prostate", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:00:00.000+03:00", "replies_count": 0, "uuid": "8a2c3eb13ac16e125ff8d73c96a07ffb37b7ace5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/nice-evaluation-tariff-code-announcements-220000018.html", "ord_in_thread": 0, "title": "NICE Evaluation and Tariff Code Announcements to Increase UroLift® System Availability in UK NHS Patients With Enlarged Prostate", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Oct 14, 2015, 00:13 BST - UK Markets open in 7 hrs 47 mins NICE Evaluation and Tariff Code Announcements to Increase UroLift® System Availability in UK NHS Patients With Enlarged Prostate Press Release : NeoTract, Inc. – 1 hour 13 minutes ago Print \nPLEASANTON, Calif.--(BUSINESSWIRE)-- National Institute for Health and Clinical Excellence (NICE) could give major boost to UroLift ® System adoption on the NHS across the UK with guidance finding the treatment is less costly than other treatments, is minimally invasive and preserves sexual function \nNeoTract, Inc., welcomed the September announcement by NICE that its UroLift® System (Prostatic Urethral Lift) to treat an enlarged prostate (benign prostatic hyperplasia) saves the National Health Service (NHS) up to £286 ($618) per patient as a day case, compared to the most commonly used surgical intervention. NICE acknowledged the UroLift System has unique benefits, including preservation of sexual function, improved quality of life, reduced recovery time and the ability to treat high risk patients. \nIn its report, which assessed both clinical and economic benefits, NICE’s Medical Technologies Evaluation Program committee noted that the UroLift System “relieves lower urinary tract (LUTS) symptoms while avoiding the risk to sexual function associated with transurethral resection of the prostate (TURP) and holmium laser enucleation of the prostate (HoLEP)... and represents a significant advantage for men who wish to preserve their sexual function. Using the system reduces the length of a person’s stay in hospital. It can also be used in a day-surgery unit.” \nNICE “accepted expert advice that catheterisation time would be reduced and in many cases… [this] would be avoided, especially as surgeons gain experience with the procedure. It also concluded that it was reasonable and likely that the UroLift System would be used as a day-surgery procedure, often under local anaesthetic.” \n“The NICE report dovetails well with an analysis we published December 2013 in Population Health Management that showed an anticipated 30% savings of UroLift versus standard surgery, based on a two year horizon of care within the US Medicare system,” stated Dr. David Nash, Dean of the Jefferson College of Population Health. \nIn the UK, it is estimated that more than £180 million ($388M) is spent on BPH treatments each year, with 60% of these costs incurred in secondary care as a direct result of managing BPH complications. \nThe report stated that the UroLift System “should be considered as an alternative to current surgical procedures for use in a day-case setting in men with lower urinary tract symptoms of benign prostatic hyperplasia who are aged 50 years and older and who have a prostate of less than 100 ml.” \nThe UK’s General Practice Research Database (GPRD) from 1992 to 2001 reveals an increasing prevalence of lower urinary tract symptoms, which is most commonly caused by BPH, with older age, from 3.5% in men aged 45–49 years to more than 30% in men aged 85 years and above. A significant proportion of these men could benefit from treatment with the UroLift System. \nIn a separate development, the NHS has released “more appropriate” financial arrangements for reimbursing hospitals undertaking the UroLift procedure that better reflect the cost of care. \n“Both of these announcements independently, as well as the recent inclusion of UroLift into the European Association of Urology Guidelines, further support the clinical and economic value of this game-changing technology,” stated David Baker, General Manager, NeoTract Australia Pty Ltd. “This is a proud moment for us in Australia as the history of the UroLift System saw the original clinical research being carried out here from 2005, initially by two Urologists in NSW and then soon expanding across four Australian sites. The UroLift System has been available for use in Australia with reimbursement for men holding private health insurance since February 2013.” \nAbout Benign Prostatic Hyperplasia (BPH) \nBPH, also known as enlarged prostate, is a medical condition in which the prostate gland that surrounds the male urethra becomes enlarged with advancing age and begins to obstruct the urinary system. The condition is common, affecting approximately 500 million men worldwide. BPH symptoms include sleepless nights and urinary problems, and can cause loss of productivity, depression and decreased quality of life. About one in four men experience BPH-related symptoms by age 55 and by age 70, over 80 percent of men suffer from BPH. \nMedication is often the first-line therapy for enlarged prostate, but relief can be inadequate and temporary. Side effects of treatment can include sexual dysfunction, dizziness and headaches, prompting many patients to quit using the drugs. For these patients, the classic alternative is surgery that cuts or ablates prostate tissue to open the blocked urethra. While current surgical options, such as TURP can be very effective in relieving symptoms, it can also leave patients with permanent side effects such as urinary incontinence, erectile dysfunction and retrograde ejaculation (dry orgasm). \nAbout the UroLift ® System \nThe UroLift system is a novel, minimally invasive technology for treating lower urinary tract symptoms due to benign prostatic hyperplasia (BPH). The UroLift permanent implants, delivered during a minimally invasive transurethral outpatient procedure, relieve prostate obstruction and open the urethra directly without cutting, heating, or removing prostate tissue. Clinical data from a pivotal 206-patient randomized controlled study showed that patients with enlarged prostate receiving UroLift implants reported rapid and durable symptomatic and urinary flow rate improvement without compromising sexual function. Patients also experienced a significant improvement in quality of life. Most common adverse events reported include hematuria, dysuria, micturition urgency, pelvic pain, and urge incontinence. Most symptoms were mild to moderate in severity and resolved within two to four weeks after the procedure. The UroLift System received positive NICE guidance and is FDA-cleared. It is available in the U.S., Europe, Australia, Canada and Mexico. Learn more at www.UroLift.com.au . \nAbout NeoTract \nNeoTract, Inc. is dedicated to developing innovative, minimally invasive and clinically effective devices that address unmet needs in the field of urology. The company’s initial focus is on improving the standard of care for patients with BPH using the UroLift System, a minimally invasive permanent implant system that treats symptoms while preserving normal sexual function. Learn more at www.NeoTract.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20151013005780/en/ Contact", "external_links": [], "published": "2015-10-14T01:00:00.000+03:00", "crawled": "2015-10-14T02:19:02.797+03:00", "highlightTitle": ""}