{"organizations": [], "uuid": "2c438754d89fea5722a5cb704ca2cb4bfc76a29e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/royal-mail-float-helped-create-192026540.html", "country": "GB", "title": "Royal Mail float helped create a new generation of retail investors", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Royal Mail float helped create a new generation of retail investors", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T22:20:00.000+03:00", "replies_count": 0, "uuid": "2c438754d89fea5722a5cb704ca2cb4bfc76a29e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/royal-mail-float-helped-create-192026540.html", "ord_in_thread": 0, "title": "Royal Mail float helped create a new generation of retail investors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Oct 11, 2015, 14:29 BST - UK Markets closed Royal Mail float helped create a new generation of retail investors By Tara Cunningham | Telegraph – 18 hours ago 1,284.00 -1.00 \nTwo years since the flotation of Royal Mail (LSE: RMG.L - news ) , research shows first-time investors still hold an open trading-account. \nThe widely criticised privatisation of Royal Mail attracted the “next generation” of investors to the market, new research has revealed. \nAnalysis of thousands of first-time share buyers who invested in the 500-year-old postal service showed over 75pc still hold an open trading-account. \nRebecca O’Keeffe, of Interactive Investor, said: “Royal Mail captured the public’s imagination in a way not seen since the privatisation of the 1980s, attracting hundreds of thousands of first-time shareholders into the market and creating the potential next generation of investors.” \nThe October 2013 flotation was marred by controversy. The Government was condemned for failing to prioritise ordinary savers and allowing investors to cash the stock in on the same day it floated. However, while many small investors may have been expected to quickly offload the stock and close their accounts, research suggests otherwise. \nWhile only one third of first-time investors have retained their holding in Royal Mail, the majority have “expanded their horizons and invested in other shares and funds”. For those new investors who have continued to expand their portfolios, Ms O’Keeffe revealed: “Lloyds is the most popular option.” \n* Royal Mail keeps tight grip on costs as parcel revenue falls Earlier this week, Hargreaves Lansdown (LSE: HL.L - news ) said 120,000 investors had registered their interest in the £2bn sale of Lloyds’ shares next spring . Like Royal Mail, Lloyds has a similar “broad appeal”. Laith Khalaf, of Hargreaves Lansdown, said: “Shares (Berlin: DI6.BE - news ) in the company can find their way into accounts ranging from Junior ISAs for children, right through to drawdown portfolios of pensioners looking for income.” \nEven (Taiwan OTC: 6436.TWO - news ) though a dark cloud has loomed over Royal Mail since its troubled IPO, analysts reckon the privatisation came at “a good time.” Nonetheless, Joshua Mahony, of IG (LSE: IGG.L - news ) , said: “While the ability to privatise allows the firm to finally attempt to realign itself with the needs of a modern Britain, the Government’s enforcement of compulsory nationwide letter delivery means the firm continues to be held back to some degree.” \nRoyal Mail shares touched highs of 472.2p this week, well above the 330p at which it floated, which Mr Mahony said highlights the “market indecision for a firm which has to carve a highly profitable business with one hand tied behind its back”. * Royal Mail eyes a future in online shopping with investment in e-commerce start-up", "external_links": [], "published": "2015-10-10T22:20:00.000+03:00", "crawled": "2015-10-11T16:29:22.022+03:00", "highlightTitle": ""}