{"organizations": [], "uuid": "a43471d8ac265397d4b8a5e1753fc5272a49b61d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/06/15/david-cameron-xxx/ALTERNATES/crop_100x100/David+Cameron+XXX", "site_section": "http://www.bdlive.co.za/personalfinance", "section_title": "Personal Finance | BDlive ", "url": "http://www.bdlive.co.za/world/europe/2015/10/18/britain-unveils-plan-to-combat-poison-of-extremism", "country": "ZA", "title": "Britain unveils plan to combat ‘poison’ of extremism | Europe", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Britain unveils plan to combat ‘poison’ of extremism | Europe | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:35:00.000+03:00", "replies_count": 0, "uuid": "a43471d8ac265397d4b8a5e1753fc5272a49b61d"}, "author": "Agency Staff", "url": "http://www.bdlive.co.za/world/europe/2015/10/18/britain-unveils-plan-to-combat-poison-of-extremism", "ord_in_thread": 0, "title": "Britain unveils plan to combat ‘poison’ of extremism | Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "British Prime Minister David Cameron. Picture: REUTERS Related articles Refugee crisis growing into a tsunami Cameron attacks extreme conspiracy theories In this article Topics: Islamic State People: David Cameron LONDON — Britain’s Prime Minister David Cameron on Sunday pledged £5m to root out the \"poison\" of extremists like Islamic State (IS) that target the alienated and vulnerable in British communities.\nThe funds will support local initiatives, campaigns and charitable organisations this year in a so-called \"national coalition\" against radicalisation. \"We need to systematically confront and challenge extremism and the ideologies that underpin it, exposing the lies and the destructive consequences it leaves in its wake,\" Mr Cameron said on Sunday.\n\"We have to stop it at the start — stop this seed of hatred even being planted in people’s minds and cut off the oxygen it needs to grow.\" The pledge came on the eve of the launch of the Conservative government’s counter-extremism strategy, which will also include a broader crackdown on extremist content online.\nThe strategy is widely expected to include closer working between Internet companies and police to remove online propaganda, using systems currently employed against child abuse images.\nThere is also set to be a clampdown on extremism in prisons and universities, and incentives for schools to integrate pupils better.\nThe new strategy will set out \"our new approach to tackle this poison\", Mr Cameron said.\nThe plan will target \"violent and non-violent\" extremism, support mainstream voices, and address the segregation and feelings of alienation that provide \"fertile ground\" for radical ideologies.\nThe premier warned however that the scale of the challenge was \"immense\".\n\"At the core is building a national coalition of all those individuals and groups who are united in their determination to defeat extremism and build a more cohesive society.\n\"We will do everything we can to support them — through my new community engagement forum and with practical support and funding to tackle these deep-rooted issues.\n\"The scale of the task is immense and that is why we need everyone to play their part.\" The strategy will also establish a joint industry and government group to tackle the proliferation of extremist content online.\nAccording to recent research by British-based think-tank the Quilliam Foundation, the Islamic State produces 38 unique pieces of high-quality propaganda every day — which spread on social networking websites and target IS sympathisers and supporters across the world.\n\"The past 18 months has seen a big change in the way that extremists use the Internet to target their radical ideology directly at young minds,\" the government added in Sunday’s statement.\nMr Cameron had already vowed earlier this year to \"de-glamorise\" IS militants and clamp down on extremists in Britain.\nAFP", "external_links": [], "published": "2015-10-19T00:35:00.000+03:00", "crawled": "2015-10-18T19:23:51.553+03:00", "highlightTitle": ""}