{"organizations": [], "uuid": "0a87030f4e1e1ea6ee535ed592ebb85a0ac23de5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/advisor/2015/10/15/rising-medicare-premiums-will-you-pay-more-in-2016/", "country": "US", "title": "Rising Medicare Premiums, Will You Pay More In 2016?", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "Rising Medicare Premiums, Will You Pay More In 2016?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:44:00.000+03:00", "replies_count": 0, "uuid": "0a87030f4e1e1ea6ee535ed592ebb85a0ac23de5"}, "author": "Barry Glassman", "url": "http://www.forbes.com/sites/advisor/2015/10/15/rising-medicare-premiums-will-you-pay-more-in-2016/", "ord_in_thread": 0, "title": "Rising Medicare Premiums, Will You Pay More In 2016?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Every year from October 15 to December 7, those who are enrolled in Medicare have the opportunity to make changes to their Medicare coverage. If you have ignored these notices in the past, don’t brush aside this chance to make sure that you have the right coverage for the best price. This year is different and here’s why. Your Medicare Part B costs may increase: Roughly 30% of Medicare beneficiaries may see their Medicare Part B premiums increase up to a staggering 52% according to the 2015 Medicare trustees report . If there is no cost of living adjustment for Social Security in 2016 (just the third time since 1972), then the 7 million people who are not covered under the “hold harmless” law will have to pay the entire Medicare Part B increase in 2016. For those who want to do a deeper dive, my good friend, Michael Kitces wrote an excellent in-depth piece on the history of the hold harmless rule: How The Medicare “Hold Harmless” Rules May Spike Part B Premiums by 52% in 2016. Are you one of these unlucky folks? Get ready to pay higher premiums in 2016 if you fall into one of these groups: those who enroll in Medicare for the first time in 2016; those who don’t receive a Social Security benefit at age 65 or who pay their Medicare premiums directly rather than having them deducted from their Social Security payment; and those who are already paying a higher premium because of higher income. AARP provides a good analysis of who will have to pay the higher premiums in their article: Some Medicare Premiums Could Spike .The premium increase also applies to those who are dual Medicare and Medicaid recipients and whose premiums are paid by state Medicaid programs. However, in this case the state will have to pay the increased premiums not the recipient. What can you do if you’re not covered by the hold harmless law? Consider enrolling in Medicare now rather than waiting until 2016 if you are already eligible. You can also sign up for your Social Security benefits before the end of the year and have your Medicare premiums deducted from your monthly payment. If you have been paying your premium directly because you delayed taking your Social Security benefit, the increase in your Medicare Part B premium may not be enough of an incentive to begin taking your Social Security benefits now. This is a good time to talk to your financial advisor to see which option is best for you. Read: 6 Steps To Finding The Best Financial Advisor .Unfortunately, for those who fall in the higher income bracket (see our chart below for income thresholds), there’s not much you can do since your Medicare premium is based on your 2014 income. For easy figuring, the increase in premium may affect singles whose modified adjusted gross income is more than $85,000/year or those who are married with modified adjusted gross income more than $170,000 per year. Review your options: This open enrollment period may be a good time to consider switching to a Medicare Advantage Plan since these plans set their own pricing and are not subject to the increase in Part B coverage. If you’re not sure how to go about finding a Medicare Advantage plan or to learn more about your options, we put together a handy comparison: Traditional Medicare vs. Medicare Advantage Plans: Which is Best? You can also download our easy-to-use Medicare Survival Guide . It explains what you need to know about filing for Medicare and provides resources to help make the process easier.", "external_links": ["https://www.kitces.com/blog/understanding-the-medicare-part-b-premium-hold-harmless-provisions-for-social-security-beneficiaries/", "http://www.aarp.org/health/medicare-insurance/info-2015/medicare-part-b-premiums-could-spike.html?intcmp=HP-FLXSLDR-SLIDE1-MAIN", "http://www.glassmanwealth.com/blog/2015/10/14/traditional-medicare-vs-medicare-advantage-plans-which-is-best/", "http://www.glassmanwealth.com/blog/2014/04/03/find-best-financial-advisor/", "https://www.cms.gov/Research-Statistics-Data-and-Systems/Statistics-Trends-and-Reports/ReportsTrustFunds/index.html?redirect=/reportstrustfunds/"], "published": "2015-10-15T20:44:00.000+03:00", "crawled": "2015-10-15T20:14:35.883+03:00", "highlightTitle": ""}