{"organizations": [], "uuid": "5123db3aba489c228179aeaf5124ae1e9cabc230", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/s/8/t/x/image.related.afrArticleLead.620x365.gk9lu6.png/1444895808552.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/lion-backs-foreign-investment-for-asian-success-20151015-gk9lu6", "country": "AU", "title": "Lion backs foreign investment for Asian success", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Lion backs foreign investment for Asian success | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T15:56:00.000+03:00", "replies_count": 0, "uuid": "5123db3aba489c228179aeaf5124ae1e9cabc230"}, "author": "Greg Earl", "url": "http://www.afr.com/business/lion-backs-foreign-investment-for-asian-success-20151015-gk9lu6", "ord_in_thread": 0, "title": "Lion backs foreign investment for Asian success", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Patient capital needed: Lion CEO Stuart Irvine and Lion Chairman Rod Eddington. David Mariuz Share on twitter Share on Google Plus by Greg Earl Lion group chief executive Stuart Irvine has lauded the value of foreign investment in helping Australian businesses break into the Asian market saying investment from Japanese company Kirin has freed him from the \"tyranny of quarterly reporting.\"\nIn a contrast with the investor push to stop IAG Group stepping up its China business because of the risks involved, Mr Irvine said patient capital was needed to underpin the ten year strategy which the beer, dairy and drinks company was embarking on in Asia and the US.\n\"To grow into Asia you really have to put in the direct resources. You can't do it with just an export department. You need to be very patient,\" he told the Nikkei Asia Forum in Sydney on Thursday.\nLion this week signed an agreement with the biggest chilled dairy supplier in southern China – Canton American Flower Lounge Livestock - to take Lion brands into the Guangdong province area.\nFlower Lounge will market Pura extended shelf-life and UHT milks and fresh Dairy Farmers Thick & Creamy and Farmers Union Natural Greek Style yoghurts, along with a selection of Lion's Australian specialty cheese brands .\nMr Irvine said that with demand for dairy products due to increase in China by $25 billion over the next four years the agreement was an important step in the company using its backing from the large Japanese food and drinks company to expand into the region.\nHe said: \"Most Australian companies have some foreign investment. But we need to reinforce the message about the value of foreign investment.\"\nKirin bought 47 per cent of Lion in 1998 and then moved to full ownership in 2004 but clear results from the plan to use the relationship to leverage Australian food products into the broader Asian region have been slower to emerge than some observers expected at the time.\n Mr Irvine said the company now had two new divisions with one focussed on taking dairy products into Asia, mainly China, Malaysia, Hong Kong and Singapore.\nThe other division would take beer and wine to both Asian and US markets with New Zealand craft beer already being sold in Hong Kong.\nMr Irvine said most of the Asian opportunities would likely be sourced from Kirin contacts in the region but would then be developed by Lion divisions in Australia and New Zealand.\nHe cited Lion Nathan's shift to publishing more nutritional and content information on beer packaging as an example of the value of having patient capital to allow a branding transformation saying that value of being more upfront about the content would take a long time to pay dividends.\nHe strongly backed the recent trade agreement with Japan saying it had already resulted in increased wine sales and would be important for dairy products. But said the main importance of trade agreements was to underline in both countries that beyond tariff cuts, there was a determination to reduce regulatory impediments to business.\nSpeaking earlier at the same conference, but before the IAG pull back from China, Lion chairman Rod Eddington, who also heads the Australia Japan Business Cooperation Committee, said that he welcomed the signs that Australian services companies were stepping up in Asian business when resources exports were slowing down.\nBut he warned that: \"Asia is not going to fall into our lap. We have to be much better at exploiting the opportunities.\"", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/100440329083596928444/about", "https://twitter.com/https://twitter.com/Greg__Earl"], "published": "2015-10-15T15:56:00.000+03:00", "crawled": "2015-10-15T16:08:17.202+03:00", "highlightTitle": ""}