{"organizations": [], "uuid": "b1510e26a79bb8d95e215ea8eb3c3726c56c814c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-22/storm-subsiding-in-global-markets-amid-3-week-drop-in-volatility", "country": "US", "title": "Storm Subsiding in Global Markets Amid 3-Week Drop in Volatility", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Storm Subsiding in Global Markets Amid 3-Week Drop in Volatility - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T12:00:00.000+03:00", "replies_count": 0, "uuid": "b1510e26a79bb8d95e215ea8eb3c3726c56c814c"}, "author": "Joseph Ciolli", "url": "http://www.bloomberg.com/news/articles/2015-10-22/storm-subsiding-in-global-markets-amid-3-week-drop-in-volatility", "ord_in_thread": 0, "title": "Storm Subsiding in Global Markets Amid 3-Week Drop in Volatility", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As fast as it rolled in, the tempest that shook global stocks, bonds and commodities for two months is showing signs of blowing out to sea.\nVolatility tracked across markets around the world by the Bank of America Merrill Lynch Market Risk Index fell for three straight weeks and dropped again on Tuesday and Wednesday. It’s heading for its longest weekly losing streak since May 2014. The Chicago Board Options Exchange Volatility Index of U.S. equity turbulence recently posted the longest streak of daily declines since 2009, while Europe’s VStoxx Index is near a 10-week low.\nThe dissipation is an about-face from August and September, when mounting paranoia over weaker-than-expected Chinese economic data and the Federal Reserve unleashed selloffs in virtually every asset. Calm is making a tentative comeback after a correction in U.S. stocks and a bear market in crude oil -- a welcome development, as long as traders keep their guards up, according to Bruce Bittles of Robert W. Baird & Co.\n“It shows that investors believe the worst of declines are over,” said Bittles, chief investment strategist at Milwaukee-based Robert W. Baird, which oversees $110 billion. “From that perspective, it’s favorable. Investors still have to be careful to not get too comfortable though, because that’s when they’re the most vulnerable.”\nStocks After spiking to the highest level in almost four years during the Standard & Poor’s 500 Index’s summer swoon, the VIX has tumbled 59 percent as the benchmark equity index rebounded. The volatility measure has been below 20 for 13 straight days. Prior to that, it traded above it for 30 sessions, the longest such streak since January 2012. The gauge rose 6. percent to 16.70 at 4 p.m. in New York.\nPressure in the U.S. stock market is being defused by two industries that have been responsible for much of its stress. Energy producers have surged 13 percent since the S&P 500 fell to a four-year low on Aug. 24, while commodity companies increased 5.2 percent. It’s a new role for resource stocks whose swoons into the equity correction were in many cases two and three times greater than the market as a whole.\n“When people perceive that the fears of a global economic slowdown are easing a bit, that puts pressure on the VIX,” said Scott Wren, senior global equity strategist at Wells Fargo Investment Institute. “We could have a decent rally between now and the end of the year and that’s going to push the VIX lower.”\nTreasuries From the perspective of U.S. government bond volatility, investors are focused on the Fed. A gauge of U.S. sovereign bond-market price swings dropped to 70 basis points Wednesday, the lowest level this year, as futures traders predict the Fed will be sidelined until March.\nThe Bank of America Merrill Lynch MOVE Index, a measure of Treasury market volatility based on options trading, has slipped 26 percent from a six-month high reached on Aug. 24. The measure has dropped steadily since the September Fed meeting.\nTo Jim Russell of Bahl & Gaynor Inc., warnings of slowing global growth from the International Monetary Fund and the World Bank have helped suppress volatility in Treasuries and foreign-exchange markets. By “coming clean” on their assessment of the economy, the institutions have “done capital markets a favor,” he said.\n“That reads through to the Fed, which then filters down to Treasuries and currencies,” said Russell, a Cincinnati-based principal and portfolio manager at Bahl & Gaynor, which has about $14 billion under management and advisement. “It makes people less worried about huge price swings in those assets. It takes some of the white-knuckle experience out of the metrics, and therefore the volatility.”\nCurrencies A JPMorgan Chase & Co. gauge of global currency volatility headed for its biggest monthly decline since February as traders anticipate the Fed will remain on hold. Commodity Futures Trading Commission data last week showed currency positioning is the most neutral in more than five years, JPMorgan said in a note last week.\nThe gauge of currency price swings hit a seven-month high on Sept. 7 and has declined 16 percent since then. It slipped 0.9 percent on Wednesday.\nCentral-bank officials from Europe, Japan and Australia have signaled comfort with current policy settings in recent weeks, while keeping open the prospect of further action. The European Central Bank’s Christian Noyer said this week its quantitative-easing plan represented the right amount of stimulus. Bank of Japan Governor Haruhiko Kuroda said on Monday policy easing was having its intended effects.\nOil The CBOE Crude Oil Volatility Index, a gauge of anticipated swings in U.S. crude prices, is down 27 percent since climbing to a five-month high on Sept. 1. A persistent supply glut has checked crude’s advance toward $50 a barrel. The resource has failed to close above that level for the past three months.\nCrude oil plunged as much as 60 percent over a 14-month period beginning in June 2014. It has since stabilized, trading in a range between $44 and $50 a barrel since the start of September. Global markets have remained oversupplied as the boom in U.S. crude production slowly fades, leaving the nation’s stockpiles about 100 million barrels higher than the five-year seasonal average.\n“People may be thinking that prices are bumping along a bottom, and no further significant downward adjustment is needed,” said John Carey, a fund manager at Pioneer Investment Management Inc. in Boston, which oversees $244.1 billion globally. “We’re getting down towards a level where drillers are shutting down and curtailing production, and that’s usually a sign that we might be approaching an end to the downward trend.”", "external_links": [], "published": "2015-10-22T12:00:00.000+03:00", "crawled": "2015-10-22T15:46:59.053+03:00", "highlightTitle": ""}