{"organizations": [], "uuid": "0292f517776d52f25360c8378a065e3cfb769e96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.gobankingrates.com", "main_image": "http://cdn.gobankingrates.com/wp-content/uploads/2015/10/nfl_season.jpg", "site_section": "http://www.gobankingrates.com/personal-finance/feed/", "section_title": "GOBankingRates » Personal Finance", "url": "http://www.gobankingrates.com/personal-finance/7-ways-football-season-making-america-poor/", "country": "US", "title": "7 Ways Football Season Is Making America Poor", "performance_score": 0, "site": "gobankingrates.com", "participants_count": 1, "title_full": "7 Ways Football Season Is Making America Poor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T12:00:00.000+03:00", "replies_count": 0, "uuid": "0292f517776d52f25360c8378a065e3cfb769e96"}, "author": "Andrew Lisa", "url": "http://www.gobankingrates.com/personal-finance/7-ways-football-season-making-america-poor/", "ord_in_thread": 0, "title": "7 Ways Football Season Is Making America Poor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Andrew Lisa October 18, 2015 \nThe National Football League is the richest sports organization on the planet. The league earns about $10 billion each year, and its leaders project that number to rise to $25 billion by 2027. \nAlthough lucrative licensing, advertising and media deals fuel the NFL money machine, in the end it’s the NFL’s legions of loyal fans who are responsible for the organization’s fortune. They fill the stadiums, watch the games on TV and buy NFL-licensed merchandise. \nWith the 2015 football season underway, the NFL is once again gearing up to make record profits on the backs of its fans. Here are the top seven ways the NFL is getting rich off you. \nRelated: 78% of NFL Players End Up Broke — These 6 Athletes Didn’t 1. Stadium Tickets, Food and Beer Are Overpriced \nIf you’re a fan of the Cleveland Browns or the Jacksonville Jaguars, you can still see your favorite team play live at local stadiums for under $60. The average ticket prices for the league’s two least-expensive live-game teams are $54.20 and $57.65, respectively. Unless your team is at the bottom of the pack, however, a $60 ticket is likely to be out of reach. \nThe average price for NFL tickets to a live game is $84.43. The eight most expensive teams to see live — the New England Patriots, San Francisco 49ers, N.Y. Giants, Dallas Cowboys, Chicago Bears, N.Y. Jets and the Baltimore Ravens — all charge more than $100 per ticket. \nAll told, attendance and ticket sales earn the NFL roughly $2 billion every year. NFL ticket prices, however, are not the only hit your wallet will take at the stadium. If you plan on having a beer while you watch, be prepared to pay. The average price of a small draft is $7.53. If you drive, plan to spend $31 for parking per game, or $248 each season. 2. Your Cable TV Subscription Is Expensive \nThe NFL makes about one-half of its $10 billion yearly earnings from television and broadcast rights. CBS, ESPN, Fox and NBC are paying the NFL a total of between $5 billion and $6 billion each year in contracts that run through 2022. By 2027, that number might reach $17 billion. \nRead: 10 Ways to Cut $500 Off Your Monthly Bills \nThe structure of television distribution is horribly unfair to people who don’t watch sports — especially when it comes to the NFL media juggernaut. There is an astounding 154 percent gap between NFL viewership and non-sports prime-time programming. Those who do not watch sports but pay for cable are subsidizing the cost for those who do. If a subscriber pays $90 a month for cable, $76 a year is going toward NFL, whether the subscriber watches football or not. \nESPN is by far the most expensive channel for viewers, costing subscribers $5.13 a month. In comparison, subscribers pay Disney $1, CNN $0.57 and MTV $0.37 each month. 3. NFL Sunday Ticket, Game Pass and RedZone Are Overpriced \nDirecTV recently renewed the contract for its NFL Sunday Ticket package, which will earn the NFL $12 billion over eight years. Meanwhile, the NFL announced that non-DirecTV viewers can get NFL Sunday Ticket for between $199 and $359 a season. If you want to watch more football on your cable subscription, NFL RedZone costs anywhere from $19.80 to $90 per season depending on your provider. \nIn 2015, the NFL launched Game Pass, a streaming service that allows subscribers to watch games as soon as they end. The service — which targets cord cutters who don’t have cable or satellite subscriptions — allow fans to listen to the audio from regular season games live, and they can watch preseason games as they happen. The service costs subscribers $99 a year. 4. Fantasy Football Costs You Hundreds \n33 million Americans play fantasy football , the wildly popular gambling activity in which participants draft teams of real players, and then compete against each other in leagues based on the performance of those players during actual games. \nThe Fantasy Sports Trade Association reports that, on average, fantasy players shell out $465 a year on fantasy sports. People who participate in fantasy leagues spend $257 a year on daily fantasy and $162 on traditional fantasy. The remaining expenditure is an average of $46 spent on fantasy sports-related materials, including: $14 for website subscriptions", "external_links": [], "published": "2015-10-18T12:00:00.000+03:00", "crawled": "2015-10-19T03:16:19.905+03:00", "highlightTitle": ""}