{"organizations": [], "uuid": "52fb47efc9be7868eef9bb4f06c63549f7aefcc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=WMT", "section_title": "Yahoo! Finance: WMT News", "url": "http://finance.yahoo.com/news/sam-club-national-bbq-tour-200600459.html", "country": "GB", "title": "Sam’s Club National BBQ Tour Championship Culminates in Bentonville - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Sam’s Club National BBQ Tour Championship Culminates in Bentonville - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "52fb47efc9be7868eef9bb4f06c63549f7aefcc0"}, "author": "Sam’s Club", "url": "http://finance.yahoo.com/news/sam-club-national-bbq-tour-200600459.html", "ord_in_thread": 0, "title": "Sam’s Club National BBQ Tour Championship Culminates in Bentonville - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BENTONVILLE, Ark.--(BUSINESS WIRE)--\nAfter hosting competitions in over 30 cities from across the nation, the Sam’s Club® National BBQ Tour will crown a new champion at the tour’s final stop in Bentonville, Ark. this weekend. On Oct. 10, 50 of the country’s best barbecue teams will fill the parking lot at the Sam’s Club headquarters in Bentonville, Ark., where one team will walk away with the National Championship title and $50,000 in winnings. \n“If you love BBQ, you can’t miss this!” said Michael McDearman, series director for the tour. “It’s the best BBQ field in the country, whittled down from over 800 teams to just 50. They are the best, and many of them are famous pitmasters you won’t see anywhere else!” \nSince 2011, the Sam’s Club National BBQ Tour has traveled the United States, region by region, searching for the year’s best in competitive barbecue and awarding winning teams a total of $500,000 in prize money annually. In that time, thousands of Kansas City Barbeque Society (KCBS) competition teams worked to carefully perfect and present their barbecue, which was assessed by KCBS Certified Barbecue Judges, hoping to earn the title of “National Champion.” \nAdding to the excitement this year will be a performance by singer-songwriter Holly Williams, granddaughter of Hank Williams. She will be performing songs from her latest album, The Highway from 1 to 2 p.m. on Saturday. Prior to this, she will have a meet and greet with spectators under the KCBS Turn-In Tent at 11 a.m. \nAbout Sam’s Club BBQ Tour \nThe Sam’s Club National BBQ Tour is a tournament-style series in which teams must advance from a local qualifying event to the top tier of their regional event in order to qualify for the National Championship and a shot at the $50,000 Grand Champion prize. Sponsored by Bush’s®, Cargill™, Clorox®, ConAgra Foods®, Heinz®, the National Pork Board, New Zealand Lamb, Pepsi®, Reser’s® Fine Foods, Sweet Baby Rays® and Tone’s®, this continuously building competition that brings out the best, most committed barbecue teams and keeps judges and spectators returning to Sam’s Club competitions for the smell and flavor of the country’s best barbecue. \nAbout Sam’s Club \nSam’s Club, a division of Wal-Mart Stores, Inc. ( WMT ), is the nation’s eighth largest retailer and a leading membership warehouse club offering superior products and services in 652 clubs across the U.S., as well as in Brazil, China and Mexico. To learn more about Savings Made Simple, visit the Sam’s Club Newsroom, shop at SamsClub.com, and interact with Sam’s Club on Twitter and Facebook . \nAbout Kansas City Barbeque Society \nThe Kansas City Barbeque Society (KCBS), is a nonprofit organization dedicated to promoting and enjoying barbeque, is the world’s largest organization of barbeque and grilling enthusiasts with over 20,000 members worldwide. \nKCBS sanctions more than 450 barbeque contests throughout the United States and 28 countries. From volunteering to actual event production, our members also offer assistance to civic and charitable organizations who organize events. For more information, visit: kcbs.us . \n\nView source version on businesswire.com: http://www.businesswire.com/news/home/20151007006479/en/ \nConsumer Discretionary Kansas City Barbeque Society Contact: Sam’s Club\nTara Raddohl, 800-331-0085\nTara.Raddohl@walmart.com", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T05:16:35.689+03:00", "highlightTitle": ""}