{"organizations": [], "uuid": "875a5483c3b11fd4c96eb35e2382da4c177ccd2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-22/draghi-effect-best-ecb-rally-for-european-stocks-in-two-years", "country": "US", "title": "Draghi Rally Seen Lingering in European Stocks Rising Off Floor", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Draghi Rally Seen Lingering in European Stocks Rising Off Floor - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T07:00:00.000+03:00", "replies_count": 0, "uuid": "875a5483c3b11fd4c96eb35e2382da4c177ccd2c"}, "author": "Roxana Zega", "url": "http://www.bloomberg.com/news/articles/2015-10-22/draghi-effect-best-ecb-rally-for-european-stocks-in-two-years", "ord_in_thread": 0, "title": "Draghi Rally Seen Lingering in European Stocks Rising Off Floor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "European stock investors just gave Mario Draghi their loudest applause in two years.\nThursday’s equity rally was the biggest after any European Central Bank meeting since July 2013, surpassing even January’s, when the ECB president first announced quantitative easing. Yesterday, he gave traders hope, hinting that additional stimulus may come soon, just two days after signs of improving lending had dimmed prospects of further measures.\n“Draghi covered all the bases, gave a little to everyone,” said Jasper Lawler, London-based market analyst at CMC Markets Plc. “Like in January, this meeting could make the difference again and may finally put a floor to the market. It could lead to another leg higher in the European stocks.”\nDraghi said there was a “rich discussion” among policy makers about the instruments that might be used and that the central bank will review the degree of monetary expansion at December’s meeting. One option the ECB is considering is a further reduction in the deposit rate, which is already negative.\nHis words helped European stocks finally break out of a range they’ve been trading in for two weeks. After a quarterly rout triggered by concerns about China’s growth and the U.S. Federal Reserve, the Euro Stoxx 50 Index is heading for its best month in four years, up 8.1 percent. At the same time, a gauge measuring expectations for stock volatility fell to a 10-week low on Thursday.\n“Some people held back on going long again until this ECB meeting,” said Benedict Goette, founder of asset-management firm Compass Capital in Zurich. “Now the market looks like it wants to break out to the upside, which attracts more technical buyers.”\nVStoxx Index of euro-area stock volatility\nThis is not the first time Draghi’s words have spurred a market rally. His QE announcement in January prompted the gauge’s best first quarter since 1998, while his pledge in July 2012 to do whatever it takes to preserve the euro helped fuel the biggest annual gain since 2009. In July 2013, Draghi sparked an even bigger stock jump than yesterday by vowing to keep interest rates low for as long as necessary. This year, the Euro Stoxx 50 has gained at least 0.5 percent on every ECB day.\nFor Lampe Asset Management’s Michael Woischneck, Draghi’s straight talking was exactly what investors needed, after the swings triggered by mixed messages from the Fed. The money manager is buying up more European equities, saying clarity from the ECB will provide support.\n“After all the confusion the Fed has caused, it was very important for Draghi to deliver an unambiguous message,” said Woischneck, who oversees the equivalent of $161 million at Lampe Asset Management in Dusseldorf, Germany. “It really differentiates the ECB from the Fed, in every way. Markets love certainty.”\nAn extension of the ECB’s asset purchase program this year would give another boost to the region’s exporters, the top performers in the first quarter. The euro plunged on Thursday, pushing groups of carmakers and chemical companies up at least 2.6 percent. Germany’s DAX Index posted the biggest gain among developed markets, rallying 2.5 percent.\n“Draghi is a master of talking the market his way,” said David Hussey, head of European equities at Manulife Asset Management in London. “But a weaker euro remains a very important issue for European GDP, so he’ll keep doing it.”", "external_links": [], "published": "2015-10-23T07:00:00.000+03:00", "crawled": "2015-10-23T06:46:22.863+03:00", "highlightTitle": ""}