{"organizations": [], "uuid": "016582c2747a2ed04d815b809c8fb18ef58908cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/ashleaebeling/2015/10/06/7-tax-tricks-for-homeowners/", "country": "US", "title": "7 Tax Tricks For Homeowners", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "7 Tax Tricks For Homeowners", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T20:35:00.000+03:00", "replies_count": 0, "uuid": "016582c2747a2ed04d815b809c8fb18ef58908cc"}, "author": "Ashlea Ebeling", "url": "http://www.forbes.com/sites/ashleaebeling/2015/10/06/7-tax-tricks-for-homeowners/", "ord_in_thread": 0, "title": "7 Tax Tricks For Homeowners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[gallery2012] The combination of demographics and the recession has put empty nesters and relocators on a collision course for a big tax mistake. They “inadvertently” lose their ability to use their $250,000/$500,000 capital gains exclusion on the sale of their principal residence. “They think the market still has upside so they rent out their house for a few years, but if you haven’t used your principal residence for at least two of the five years prior to the sale, you lose the exclusion,” says Suzanne Shier, director of tax strategy at Northern Trust. There’s an exception for people moving into a skilled nursing facility; Shier explained that to a family and helped them snag the full $500,000 exclusion.Who knew owning a house could be so taxing? You have to worry about income taxes, property taxes, estate taxes. “You need to be aware of the rules and be aware of the exceptions to the rules so you don’t inadvertently lose benefits,” Shier says. Here’s a rundown of some of the most taxing areas. Putting your house in trust. It’s not uncommon to put a house in a revocable trust for estate planning or disability planning purposes. But beware of potential tax consequences: you could lose your real estate tax cap or homestead exemption. If your vacation home is in Canada, you could face a capital gains tax bill on the transfer—as if you had sold the property. “You need to be mindful of the local rules,” Shier says, adding that transfers to family members can trigger similar problems. The out-of-state vacation home. Even if you live in a no-estate tax state, if you own real estate in a state that has a state estate or inheritance tax, you’ll likely owe state estate tax. The reason: a non-resident doesn’t get the full exemption. For a map showing these state levies, click here . As more and more people leave estate tax states and relocate to non-estate tax states, but keep real property in their old state, this is becoming a bigger issue, Shier says. Giving your house away. Maybe you don’t have kids or other heirs, or you have a vacation home your kids don’t care about, or you inherit a house you don’t want to keep up. It might make tax sense to give your house to charity. There are all sorts of variations on this theme. If you (and your spouse) want to live out your life there, you can give away the house, retaining a life estate, and you get an income tax deduction upfront. If you want income but don’t want a house, consider trading it for a stream of lifetime payouts. Robert Essick, an English professor in Altadena, Calif., put an inherited house in a charitable remainder annuity trust that pays him an annuity for life. Property taxes. If your real estate tax bill seems out of whack, don’t be shy about questioning it. Now that most assessment information is available online, it’s easier than ever to put together an appeal. Take a cue from billionaire Tom Golisano, founder of Paychex, who got his bill cut by $100,000 a year . Also, seek out exemptions for seniors and veterans. Watch the Congressional tax extenders drama. Two home-related tax breaks expired on Dec. 31, 2014 and are part of the 50-plus tax extenders that Congress has been taking up at year-end, renewing one or two years at a time. There’s the mortgage debt exclusion —if this provision is extended, debt that is forgiven through a foreclosure, a short sale or loan modification will not be treated as taxable income. And there’s the mortgage insurance premium deduction that would allow mortgage insurance premiums to be treated as deductible interest, if extended. Go green! Another tax extender that’s likely to be made retroactively applicable for 2015 is the tax credit of up to $500 (10% of costs) for making certain energy-efficient home improvements to your home like putting in new windows or adding insulation. There’s a federal tax credit for going to solar, wind or geothermal, and states have breaks too. North Carolina State University has a comprehensive list on its online Database of State Incentives for Renewables and Efficiency. Keep track of remodeling costs. Back to the $250,000/$500,000 home sale exclusion. The $250,000 break is for a single taxpayer; $500,000 for a couple. Think you’ll never be so lucky as to have so much appreciation to shield from capital gains taxes? Better to be on the safe side. Start a file of receipts for capital improvements—a new roof, a sprinkler system—they all add to your adjusted cost basis, which can save you even more capital gains taxes in the long run.", "external_links": [], "published": "2015-10-06T20:35:00.000+03:00", "crawled": "2015-10-06T18:15:03.431+03:00", "highlightTitle": ""}