{"organizations": ["Starbucks", "Fiat", "EU"], "uuid": "73f5b382d2b2d1db9f149fd77bb8a3fbd3e12374", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/eu-orders-starbucks-fiat-pay-121241929.html", "country": "US", "title": "EU orders Starbucks and Fiat pay €30m in taxes after ruling \"sweetheart\" deals illegal", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "EU orders Starbucks and Fiat pay €30m in taxes after ruling \"sweetheart\" deals illegal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:12:00.000+03:00", "replies_count": 0, "uuid": "73f5b382d2b2d1db9f149fd77bb8a3fbd3e12374"}, "author": "", "url": "https://uk.finance.yahoo.com/news/eu-orders-starbucks-fiat-pay-121241929.html", "ord_in_thread": 0, "title": "EU orders Starbucks and Fiat pay €30m in taxes after ruling \"sweetheart\" deals illegal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Oct 21, 2015, 13:43 BST - UK Markets close in 2 hrs 47 mins EU orders Starbucks and Fiat pay €30m in taxes after ruling \"sweetheart\" deals illegal By Mehreen Khan | Telegraph – 31 minutes ago 0.00 \nBrussels rules that Luxembourg and Netherlands provided illegal state subsidies to corporate giants \nThe European Commission has ordered Starbucks (Swiss: SBUX.SW - news ) and Fiat (Hanover: FIA1.HA - news ) to pay €20m-€30m in unpaid taxes, after ruling they had benefitted from illegal tax breaks in Luxembourg and the Netherlands. \nIn the first major ruling of its kind, Brussels' competition authority ruled that such \"sweetheart\" tax deals between tax haven member states and corporate giants effectively classified as government subsidies, violating the EU's state aid rules. \nCompetition commissioner Margrethe Vestager said Stabucks and Fiat had enjoyed \"unduly reduced\" tax burdens in both countries, which can now be recovered by their respective governments. \n“I hope that, with today’s decisions, this message will be heard by member state governments and companies alike,\" said Ms Vestager. \nShe (Munich: SOQ.MU - news ) added the decision would \"remove unfair competitive advantage [Stabucks and Fiat] have enjoyed and restore equal treatment\" for multinationals operating in Europe. \n\"All companies, big or small, multinational or not, should pay their fair share of tax\". \nThe Commission is also set to deliver a high-profile ruling on Amazon and Apple (LSE: 0R2V.L - news ) 's tax arrangements after a two-year investigation later this year. \nMany of Luxembourg's favourable tax laws were struck while current Commission president Jean-Claude Juncker served as prime minister for two decades. \nMr Juncker, however, has always denied any role in the deals, which are entirely legal under EU Treaties. \nBut in the current decision on the coffee company and Italian carmaker, the Commission ruled tax authorities had endorsed \"artificial and complex methods\" designed to shift profits in a bid to reduce their tax bills. \nAt the heart of the ruling was the issue of \"transfer pricing\" - where companies set prices for goods and services that do not correspond to market conditions. These undue methods were found to be in violation of the EU's rules on state aid. \n\"As a result, most of the profits of Starbucks' coffee roasting company are shifted abroad, where they are also not taxed, and Fiat's financing company only paid taxes on underestimated profits,\" said the Commission. \nResponding to the ruling, Luxembourg's finance minister, Pierre Gramegna, said the government disagreed with the Commission's findings. \nA government spokesman said there was no evidence that its tax deals with Fiat in particular violated EU treaty law. \n\"The Commission has not established in any way that Fiat Finance and Trade received selective advantages with reference to Luxembourg’s national legal framework,\" the spokesman said. \nBoth Luxembourg and the Netherlands will be given two months to calculate the precise amount of tax to be recovered, said Ms Vestager. Ireland (Other OTC: IRLD - news ) 's corporate tax arrangements have also been part of the probe. \nLast year, Starbucks' manufacturing arm paid less than €600,000 in corporate tax, while Fiat's finance and trade arm had a bill just under €400,00, according to EU calculations. \nResponding to the ruling, Starbucks said they planned to appeal the judgement. The coffee maker said it had paid over $3bn in global taxes over the seven year period in quest from 2008-2014. \n\"Starbucks has paid an average global effective tax rate of roughly 33pc well above the 18.5pc average rate paid by other large US companies\", said a company statement. \nMs Vestager has come down hard on multinationals since being appointed as Brussels competition chief last year. \nThe Dane, who provided the inspiration for hit political nordic drama Borgen , said the EU was ready to \"fine anti-competitive behaviour anywhere in the world, if it harms European consumers\". \nIn a separate ruling, Brussels also imposed €116m in fines on eight companies operating a cartel in CD and DVD drives (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-10-21T15:12:00.000+03:00", "crawled": "2015-10-21T15:44:10.269+03:00", "highlightTitle": ""}