{"organizations": [], "uuid": "5f79233fdcf4d38587c281c5e58ec99c42e11499", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/19/china-britain-idUSL8N12J1ZO20151019", "country": "US", "title": "China's Xi to be feted on British trip despite criticism", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "China's Xi to be feted on British trip despite criticism | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T18:24:00.000+03:00", "replies_count": 0, "uuid": "5f79233fdcf4d38587c281c5e58ec99c42e11499"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/19/china-britain-idUSL8N12J1ZO20151019", "ord_in_thread": 0, "title": "China's Xi to be feted on British trip despite criticism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Xi to stay with royal family, meet political leaders\n* Business deals to be inked, including on nuclear power\n* Visit hailed as start of 'golden era' in Sino-British ties\n* Opposition leader to raise issue of human rights\n* Uighur leader says red carpet 'stained with blood'\nBy Elizabeth Piper\nLONDON, Oct 19 (Reuters) - President Xi Jinping will be feted by the royal family and leading politicians during a trip this week which Prime Minister David Cameron hopes will cement Britain's lucrative place as China's closest friend in the West.\nHailed as the beginning of a 'golden era' or 'golden time' in Sino-British ties, the visit, which will seal a host of business deals, has been criticised by human rights activists who accuse Cameron of turning a blind eye to abuses.\nIt has also ruffled feathers among some of Britain's traditional allies, such as the United States, where Xi's visit last month was tainted by friction over cyber theft and Beijing's moves in Asian maritime disputes.\nBut for Britain, the four-day state visit is the culmination of a years-long charm offensive to show Britain \"walking tall on the world stage\", in a government minister's words, and to attract investment in infrastructure, nuclear power and in its transformation of northern England.\n\"I think it's a real opportunity to deepen our relationship and I'm delighted President Xi is spending so much time here in the UK,\" Cameron told China Central Television before Xi was due to arrive in London late on Monday.\nXi and his wife, Peng Liyuan, will stay at Buckingham Palace as guests of Queen Elizabeth and meet Prince Charles, heir to the throne, and his son Prince William.\nXi will also address parliament and end his trip by travelling to Manchester in northwest England, the heart of a government plan to create a 'northern powerhouse' to challenge the dominance of London as the biggest hub in England.\nAmid much pomp, one sour note could be a meeting with the main opposition Labour party's leader Jeremy Corbyn, who says he will raise human rights with Xi on Tuesday. Rights group Amnesty International will also stage a protest metres from Buckingham Palace where he will lunch with the Queen.\nA leader of China's Muslim Uighur minority said the red carpet being laid out by Britain was stained with the blood of his people. Hundreds have been killed in violence in the region, blamed by Beijing on Islamist militants.\nGOOD \"ETIQUETTE\"\nBritain has won praise from China for its discretion in dealing with human rights issues by raising them behind the scenes, a policy London says is more effective than hectoring Beijing publicly.\nA visit to China last month by finance minister George Osborne sealed the deal with the Global Times, an influential Chinese tabloid, praising his \"etiquette\".\nIn an interview with Reuters on the eve of the trip, Xi heaped praise on Britain for what he called a \"visionary and strategic choice\" to strengthen commercial ties with China.\n\"China looks forward to engaging with the UK in a wider range, at a higher level and in greater depth,\" he said, a marked change in tone since Cameron angered Beijing in 2012 by meeting the Dalai Lama, Tibet's exiled spiritual leader.\nBritain became the first Western nation to join the China-led Asian Infrastructure Investment Bank this year after Washington had pressed allies not to join, and in 2014, the country was the top destination for Chinese money with $5.1 billion in investment, according to law firm Baker & McKenzie.\nOne deal expected to be inked during Xi's visit is a plan for two state-owned Chinese utilities to invest in a 16-billion-pound ($25-billion) nuclear power project being built by French utility EDF at Hinkley Point in southwest England.\nIn a break with its traditional reticence on commenting on votes in other countries, Beijing has expressed hopes the European Union remains united, concerned about any weakening of the bloc which it views as a vital counterbalance to the United States.\nThat may boost Cameron who, with the more Eurosceptic members of his party, has said he must be given time to renegotiate Britain's membership of the 28-member bloc before holding a referendum on whether to remain in the EU before the end of 2017.\nIn a pointed commentary to critics of the countries' close relations, Global Times said in an editorial: \"Apparently the concept of a 'golden era' between the two countries has made some people uncomfortable.\n\"This has hurt the twisted dignity of those who still consider the West the centre of the world.\"\n(Additional reporting by Ben Blanchard in Beijing; Editing by Janet Lawrence )", "external_links": [], "published": "2015-10-19T18:24:00.000+03:00", "crawled": "2015-10-19T17:39:40.305+03:00", "highlightTitle": ""}