{"organizations": [], "uuid": "69806a6389d5039c0779b9919f67e8f24c27919f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/lgo-energy-plc-slumps-fundraising-144032217.html", "country": "GB", "title": "Lgo Energy PLC Slumps On New Fundraising", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Lgo Energy PLC Slumps On New Fundraising", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:40:00.000+03:00", "replies_count": 0, "uuid": "69806a6389d5039c0779b9919f67e8f24c27919f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/lgo-energy-plc-slumps-fundraising-144032217.html", "ord_in_thread": 0, "title": "Lgo Energy PLC Slumps On New Fundraising", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Oct 5, 2015, 18:35 BST - UK Markets closed Lgo Energy PLC Slumps On New Fundraising By Rupert Hargreaves | Fool.co.uk – 2 hours 54 minutes ago 0.90 -0.15 \nLgo Energy (LSE: LGO) has slumped today after the company announced that it had raised £1m before expenses by way of a company arranged placing. \nLgo placed 111,111,110 new ordinary shares at 0.9p per share, taking the total number of shares in issue to 3,165,164,156. The funds used from the placing will be used as working capital in Lgo's Trinidad businesses including initiating work on Lgo's Goudron Sandstone programme. \nLgo is looking to fast-track the development of its Goudron sandstone program after an upbeat set of results from the first sandstone well, which was completed at the end of September. The well exceeded management's expectations for production, and now, Lgo is looking to drill a further 10 sandstone wells in the near future. \nA number of new wells are planned by the end of 2015. Management estimates that due to the relative ease of drilling in the sandstone, Lgo can drill the shallow wells at a cost of $400,000 per well in less than ten days. \nIt's believed that the Goudron Sandstone reservoir totals 343 million barrels of reserves. The Goudron Sandstone reservoir represents over 40% of the overall current Goudron Field's estimated gross 805 mmbbls oil in place. \nHard to value \nBringing ten new, low-cost wells with daily production in the region of 60 barrels per day online during the next few months will certainly boost Lgo's production. However, it's difficult to value the company's shares at present. \nLgo's shares closed at 1.1p at the end of last week, so today's placing has been conducted at an 18% discount to the market price. This is a big red flag. Companies that undertake deeply discounted share placings do so at the expense of existing shareholders. What's more, a deeply discounted placing can indicate that the company is struggling to raise the cash from other sources. \nLgo has already made heavy use of placings to bolster its balance sheet this year. Back in January, the company raised £1.58m via a placing of 52.5m shares, and a further £6.7m was raised in February. This capital raising was part of the company's new debt arrangement with BNP Paribas. \nStill, overall Lgo looks to be heading in the right direction. For the six months ending 30 June 2015, the company reported a gross profit of £2.1m, up 150% year on year. The group's pre-tax loss excluding non-cash items for the period was £187,000, a huge improvement on the figure of -£2.2m as reported for the first half of 2015. This growth is even more impressive when you consider the fact that the price of oil was roughly 50% lower year-on-year. Lgo's gross oil sales increased 200% year-on-year. \nDespite these impressive figures, however, it's difficult to value Lgo. It's clear that the company has limited cash reserves and is struggling to turn a profit. Also, the volatile price of oil means that Lgo is at the mercy of the market. \nThe bottom line \nIf the price of oil recovers and Lgo turns profitable, the company could be a great long-term investment. \nSo, if you already own the company's shares, it might be sensible to sit back and ignore Lgo for a few years while keeping an eye on your other investments. \nYou see, the best way to profit from a high-risk, high-reward company like Lgo is to use a basket approach. Simply put, a basket approach is a portfolio of both risky and defensive stocks, which reduces risk allowing you to sleep soundly at night. \nWith this in mind, The Motley Fool's top analysts have recently identified a company that they consider to be one of the market's \"top small caps\" . \nOur analysts reckon that the shares of this company could have a potential upside of 45%! And the company in question has a strong cash balance, proven advantage and is supported by some of the biggest players in its industry. \nAll is revealed in our new free report entitled \"Is This Stock Tomorrow's Big Winner?\" \nDon't delay, download the free report today -- but hurry, it's only available for a limited time. \nRupert Hargreaves has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-05T17:40:00.000+03:00", "crawled": "2015-10-05T20:36:03.214+03:00", "highlightTitle": ""}