{"organizations": [], "uuid": "0f67667d9022d02609e750c419fea3ac91cc44c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/21/global-markets-idUSL3N12L16720151021", "country": "US", "title": "GLOBAL MARKETS-Asia shares lag behind Nikkei, euro firm for ECB", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Asia shares lag behind Nikkei, euro firm for ECB | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T08:39:00.000+03:00", "replies_count": 0, "uuid": "0f67667d9022d02609e750c419fea3ac91cc44c6"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/21/global-markets-idUSL3N12L16720151021", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Asia shares lag behind Nikkei, euro firm for ECB", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* MSCI Asia-Pacific index flat, Nikkei leads with 1.2 pct gain\n* Commodities stay under pressure as Asia exports struggle\n* Euro holds ground with ECB not expected to act this week\nBy Wayne Cole\nSYDNEY, Oct 21 (Reuters) - Asian shares turned mixed on Wednesday as soft export data kept investors cautious ahead of the European Central Bank's policy meeting later in the week, though Japan's market was having a go at setting a new peak for the month.\nMSCI's broadest index of Asia-Pacific shares outside Japan dithered either side of flat with no clear trend evident across the region.\nThere was more evidence of the problems plaguing Asian trade flows with Japanese exports growing at the slowest pace since mid-2014, mainly due to weakness in China.\nThat gap in demand was one reason copper prices slipped to two-week lows and the commodity-heavy Australian share index lost 0.6 percent.\nYet the Nikkei still managed to climb 1.2 percent and probe the October high around 14,438, in part on lingering speculation of more quantitative easing by the Bank of Japan.\n\"Japan's market is so liquid and has been so well conditioned to handle bad news since QQE first began that, in a way, bad news is good news sometimes,\" said Gavin Parry, managing director at Parry International Trading.\nEarly signs were that shares in the UK, Germany and France would start with small gains, while the S&P 500 EMINI contract was up 0.2 per cent.\nWall Street had offered little lead with the Dow ending Tuesday 0.1 percent lower, while the S&P 500 eased 0.14 percent and the Nasdaq 0.5 percent.\nEarnings for S&P 500 companies are expected to have fallen about 4 percent in the third quarter, while revenue is expected to have declined 3.8 percent, according to Thomson Reuters data.\nEconomic news from the United States was moderately upbeat as housing starts increased 6.5 percent in September to an annual pace of 1.21 million units, beating expectations for 1.15 million units.\nThere was also better news on bank lending in the euro zone as data from the ECB showed a further easing in credit conditions and improving demand for loans.\nThat might lessen the need for the ECB to immediately ramp up its 1 trillion euro asset purchase program.\nThe ECB's governing council meets on Thursday and markets expect it to highlight a willingness to act to boost inflation, but not just yet.\n\"The general consensus is that the ECB has been trying to moderate expectations this week, suggesting it's too early for discussion around extending the current QE programme,\" said analysts at Citi.\nThe euro was a whisker higher at $1.1359, but still hemmed in by support at $1.3300 and resistance around $1.1386. The dollar index was last down 0.1 percent at 94.792.\nThe New Zealand dollar hit a one-week low of $0.6737 after a disappointing global dairy auction saw prices for the country's single largest export fall 3.1 percent.\nOil prices softened on speculation U.S. inventory data would only underline the extent of oversupply in the world. The U.S. Energy Information Administration (EIA) will report official inventory data on Wednesday.\nU.S. crude slipped 30 cents to $45.99 per barrel, while Brent lost 13 cents to $48.58. (Reporting by Wayne Cole; Editing by Simon Cameron-Moore )", "external_links": [], "published": "2015-10-21T08:39:00.000+03:00", "crawled": "2015-10-21T07:59:12.999+03:00", "highlightTitle": ""}