{"organizations": [], "uuid": "cdd3eca3a753b764fb6fa1bab939a841e7aff3b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-banks/?format=rss", "section_title": "Banking News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/investment-focus-time-ticks-buy-161600980.html", "country": "US", "title": "INVESTMENT FOCUS-Time ticks on \"Buy Europe\" trade", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "INVESTMENT FOCUS-Time ticks on \"Buy Europe\" trade", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T19:16:00.000+03:00", "replies_count": 0, "uuid": "cdd3eca3a753b764fb6fa1bab939a841e7aff3b7"}, "author": "", "url": "https://uk.finance.yahoo.com/news/investment-focus-time-ticks-buy-161600980.html", "ord_in_thread": 0, "title": "INVESTMENT FOCUS-Time ticks on \"Buy Europe\" trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Brokers, fund managers still relatively bullish \n* But pressure grows for earnings season to deliver \n* Inflows holding up in 18 out of 20 past weeks \nBy Danilo Masoni and Lionel Laurent \nLONDON/MILAN, Oct (HKSE: 3366-OL.HK - news ) 2 (Reuters) - Despite a bruising reversal this summer and the worst quarterly performance since 2011, the \"Buy Europe\" equity trade is still on for investors looking to tap a regional recovery fed by plentiful central-bank cash. \nBut beneath the surface bullishness surrounding Europe - which has attracted investment inflows in 18 out of the past 20 weeks, according to BofA-Merrill Lynch - is an uneasy sense that time is running short for European companies to deliver the promised earnings growth that has kept investors on board. \nThose looking for proof that Europe is recovering have plenty to choose from: economic sentiment indicators are at their highest in four years, car sales are growing at double-digit rates and lending and credit conditions are improving. The euro and oil prices have firmed recently but remain low overall. \nThis has by no means been enough to protect European stocks from an emerging-market panic over China's slowing economy. Some 450 stocks on the STOXX Europe 600 index are down more than 10 percent year-to-date and some 230 are down at least 20 percent, according to Citi research. \nThere have also been wake-up calls for once-prized blue-chips like London-listed commodities group Glencore (Amsterdam: GX8.AS - news ) , whose share price has swung up to 30 percent daily, or automaker Volkswagen (Other OTC: VLKAF - news ) , whose emissions scandal has pushed its stock to a four-year low. \nBut Europe has outperformed emerging markets, the United States and indeed global equities year-to-date. Earnings in Europe are still projected to grow around 7.6 percent this year, even taking into account a potential near-halving of energy-sector profits. For the bulls, Europe is still rebound material. \n\"Valuations have returned to average levels and corporate profitability has the potential to grow,\" said Gilles Guibout, portfolio manager at AXA IM, adding the European Central Bank's monetary stimulus was providing a benign backdrop. \n\"European stocks tick all the boxes to justify an investment.\" \nValuations may not be screamingly cheap, but on a price-to-earnings basis, European equities trade at a discount to the U.S (Other OTC: UBGXF - news ) . and the relative valuations of some euro area stocks with domestic exposure are at lows last seen during the sovereign debt crisis, according to Barclays (LSE: BARC.L - news ) research. \nBanks have more cost-cutting opportunities, several brokers and fund managers said, while some tip technology stocks. \n\"Investors should take advantage of the recent correction to re-load on European equities,\" Citi strategist Jonathan Stubbs wrote in a note to clients, citing banks such as Santander and UniCredit (EUREX: DE000A163206.EX - news ) and insurers Aegon (Swiss: AGN.SW - news ) and Aviva (Other OTC: AIVAF - news ) . \nThe biggest risk, according to sceptics, is that the current slowdown in emerging markets and widening of credit spreads becomes serious enough to debunk the earnings story. \n\"We have always had the free money, QE (central-bank easing) argument. Now (NYSE: DNOW - news ) , it feels more like 'show me the money',\" said David Jane, co-manager of multi-asset at Miton Asset Management. \n\"To get properly bullish, either you need an event or we need to see the earnings pattern coming through.\" \nFor now, though, the fourth quarter is seen as an opportunity to buy Europe after a painful summer for the investment community - even if the pressure is ratcheting up on companies to deliver on their promise. \n\"We have been arguing that this is a growth shock ... which the developed world will ride out,\" BofA-Merrill Lynch strategists wrote in a note to clients. \n\"Positioning and sentiment would tend to suggest that the worst of the sell-off is over.\" (Reporting by Danilo Masoni in Milan and Lionel Laurent in London; Editing by Ruth Pitchford)", "external_links": [], "published": "2015-10-02T19:16:00.000+03:00", "crawled": "2015-10-02T19:30:49.920+03:00", "highlightTitle": ""}