{"organizations": [], "uuid": "028d732845c71a9602a78f2460dae846890be12e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/06/fe-santoshtiwari3.jpg", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/fe-columnist/rahul-gandhi-needs-reformist-leaders-to-guide-him-being-60-plus-age-doesnt-matter/153652", "country": "IE", "title": "Rahul Gandhi needs reformist leaders to guide him, being 60-plus doesn’t matter", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Rahul Gandhi needs reformist leaders to guide him, being 60-plus doesn’t matter | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:09:00.000+03:00", "replies_count": 0, "uuid": "028d732845c71a9602a78f2460dae846890be12e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/rahul-gandhi-needs-reformist-leaders-to-guide-him-being-60-plus-age-doesnt-matter/153652", "ord_in_thread": 0, "title": "Rahul Gandhi needs reformist leaders to guide him, being 60-plus doesn’t matter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Editorial: Losing the pulse Editorial: Fixing MNC tax issues Professional hazard Senior Congress party leader Jairam Ramesh may have stirred up a hornet’s nest by saying that the party vice-president Rahul Gandhi will soon take over from his mother and current Congress chief Sonia Gandhi and will then weed out the old guard, but even if that happens, the big question is will that change the party’s economic policy outlook?\nIn fact, it will hardly achieve much by pushing the leaders in 60-plus age group in the advisory role and exiting the 70-plus ones unless it changes its anti-growth image, which has got only emboldened by its rigid stance on the reform Bills in Parliament.\nThere were several young leaders in the UPA government, but they were never given enough chance to change the narrative.\nThe biggest problem with Congress party now is that its youth icon, Rahul Gandhi himself, who at some point of time talked about agriculture reforms in the country, today boasts of his success in scuttling the land acquisition bill changes aimed at easing the consent and social impact assessment clauses so that land could be acquired easily for infrastructure projects that will benefit farmers and poor in the rural areas.\nWill he start supporting the reform measures, including the goods and services tax (GST), Land Acquisition Bill, and labour law changes to improve ease of doing business in the country, if the veterans exit?\nThe basic philosophy of the Congress party – of projecting it as pro-poor, pro-farmer, and pro-labour even if they come at the cost of growth, which is the only way to improve the living standards of these segments – hardly seem to be changing, even an inch, under Rahul Gandhi.\nIf the NDA experience of Prime Minister Narendra Modi ’s sidelining of senior Bharatiya Janata Party leaders like L K Advani, Murli Manohar Joshi and Yashwant Sinha, and promoting young leaders like Piyush Goyal, Dharmendra Pradhan and Smriti Irani among others is prompting Congress party to do the same, it must understand that the change of faces has to be accompanied by changes in policies in the way the current PM has done, or at least appears to be trying to do.\nThough PM Modi has not succeeded in bringing any big reform measure as yet, he has at least ensured that the policy direction remains pro-growth – PM Jan Dhan scheme, Digital India , Make-in-India, the efforts to resolve tax disputes in the last few weeks, and forceful fight in the Supreme Court over extension of the Aadhaar-use to all social sector schemes and also other areas – show that the government is trying to improve the business sentiment and also growth prospects.\nIt is the parliamentary logjam that has been the biggest stumbling block in this and though the situation perfectly suits the Congress party, and it would be hoping that the opposition gets strengthened by the Bihar assembly election results on November 8, Jairam Ramesh would do well by suggesting to Rahul Gandhi to alter the thought-process in the party first by at least ensuring that Bills like GST are passed in the winter session of Parliament before he embarks upon the exercise to give rest to the party veterans.\n 19, 2015 7:09 pm", "external_links": [], "published": "2015-10-20T03:09:00.000+03:00", "crawled": "2015-10-20T00:37:11.142+03:00", "highlightTitle": ""}