{"organizations": [], "uuid": "f8c9c2daf65c8aa9da17a6c7b712babc44d1d502", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jdsupra.com", "main_image": "http://www.jdsupra.com/showThumbnail.aspx?img=2105_1125.jpg&size=og", "site_section": "http://www.jdsupra.com/resources/syndication/docsRSSfeed.aspx?ftype=FinanceBanking&premium=1", "section_title": "Finance & Banking RSS Feed | JD Supra Law News", "url": "http://www.jdsupra.com/legalnews/cfpb-publishes-bulletin-on-respa-94050/", "country": "US", "title": "CFPB Publishes Bulletin on Respa Compliance and Marketing Services Agreements", "performance_score": 0, "site": "jdsupra.com", "participants_count": 1, "title_full": "CFPB Publishes Bulletin on Respa Compliance and Marketing Services Agreements", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T16:57:00.000+03:00", "replies_count": 0, "uuid": "f8c9c2daf65c8aa9da17a6c7b712babc44d1d502"}, "author": "Sheppard Mullin Richter &amp; Hampton LLP", "url": "http://www.jdsupra.com/legalnews/cfpb-publishes-bulletin-on-respa-94050/", "ord_in_thread": 0, "title": "CFPB Publishes Bulletin on Respa Compliance and Marketing Services Agreements", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CFPB Publishes Bulletin on Respa Compliance and Marketing Services Agreements more+ Contact \nTo embed, copy and paste the code into your website or blog: <iframe src=\"http://www.jdsupra.com/post/contentViewerEmbed.aspx?fid=cb60cf4c-25bb-4c7e-b2ca-43ed623a07c5\" width=\"100%\" height=\"620\" frameborder=\"1\" style=\"border: 2px solid #ccc; overflow-x:hidden !important; overflow:hidden;\" scrolling=\"auto\"></iframe> \nFor some time now, the residential lending community has been concerned that the Consumer Financial Protection Bureau has taken unclear positions with respect to marketing services agreements (MSA’s) in its enforcement actions, leaving residential lenders unsure as to how to proceed. Some lenders, including Wells Fargo Bank and Prospect Mortgage Company, have responded to this uncertainty by terminating all of their MSA’s. The Mortgage Bankers Association and other groups had requested that the CFPB provide some clarity as to its position on MSA’s, and the CFPB responded by issuing a press release and a compliance bulletin with respect to MSA’s on October 8. \nWhile the Compliance Bulletin does not clear up every question raised by the CFPB’s enforcement actions (for example, in one enforcement action the CFPB said that the MSA itself was a thing of value, a statement that puzzled the industry), it does make the CFPB’s position on MSA’s clear – that they are not per se illegal, but that there is a very high threshold that must be met for the MSA to not violate RESPA. For example, the CFPB stated the following in the bulletin: \nWhether an MSA violates RESPA requires a review of the facts and circumstances surrounding the creation of each agreement and its implementation; therefore, the outcome of one matter is not necessarily dispositive as to the outcome of another matter. \nAny agreement (including an MSA) that entails exchanging a thing of value for referrals of settlement service business involving a federally related mortgage loan likely violates RESPA. \nMSA’s that constitute an effort to disguise referral fees will be deemed to violate RESPA. For example, entering into an MSA as a quid pro quo for referral of business with fees based, in part, on how many referrals the settlement service provider receives and how much revenue is generated by those referrals was determined by the CFPB to constitute a RESPA violation. \nThe incentive to steer consumers toward the settlement service provider (i.e., the lender or title insurance company paying the fees) that are inherent in many MSA’s are clear enough to create tangible legal and regulatory risks for the monitoring and administration of the MSA’s. From a practical standpoint, this statement means that the services provided through the MSA cannot involve steering the consumer in any respect; but which MSA services do not potentially involve steering in some form? For example, if the marketing services provider hands out brochures to customers advertising the lender, is that steering? How about if the marketing services provider merely has a stack of brochures in its office, that the customer can take or not take at his or her discretion? The CFPB’s position at this time is unknown, and was not made more clear by the bulletin. \nThe marketing services provider had best provide all services that it is being paid to provide. When services promised under an MSA are not performed, but payments are being made, a reasonable inference can be drawn that the MSA is part of an agreement to refer settlement services business in exchange for kickbacks. This has always been the case. \nThe CFPB does not look favorably on MSA’s where the services are directed toward other settlement service providers rather than toward consumers. \nIndividuals in charge of companies that commit violations have been required to pay significant monetary penalties. \nWhistleblower complaints about MSA’s that violate RESPA have been increasing. \nThe CFPB encourages all mortgage industry participants to consider carefully RESPA’s requirements and restrictions and the adverse consequences that can follow from non-compliance, as many MSA’s involve substantial legal and regulatory risks that are greater and less capable of being controlled by careful monitoring than mortgage industry participants may have recognized in the past. \nIn other words, tread very carefully, and at your own risk. \nDISCLAIMER: Because of the generality of this update, the information provided herein may not be applicable in all situations and should not be acted upon without specific legal advice based on particular situations. \n© Sheppard Mullin Richter & Hampton LLP | Attorney Advertising Sheppard Mullin Richter & \"My best business intelligence, in one easy email… Your first step to building a free, personalized, morning email brief covering pertinent authors and topics on JD Supra * By using the service, you signify your acceptance of Privacy Policy (Updated: October 8, 2015) \nJD Supra provides users with access to its legal industry publishing services (the \"Service\") through its website \nJD Supra collects users' names, companies, titles, e-mail address and industry. JD Supra also tracks the pages that users visit, logs IP addresses and aggregates non-personally identifiable user data and browser type. This data is gat \nIf you have reason to believe that your interaction with us is no longer secure, you must immediately notify us of the problem by contacting us at info@jdsupra.com \nExcept as otherwise described in this privacy statement, JD Supra will not disclose personal information to any third party unless we believe that disclosure is necessary to: (1) comply with applicable laws; (2) respond to governmental inquiries or requests; (3) comply with valid legal process; (4) protect the rights, privacy, safety or property of JD Supra, users of the Service, Website visitors or the public; (5) permit us to pursue available remedies or limit the damages that we may sustain; and (6) enforce our Terms & \nThis Website and the Service may contain links to other websites. The operator of such other websites may collect information about you, including through cookies or other technologies. If you are using the Service through the Website and link to another site, you will leave the Website and this Policy will not apply to your use of and activity on those other sites. We encourage you to read the legal notices posted on thos \nIf you have any questions about this privacy statement, the practices of this site, your dealings with this Web site, or if you would like to change any of the information you have provided to us, please contact us at: info@jdsupra.com * With LinkedIn, you don't need to create a separate login to manage your free JD Supra account, and we can make suggestions based on your needs and interests. We will not post anything on LinkedIn in your name.", "external_links": [], "published": "2015-10-10T16:57:00.000+03:00", "crawled": "2015-10-10T18:28:51.916+03:00", "highlightTitle": ""}