{"organizations": [], "uuid": "f47aeb1484585a113b243da103b2236c49a8a80d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=NVS", "section_title": "Yahoo! Finance: NVS News", "url": "http://finance.yahoo.com/news/pharma-etfs-mergers-deals-remain-161204279.html", "country": "US", "title": "Pharma ETFs : Mergers & Deals Remain in Focus - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Pharma ETFs : Mergers & Deals Remain in Focus - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "f47aeb1484585a113b243da103b2236c49a8a80d"}, "author": "Zacks Equity Research", "url": "http://finance.yahoo.com/news/pharma-etfs-mergers-deals-remain-161204279.html", "ord_in_thread": 0, "title": "Pharma ETFs : Mergers & Deals Remain in Focus - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mergers, acquisitions and deals continue to take center-stage in the pharma sector. While 2014 turned out to be one of the most active years in the pharma sector where mergers and acquisitions (M&As) and licensing agreements are concerned, the trend continues this year as well. Major deals include the ones involving Actavis – Allergan, Shire-NPS Pharmaceuticals, Endo – Auxilium, Valeant - Salix, and Pfizer-Hospira. (Read: S&P 500 ETF vs. ex-sector ETFs)\n\n \n\nMeanwhile, we expect small bolt-on acquisitions to continue. In-licensing activities and collaborations for the development of pipeline candidates have also increased significantly. Several pharma companies are focusing on in-licensing mid-to-late stage pipeline candidates that look promising, instead of developing a product from scratch, which involves a lot of funds and time.\n\n \n\nTherapeutic areas attracting a lot of interest include central nervous system disorders, diabetes and immunology/inflammation. The hepatitis C virus market is also attracting a lot of attention. Another lucrative area is immuno-oncology as these therapies have the potential to change the treatment paradigm for cancer -- they basically use the natural capability of the patient's own immune system to fight the cancer. Major players in this field include Bristol-Myers, AstraZeneca, Merck and Roche. Deals targeting immuno-oncology are being inked by companies like Pfizer, Merck KGaA, Bristol-Myers, AstraZeneca and Incyte.\n\n \n\nRestructuring activities are also gaining momentum as large pharma companies are looking to cut costs and streamline their operations. Most of these companies are re-evaluating their pipelines and discontinuing programs which do not have a favorable risk-benefit profile. (Read: Breakthorugh Biotch ETF on Cancer Treatments)\n\n \n\nAnother recent trend is the divestment/monetization of non-core assets so that the companies may focus on their core areas of expertise. Companies like Pfizer, UCB, Novartis, GlaxoSmithKline and AstraZeneca have all been a part of this trend. Biosimilars are also a focus area. Pfizer’s acquisition of Hospira will give it a strong position in the biosimilars market. Companies like Merck and Novartis are involved in the development of biosimilars as well – in fact, Novartis’ Sandoz was the first company to gain approval for a biosimilar in the U.S. which was launched recently. \n\n \n\nNew products are steadily gaining traction and contributing significantly to sales and so far in 2015, the FDA has approved 22 new molecular entities (NMEs) and biological products. Some of the important new product approvals this year include Pfizer’s cancer treatment, Ibrance and Novartis’ psoriasis treatment, Cosentyx.\n\n \n\nMeanwhile, pharma companies with a strong presence in international markets will feel the pressure of the strengthening dollar in 2015. (Read:\n\n \n\nPharma ETFs in Focus \n\n \n\nHighlighted below are some pharma ETFs - ETFs present a low-cost and convenient way to get a diversified exposure to the sector.\n\n \n\nPowershares Dynamic Pharmaceuticals ETF (PJP) \n\n \n\nPJP, launched in Jun 2005 by Invesco PowerShares, tracks the Dynamic Pharmaceuticals Intellidex Index. The fund covers health care stocks. The top 3 holdings include Pfizer Inc. (5.01%), Johnson & Johnson (4.99%) and Bristol-Myers Squibb (4.97%). The total assets of the fund as of Sep 3, 2015 were $1,879.9 million representing 23 holdings. The fund’s expense ratio is 0.58% while dividend yield is 0.43%. The trading volume is roughly 172,512 shares per day.\n\n \n\nSPDR S&P Pharmaceuticals ETF (XPH) \n\n \n\nXPH, launched in Jun 2006, tracks the S&P Pharmaceuticals Select Industry Index. This ETF primarily covers pharma stocks (96.9%) with the top 3 holdings being The Medicines Company (4.33%), Depomed Inc. (3.92%) and Tetraphase Pharmaceuticals Inc. (3.20%).\n\n \n\nTotal assets as of Sep 4, 2015 were $1,020 million representing 41 holdings. The fund’s expense ratio is 0.35% and dividend yield is 0.71%. The trading volume is roughly 132,221 shares per day.\n\n \n\niShares U.S. Pharmaceuticals (IHE) \n\n \n\nIHE, launched in May 2006, seeks investment results that correspond generally to the price and yield performance of the Dow Jones U.S. Select Pharmaceuticals Index. The fund mainly consists of pharma companies (87%). Biotech companies account for about 15.4% of the fund.\n\n \n\nThe top 3 holdings of this fund are large-cap pharma companies are Johnson & Johnson (9.65%), Pfizer (8.63%) and Merck 7.55%). The total assets of the fund as of Sep 2, 2015 were $1,106.34 million representing 39 holdings. The fund’s expense ratio is 0.45% with the dividend yield being 0.84%. The trading volume is roughly 59,193 shares per day.\n\n \n\nMarket Vectors Pharmaceutical (PPH) \n\n \n\nPPH was launched in Dec 2011 and tracks the Market Vectors U.S. Listed Pharmaceutical 25 Index. The top 3 holdings of this fund are large-cap pharma companies - Novartis (7.85%), Johnson & Johnson (6.82%), and Pfizer (5.53%). The total assets as of Sep 3, 2015 were $361.9 million representing 26 holdings. While the expense ratio is 0.35%, dividend yield is 1.76%. The trading volume is roughly 53,356 shares per day.\n\n \n\nConclusion \n\n \n\nWhile EU austerity measures, negative currency impact and pricing pressure remain headwinds, the pharma industry is out of the worst of its genericization phase. Many companies, which had faced generic headwinds in the last couple of years, should continue to see a sustained improvement in results this year. Cost-cutting, downsizing, emerging markets and new products should support growth.\n\n \n\nIncreased pipeline visibility and appropriate utilization of cash should increase confidence in the sector.\n\n \n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >> \n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \n \nPWRSH-DYN PHARM (PJP): ETF Research Reports \n \nSPDR-SP PHARMA (XPH): ETF Research Reports \n \nISHARS-US PHARM (IHE): ETF Research Reports \n \nMKT VEC-PHARMA (PPH): ETF Research Reports \n \nTo read this article on Zacks.com click here. \n \nZacks Investment Research \n \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \nHealth Care Industry ETFs Novartis", "external_links": [], "published": "2015-10-23T03:00:00.000+03:00", "crawled": "2015-10-23T08:40:59.608+03:00", "highlightTitle": ""}