{"organizations": ["SEC", "ARRIS"], "uuid": "11d6fa4a702c7dd3a48a225bf6b81f99b4fe1b68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "us.rd.yahoo.com", "main_image": "", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=ARRS", "section_title": "Yahoo! Finance: ARRS News", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://biz.yahoo.com/e/151021/arrs8-k.html", "country": "US", "title": "ARRIS GROUP INC Files SEC form 8-K, Submission of Matters to a Vote of Security Holders, Other Events, Financial Stat", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "ARRIS GROUP INC Files SEC form 8-K, Submission of Matters to a Vote of Security Holders, Other Events, Financial Stat", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T00:05:00.000+03:00", "replies_count": 0, "uuid": "11d6fa4a702c7dd3a48a225bf6b81f99b4fe1b68"}, "author": "", "url": "http://us.rd.yahoo.com/finance/news/rss/story/*http://biz.yahoo.com/e/151021/arrs8-k.html", "ord_in_thread": 0, "title": "ARRIS GROUP INC Files SEC form 8-K, Submission of Matters to a Vote of Security Holders, Other Events, Financial Stat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Show all filings for ARRIS GROUP INC \nForm 8-K for ARRIS GROUP INC \n21-Oct-2015 \nSubmission of Matters to a Vote of Security Holders, Other Events, Financial Stat Item 5.07. Submission of Matters to a Vote of Security Holders. \nOn October 21, 2015, ARRIS Group, Inc. (the \"Company\") convened a special meeting of its stockholders (the \"Special Meeting\"), relating to the Company's pending acquisition of Pace plc (\"Pace\") through the formation of a new holding company incorporated in England and Wales. As of the close of business on September 10, 2015, the record date for the Special Meeting (the \"Record Date\"), there were 146,592,391 shares of the Company's common stock, par value $0.01 per share (\"Common Stock\") outstanding and entitled to vote. Only holders of Common Stock at the close of business on the Record Date were entitled to vote at the Special Meeting. At the Special Meeting, approximately 130,744,678 shares of Common Stock were represented in person or by proxy, constituting a quorum. The results of the matters voted on at the Special Meeting are set forth below. \nProposal No. 1 - To adopt the Agreement and Plan of Merger, dated as of April 22, 2015, by and among the Company, ARRIS International Limited, Archie U.S. Holdings LLC, and Archie U.S. Merger LLC (the \"Merger Agreement\"). \nFor Against Abstain Broker Non-Vote 129,714,934 592,076 437,668 0 \nThe proposal received the affirmative vote of a majority of the votes cast by stockholders entitled to vote and therefore passed. Because the vote required to approve this proposal was based upon the total number of outstanding Company shares entitled to vote, abstentions and broker non-votes were counted as votes against the proposal. \nProposal No. 2 - To approve, on a non-binding, advisory basis, the compensation that may be paid or become payable to the Company's named executive officers in connection with the completion of the merger of Archie U.S. Merger LLC with and into the Company, with the Company continuing as the surviving corporation, pursuant to the Merger Agreement. \nFor Against Abstain Broker Non-Vote 125,184,954 3,506,913 2,051,856 955 \nThe proposal received the affirmative vote of a majority of the votes cast by stockholders entitled to vote and therefore passed. Abstentions and broker non-votes were not considered votes cast and had no effect on the outcome of the vote. \nProposal No. 3 - To approve any motion to adjourn the special meeting, or any postponement thereof, to another time or place if necessary or appropriate (i) to solicit additional proxies if there are insufficient votes at the time of the special meeting to adopt the Merger Agreement, (ii) to provide to Company stockholders any supplement or amendment to the proxy statement/prospectus and/or (iii) to disseminate any other information which is material to ARRIS stockholders voting at the special meeting. \nBecause the Company's stockholders approved the Merger Agreement, the proposal was not voted on at the Special Meeting. Item 8.01. Other Events. \nOn October 21, 2015, the Company issued a press release announcing stockholder approval of the Merger Agreement. A copy of the press release is attached hereto as Exhibit 99.1 and is incorporated by reference herein. Item 9.01. Financial Statements and Exhibits. \n(d) Exhibits", "external_links": [], "published": "2015-10-22T00:05:00.000+03:00", "crawled": "2015-10-24T08:12:09.534+03:00", "highlightTitle": ""}