{"organizations": [], "uuid": "163ce912b361df9460b8ce1bd6e378060fa7ee00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/insurance-safe-investments.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/personal-finance/why-investing-in-pune-is-a-good-option/149031", "country": "IE", "title": "Why investing in Pune is a good option", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Why investing in Pune is a good option | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:37:00.000+03:00", "replies_count": 0, "uuid": "163ce912b361df9460b8ce1bd6e378060fa7ee00"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/why-investing-in-pune-is-a-good-option/149031", "ord_in_thread": 0, "title": "Why investing in Pune is a good option", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Simple ways to eliminate credit card debt Home buyers can now get more loan for property up to Rs 30 lakh: RBI CIBIL score killers: Top 5 steps to your credit doom A young banker, Ritesh Kaul, had decided to make Pune his new home even before finishing his MBA in the year 2009.\nMuch to the delight of his retired parents living in Jammu and looking for an investment option, Ritesh started zeroing in on a few apartment complexes soon after taking up his banking job.\nA decent two bedroom plus drawing cum dining with a big enough terrace in one of Pune’s emerging suburb was a result of the Kaul family’s brief search in the year 2010.\nThirty-year-old Ritesh is a successful banker now who feels that Pune fits his and his wife’s choice.\nHe says, “A prime reason for many who buy property in Pune is that middle-level managers based out of Mumbai cant afford to buy a second home in the city. While they can buy decent property in a plush Pune neighborhood in the same amount. Its an upmarket city with good education options, a good weather and virtually no crime rate”.\nMany experts also echo Ritesh’s sentiments. They feel that very few cities in India can match upto to Pune’s potential as an investment destination. A cosmopolitan city with a low crime rate and a lovely weather, Pune is a comprehensive package for an investors delight. The city has all the right economic and demand drivers firmly in place.\n“This city is firmly in the limelight today, and will continue to be there for several years to come. Investors are reaping generous rewards for intelligent plays in the city’s growth pockets, and the city’s boundaries are constantly expanding to bring in more of such pockets. It is an unmatched opportunity across the mid-term and long term,” says Sanjay Bajaj, managing director – Pune, JLL India.\nMany areas in Pune have exceeded the average capital value (CV) appreciation following infrastructure development, supply and absorption. Its inclusion among the 100 Smart Cities programme will only increase the interest from multinational companies to set up and expand operations here, which in turn will increase inward migration and fuel greater demand from investors, even as local end-user demand continues unabated.\n“Investors are reaping generous rewards for intelligent plays in the city’s growth pockets, and the city’s boundaries are constantly expanding to bring in more of such pockets. It is an unmatched opportunity across the mid-term and long term,” Bajaj said.\nLike any other property market, Pune will also not yield returns if not intelligently pursued. So, an investor needs to well plan and properly research before investing as the city has realty offerings in several budget bandwidths and typologies.\n“A factor to watch out for is the rush of illegal residential constructions happening on the outskirts, which investors and end-users must avoid at all costs. Heavy due diligence is the watchword when one is dealing with the kind of anonymous developers who put up such projects.”\nIn the case of Pune, there is certainly some amount of supply in locations which have not picked up because of lack of ongoing infrastructure, and some incidence of over-pricing as well. Investors can successfully navigate away from the non-lucrative propositions by engaging the services of experienced real estate consultants.\n 10, 2015 10:37 am © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-10-10T18:37:00.000+03:00", "crawled": "2015-10-11T00:22:31.196+03:00", "highlightTitle": ""}