{"organizations": [], "uuid": "4f6e464be08626749e7d5f65b453ae89b13f40c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/d/0/i/l/image.related.afrArticleLead.620x365.gkdkea.png/1445327909322.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/farewell-joe-hockey-its-been-fun-20151020-gkdkea", "country": "AU", "title": "Farewell, Joe Hockey. It's been fun", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Farewell, Joe Hockey. It's been fun | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T15:09:00.000+03:00", "replies_count": 0, "uuid": "4f6e464be08626749e7d5f65b453ae89b13f40c8"}, "author": "Fleur Anderson", "url": "http://www.afr.com/news/politics/farewell-joe-hockey-its-been-fun-20151020-gkdkea", "ord_in_thread": 0, "title": "Farewell, Joe Hockey. It's been fun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Then-treasurer Joe Hockey waves to the public gallery ahead of Opposition Leader Bill Shorten delivering the Budget in Reply address at Parliament House in May. Andrew Meares Share on twitter by Fleur Anderson If federal Parliament was a Seinfeld episode, all eyes would be on the guest stars in the public gallery watching former treasurer Joe Hockey as he delivers his valedictory speech after almost 20 years in the business.\nIt's been a madcap few years with eccentric characters and zany plotlines involving driverless cars, letter-writing grandmothers, John Travolta, Queen Elizabeth, pizza shop explosions, neighbourhood disputes, and cigar-related paparazzi pics.\nIn his backbencher's office, Hockey was putting the finishing touches to his valedictory speech due on Wednesday morning. And in his last days as a federal politician, revealed himself as a fan of the 90s sitcom with an autographed photo of the Soup Nazi declaring \"No soup for you!\" displayed in his office window.\nEarlier on Tuesday, when the member for North Sydney received a standing ovation from his Liberal and National Party colleagues, he declared he had no regrets and it was important to leave the parliament with dignity.\nOver the years Australia has learnt a good deal about the affable Joe Hockey who has outraged, entertained and delighted voters with his semi-regular gaffes, and odd hobbyhorses.\nFor example, there's the famous \"Margaret from Langwarrrin\", the 72-year-old grandmother who urged Hockey to embrace austerity for the sake of the nation, and became the fiscal muse of the tough 2014 budget, which was later known by Liberal colleagues as \"that stinking carcass\".\n\"Be brave, be true,\" said the serial letter-writer whose budgetary advice now goes unread, one suspects.\nThen there's that British pensioner, Queen Elizabeth II, whose face Hockey may - or may not, depending on who you asked - have tried to remove from the $5 note back when he was a junior minister in the Howard government.\nJoe Hockey during question time at Parliament House. Andrew Meares \"I laughed and laughed, then went - oh shit!\" Hockey recounted in the biography No Ordinary Joe of the screaming call from John Howard.\nJohn Travolta also makes an appearance in the Hockey political story, agreeing to support a Victorian regional air show after an odd turn of events involving a gaffe by Hockey as tourism minister, a dinner with East Gippsland businesspeople and a local newspaper editor.\nThen there was the time Hockey \"exploded\" in his local pizza shop prompting a call to the local mayor over outdoor dining red tape; the time he dobbed in his Chinese neighbour for potentially breaching foreign investment rules; the time he got the idea of driverless cars into the Intergenerational Report after a weekend visit to his ageing parents.\nThen there's the \"poor people don't drive cars\" and the \"get a good job\" minor scandals that provided an entertaining diversion to the outrage industry for a day or so. Ah, the memories.\nJoe Hockey and Kevin Andrews. Andrew Meares Hockey told his colleagues he didn't have particularly good memories of the Liberal party room - the memory of last month's leadership spill still painfully fresh - but he'd certainly had good memories of the joint party room.\nFormer boss Tony Abbott Quote: d Theodore Roosevelt's \"man in the arena\" speech as he praised Hockey, who is set to become Australia's next ambassador to the US, which will set the scene for a North Sydney byelection later this year.\n\"Who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat,\" Abbott said.\nFinance Minister Mathias Cormann and Treasurer Joe Hockey enjoy cigars in 2014. Nine News", "external_links": ["https://twitter.com/@fleur_anderson"], "published": "2015-10-20T15:09:00.000+03:00", "crawled": "2015-10-20T16:11:19.677+03:00", "highlightTitle": ""}