{"organizations": ["EchoVC Partners", "Google", "DHL", "Samsung"], "uuid": "fb20ef043f79d8e71d8ff81f3aa1e65d0a0756dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510160646.html", "country": "US", "title": "Africa: Nigerian Startup - Printivo - Closes in On Six-Figure Deal From Echovc Partners", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Nigerian Startup - Printivo - Closes in On Six-Figure Deal From Echovc Partners", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T12:06:00.000+03:00", "replies_count": 0, "uuid": "fb20ef043f79d8e71d8ff81f3aa1e65d0a0756dc"}, "author": "", "url": "http://allafrica.com/stories/201510160646.html", "ord_in_thread": 0, "title": "Africa: Nigerian Startup - Printivo - Closes in On Six-Figure Deal From Echovc Partners", "locations": ["Printivo", "Nigeria", "Echovc Partners Guinea", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Baraka Jefwa", "Printivo", "Wale Ayeni", "Olu"], "text": "Guinea: Parties Should Show Restraint By Baraka Jefwa Nigeria-based digital printing startup, Printivo, has closed in on a, yet to be disclosed, six-figure seed financing from early-stage technology venture capital firm, EchoVC Partners. The six-figure investment will be used to significantly broaden the company's product range, increase headcount, accelerate customer acquisition and scale the business. Initially servicing Nigeria's booming SME sector, Printivo is poised to capitalise on and grow Nigeria's $200M print market, which has until now, had no credible online presence. From $6 B in 2011, Africa's print industry is currently estimated to grow to $9B annually by 2016, as businesses invest in design and print to keep up with African consumers' increasing visual literacy, brand adoption, and uncompromising demand for quality. A self-styled 'Vistaprint for Africa', the year-old Printivo provides the only fully automated online print service for over 3,000 customers, providing local and international businesses with corporate stock collateral, such as business cards, letterheads and notepads, and has seen y-o-y growth of 200% since its launch in 2014. Prior to Printivo, there has been little to no innovation in the print industry in Africa's largest economy. Market-wide challenges for Africa's print industry have historically included the high cost of printing, lack of graphic designers, poor customer service and time-intensive ordering practices, making top quality printing all but unaffordable for the super-majority of small businesses. With founders that have spent their entire lives in the print industry, Printivo is the first to build a full service digital platform, in conjunction with a visual creative & design community, to service the small business sector, offering free online templates, design support, a custom upload service, e-commerce, nationwide delivery and high quality customer service turnaround. Printivo is also rapidly growing its consumer base, with a focus in particular on Nigeria's multi-million dollar wedding industry. Olu'yomi Ojo, Printivo Co-Founder and CEO says, \"Securing institutional seed financing means we can accelerate the growth of our online print services & community platform and achieve the ambitious targets we have set for ourselves, as we transform an industry that has, until now, lacked digital infrastructure, investment and innovation. We can now transition print from bricks & mortar 'mom-and-pop' stores that struggle to scale and meet quality requirements, to online ordering and direct delivery, while enabling job creation and distribution. We are in the process of removing the friction for companies that want access to great design, transparent pricing, high quality products and fast turnaround on orders. Simple, yes, but something local printers have historically been unable to provide,\" said Ojo. \"In EchoVC, we have found an investor and partner who has a complete understanding in growing and scaling eCommerce businesses and who sees the enormous growth opportunity Africa's print industry presents,\" He added. With revenues rapidly growing at 50% quarter-over-quarter, Printivo has secured contracts with leading global brands operating in Nigeria, including Google, Uber, Samsung, DHL and Etisalat. After one year of operation, they have serviced over 3,000 customers and currently on track to fulfilling 1,000 orders per month. The company is now clearly positioned to be the primary print outsourcing partner to the 17 million active Nigerian SMEs in Africa's largest economy, with a goal to be the Pan-African e-print platform of choice. Wale Ayeni, Investment Director at EchoVC Pan-Africa Fund adds: \"The lightning speed at which Printivo has changed Nigerian SMEs' print purchasing habits and built a customer base that runs into the thousands is impressive, and was a key driver in our decision to invest. EchoVC sees print in Africa as one of the continent's 'iceberg micro-economies', a below-radar but very large and viable industry with enormous scope for growth. The team's homegrown expertise and innate understanding of the market, their commitment to great design and innovation in print, their ability to grow long lasting customer relationships and their focus on customer service equates to them being best placed to lead the digital printing revolution on the continent. The founders' focus on building a community of co-dependent participants in the print economy has also kick-started significant job creation possibilities.\" Nigeria \nWife of President Muhammadu Buhari, Aisha, on Thursday stated that change does not occur by magic nor does it take place … see more » Copyright © 2015 CIO East Africa. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,700 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-16T12:06:00.000+03:00", "crawled": "2015-10-16T17:51:08.277+03:00", "highlightTitle": ""}