{"organizations": [], "uuid": "59b85f88b902b135be318ce3d69466ce8e7f960d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-to-provide-more-bank-licences-says-s-s-mundra/153711", "country": "IE", "title": "RBI to provide more bank licences, says S S Mundra", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "RBI to provide more bank licences, says S S Mundra | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T06:01:00.000+03:00", "replies_count": 0, "uuid": "59b85f88b902b135be318ce3d69466ce8e7f960d"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/rbi-to-provide-more-bank-licences-says-s-s-mundra/153711", "ord_in_thread": 0, "title": "RBI to provide more bank licences, says S S Mundra", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles 'Mobile banking may overtake internet banking in 2-3 years' Banking reforms initiated, says PM Narendra Modi: Top 5 points to note Court summons Syndicate Bank ex-CMD, five others in graft case Having allowed 23 new entities to enter the banking space, Reserve Bank of India ( RBI ) today said it plans to grant more licences to promote financial inclusion.\n“You already have two new universal banks, you may have around 11 payment banks, you may have 10 small finance banks, and going forward, it can be a continuing activity where new players are released into the arena by Reserve Bank, if everything goes as per the planning,” RBI Deputy Governor S S Mundra said here.\n“So there would be a large number of new players coming in. I think the key to financial inclusion is that all these players are taken into the national plan of financial inclusion in an orderly manner,” he said.\nIDFC and Bandhan Financial Services emerged successful out of 25 contenders for universal bank licences issued by the RBI in April last year. These entities have already started their operations.\nBesides, RBI has given in-principle nod to 10 entities to set up Small Finance Banks to provide basic banking services to small farmers and micro industries.\nIn August, the central bank had granted approval to 11 entities for launching Payments Banks.\nTo further the objective of financial inclusion, Mundra emphasised the need for structural reform in the agriculture sector.\n“There are now limitation of credit absorption capacity of farm sector until and unless we bring in structural reforms in farming,” he said at an event organised by India Today Group.\nThose structural reform would be in terms of more land under cultivation, pooling of land and advance area of farming, he said.\nMundra said there has been improvement in savings in the last few months.\n“If there is persistent high inflation rate then the people would move towards other assets rather than financial savings,” he said.\nOn NPAs, he said it is localised phenomena and limited to few sectors.\n 19, 2015 10:01 pm", "external_links": [], "published": "2015-10-20T06:01:00.000+03:00", "crawled": "2015-10-20T00:25:53.821+03:00", "highlightTitle": ""}