{"organizations": [], "uuid": "ea1ff91d06d5b1cfca4815279058c8be60567ec2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/personal-finance-banks/?format=rss", "section_title": "Bank Account News | Current Account News | Guides - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/consumers-let-down-lazy-banks-115611451.html", "country": "US", "title": "Consumers let down by lazy banks should switch", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Consumers let down by lazy banks should switch", "spam_score": 0.0, "site_type": "news", "published": "2015-10-22T14:56:00.000+03:00", "replies_count": 0, "uuid": "ea1ff91d06d5b1cfca4815279058c8be60567ec2"}, "author": "", "url": "https://uk.finance.yahoo.com/news/consumers-let-down-lazy-banks-115611451.html", "ord_in_thread": 0, "title": "Consumers let down by lazy banks should switch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Consumers let down by lazy banks should switch Moneywise – 23 hours ago Print \nBanks must make it easier for customers to switch bank accounts, according to the Competition and Markets Authority. \nFollowing a detailed investigation into the personal and business banking sector – worth an estimated £16 billion – the CMA has concluded that banks do not have to compete for customers. \nAccording to the authority 57% of people have held their personal current account for more than 10 years, while 37% have not switched in more than 20 years. \nThis low level of switching is in spite of the Current Account Switch Guarantee, launched in September 2013, which requires banks and building societies to complete switches in seven working days. In 2014 just 3% of people moved their current account. \nThe CMA said customers worry that switching accounts will be time-consuming and high risk. Overdraft users are the least likely to switch, despite heavy users standing to save up to £260 a year by moving to a bank with lower charges. The average current account user meanwhile can expect to save in the region of £70 a year. \nIf the market was functioning properly, the CMA said, users of accounts that were either expensive or of sub-standard quality, would switch to more competitive providers. \nA lack of competitive pressure is causing problems in the business banking sector too, with more than 50% of people looking for accounts in the small and medium sized enterprise (SME) market, choosing the bank they have their personal account with. More than 90% stay with that account once their period of free banking runs out and a similar number also go to their business bank account provider if they are in need of a loan. \nIn order to rectify these problems the CMA has proposed a number of potential remedies. These include: * Making banks raise awareness of and improve consumer’s confidence in the   * Make it easier for people to compare current and business bank accounts by making Midata available to consumers. The Midata service lets you access your banking history at the click of a button and input that data into a comparison site to work out exactly which account would offer you best value for money. \n* Requiring the creation of an online comparison service for SME accounts as this does not currently exist * Improve information sharing between credit referencing agencies, banks and financial advisers to make it easier for SMEs to shop around for business loans. \nAlasdair Smith, chairman of the retail banking investigation said: “Despite some encouraging developments, particularly in the shape of challengers that have entered the market in recent years, for too long banks have been able to sit back and take their existing customers for granted. We don’t think customers will truly benefit from a more competitive market until they can compare accounts more easily and feel confident that they can switch without risk.” Paul Pester, chief executive at TSB, agreed with the CMA’s findings and described the investigation as a “once in a generation opportunity that could fix the market, once and for all, for the benefit of all consumers.” However the consumer champion Which? was less impressed. Executive director Richard Lloyd explained: “The CMA inquiry has to bring about better banking, but these proposals don't go far enough. The CMA's own evidence is that consumers are disengaged from the banking market, so better information and nudges to switch will not be enough. The regulator now has six months to find more radical ways to promote switching, improve information for consumers and punish those banks who fail to treat customers fairly.” Among the changes Which? would like to see are forcing banks to help customers who rely on unauthorised overdrafts, alerting customers before they go into the red and improving compensation for bad service.", "external_links": [], "published": "2015-10-22T14:56:00.000+03:00", "crawled": "2015-10-23T14:50:04.604+03:00", "highlightTitle": ""}