{"organizations": [], "uuid": "8ab7daa7628fa68c2d5bad58331cc753d38ec559", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/i9rOBhYuMrys/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-14/tesco-ceo-lewis-shuns-more-quick-fixes-to-retailer-s-debt-woes", "country": "US", "title": "Tesco CEO Lewis Shuns More Quick Fixes to Retailer's Debt Woes", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Tesco CEO Lewis Shuns More Quick Fixes to Retailer's Debt Woes - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T07:01:00.000+03:00", "replies_count": 0, "uuid": "8ab7daa7628fa68c2d5bad58331cc753d38ec559"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-14/tesco-ceo-lewis-shuns-more-quick-fixes-to-retailer-s-debt-woes", "ord_in_thread": 0, "title": "Tesco CEO Lewis Shuns More Quick Fixes to Retailer's Debt Woes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tesco Plc’s plan to cut debt without selling any more major assets is raising questions over the U.K. supermarket leader’s ability to recapture investment-grade status if it doesn’t sell shares first.\n“They can get there in about four years, but they’d be running a risk that markets could turn down,\" Rob Orman, a credit analyst at Henderson Global Investors, said by phone. “If they did a rights issue, they could get there in a year or so.\"\nBecause of price cuts to win back customers, Tesco’s U.K. same-store sales are falling and its operating margins are being squeezed. Yet Chief Executive Officer Dave Lewis has ruled out further major divestments to help the retailer cut its 17.7 billion-pound ($27 billion) debt burden, following September’s 4 billion-pound disposal of its Korean operations. The planned sale of the Dunnhumby data-analytics unit was abandoned this month.\nLewis announced a renewed focus on cash generation last week alongside results that showed Tesco generated 281 million pounds of free cash flow compared with an outflow of 134 million pounds over the same period last year. The reversal was driven by a reduction in capital expenditure, which Tesco has budgeted to be less than half of the 2 billion pounds spent last year.\nBalancing the need to cut investment without jeopardizing a recovery in U.K. profits will be a key challenge for Lewis. Moody’s Investors Service has said any return to investment grade will be contingent on a sustainable upturn in U.K. same-store sales and an improvement in its operating margin to about 3 percent from 1.1 percent last year.\nMoody’s and Standard & Poor’s stripped Tesco of its investment grade in January, with Fitch Ratings following in April. All three rate Tesco the highest level of junk. Tesco bonds have lost 0.6 percent this month, the worst performer among the 50 largest similarly rated issuers of sterling bonds, according to Bank of America Merrill Lynch index data.\nTesco declined to comment for this story.\n‘Never Say Never’ In cutting capital expenditure, Tesco may risk ceding ground to competitors. In a note to investors after the company’s results, Shore Capital analyst Clive Black said management needs to explain how spending can stay “significantly\" below depreciation, while keeping stores competitive.\nTesco moved to ease shareholder concern over the possibility of a rights offering last week. Chief Financial Officer Alan Stewart said the company’s 5 billion pounds of undrawn credit facilities meant it had “no issues\" from a liquidity perspective. Lewis said “philosophically” he would always look to boost Tesco’s performance internally before considering an attempt to raise cash from shareholders, although he declined to rule out the possibility. Investors have gone without a dividend this year, with no indication yet of when the next one will come. The shares have fallen 21 percent in the last six months, about double the decline in the FTSE 100 Index.\nTesco’s U.K. performance has been improving. In addition to higher cashflow, the rate of same-store sales declines has improved for three consecutive quarters and in the first half of its current financial year, the company sold 1.4 percent more groceries than it did a year ago. For some, this represents the start of the company’s long, hard slog.\n“Tesco can delever by improving U.K. trading,\" said Laura Foll, who helps oversee 530 million pounds of assets, including Tesco shares, at Henderson Global Investors. “It’s a credible strategy, but it’s unlikely to be a quick fix.”\nThe prospect of a rights issue lingers nonetheless. “Management are trying to be quite cute,” Orman said. “If they keep delivering improvements in cashflow and trading then they could do a rights issue with good news behind it.”", "external_links": [], "published": "2015-10-15T07:01:00.000+03:00", "crawled": "2015-10-15T10:04:04.826+03:00", "highlightTitle": ""}