{"organizations": ["Bloomberg"], "uuid": "5c0346e7a643030cf27e7c73be52be09b91b3a97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/executives/wp-content/uploads/sites/11/2015/09/Dubai.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/executives/move/noor-global-markets-adds-patrick-oerer-as-its-executive-consultant/", "country": "US", "title": "Noor Global Markets Adds Patrick Oerer as its Executive Consultant", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Noor Global Markets Adds Patrick Oerer as its Executive Consultant", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T22:01:00.000+03:00", "replies_count": 0, "uuid": "5c0346e7a643030cf27e7c73be52be09b91b3a97"}, "author": "", "url": "http://www.financemagnates.com/executives/move/noor-global-markets-adds-patrick-oerer-as-its-executive-consultant/", "ord_in_thread": 0, "title": "Noor Global Markets Adds Patrick Oerer as its Executive Consultant", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Patrick Oerer", "Oerer"], "text": "Noor Global Markets Adds Patrick Oerer as its Executive Consultant Noor Global Markets Adds Patrick Oerer as its Executive Consultant Mr. Oerer will help develop the Noor Global Markets’ brand, along with fostering increased sales, trading volumes, and overall revenues. Advertising Print This Post Photo: Bloomberg \nNoor Global Markets has brought in financial services veteran Patrick Oerer, who joins the group from UniTrader, according to information made public on his Linkedin profile. \nNoor Capital PSC is a private joint stock company authorized and regulated by the Central Bank of UAE. The group recently entered the foreign exchange (FX) and contracts-for-difference (CFD) market under a new brand Noor Global Markets, which offers a range of brokerage solutions to both institutional and private clients. \nIn his new role as an Executive Consultant at Noor Global Markets, Mr. Oerer will be based out of Dubai. He will help develop the group’s brand and foster increased sales, trading volumes and overall revenues. \nMr. Oerer joins Noor Global Markets from UniTrader where he served as its Managing Director since mid 2014. Prior to this, he also held a number of senior level roles at GKFX, BMFN, Bank Vontobel AG, and UBS, part of a lengthy career dating back to 2005. \nAccording to Patrick Oerer, Executive Consultant at Noor Capital in a recent statement on the move to Finance Magnates, “We have established a great team of experienced people in our new office location in Dubai and we are continuously hiring sales people to achieve our ambitious targets. Our dedication to the local market and the wider Middle East region plays hereby an important factor of our growth strategy.” \nFurthermore, “Noor Global Markets shall become a top address for individual and institutional clients as well as the brokerage company for IB and White Label partners. Our premium customer service, best-in-class trading technology and a transparent pricing model allows us to provide an exceptional trading environment on both platforms offered, MetaTrader and UniTrader,” he added in an accompanying statement. Got a news tip? Let Us Know FOUND A MISTAKE How do you feel about the article? Educated 0", "external_links": [], "published": "2015-10-12T22:01:00.000+03:00", "crawled": "2015-10-12T20:05:57.853+03:00", "highlightTitle": ""}