{"organizations": ["ECOVACS Robotics", "Future Robot Co.", "Robocare Co.", "United States Robots", "Consumer Electronics Association", "Nidec Corporation", "Ninebot Inc."], "uuid": "ce279f34199396856d14a2cdb3b86ad6b15330b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/experience-robot-revolution-at-ces2016/45703", "country": "US", "title": "Experience the Robot Revolution at #CES2016", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Experience the Robot Revolution at #CES2016", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T10:12:00.000+03:00", "replies_count": 0, "uuid": "ce279f34199396856d14a2cdb3b86ad6b15330b2"}, "author": "", "url": "http://businesswireindia.com/news/news-details/experience-robot-revolution-at-ces2016/45703", "ord_in_thread": 0, "title": "Experience the Robot Revolution at #CES2016", "locations": ["Las Vegas", "U.S.", "Va.", "CES Tech West", "Nevada", "Arlington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Gary Shapiro"], "text": "Company : Consumer Electronics Association (CEA) Thursday, October 15, 2015 12:42PM IST (7:12AM GMT) Experience the Robot Revolution at #CES2016 Robotics exhibits grow by 71 percent Arlington, Va., United States Robots have evolved from science-fiction humanoids into intelligent autonomous machines that are revolutionizing the way consumers live, work and play. Reflecting this evolution, the Robotics Marketplace , presented by Robotics Trends at CES ® 2016 will see a 71 percent growth in exhibit space over its footprint at the 2015 CES. Owned and produced by the Consumer Electronics Association, CES is the world’s gathering place for all who thrive on the business of consumer technologies and will run January 6-9, 2016, in Las Vegas, Nevada. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20151014006536/en/ More than 20 exhibitors will showcase the full range of robotic technologies that are transforming the way consumers learn, do business, monitor their health and maintain their households. Major robotic companies include: Nidec Corporation , iRobot , ECOVACS Robotics , Robocare Co., Ninebot Inc. , and Future Robot Co. “Robots can increasingly move, see, hear, sense and react to the environment,” said Gary Shapiro, president and CEO, CEA. “Robots will change how we approach our daily lives. We expect to see this category expand on the CES show floor, improve lives and help transform the consumer technology industry.” The Robotics Marketplace, presented by Robotics Trends will be located at CES Tech West within the Sands Expo. CES Tech West will also feature leading companies who are revolutionizing fitness and health, the Internet of Things, smart home and other high-growth technologies. CES 2016 will feature more than 3,600 exhibitors unveiling the latest consumer technology products and services across the entire ecosystem of consumer technologies. Registration for CES 2016 is open. For more information on CES 2016, visit CESweb.org . Note to Editors: The official name of the global technology event is “CES ® .” Please do not use “Consumer Electronics Show” or “International CES” to refer to the event. About CES: CES is the world’s gathering place for all who thrive on the business of consumer technologies. It has served as the proving ground for innovators and breakthrough technologies for more than 40 years—the global stage where next-generation innovations are introduced to the marketplace. As the largest hands-on event of its kind, CES features all aspects of the industry. And because it is owned and produced by the Consumer Electronics Association (CEA), the technology trade association representing the $285 billion U.S. consumer electronics industry, it attracts the world’s business leaders and pioneering thinkers to a forum where the industry’s most relevant issues are addressed. Check out CES video highlights . Follow CES online at www.CESweb.org and on social .", "external_links": [], "published": "2015-10-15T10:12:00.000+03:00", "crawled": "2015-10-15T11:05:48.151+03:00", "highlightTitle": ""}