{"organizations": [], "uuid": "44f031c52675d265e8f83a465ca7eac4d650bd20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/256348-jobless-claims-fell-13000-last-week", "country": "US", "title": "Jobless claims fell 13,000 last week", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "Jobless claims fell 13,000 last week", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T18:01:00.000+03:00", "replies_count": 0, "uuid": "44f031c52675d265e8f83a465ca7eac4d650bd20"}, "author": "vneedham@thehill.com (Vicki Needham )", "url": "http://thehill.com/policy/finance/256348-jobless-claims-fell-13000-last-week", "ord_in_thread": 0, "title": "Jobless claims fell 13,000 last week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jobless claims fell 13,000 last week By Vicki Needham - 10/08/15 11:01 AM EDT \nFirst-time claims for jobless benefits fell sharply last week, a sign that employers are keeping their workers even as they have recently slowed their pace of hiring. \nWeekly applications for unemployment insurance dropped 13,000 to a seasonally adjusted 263,000, keeping levels near historic lows, Labor Department said Thursday. ADVERTISEMENT The four-week average, a better tracker of the job market’s health, fell 3,000 to 267,500. \nThe number of people receiving benefits — about 2.2 million — is near a 15-year low, as employers hang onto their workers amid signs that consumers are feeling more confident and will accelerate their spending, especially as they continue saving money at the gas pump. \nConsumer spending accounts for about 70 percent of economic growth. \nBut global turmoil — economic slowdowns in China, Europe and Brazil — in recent months has subdued more robust jobs growth in the U.S. Employers added only 142,000 jobs last month and the three-month average fell below 200,000 to 167,000. \nBut economists are optimistic that jobs growth will pick up and the U.S. economy will hit full employment by next summer. \nAlong with the labor market expansion should come long-awaited higher wages for workers, they say. Tags: Past: 1 day Shock! McCarthy drops from Speaker... Majority Leader Kevin McCarthy (R-Calif.) has dropped out of elections for... A.B. Stoddard: Clinton woes far... OPINION | Maybe a backlash against the Benghazi probe won’t be enough to... Seven Republicans who could be... Republicans are scrambling to find someone who can lead their fractured... Right flexes muscle ahead of... The endorsement is a blow to House Majority Leader Kevin McCarthy. Republican: 'Very real' chance GOP... Rep. Charlie Dent says GOP \"may need a bipartisan coalition\" to elect... Colbert: McCarthy uses ‘English-... McCarthy wants to \"let every mouth speech as one,” Colbert joked. Gingrich open to return to... The former Speaker said \"no citizen could ever turn down that kind of... Amid furor, Benghazi chairman... \"The contents of these emails are quite remarkable,\" Rep. Trey Gowdy said. Lanny Davis: The curtain’s been... OPINION | All he has left is to try to damage Hillary Clinton politically. McCarthy: 'Sometimes you have to... Asked if the House could be governed, McCarthy said: “I don’t know.\" Fiorina slams media for spreading... She said the media has taken the group's message \"hook, line, and sinker.\" Obama signs bipartisan tweak of... Obama announced that he had signed the bill alongside eight others. Sen. McCaskill rips 'Morning Joe'... \"I think some of it has been unfair and not balanced,\" she said. Carson: I faced a gunman “I have had a gun held on me when I was in a Popeyes,” Carson said. Overnight Health: Dems accuse GOP... DEMS: GOP CHAIR HIDING FULL PLANNED PARENTHOOD FOOTAGE: Top House... GOP lawmaker warns leadership... Rep. Walter Jones is calling for leadership candidates with \"misdeeds\" to... WH blames ‘extreme ideology’ in... An Obama aide said the next Speaker will have to unite a divided caucus. Dems catch GOP off guard with... Democrats called a rare voice vote to strike the video from the hearing’s... How John Boehner could stay Speaker Boehner’s nightmare could become reality if Republicans fail to rally... Planned Parenthood billed Medicaid... Susan Thayer reiterated her years-old accusations during a hearing on... Webster claims early win in... But the Florida Republican emphasized that he does not consider himself... Dems set sights on Senate majority Democrats see 2016 as a prime opportunity to regain a majority in the... Intel chairs slam 'knee-jerk'... The bill could get floor time as early as next week. Dem draws up Craigslist ad for... \"Are you ready for the challenge of a lifetime? Then this job is for you!\" GOP faces debt-limit divide Congressional Republicans are divided on what strategy to adopt. French train attack hero stabbed Airman 1st Class Spencer Stone is in critical condition. GOP committee chairmen: Pump... \"Members need to come together to figure out what we are and where we are...", "external_links": [], "published": "2015-10-08T18:01:00.000+03:00", "crawled": "2015-10-09T02:05:18.583+03:00", "highlightTitle": ""}