{"organizations": [], "uuid": "1788493af6c1fcd57d8cd5ff8c68ae306153d9ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30295709/riverside-takes-the-plunge-adds-plumbing-franchisor", "country": "US", "title": "Riverside Takes The Plunge, Adds Plumbing Franchisor", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Riverside Takes The Plunge, Adds Plumbing Franchisor - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T21:11:00.000+03:00", "replies_count": 0, "uuid": "1788493af6c1fcd57d8cd5ff8c68ae306153d9ce"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30295709/riverside-takes-the-plunge-adds-plumbing-franchisor", "ord_in_thread": 0, "title": "Riverside Takes The Plunge, Adds Plumbing Franchisor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Drain Doctor Joins Riverside Franchising Platform\nCleveland, Ohio\nThe Riverside Company has added Drain Doctor to its Dwyer Group (Dwyer) franchising platform. Based in Peterborough, England, Drain Doctor is a franchisor of plumbing concepts throughout the UK. Dwyer is a holding company for 13 trade service franchise brands that together include more than 2,000 franchisees in seven countries.\nDrain Doctor serves both residential and commercial customers through 42 franchisees. Drain Doctor has held the UK master license to Dwyer’s Mr. Rooter brand and system since 1993.\nEnd customers choose Drain Doctor to receive a consistently high quality and competitively priced service. Drain Doctor specializes in professional grade plumbing and drainage services to both residential and commercial end-markets.\n“Dwyer has a long history with Drain Doctor and is eager to work even more closely with them,” said Riverside Principal Meranee Phing. “Drain Doctor and its team provide exceptional service across the UK, and this acquisition provides an excellent growth opportunity for both companies.”\nRiverside and Dwyer plan to drive growth at Drain Doctor by improving franchisee training, increasing marketing efforts and widening Drain Doctor’s footprint within the UK. Drain Doctor will also see a significant benefit from Dwyer’s polished and integrated development and lead generation efforts.\nThe acquisition expands Dwyer’s UK franchise offering, which also includes Mr. Electric and Aire Serv (HVAC).\nDrain Doctor is the fourth add-on Dwyer and Riverside have completed this year, and builds on Riverside’s franchising track record. Industry Sector Head and Origination Principal Jeremy Holland leads Riverside’s Franchising specialization, supported by franchising industry veteran and Senior Advisor Steve Siegel.\nWorking with Phing on the transaction for Riverside were Partner Sarah Roth, Senior Associate Jason Fulton, Associate Chase Eckert and Operating Partner Tom Anderson. Partner Anne Hayes worked on financing the transaction for the firm.\nMadison Capital, GE Capital, NXT Capital and Ares Capital provided financing for the transaction. Jones Day, Bird & Bird and KPMG advised Riverside on the transaction.\nAbout The Riverside Company\nThe Riverside Company is a global private equity firm focused on acquiring and investing in growing businesses valued at up to $300 million. Since its founding in 1988, Riverside has invested in more than 400 transactions. The firm’s international portfolio includes more than 80 companies.\n //www.prweb.com/releases/2015/10/prweb13029693.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13029693.htm"], "published": "2015-10-19T21:11:00.000+03:00", "crawled": "2015-10-19T20:20:37.796+03:00", "highlightTitle": ""}