{"organizations": [], "uuid": "93ed0e6958695395ac1dbceb6753ad940c058eee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/5/1/o/f/image.related.articleLeadwide.620x349.gkindh.png/1445837109525.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/china/chairman-of-asx-company-detained-in-china-on-money-claims-20151026-gkindh.html", "country": "AU", "title": "Chairman of ASX company detained in China on money claims", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Chairman of ASX company detained in China on money claims", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "93ed0e6958695395ac1dbceb6753ad940c058eee"}, "author": "Peter Ker", "url": "http://www.smh.com.au/business/china/chairman-of-asx-company-detained-in-china-on-money-claims-20151026-gkindh.html", "ord_in_thread": 0, "title": "Chairman of ASX company detained in China on money claims", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yong Rong Tong, the chairwoman of Xiao Xiao, has been detained in China on charges. Photo: Bloomberg\nChinese authorities have ended the mystery surrounding the chairwoman of ASX listed company Xiao Xiao, by confirming she is being detained in China on charges.\nXiao Xiao, which once aimed to become a major player in the Australian childcare sector, said it had received confirmation from the Hangzhou government that its chairwoman, Yong Rong Tong, had been charged with allegedly diverting funds that were intended to fund a pre-school network in China.\nThe confirmation came 10 months after Xiao Xiao said it did not know the whereabouts of Ms Tong, but had unconfirmed information that she had been accused of diverting funds.\nXiao Xiao has confirmed its chairwoman Yong Rong Tong is being detained in China, 10 months after it said it did not know where she was. Photo: Zhang Chunlei\nIn a statement published on Monday, Xiao Xiao's deputy chairman Roger Smeed said the charges had prompted the Hangzhou government to take back ownership of the school network, which was ultimately licenced to Xiao Xiao via a Chinese company owned by Ms Tong.\nAdvertisement Despite Xiao Xiao requesting control of the schools be returned, the Hangzhou government has rejected the request until at least the time when Ms Tong's charges are heard.\nXiao Xiao has run a childcare centre in the Sydney suburb of Breakfast Point for several years, and the company said on Monday that asset had been sold for $180,000 in a bid to pay Australian moneys owed to creditors and the Australian Taxation Office.\nIt was bought for $257,000 in 2011.\nThe dire situation has had little impact on Xiao Xiao's share price, which has been suspended since October 2012.\nWith no assets left in Australia and some of its Chinese assets rescinded, Xiao Xiao appears to have little future in Australia.\nThe situation is a far cry from March 2012, when Chinese mining entrepreneur Xu Zi tried to become the major shareholder in the company, and tried to pay for the stake by giving Xiao Xiao an unpermitted iron ore mine in the Chinese province of Chongquing.", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T07:35:01.549+02:00", "highlightTitle": ""}