{"organizations": ["Ministry of Energy", "Proposed Oil Refinery Residents Association", "Ministry of Energy and Mineral Development"], "uuid": "08c95154112dcc9934d7e1a8f97724fd464bd00a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510121148.html", "country": "US", "title": "Uganda: 'What's Taking So Long?'", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Uganda: 'What's Taking So Long?'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T12:40:00.000+03:00", "replies_count": 0, "uuid": "08c95154112dcc9934d7e1a8f97724fd464bd00a"}, "author": "", "url": "http://allafrica.com/stories/201510121148.html", "ord_in_thread": 0, "title": "Uganda: 'What's Taking So Long?'", "locations": ["Hoima", "Kabaale Parish", "Uganda", "Buseruka"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["PORRA", "Kawooya", "Isaac Kawooya"], "text": "Uganda: The Men Running for President in 2016 Refinery area families protest delayed resettlement, give government sixty days to act. Hoima - At least 60 of the 93 families that are awaiting resettlement from land earmarked for an oil refinery staged a peaceful demonstration in Hoima town last week, protesting government's failure to relocate them three years after acquiring their land. Last Tuesday, the families walked for about 50 kilometres from Kabaale Parish in Buseruka sub-county to Hoima town where they presented their petition to the Resident District Commissioner (RDC), Isaac Kawooya. \"We believe that your good office will understand the suffering we are going through and take immediate action in view of our demands regarding the suffering we have been enduring since 2012 when the government through the Ministry of Energy and Mineral Development (MEMD) demarcated our land for the oil refinery,\" the petition dated 6th October reads in part. Innocent Tumwebaze, the Vice Chairman of the Proposed Oil Refinery Residents Association (PORRA) who led the families informed the RDC that for over 3 years now, the government had failed to resettle them. \"They claim to have bought land for us but they have failed to give us land titles, build houses and resettle us,\" he explained to Mr. Kawooya who only assumed office last month. \"We ask the Ministry of Energy and Mineral Development to buy land, give us land titles and build houses for all of us who opted for relocation and resettle us within two months from the date of this petition,\" he demanded. Kawooya promised to follow up the families' concerns with the relevant government ministries and agencies to ensure they get redress. Second petition This is the second petition that these families have made to government in the recent past. On 23rd June they wrote to the President requesting government to revise the draft relocation plan which is currently on display in the 13 villages which will be displaced by the refinery project. The two-paged petition rejected the proposed house plans that the government had made arguing that they are unsuitable. The current plan indicates that each family will get a self-contained house with an indoor kitchen, bathroom and toilet. These houses will be constructed in a 'resettlement village.' In addition to the residential zone, the area where government plans to relocate the families also has a commercial zone for business, a communal burial ground and a recreational area. \"Mr. President, this plan is unsuitable for our setting, we therefore strongly reject it,\" the petition read in part. They instead proposed that the government considers building for them three bedroomed houses but with the kitchen and toilet outside. The petition added that there are nine households of elderly people that opted for cash compensation to enable them move with their caretakers and relatives but the Ministry of Energy argued that they are vulnerable and therefore only eligible for 'Land for Land' compensation without a house. However, Oil in Uganda has since learnt that this case was reviewed and the elderly received cash compensation instead. Report by our Hoima Correspondent Uganda \nMost turning points historically occurred at election time see more » Copyright © 2015 Oil in Uganda. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-12T12:40:00.000+03:00", "crawled": "2015-10-12T21:48:58.569+03:00", "highlightTitle": ""}