{"organizations": [], "uuid": "e334c0a8498de3c89170500c6a46dfb80a4d8771", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/blow-uk-energy-plans-gas-210019209.html", "country": "US", "title": "Blow to UK energy plans as new gas plant in doubt", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Blow to UK energy plans as new gas plant in doubt", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T00:00:00.000+03:00", "replies_count": 0, "uuid": "e334c0a8498de3c89170500c6a46dfb80a4d8771"}, "author": "", "url": "https://uk.finance.yahoo.com/news/blow-uk-energy-plans-gas-210019209.html", "ord_in_thread": 0, "title": "Blow to UK energy plans as new gas plant in doubt", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Oct 11, 2015, 22:11 BST - UK Markets closed Blow to UK energy plans as new gas plant in doubt By Emily Gosden | Telegraph – 11 minutes ago Print \nExclusive: Developers of gas-fired plant that could power 2.2 million homes admit project is behind schedule and yet to secure investors \nThe Government’s plans to keep the lights on have suffered a fresh setback after it emerged the only new large gas power station due to be built in coming years is now in doubt. \nEnergy firm Carlton Power was awarded a subsidy contract by the Department of Energy and Climate Change last year to build a new 1.9 gigawatt plant at Trafford in Greater Manchester big enough to supply power to 2.2 million homes. \nThe £800 million plant was due to start generating in October 2018, but Carlton Power told the Telegraph it could no longer meet that date and had so far failed to secure financial backers for the project to go ahead at all. \nMike Benson, Carlton Power’s business development director, said securing investment had proved \"more difficult than we would have hoped\" due to a combination of long-term policy decisions that had skewed the market, and uncertainty caused by recent cuts to wind and solar subsidies. \nThe Trafford plant had been supposed to begin construction this summer after getting a subsidy contract through the Government’s 'capacity market'. \nThe scheme is designed to ensure there will be enough power plants to keep the lights on by paying their owners to guarantee they will be available. \nCarlton Power signed up to build the Trafford plant in return for subsidies of more than £30 million each year for 15 years. On top of the 'retainer'-style payment, it would then get revenues from selling electricity into the wholesale market. \nMr Benson said long-term political intervention through \"continuing direct subsidies for low carbon technologies such as wind, nuclear and solar\" skewed the wholesale power market, making the price artificially low and making it harder to invest in gas plants. \n\"Despite the widespread acceptance of the need for new gas fired generation, there is no market signal to support that investment,\" he said. \nHe added: \"The recent changes in government support for renewables is an issue that concerns the investors we are talking to, as this demonstrates an increase in political intervention and uncertainty over the long term structure of the UK market.\" \nIf Carlton Power fails to secure investment for the Trafford plant by next summer its subsidy contract will lapse and it will face an £8 million penalty. \nMinisters would then be left to make up any shortfall in electricity supplies for 2018 by offering subsidies to other plants, such as old mothballed coal or gas plants, or diesel generators. \nIndustry experts have been questioning for some time whether the Trafford plant would be commercially viable with the level of subsidy it agreed in the capacity market. \nLast week the Telegraph reported warnings from Alan Whitehead MP, Labour’s shadow energy minister, that some 20 gigawatts of new gas plants were needed by 2025 under the Government’s own plans, and that much higher subsidies - totaling billions of pounds - would have to be paid through the capacity market to secure them. \nThere are more than a dozen proposed gas-fired plants with planning permission, but many have been on hold for years. \nRichard Howard of think tank Policy Exchange estimated that gas plants could need subsidies at up to double the level secured by Trafford in order to go ahead. \nMany existing gas-fired power plants are losing money currently. \nMr Benson said gas plants remained “by far the most economic form of large scale electricity generation”. \nThe proposed Trafford plant's £800 million build cost compares with the £24.5 billion cost of the proposed new nuclear plant at Hinkley Point in Somerset, which would be 3.2 gigawatts - less than twice the size of Trafford. Gas plants have higher ongoing running costs once built, however. \nMr Benson said: \"Trafford could deliver reliable and flexible electricity at a long term price of around £72 per megawatt-hour, compared with the £92.50 per megawatt-hour guaranteed to Hinkley.\" \nHinkley Point is also suffering delays. The plant was once due online in 2017 but is now not expected until 2024 at the earliest. \nA spokesman for the Department of Energy and Climate Change said: \"The capacity market is an energy guarantee, designed to ensure we have a secure supply of electricity in the winter of 2018/19, making sure the lights stay on whilst getting the best deal for bill payers. \n\"A further auction in 2017 will allow power stations to bid for any additional capacity that is required for that winter.\"", "external_links": [], "published": "2015-10-12T00:00:00.000+03:00", "crawled": "2015-10-12T00:11:11.721+03:00", "highlightTitle": ""}