{"organizations": [], "uuid": "b6eff075c2c4ede3f2d9af71a8c3e762d89873c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/RgBClPVqIVI.Pm6gQd84aQ--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AHTTP_SKYNEWS_LIVE_1/redcar1-1-400x240_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-skynews/?format=rss", "section_title": "Finance News | Sky News - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/steel-firm-ssi-uk-goes-192003294.html", "country": "GB", "title": "Steel Firm SSI UK Goes Into Liquidation", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Steel Firm SSI UK Goes Into Liquidation", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:30:00.000+03:00", "replies_count": 0, "uuid": "b6eff075c2c4ede3f2d9af71a8c3e762d89873c9"}, "author": "", "url": "https://uk.finance.yahoo.com/news/steel-firm-ssi-uk-goes-192003294.html", "ord_in_thread": 0, "title": "Steel Firm SSI UK Goes Into Liquidation", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Oct 2, 2015, 21:54 BST - UK Markets closed Steel Firm SSI UK Goes Into Liquidation By (c) Sky News 2015 | Sky News – 1 hour 24 minutes ago View Photo \n\nSSI UK, which owns the Redcar steelworks, has gone into liquidation - leaving more than 1,700 workers facing unemployment. \nThai firm SSI applied at the High Court in Manchester to wind up its UK arm, days after it announced it was mothballing the site. \nThe Official Receiver has been appointed liquidator and will now assess the assets and determine how many workers will be retained. \nRoy Rickhuss, general secretary of the Community trade union which is representing many of the SSI UK workers, said: \"This is, of course, yet further devastating news for the workforce, their families and the community. \n\"Although it has been faced by significant market challenges, SSI must bear a great deal of responsibility for this situation and for the way its owners have treated the workforce in recent weeks... \n\"SSI should do the right thing and get out of the way so others can give steel a chance of a future on Teesside.\" \nThe news comes after the Government announced an £80m support package for workers facing redundancy as a result of the mothballing of the plant. \nThe money will provide training for the workers, and also enable other local businesses to grow and create jobs. \nFunding will also be available for workers who would like to start their own businesses, and tailored support will be given at local job centres. \nFormer Business Secretary Vince Cable said the failure of of the steelworks \"calls into question\" George Osborne's plans for a Northern Powerhouse. \nHe told Sky News Tonight the chancellor had put on hold a compensation package for the steel industry which could be \"critical\" for other \"wobbling\" plants. \nIn a statement announcing the support initiative Business Secretary Sajid Javid said: \"This is an extremely difficult time for the workforce at SSI and the local community. \n\"The package we are announcing today will provide important support to workers and the local economy. \n\"Across government we will continue to focus on providing assistance where we can.\" \nThe full details of the deal were being discussed on Friday, with both the Business Secretary and Business Minister Anna Soubry attending talks with a local taskforce. \nGareth Stace, director of the trade association for the steel industry, UK Steel, said: “This is a welcome announcement to support the local community in its hour of need. \n\"However, the much bigger issue is the future of the steel industry in the UK, which - make no mistake - is in crisis. \n\"The Government is able to ensure steel companies operate on a level playing field and it must use this opportunity to support the steel sector as I fear time is of the essence.\"", "external_links": [], "published": "2015-10-02T22:30:00.000+03:00", "crawled": "2015-10-02T23:59:47.461+03:00", "highlightTitle": ""}