{"organizations": ["Black Student Movement", "Oppidan Press", "UCT", "Rhodes University", "BSM"], "uuid": "67339497ba75aec01643db18eec01c8eba11e40b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/download/pic/main/main/csiid/00310633:19d4ae43c1afc55bb9ce21fb5b522600:arc614x376:w1200.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510262619.html", "country": "US", "title": "South Africa: After Fee Hikes Fall, Where to for Rhodes?", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Africa: After Fee Hikes Fall, Where to for Rhodes?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T16:47:00.000+02:00", "replies_count": 0, "uuid": "67339497ba75aec01643db18eec01c8eba11e40b"}, "author": "", "url": "http://allafrica.com/stories/201510262619.html", "ord_in_thread": 0, "title": "South Africa: After Fee Hikes Fall, Where to for Rhodes?", "locations": ["Grahamstown East", "South Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rhodes", "Zuma", "Stuart Thembisile Lewis", "Mabizela", "Ngcobozi", "Lihle Ngcobozi"], "text": "Economic Realities Versus the 'FeesMustFall' Movement Although negotiations with Rhodes management initially broke down and only resumed after Zuma's announcement, this is a clear victory for students at this institution. Student protesters marked the end of the shutdown with a candlelit vigil on Sunday night, which included a non-denominational prayer and a performance by the Rhodes choir. Donations were collected during the vigil for the victims of the xenophobic violence currently gripping Grahamstown East. At the vigil, the Black Student Movement (BSM) - which is the organisation behind most of the student protests at Rhodes this year and which organised the shutdown on this campus along with student political party organisations, the National Shutdown Collective and many non-aligned students - laid out their plans going forward. Lihle Ngcobozi, a spokesperson for the BSM and the originator of the #RhodesSoWhite hashtag, warned those gathered to be aware of the privileged position they are in as Rhodes students. \"[Rhodes] management has bent to the demands of the students. However, the national government has failed. The national shutdown continues,\" she said in a speech at the end of the vigil. \"We will continue to stand in solidarity. We will continue to protest on this campus because of our right to assemble,\" she said. Ngcobozi also asked students to please be forgiving towards students who continued to protest during the examination period: \"Every single day as you write your exams, be aware that others are going to be shot down by the police.\" Beyond these promises of continued solidarity protests, the battle at Rhodes seems, at least for now, to be over. Unlike institutions like UCT and Wits where protests continue, Rhodes does not outsource any of its labour beyond supplementing its existing cohort of Campus Protection Unit guards with staff from security company Hi-Tec. Rhodes management has shown itself, relatively speaking, to be willing to negotiate in good faith with students. Mabizela himself was often at the barricades or marches, though largely to negotiate with police and ensure that they did not interfere with the students' right to protest. For now, the Rhodes campus is quiet. Stuart Thembisile Lewis is currently in his fourth year of a Bachelor of Journalism degree at Rhodes University. He is the editor of the student newspaper The Oppidan Press. Essentially a leftie, pinko socialist, his Twitter bio is a collection of all things he does when he's not stuffing around on the internet. Follow him on Twitter. More on This", "external_links": [], "published": "2015-10-26T16:47:00.000+02:00", "crawled": "2015-10-26T17:47:02.925+02:00", "highlightTitle": ""}