{"organizations": [], "uuid": "a63c1d9d46072380bb21c13fec06299ef02ddeb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/m/j/m/s/n/image.related.articleLeadwide.620x349.gk75fv.png/1444642943072.jpg", "site_section": "http://www.smh.com.au/business/planners-go-rogue", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/mining-and-resources/x2-said-to-be-last-remaining-bidder-for-rio-tinto-coal-mines-20151012-gk75fv.html", "country": "AU", "title": "X2 said to be last remaining bidder for Rio Tinto coal mines", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "X2 said to be last remaining bidder for Rio Tinto coal mines", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "a63c1d9d46072380bb21c13fec06299ef02ddeb6"}, "author": "Brett Foley, Dinesh Nair and Thomas Biesheuvel", "url": "http://www.smh.com.au/business/mining-and-resources/x2-said-to-be-last-remaining-bidder-for-rio-tinto-coal-mines-20151012-gk75fv.html", "ord_in_thread": 0, "title": "X2 said to be last remaining bidder for Rio Tinto coal mines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mick Davis remains in the running for two Rio Tinto coal mines. Photo: Mark Graham\nX2 Resources, the private-equity firm founded by former Xstrata chief Mick Davis, has emerged as the last remaining bidder for control of two Rio Tinto Group coal mines in Australia, people with knowledge of the matter said.\nX2 is progressing in negotiations with Rio as the other interested parties, including Glencore Plc and New Hope Corp., are no longer in talks to buy the assets in NSW's Hunter Valley region. The mine stakes are thought to be able to fetch more than $US2.2 billion ($3 billion).\nRio chief executive Sam Walsh has sold $US4.5 billion of less-profitable assets since January 2013, reducing its coal portfolio amid falling prices in order to focus on larger iron ore and copper operations. Any deal would be the first purchase for Davis's X2 fund since he raised several billion dollars from investors to pursue mining acquisitions.\nNew Hope, which agreed last month to buy Rio's 40 per cent stake in the Bengalla coal venture in Australia for $US606 million , isn't pursuing the other mines Rio is selling in the country, according to the people. Glencore, which lost as much as $US14 billion in market value last month, is also said to be no longer active in the Rio process as its focus has shifted away from acquisitions.\nAdvertisement Rio could reach an agreement on the sale of the two mine stakes as early as year's end, according to one person. Rio is still open to offers and it's possible other suitors may yet emerge, another source said.\nShares of Rio fell 0.7 per cent on Monday. Representatives for X2, Rio, New Hope and Glencore declined to comment.\nThe two Rio mines – Hunter Valley Operations and Mount Thorley Warkworth – are near assets owned by Glencore. Hunter Valley Operations, which is part-owned by Japan's Mitsubishi Corp., produced more than 11 million metric tonnes of thermal coal in 2013 and 2.6 million tons of semi-soft coking coal, according to Rio's website.\nMount Thorley produced more than 2.3 million tonnes of thermal coal and 1.8 million tonnes of semi-soft coking coal that year, while Warkworth had more than 6.9 million tonnes of thermal coal output and more than 1.2 million tonnes of semi-soft coking coal.\nGlencore CEO Ivan Glasenberg said in March last year the company was exploring a potential deal with Rio for the mines, including forming a joint venture. No deal was agreed, and Rio revealed in October it had rejected a merger approach from the Swiss commodities trader that would have created the world's largest miner.\nGlencore and Sumitomo Corp in 2013 agreed to pay $US1.02 billion for 50.1 per cent of Rio's Clermont mine in Queensland state. In May, Rio sold its 50 per cent holding in the Sengwa colliery in Zimbabwe to its former local unit, RioZim.\nCoal is at eight-year lows amid an oversupply in the market and slowing demand in China, the biggest consumer. Australia's Newcastle coal, an Asian benchmark, has tumbled to less than $US54 a tonne since surging above $US136 a tonne in early 2011.\nBLOOMBERG", "external_links": ["http://www.afr.com/business/mining/rio-tinto-sells-bengalla-coal-stake-to-new-hope-for-us606m-20150929-gjxr9g"], "published": "2015-10-12T03:00:00.000+03:00", "crawled": "2015-10-12T15:12:58.429+03:00", "highlightTitle": ""}