{"organizations": [], "uuid": "3598ea095a3fb4b420741c789bfd0d5875f7afb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/16/alcoa-union-idUSL3N12G1WC20151016", "country": "US", "title": "UPDATE 1-Union accepts proposed labor deal at Alcoa Intalco aluminum smelter", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Union accepts proposed labor deal at Alcoa Intalco aluminum smelter | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T09:12:00.000+03:00", "replies_count": 0, "uuid": "3598ea095a3fb4b420741c789bfd0d5875f7afb4"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/16/alcoa-union-idUSL3N12G1WC20151016", "ord_in_thread": 0, "title": "UPDATE 1-Union accepts proposed labor deal at Alcoa Intalco aluminum smelter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds detail on negotiations)\nOct 16 (Reuters) - Workers at Alcoa's Intalco Works aluminum smelter voted to accept the company's final contract offer, staving off a second labor dispute at a U.S. smelter this year as prices tumble below production costs.\n\"The Contract was accepted,\" The international Association of Machinists & Aerospace Workers said on its website.\nContract negotiations began on Oct. 1 between Alcoa and the International Association of Machinists & Aerospace Workers Local 2379, which represents 500 of the 560 workers at the 230,000 tonne-per-year smelter in Ferndale, Washington.\nThe prior four-year contract will expire on Friday.\nThe vote prevented any industrial action at the plant, as aluminum prices on the London Metal Exchange (LME) languish near 6-year lows and after the Midwest premium AL-PREM paid on top of futures for physical delivery fell an unprecedented 66 percent from its peak in January.\nDespite the plunge in prices to levels below many smelters' costs of production, output has risen in China, the world's leading producer and consumer, and the resulting rise in exports has pressured primary producers elsewhere in the world.\nThe agreement comes just four months after workers at Century Aluminum's Hawesville, Kentucky smelter were locked out for a month after rejecting the company's offer four times.\nThough they ultimately approved the deal, Century, controlled by Swiss commodity trade house Glencore PLC, later announced it would reduce output at the plant as a result of weak prices caused by exports from China.\nAlcoa presented Local 2379's negotiating committee with its last, best and final offer last Friday. The proposal extends the Oct. 11 agreement through March 31, 2017 and contains no wage increases, as the union had demanded, according to a post on its website.\nAlcoa, one of the world's largest aluminum producers, had threatened to close the smelter multiple times in the past due to uncertainty over the availability of affordable power.\nIn 2012, Alcoa signed a 10-year power contract with the Bonneville Power Administration for the smelter, quelling those concerns.\nThe vote will bring a welcome sense of stability at a tumultuous time for Alcoa, which plans to split into two separate businesses next year.\nUnder the new structure, the Intalco smelter would belong to an upstream company that would include Alcoa's primary aluminum, alumina and bauxite businesses, which would be a separate company from the downstream business that makes products like sheet and billet for the automotive and aerospace industries. (Reporting by Luc Cohen in NEW YORK and Melanie Burton in MELBOURNE; Editing by Richard Pullin and Ed Davies )", "external_links": [], "published": "2015-10-16T09:12:00.000+03:00", "crawled": "2015-10-16T08:57:11.971+03:00", "highlightTitle": ""}