{"organizations": [], "uuid": "6c8bc710201d343b0b99a3b150c8ee776bf1e35e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/eHZfEsgAkNIQj6QkD6nsdg--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/812f960424b48b7004980f2d9aee4d6006dcfaa5_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/ukraine-threatens-legal-war-russia-174049541.html", "country": "GB", "title": "Ukraine threatens 'legal war' with Russia over debt deal", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Ukraine threatens 'legal war' with Russia over debt deal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T20:40:00.000+03:00", "replies_count": 0, "uuid": "6c8bc710201d343b0b99a3b150c8ee776bf1e35e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ukraine-threatens-legal-war-russia-174049541.html", "ord_in_thread": 0, "title": "Ukraine threatens 'legal war' with Russia over debt deal", "locations": ["Ukraine", "Russia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 15, 2015, 19:15 BST - UK Markets closed Ukraine threatens 'legal war' with Russia over debt deal By Dmitry Zaks | AFP – 34 minutes ago View Photo \n\nUkraine threatened Thursday to launch a \"legal war\" with Russia after Moscow held out on a vital debt restructuring agreement needed to stop the crisis-torn nation hurtling towards a default. \nThe Ukrainian government gave Moscow a strict October 29 deadline to either accept the same terms as its other debt holders or face it in the international courts. \n\"All of Ukraine's creditors by their majority -- which stands at more than 75 percent of the creditors' committee votes -- agreed to write off Ukraine's debt,\" Ukrainian Prime Minister Arseniy Yatsenyuk told a briefing. \nThe Western-backed leader said the deal struck on Wednesday in London would provide his cash-strapped country with an immediate write-down of $3.0 billion (2.6 billion euros) and restructure future debt worth $8.5 billion. \nUkraine appeared to step back from the brink of default when it reached a 20-percent debt cut agreement in August with four Western investments titans that own about half of Ukraine's $18 billion in maturing commercial debt. \nBut those terms had to also be backed by other bondholders who demanded better terms. The smaller firms held debt with short-term maturities and would have had to wait much longer to see a return on investments made over the past 10 years. \nThe final vote itself took place behind closed doors in the London office of one of the Ukrainian government's financial advisers. \nThe main sticking point remains Russia, which refused to attend the London meeting. \nUkraine's giant eastern neighbour bought a $3.0 billion Eurobond from former Ukrainian president Viktor Yanukovych, just months before his ouster by pro-EU demonstrators in February 2014. \nRussia denies playing any part in the armed revolt that swept eastern Ukraine in the wake of his downfall and views the bond as a sovereign loan that is not subject to the commercial terms agreed with the Western funds. \n- Moscow demands payment - \nMoscow has threatened to file a lawsuit against Kiev in a London tribunal that could declare Ukraine in official default -- a decision that would complicate the release of further assistance to Kiev from the International Monetary Fund. \n\"Russia has one more deadline -- October 29 is it,\" Yatsenyuk said. \nOctober 29 marks the date by which lenders must swap their old Eurobonds for new higher-yielding Ukrainian debt that will be repaid between 2019 and 2023. \nRussian President Vladimir Putin's official spokesman rejected Yatsenyuk's ultimatum. \n\"There are no changes in Russia's position concerning the debt,\" Interfax quoted Dmitry Peskov as saying. \n\"As both Russian Finance Minister Anton Siluanov and President Vladimir Putin had said -- this is a government-to-government debt.\" \nThe IMF is expected to rule in the coming months on whether Kiev or Moscow is right about the commercial or sovereign nature of the disputed loan. \n- Ukraine's limited options - \nThe ill-fated Eurobond was issued in Ireland (Other OTC: IRLD - news ) and falls under the jurisdiction of London's High Court. \nIt (Other OTC: ITGL - news ) is unclear whether the IMF and other nations could continue lending to Ukraine should the London court side with Moscow. \nPutin suggested on Wednesday that the IMF simply give Kiev another cash injection to resolve the dispute. \n\"Why does the IMF not want to add these $3.0 billion so Ukraine can pay it back?\" Putin asked his finance minister during a nationally-televised meeting. \nThe IMF has never hinted at such a possibility and did not respond to the Kremlin (LSE: 0Q8D.L - news ) chief's remarks. \nBut analysts said Ukraine was running out of options. \n\"Ukraine cannot take legal action on the Russian-held bond. Only Russia can, in the event Ukraine does not pay its debt on time,\" said Olena Bilan of Kiev's Dragon Capital (Other OTC: DRGV - news ) investment company. \n\"But it is good to see Ukraine being ready for court proceedings. It means that it has something to offer in response,\" Bilan told AFP.", "external_links": [], "published": "2015-10-15T20:40:00.000+03:00", "crawled": "2015-10-15T21:15:55.030+03:00", "highlightTitle": ""}