{"organizations": [], "uuid": "abf7532a6fbbb24e2cc9a965e8c1ffd9af1c0e8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/0/5/4/m/image.related.afrArticleLead.620x365.gjyv7h.png/1443771347456.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/whos-to-blame-campbell-newman-turns-on-the-media-20151001-gjyv7h", "country": "AU", "title": "Who's to blame? Campbell Newman turns on the media", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Who's to blame? Campbell Newman turns on the media | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T15:16:00.000+03:00", "replies_count": 0, "uuid": "abf7532a6fbbb24e2cc9a965e8c1ffd9af1c0e8e"}, "author": "Mark Ludlow", "url": "http://www.afr.com/news/politics/whos-to-blame-campbell-newman-turns-on-the-media-20151001-gjyv7h", "ord_in_thread": 0, "title": "Who's to blame? Campbell Newman turns on the media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Queensland premier Campbell Newman takes aim at the media in a new book. Glenn Hunt Share on twitter by Mark Ludlow Former Queensland premier Campbell Newman – who managed to destroy the biggest parliamentary majority in Australia's political history within the space of three years – has committed the ultimate sin for an outgoing politician. He has written a book only months after leaving politics.\nNot only that, he has taken to blaming the media and his colleagues in the Liberal National Party for its disastrous election defeat in January.\nNormally when a senior politician departs they need time to detox and go \"cold turkey\" to get the venom, the back-biting and the bitterness out of their system. To gain some perspective.\nSome line up an overseas diplomatic posting to ease the pain. Former Queensland premier Peter Beattie was appointed as North American trade commissioner after he quit politics in 2007, which also allowed his successor Anna Bligh to get some clear air.\nWhen it came for Bligh's exit after the 2012 election landslide defeat, she moved interstate to Sydney to start afresh.\nBarely nine months since his controversial LNP government was voted out, Newman's 330-page biography – written by his former parliamentary colleague Gavin King – reveals the wounds of defeat are still fresh.\nWhile there is some talk of the need for reform of Australia's political system, the book, \" Can Do - Campbell Newman and the Challenge of Reform \", will be seen as a way to settle old scores, both with former colleagues and the media.\nThe book, to be released next week, is published by small Ballarat-based publisher Connor Court Publishing which has become known as the go-to publisher for conservatives including outspoken Liberal Senator Cory Bernardi.\n In it Newman glosses over his own short-comings – most notably his aggressive, confrontational style which resulted in fights with key conservative constituents such as doctors and the judiciary – to shoot the messenger.\n\"They [journalists] are not interested in the government or reform or the reasons behind the decisions we made,\" says Newman decries in the book.\n\"They are only interested in the tactical, the here and now, they only ever look for short-term politics and gossip. And they have got a nerve to ridicule people like me who tried to actually get things done. And they have always ridiculed and sneered.\"\nThe level of hatred against the media was revealed at the end of the train-wreck January election campaign.\n\"That's the last press conference I'll ever have to do .... that's the last time I'll ever have to talk to that pack of bastards,\" Newman told North Queensland MP Michael Trout.\nThe Newman government could never be accused of shirking reform. It tried to overhaul the state's finances by cutting the public service, which was bloated after a decade of Labor rule, and privatising inefficient state-controlled assets.\nNewman has a few regrets. These include appointing former federal Liberal treasurer Peter Costello to undertake a commission of audit after the LNP won office, the appointment of Tim Carmody as chief justice and the prolonged doctor's contract dispute. Even scrapping the Premier's Literary Awards, which outraged the Left, gets a mention.\nBut Newman also uses the book to shift blame onto his colleagues, especially treasurer Tim Nicholls who endlessly travelled the state trying to sell the $37 billion privatisation plan. The LNP executive and consultancy firm Crosby Textor are given a serve for not airing negative television ads against Labor, like the same ones he and his family copped in the 2012 campaign.\nKing has bemoaned the focus on Newman's gripes about the media in pre-release publicity. But the harsh reality is the book comes across like a modern critique of the news media.\nBeattie says writing a book can be cathartic but he says it's clear Newman is not over his defeat and needs to move on.\n\"It's a bit different to people who retire of your own choice, but the problem for people who lose is that it oftens scars some of them for life and they often never get over it,\" Beattie told AFR Weekend .\n\"You have to leave politics behind and learn to forgive and forget. If you carry around grudges it's like a cancer that will eat away at you for the rest of your life.\"", "external_links": ["https://twitter.com/http://twitter.com/M_Ludlow"], "published": "2015-10-02T15:16:00.000+03:00", "crawled": "2015-10-02T22:54:37.204+03:00", "highlightTitle": ""}