{"organizations": [], "uuid": "597c4d3762b4dfa49c5508e962a385f6d594eda9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/20937fa36891ecf27d0667bdf7dad6100def1388/c=0-376-4632-2993&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/07/22/USATODAY/USATODAY/635731345487272554-nhtsarosekind15.JPG", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.usatoday.com/story/money/cars/2015/10/20/nhtsa-mark-rosekind-vehicle-to-vehicle-national-highway-traffic-safety-administration/74278102/", "country": "GB", "title": "Auto safety chief: Car companies must embrace vehicle communication tech", "performance_score": 0, "site": "usatoday.com", "participants_count": 1, "title_full": "Auto safety chief: Car companies must embrace vehicle communication tech", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "597c4d3762b4dfa49c5508e962a385f6d594eda9"}, "author": "yahoo", "url": "http://www.usatoday.com/story/money/cars/2015/10/20/nhtsa-mark-rosekind-vehicle-to-vehicle-national-highway-traffic-safety-administration/74278102/", "ord_in_thread": 0, "title": "Auto safety chief: Car companies must embrace vehicle communication tech", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NHTSA Administrator Mark Rosekind backs self-driving cars and other new technologies that enhance auto safety (Photo: Mark Wilson, Getty Images) \n2 CONNECT 15 TWEET LINKEDIN COMMENT EMAIL MORE ARLINGTON, Va. -- As the auto industry grapples with a series of safety scandals, U.S. regulators are pressing forward with their plan to require systems that enable vehicles to avoid accidents by communicating with each other.\nNational Highway Traffic Safety Administration administrator Mark Rosekind told reporters Tuesday he \"absolutely\" agrees with members of Congress who accused the auto industry of fostering a culture of corruption with regard to safety.\nThat's partly why he says he is pushing proactive safety measures that would force automakers to adopt so-called connected vehicle systems to avoid accidents in the first place.\nIn the wake of scandals that have rocked some of the auto industry's leading companies, Rosekind said the industry must restore confidence by devoting resources to vehicle-to-vehicle communication systems. The industry is coming under fire from lawmakers for running afoul of regulations, ranging from Volkswagen's emissions regulation cheating software, to General Motors' failure to fix a deadly ignition-switch defect, to Fiat Chrysler's lackluster recall responses.\n\"We need drivers and the public to trust these new technologies, and they will not accept or trust if they're concerned … the manufacturers don't have their safety as their priority,\" Rosekind said.\nThe NHTSA administrator spoke to reporters after experiencing a real-world demonstration of connected vehicle systems.\nTechnicians drove several vehicles on the express lanes of local interstates — the mid-day period during which the lanes were closed to other vehicles — to gauge the performance of test systems. For example, the vehicles used their on-board systems to detect the staged presence of a construction worker who was wearing a vest with embedded dedicated short-range communication technology.\n\"We're out of the lab. We're in the real world, and that's really hard,\" Rosekind said.\nAutomakers are investing in similar technology to help vehicles exchange information with each other and with infrastructure on the roadway. The technology is viewed as crucial to accelerating self-driving cars.\nGM CEO Mary Barra told USA TODAY in an interview last week that she has personally assured Rosekind of GM's commitment to safety. GM and Fiat Chrysler agreed to pay NHTSA fines and overhaul their recall processes.\n\"Not only is it a sincere commitment to be safety leaders in the industry, but we're backing it up with a lot of actions,\" Barra said. \"They're our regulator, and we respect that.\"\nLawmakers, however, have pelted the industry with criticism.\n\"The American public are not crash-test dummies and should not be treated as such,\" U.S. Rep. Frank Pallone, D-N.J., said during a hearing on the Volkswagen episode earlier this month, adding that he believes there's a \"pervasive culture of corruption\" in the auto industry.\nFollow USA TODAY reporter Nathan Bomey on Twitter @ NathanBomey . \n2 CONNECT 15 TWEET LINKEDIN COMMENT EMAIL MORE Read or Share this story: http://usat.ly/1LIPcPF TOP VIDEOS 'Guitar Hero Live' lets you rock on stage 01:28 Apple lost millions of Music users when trial ended; 6.5M remain 01:05 Facebook will tell you when A government hacks your account 01:20 Yum plans to split its China business 01:03 IBM falls short in revenue estimates, cuts profit forecast 01:42 Selfie pay? New app lets you pay with your face 01:09 What to watch Tuesday: can Chipotle satisfy investors' cravings? 01:57 Oprah buys 10% of Weight Watchers, stock soars 02:08 Looking to flirt with an online stock? Consider online dating 00:41 App to fine-tune Sonos speakers 01:05 Ford F150 review: The first aluminum pickup truck 02:57 What to watch in the week ahead: will investors be lovin' McDonalds? 01:55 Would you lose your pinky to pay off student debt? 01:39 Cool movie cars from the '60s, '70s & '80s 02:56 Tearful flight attendant recalls time with US Airways 01:33 From Amazon to Chipotle: Stocks reporting earnings this week | America's Markets 01:59 Just Cool Cars: '62 Chevrolet 02:37 United Airlines CEO Munoz Suffers heart attack: WSJ 01:04 Is there trouble ahead for U.S. stocks? 06:02 MORE STORIES", "external_links": [], "published": "2015-10-20T03:00:00.000+03:00", "crawled": "2015-10-20T23:58:02.464+03:00", "highlightTitle": ""}