{"organizations": [], "uuid": "6440b7d39864105edd15004d7204d62683e5b9b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.gov.ie", "main_image": "", "site_section": "http://finance.gov.ie/rss.xml", "section_title": "An Roinn Airgeadais, Department of Finance", "url": "http://finance.gov.ie/news-centre/press-releases/appointment-professor-philip-lane-governor-central-bank", "country": "IE", "title": "Appointment of Professor Philip Lane as Governor of the Central Bank", "performance_score": 0, "site": "finance.gov.ie", "participants_count": 1, "title_full": "Appointment of Professor Philip Lane as Governor of the Central Bank", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T14:05:00.000+03:00", "replies_count": 0, "uuid": "6440b7d39864105edd15004d7204d62683e5b9b6"}, "author": "editorfinance", "url": "http://finance.gov.ie/news-centre/press-releases/appointment-professor-philip-lane-governor-central-bank", "ord_in_thread": 0, "title": "Appointment of Professor Philip Lane as Governor of the Central Bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Appointment of Professor Philip Lane as Governor of the Central Bank 20.10.15 \nAppointment of Professor Philip Lane as Governor of the Central Bank \n\nThe Minister for Finance, Michael Noonan TD, announced today (20 October 2015), that the Government will advise that the President appoints Professor Philip Lane as the next Governor of the Central Bank. Professor Lane is currently the Whately Chair of Political Economy at Trinity College Dublin. The current Governor, Professor Patrick Honohan, will retire later this year. \n\nSpeaking on the selection, the Minister for Finance said: \n“I would like to congratulate Professor Lane on his nomination to this prestigious national and European position. Professor Lane’s outstanding economic, financial and policy making record ideally position him to lead the Central Bank in the coming years. Also, his appointment by ECB President Draghi to chair the Advisory Scientific Committee of the European Systemic Risk Board demonstrate the standing he is held in at European level.” \n\nCommenting on the selection process, Minister Noonan added: \n“Professor Lane was chosen as the Government’s nomination to the position of Governor following an extensive national and international executive search process to identify suitably qualified candidates in Ireland and abroad. This was undertaken due to the unique importance of the position of Governor of the Central Bank to the Irish financial system and the Irish economy. Over one hundred potential candidates were identified from around the world, with a wide-ranging and rigorous selection process resulting in the nomination of Professor Lane. \n\nThis was the first time such an open selection process was used for the appointment of the Central Bank Governor and I would like to thank all of the applicants for putting their names forward for this role. I also appreciate the efforts of all involved in the search process, including the interview panel and their advisers, Merc. I particularly valued the feedback from the interview panel members.” \n\nMinister Noonan once again paid tribute to Professor Honohan: \n“Professor Honohan took up the position of Governor of the Central Bank at a very difficult time for our country in 2009. He has played a key role in stabilising our economy and in our move back towards prosperity and has also overseen significant reform in the Central Bank during this period. As Minister for Finance, I have greatly valued his expertise and counsel. On behalf of the Government I sincerely thank him for his contribution and wish him every success in the future.”", "external_links": [], "published": "2015-10-20T14:05:00.000+03:00", "crawled": "2015-10-20T16:17:13.072+03:00", "highlightTitle": ""}