{"organizations": [], "uuid": "42090510a9fd76d1d89290adee53870e4766ebc2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/10/Arun-Jaitley-Ret.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/arun-jaitley-calls-for-reforms-in-world-bank-at-global-meet/149620", "country": "IE", "title": "Arun Jaitley calls for reforms in World Bank at global meet", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Arun Jaitley calls for reforms in World Bank at global meet | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T03:05:00.000+03:00", "replies_count": 0, "uuid": "42090510a9fd76d1d89290adee53870e4766ebc2"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/arun-jaitley-calls-for-reforms-in-world-bank-at-global-meet/149620", "ord_in_thread": 0, "title": "Arun Jaitley calls for reforms in World Bank at global meet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Need for 'quick pace' development in ports, space technology: Narendra Modi PM Narendra Modi lays foundation stone of JNPT's Rs 7,900 cr 4th terminal in Mumbai Govt may bar pharma firms from giving gifts to doctors; ban 'samples' too Finance Minister Arun Jaitley has made a strong case for raising shareholding of developing nations including India in the World Bank Group to reflect their share in the global economy and demanded a significant hike in the capital to meet growing financing needs.\nStating that the demand for development finance continues to be very strong, he Quote: d a bank’s report admitting inability to support elevated levels of lending beyond 2018.\nIFC – an arm of the World Bank – is already capital constrained. Also, there is the additional challenge of mobilising over USD 100 billion per year for climate finance.\nSpeaking at the Plenary Meeting of the Development Committee here, he emphasised the need for bigger financing and implementation plans by the World Bank Group to achieve the Sustainable Development Goals (SDGs).\nIndia, he said, expects a dynamic formula for shareholding of World Bank to be finalised by Annual Meeting 2016.\nThe formula should incorporate “elements which help enhance the voice, role and voting share of the developing countries and reflect their increased share in global GDP and their contribution to building the bank’s reserves,” he said.\nJaitley said as the share of the developing and transitioning countries in the world GDP increases from 39 per cent in 2008-2010 to 49 per cent in 2013-15, “the shareholding realignment should reflect the same and be completed by 2017.”\nDevelopment Committee is the ministerial-level forum of the World Bank Group and the IMF for intergovernmental consensus-building on development issues. Jaitley represented the constituency consisting of the countries — Sri Lanka, Bangladesh, Bhutan and India.\nIndia, Bangladesh and Bhutan are early dividend countries and are taking steps to leverage their demographic transition to achieve SDGs, he said.\n“The Executive Directors and the Bank should make an objective assessment of the financing needs of the SDGs. I am sure such assessment would call for a significant increase in the capital of the World Bank Group to meet the developmental objectives,” he said.\n“I would like these resources to be mobilised from new and additional sources and not at the cost of ODA for poverty and shared prosperity goals. The IBRD financing which is non-concessional and does not flow from the donor resources should not get accounted for in 100 billion flow,” he said.\nEconomic Affairs Secretary Shaktikanta Das, who also attended the IMF-World Bank annual meeting here tweeted, “India called for governance reforms in both institutions to reflect growing share of developing countries in global GDP.”\nJaitley said, “I must, however, add that the countries in my constituency are bucking the trend and are expected to post reasonably strong growth with India likely to grow at around 7.5 per cent, Bangladesh at 6.3 per cent, Sri Lanka at 6.5 per cent and Bhutan at 7 per cent,” he said.\nWith expected growth of only 4.3 per cent for 2015, the outlook for the developing countries has deteriorated.\n“Strong and inclusive economic growth is necessary for the developing economies to grow, prosper and develop sustainably. Such growth is also necessary for achieving the SDGs as well as the twin goals of the World Bank,” Jaitley said.\nTerming SDGs as ambitious, he said they would require ambitious financing and implementation plans. The Bank needs to work on human development, economic growth, jobs and social protection.\nJaitley said multilateral development bodies need to play a proactive role as providers and facilitators of large scale, long term and affordable development finance from private and public sources.\n“Particularly, the World Bank and IFC, will have to significantly increase their level of finance to support the SDGs,” he said adding the space created for additional lending by ‘margins of manoeuvre’ and other measures will run its course very soon.\nThe consultations on the World Bank’s proposed Environment and Social Framework must ensure the new norms are realistic, simple to implement and affordable in terms of cost and time, he said hoping the World Bank will suitably revise the framework after completing genuine, transparent, and borrower focused consultations.\nThe finance minister also participated in the Restricted Session of the International Monetary and Finance Committee (IMFC) of the International Monetary Fund (IMF) and the Informal Gathering of World Economic Leaders, organised by IMF and World Economic Forum in Peru yesterday, an official statement said.\nIMFC is a key body providing strategic direction to the work and policies of the IMF. The two events, organised as part of the Annual Meetings of the IMF and the World Bank, were attended by select Finance Ministers and Central Bank Governors. The closed door discussions centered on moderation of global growth and heightening of risks and volatility.\nLater, Jaitley participated in the panel discussion on ‘The Search for Growth and Stability amid Deflation and Divergence’, organised by Financial Times and Citi Group.\n“Speaking on the occasion, the Finance Minister said that the economic conditions in India are reasonably under control, notwithstanding two consecutive years of below normal monsoons,” the statement said.\nHe said that the commodity and oil prices decline have provided fiscal space for enhanced public sector investments in infrastructure and irrigation.\nConsequently, the Finance Minister said that the country has witnessed a staggering 35 per cent increase in the indirect tax collections in the first six months of the current fiscal year.\nHe said that the public investments in infrastructure are now playing a catalysing role in reinvigorating the private sector investments.\nThe inflation has declined from 11 per cent to 3.7 per cent during the last 15 months, which have also resulted in reduction of the bank rate and cost of capital, the minister added.\nJaitley said that the country is firmly on the path of fiscal discipline and has contained the fiscal deficit at 4 per cent (lower than targeted) last year.\nJaitley said that the FDI flows into the country have been robust.\nHe cited reports in foreign media that during the last six months, India was the leading destination for investments in greenfield projects, demonstrating the high degree of confidence of the global investors. The financial and forex markets in the country are also stable, notwithstanding recent global volatility, the minister added.\nOther panelists included Joaquim Levy, Brazilian Finance Minister, and Martin Wolfe, a noted economic commentator.\nWolfe complimented India on the management of public finances and the ability to continue with structural reforms, the statement said.\nThe finance minister elaborated that the environment for reforms in the country is positive. He said that from cooperative federalism, the country is now moving towards competitive federalism, with various States undertaking key reforms to improve business climate, expedite clearances and promote investments.\nJaitley explained that a few of the key reforms such as Goods and Services Tax and Bankruptcy law are high on the government’s agenda.\n 11, 2015 7:05 pm", "external_links": [], "published": "2015-10-12T03:05:00.000+03:00", "crawled": "2015-10-11T20:03:23.726+03:00", "highlightTitle": ""}