{"organizations": [], "uuid": "8c43a845e8a6652905161a6f658bf14267f735bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/column-inflation-targeting-falters/150294", "country": "IE", "title": "Column: Inflation targeting falters", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Column: Inflation targeting falters | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:25:00.000+03:00", "replies_count": 0, "uuid": "8c43a845e8a6652905161a6f658bf14267f735bd"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/column-inflation-targeting-falters/150294", "ord_in_thread": 0, "title": "Column: Inflation targeting falters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Editorial: Making govt accountable Editorial: Drought in farm reforms Studying Consumption Brazil’s economic situation has recently turned fragile. Inflation has surged up to 10%; its currency, the real, has tanked and faced a run until few weeks ago. The economy is deep into recession and expected to shrink by 3% this year. Credit-rating is downgraded to junk by Standard & Poor’s. Macroeconomic stability is under serious threat. Yet not so long ago, Brazil was hailed for achieving sustained macroeconomic stability in a period of accelerated growth.\nSince embracing an inflation targeting (IT) framework in 1999, Brazil did not quite experience high inflation unlike many EMEs including India. What happened to a country widely held as a benchmark of IT success amongst EMEs? If the framework had gained so much credibility, then why has the Banco Central do Brasil (BCB, the country’s central bank) failed to anchor inflation?\nAnalyses of Brazil’s economic problems have blamed its political leadership for trying to hurry up growth through fiscal expansion and forcing its central bank to lower interest rates when growth faltered in 2011; blatant corruption and diversion of public funds are other reasons. These factors are believed to have undermined macroeconomic stability. It is easy to recall a similar replay in India some years ago when fiscal extravagance and excessive monetary-easing led to a near V-shaped recovery post-crisis, but only for growth to stumble thereafter, pulled down by high and persistent inflation. Not surprisingly, RBI Governor Raghuram Rajan recently invoked developments in Brazil to caution those who wanted faster monetary easing to prop up growth.\nNarratives such as those Quote: d by the Governor (The New York Times) suggest that political expediency in Brazil undermined the BCB’s ability to respond adequately to emerging price pressures. Such descriptions, however, often mask long-term fundamental developments that led to a structural weakening of the economy, slowing down potential output growth, thereby, setting the stage for inflation to surge again when cyclical growth overheated. The dynamics of Brazil’s instability today is possibly better explained by an inappropriate policy framework, whose fault-lines stand exposed with the sharp, enduring turn in terms of trade.\nThat Brazil’s brisk growth was primarily driven by the commodities’ super-cycle or favourable terms of trade for its exports, was well-known. Equally well-known was that cycles eventually correct; growth then drops. This boom-bust process of commodity-driven growth is recently researched by the IMF (“Where are commodity exporters headed?\nOutput growth in the aftermath of the commodity boom” Chapter 2, World Economic Outlook, October 2015), showing that terms of trade corrections lead to a decline in the cyclical as well as structural (potential) components of growth; the drop in cyclical growth however, is twice the size of change in potential output.\nBrazil’s case, therefore, couldn’t have been any different. So, why did Brazil stand downgraded? Because analysts assessed the country’s potential output had fallen far more than initially anticipated; the negative output gap was much smaller. Inflation surfaced soon therefore as fiscal-monetary policies were eased to revive growth without an attempt to regain structural strength.\nThe seeds were sowed in the decade preceding the 2008 crisis, when the real appreciated persistently, scaling new heights in real effective exchange rate (REER) terms as well; by 2010, the real had appreciated more than 50% (see chart). This appreciation was essentially capital inflow-driven, and accompanied by gradual worsening of the current account. The fault was manifest and waiting to open up, as indeed it did when commodity prices peaked off in 2011.\nThe resulting external sector vulnerabilities and capital outflow since then have pushed Brazil’s economy into a vicious exchange rate depreciation-rising inflation-high interest rates spiral, even as it has slumped into deep recession.\nThese developments haven’t surprised anyone therefore. What is concerning though is that REER appreciation-related problems were in focus of policymakers, who also took limiting measures like currency intervention, reserves’ building and even taxes to discourage capital inflows, but failed to turn the tide.\nWhy could Brazil not stabilise the economy despite its past achievements? Because the past success rested solely upon a positive terms of trade. This delivered robust growth, fetched good public revenues, attracted lots of foreign capital and relentlessly drove up the exchange rate. The real’s appreciation in turn, contributed substantially in restraining inflation and meeting targets. However, the real appreciation eroded competiveness and destroyed manufacturing, as visible from the absolute decline in Brazil’s manufacturing export volumes. The economy became commodity export-propped which, when the going was good, yielded the famed macrostability and IT success that came to define Brazil once upon a time.\nPerversely though, it is the very inconsistency of its policy framework, viz., inflation targeting, flexible exchange rate and a fairly open capital account, that turned Brazil into a one-legged economy. Abundant global liquidity ensured excessive capital inflow every time interest rates responded to higher inflation. Sustained rising income pressures in the long commodity upswing phase boosted demand for non-tradables and higher relative prices, making it a self-perpetuating process and pushing the REER to unsustainable levels. Cheap tradable imports from countries like China then became more a necessity than an undesirable consequence, but seriously dented the domestic manufacturing base. Tracing such a process, the IMF points out that growth in commodity-dependent economies is rarely driven by productivity gains. What happens in the downswing phase is obvious: external pressures, high inflation and low growth result.\nThis is pretty much what Brazil faces today. In hindsight, it is inconceivable how this could have been avoided, given that the country transformed itself into mostly a commodity exporter with illusory gains from an inconsistent macro framework. Whether a more prudent fiscal stance may have materially, structurally readjusted the economy is open to question. And to expect an IT regime to successfully anchor inflation amidst glaring structural deficiencies in the external sector is wishful thinking perhaps. To the contrary, it raises strong doubts if Brazil’s initial successes in inflation-growth outcomes under IT owed more to sharp currency appreciation than any fundamental changes within. Research studies of Brazil’s IT regime have often noted the substantial contribution of the real’s appreciation in meeting inflation targets.\nThere are important lessons from Brazil’s experiences for India, a latecomer in adopting inflation targeting. In a somewhat parallel occurrence, a positive terms of trade has enormously helped India achieve low inflation and remarkable macrostability in the last one year. Structural changes to boost productivity, or growth in potential output, have been little. Yet, the macroeconomic achievements have emboldened policymakers to further open up the capital account, e.g., raising caps on foreign investments in government bonds, while fundamental imbalances on the current account side remain unaddressed. Like Brazil too, the gap could open any time the tide turns unfavourable.\nTo be sure, the IT framework articulated in the Urjit Patel Committee report (UPC) recognises exchange rate pressures and retains the policy option of intervention-cum-reserves’ accumulation as additional tool. But as Brazil’s, and India’s own subsequent trajectories illustrate, exchange rate appreciation can get difficult to avoid or manage in weak, dependent economic structures susceptible to shocks—the characteristics that define EMEs. It becomes imperative then to calibrate capital account opening with real, structural change for productivity gains. If allowed to race ahead of building a strong, diverse economic base, the triad of IT, flexible exchange rate and open capital account rarely sings in unison to yield either sustained macrostability or anchor inflation.\nThe author is a New Delhi-based macroeconomist\n 13, 2015 12:25 am", "external_links": [], "published": "2015-10-13T08:25:00.000+03:00", "crawled": "2015-10-13T10:36:05.917+03:00", "highlightTitle": ""}