{"organizations": [], "uuid": "a1ca8e645e9cec7b989d72b78b9ef894b678ebb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/logo.gif", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/nifty-sensex-turning-weak-ndash-monday-closing-report/43662.html", "country": "IN", "title": "Nifty, Sensex turning weak – Monday closing report", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Nifty, Sensex turning weak – Monday closing report - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T21:06:00.000+03:00", "replies_count": 0, "uuid": "a1ca8e645e9cec7b989d72b78b9ef894b678ebb9"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/nifty-sensex-turning-weak-ndash-monday-closing-report/43662.html", "ord_in_thread": 0, "title": "Nifty, Sensex turning weak – Monday closing report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @mldigital Nifty will be in a downward stretch if it closes below 8,115   We had mentioned in Friday’s closing report that Nifty, Sensex are looking overbought and that as long as Nifty stays above 8,000, bulls will be in control. Although the market was bullish at the beginning of the day, it could not be sustained. Overall, the major indices in the Indian stock markets ended the day with small losses of around 0.50%. The trends of the indices in the day’s trading are given in the table below:     Investor-anxiety over the ongoing quarterly results kept the Indian equity markets subdued on Monday. Initially, both the Sensex and Nifty opened in the green on the back of positive overseas markets. However, both indices soon ceded their gains, as investors were spooked regarding the uncertainty over the second quarter results. Notwithstanding the downward trend, hopes of healthy macro data points on industry output and inflation later in the day somewhat arrested the fall.   Analysts pointed out that the markets closed in the red due to the uncertainty over the second quarter results, which they fear might turn out to be below expectations due to currency fluctuations and slowing demand.   Asian markets closed on a positive note on Monday supported by a rally in the Chinese indices which were up 3%. The Chinese central bank had announced a stimulus package over the weekend. The Chinese government has also indicated its intentions to initiate reforms in the telecommunication sector.   Infosys was the first bluechip to come out with its results on Monday. The global software major reported a net profit of Rs.3,398 crore for second quarter registering a 9.8% growth year-on-year (YoY) and 12% on a sequential basis.   The factory output data for August and inflation figures for September will be released on Monday evening. Both the key data points will give future guidance to the Reserve Bank of India's next move on lending rates.   Sector-wise, information technology (IT), healthcare, technology, entertainment and media (Teck) and fast moving consumer goods (FMCG) stocks came under selling pressure. However, metals, capital goods and automobile scrip managed to stay afloat.   The S&P BSE metals index increased by 102.92 points, capital goods index gained by 52.02 points and automobile index was higher by 40.66 points. On the other hand, the S&P BSE IT index plunged by 239.73 points, healthcare index went down by 175.22 points, Teck index declined by 117.39 points and FMCG index was lower by 61.11 points.   Major Sensex gainers during Monday's trade were: Vedanta, up 7% at Rs.110.85; Hindalco Industries, up 5.98% at Rs.88.65; Gail, up 2.49% at Rs.319; Tata Motors, up 1.83% at Rs.362.40; and BHEL, up 1.76% at Rs.205.60.   The major Sensex losers were: Infosys down 3.88% at Rs.1,122.50; Lupin, down 2.16% at Rs.2,011.65; Cipla, down 1.71% at Rs.676.35; Sun Pharma, down 1.58% at Rs.892; and HDFC, down 1.44% at Rs.1,272.10.   The top gainers and top losers of the indices are given in the table below:     The closing values of the major Asian indices are given in the table below:", "external_links": [], "published": "2015-10-12T21:06:00.000+03:00", "crawled": "2015-10-13T00:34:18.356+03:00", "highlightTitle": ""}