{"organizations": [], "uuid": "3478fe0d7765dd6e76fc3eabfd4ef5a2b7855d09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=CVSL", "section_title": "Yahoo! Finance: CVSL News", "url": "http://finance.yahoo.com/news/cvsl-acquires-betterware-ltd-214100769.html", "country": "GB", "title": "CVSL Acquires Betterware, Ltd.", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "CVSL Acquires Betterware, Ltd. - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "3478fe0d7765dd6e76fc3eabfd4ef5a2b7855d09"}, "author": "CVSL Inc.", "url": "http://finance.yahoo.com/news/cvsl-acquires-betterware-ltd-214100769.html", "ord_in_thread": 0, "title": "CVSL Acquires Betterware, Ltd.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS, Oct. 15, 2015 /PRNewswire/ -- CVSL Inc. (NYSE MKT: CVSL) has acquired 100% of Betterware Ltd ., a United Kingdom-based direct-to-consumer company, making Betterware the tenth company to become part of CVSL and giving CVSL a commanding presence in the U.K. home shopping market.\nCVSL's Vice Chairman and Chief Financial Officer John Rochon Jr. noted that there are significant similarities between Betterware and Kleeneze , another well-known U.K. direct-to-consumer company, which CVSL acquired in March. \"These two famous brands and their sales networks will remain separate, while we expect major synergies in the operations of the two companies that we believe will yield efficiencies and improve profitability for both. The sales networks and customers of both companies should benefit.\"\n\"With Kleeneze and Betterware side by side within CVSL, we have a powerful position in the U.K. home shopping market. With both of these two established consumer growth brands in the CVSL portfolio, we expect to have a total sales network of about 13,000 people in the U.K. market, making us a major income opportunity creator in the U.K. and Ireland,\" he said. \n\"Having Betterware and Kleeneze together inside CVSL should give us an excellent platform for expansion into other European markets,\" added Mr. Rochon.\nWith about 5,000 distributors, Birmingham-based Betterware conducts business throughout the U.K. and Ireland. Customers order through distributors as well as by phone and online. Betterware transacts about five million customer orders every year.\nFor its last reported 12-month period, Betterware reported net revenue of approximately $36 million. \nBetterware has been one of the U.K.'s most successful home shopping companies since 1928. Best known for its extensive houseware and home care cleaning products, its range has grown over the years in response to customers' needs and includes gifts, personal care and beauty, as well as outdoor and electrical products.\n\"Joining the CVSL family represents a great opportunity for Betterware,\" said Rob Way, Managing Director of Betterware. \"This will open an exciting new chapter in our company's long and storied history. We are eager to make the most of this alliance and believe the efficiencies to be gained will be very good for our distributors and their customers.\" \nAbout CVSL\nCVSL is a growing federation of direct-to-consumer brands. Within CVSL, each company retains its own separate brand identity, sales force and compensation plan. CVSL companies currently include The Longaberger Company , a 42-year old maker of hand-crafted baskets and other home decor items; Your Inspiration At Home , an award-winning maker of hand-crafted spices and other gourmet food items from around the world; Tomboy Tools , a direct seller of tools designed for women as well as home security systems; Agel Enterprises , a global seller of nutritional products in gel form as well as the Caspi™ skin care line, operating in 40 countries; Paperly , which offers a line of custom stationery and other personalized products; My Secret Kitchen , a U.K.-based seller of gourmet food products; Uppercase Living , which offers a line of customizable vinyl expressions for display on walls in the home; and Kleeneze , a UK-based seller of cleaning, health, beauty, home, outdoor and a variety of other products. CVSL also includes Happenings , a lifestyle publication and marketing company.\nCautionary Note Regarding Forward-Looking Statements:\nThis press release contains forward-looking statements that involve risks and uncertainties. All statements other than statements of historical fact contained in this press release are forward-looking statements. We have attempted to identify forward-looking statements by terminology including \"anticipate,\" \"believe,\" \"can,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" or \"will\" or the negative of these terms or other comparable terminology. Although we do not make forward-looking statements unless we believe we have a reasonable basis for doing so, we cannot guarantee their accuracy. These statements include statements about the synergies in the operation of Kleeneze and Betterware, the benefits of the acquisition, size of the expected UK sales network and the acquisition providing a platform for future European expansion and are based upon current beliefs, expectations and assumptions. These statements are subject to a number of risks and uncertainties, as to CVSL's ability to continue its growth, improve the profitability of the companies and other risks outlined under \"Risk Factors\" in CVSL's Annual Report on Form 10-K/A for its fiscal year ended December 31, 2014 and those risks discussed in other documents we file with the Securities and Exchange Commission, which may cause our actual results, levels of activity, performance, or achievements expressed or implied by these forward-looking statements to differ materially from expectations. Except as required by law, we undertake no obligation to update or revise publicly any of the forward-looking statements after the date of this press release to conform our statements to actual results or changed expectations.\nCVSL Investor Relations Contact: Tucker Gagen ( tucker.gagen@cvsl.us.com )\nCVSL Media Contact : Russell Mack ( russell.mack@cvsl.us.com )\n\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/cvsl-acquires-betterware-ltd-300160858.html \nConsumer Discretionary Betterware Kleeneze", "external_links": [], "published": "2015-10-16T03:00:00.000+03:00", "crawled": "2015-10-16T08:33:37.090+03:00", "highlightTitle": ""}