{"organizations": [], "uuid": "a2f0818bf6ad91d3baeb4a0446211ae7c810d3ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "money.cnn.com", "main_image": "http://i2.cdn.turner.com/money/dam/assets/151013172650-retirement-marijuana-780x439.jpg", "site_section": "http://rss.cnn.com/rss/money_pf.rss", "section_title": "Personal finance news - CNNMoney.com", "url": "http://money.cnn.com/2015/10/14/retirement/retirement-savings-marijuana/index.html", "country": "US", "title": "Should I invest my retirement savings in a marijuana business? - Oct. 14,", "performance_score": 0, "site": "cnn.com", "participants_count": 5, "title_full": "Should I invest my retirement savings in a marijuana business? - Oct. 14, 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:13:00.000+03:00", "replies_count": 4, "uuid": "a2f0818bf6ad91d3baeb4a0446211ae7c810d3ef"}, "author": "Walter Updegrave", "url": "http://money.cnn.com/2015/10/14/retirement/retirement-savings-marijuana/index.html", "ord_in_thread": 0, "title": "Should I invest my retirement savings in a marijuana business? - Oct. 14,", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I'm 63 years old and thinking of investing $100,000 of my $500,000 retirement account in a start-up business that will grow, process and sell marijuana. Do you think this is a good idea?--N.B., Maryland I know that many investors see the potential to harvest high returns, so to speak, as more states join the other 23 (plus the District of Columbia) that have already legalized marijuana in some way. But unless you want to risk seeing a significant portion of your savings (and your prospects for a secure retirement ) go up in smoke, I recommend passing on this marijuana start-up.\nWhy? Well, for one thing, investing in any new business involves more risk than investing in an established company, and thus needs to be approached with extreme caution, especially when you're talking about your retirement nest egg .\nBut I'd say that pot-related ventures are likely to pose an even higher level of risk than your typical start-up.\nFirst of all there are still important legal issues to be sorted out. Despite what individual states may decide about the legality of cannabis, \"using marijuana continues to be an offense under Federal law,\" according to the Office of National Drug Control Policy . That office further notes that marijuana is a controlled substance and that the Department of Justice \"is committed to enforcing the Controlled Substances Act.\" If in the future the feds take a hostile stance toward marijuana use for medical and/or recreational purposes -- or even just become less accommodating -- the growth outlook for this business could deteriorate significantly.\nKeep in mind too that a budding industry like this one is attracting and will continue to attract scores of entrepreneurs, speculators, pitchmen , and all sorts of operators hoping to get in on the ground floor. That's fine in that it can mean a big score if you choose the right outfit. But that's easier said than done. People tend to remember successful start-ups and forget the more numerous flops. Think of the dozens of Net IPOs that attracted millions of dollars from investors in the late '90s only to bite the dust in the dot-com bust at the beginning of this century. (Does the Pets.com sock puppet ring a bell?).\nRelated: 2 ways to a more secure retirement\nEven in cases where a new industry later became an engine of economic growth, it doesn't necessarily follow that early-stage investors made money. In the formative years of the auto industry, for example, hundreds, if not thousands, of car manufacturers failed, many before even getting a car to market. So even if future industry growth pans out, there's still a risk you won't make money on your investment.\nPrivate equity companies and other institutional investors can cope with such risk by delving into the weeds in their research of the industry overall. They can then spread their money among a dozen or more companies that they've analyzed and concluded are best positioned to capitalize on opportunities. The hope is that they may hit a home run with at least one or two investments.\nBut most people who have only a hundred thousand bucks or so to invest can't take this approach. It's prohibitively expensive, too time-consuming and requires a level of expertise and analytical skill most individual investors don't possess.\nOf course, there are also dozens of publicly traded pot-related companies. (FYI, the company with the ticker symbol POT isn't one of them. That's Potash Corporation of Saskatchewan, a producer of potash and other fertilizers.) And if you want to follow cannabis stocks as a whole, you can do so by tracking the MJIC Marijuana Index .\nSo I suppose you could plant some of your savings into marijuana companies by buying some of those stocks. But I can't recommend doing that either. Most of these companies have tiny market capitalizations, which means they can be highly volatile and, to my mind at least, suitable only for investors willing to take well-above-average risks .\nRelated: How to save $1 million for retirement\nLet's face it. Most people aren't attracted to the marijuana biz because they've done a rigorous analysis of its growth prospects versus those of other industries and have figured out which cannabis companies are attractively priced relative to its prospects. They're considering it because it generates a lot of buzz (by which, in this case, I mean talk and public attention). But buzz isn't a reason to invest. If anything, I'd say that the greater the buzz surrounding a company or an industry, the less likely its chances of being a profitable investment.\nBottom line: given your age and the size of your nest egg, I suggest you give up this pipe dream of investing in the marijuana biz and instead keep your retirement savings in a decidedly sober mix of low-cost stock and bond mutual funds ( preferably index funds ) that jibes with your tolerance for risk (which you can determine by going to an asset allocation-risk tolerance tool ). That approach may not be as hip. But it's less likely to end up as a bust.\nMore from RealDealRetirement.com\nThe Best Way To Invest For Retirement Income\nAre You Diversifying Or Di-Worse-Ifying?\n2 Ways To Get Guaranteed Retirement Income\nCNNMoney (New York) October 14, 2015: 10:13 AM ET", "external_links": ["http://realdealretirement.com/hoping-you-wont-outlive-your-savings-tilt-the-odds-in-your-favor/", "http://realdealretirement.com/are-you-diversifying-or-di-worse-ifying/", "http://realdealretirement.com/", "http://realdealretirement.com/how-to-balance-safety-vs-return-in-retirement-investing/", "http://realdealretirement.com/5-retirement-investing-pitches-you-should-ignore/", "https://www.whitehouse.gov/ondcp/state-laws-related-to-marijuana", "http://i2.cdn.turner.com/money/dam/assets/151013172650-retirement-marijuana-780x439.jpg", "http://realdealretirement.com/two-ways-to-get-guaranteed-retirement-income/", "http://realdealretirement.com/the-best-way-to-invest-for-retirement-income/", "http://realdealretirement.com/can-a-tv-commercial-offer-valuable-investing-insights-actually-yes-it-can/", "http://realdealretirement.com/toolsresources/", "http://realdealretirement.com/how-to-handle-3-big-risks-that-can-burn-you/", "http://realdealretirement.com/how-to-protect-your-retirement-savings-in-a-tumultuous-market/", "http://www.governing.com/gov-data/state-marijuana-laws-map-medical-recreational.html", "http://realdealretirement.com/answer-these-3-questions-to-see-if-youre-overdoing-it-on-risk/", "http://realdealretirement.com/3-simple-but-effective-retirement-portfolios-for-2015-and-beyond/", "http://realdealretirement.com/will-an-85-chance-of-success-give-me-a-soft-landing-with-my-retirement-planning/"], "published": "2015-10-14T18:13:00.000+03:00", "crawled": "2015-10-14T21:24:38.419+03:00", "highlightTitle": ""}