{"organizations": [], "uuid": "2134569d6e822f5c5e006b21ff0c180a1a732047", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-asia/?format=rss", "section_title": "Asian Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/sharp-china-slowdown-hits-burberry-065437249.html", "country": "US", "title": "Burberry shares tumble as China slowdown hits sales growth", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Burberry shares tumble as China slowdown hits sales growth", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T17:10:00.000+03:00", "replies_count": 0, "uuid": "2134569d6e822f5c5e006b21ff0c180a1a732047"}, "author": "", "url": "https://uk.finance.yahoo.com/news/sharp-china-slowdown-hits-burberry-065437249.html", "ord_in_thread": 0, "title": "Burberry shares tumble as China slowdown hits sales growth", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 15, 2015, 15:19 BST - UK Markets close in 1 hr 11 mins Burberry shares tumble as China slowdown hits sales growth Reuters - UK Focus – 9 minutes ago \n* Q2 comparable store sales fall 4 pct \n* Says environment increasingly challenging \n* Shares (Berlin: DI6.BE - news ) fall up to 13 pct (Adds detail, analyst comment, updates shares) \nBy James Davey \nLONDON, Oct (HKSE: 3366-OL.HK - news ) 15 (Reuters) - A sharp sales slowdown in Hong Kong and China led Britain's Burberry to miss sales growth forecasts on Thursday and warn of an increasingly challenging environment for luxury goods sales, hammering its shares to a near three-year low. \nThe brand, famous for its trench coats and cashmere scarves, highlighted increased Chinese and global stock market volatility, currency swings and concerns over slowing economic growth as negative factors. \n\"We believe this affected the confidence of and thus demand from luxury consumers, and especially the Chinese customers in some of our key markets,\" Chief Financial Officer Carol Fairweather told reporters. \nBurberry shares, down more than 8 percent at 1,303 pence by 1345 GMT, had fallen as low as 1,236p, their lowest since December 2012 and wiping about 700 million pounds ($1 billion) off market value. \nComparable store sales fell 4 percent in the three months to the end of September, against expectations of 5 percent growth and a rise of 6 percent in the previous quarter. \nBurberry saw a mid single-digit percentage decline in comparable-store sales in Asia Pacific, which includes Hong Kong and mainland China, where sales were down more than 20 percent and around 5 percent respectively. \nHong Kong and Chinese shoppers account for between 30 and 40 percent of Burberry's global revenue. \nFairweather noted growth from Chinese customers was significantly higher in continental Europe, where Burberry's presence is less developed compared to rivals. That reflected the relative weakness of the euro against the Chinese renminbi when compared with sterling. \nJUST A BLIP? \nBurberry forecast a return to around 5 percent growth in comparable sales in its second half of its financial year which runs until next March. \nHowever, analysts said it was not yet clear whether Burberry had just had a bad quarter or whether it was the beginning of a downward trend. \n\"It (Other OTC: ITGL - news ) would not be the first time we have seen a one-quarter blip at Burberry,\" JP Morgan Cazenove analyst Melanie Flouquet said. \nIndustry leader LVMH this week blamed the Chinese slowdown and stock market collapse for lower sales growth at its fashion and leather unit. Gucci owner Kering (Swiss: KER.SW - news ) publishes third-quarter sales next Thursday. \nBurberry's figures were more disappointing than LVMH's, said Exane BNP Paribas analyst Luca Solca. \n\"There seems to be a sign of brand specific fatigue at Burberry,\" he said. \nSolca added that injecting fresh creativity and innovation into the brand might prove difficult to implement since Christopher Bailey is both chief executive and chief creative director. \n\"We have recently seen the case of Gucci, where CEO and creative director proximity reduced available options and delayed change, for a time,\" he said of a duo who were in a relationship and were eventually sacked last year. \nIn Sept. 2012, Burberry was to first to warn about a major slide in Chinese demand in response to the country's anti-corruption campaign. \nOn Thursday, it said it had addressed the tougher environment by reallocating marketing spend and controlling costs, such as travel expenses and performance related pay. \nThat would minimise the impact on profit for the 2015-16 year. \nIt said it expected to meet the average forecast of analysts who had recently updated forecasts, for adjusted pretax profit of 445 million pounds. It made 456 million in 2014-15. ($1 = 0.6462 pounds) (Additional reporting by Astrid Wendlandt in Paris; and by Sudip Kar-Gupta in London; Editing by David Holmes and Keith Weir)", "external_links": [], "published": "2015-10-15T17:10:00.000+03:00", "crawled": "2015-10-15T17:24:20.952+03:00", "highlightTitle": ""}