{"organizations": [], "uuid": "a419fb006741635010fa50c6bae310b0bcf08709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/08/usa-fiscal-jacklew-idUSL1N12800920151008", "country": "US", "title": "Lew rules out letting Congress extract 'unacceptable' policies to lift U.S. debt limit", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Lew rules out letting Congress extract 'unacceptable' policies to lift U.S. debt limit | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T13:00:00.000+03:00", "replies_count": 0, "uuid": "a419fb006741635010fa50c6bae310b0bcf08709"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/08/usa-fiscal-jacklew-idUSL1N12800920151008", "ord_in_thread": 0, "title": "Lew rules out letting Congress extract 'unacceptable' policies to lift U.S. debt limit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON Oct 8 U.S. Treasury Secretary Jack Lew urged Congress to act soon to raise the debt limit but said the Obama administration would not let lawmakers use the pending deadline to extract \"unacceptable\" policy commitments.\nLew noted in an interview on National Public Radio airing on Thursday that he notified congressional leaders last week that the federal government would hit its legal debt limit around Nov. 5 and had indicated in the letter \"it could even be a little sooner than that.\"\n\"So they only have a few weeks,\" Lew said of the Republican-controlled Congress. \"They need to act. The sooner they act, the better.\"\nThe federal government is currently scraping just under its $18 trillion legal debt cap, with political wrangling over fiscal policy putting Washington at risk of not being able to pay its bills.\nThe Treasury came close to missing payments in 2011 and 2013 when Congress delayed increasing the borrowing limit.\nU.S. House of Representatives Speaker John Boehner has left open the possibility of advancing an increase to the debt limit before he resigns from Congress on Oct. 30.\nBut some conservative Republicans have said they cannot support a debt limit increase unless certain issues are addressed, such as a plan to sharply reduce government spending.\nLew told NPR: \"We've made it clear that we are not going to let the debt ceiling be used as a way to extract commitments that otherwise would be unacceptable.\"\nBut he added that the Obama administration has suggested it is open to lawmakers combining the debt limit increase with \"something else that's mutually acceptable\" if that makes passage easier.\nCompleting work on raising the debt limit by the end of October \"is none too early,\" Lew said.\n\"If you just think back to 2013 and 2011, getting to the day before we can't pay our bills, the day before the government of the United States might default for the first time in its history, we shouldn't get even close to it.\"\n(Reporting by Peter Cooney ; Editing by Eric Beech )", "external_links": [], "published": "2015-10-08T13:00:00.000+03:00", "crawled": "2015-10-08T12:22:46.332+03:00", "highlightTitle": ""}