{"organizations": [], "uuid": "bcbf49e6f95022ab29cdd68c51fab8547c78940e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/30UFupKktAf4.hj2pSc28Q--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-04T220714Z_2_LYNXNPEB930G1_RTROPTP_3_USA-AIG_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/global-regulators-finalize-capital-rule-220714351.html?l=1", "country": "GB", "title": "Global regulators finalize new capital rule for big insurers", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Global regulators finalize new capital rule for big insurers - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "bcbf49e6f95022ab29cdd68c51fab8547c78940e"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/global-regulators-finalize-capital-rule-220714351.html?l=1", "ord_in_thread": 0, "title": "Global regulators finalize new capital rule for big insurers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nThe AIG logo is seen at its building in New York's financial district March 19, 2015. REUTERS/Brendan McDermid By Huw Jones\nLONDON (Reuters) - The world's nine biggest insurance companies will have to hold more capital under new rules just finalised by global regulators that aim to prevent taxpayer bailouts of the industry in a crisis.\nRegulators decided to look at the multi-trillion dollar insurance industry following the massive public rescue of insurer AIG in the United States during the 2007-2009 financial crisis.\nAt the request of the Group of 20 economies (G20), the International Association of Insurance Supervisors (IAIS) has completed a two-part capital requirement for the nine companies, whose collapse could wreak havoc in global markets.\nThey include AIG and MetLife from the United States, Britain's Aviva, Ping An Insurance of China, Italy's Generali, and Axa of France.\nThe insurers will not have to make public their extra capital buffer until 2019 but, as with new banking capital rules, investors are likely to want to know if a company is strong enough to comply early without having to raise fresh capital.\nThe IAIS said the first capital cushion, known as the basic capital requirement, will effectively be what each of the nine insurers are already required to hold under national law.\nA consultation had initially proposed that the basic capital requirement, to be phased in over three years from 2016, should be at least 75 percent of the national requirement.\nThe second capital buffer, known as higher loss absorbency, will be on average 10 percent of the basic requirement, depending on the riskiness of a company's operations, the IAIS said in a statement.\nThis has been scaled back from an original proposal for a higher loss absorbency buffer that was on average 12-13 percent of the basic one.\nAll nine must meet their combined capital requirements from 2019 under the finalised rules which G20 leaders are due to formally endorse next month at a summit in Turkey.\nThe G20's regulatory task force, the Financial Stability Board, is due next month to update its list of insurance companies deemed to be systemically important, but it is not expected to include any big re-insurers, an omission that has raised eyebrows of some regulators.\nSome U.S. insurance supervisors have questioned the need for global capital rules at all.\nMet Life has taken the U.S. government to court to challenge a U.S. regulatory panel's decision to deem the firm \"systemically\" risky and therefore subject to tighter scrutiny.\n\n\n(Reporting by Huw Jones. Editing by Jane Merriman)\ncapital requirement", "external_links": [], "published": "2015-10-05T03:00:00.000+03:00", "crawled": "2015-10-05T05:13:56.958+03:00", "highlightTitle": ""}