{"organizations": [], "uuid": "a0934d9e225946ca131ad606e87fe0dfccfb839a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/k/h/c/w/y/image.related.articleLeadwide.620x349.gkgjr2.png/1445590791465.jpg", "site_section": "http://www.smh.com.au/business/banking-and-finance", "section_title": "Banking &amp; Finance News", "url": "http://www.smh.com.au/business/banking-and-finance/buttressing-the-pillars-of-our-economy-20151022-gkgjr2.html", "country": "AU", "title": "Buttressing the financial pillars of our economy", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Buttressing the financial pillars of our economy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "a0934d9e225946ca131ad606e87fe0dfccfb839a"}, "author": "", "url": "http://www.smh.com.au/business/banking-and-finance/buttressing-the-pillars-of-our-economy-20151022-gkgjr2.html", "ord_in_thread": 0, "title": "Buttressing the financial pillars of our economy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Illustration: Glen Le Lievre\nSince the election of the Coalition government we've heard a lot more talk about the need for microeconomic reform than we've had actual reform.\nIndeed, the main \"reform\" we've had so far has been abolition of the previous government's chief reforms: the carbon tax and the mining tax.\nBut all that changed this week, with the announcement of the Turnbull government's response to the recommendations of the Murray inquiry into the financial system.\nDavid Murray's review of the financial system has ruffled a few feathers. Photo: Louise Kennerley\nNext will come the government's response to the Harper inquiry into competition policy, then its proposals for tax reform – and possibly for changes to industrial relations – both to be taken to next year's federal election for approval by voters.\nAdvertisement There's no doubting the importance of the financial system and the need to ensure it's performing well.\nAccording to the Australian Centre for Financial Studies, our financial services industry is a cornerstone of the economy – the largest industry, the largest payer of company tax, a major employer of highly skilled workers and a large source of service exports.\nThe finance industry carries out all the payments made by households, businesses and governments. Its banks act as \"intermediaries\", taking the money of savers and lending it to investors, in the process affecting \"maturity transformation\" by borrowing for short periods (say, \"at call\") but lending for long periods (say, 30 years).\nThe industry – particularly its insurance companies – helps the community manage risk (say, that your house burns down, or that the person to whom your savings have been lent goes broke). It also manages our financial assets, such as our superannuation savings.\nOf course, to say the finance industry is vital to the functioning of the economy is not to say it may not be a lot bigger than it needs to be, nor that all the trading in financial assets it engages in is necessary and productive, nor that its top people should be paid the eye-popping salaries they are.\nBut that's a story for another day. Today's story is that though the financial sector is a key part of the economy, the reforms announced this week aren't terribly major. There are a few reasons for this.\nFor one thing, you can only deregulate the industry once. We did that in the 1980s, and the few rounds of reform since then have been progressively less sweeping and more in the nature of fine-tuning.\nFor another thing, the global financial crisis in 2008 was a harsh reminder that deregulation can go too far, that banks and other financial institutions can do stupid, short-sighted things in their search for profit, that some degree of regulation is essential and that regulators who only pretend to be regulating can end up allowing great damage to be done to the real economy.\nOf course, we in Australia did keep our banks under tight supervision and did prohibit our big four from merging any further, which stood us in good stead when the Americans and Europeans were getting themselves into so much trouble.\nSo regular fine-tuning of our regulatory arrangements is about all we need. Even so, this week's decisions do err on the timid side. They were worked up before the ascension of Malcolm Turnbull, and the previous administration seemed keenly aware of the power of the big banks and their many lobbyists.\nThe government accepted almost all the inquiry's 44 recommendations and added half a dozen of its own. The main proposal it rejected was that it ban self-managed super funds from borrowing to buy property. A courageous decision, minister. Hope we don't live to regret it.\nThe government says its response to the inquiry covers five \"strategic priorities\". The first is to strengthen the financial system's resilience by reducing the impact of potential financial crises. We need to be better able to weather them and to lessen their cost to taxpayers and the economy.\nAustralia is a capital-importing country, which makes us more reliant on foreign capital markets than some other economies are. To account for this, the main measure is the Australian Prudential Regulation Authority's requirement that the banks – particularly the big four – hold more shareholders' capital (the cost of which they're now busy passing on to their mortgage customers).\nThe second priority is to improve the efficiency of the superannuation system. The government will ask the Productivity Commission to develop measures of the rival super funds' efficiency and propose ways of making funds compete for the right to be \"default\" funds (when employees express no preference for a particular fund).\nThe government has already moved to require the boards of funds to have at least a third of their members as independent directors (that is, more retired businesspeople and fewer union secretaries).\nIt would be nice to believe these \"reforms\" were aimed at getting fund members a better deal rather than getting super funds out of the orbit of the Liberals' long-hated class enemies and into the hands of the banks and other mates.\nThe third priority is to stimulate innovation to \"facilitate competition and reduce costs for consumers\". Which is fine, provided it doesn't involve wasteful product differentiation and advertising campaigns, or new products aimed at avoiding taxation or getting around the regulation.\nFourth, to support consumers of financial products being treated fairly. The standards of financial advice will be lifted by improving the training and ethical standards required of advisers. The Australian Securities and Investments Commission will be given power to ban or order modification of harmful financial products, but only after the government has \"consulted widely\" with lobby groups.\nThe government's final priority is to strengthen the capabilities and accountability of the prudential regulator and the securities regulator.\nThe absence of industry complaint about all this reform is a sign it's not ruffling many feathers (and that the lobby groups remain hopeful of being able to water down the changes before they're applied).\nRoss Gittins is the Herald's economics editor.", "external_links": [], "published": "2015-10-24T03:00:00.000+03:00", "crawled": "2015-10-24T10:22:09.445+03:00", "highlightTitle": ""}