{"organizations": [], "uuid": "e87ad6ed191832e6facc800b3ef66949c5228bf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-14/active-managers-catch-break-as-u-s-stock-correlations-collapse", "country": "US", "title": "Active Managers Catch Break as U.S. Stock Correlations Collapse", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Active Managers Catch Break as U.S. Stock Correlations Collapse - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T12:00:00.000+03:00", "replies_count": 0, "uuid": "e87ad6ed191832e6facc800b3ef66949c5228bf0"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-14/active-managers-catch-break-as-u-s-stock-correlations-collapse", "ord_in_thread": 0, "title": "Active Managers Catch Break as U.S. Stock Correlations Collapse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stock correlations haven’t just unwound following the equity market meltdowns of August and September -- they’ve come asunder, falling to the lowest level since 2007. That’s good news for active mutual fund managers, who thought they saw their year fall apart in the third quarter.\nThe collapse can be seen in the Chicago Board Options Exchange’s S&P 500 Implied Correlation Index, which uses options to measure expectations about whether the U.S. equities will move in unison and on Monday slipped to the lowest level ever. The gauge is down 30 percent after reaching a 10-month high amid the Standard & Poor’s 500 Index’s August correction.\nA loosening in correlations is a reason for optimism among fund managers who try to beat benchmark averages because, in theory, it increases their opportunities to find big, relative winners. Lockstep moves in equities were the norm in the last two months of the third quarter, when the S&P 500 dropped 11 percent in a single week and volatility touched levels not seen since the financial crisis.\nNow, with third-quarter earnings season under way, investors are shifting their focus to individual company attributes such as earnings and takeover potential, according to Walter Todd of Greenwood Capital Associates LLC.\n“We’re increasingly dealing with stock-specific catalysts, rather than macro market drivers,” said Todd, who oversees about $1.1 billion as chief investment officer for Greenwood Capital Associates in South Carolina. “You would expect this moving into earnings as moves become more stock-specific, especially with no meaningful Fed meeting for a while. This is the perfect storm for a low correlation reading.”\nAbout 39 percent of money managers beat the Russell 1000 Index last quarter, compared to 59 percent in the second quarter, according to data from Bank of America Corp. That dropoff was the biggest since the first quarter of 2013. Data from Birinyi Associates Inc. show that the percentage of funds outperforming the S&P 500 has been steadily declining this year.\nInvestors anxious for new individual stock catalysts will soon have them. Just 30 members in the S&P 500 have reported third-quarter earnings so far. Analysts project profits for companies in the index dropped 7.2 percent in the period, with energy and materials providers showing the steepest retreats.\nEarnings season “can have a volatility and correlation-dampening effect as different companies report and move in different directions,” Pravit Chintawongvanich, a New York-based derivatives strategist at Macro Risk Advisors, wrote in an Oct. 6 note to clients.\nThat hasn’t always been the case this year, however, as the CBOE’s correlation index sat close to a more than 14-week high when second-quarter earnings commenced in July. The same was true in April, when the measure was above its 2015 average as companies started reporting first-quarter results.\nTo Jim Paulsen of Wells Capital Management, the decoupling of U.S. stocks is encouraging because it signifies how quickly investors have put the recent S&P 500 correction behind them. Since the 2008 financial crisis, money managers have been more inclined to trade stocks based on their respective risk profiles, rather than underlying fundamentals, according to Paulsen.\nThe easing of investor fears can be seen in the CBOE Volatility Index, which has been below 20 for seven straight days after trading above the level for 30 sessions, the longest such streak since January 2012. The measure has fallen 57 percent since reaching an almost four-year high on Aug. 24.\n“Very quickly after the August collapse, people have started to look discriminately at individual stocks again,” Paulsen, who helps oversee $345 billion as chief investment strategist at Wells Capital Management, said by phone from San Francisco. “It says something about how calm and collected people have been through this correction.”", "external_links": [], "published": "2015-10-14T12:00:00.000+03:00", "crawled": "2015-10-14T10:05:36.370+03:00", "highlightTitle": ""}