{"organizations": [], "uuid": "31e1a29c6be32d9617f8ba81bea0c783d5aa29d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-resources/?format=rss", "section_title": "Basic Resources News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/market-overview-slight-losses-ahead-083100742.html", "country": "US", "title": "Market overview: Stocks edged lower ahead of key risk events", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Market overview: Stocks edged lower ahead of key risk events", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:22:00.000+02:00", "replies_count": 0, "uuid": "31e1a29c6be32d9617f8ba81bea0c783d5aa29d8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/market-overview-slight-losses-ahead-083100742.html", "ord_in_thread": 0, "title": "Market overview: Stocks edged lower ahead of key risk events", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DE000A163206.EX 0.00 \nLONDON (ShareCast) - (ShareCast News) - 1630:Close Stocks finished modestly lower on Monday, led by weakness in the commodity space. Anglo American (LSE: AAL.L - news ) tumbled to the bottom of the pile after Citi trimmed its target price on the stock. Out on the second tier index, TalkTalk continued to reel. Back on the top flight index, Aberdeen Asset Management (Other OTC: ABDNF - news ) paced gains, on reports - denied by the company itself - that it had put itself on the block. Acting as a backdrop, over the weekend Governor Carney sounded a dovish note. Investors are waiting on the result of the Fed's policy meeting on Wednesday and of the Chinese Communist party's 5th plenum, on Friday. FTSE 100 down 27.06 points to 6,417. 1610: David Battersby, investment manager a Redmayne-Bentley, is potentially looking to buy Talk Talk shares and believes the market overreacted, Reuters reports. \n1520: The recent rally in risk is has been breath-taking but is set to continue, according to one of the world's leading brokers. The rebound in financial assets has been notable for its \"speed, magnitude, and breadth\", UBS (NYSEArca: FBGX - news ) strategist Daniel Waldman said in a research note sent to clients. Nonetheless, so long as markets can rely on policymakers to remain accommodative, to respond to \"significant weakness\" with easier policy and the slowdown in global growth does not become too acute, then the rally will continue, Waldman said. \n1330: Three-month copper futures on the LME are off by 1.3% to $5,220.57 per metric tonne. \n1330: New US home sales dropped 11.5% month-on-month to reach an annualised rate of 468,000, down from the 529,000 seen in the month before (consensus: 549,000). \n1200: The CBI's industrial trends index slipped to a reading of -7% after a print of -8% in the month before (consensus: -8%). \n1030: Mortgage approvals for home purchase in the UK fell to 44,489 in September from 46,567 in the month before (consensus: 47,400). \n0930: \"Surprisingly, the VW scandal did not play any role at all. Sentiment in the auto industry even improved! The overall manufacturing sector also held up well. As repeatedly said, we think that impulses from the US and the eurozone will overcompensate for the weakness coming from emerging markets,\" Unicredit (EUREX: DE000A163206.EX - news ) 's Andreas Rees said. \n0900: The IFO institute's gauge of German business confidence retreated by much less than expected in October, to a print of 108.2 from 108.5 in the month before (consensus: 107.8). Economists had pencilled in a print of 107.8. A gauge of how firms valued the current situation retreated to 112.6 from 114 in the prior month (consensus: 113.5). \n0830: Stocks have started the morning slightly lower following the strong close to Friday trading. Markets' focus this week will be on the four-day plenum of the Chinese Communist Party which began today. The assembled 205 top-ranking officials are set to decide on the country's 13th 5-year plan to be launched next year. Germany's IFO business confidence index is due to be released at 09:00 in an otherwise light day for economic data. FTSE 100 down 23.30 points to 6,420.92.", "external_links": [], "published": "2015-10-26T20:22:00.000+02:00", "crawled": "2015-10-26T21:30:26.560+02:00", "highlightTitle": ""}