{"organizations": ["Tata Steel"], "uuid": "aac58c437b1f8f30601cd6f7df383da5cd663186", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-asia/?format=rss", "section_title": "Asian Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/uk-steel-sector-imploding-tata-160951197.html", "country": "US", "title": "UK steel sector imploding, Tata Steel blames cheap Chinese imports", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "UK steel sector imploding, Tata Steel blames cheap Chinese imports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T19:20:00.000+03:00", "replies_count": 0, "uuid": "aac58c437b1f8f30601cd6f7df383da5cd663186"}, "author": "", "url": "https://uk.finance.yahoo.com/news/uk-steel-sector-imploding-tata-160951197.html", "ord_in_thread": 0, "title": "UK steel sector imploding, Tata Steel blames cheap Chinese imports", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Oct 20, 2015, 18:09 BST - UK Markets closed UK steel sector imploding, Tata Steel blames cheap Chinese imports Reuters - UK Focus – 48 minutes ago \n* Over 4,000 UK steel jobs lost or at risk this month alone \n* Losses come as China's Xi is feted on British state visit \n* Government promises action on UK steel, but courts China \n* UK industry says time running out to save steel sector \nBy Maytaal Angel \nLONDON, Oct (HKSE: 3366-OL.HK - news ) 20 (Reuters) - The crisis in Britain's steel sector escalated further on Tuesday as Tata Steel (BSE: TATASTEEL.BO - news ) blamed its decision to cut 1,200 British jobs from its UK operations squarely on a flood of cheap imports, particularly from China. \nThis month alone, over 4,000 UK steel jobs have been lost or are now at risk, with the country's steelmakers and unions pinning much of the blame on China. The timing couldn't be worse as President Xi Jinping commences his long awaited state visit to Britain. \nChina makes nearly half the world's 1.6 billion tonnes of steel. With its once stellar growth slowing, the country is expected to export a record 100 million tonnes of steel to world markets this year to help address its spare steelmaking capacity - estimated at a hefty 300 million tonnes. \nMore of a concern however, are claims that China is selling its steel below fair value thanks to government subsidies - an issue that British Prime Minister David Cameron promised to raise with President Xi on Monday. \nOn Tuesday, as the steel storm intensified, Business Secretary Sajid Javid said: \"We will demand action wherever there is evidence of unfair trade. We will ... look at what the government can to do to boost productivity and to cut production costs.\" \nA spokeswoman for Cameron said the government would look at driving up the number of public procurement contracts won by UK steelmakers in \"fair and open competition\", but the opposition Labour party was unconvinced: \n\"Isn't the posture of this government towards China today, that of a supplicant fawning spaniel that licks the hand that beats it?\" said Labour's Paul Flynn. \nBritain is working hard to court Chinese business, aiming to clinch over 20 billion pounds worth of deals during Xi's visit, which it hopes will herald a golden era in Sino-British ties. \n\"There are limits to what the government can do. No government can change the price of steel. No government can dictate foreign exchange rates and no government can simply disregard international regulations on free trade and state aid,\" Javid added. \nFor Britain's steelmakers and unions, however, there is much the government can do and isn't. \nThe government is looking at some of their claims on business rates, energy costs and even unfair trade practices, but they say that without immediate and concrete action, there will not be much of a British steel sector to speak of. \n\"The government should hang its head in shame. It (Other OTC: ITGL - news ) is not enough for David Cameron to \"raise\" the issue of steel dumping with the Chinese, he should be telling them what action he will be taking to stop steel dumping,\" said Roy Rickhuss, General Secretary of steel union Community. \nThe Labour party's business spokesman Kevin Brennan concurred: \"While the Chinese president is riding down the mall in a gilded state coach, British workers are being laid off because our government is not standing up for them.\" \nThe situation is being echoed globally, with two big U.S (Other OTC: UBGXF - news ) . steelmakers cutting jobs or idling plants this month and many more expected to follow suit despite committed government action to slap anti-dumping duties on steel imports. \nAccording to some industry estimates, less than 50 percent of global steelmakers can make money currently, with steel prices (ST-CRU-IDX) at decade lows thanks to oversupply and tepid global growth. \nBut producing steel profitably is especially difficult in Britain due to a strong currency and energy costs plus \"green\" taxes imposed on heavy industry are some of the highest in the world. \nBritish energy-intensive industries such as steel paid 80 percent more for electricity in the first half of 2015 than the EU average, which is itself about two times higher than the United States, for example. \nTata Steel's UK job cuts announcement Tuesday is its third such move this year alone. \nIt has cut thousands of jobs in Europe since it bought Anglo-Dutch producer Corus in 2007, but is still in business, unlike the UK's second largest steelmaker, SSI, which went into liquidation earlier this month with the loss of 2,000 jobs. \nThe British steel sector currently employs fewer than 20,000 people directly, down from about 200,000 in the 1970s. It is estimated that for every direct steel sector job lost, three or four jobs are lost in sectors that depend on steelmaking. \nOn Monday, British steelmaker Caparo Industries went into administration, putting up to 1,700 jobs at risk. \n(Additional reporting by William James, Kate Holton, Guy Faulconbridge, Veronica Brown, and Costas Pitas; Editing by David Evans)", "external_links": [], "published": "2015-10-20T19:20:00.000+03:00", "crawled": "2015-10-20T20:15:05.301+03:00", "highlightTitle": ""}