{"organizations": [], "uuid": "1968b99b080c59722b03ae96dd16b1966d730bb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.gov.ie", "main_image": "", "site_section": "http://finance.gov.ie/rss.xml", "section_title": "An Roinn Airgeadais, Department of Finance", "url": "http://finance.gov.ie/news-centre/press-releases/minister-noonan-welcomes-publication-oecd-beps-reports", "country": "IE", "title": "Minister Noonan welcomes the publication of the OECD BEPS reports", "performance_score": 0, "site": "finance.gov.ie", "participants_count": 1, "title_full": "Minister Noonan welcomes the publication of the OECD BEPS reports", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:59:00.000+03:00", "replies_count": 0, "uuid": "1968b99b080c59722b03ae96dd16b1966d730bb8"}, "author": "editorfinance", "url": "http://finance.gov.ie/news-centre/press-releases/minister-noonan-welcomes-publication-oecd-beps-reports", "ord_in_thread": 0, "title": "Minister Noonan welcomes the publication of the OECD BEPS reports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Minister Noonan welcomes the publication of the OECD BEPS reports 05.10.15 \nThe Minister for Finance, Mr. Michael Noonan TD, today (5/10/2015) welcomed the publication of the OECD reports on Base Erosion and Profit Shifting (BEPS). \nBase erosion and profit shifting refers to tax planning strategies that exploit gaps and mismatches in tax rules to make profits ‘disappear’ for tax purposes or to shift profits to locations where there is little or no real activity but the taxes are low, resulting in little or no overall corporate tax being paid. \nThe BEPS reports set out the steps that G20 and OECD countries have agreed to take to address this problem. Developing countries and regional tax organisations have also participated in the process. \nThe BEPS reports are comprehensive, dealing with areas such as: country-by-country reporting; patent boxes; tax treaty abuse; transfer pricing; and mandatory disclosure rules. \nThe OECD BEPS reports do not affect Ireland’s 12.5% corporation tax rate. The OECD has explicitly stated that taxation is at the core of countries’ sovereignty, and each country is free to set up its corporate tax system as it chooses, including charging the rate it chooses. \nThe Minister stated: \n“I welcome the publication of the OECD reports which set out a comprehensive multilateral approach to tackling aggressive and harmful tax planning. The OECD is to be commended for its thought leadership in the area of international taxation and its commitment to the global priority of achieving a fair international tax system. \n“Ireland is committed to the BEPS project and we will play a full part in its implementation. As a first step we will legislate for Country-by-Country reporting and introduce a Knowledge Development Box, which will be the first and only such box in the world that complies with the OECD’s new standards.” \nENDS", "external_links": [], "published": "2015-10-05T16:59:00.000+03:00", "crawled": "2015-10-05T18:39:47.987+03:00", "highlightTitle": ""}