{"organizations": [], "uuid": "71be4d46ffce41bb7de47d65458c09a67ad7aa9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/18/unitedairlines-ceo-idUSL1N12I0F920151018", "country": "US", "title": "UPDATE 1-United remains silent on medical condition of airline CEO", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-United remains silent on medical condition of airline CEO | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T21:43:00.000+03:00", "replies_count": 0, "uuid": "71be4d46ffce41bb7de47d65458c09a67ad7aa9d"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/18/unitedairlines-ceo-idUSL1N12I0F920151018", "ord_in_thread": 0, "title": "UPDATE 1-United remains silent on medical condition of airline CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Quote: s from corporate governance experts)\nOct 18 (Reuters) - United Continental Holdings Inc declined to provide details about the medical condition of its new chief executive officer on Sunday, days after the airline said Oscar Munoz was admitted to the hospital and a person familiar with his health said he suffered a heart attack.\nThe 56-year-old's health problems come barely a month after Munoz took on the job of improving the profitability and reputation of United, the No. 2 U.S. carrier by capacity.\nA spokeswoman for the Chicago-based company told Reuters by email on Sunday morning that it did not have an update to share yet. It is not known where Munoz is being treated.\nUnited acknowledged in a short statement on Friday that Munoz's family informed the company he had been hospitalized the day before, and said it would provide \"further details as appropriate.\" A person familiar with the matter confirmed that he had suffered a heart attack.\nUnited has an obligation to disclose material developments, wrote John Coffee, a professor specializing in corporate governance issues at Columbia University's law school, in an email. \"It is the obligation of the company to keep the market informed of material developments and this seems clearly material to me,\" Coffee wrote.\nIt is puzzling why the company has not stated who will take over for Munoz in the meantime, said Greg Taxin, chief investment officer of New York-based Luma Asset Management, and founder of corporate governance research firm Glass, Lewis & Co.\n\"It's probably silly or foolish that they just haven't satisfied people's desire to know how the chain of command is working,\" Taxin said. \"On the other hand, I presume the CEO of United Airlines goes on vacation on a regular basis, and he's not around to answer question or make decision and things run just fine.\"\nUnited's previous chief executive left while federal authorities were conducting an investigation involving the Port Authority of New York and New Jersey.\nMunoz had made it a priority to tackle complaints by customers and employees of United Continental in recent years, often related to the company's struggles to merge the operations of the former United and Continental airlines. (Reporting by Letitia Stein in Tampa, Florida; and Jessical Toonkel in New York; Editing by Frank McGurty and Lisa Shumaker )", "external_links": [], "published": "2015-10-18T21:43:00.000+03:00", "crawled": "2015-10-18T21:33:10.033+03:00", "highlightTitle": ""}