{"organizations": [], "uuid": "59e4bbc55adaf98c4b046a51db69899ddb3d2fb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/0/f/i/6/k/image.related.afrArticleLead.620x365.gk6ky7.png/1444608493546.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/retail/exmyer-ceo-bernie-brookes-salary-climbs-to-425m-in-2015-20151011-gk6ky7", "country": "AU", "title": "Ex-Myer CEO Bernie Brookes salary climbs to $4.25m in 2015", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Ex-Myer CEO Bernie Brookes salary climbs to $4.25m in 2015 | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T07:52:00.000+03:00", "replies_count": 0, "uuid": "59e4bbc55adaf98c4b046a51db69899ddb3d2fb6"}, "author": "Sue Mitchell", "url": "http://www.afr.com/business/retail/exmyer-ceo-bernie-brookes-salary-climbs-to-425m-in-2015-20151011-gk6ky7", "ord_in_thread": 0, "title": "Ex-Myer CEO Bernie Brookes salary climbs to $4.25m in 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Former Myer chief executive Bernie Brookes earned $4.3 million in 2015. Josh Robenstone by Sue Mitchell Former Myer chief executive Bernie Brookes earned $4.3 million in his final year at the helm of the department store chain despite a 21 per cent fall in underlying profits in 2015.\nMyer's latest annual report showed that Mr Brookes' total remuneration jumped 65 per cent, from $2.57 million to $4.25 million in 2015, including a $1.55 million termination benefit and a 27 per cent increase in his base salary to $2.33 million.\nMr Brookes was originally due to depart Myer in August 2014, after eight years at the helm, but extended his contract and negotiated a pay rise in February 2014 in the midst of an ultimately unsuccessful merger proposal with David Jones.\nMr Brookes stepped down in March 2015 after a worse than expected first-half result and has since been appointed chief executive of South African retailer apparel retailer Edcon.\nHe handed the baton to Richard Umbers, who has embarked on a five year turnaround plan aimed at increasing annual sales by more than three per cent a year , boosting sales per square metre by more than 20 per cent, growing earnings ahead of sales growth and boosting return on funds employed to more than 15 per cent by 2020.\nIn their report to shareholders, Mr Umbers and Myer chairman Paul McClintock said 2016 would be a transition year as the company invested between $100 million and $120 million to underpin future growth.\nAs a result of this investment and a recent $221 million capital raising, Myer expected underlying net profit to fall a further 15 per cent, to between $64 million and $72 million, and would book another $35 million to $45 million in one-off restructuring costs.\nMyer expects to return to sustainable profit growth in 2017.\n Myer is seeking shareholder approval at the annual meeting on November 20 to issue Mr Umbers performance rights worth $1.08 million, exercisable if Myer achieved growth targets for return on funds employed and sales per square metre over the next three years.\nMr Umbers, who joined Myer in 2014 as chief information and supply chain officer, earned $1.5 million in 2015, including a base salary of $792,129, a sign-on bonus of $590,000 cash and $400,000 in performance rights.\nAccording to the annual report, the Myer board is currently reviewing its remuneration framework to ensure it meets the needs of the business during the transformation program.", "external_links": [], "published": "2015-10-12T07:52:00.000+03:00", "crawled": "2015-10-12T07:06:45.707+03:00", "highlightTitle": ""}