{"organizations": [], "uuid": "e8aacaba45e28ad18657564ac8e8fd6823fafc71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/robert-peston-parents-sell-homes-204702468.html", "country": "GB", "title": "Robert Peston: 'Parents - sell your homes to help children buy property'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Robert Peston: 'Parents - sell your homes to help children buy property'", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T23:47:00.000+03:00", "replies_count": 0, "uuid": "e8aacaba45e28ad18657564ac8e8fd6823fafc71"}, "author": "", "url": "https://uk.finance.yahoo.com/news/robert-peston-parents-sell-homes-204702468.html", "ord_in_thread": 0, "title": "Robert Peston: 'Parents - sell your homes to help children buy property'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robert Peston"], "text": "246.50 -3.00 \nThe former BBC economics editor says one of his 'great anxieties' is the difficulty his children face getting on the ladder \nHe is one of the highest paid British journalists, whose recent move to ITV is thought to have come with a salary in the region of £400,000 . \nBut Robert Peston has said that one of his \"great anxieties\" as a parent is the difficulty his sons face getting on to the housing ladder. \nThe former BBC economics editor, who last week quit to head up ITV (LSE: ITV.L - news ) 's politics team , has suggested that parents should sell their homes and use the money to help their children to buy their own property. \nPeston, 55, called on people his age to be \"less selfish\", adding that they must \"start giving something back to the younger generation\". \nHe told Cheltenham Literature Festival: \"We haven't got enough affordable housing particularly in the south. I think this is one of the great social scandals of our age. \n\"I've got a couple of kids and if you're a parent this is one of the great anxieties. \n\"Our generation - it's a terrible thing to say but we've had it all and we also f***ed up the economy.\" \nPeston, who has two grown-up children, his son Maximillian and stepson Simon, went on: \"We've got to - on a personal level - move out of our big houses and somehow create the equity to pass on to the next generation. \n\"Of course if you get to my age you get set in your ways and you want to stay (living) where you are. \n\"But actually then you have the need for the next generation and you think - well, it's time to pass something on.\" \nPeston’s wife, the novelist Sian Busby, died in 2012 aged 51, five years after being diagnosed with lung cancer. \nThey had a son Maximillian together in 1997, the year before they married and Simon, Busby's son from her first marriage, was born in 1985. \nLast week Peston was confirmed as the new ITV political editor after being poached from the BBC . \nThe journalist and presenter will also host a new show at ITV called Peston on Sunday. \nPeston, whose departure marks the end of a decade-long stint at the BBC, said joining a rival channel has been the \"hardest career decision\" of his life. \nHe was reportedly offered presenting slots on The Andrew Marr Show and a £60,000 pay rise to stop him from jumping ship as the bidding war intensified. \nPeston, who is known for his floppy hair, his relaxed interviewing style and aversion to ties , held the role of economics editor at the BBC since October 2013, spending eight years before that as BBC business editor. \nEarlier this year, he revealed that the BBC had sent him on a series of training courses to \"iron out\" his eccentricities. \nHe said the corporation took action when viewers complained \"they hated the way I sounded\". \nHe said the training courses he was sent on \"failed completely\", adding that when the financial crisis took hold \"people stopped obsessing about the way I said things and started to take an interest in what I was saying.\" \nPeston won acclaim for his coverage of the financial crisis, while his exclusive 2007 reports on Northern Rock seeking emergency financial help from the Bank of England earned him the Royal Television Society's Scoop of the Year award.", "external_links": [], "published": "2015-10-11T23:47:00.000+03:00", "crawled": "2015-10-12T00:18:39.351+03:00", "highlightTitle": ""}