{"organizations": [], "uuid": "14a11fe6a8146c06fa5f4f7917efd9c51e1f894f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance-commerce.com", "main_image": "http://finance-commerce.com/files/2015/10/Oil-Trains-Hanson4x-200x200.jpg", "site_section": "http://finance-commerce.com//feed/", "section_title": "Finance & Commerce", "url": "http://finance-commerce.com/2015/10/dayton-orders-swifter-inspections-of-oil-rail-routes/", "country": "US", "title": "Dayton orders swifter inspections of oil rail routes", "performance_score": 0, "site": "finance-commerce.com", "participants_count": 1, "title_full": "Dayton orders swifter inspections of oil rail routes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T17:56:00.000+03:00", "replies_count": 0, "uuid": "14a11fe6a8146c06fa5f4f7917efd9c51e1f894f"}, "author": "The Associated Press", "url": "http://finance-commerce.com/2015/10/dayton-orders-swifter-inspections-of-oil-rail-routes/", "ord_in_thread": 0, "title": "Dayton orders swifter inspections of oil rail routes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apartment Sales Tracker Home / Nation & World / Dayton orders swifter inspections of oil rail routes A train passes through Coon Rapids in March. A growing number of trains that each carry at least 1 million gallons of oil from North Dakota have been entering the Twin Cities via the western suburbs on a route that sends them and their hazardous cargo through downtown Minneapolis. File photo: Bill Klotz Dayton orders swifter inspections of oil rail routes By: The Associated Press October 23, 2015 9:56 am 0 \nMinnesota Gov. Mark Dayton asked state railroad inspectors Thursday to speed up safety inspections of tracks where more oil cars are moving through, a response to marked changes in what routes trains take as they haul millions of gallons of crude across the state. \nDayton said those inspections will occur almost a month ahead of schedule on routes in and around the Twin Cities, checking to ensure the tracks can handle an unprecedented amount of crude oil traffic. The inspection swap comes as BNSF Railway has substantially increased the number of trains coming from North Dakota’s oilfields and going through downtown Minneapolis, including a pass under Target Field. \nBNSF said in a statement that it shifted routes because of a major track expansion project north of the Twin Cities. Dayton said he spoke with the railway’s top executive by phone and demanded that the company notify him directly when it makes such re-routing changes. \n“There’s a recognition that these are potentially dangerous materials,” the Democratic governor said. “There’s no reason for them not to be in communication with us about what they’re transporting through our state and through our cities.” \nRailroads are required by the federal government to notify states of “material” changes in crude oil shipment volumes — generally changes of about 25 percent or more. And BNSF met that standard: Comparing its most recent submission from Sept. 18 with previous filings reveals the major shift in how oil is shipped across Minnesota. \nThe bulk of the crude now comes from the west, from the Willmar area and across Minneapolis. Most trains hauling oil had previously taken a north-to-south route that bypassed Minneapolis. \nDayton said those changes were difficult to parse out and suggested the company should notify him directly about the re-routing so his administration can prioritize inspections and put local city officials on alert. He said the railroad informed him the normal routing would resume by the winter, but it was unclear whether routes would again be shifted during next year’s construction season. Share this:", "external_links": [], "published": "2015-10-23T17:56:00.000+03:00", "crawled": "2015-10-23T21:13:49.740+03:00", "highlightTitle": ""}