{"organizations": [], "uuid": "771994196f0ff2ac6413377bad8ed853e201c034", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/k/g/4/h/r/image.related.articleLeadwide.620x349.gkg470.png/1445809539302.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/mining-and-resources/amci-says-mining-bargains-remain-elusive-due-to-commodity-price-recovery-hopes-20151022-gkg470.html", "country": "AU", "title": "AMCI says mining bargains remain elusive due to commodity price recovery hopes", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "AMCI says mining bargains remain elusive due to commodity price recovery hopes", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "771994196f0ff2ac6413377bad8ed853e201c034"}, "author": "", "url": "http://www.smh.com.au/business/mining-and-resources/amci-says-mining-bargains-remain-elusive-due-to-commodity-price-recovery-hopes-20151022-gkg470.html", "ord_in_thread": 0, "title": "AMCI says mining bargains remain elusive due to commodity price recovery hopes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMCI's Nicole Hollows is confident commodity prices will rebound in the next few years. Photo: Louise Kennerley\n​AMCI, the private-equity giant run by German billionaire Hans Mende, said mining companies are being oversold while cautioning that bargain deals may remain elusive as potential sellers cling to hope that coal and metal prices recover in the next few years.\nNicole Hollows was appointed AMCI chief executive for Australia and south-east Asia in February 2014 but has kept a low profile since, scouring the market for possible acquisitions.\nMs Hollows, the former managing director of Gloucester Coal, admitted being surprised by the prolonged price plunge in commodities and said resources companies across the board had been oversold.\n\"I think the market is overreacting on all the commodities,\" she said. \"We had an extraordinary boom but this bust is going a long time and it's probably gone a lot longer than most people thought. But I think some of the equity price movements have been overdone.\"\nAdvertisement AMCI has an estimated $2 billion invested in natural resources assets globally, with its Australian holdings including a substantial stake in Whitehaven Coal along with a holding in the Aurizon-led West Pilbara iron ore project.\nAMCI was courting investors in the United States and Asia last year to raise up to $800 million for a new mining fund ,with a large chunk of the raising earmarked for Australian acquisitions,\nHowever, Ms Hollows said the fund had been postponed due to the continued slump in mining markets.\n\"We were looking at raising a fund but we decided to look at other opportunities and potentially co-invest options,\" she said. \"It's just difficult times with the market continuing to stay down.\"\nIt was tipped the AMCI fund would have a heavy focus on gold and copper, with Mr Mende possibly anchoring the fund by taking a stake of about 20 per cent.\nMs Hollows said AMCI was actively canvassing the market for deals but noted there were fewer forced sales than some had expected, as producers wait for an uptick in commodity prices.\n\"I think you're not seeing many purchases from anybody: the Japanese, Indians and Chinese are just not as active. I think part of that is because a lot of people who were active spent a lot of money and the market has come down,\" she said. \"So there are a lot of losses or potential impairment issues and people are trying to keep their head above water in survival mode until the market comes back again.\"\nIn terms of AMCI's direct investments, Ms Hollows remains confident about the development of the $7.4 billion Pilbara iron ore project, which faces a final investment decision in 2016.\nAurizon needs to give its partners, including AMCI, indicative port and rail tariffs by the end of November, and will hold meetings with its partners in December to decide whether to continue with the project's feasibility studies.\n\"We are not in a holding pattern. That project is going through an updated feasibility study,\" she said. \"Obviously, the iron ore price has made it tougher for everybody so it means we've got to get the costs down for that project so we can make it economic.\"\nPlunging demand from Chinese steelmakers for raw materials since 2011 has led to falling prices for the two key ingredients needed to make steel: iron ore and coking coal.\nIron ore is on course for its third consecutive year of losses, trading at just $US51 ($70.50) a tonne on Friday compared with a 2011 peak of $US185 a tonne.\nPrices for coking coal have dropped 75 per cent from a record $US330 a tonne in the past four years to just $US79 a tonne. Meanwhile thermal coal, Australia's third-biggest mineral export, is at an eight-year low of $US58 a tonne.", "external_links": ["http://www.afr.com/business/hollows-to-lead-amci-in-australia-asia-20140209-ixtzv", "http://www.afr.com/business/banking-and-finance/investment-banking/hans-mendes-amci-boosts-war-chest-by-up-to-800m-20141019-11bw9d", "http://www.afr.com/business/infrastructure/new-aurizon-chairman-tim-poole-refreshing-investors-say-20150924-gjtrmy"], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T07:42:09.353+02:00", "highlightTitle": ""}