{"organizations": [], "uuid": "823c8657d15249f016363cce62af4948931cc9b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-06/how-the-ghost-of-stimulus-past-in-china-haunts-li-keqiang", "country": "US", "title": "How the Ghost of Stimulus Past in China Haunts Li Keqiang", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "How the Ghost of Stimulus Past in China Haunts Li Keqiang - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-07T00:01:00.000+03:00", "replies_count": 0, "uuid": "823c8657d15249f016363cce62af4948931cc9b4"}, "author": "Enda Curran", "url": "http://www.bloomberg.com/news/articles/2015-10-06/how-the-ghost-of-stimulus-past-in-china-haunts-li-keqiang", "ord_in_thread": 0, "title": "How the Ghost of Stimulus Past in China Haunts Li Keqiang", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As China’s leadership steps on the economic-stimulus gas pedal, there’s one image in the rear-view mirror that looms large.\nThen-Premier Wen Jiabao’s cabinet unveiled a $586 billion program to boost growth in the depths of the 2008 global credit turmoil, a move that opened the floodgates for a record debt surge that current Premier Li Keqiang and President Xi Jinping have had to cope with.\nUnlike that binge, Li and Xi are opting for targeted measures, more of which were unveiled last week. They included a tax cut for vehicle purchases, a reduction in the minimum down payments for first-time home buyers and a pledge of support for electric-car sales.\nWhile, like last time, much of this year’s growth campaign is dedicated to new infrastructure including roads and rail, the financing and approval has greater input from the central government. Much of the funding stems from new construction bonds backed by central authorities, rather than bank borrowing by local government financing vehicles -- a difference that may help restrain the buildup of further bad debt.\n\"The more cautious approach towards stimulus reflects concerns among Chinese policymakers about the massive expansion in credit that occurred in China during 2009-2010, which has created significant new imbalances and problem loans in the Chinese financial system,\" said Rajiv Biswas, Asia-Pacific chief economist at IHS Global Insight in Singapore.\nFor the world, China’s acceptance of a more moderate expansion pace -- this year’s is set to be the slowest in 25 years -- is having spillovers as commodity prices tumble and exports to the world’s second-biggest economy stall. Federal Reserve Chair Janet Yellen mentioned concerns over China’s outlook when explaining reasons behind the decision not to raise interest rates at last month’s meeting.\nEstimates vary on the total value of this year’s stimulus, partly because of the difficulties in netting out new spending versus funds that had already been assigned, and adding up the cost of measures to stabilize the stock market and currency. State-owned policy banks such as China Development Bank are being used to target lending to specific infrastructure projects, while other banks are being encouraged to boost lending to small and medium-sized private firms.\n‘Major Mistake’ \" T his is much, much smaller,\" said Stephen Jen, co-founder of London-based hedge fund SLJ Macro Partners LLP and a former economist at the International Monetary Fund. \"The 2009 stimulus is widely seen as a major policy mistake. There is no way the Xi-Li Administration will repeat that mistake.\"\nStill, if growth slows too much, \"Beijing will ‘give a bit more gas’ to prevent a rise in the risk of a hard landing,\" Jen said.\nMore tax breaks and new spending are likely, said Le Xia, a Hong Kong-based economist at Banco Bilbao Vizcaya Argentaria SA. They’ll join monetary measures that include five benchmark interest-rate reductions since November and cuts to the amount of cash banks must lock away as deposits.\nChina has plenty of room to ramp up fiscal spending if needed, with a central government debt-to-GDP ratio below 30 percent. The question for China watchers is whether policy makers are prepared to unleash that firepower.\n\"Beijing does not want to go back to the old model of massive economic bailout by throwing good money after bad,\" said Chi Lo, greater China senior economist at BNP Paribas Investment Partners. \"It is trying to strike a balance between growth and reform, so it has not been opening the monetary and fiscal spigot like it did in the past.\"", "external_links": [], "published": "2015-10-07T00:01:00.000+03:00", "crawled": "2015-10-06T23:18:47.987+03:00", "highlightTitle": ""}