{"organizations": ["Nedbank", "Piraeus Bank", "SRI Research", "SEB", "Barclays and Co-Chair of the Banking Commission Board", "Westpac", "YES Bank", "UNEP", "Triodos Bank", "Standard Bank", "BMCE Bank", "UNEP FI Investment Commission", "UNEP FI", "United Nations Environment Programme Finance Initiative", "ING Bank", "UNEP Finance Initiative"], "uuid": "ca7eb2d900ba22f247f57575cabe8360da322184", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510150896.html", "country": "US", "title": "Africa: Major Banks Launch 'Positive Impact Manifesto' for Transition to Inclusive Green Economy", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: Major Banks Launch 'Positive Impact Manifesto' for Transition to Inclusive Green Economy", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T13:20:00.000+03:00", "replies_count": 0, "uuid": "ca7eb2d900ba22f247f57575cabe8360da322184"}, "author": "", "url": "http://allafrica.com/stories/201510150896.html", "ord_in_thread": 0, "title": "Africa: Major Banks Launch 'Positive Impact Manifesto' for Transition to Inclusive Green Economy", "locations": ["US", "Paris", "Africa", "CERES", "Mirova"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Christopher Bray", "Hérvé Guez", "Société Générale", "Achim Steiner", "Séverin Cabannes"], "text": "Africa: Health Challenges and Threats press release Paris — Banks-members of the UNEP Finance Initiative proposes a 'Roadmap' to establishing a new, impact-based and market driven paradigm. A group of 10 banks, comprised of BMCE Bank, ING Bank, Nedbank, Piraeus Bank, Société Générale, SEB, Standard Bank, Triodos Bank, Westpac and YES Bank issued today the 'Positive Impact Manifesto', which calls for an impact-based approach to banking, offering a bold and innovative vision of the banking sector's central role in achieving sustainable development. The transition to a green, inclusive economy requires considerable finance. Research by an American nongovernmental organization, CERES, estimates that a \"clean trillion\" dollars of additional investment is needed annually up to 2030 to enable new infrastructure to be made green. At the same time, Trucost puts the annual cost in natural capital degradation and negative environment externalities at US$7.3 trillion a year. Significant efforts are already underway to promote and enable the financial sector's participation in funding the transition to green economy. A report released last week by UNEP's Inquiry into the Design of a Sustainable Financial System highlights policymakers' and regulators' steps to integrate sustainable development considerations into financial systems to make them fit for the 21st century. Yet, despite these efforts, the availability of private finance for clean, inclusive investments remains limited. Indeed, a persisting core obstacle to shifting to a greener and inclusive development pathway is the elusiveness of the commercial viability and \"bankability\" of many of the products, activities and services that define the new economy. It is precisely this challenge that the group of banks - members of the UNEP Finance Initiative (a partnership between UNEP and over 200 financial institutions worldwide) - are pledging to take on in the Manifesto. Collectively holding in excess of 4 trillion USD in financial assets, the banks launched the Manifesto today at the UNEP FI's 2015 Annual General Meeting. UNEP Executive Director Achim Steiner said: \"Banks are uniquely positioned between the real economy and capital markets. Holding the largest pool of assets - estimated at US $139 trillion - they are critical to catalyzing the transition to an inclusive green economy. This Manifesto is a clear and welcome call for the active participation of the banking sector to play their part in addressing the $5-7 trillion annual financing needed to achieve the Global Goals.\" Séverin Cabannes, Deputy Chief Executive Officer of Société Générale said: « The \"Positive Impact \"Manifesto launched today is a real milestone which will help us make decisive progress towards sustainable development goals and shows the willingness of the banks to engage in order to address the challenges of evolving towards a more inclusive and greener economy.\" The Manifesto invites banks and other financial sector players to think more holistically about their role in the economy, society and the broader environment, and proposes a 'Roadmap' to establishing a new, impact-based and market driven paradigm: positive impact finance. It defines Positive Impact finance as \"that which verifiably produces a positive impact on the economy, society or the environment once any potential negative impacts have been duly identified and mitigated\". Over the next couple of years the UNEP FI's Positive Impact Working Group, currently made up of the 10 banks, will be working with peers, clients, and other stakeholders to deliver a set of Positive Impact Principles that will guide providers of financial services in their efforts to increase their positive impact on the economy, society and the broader environment. The Group also aims to establish a Positive Impact Incubator where new business models and financing approaches can be tested by financiers and corporates to improve the bankability of positive impact transactions. Ultimately, the Group expects a series of pilot projects to deliver a vibrant market place where needs, solutions and financing can be matched effectively. Hérvé Guez, Head of SRI Research at Mirova and Board Member of the UNEP FI Investment Commission, expressed strong support for the banks' initiative, which he described as \"placing ambitions at the level of the critical challenge we face today in trying to reconcile market forces and sustainability imperatives. As investors we welcome the banks' initiative to develop the market for sustainable investments, for which there is a growing appetite.\" The Head of Environmental Risk at Barclays and Co-Chair of the Banking Commission Board Mr. Christopher Bray said: \"Clearly an approach that enables us to be systematic in evaluating positive impacts as well assessing negative impacts holds a lot of promise in terms of new business opportunities, whilst continuing to help in countering a build-up of environmental and social risk across the financial sector.\" NOTES TO EDITORS For further information, please contact careen.abb@unep.org +41 22 917 8529 or Robert.bartram@unep.org +41 22 917 8934 About UNEP FI: The United Nations Environment Programme Finance Initiative (UNEP FI) is a unique partnership between UNEP and a global network of over 200 banks, insurers and investors from 51 countries. Created in the wake of the 1992 Earth Summit UNEP FI's mission is to mainstream the integration of sustainability across the finance sector. It provides a neutral space to convene stakeholders and acts as a platform at the intersection between finance, science and policy. Africa \nSub-Saharan Africa has two abundant resources: its youth and agricultural land. With the youngest population globally … see more » Copyright © 2015 United Nations Environment Program. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,700 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-15T13:20:00.000+03:00", "crawled": "2015-10-16T00:10:33.637+03:00", "highlightTitle": ""}