{"organizations": [], "uuid": "7b7a826dff0eb447474e826c120f1c9ec2cbfad7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/8/4/9/f/image.related.afrArticleLead.620x365.gk7y9o.png/1444720256593.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/world/chinas-iron-ore-imports-surge-but-trouble-ahead-20151013-gk7y9o", "country": "AU", "title": "China's iron ore imports surge, but trouble ahead", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China's iron ore imports surge, but trouble ahead | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T14:15:00.000+03:00", "replies_count": 0, "uuid": "7b7a826dff0eb447474e826c120f1c9ec2cbfad7"}, "author": "Angus Grigg", "url": "http://www.afr.com/news/world/chinas-iron-ore-imports-surge-but-trouble-ahead-20151013-gk7y9o", "ord_in_thread": 0, "title": "China's iron ore imports surge, but trouble ahead", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"It appears government spending has come back online.\" Dave Tacon by Angus Grigg A late year spike in infrastructure investment has stabilised China's imports of iron ore, even as the economy slows and the country's overall trade performance remains patchy.\nThe China Customs Bureau said on Tuesday iron ore imports surged 16.2 per cent to 86.1 million tonnes in September from a month earlier, notching up their best monthly performance in nearly two years. For the first nine months of the year import volumes were flat.\nThis is weak by historical standards, but far better than earlier forecasts that China's iron ore import volumes could fall as much as 10 per cent this year.\nSuch a scenario would deal a double blow to Australia's federal budget, which is already suffering from a halving of iron ore prices this year. Australia supplies nearly two thirds of China's imported iron ore.\nChina's imports of coal are not holding up as well as the iron ore with volumes falling 30 per cent over the first nine months of the year.\nJulian Evans-Prichard from Capital Economics attributed the spike in iron ore imports to the faster roll-out of government-backed projects.\n\"It appears government spending has come back online. After a weak start to the year for infrastructure projects there has been a big comeback,\" he said via phone from Singapore.\nIn September the National Development and Reform Commission said it approved 880 billion yuan ($190 billion) of projects spanning high speed rail, road and other transport projects.\n The stronger than expected iron ore volumes were helped by another record month of steel exports for China. In September China exported 11.25 million tonnes of steel products, a 16 per cent increase on the previous month and 32 per cent higher than last year.\nChina's surging steel exports remain a controversial topic, as the European Union and others accuse Beijing of subsidising loss-making production and dumping steel on world markets.\nXu Xiangchun, chief information officer at MySteel, cautioned China's overall demand for iron ore was declining. He said lower cost imports were continuing to displace high-priced domestic iron ore production.\n\"Next year I expect to see a decline in the volume of iron ore imports,\" he said via phone from Beijing. \"Iron ore demand has been stabilised partly due to government infrastructure projects.\"\nChina's overall steel production is set to fall by around 2 per cent this year.\nStrong steel sales abroad helped China post better than expected exports figures for September.\nThe Customs Bureau said exports were down 1.1 per cent over the month, compared to forecasts of a 7 per cent decline. Imports were weaker than expected however, declining 17.7 per cent in September from a year earlier.\nIt was the third month in a row where Chinese exports were negative and the 11th month in row for imports.\nThat meant China reported its largest ever trade surplus of 376.2 billion yuan ($82 billion) in September.\nFalling commodity prices are the main reason for the poor performance of China's imports and Mr Evans-Prichard believes the underlying data is not as weak as the headline numbers suggest.\n\"If you just look at the headline figures then imports are very weak, but much of that is price related. Actual imports volumes have been pretty strong over recent months,\" he said. \"That means imports are not a good gauge of domestic demand because prices have fallen so much.\"\nThe mixed trade data comes ahead of China's third quarter GDP being released on Monday. The median forecast of 13 economists surveyed by the Wall Street Journal is for growth of 6.8 per cent.\nThis would be the slowest pace of quarterly growth since the 6.1 per cent recorded in first quarter of 2009, when China was hit hard by the Global Financial Crisis. China recorded growth of 7 per cent in the second quarter after an annual rate of 7.4 per cent in 2014.\n\"China's economic situation generally worsened in the third quarter, as production and investment slowed,\" Mizuho economists said in a note to clients.", "external_links": ["http://english.customs.gov.cn/"], "published": "2015-10-13T14:15:00.000+03:00", "crawled": "2015-10-13T12:06:56.013+03:00", "highlightTitle": ""}