{"organizations": [], "uuid": "6fba3c49ea141c5ecb9bf28a9858f076e1d2ca81", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/c/m/c/7/image.related.afrArticleLead.620x365.gkc9ox.png/1445241038287.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/bill-shorten-faces-trouble-if-poll-deficit-endures-20151018-gkc9ox", "country": "AU", "title": "Bill Shorten faces trouble if poll deficit endures, say Labor heavyweights", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Bill Shorten faces trouble if poll deficit endures, say Labor heavyweights | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T14:14:00.000+03:00", "replies_count": 0, "uuid": "6fba3c49ea141c5ecb9bf28a9858f076e1d2ca81"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/bill-shorten-faces-trouble-if-poll-deficit-endures-20151018-gkc9ox", "ord_in_thread": 0, "title": "Bill Shorten faces trouble if poll deficit endures, say Labor heavyweights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Opposition Leader Bill Shorten's slump in the preferred prime ministership stakes follows a rough parliamentary week for Labor. Alex Ellinghausen Share on twitter by Phillip Coorey Opposition leader Bill Shorten could find himself in trouble should Labor's sudden poll deficit become entrenched over the long term, party heavyweights believe.\nFollowing Monday's Fairfax/Ipsos Poll which showed for the first time the Coalition forging a commanding lead under a popular Malcolm Turnbull, the view within the opposition was that the government's expected sugar hit had finally arrived but it was too early to predict whether it would last.\nHowever, should it endure well into next year in the lead-up to a federal election, sources said the party may consider a leadership change but it was too premature to speculate now.\nLabor's leadership rules make it more difficult to depose a leader, but only 51 per cent of the caucus is needed to dispense with the rules.\nGallery: David Rowe Liberals buoyed by the result also cautioned against getting carried away with one poll. One senior figure noted Mr Turnbull was about to embark on some difficult policy announcements involving tax reform and a possible GST increase, as well as changes to penalty rates.\nImportant test A coming byelection in the seat of North Sydney , to be vacated this week by former treasurer Joe Hockey, will also be an important test for the Prime Minister.\nThe monthly poll shows Mr Turnbull has steered the Coalition to the biggest lead over Labor since the September 2013 election, showing the party leading Labor on a two-party-preferred basis by 53 per cent to 47 per cent and leading by the primary vote by 45 per cent to 30 per cent.\n Mr Turnbull leads Mr Shorten by 67 per cent to 21 per cent as preferred prime minister according to the poll , when just two months ago, Mr Shorten led Mr Abbott by 45 per cent to 39 per cent.\nIt followed a rough parliamentary week for Labor when its attempts to highlight Mr Turnbull's wealth by combing through his Cayman Island investments fell flat.\nIn Parliament on Monday, Labor changed tack, pinning Mr Turnbull to the unpopular policies of Tony Abbott which included deregulating university fees, a charge in Medicare and increasing the price of prescription drugs with cuts to the Pharmaceutical Benefits Scheme. The polices have been variously amended or shelved but not dumped.\nMr Turnbull said he had already differentiated himself from Mr Abbott. He cited the \"very obvious example\" of his government being prepared to fund public transport whereas Mr Abbott would only fund roads.\n\"That is a very significant shift,\" he said.\nResources Minister Josh Frydenberg said the poll was a product of Labor's tactics last week.\n\"Labor has been playing the politics of envy over these past few weeks, and those arguments have exploded in their faces,\" Mr Frydenberg said.\nImmigration Minister Peter Dutton sought to make mischief with the poll by suggesting it would herald a leadership change to Anthony Albanese.\n\"I think it also demonstrates that Malcolm Turnbull was able to shrug off the shabby attempt by Bill Shorten to denigrate him over his wealth, I think people rejected that,\" he said.\n\"I think the interesting thing here is that Anthony Albanese didn't go out to launch these attacks against Malcolm Turnbull and I think Anthony Albanese is now positioning himself if there is to be a leadership change in the Labor Party.\"\nWith Primrose Riordan\n﻿", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-10-19T14:14:00.000+03:00", "crawled": "2015-10-19T12:10:42.684+03:00", "highlightTitle": ""}