{"organizations": [], "uuid": "22947ba4ab44a171df09f295b367908ac24ee1fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/nickclements/2015/10/23/how-a-good-credit-score-could-make-you-a-better-partner/", "country": "US", "title": "How A Good Credit Score Could Make You a Better Partner", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "How A Good Credit Score Could Make You a Better Partner", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T21:07:00.000+03:00", "replies_count": 0, "uuid": "22947ba4ab44a171df09f295b367908ac24ee1fe"}, "author": "Nick Clements", "url": "http://www.forbes.com/sites/nickclements/2015/10/23/how-a-good-credit-score-could-make-you-a-better-partner/", "ord_in_thread": 0, "title": "How A Good Credit Score Could Make You a Better Partner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Credit scores were originally built as tools for banks. Scoring algorithms use credit bureau data to predict a borrower's likelihood of repayment. However, people have been using credit scores in surprising ways for years. Auto insurance companies in most states use credit scores to determine pricing, and missed credit card payments could actually be worse than a DUI for your insurance rates. But earlier this year, the Federal Reserve Board released a surprising bit of research . Using data from [entity display=\"Equifax\" type=\"organization\" subtype=\"company\" active=\"true\" key=\"equifax\" ticker=\"EFX\" exchange=\"NYSE\" natural_id=\"fred/company/1484\"]Equifax[/entity], the economists found a strong correlation between successful relationships and good credit scores.In particular, the authors of the study had three conclusions:\nPeople with good credit scores are more likely to get married. And couples with good credit scores are more likely to stay married. t People already tend to find partners who have similar credit scores to themselves. t Couples with mismatches in their credit scores are more likely to separate. The Federal Reserve, not usually known for its marital advice, explained that \"credit scores, in addition to measuring an individual's creditworthiness, reveal information about an important relationship skill. We argue that one such skill could be an individual's general trustworthiness and commitment to non-debt obligations.\" The Key To A Good Credit Score And Relationship FICO is the leading credit score in the country, used in about 90% of credit decisions in America. I will review the most important credit score variables, and make a guess about their impact on relationships: Payment history is 35% of your score. You need to make your payments on time, every month. This is the most important part of your score. This attribute demonstrates consistent responsibility. Perhaps people who always pay their bills on time understand the importance of responsibility and will also be more likely to remember anniversaries, birthdays and other special occasions. t The total amount owed is 30% of your score. If you have a lot of credit card debt, and have maxed out all of your credit cards, your score will suffer. Often, credit card debt demonstrates an inability to delay gratification. Rather than waiting and saving, you want it now regardless of the cost. People who know how to delay gratification might be better partners. t The length of your credit history is 15% of your score. The longer your history, the better. This would indicate that people who wait until later in life to get married would have a higher likelihood of a successful marriage. Marriage And Money Although we might find the Federal Reserve's research on relationships a bit odd, the findings are not completely surprising. Money is one of the leading causes of divorce. When couples face financial difficulties, stress and the risk of separation increase. However, big data studies like this can be misleading. Correlation does not always mean causation.The stress of living paycheck to paycheck and being unable to pay the bills may lead to missed payments, a deteriorating credit score and ultimately divorce or separation. Equally, disputing an incorrect collection item and having it removed from your credit report, adding 100 points to your score, probably does not mean your marriage now has a much greater chance of succeeding. Find Your Credit Score For Free Whether you are applying for a mortgage, auto insurance or considering proposing, you will want to know your credit score. There are now multiple ways to get your score for free. To obtain your VantageScore, you can sign up for free at a website like CreditKarma . There are a few ways you can get your FICO. Many banks and credit unions provide your FICO for free. MagnifyMoney provides a list of where you can find your score for free.But now that the Federal Reserve has spoken, you might want to ask your partner for a peek at his or her credit score before you start to get too serious.", "external_links": ["http://time.com/money/3978575/credit-scores-auto-insurance-rates/", "http://www.magnifymoney.com/blog/building-credit/find-free-fico-score-2-3-credit-bureaus925991009/", "http://www.federalreserve.gov/econresdata/feds/2015/files/2015081pap.pdf"], "published": "2015-10-23T21:07:00.000+03:00", "crawled": "2015-10-23T18:16:25.743+03:00", "highlightTitle": ""}