{"organizations": [], "uuid": "0b9020856aef02922efc2e7a8e0758fb4ab60480", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/07/26/bashar-al-assad-july-26-2015/ALTERNATES/crop_100x100/Bashar+al-Assad+July+26+2015", "site_section": "http://www.bdlive.co.za/personalfinance", "section_title": "Personal Finance | BDlive ", "url": "http://www.bdlive.co.za/world/europe/2015/10/21/syrias-assad-makes-surprise-visit-to-moscow", "country": "ZA", "title": "Syria’s Assad makes surprise visit to Moscow | Europe", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Syria’s Assad makes surprise visit to Moscow | Europe | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T20:48:00.000+03:00", "replies_count": 0, "uuid": "0b9020856aef02922efc2e7a8e0758fb4ab60480"}, "author": "Agency Staff", "url": "http://www.bdlive.co.za/world/europe/2015/10/21/syrias-assad-makes-surprise-visit-to-moscow", "ord_in_thread": 0, "title": "Syria’s Assad makes surprise visit to Moscow | Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Syrian President Bashar al-Assad Picture: REUTERS/SANA Related articles Air strikes in Syria make Russia an Islamist target Syria army begins offensive near Aleppo with Russian support Russians target all Syrian rebels MOSCOW — Syria’s embattled president, Bashar al-Assad, made a surprise visit to Moscow on Tuesday for talks with Russian President Vladimir Putin, his first foreign trip since the conflict erupted in 2011.\nMr Putin pledged to continue to support Damascus militarily, while calling for a political solution involving all groups to try to end the war, the Kremlin said on Wednesday.\nFor his part, Mr Assad told Mr Putin that Russia’s air strikes launched in Syria last month had helped stop the spread of \"terrorism\" in his country, it said.\nKremlin spokesman Dmitry Peskov described the lightning trip on Tuesday as a \"working visit\", and by Wednesday morning, Mr Assad was back in Damascus, the Syrian presidency told AFP.\nIt appears the Kremlin waited for the Syrian leader to return home before breaking the news of the visit.\n\"We are ready to make our contribution not only during armed hostilities in the fight against terrorism but also during a political process,\" Mr Putin told Mr Assad.\nThe Syrian leader also stressed the importance of \"further political steps,\" according to a Kremlin statement.\nHe thanked Mr Putin for his decision to launch its air campaign in Syria on September 30, Russia’s first military foray outside the former Soviet Union since its occupation of Afghanistan in 1979.\n\"I need to say that the political steps which Russia has taken since the start of the crisis prevented the events in Syria from developing along a more tragic scenario,\" Mr Assad said in Quote: s released by the Kremlin.\n\"Terrorism which has now spread through the region would have consumed much larger areas and would have spread throughout much more territory if it were not for your actions and your decisions,\" he said in comments translated into Russian.\nAbout 250,000 people have been killed since the conflict first began in March 2011, and half the population has been made homeless.\nMr Putin said it was the Syrian people that should decide the fate of their country.\n\"At the end of the day a long-term settlement can be achieved on the basis of a political process with the participation of all political forces, ethnic and religious groups,\" the Kremlin strongman said.\n\"And ultimately, the final word no doubt should rest solely with the Syrian people.\"\nAFP", "external_links": [], "published": "2015-10-21T20:48:00.000+03:00", "crawled": "2015-10-21T23:43:30.161+03:00", "highlightTitle": ""}