{"organizations": [], "uuid": "24be290aa2ae90f91878ef67380b09504fd86579", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30185476/the-jones-agency-launches-charity-drive-to-support-the-texas-chapter-of-the-special-olympics", "country": "US", "title": "The Jones Agency Launches Charity Drive to Support the Texas Chapter of the Special Olympics", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "The Jones Agency Launches Charity Drive to Support the Texas Chapter of the Special Olympics - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T16:01:00.000+03:00", "replies_count": 0, "uuid": "24be290aa2ae90f91878ef67380b09504fd86579"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30185476/the-jones-agency-launches-charity-drive-to-support-the-texas-chapter-of-the-special-olympics", "ord_in_thread": 0, "title": "The Jones Agency Launches Charity Drive to Support the Texas Chapter of the Special Olympics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Jones Agency, a full service insurance firm with offices that serve areas in and around Arlington Texas, is announcing a charity drive aimed at gathering support and donations from the local community that will be used to fund the Texas chapter of the Special Olympics\nArlington, TX\nThe Jones Agency, a locally owned insurance firm serving Arlington Texas and the surrounding communities, is launching a charity effort to advocate and gather funds for the Texas chapter of the Special Olympics.\nA globally recognized non-profit volunteer organization, the Special Olympics provides an opportunity for specially-abled individuals to develop physical fitness, demonstrate courage and heart, and experience the joy of participating in team-based, non-judgmental sporting programs.\nTexas Special Olympics (SOTX) has changed the lives of countless children and adults, offering over 53,000 athletes with developmental disabilities to participate in more than 300 exhibitions per year at the area, regional, and state levels.\n“The Special Olympics is a venerated charity that does an enormous amount of good for specially-abled individuals and children in our community,” says Jimmy Jones, owner and principal of the Jones Agency. “It’s an honor and a privilege to work with Texas Special Olympics on this charity drive.”\nMobilizing a large network of professional and personal contacts, Jones and his team are advocating for the importance of the Special Olympics to the developmentally challenged population of Texas, and gathering donations that will be used to ensure SOTX sporting programs will continue to flourish. The team is also establishing an online social media presence that they hope will draw in even more support from communities across the nation.\nIn addition to assisting Texas Special Olympics as they continue their mission of providing exhilarating sporting exhibitions for developmentally challenged individuals and their families, the Jones Agency is working with several other local charities in the Arlington area, and plans to work with a new charity every two months for the foreseeable future.\nThose who are interested in assisting the Jones Agency as they continue their charity drive to support the Texas chapter of the Special Olympics are encouraged to visit the dedicated charity page and make a personal contribution to the cause here: http://www.jimmyjonesagency.com/Sponsoring-4-Texas-Special-Olympics-Athletes-_19_community_cause . Those who want to learn more about the other charities in Arlington being supported by the Jones Agency are invited to bookmark their Community Causes section, located here: http://www.jimmyjonesagency.com/community-cause .\nAbout The Jones Agency\nAs a Personal Finance Representative in Texas, agency owner, Jimmy Jones knows many local families. His knowledge and understanding of the people in his community helps provide customers with an outstanding level of service. Katherine and her team look forward to helping families protect the things that are important - family, home, car and more. They can also help clients prepare a strategy to achieve their financial goals. To contact an expert at The Jones Agency, call (817) 784.8400.\nFor the original version on PRWeb visit: http://www.prweb.com/releases/special-olympics-charity/arlington-tx/prweb13002298.htm\nInformation contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .", "external_links": ["http://www.jimmyjonesagency.com/Sponsoring-4-Texas-Special-Olympics-Athletes-_19_community_cause", "http://www.jimmyjonesagency.com/community-cause", "http://www.prweb.com/releases/special-olympics-charity/arlington-tx/prweb13002298.htm"], "published": "2015-10-05T16:01:00.000+03:00", "crawled": "2015-10-05T15:30:06.397+03:00", "highlightTitle": ""}