{"organizations": [], "uuid": "6c0e75eb266c9a3e26140bcd3f43e2e317d2bece", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/indigoipo0211015.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/indigo-ipo-promoters-flying-high-with-dividends-to-themselves/43765.html", "country": "IN", "title": "IndiGo IPO: Promoters flying high with dividends to themselves", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "IndiGo IPO: Promoters flying high with dividends to themselves", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T15:59:00.000+03:00", "replies_count": 0, "uuid": "6c0e75eb266c9a3e26140bcd3f43e2e317d2bece"}, "author": "Moneylife Digital Team", "url": "http://www.moneylife.in/article/indigo-ipo-promoters-flying-high-with-dividends-to-themselves/43765.html", "ord_in_thread": 0, "title": "IndiGo IPO: Promoters flying high with dividends to themselves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "InterGlobe Aviation, which runs IndiGo airlines, turned a negative net worth of Rs139 crore due to an exceptional interim dividend of Rs1,500 crore paid to the promoters in FY15 \nInterGlobe Aviation Ltd that operates IndiGo airlines is planning to raise over Rs3,200 crore through its initial public offering (IPO) next week. The draft red herring prospectus (DRHP) filed by the company, however, raises several questions. It shows that since April 2010, the company has paid cumulative dividend of Rs3,700 crore to promoters, when its total profit after tax (PAT) was Rs3,914 crore. However, the PAT figure of Rs3,914 crore includes a credit of Rs473 crore for minimum alternate tax (MAT), so the real net profit of the company is Rs3,441 crore. In other words, the promoters took about Rs260 crore more than what was due to them during this over five-year period. Further, a dividend tax outgo of Rs423 crore means not only the carrier company has dipped into its reserves (for paying to promoters) but also has a negative net worth with the commencement of its offering. InterGlobe Aviation, in its DRHP says, \"On 19 June 2015, our Company declared an interim dividend (excluding dividend distribution tax) of Rs99.738 million (Rs99.74 crore) for fiscal 2015 and an interim dividend of Rs10,029.10 million (Rs1002.91 crore) for fiscal 2016, each for 307,000 equity shares. On 12 January 2015 and 23 March 2015, our Company declared an interim dividend of Rs5,932.37 million (Rs593.24 crore) and Rs2,260.23 million (Rs226.02 crore) for fiscal 2015, each for 307,000 equity shares, respectively. The restated financial statements provided in this Draft Red Herring Prospectus do not reflect these interim dividends. Any reliance by persons on the financial disclosures presented in this Draft Red Herring Prospectus without considering these interim dividend payments should accordingly be limited.\" \nThe company had turned a negative net worth of Rs139 crore due to an exponential interim dividend of Rs1,500 crore paid to the promoters for 2014-15. In a media report, Aditya Ghosh, President of InterGlobe Aviation, was quoted as saying that the company's turning a negative net worth was a 'non-event' and it still had 'a cash balance of over Rs3,500 crore'. In addition, the promoter and promoter group entities would earn over Rs1,600-1,900 crore through their share sale (offer for sale-OFS). This is in addition to the Rs3,700 crore dividend they had already received. In September, the airline firmed-up its earlier order of 250 Airbus A320 neo aircraft. The deal is expected to be worth a little over $25 billion. At present it has a total order of 430 airplanes. Apart from the recent order, InterGlobe Aviation had placed an order for 100 A320s in 2005 and 180 A320neo in 2011. It added 17 new aircraft in its fleet during 2014-15. Currently it operates 97 aircraft offering 648 flights a day. The company, in the DRHP says, \"We receive non-refundable incentives from manufacturers. The application of these credits to our operating leases results in a net reduction in our aircraft rental payments which is amortized over the initial terms of the operating leases.\" Accordingly, the company over the past five years has received Rs1,654 crore as incentives from Airbus. Its balance sheet, however, shows similar amount of Rs1,646 crore as still receivable. \"The Company receives non-refundable incentives from manufacturers in connection with the acquisition of aircraft and engines. In case of owned aircraft or aircraft under finance lease, incentives are recorded as a reduction to the cost of related aircraft and engines. Where the aircraft is held under operating lease, the incentives are deferred and reduced from the operating lease rentals on a straight line basis over the period of the related lease. In case of return of an aircraft before the expiry of the lease term, the unamortised balance of deferred incentive is recorded in the Statement of Profit and Loss,\" InterGlobe Aviation stated in its Prospectus. Our emails sent to Mr Ghosh and the company Chief Financial Officer remained unanswered till writing the story. When we contacted their office, we were told that both these officials are not in the office. We received a call from the company's PR agency, which promised to send us replies by 3pm. However, there is still no reply. We will incorporate InterGlobe Aviation's reply as and when we receive it. The IPO will open between 27th and 29 October 2015 with a price band of Rs700-765 per share.", "external_links": [], "published": "2015-10-21T15:59:00.000+03:00", "crawled": "2015-10-21T16:32:13.094+03:00", "highlightTitle": ""}