{"organizations": [], "uuid": "51a9beb597d3f7b45454500724219e2ec4296818", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/5/n/u/c/image.related.afrArticleLead.620x365.gk4jab.png/1444525963269.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/sport/chinas-richest-person-wang-jianlin--to-back-magic-millions-20151008-gk4jab", "country": "AU", "title": "China's richest person Wang Jianlin to back Magic Millions", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "China's richest person Wang Jianlin to back Magic Millions | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-11T09:12:00.000+03:00", "replies_count": 0, "uuid": "51a9beb597d3f7b45454500724219e2ec4296818"}, "author": "Fiona Carruthers", "url": "http://www.afr.com/business/sport/chinas-richest-person-wang-jianlin--to-back-magic-millions-20151008-gk4jab", "ord_in_thread": 0, "title": "China's richest person Wang Jianlin to back Magic Millions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wang Jianlin, Chairman of Wanda Group, is backing the Magic Millions Getty Images Share on twitter by Fiona Carruthers China's richest person has become the latest big name to back the Magic Millions horse-racing carnival on the Gold Coast.\nPower retail couple Katie and Gerry Harvey, of Harvey Norman fame, have snared some enviable sponsors for their Magic Millions over the years, including BMW, Jeep, Paspaley Pearls, Moet & Chandon and RM Williams.\nThey have even managed to secure the Queen's granddaughter, Zara Phillips, as official patron of the Magic Millions Racing Women program.\nBut in keeping with the theme as the Magic Millions Raceday becomes Australia's richest day of racing, worth $10 million in prize money, the Harveys have got Wang Jianlin on board to sponsor their lavish VIP marquee at the Gold Coast Turf Club on Saturday, January 9, 2016.\nMr Wang is part of a joint venture building Jewel, a three-tower retail, residential and fine-dining development under construction between Broadbeach and Surfers Paradise. Due for completion in 2018, Jewel will also boast a six-star hotel.\n\"Gerry and I believe the timing of our partnership with Jewel is perfect and no coincidence,\" Mrs Page-Harvey said. \"We commence a new era for Magic Millions and Jewel unveils its stunning plans. The prestige that comes with the Jewel partnership will be perfectly reflected on race day.\"\nJewel will take over the VIP marquee naming rights from Moet & Chandon, which will continue to have a strong presence in 2016, including a Moet bar. Jeep retains naming rights for the race day, which marks Magic Millions' 30th anniversary.\nForbes lists Wang, the chairman of real estate conglomerate Dalian Wanda Group, as the 29th-richest man in the world – and China's richest person, worth more than $US29.7 billion ($40.4 billion).\n Dalian Wanda controls more than 200 department stores, shopping plazas and luxury hotels.", "external_links": ["https://twitter.com/SophTraveller"], "published": "2015-10-11T09:12:00.000+03:00", "crawled": "2015-10-11T22:06:27.311+03:00", "highlightTitle": ""}