{"organizations": [], "uuid": "efde627db31e66954ae4c51a9c11c58c3232bcd6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/5/l/v/s/image.related.afrArticleLead.620x365.gk7l08.png/1444695555782.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/markets/equity-markets/broker-watch-qbe-insurance-transurban-uil-energy-rural-funds-20151013-gk7l08", "country": "AU", "title": "Broker Watch: QBE Insurance, Transurban, UIL Energy, Rural Funds", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Broker Watch: QBE Insurance, Transurban, UIL Energy, Rural Funds | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T03:15:00.000+03:00", "replies_count": 0, "uuid": "efde627db31e66954ae4c51a9c11c58c3232bcd6"}, "author": "Elise Shaw", "url": "http://www.afr.com/markets/equity-markets/broker-watch-qbe-insurance-transurban-uil-energy-rural-funds-20151013-gk7l08", "ord_in_thread": 0, "title": "Broker Watch: QBE Insurance, Transurban, UIL Energy, Rural Funds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Assets in the Rural Funds Group portfolio are some of the most productive in the industry. Alamy Share on twitter Share on Google Plus by Elise Shaw Hartleys initiates coverage of UIL Energy with a \"speculative buy\" recommendation. \"UIL holds a significant acreage position (about 500,000 net acres) in the north and central Perth Basin. With an EV of only $5 million, UIL should benefit from recent exploration success (AWE) in the northern Perth Basin, but is also leveraged to the significant work program that recently began in the central part of the basin by the likes of Transerv Energy (TSV) and Empire Oil and Gas (EGO). The recent fall in the price of oil has dampened sentiment towards the oil and gas sector, however the positive supply / demand fundamentals of the WA domestic gas market could partially insulate Perth Basin operators.\"\nBell Potter initiates coverage on Rural Funds Group with a \"buy\" rating and $1.33 a share target price. \"Rural Funds Group (RFF) is a listed agricultural REIT with a portfolio covering 29 properties, primarily focused on poultry farms, almond orchards and vineyards. Assets in the portfolio are some of the most productive in the industry and leased to high quality tenants including Treasury Wine Estates, Olam, Select Harvests and RFM Poultry with a WALE of 15.7 years (ProForma post Kerarbury). RFF is externally managed by Rural Funds Management (RFM), who have been managing agricultural investments for 17 years and have $325 million funds under management. Upcoming rental reviews, development of new almond orchards (Tocabil and Kerarbury) and exposure to an appreciating asset class in water are short and medium term drivers of earnings and value within RFF.\"\nUBS has a \"buy\" on Transurban and a price target of $10.60 a share. \"Transurban continued its strong growth into the September quarter, delivering like-for-like toll revenue growth of 12.1 per cent off 5 per cent growth in traffic. Reflecting better than expected growth on the Sydney network we have upgraded our FY16 distribution forecast to 45¢ per security, implying 12.5 per cent growth. This is slightly above management's full year guidance of 44.5¢ per security which was reaffirmed at the AGM. Our FY17 and FY18 forecasts remain largely unchanged. We continue to expect 11 per cent per annum growth in cashflow per security to 2018e.\"\nQBE Insurance is a \"neutral\" recommendation at Credit Suisse with a price target of $13.90 a share. \"QBE's share price has lagged the broader market in recent months; however, near-term headwinds are becoming clearer. We continue to highlight caution around the high expectations on a recovery in QBE's earnings and hence maintain our 'neutral' rating.\"\nBroker Watch: Treasury Wine Estates, Uscom, iProperty, BT Investment Management\nBroker Watch: Macquarie Group, Medibank Private, Seek, Westfield\nBroker Watch: SurfStitch, ResMed, Cochlear, Ramsay Healthcare\nBroker Watch: ASX, Beadell Resources, Vitaco, Elders\nBroker Watch: OceanaGold, Bank of Queensland, Crown Resorts, Buxton Resources\nBroker Watch: Lucapa Diamond, ASG, MYOB, Independence Group\nBroker Watch: Bega Cheese, Dacian Gold, G8 Education, Japara Healthcare\nBroker Watch: Rio Tinto, dorsaVi, Lovisa, gold stocks\nBroker Watch: Alumina, Metcash, Brambles, Tomizone\nBroker Watch: Ramsay Health Care, Sims Group, SeaLink Travel, St George Mining\nBroker Watch: Woodside Petroleum, Xanadu Mines, Starpharma, Brickworks\nBroker Watch: Downer EDI, Reffind, Newcrest Mining, Beadell Resources\nBroker Watch: BHP Billiton, Sydney Airport, Crown Resorts, Warehouse Group\nBroker Watch: Premier Investments, Mainfreight, Mesoblast, Orocobre\nBroker Watch: Drillsearch Energy, Reese Australia, Iress, Navitas\nBroker Watch: Woolworths, CSG, Orica, Monadelphous\nBroker Watch: Seven West Media, Rio Tinto, ARB, Woodside Petroleum\nBroker Watch: QBE, 3P Learning, National Australia Bank, AHALife Holding\nBroker Watch: Macquarie Group, Oil Search, Independence Group, Asaleo Care\nBroker Watch: Incitec Pivot, MYOB, Mesoblast, CSL\n​ Broker Watch: Tatts Group, Westpac, News Corp, Mount Gibson Iron\nBroker Watch: Boral, Sigma Pharmaceuticals, Appen, Smartpay\nBroker Watch: Sims Metal Management, Paragon Care, WorleyParsons, Transurban\nBroker Watch: Costa Group, Macquarie Atlas Roads, BHP Billiton, GrainCorp\nBroker Watch: Westpac, McMillan Shakespeare, Crown, Billabong International\nBroker Watch: Brain Resources, ResMed, OZ Minerals, Karoon, Charter Hall\nBroker Watch: Rio Tinto, Incitec Pivot, CSL, Beadell Resources\nBroker Watch: QBE Insurance, Asia Pacific Digital, IOOF, Tap Oil\nBroker Watch: Myer, Cromwell Property, OceanaGold, CSR\nBroker Watch: TFS, Panoramic, Silver Lake Resources, Evolution Mining\nBroker Watch: iSelect, Nine Entertainment, Macquarie Atlas Roads, McAleese\nBroker Watch: Perpetual, Flight Centre, Vocus Communications\nBroker Watch: Independence Group, Toro Energy, Austal, Life Healthcare\nBroker Watch: BHP Billiton, Healthscope, Oil Search, nib Holdings\nBroker Watch: Beach Energy, Boart Longyear, GR Engineering, Tox Free Solutions\nBroker Watch: Mineral Resources, Mesoblast, Insurance Australia Group, Transpacific Industries\nBroker Watch: Western Areas, Mesoblast, AVJennings, Australian Bauxite\nBroker Watch: Ardent Leisure, Stockland, Woodside Petroleum, Alumina\nBroker Watch: ANZ Banking, Challenger, BlueScope Steel, GWA\nBroker Watch: Newcrest, Aurizon, James Hardie, Automotive Holdings\nBroker Watch: Elders, South32, Peet, Sims Metal Management\nBroker Watch: News Corp, Metals X, Sirtex Medical, Mirvac\nBroker Watch: Commonwealth Bank, CSL, OZ Minerals, K2 Asset Management\nBroker Watch: National Australia Bank, REA Group, Sirius Resources, Beach Energy\nBroker Watch: Rio Tinto, Whitehaven Coal, Ten Network, Commonwealth Bank\nBroker Watch: Bendigo and Adelaide Bank, Downer EDI, Slater and Gordon, ANZ\nBroker Watch: JB Hi-Fi, Skilled Group, OFX, Shine Corporate\nBroker Watch: AVJennings, Western Areas, Westpac Banking, G8 Education\nBroker Watch: DUET, Brambles, Medusa Mining, Computershare, Suncorp\nBroker Watch: Virgin Holdings, NRW, Vocus Communications, carsales.com\nBroker Watch: Brambles, Tassal, NextDC, Elders\nBroker Watch: Sandfire Resources, Dacian Gold, Senex Energy, Bendigo and Adelaide Bank\nBroker Watch: Iluka Resources, Saracen Minerals, Northern Star, Corporate Travel\nBroker Watch: Navitas, OrotonGroup, Elysium Resources, insurance\nBroker Watch: Evolution Mining, Steadfast Group, Sims Metal, Energy Developments\nBroker Watch: Austbrokers, Fortescue Metals Group, Carnavale Resources, Valence Industries\nBroker Watch: Macquarie Group, BHP Billiton, South32, resources sector\nBroker Watch: Western Areas, Oil Search, Telstra, Evolution Mining\nBroker Watch: Saracen Minerals, Austal, Sonic Healthcare, Arrium\nBroker Watch: Decmil, Paladin Energy, Regis Resources, Universal Coal\nBroker Watch: Macquarie Group, Beadell Resources, Ramelius, Whitehaven Coal\nBroker Watch: Primary Health Care, Challenger, Mount Gibson Iron, Perpetual\nBroker Watch: BHP Billiton, Sedgman, Newcrest Mining, APA Group\nBroker Watch: Rio Tinto, Horizon Oil, Greencross, SEEK\nBroker Watch: CSR, Aristocrat Leisure, Northern Star\nBroker Watch: Iron ore majors, Aurelia Metals, Alcoa, Gryphon Minerals\nBroker Watch: Gold stocks, insurance sector, Incitec Pivot\nBroker Watch: Crown Resorts, Aurelia Metals, Orica, Amcor\nBroker Watch: Asciano, BlueScope Steel, James Hardie, Cue Energy\nBroker Watch: Energy sector picks, REA, PacBrands, Treasury Wine\nBroker Watch: James Hardie, Brambles, Recall Holdings, GPT Group\nBroker Watch: Air New Zealand, Scentre, Aurizon, Transurban Group\nBroker Watch: Wesfarmers, Myer, Sandfire Resources, Sydney Airport\nBroker Watch: Brambles, Arrium, Tabcorp, Monadelphous Group\nBroker Watch: Origin Energy, Flight Centre, iSelect, Dexus Property Group\nBroker Watch: Fletcher Building, IAG, BT Investment Management, CSR\nBroker Watch: Woolworths, CSL Ltd, Metcash, Scentre Group\nBroker Watch: Sydney Airport, Resmed, Challenger Financial, Arrium\nBroker Watch: TFS Corporation, Western Areas, NAB, Spark Infrastructure Group\nBroker Watch: Primary Health Care, Metcash, Ten Network, Sonic Healthcare\nBroker Watch: Cover-More, SCA Property Group, Telstra, Boral\nBroker Watch: Federation Centres, Rio Tinto, CBA, Alexium International\nBroker Watch: Goodman Group, QBE, Adelaide Brighton, Seven Group Holdings\nBroker Watch: Eclipx, Independence, Alumina, ANZ Banking\nBroker Watch: ERA, Mirvac, Qube, DUET\nBroker Watch: QBE, Goodman, Seven, TPG\nBroker Watch: Greencross, Qantas, South32, Woolworths\nBroker Watch: Mesoblast, APA Group, Recall, Iluka\nBroker Watch: AGL, AWE, Qube, Nine\nBroker Watch: Metcash, Fleetwood, Otto Energy, McPherson's\nBroker Watch: BHP, Newcrest, Yowie, REA\nBroker Watch: Virtus Health, CSL, Spotless, Crown\nBroker Watch: Slater & Gordon, UGL, Flight Centre, Sirtex\nBroker Watch: Ardent, BWP Trust, Domino's, DUET\nBroker Watch: AGL, ALS, Ramsay, DuluxGroup\nBroker Watch: Woodside, Adelaide Brighton, Programmed, Brambles\nBroker Watch: BHP Billiton, WorleyParsons, Telstra, St Barbara\nBroker Watch: Ramsay Health Care, WOW, Dulux, Spark ​\n ", "external_links": ["https://plus.google.com/https://plus.google.com/u/0/104280172644175237870", "https://twitter.com/https://twitter.com/Washseile"], "published": "2015-10-14T03:15:00.000+03:00", "crawled": "2015-10-14T00:05:11.749+03:00", "highlightTitle": ""}