{"organizations": [], "uuid": "c2975aa8b22d0ae4cfb62f99988df8cbda45883d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Moodys-35-2.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/now-moodys-says-gas-price-cut-will-impact-investment/43564.html", "country": "IN", "title": "Now Moody's says gas price cut will impact investment", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Now Moody's says gas price cut will impact investment - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T15:32:00.000+03:00", "replies_count": 0, "uuid": "c2975aa8b22d0ae4cfb62f99988df8cbda45883d"}, "author": "IANS", "url": "http://www.moneylife.in/article/now-moodys-says-gas-price-cut-will-impact-investment/43564.html", "ord_in_thread": 0, "title": "Now Moody's says gas price cut will impact investment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Another global ratings agency Moody's has said the sharp hike in natural gas prices notified by the Indian government will not only impact the state-run Oil and Natural as Corp (ONGC) the most, but also discourage new exploration investments and fuel imports.   \"The gas price reduction is credit negative for upstream producers ONGC and Oil India Ltd. because it will lower their revenues and cash flows, which are already declining from low oil prices,\" an article by Moody's Credit Outlook said on Monday.   \"The gas price reduction will have its greatest effect, in absolute terms, on ONGC, the country’s largest producer of natural gas,\" it said, adding that it expected ONGC's revenues to decline by around $300 million and for Oil India Ltd by only around $33 million.   Earlier, Standard & Poor's said the 18-percent cut in domestic prices of natural gas from $4.66 per unit to $3.82 per unit for six months starting October 1 will discourage oil exploration and production companies from committing new capital expenditure.   Natural gas prices in India are set by taking a volume-weighted annual average of that prevailing in the US, Britain, Canada and Russia. Prices are calculated on the trailing 12 month data with a lag of one quarter.   \"India relies on natural gas imports to meet its energy needs. Imports accounted for 36 percent of the total natural gas consumption in India for fiscal 2015 and 39 percent for the five months between April 1 and August 30, 2015,\" Moody's said.   \"Imports will continue to increase as low international gas prices stimulate demand for natural gas and low domestic prices discourage further investments by upstream players to explore and develop new gas reserves,\" it said.   \"When oil prices are low, upstream players cannot economically produce from difficult terrains such as deep water, where costs are substantially higher,\" Moody's added.   Standard & Poor's said the government's plan to stimulate private sector participation and bring transparency in gas pricing with formula-driven pricing was well intended. But falling oil prices over the past one year has brought uncertainty over the viability of exploration projects.   The ratings agency said India should benchmark its natural gas prices to similar gas-deficient nations instead of using rates prevalent in gas-surplus areas like the US and Canada.   \"The formula for pricing domestic gas considers prices in gas-surplus geographies such as the US and Canada, which have developed gas transportation infrastructure,\" it said, adding this was not a proper mechanism given India's gas production deficit and gas transport infrastructure.   The agency held a similar view that fresh commitments by private oil ad gas companies will remain uncertain, given that several exploration firms globally had scaled back their spending and put new projects on hold amid low hydrocarbon prices.   Disclaimer: Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article", "external_links": [], "published": "2015-10-05T15:32:00.000+03:00", "crawled": "2015-10-05T10:27:46.238+03:00", "highlightTitle": ""}