{"organizations": [], "uuid": "4d3cf52059237eee7e0cfbf91d543a201b86464e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2014/11/Gas-price-s.jpg", "site_section": "http://www.financialexpress.com/section/personal-finance/", "section_title": "Personal Finance News:Personal Finance Articles,Personal Finance Tips,Banking and Finance News | The Financial Express", "url": "http://www.financialexpress.com/article/economy/gas-price-cut-to-discourage-new-investment-in-oil-sector-standard-poors-ratings/144600", "country": "IE", "title": "Gas price cut to discourage new investment in oil sector: Standard & Poor’s Ratings", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Gas price cut to discourage new investment in oil sector: Standard & Poor’s Ratings | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T04:20:00.000+03:00", "replies_count": 0, "uuid": "4d3cf52059237eee7e0cfbf91d543a201b86464e"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/gas-price-cut-to-discourage-new-investment-in-oil-sector-standard-poors-ratings/144600", "ord_in_thread": 0, "title": "Gas price cut to discourage new investment in oil sector: Standard & Poor’s Ratings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Dabur to adopt 5 UP villages to support 'Swachh Bharat' drive India should benchmark gas price to deficit nations: S&P India submits climate action plan, commits 33-35 pct cut in carbon intensity by 2030 Standard & Poor’s Ratings Services today said the government’s decision to cut natural gas prices by 18 per cent will discourage oil exploration and production (E&P) companies from committing new capital expenditure.\nIt will also add economic uncertainty to their ongoing investments, it said.\nHowever, the impact on the cash flows of Oil and Natural Gas Corp (ONGC) and Reliance Industries will be minimal. “The ratings on the companies are therefore not affected,” it said.\nStating that the formula prices domestic gas on the basis of rates in gas-surplus geographies such as the US and Canada which have developed gas transportation infrastructure, S&P said comparing prices in similar geographies as India would have been more relevant.\n“Given India’s gas production deficit and emerging gas transport infrastructure, comparing prices in similar geographies will be more relevant,” it said adding gas prices in India are lower than in its regional peers as well.\nNatural gas prices in Thailand and Indonesia average USD 8-10 per mmBtu.\nAccording to the government’s formula-driven gas pricing, the price for domestically produced natural gas on a net calorific value basis is set at USD 4.24 per million British thermal unit (mmBtu) for the six months starting October 1, 2015, down from USD 5.18 a unit earlier.\n“We believe the government’s plan to stimulate private sector participation and bring in transparency in gas pricing by introducing formula-driven gas pricing is well intended.\n“However falling hydrocarbon prices over the past one year have brought in uncertainty over the viability of exploration projects,” S&P said.\nFor ONGC, the lower gas prices will reduce EBITDA by 4-5 per cent for the fiscal year ending March 2016, compared with earlier expectation. But the company’s financial ratios have headroom to absorb the impact.\nIn the case of Reliance, there is no impact because the government does not allow it to collect gas prices above USD 4.2 per mmBtu. “Moreover, gas is now an insignificant portion of the company’s business,” it said.\n 01, 2015 8:20 pm", "external_links": [], "published": "2015-10-02T04:20:00.000+03:00", "crawled": "2015-10-02T12:15:59.737+03:00", "highlightTitle": ""}