{"organizations": ["Facebook Tops", "Microsoft"], "uuid": "82c642733211fd3b5044e3e8fd34533af65fa9ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/facebookhq_600x400.jpg", "site_section": "http://us.rd.yahoo.com/finance/news/rss/add/*http://finance.yahoo.com/rss/headline?s=FB", "section_title": "Yahoo! Finance: FB News", "url": "http://www.thestreet.com/story/13336688/1/microsoft-amazon-alphabet-lead-market-rally-facebook-tops-100-tech-roundup.html?puc=yahoo&cm_ven=YAHOO", "country": "US", "title": "Microsoft, Amazon, Alphabet Lead Market Rally; Facebook Tops $100 -- Tech Roundup", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Microsoft, Amazon, Alphabet Lead Market Rally; Facebook Tops $100 -- Tech Roundup", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T23:16:00.000+03:00", "replies_count": 0, "uuid": "82c642733211fd3b5044e3e8fd34533af65fa9ba"}, "author": "", "url": "http://www.thestreet.com/story/13336688/1/microsoft-amazon-alphabet-lead-market-rally-facebook-tops-100-tech-roundup.html?puc=yahoo&cm_ven=YAHOO", "ord_in_thread": 0, "title": "Microsoft, Amazon, Alphabet Lead Market Rally; Facebook Tops $100 -- Tech Roundup", "locations": ["Amazon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nMajor technology stocks powered the market Friday on the heels of impressive earnings from several tech giants after the closing bell Thursday. \nThe tech-heavy Nasdaq Composite Index jumped by 2.3%, closing at 5,031.86. The S&P 500 Index rose by 1.1%, closing at 2,075.16 and wiping out its losses for the year. The Dow Jones Industrial Average gained nearly 1%, finishing the day at 17,646.97. \nMicrosoft ( MSFT - Get Report ) soared by 10% Friday, closing at $52.87, after the company reported strong financial results after the market close Thursday. \nShares of Microsoft, which is winning praise under the direction of CEO Satya Nadella, are trading at a 15-year high, CNBC reported . \nRead TheStreet's report Friday on how Nadella's focus on cloud-based services is reinvigorating the company. \nGoogle's parent company, Alphabet ( GOOGL - Get Report ) , rose by 5.6% Friday, closing at $719.33, after the search giant \"delivered stronger-than-expected earnings and revenue in the third quarter thanks to a big jump in searches on mobile phones and tighter spending habits,\" Yahoo! Finance reported . \"The company also surprised investors with its first stock buyback of $5.1 billion.\" \nAmazon ( AMZN - Get Report ) shares jumped by 6.2% Friday, closing at $599.03, after the company reported a surprising third-quarter profit Thursday. \nRead Friday's report from TheStreet's Rebecca Borison on the three biggest takeaways from Amazon's strong financial results. \nAnd check out this video to learn what TheStreet's Jim Cramer told Rhonda Schaffler about Microsoft, Amazon and Alphabet. Bottom line? Cramer is a big fan of all three companies. \nShares of Facebook ( FB - Get Report ) jumped by 2.5%, closing at $102.19. Facebook stock has enjoyed \"a 475% rally since September 2012 for the fourth-best performance in the S&P 500 Index ,\" Bloomberg News reported . Twitter ( TWTR - Get Report ) co-founder and CEO Jack Dorsey said he is handing over a third of his company shares to employees. \nThe shares amount to 1% of the company, worth about $200 million,\" Bloomberg News reported . \"The move is to reinvest directly in our people,\" Dorsey said, according to the news service. \"It will go into the employee equity pool.\"\"I'd rather have a smaller part of something big than a bigger part of something small,\" Dorsey tweeted Thursday in announcing the move. \"I'm confident we can make Twitter big!\" Separately, the micro-blogging site said it will begin introducing advertising on its new Moments feature, Bloomberg said. \nTwitter shares closed at $30.28 Friday, a gain of 3.9%. \n\nThis article is commentary by an independent contributor. At the time of publication, the author held no positions in the stocks mentioned. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-10-23T23:16:00.000+03:00", "crawled": "2015-10-23T23:47:21.825+03:00", "highlightTitle": ""}