{"organizations": [], "uuid": "052dbf45e155b2d5122cc1a0e598c01fa6db94d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cpexecutive.com", "main_image": "", "site_section": "http://www.cpexecutive.com/category/finance/feed/", "section_title": "Commercial Property Executive | Finance", "url": "http://www.cpexecutive.com/finance/reits/harrison-street-snaps-up-campus-crest/1004129679.html", "country": "US", "title": "Harrison Street Snaps Up Campus Crest", "performance_score": 0, "site": "cpexecutive.com", "participants_count": 1, "title_full": "Harrison Street Snaps Up Campus Crest", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T16:52:00.000+03:00", "replies_count": 0, "uuid": "052dbf45e155b2d5122cc1a0e598c01fa6db94d3"}, "author": "annas", "url": "http://www.cpexecutive.com/finance/reits/harrison-street-snaps-up-campus-crest/1004129679.html", "ord_in_thread": 0, "title": "Harrison Street Snaps Up Campus Crest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Harrison Street Snaps Up Campus Crest \nBy Scott Baltic, Contributing Editor \nTroubled student housing REIT Campus Crest Communities Inc. has entered into a definitive merger agreement with affiliates of Harrison Street Real Estate Capital L.L.C ., in a deal worth a reported $1.9 billion, Campus Crest announced last Friday. The transaction, which is not subject to a financing condition, is expected to close during the first quarter. Richard Kahlbaugh, Campus Crest \nThe exact price, currently estimated at $7.03 per share, will depend on the outcome of a separate sale, to close by month’s end, of Campus Crest’s ownership interest in its evo Montreal joint venture. In that JV, Campus Crest and Beaumont Partners SA bought two hotels in Montreal for about $120 million and developed them into high-end student housing as evo Centre-Ville and evo Vieux-Montreal. The total estimated consideration, according to Campus Crest, represents a 24 percent premium over the closing stock price on Oct. 16 and a 35 percent premium over the 60-day volume-weighted average price. \n“Beginning in October of 2014, our Board initiated an undertaking to simplify the business model, change executive management and maximize shareholder value through a comprehensive strategic review process,” Campus Crest chairman Richard Kahlbaugh said in a prepared statement. “We are pleased to announce that after thoroughly analyzing numerous proposals, including a number of qualified potential buyers and a range of alternative transactions, the Board unanimously determined that this transaction is the best course of action in achieving our goal to maximize shareholder value.” \n“As a significant owner of student housing assets, we are pleased to add these attractive properties to our portfolio,” Harrison Street co-founder, president & CEO Christopher Merrill added. “The need for high-quality off-campus housing continues to grow and we believe this sector has strong long-term fundamentals that will drive sustainable returns.” \nCampus Crest has ownership interests in 79 student housing properties totaling more than 42,000 beds. Since its inception, Harrison Street has acquired or developed more than 63,000 student housing beds. \nMoelis & Co. L.L.C. and Kilpatrick Townsend & Stockton L.L.P. are Campus Crest’s financial advisor and legal advisor, respectively. Raymond James and Associates Inc. is Harrison Street’s financial advisor, and DLA Piper LLP (US) is its legal advisor. \nAt the beginning of this year, Campus Crest was in the middle of a repositioning process , which included finding a new CEO and closing on a $230 million acquisition while selling off other assets. In November 2014, after disappointing third-quarter results, both co-founder/CEO Ted Rollins and CFO Donnie Bobbitt had departed, after which Kahlbaugh, previously an independent director, stepped up as executive chairman and interim CEO. \n“The latest REIT privatization is another example of shareholder frustration in which a management team promises the moon, but doesn’t deliver the goods,” Brad Thomas, editor of Forbes Real Estate Investor, told Commercial Property Executive . “[T]he $1.9 billion deal indicates that the previous Campus Crest management team expanded too fast with too much leverage. All of the brand equity has been wiped out, and the new owners are stepping into an attractive real estate opportunity.” \nA June report from Axiometrics found nearly 50,000 student housing beds scheduled for fall delivery, with effective rents up by 1.9 percent versus last year. The South dominated in new deliveries, with eight schools among the top 10: Louisiana State University, UNC – Charlotte, Texas State, the University of Louisville, the University of Oklahoma, Georgia Tech, Texas A&M and the University of Alabama.", "external_links": [], "published": "2015-10-20T16:52:00.000+03:00", "crawled": "2015-10-20T18:54:36.020+03:00", "highlightTitle": ""}