{"organizations": [], "uuid": "51f61e215023d05249bf4b72b9f3bb9a49eae79d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KR381_NYPIXA_G_20151008135140.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/the-whole-story-a-peek-into-pixars-design-process-1444347087", "country": "US", "title": "The Whole Story: a Peek Into Pixar’s Design Process", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "The Whole Story: a Peek Into Pixar’s Design Process - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-09T03:31:00.000+03:00", "replies_count": 0, "uuid": "51f61e215023d05249bf4b72b9f3bb9a49eae79d"}, "author": "Ellen Gamerman", "url": "http://www.wsj.com/articles/the-whole-story-a-peek-into-pixars-design-process-1444347087", "ord_in_thread": 0, "title": "The Whole Story: a Peek Into Pixar’s Design Process", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Ants with four legs are cute. Ants with six legs are not.\nThat’s the insect world according to Pixar, the animation studio featured in an exhibit that opened Thursday at the Cooper Hewitt, Smithsonian Design Museum in New York. The show explores the design decisions that gave rise to Pixar’s characters—including Dot, an ant from the 1998 movie “A Bug’s Life,” who lost a pair of legs on her anatomically incorrect march to the box office.\nMuseums are lining up to work with the crowd-pleasing Pixar. The brand collaborated on a show now running at Boston’s Museum of Science that is slated for a 10-year national tour and helped draw the institution’s biggest summer crowds in 17 years.\nA decade ago, the Museum of Modern Art created a Pixar exhibit with cooperation from the company—what the New York museum still calls the most extensive gallery show it ever devoted solely to animation. Pixar has been touring expanded versions of that MoMA show ever since.\nPixar is a close collaborator on the Cooper Hewitt exhibit, which the museum originated and curated. During work on the show, “Pixar: The Design of Story,” exhibit organizers and Pixar staff were on the phone and shuttling between New York and the studio’s headquarters in Emeryville, Calif. The show appears in the museum’s interactive Process Lab, which attempts to teach principles and tools of design.\nThe exhibit includes about 75 pieces—mostly reproductions of digital paintings and digital drawings, with some original artwork—and another 650 images available on a touch-screen table. Here, a look at images from the show.", "external_links": [], "published": "2015-10-09T03:31:00.000+03:00", "crawled": "2015-10-09T02:47:53.625+03:00", "highlightTitle": ""}