{"organizations": [], "uuid": "8aa433abb22cc591f6e7f9217277874cadc8caec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/e/h/6/6/image.related.afrArticleLead.620x365.gkcgtg.png/1445429941049.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/real-estate/suburbs-hardesthit-in-last-property-downturn-have-been-biggest-winners-20151019-gkcgtg", "country": "AU", "title": "Suburbs hardest-hit in last property downturn have been biggest winners", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Suburbs hardest-hit in last property downturn have been biggest winners | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T21:15:00.000+03:00", "replies_count": 0, "uuid": "8aa433abb22cc591f6e7f9217277874cadc8caec"}, "author": "Post to Linkedin", "url": "http://www.afr.com/real-estate/suburbs-hardesthit-in-last-property-downturn-have-been-biggest-winners-20151019-gkcgtg", "ord_in_thread": 0, "title": "Suburbs hardest-hit in last property downturn have been biggest winners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apartment prices in exclusive Milsons Point slipped by about 44 per cent in the 2012 downturn but are now rising by about 10 per cent a year. Jessica Hromas by Duncan Hughes Suburbs hit hardest by property corrections in 2008 and 2012 had some of the biggest bouncebacks once buyer confidence returned, offering comfort to investors in the face of predictions of another downturn.\nProperty markets have routinely shrugged off sharp corrections over the past decade without any significant interruption to steadily rising markets, say property analysts and buyers' agents.\nFor example, some the nation's plummiest postcodes in Melbourne and Sydney that plunged by more than 40 per cent as top-paying jobs and bonuses were slashed after the global financial crisis (GFC) have since doubled in value.\n\"Markets are very susceptible to declines following periods of strong growth and economic weakness, such as we are seeing now,\" says Tim Lawless, research director of RP Data, a company that collates and analyses property information.\n\"Some postcodes have increased by nearly 50 per cent in the past two and a half years, so a small correction is probably not that much to be concerned about,\" Lawless says. \"People forget that property prices do not always rise.\"\nPrices in even the nation's worst performing capital, Hobart, have increased by more than 7 per cent since the 2012 correction.\nA slowing economy, particularly in mining hubs like Perth and Darwin, rising rates and tougher borrowing conditions, particularly for overseas borrowers, are causing concern about future growth.\nMacquarie Group recently predicted Australian house prices are next year set to fall by about 7.5 per cent thanks to increased housing supply and tighter lending criteria.\n To put this into perspective, there jave been two corrections of about 7 per cent in the past seven years without any major disruption to overall price rises.\nCapital city prices fell by about 7 per cent during the 10 months that global financial and property markets were roiled by the global financial crisis to November 2008, according to RPData.\nThe biggest overall losses were in Melbourne, where the average fall was 8 per cent, followed by 7 per cent in Perth and 6 per cent in Sydney.\nRising interest rates and cutbacks in first-time-buyer allowances triggered another downturn of 7 per cent, which bottomed out in May 2012, says RPData.\nIn that downturn, Melbourne, Brisbane and Hobart were the biggest losers with overall prices slipping between 10 per cent and 13 per cent.\nBut individual suburbs suffered much bigger falls.\nFor example, prices for apartments in exclusive Milsons Point, which is located three kilometers north of Sydney's central business district, slipped by about 44 per cent during the crisis as bankers and financiers were hit by falling bonuses, redundancies and big stock losses.\nSince then, apartment prices there have nearly doubled and are annually rising by an estimated 10 per cent.\nChristopher Koren, a director of buyers' agents Morrell and Koren, says demand for his services increased in the wake of the GFC fallout as sassy buyers swooped on bargains.\nKoren claims corrections create opportunities for the sharp-eyed and opportunistic.\nPrices for apartments in trendy inner East Melbourne that were down nearly 30 per cent after the GFC to a median of about $390,000 have nearly doubled since, according to analysis.\nSince the 2012 downturn, residential prices in the nation's capitals have increased by 32 per cent, with boom town Sydney up 50 per cent and Melbourne more than 35 per cent.\nSQM Research, which predicted the Sydney boom, predicts the harbour city's price growth will slow and that Melbourne will outperform .\nHouse prices will rise between 3 per cent and 8 per cent across the capitals, down from about 10 per cent in the year to June.\nPast performance is no guide to the future and it is risky to assume that because a postcode has doubled in value over eight years it will happen again, say financial advisers.\nOver-supply of apartments in some parts of Darwin, Melbourne and Perth might be hard to clear, particularly as banks tighten lending to overseas buyers.\nNational Australia Bank has identified 34 Sydney postcodes where it believes the risk of mortgage default is rising. In Victoria it has identified five suburbs.\nHouse prices in Perth are down about 6 per cent, 2 per cent in Canberra and they have flat-lined in Darwin during the past 12 months.\nThe recent Reserve Bank of Australia's financial stability review found \"tentative\" signs of a turn in sentiment in Melbourne and Sydney, the nation's flagship property markets, citing slower price growth and weaker auction results .\nDomain Group's senior economist Andrew Wilson says clearance rates in Sydney's western suburbs have fallen below 50 per cent, creating a buyers' market for the first time in several years.", "external_links": [], "published": "2015-10-21T21:15:00.000+03:00", "crawled": "2015-10-21T17:04:41.249+03:00", "highlightTitle": ""}