{"organizations": [], "uuid": "c2e0c67895d55678517ee5418cac2b420dde1282", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30238737/web-performance-and-end-user-experience-monitoring-leader-rigor-acquires-web-optimization-company-zoompf", "country": "US", "title": "Web Performance and End User Experience Monitoring Leader, Rigor, Acquires Web Optimization Company Zoompf", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Web Performance and End User Experience Monitoring Leader, Rigor, Acquires Web Optimization Company Zoompf - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:02:00.000+03:00", "replies_count": 0, "uuid": "c2e0c67895d55678517ee5418cac2b420dde1282"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30238737/web-performance-and-end-user-experience-monitoring-leader-rigor-acquires-web-optimization-company-zoompf", "ord_in_thread": 0, "title": "Web Performance and End User Experience Monitoring Leader, Rigor, Acquires Web Optimization Company Zoompf", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Integration of Zoompf into Rigor’s SaaS Platform Creates the First Web Performance Management Solution with Both Diagnostic and Prescriptive Analytics\nAtlanta, GA (PRWEB) October 12, 2015\nWeb performance and end user experience monitoring company, Rigor , today announced the acquisition of fellow Atlanta-based web optimization company Zoompf. The financial terms of the deal were not disclosed. As a result of the acquisition, Rigor will integrate Zoompf’s technology into its SaaS platform, thereby creating the first-ever web performance monitoring and optimization platform to offer both diagnostic and prescriptive analytics for the entire DevOps lifecycle, including development, quality assurance (QA) and technical operations. The integration will enable Rigor’s e-commerce, media, and enterprise customers to turn performance data into actions by detecting when performance degrades, identifying the root cause of the issues, and providing a detailed step-by-step remediation plan.\n“Our acquisition and integration of Zoompf will result in the smartest front-end web performance management platform on the market,” said Rigor CEO Craig Hyde. “The existing vendors in the Application Performance Management market are in an arms race to collect the most data, however these solutions often leave their users drowning in data, yet starving for knowledge. With the addition of the Zoompf intelligence engine, Rigor users will be armed with the specific, actionable insights that they need to take action on improving their websites for the first time.”\nFounded in 2010, Rigor provides its customers with a faster, simpler process for maintaining complete visibility into the performance of their websites, which enables businesses and technical users to understand how their web applications are performing at all times. The acquisition of Zoompf will expand the functionality of Rigor’s SaaS platform to include prescriptive intelligence, allowing customers to interpret substantial amounts of data and then use the knowledge to ensure an optimal user experience at all times.\nSaid Jake McGraw, director of platform engineering at the media company Refinery 29 , the first customer to use the new Rigor platform: “Maintaining an optimal end user experience is our number one priority. The visibility and intelligence that Rigor now provides with Zoompf integrated sets it apart from any other platform that I know of. It’s invaluable to us.”\nThe acquisition continues recent momentum for Rigor, which has experienced triple digit growth and numerous awards over the past three years, including the 2014 Most Innovative Company in Georgia. In the coming months, Rigor expects to add 25-30 new jobs, not including the addition of Zoompf employees, who have already begun the transition. Zoompf’s CEO Mark Isham will continue as director of engineering, and Zoompf’s founder Billy Hoffman now serves as director of product, both reporting to Rigor founder and CEO Craig Hyde. Rigor is seed funded by Atlanta Ventures.\nFor more information on the newly combined company, visit booth #71 at the Velocity Conference in New York from October 12-14, and at http://www.rigor.com .\nAbout Rigor\nRigor provides web performance and end-user experience monitoring services for organizations that value the online experience of their users. Headquartered in Atlanta, Rigor has become the new standard in web performance monitoring by providing a faster, simpler process for monitoring the health, reliability and performance of web-based applications and services. Visit rigor.com to learn more and see how Rigor can help simplify Web performance monitoring today.\n //www.prweb.com/releases/2015/10/prweb13014455.htm\n ", "external_links": ["http://www.refinery29.com/", "http://www.prweb.com/releases/2015/10/prweb13014455.htm"], "published": "2015-10-12T17:02:00.000+03:00", "crawled": "2015-10-12T16:17:51.979+03:00", "highlightTitle": ""}