{"organizations": [], "uuid": "55202041561f14ee75cd2eed54e49fc3c08d0772", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/cbi-1.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/cbi-files-charge-sheet-in-syndicate-bank-bribery-case/43609.html", "country": "IN", "title": "CBI files charge sheet in Syndicate Bank bribery case", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "CBI files charge sheet in Syndicate Bank bribery case", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T15:12:00.000+03:00", "replies_count": 0, "uuid": "55202041561f14ee75cd2eed54e49fc3c08d0772"}, "author": "IANS", "url": "http://www.moneylife.in/article/cbi-files-charge-sheet-in-syndicate-bank-bribery-case/43609.html", "ord_in_thread": 0, "title": "CBI files charge sheet in Syndicate Bank bribery case", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » CBI files charge sheet in Syndicate Bank bribery case 43609 CBI files charge sheet in Syndicate Bank bribery case 0 Comments, Be the first to comment + COMMENT IANS | 08/10/2015 05:42 PM | The Central Bureau of Investigation (CBI) has filed a charge sheet in the 2014 bribery case naming Syndicate Bank chairman-cum-managing director S.K. Jain and Bhushan Steel Ltd. vice-chairman Neeraj Singhal as accused in the case, sources said Thursday. The charge sheet was filed before Special Judge Gurdeep Singh, who posted the matter for October 12 after CBI sought more time for filing some other documents in the case as as they are voluminous. CBI, in its charge sheet filed on Monday, named Jain, Singhal, middleman Vineet Godha, Puneet Godha, Vijay Pahuja and Pankaj Kumar Tiwari as accused in the case. All the six were charge sheeted under various section dealing with criminal conspiracy and various provisions of Prevention of Corruption Act dealing with bribery and criminal misconduct. However, the CBI gives clean chit to two accused - alleged middlemen Purushottam Lal Totlani and Arun Agarwal - saying that it did not found any evidence against them. The agency has alleged that Jain has received a bribe of Rs.50 lakh through conduits and abused his official position to enhance the credit limits of some companies in violation of laid-down procedures. CBI said that sufficient oral and documentary evidence against the accused and requested court to summon and try them in the case. It has cited 80 witnesses to support its case. All the accused are out on bail. Disclaimer: Information, facts or opinions expressed in this news article are presented as sourced from IANS and do not reflect views of Moneylife and hence Moneylife is not responsible or liable for the same. As a source and news provider, IANS is responsible for accuracy, completeness, suitability and validity of any information in this article. More in Moneylife", "external_links": [], "published": "2015-10-08T15:12:00.000+03:00", "crawled": "2015-10-08T15:23:47.320+03:00", "highlightTitle": ""}