{"organizations": [], "uuid": "83b3aeac9bcb21d561d4790a74fdbe6cc6364a77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=FOXA", "section_title": "Yahoo! Finance: FOXA News", "url": "http://finance.yahoo.com/news/disneys-fantastic-box-office-run-184506841.html", "country": "US", "title": "Disney's Fantastic Box-Office Run Continues: Crosses $4B - Yahoo Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Disney's Fantastic Box-Office Run Continues: Crosses $4B - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "83b3aeac9bcb21d561d4790a74fdbe6cc6364a77"}, "author": "Zacks Equity Research", "url": "http://finance.yahoo.com/news/disneys-fantastic-box-office-run-184506841.html", "ord_in_thread": 0, "title": "Disney's Fantastic Box-Office Run Continues: Crosses $4B - Yahoo Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Even though the global economy is in doldrums and investors are worried about financial crisis, the scenario appears to be improving for the entertainment industry. The fact that the The Walt Disney Company DIS is tasting all success at the box office and has crossed the $4 billion mark even before 2015 reached its end stands witness to this development. Investors reacted positively to the news sending the company’s shares higher by 1.2%.\nSimilar to last year, 2015 is turning out to be a fabulous one for Disney as the movie business continues to post record-breaking numbers. Till Oct 7, 2015 Disney collected $1.4 billion from U.S. and Canada and $2.575 billion from the overseas market. Disney has touched the $4 billion mark for the three consecutive years. This is the tenth successive year in which the studio has exceeded the billion dollar mark.\nDisney's head of distribution, Dave Hollis said, “2015 has been a record-setting year both domestically and internationally thanks to a strong slate of films from all of our brands.”\nDisney’s 2015 Blockbusters Movies \nDisney has struck gold at the box office with almost every movie released over the last couple of years.  This year, the company has come up with hits like Avengers: Age of Ultron, Marvel's Ant-Man, Inside Out and Cinderella. So far in 2015, the company’s shares have gained more than 11%.\nLooking at Avengers: Age of Ultron’s box office numbers, the movie has earned $458.9 million domestically and $946 million from the overseas market. Total collection of this movie, which was made on a budget of $279.9 million, has crossed $1.4 billion globally.\nMade at a budget of approximately $175 million, Inside Out released in June also did fabulous business and earned more than $800 million globally. Cinderella, released in March, had a budget of $95 million and also did sound business with a total box office haul of over $542 million out of which $201.1 million came from the domestic market and $341.4 million was earned internationally. Paul Rudd starrer Ant-Man, which hit the box office in July, collected nearly $410 million globally.\nWhat’s Lies Ahead for Disney This Year? \nGiven the runaway success of Marvel studios these days and the fact that Pixar has hardly let down Disney, both are likely to deliver at the box office.\nThere has been a lot of buzz surrounding Star Wars ever since Disney announced the seventh episode titled Star Wars: The Force Awakens. It is the first Star Wars movie in a decade. The last release was Revenge of Sith in 2005. The release of Star Wars: The Force Awakens on Dec 18 will be a fitting end to a spectacular year.\nEarlier, analysts had estimated that The Force Awakens will earn over $650–$700 million domestically while global collections are likely to range between $1.3 billion and $1.5 billion.\n\nSuccess Story to Continue Beyond 2015 \nWe believe that the studio will continue with its success story beyond Star Wars as it boasts of an impressive lineup of big budget movies. Disney will bring to celluloid certain new Marvel characters including Black Panther and Dr. Strange. There will also be sequels to Captain America, Guardians of the Galaxy and Thor along with the 2-part Avengers Finale titled Infinity Wars.\nThe success of its movies will also mean great business for its Consumer Products division as demand for the merchandise associated with successful movies usually skyrockets as seen in case of Frozen.  Addition of these popular themes to Parks and Resorts will likely increase footfall.\nDisney has also outlined release dates for its upcoming movies. Cars 3 will be released on Jun 16, 2017 whereas the release of Toy Story 4 has been delayed for a year and has now been set on Jun 15, 2018 instead of Jun 16, 2017. Captain Marvel, which was previously scheduled to release on Nov 2, 2018, will hit the theaters on Mar 8, 2019. The Incredibles 2 is expected to release on Jun 21, 2019.\nDisney which shares space with Twenty-First Century Fox, Inc. FOXA, Time Warner Inc. TWX and Comcast Corporation CMCSA has a Zacks Rank #3 (Hold). \nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report >>\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report \n \nTIME WARNER INC (TWX): Free Stock Analysis Report \n \nDISNEY WALT (DIS): Free Stock Analysis Report \n \nCOMCAST CORP A (CMCSA): Free Stock Analysis Report \n \nTWENTY-FST CF-A (FOXA): Free Stock Analysis Report \n \nTo read this article on Zacks.com click here. \n \nZacks Investment Research Professional Services Media Walt Disney Company", "external_links": [], "published": "2015-10-10T03:00:00.000+03:00", "crawled": "2015-10-10T04:12:42.216+03:00", "highlightTitle": ""}