{"organizations": [], "uuid": "77408adffa7b8abe4b9ee2ea9ab5659b61689988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wsj.com", "main_image": "http://si.wsj.net/public/resources/images/BN-KX929_1026co_G_20151026074056.jpg", "site_section": "http://www.wsj.com/news/business", "section_title": "Business &amp; Finance News - Wall Street Journal", "url": "http://www.wsj.com/articles/comcast-earnings-what-to-watch-1445882335", "country": "US", "title": "Comcast Earnings: What to Watch", "performance_score": 0, "site": "wsj.com", "participants_count": 1, "title_full": "Comcast Earnings: What to Watch - WSJ", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T20:58:00.000+02:00", "replies_count": 0, "uuid": "77408adffa7b8abe4b9ee2ea9ab5659b61689988"}, "author": "Shalini Ramachandran", "url": "http://www.wsj.com/articles/comcast-earnings-what-to-watch-1445882335", "ord_in_thread": 0, "title": "Comcast Earnings: What to Watch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 COMMENTS Comcast Corp. CMCSA 0.23 % is scheduled to report third-quarter earnings on Tuesday. Here’s what you should know:\n--EARNINGS FORECAST: Comcast is expected to report per-share earnings of 80 cents, according to analysts polled by Thomson Reuters, compared with 99 cents a year earlier.\n--REVENUE FORECAST: Analysts, on average, expect Comcast to report revenue of $18.03 billion, compared with $16.79 billion in the year-ago quarter.\nWHAT TO WATCH:\n--WIRELESS: Investors have been focused on whether Comcast will enter the wireless industry. Last week Verizon Communications Inc. VZ 0.48 % disclosed that an unnamed cable company had recently informed the telecom giant that it was going to execute on a 2011 agreement to resell Verizon’s service. A source close to Comcast confirmed that the cable giant has, in the last couple months, activated the agreement, but it is still exploring all of its options. (Comcast also has a reseller deal with Sprint Corp. S 1.06 % , another potential route to offering service.)\nAnalysts believe Comcast is most likely to offer a “Wi-Fi-first” service that primarily leans on its roughly 11 million Wi-Fi hot spots and uses carriers’ airwaves to patch up the holes in coverage. Comcast could also choose to bid for airwaves in the Federal Communications Commission’s upcoming auction of frequencies. That would be “back to the future” for Wall Street, given that Comcast had earlier bought spectrum and then sold it to Verizon.\nLaunching a wireless business is a tedious and complex process , and Verizon and Comcast have had differing interpretations of their old resale contract, The Wall Street Journal reported in July. Still, J.P. Morgan analyst Phil Cusick said he expects Comcast to launch three to five trial cities in the next couple of quarters.\n--STREAMING: Comcast’s NBCUniversal recently confirmed plans to launch a $3.99-a-month comedy streaming video-on-demand service , adding to the dizzying array of new streaming services available for consumers. Investors may be watching for commentary on how Comcast sees the service fitting into its overall suite of video packages, including the $15-a-month “Stream” skinny TV bundle that it launched earlier in the year and the “Watchable” short-form video service that is available nationally even outside of its service area.\n--CORD-CUTTING: Investors will also be watching to see if cord-cutting trends improved at all after a bruising second quarter, when evidence of accelerated cord-cutting led to a $50 billion stock rout across media companies. Comcast and cable operators generally have been reducing their cable TV subscriber losses, while satellite and phone companies have done worse than before.\n--M&A: Since dropping its bid for Time Warner Cable TWC 0.06 % in April, Comcast has been making moves in a smaller-scale, but fast-growing space: digital media . In August, its NBCUniversal unit announced two $200 million equity investments in new-media stars BuzzFeed and Vox Media. The company has continued to signal interest in the space due to its popularity with younger audiences. Comcast has also showed interest in international deals—it recently bought control of the Universal Studios Japan theme park—and investors are likely to listen for any signs of additional moves abroad.\nWrite to Shalini Ramachandran at shalini.ramachandran@wsj.com", "external_links": [], "published": "2015-10-26T20:58:00.000+02:00", "crawled": "2015-10-26T20:23:44.328+02:00", "highlightTitle": ""}