{"organizations": [], "uuid": "77f44220e69c055a56a59deaa183b5c44a8cec9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/oil-prices-rise-lower-u-045150639.html", "country": "US", "title": "Oil prices rise on lower U.S. rig count; China data eyed", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil prices rise on lower U.S. rig count; China data eyed", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T09:04:00.000+03:00", "replies_count": 0, "uuid": "77f44220e69c055a56a59deaa183b5c44a8cec9f"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-prices-rise-lower-u-045150639.html", "ord_in_thread": 0, "title": "Oil prices rise on lower U.S. rig count; China data eyed", "locations": ["U.S.", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nMon, Oct 12, 2015, 07:12 BST - UK Markets open in 48 mins. Oil prices rise on lower U.S. rig count; China data eyed Reuters – 7 minutes ago Print \nBy Henning Gloystein \nSINGAPORE (Reuters) - Oil prices rose on Monday as the number of U.S. rigs fell for a sixth week, while investors waited for Chinese trade data to be published later this week for clues whether the world's second biggest economy and oil consumer was slowing down further. \nU.S. West Texas Intermediate (WTI) crude futures (CLc1) were trading at $49.97 per barrel at 0549 GMT, up 34 cents from their last settlement. Internationally traded Brent futures (LCOc1) were up 29 cents at $52.94 a barrel. \nU.S. drillers removed nine oil rigs in the week ended Oct. 9, bringing the total rig count down to 605, oil services company Baker Hughes Inc (BHI.N) said late on Friday. That total was the least since July, 2010. Drillers had cut a total of 61 rigs over the prior five weeks. \nSince hitting an all-time high of 1,609 during this week a year ago, weekly rig count reductions have averaged 20. \n\"The current rig count is pointing to U.S. production declining sequentially between 2Q15 and 4Q15 by 255,000 barrels per day,\" Goldman Sachs said in response to the data. \nThe bank, however, added that \"a rapid drawdown of the observed backlog of uncompleted wells could lead to higher production later this year and in 2016\". \nThe slowing U.S. drilling activity has pushed up WTI crude prices about 11 percent this month or almost 30 percent above their most recent low-point in August, although they remain 20 percent below their 2015 highs reached in May as China's slowing economy weighs on markets. \n\"The downside price risks (to oil) are receding as supply restructuring gathers pace, but the bottoming out process is likely to last for a while yet ... There is unlikely to be a sustainable improvement in commodity prices until global GDP starts to improve and there is little sign of that yet,\" Barclays said. \nUpcoming Chinese data, starting with import and export numbers on Tuesday, is likely to point to further economic weakness, with some investors fearing an increasingly fragile international outlook. \nYet as of now, oil is also drawing support from a weaker U.S. dollar, which makes purchases cheaper for holders of other currencies. \nThe dollar hovered near a three-week low versus a basket of major currencies (.DXY), anchored by doubts the U.S. Federal Reserve will raise interest rates by year-end. \n\"Upside (in oil prices) is likely limited, and we continue to see a range-bound market through year-end,\" Morgan Stanley said. \n(Editing by Himani Sarkar and Gopakumar Warrier)", "external_links": [], "published": "2015-10-12T09:04:00.000+03:00", "crawled": "2015-10-12T09:12:28.297+03:00", "highlightTitle": ""}