{"organizations": [], "uuid": "c3f541b8f65fc93ad87a53aea5e6ab4a2e559155", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/tories-must-business-level-playing-185346764.html", "country": "US", "title": "The Tories must give business a level playing field - or it could be a huge own goal", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "The Tories must give business a level playing field - or it could be a huge own goal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T21:53:00.000+03:00", "replies_count": 0, "uuid": "c3f541b8f65fc93ad87a53aea5e6ab4a2e559155"}, "author": "", "url": "https://uk.finance.yahoo.com/news/tories-must-business-level-playing-185346764.html", "ord_in_thread": 0, "title": "The Tories must give business a level playing field - or it could be a huge own goal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "16.70 +0.65 \nThe Chancellor is appearing to listen to business, while continuing to take his pound of flesh \nEven (Taiwan OTC: 6436.TWO - news ) for those who weren't paying close attention, there was little doubt as to what George Osborne 's speech was about. \n\"We are the builders,\" he boomed, again and again. In fact, the Chancellor referenced builders, or building, or some form of construction, 25 times during his speech to the party faithful in Manchester on Monday. \nBut if the hackneyed building rhetoric was to provide the theme - be it HS2 or a hint of his view on whether to give Heathrow airport its much needed extra runway - it was his \"rabbit out of the hat\" announcement on devolving business rates that was to provide the punchline. \nA punchline that though some had long campaigned for, few thought would ever happen, at least under Osborne. \nMany in industry assumed, wrongly as it turned out, that the rates review conducted earlier this year had simply been kicked in to the long grass. \nBut while there was a warm reception in the conference hall for the plan - Osborne received a standing ovation for his \"let the devolution revolution begin\" battle cry - as the detail began to be analysed by those the move will most affect, the news was not unanimously welcomed . \nSome fear it could lead to local councils hiking rates ahead of an election or when times are tough. \nOthers worry it could be a divisive measure which backfires by pitting council against council, to the detriment of the businesses within, and force some businesses to relocate. \nFor businesses in local authorities who currently are net recipients of the central government grant, will they really benefit? \nSo was this then really a measure to please business or just a way of Osborne achieving another aim - simplifying and devolving local government finance, with business rate reform a byproduct benefit? \nThis question goes to the heart of a wider conundrum on the lips of some of those business people gathered in Manchester alongside the assortment of party activists, lobbyists and politicians. \nIs the recently elected majority Conservative government a party for business? Or one which simply tolerates the business community in return for the significant taxation it delivers to the Exchequer? \nAt first glance, the answer has to be yes to the former. \nFor here is a party of the small state and free enterprise, of backing entrepreneurs and wealth creation. \nA party that has delivered pension freedoms and begun the privatisation of state-owned banking assets, a party that is trying to link up the disparate economies of the north of England to form a \"powerhouse\". \nBut for each positive business policy that can be named, there is a negative one. \nThe arguments around business bete noires such as the cost of the national living wage and the bank surcharge are well versed. \nIn fact, the bank surcharge is a prime example of how while appearing to listen to business, the Chancellor continues to take his pound of flesh. The banking sector wanted the bank levy to be reduced and so Osborne used the July Budget to promise to do so. \nBut not before imposing the new surcharge, which from next year will hurt not only UK-focused banks but brokerages and other financial services firm who had little or nothing to do with the financial crisis for which the Chancellor is so keen to punish the sector for. \nIt (Other OTC: ITGL - news ) is not just headline policies that aggrieve some in the business world. \nThe introduction of the carrier bag surcharge in England and Wales angers some, as does Energy Secretary Amber Rudd's announcement in Manchester that the energy ombudsman will be strengthened. \nIndeed, Rudd's speech to conference was symptomatic of a phenomenon that happened over and over again at the conference - praising business in one breath, only to knock it down in the next. \nThere will be no \"magic money tree\" for renewal subsidies, she vowed at one stage. \nSajid Javid, the Business Secretary, followed suit, not being able to resist the chance to knock Volkswagen (LSE: 0P6N.L - news ) for its emission scandal or the banking sector for rigging rates. \nAnd the Chancellor, who perfected this \"carrot and stick\" approach, also couldn't stop himself, speaking of a \"new settlement\" for businesses, vowing to keep corporation and other taxes low so long as wages rise. \nWhat this sort of language sends is a message to business that while it is being partly praised, it is still very much on the naughty step. And it is a message that doesn't always need to be made at every possible juncture. \nBut it is not just in words that such messages emanate. \nThe parts of the business community that are present in Manchester are replete with anecdotes of companies that have tried to get meetings with ministers, only to fall at the first hurdle. \nOthers speak of sponsors turned down from backing key events at the conference because their brand doesn't chime with what the party stands for. \nNow (NYSE: DNOW - news ) , these are hearsay, and should be taken as such. But idle gossip of that form wouldn't circulate if the Government was popular with business. \nThat is not to say there are not popular ministers - there are. Baroness Neville-Rolfe, Tesco (Xetra: 852647 - news ) 's former company secretary, is hugely popular with the business community, and Javid offers an outlook far more in tune with most here than Vince Cable ever could have hoped to achieve. And the Government as a whole is far more business-focused than the alternative \"vision\" that Ed Miliband was offering. \nBut despite this there is still a somewhat latent feeling of discontent. \nOne of the reasons for that is perhaps because there is now no alternative. \nAs last week's conference in Brighton reflected, Labour 's relationship with business will only deteriorate as long as Jeremy Corbyn is leader and Angela Eagle is shadow business secretary. \nAs such, if the business community is looking for different policies or a shoulder to cry on, it is unlikely to find one. \nThat has led some here in Manchester to question whether that means Conservative policy towards business will be very much a \"take or leave it\" approach. \nWith the first Conservative majority government in two decades, and no real alternative, some argue that business will just have to put up with it. \nTo some degree, that may well be the case. But for many that leaves a bad taste in the mouth. \nThe business community doesn't want an easy ride. But what it does want is a level playing field, and to know the rules of the game. \nAnd if from under the veneer of a business-focused Government is going to flow lots of smaller, somewhat petty, little policies which when added together creates anti-business sentiment, then come the next general election, business support for the Conservatives may not be as guaranteed as it was on May 7.", "external_links": [], "published": "2015-10-05T21:53:00.000+03:00", "crawled": "2015-10-05T22:16:46.311+03:00", "highlightTitle": ""}