{"organizations": [], "uuid": "bd0bd462bd0669389bc5d3307b080175c182c363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/oil-prices-nudge-short-covering-035058693.html", "country": "US", "title": "Oil prices nudge up on short-covering; glut, econ concerns persist", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Oil prices nudge up on short-covering; glut, econ concerns persist", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T10:02:00.000+03:00", "replies_count": 0, "uuid": "bd0bd462bd0669389bc5d3307b080175c182c363"}, "author": "", "url": "https://uk.finance.yahoo.com/news/oil-prices-nudge-short-covering-035058693.html", "ord_in_thread": 0, "title": "Oil prices nudge up on short-covering; glut, econ concerns persist", "locations": ["Libya"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Keith Wallis"], "text": "Offshore oil platforms are seen at the Bouri Oil Field off the coast of Libya August 3, 2015. REUTERS/Darrin … By Keith Wallis \nSINGAPORE (Reuters) - Oil prices rebounded on Tuesday as traders covered short positions after prices fell at least 3 percent in the previous session, but gains were capped by worries about oversupply and the health of the global economy. \nBrent crude for December delivery had climbed 25 cents to $48.86 a barrel by 12.52 a.m. ET after settling down $1.85, or 3.7 percent, in the previous session. \nU.S. crude for November delivery rose 21 cents to $46.10 after closing down $1.37, or 3 percent. The November contract expires on Tuesday. \n\"Short-covering has led to a little bit of a rally,\" said Ben Le Brun, market analyst at Sydney's OptionsXpress. \nBut worries over Iran boosting crude production when international sanctions are lifted and weaker economic growth in China, the world's second-largest economy, weighed on markets, Le Brun said. \n\"The fundamentals remain a little bit stressed,\" he added. \nIran plans to increase crude production by 500,000 barrels per day within a week of the lifting of sanctions, a senior Iranian oil official was quoted as saying on Monday, selling the oil to traditional customers in Asia and Europe. \nChina's GDP growth slowed to 6.9 percent in the third quarter, down on a 7-percent rise in the prior quarter, while implied oil demand was also lower, official figures and Reuters data on Monday showed. \nThat came as U.S. crude stocks likely rose for a fourth straight week, climbing last week by 3.7 million barrels to 472.3 million barrels, a preliminary Reuters survey taken ahead of weekly industry and official data showed on Monday. \nInvestors had already priced in the likely rise in oil inventories last week, said Vyanne Lai, an analyst at National Australia Bank in Melbourne. \n\"The market consensus is a 3.5-million barrel increase which is hardly surprising given seasonal production,\" she said. \nIndustry group, the American Petroleum Institute (API) will report its stocks data later on Tuesday, while the U.S. Department of Energy's Energy Information Administration (EIA) will release oil inventory data on Wednesday. \nInvestors are also keeping an eye on the outcome of a technical meeting of oil experts from the Organization of Petroleum Exporting Countries and non-OPEC countries on Wednesday, as well as a European Central Bank meeting and manufacturing data from China later this week. \nDiscussions at the oil experts meeting is likely to focus on possible financial aid for OPEC members hit by falling oil prices rather than production cuts, Lai said. \nThursday's ECB meeting, set against a background of lower consumer spending, could result in a further round of stimulus and asset purchases. \n(Editing by Ed Davies and Joseph Radford)", "external_links": [], "published": "2015-10-20T10:02:00.000+03:00", "crawled": "2015-10-20T10:14:17.461+03:00", "highlightTitle": ""}