{"organizations": [], "uuid": "eadd8e0b5fdc3897bd2d0759a0c2ffa64f160265", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/02/tcs-s-pti.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/companies/tcs-q2-net-profit-at-rs-6055-crore-up-14-5-yoy/150650", "country": "IE", "title": "TCS Q2 net profit at Rs 6,055 crore; CEO N Chandrasekaran says ‘we will be hiring’", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "TCS Q2 net profit at Rs 6,055 crore; CEO N Chandrasekaran says ‘we will be hiring’ | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T01:20:00.000+03:00", "replies_count": 0, "uuid": "eadd8e0b5fdc3897bd2d0759a0c2ffa64f160265"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/companies/tcs-q2-net-profit-at-rs-6055-crore-up-14-5-yoy/150650", "ord_in_thread": 0, "title": "TCS Q2 net profit at Rs 6,055 crore; CEO N Chandrasekaran says ‘we will be hiring’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles TCS: Tame numbers eclipse good OPM Fe exclusive: IVRCL to get new owners as banks ready to invoke SDR Flipkart sells 1-mn products in 10 hours despite glitch India’s largest software services firm Tata Consultancy Services (TCS) has reported a 16 per cent surge in net profit to Rs 6,084.66 crore for the quarter (Q2) ended September 30. However, according to the company statement, as per IFRS, the net profit for Q2 stood at Rs 6,055.20 crore whereas revenues was Rs 27,165.50 crore.\nThe Mumbai-based firm had reported a profit of Rs 5,244.28 crore in the corresponding period last fiscal, it said in a regulatory filing.\nThe company’s total income from operations for the quarter rose 14.06 per cent to Rs 27,165.48 crore as against Rs 23,816.48 crore last year. The figures are in Indian GAAP.\nTCS CEO and MD N Chandrasekaran said: “We have delivered accelerated growth in constant currency terms for Q2. Driven by great execution on the ground, our broad-based performance has been led by strong sequential growth in BFS, retail and life sciences verticals with the UK and North America leading the markets.”\nThe company said core markets like the UK, North America and Europe grew smartly along with emerging markets like Latin America, India and MEA.\nAlso read: TCS Q2 results declared: CEO N Chandrasekaran’s top 5 Quote: s\nTCS also announced a dividend of Rs 5.50 per share. Its operating margin for the quarter stood at 27.1 per cent.\nThe company said there was a total gross addition of 25,186 people (net addition of 10,685 employees) taking the total employee strength of 3,35,620 on consolidated basis.\nThe utilisation rate (excluding trainees) was at 86 per cent while the attrition rate stood at 16.2 per cent.\n“On a quarterly basis, our retention levels have improved this quarter with a net addition of over 10,000 employees in Q2. Our hiring continues to be strong with all-time high of over 25,000 employees joining us this quarter,” said Ajoy Mukherjee Executive VP and Global Head Human Resources.\nCheck out TCS Q2 results big numbers: Top 10 key takeaways\nInfosys vs TCS: Check out the numbers below; read story\nInfosys July-Sep 2014 Apr-June 2015 Jul-Sep 2015 % QoQ % YoY Sales 13,342.00 14,354.00 15,635.00 8.92 17.19 Expenses 9,859.00 10,907.00 11,643.00 6.75 18.10 Other Income 877 758 793 4.62 -9.58 Net Profit 3,096.00 3,030.00 3,398.00 12.15 9.75 figures (consolidated) are in Rs crore\nTata Consultancy Services July-Sep 2014 Apr-June 2015 Jul-Sep 2015 % QoQ % YoY Sales 23,816.48 25,668.11 27,165.48 5.83 14.06 Expenses 17,016.08 18,472.96 19,373.23 4.87 13.85 Other Income 662.63 740.26 702.42 -5.11 6.00 Net Profit 5,244.28 5,684.12 6084.66 7.05 16.02 figures (consolidated) are in Rs crore Source: company, bse At the interaction with CEO & MD N Chandrasekaran, others:\nSpeaking to the media after announcing the key numbers, Tata Consultancy Services CEO & MD N Chandrasekaran said, “We have always performed better than the industry. We are happy with our performance in Q2. TCS added three clients in $100 million band. $10 million customers are up by 6 in Q2.”\nTCS chief painted a rosy picture and added, “We will be hiring. We are looking at building up the bench at TCS. We have increased hiring target to 75,000 from 60,000.”\nSpeaking with the same positive sentiment, he said, “Over 30,000 employees have already been trained in digital learning platform in Q2. Gross employee addition in Q2 was 25,186, taking total headcount to 335,620.”\nRajesh Gopinathan, chief financial officer (CFO) at TCS said the company is focused on fiscal discipline to help business growth. “Our focus on profitability has increased our margins sequentially and generated cash flows while investing in future growth,” he said.\nChandrasekaran said, “TCS has delivered a very secular growth. North America and UK in fact, have done exceeding well for us.”\nChandrasekaran laid emphasis on the fact that the company had delivered an accelerated growth in constant currency terms. “Given the growing market adoption of Digital, we continue to take new IP-led products and platforms to market successfully as well as invest in training our talent.” (In an IP-led strategy, technology companies such as TCS license the software they had developed and own rights for a fee, and also offer services around the software to clients. This helps them to improve their revenue and margins, since the same software can be licensed to many clients.)\nAlso read: TCS Q2 results: Top 10 key wins\nOn a query about dollar-rupee volatility, Chandrasekaran said, “This is no longer a dollar-rupee game for TCS. So many currencies are involved, Australian dollar, Brazilian real, Euro, and others. TCS is involved and affected by so many countries now”.\nOn attrition, Ajoy Mukherjee, Global Head, HR said, “Our retention levels have improved this quarter with a net addition of over 10,000 employees in Q2.”\nChandrasekaran added that, “TCS employee utilisation including trainees is at 82.3%; excluding trainees is 86% and employee attrition at 16.2% including BPS.”\nTCS chief added that, “Attrition in declining trend, seeing month-on-month decline.”\nTalking about the future and TCS’ strong/weak areas and expectations about the traditionally weak third quarter, Chandrasekaran said, “There are always some weak spots, some strong in every company, but overall we are doing very well. And, what I will say is, the opportunities are huge.”\nAhead of the earnings announcement, shares of TCS closed 0.19% higher at Rs 2,597.40 per stock while the benchmark S&P BSE Sensex ended 0.21% lower.\nHere are the key numbers:\n* Volumes, Digital drive broad-based growth in Q2\nRevenue at $4.16 billion up 3% Q-o-Q; up 5.8 % Y-o-Y\n– Net Income at $ 926 million up 3.2% Q-o-Q; up 6.2% Y-o-Y\n– Revenue growth in Constant Currency: 3.9% Q-o-Q\n– Robust Volume growth of 4.9%\nFinancial Highlights for Quarter Ended September 30, 2015\nOperating Profit at $ 1,125 million; Growth of 6.0% Q-o-Q and 6.7% Y-o-Y\n– Earnings Per Share at $ 0.47\nBusiness Highlights for Quarter Ended September 30, 2015\n– Gross employee addition: 25,186\n– Total headcount: 335,620\n– Utilization: 86 % (excluding trainees) & 82.3% (including trainees)\n– $100M+ Customers up by 3; $10M+ customers up by 6\n 13, 2015 5:20 pm © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-10-14T01:20:00.000+03:00", "crawled": "2015-10-13T23:07:47.812+03:00", "highlightTitle": ""}