{"organizations": [], "uuid": "c37faa6225e974bbc0a1ffd5149ad288d4b7f315", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/ed287da523b98e6d25d08475dbcd6fdf", "site_section": "http://www.news.com.au/finance/money/investing", "section_title": "Investing | Finance &amp; Investment News | News.com.au", "url": "http://www.news.com.au/finance/money/should-you-be-staying-away-from-shares-no-experts-say/story-e6frfmdr-1227552713685", "country": "AU", "title": "Should you stay away from shares", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Should you stay away from shares", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T01:12:00.000+03:00", "replies_count": 0, "uuid": "c37faa6225e974bbc0a1ffd5149ad288d4b7f315"}, "author": "ANTHONY KEANE", "url": "http://www.news.com.au/finance/money/should-you-be-staying-away-from-shares-no-experts-say/story-e6frfmdr-1227552713685", "ord_in_thread": 0, "title": "Should you stay away from shares", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Video Image Should I steer clear of shares? 2:14 Understanding market volatility\nSeptember 29th 2015 22 days ago /video/video.news.com.au/Lifestyle/ Don’t put all your eggs in one basket says John Lawler.\nANTHONY KEANE News Corp Australia Network SHARES can be scary, particularly if you feel sick watching the value of your assets shrink by almost 20 per cent over a few months.\nWhile the downturn in the Australian sharemarket this year has left many would-be investors running in the other direction, experts say the best buying opportunities are often times like these.\nCatapult Wealth financial planner John Lawler says the share sell-off reflects global uncertainty and people trying to predict the future, but “they’re still the same companies they were”.\n“If you just look at the dividends alone, the Australian market is paying probably twice the rate of income you would expect to get on a residential investment property,” he says.\nThe 5 per cent average dividend among major companies — which is closer to 8 per cent once you include tax credits from franking — is also much higher than savings account interest rates.\n“If you have money, you need to put it somewhere — under the mattress is going to get you no return.”\nOf course, cash and property don’t suffer the savage falls that we see in share prices. Lawler says at current levels, share prices are supported by their high dividends.\nHe says many big companies have been sold down because they announced downbeat outlooks at the recent profit reporting season. “Conservative guidance is easy to beat, and that’s when you get outperformance.”\nCOMPARE TERM DEPOSITS\nDon’t put all your eggs in one basket says John Lawler. Source: Supplied\nLow interest rates, low fuel prices and low wage inflation are all good for business. “Eventually it’s going to turn around,” Lawler says.\n“Don’t put all your eggs in one basket, always buy for the long term, and focus on the income which is more guaranteed than the capital.”\nWealth On Track principal Steve Greatrex also says a long-term perspective is vital for sharemarket investors.\n“Moving out of shares now is only going to crystallise a loss in many cases,” he says.\nFive-year outlooks for shares globally are much more positive than other investment classes such as bonds and cash, Greatrex says.\n“Now that the market has fallen, if you want to consider it, now is the time.”\nGreatrex says we are in a low-inflation and low-return world, and people will get better returns from shares than other asset classes but may need to lower their expectations.\n“Australians are continuing their love of property but not so much shares. People panic and they get into shares at the wrong time — when things are really great — and get out at the wrong time — when things are really bad — which doubles their losses.”\nOriginally published as Should you be shunning shares? Jump back to top\nbusiness breaking news 22:27 PM Newcrest shares down after output fall 18:42 PM Aldi plays with trendier store decor 16:57 PM Aurizon's haulage volumes fall 16:57 PM Customers to pay for FSI recommendations 16:48 PM Positive start to year for Beacon Lighting", "external_links": ["http://mozo.com.au/credit-cards", "http://news-assets.mozo.com.au/images/mozo-powered-mini.gif", "http://cdn.newsapi.com.au/image/v1/origin:fatwire.", "http://cdn.newsapi.com.au/image/v1/ed287da523b98e6d25d08475dbcd6fdf", "http://moneysaverhq.com.au/campaign/term-deposits#itm_t=story&itm_l=shares-keane", "http://widgets.mozo.com.au/news/n-business", "http://pages.e.newsdigitalmedia.com.au/GPC?a=News", "http://cdn.newsapi.com.au/image/v1/external?url=http%3A%2F%2Fcontent6.video.news.com.au%2FJ3bDl0dzpZWo93IUON_vV0vnUNuUdqQa%2Fpromo267758453&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://cdn.newsapi.com.au/link/7cc3dd551b40b6217b93ca987622b8aa?domain=newscorpaustralia.com", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-10-02T01:12:00.000+03:00", "crawled": "2015-10-20T17:18:46.481+03:00", "highlightTitle": ""}