{"organizations": ["MAS INTL FCStone’s Subsidiary Granted Capital Markets Services License", "MAS INTL FCStone Pte.", "Bloomberg"], "uuid": "47660fa19331a6ed9bad0b42ab4a719ddfad168f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/10/217577620.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/regulation/intl-fcstones-subsidiary-granted-capital-markets-services-license-by-mas/", "country": "US", "title": "INTL FCStone’s Subsidiary Granted Capital Markets Services License by MAS", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "INTL FCStone’s Subsidiary Granted Capital Markets Services License by MAS", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T19:29:00.000+03:00", "replies_count": 0, "uuid": "47660fa19331a6ed9bad0b42ab4a719ddfad168f"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/regulation/intl-fcstones-subsidiary-granted-capital-markets-services-license-by-mas/", "ord_in_thread": 0, "title": "INTL FCStone’s Subsidiary Granted Capital Markets Services License by MAS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "INTL FCStone’s Subsidiary Granted Capital Markets Services License by MAS INTL FCStone’s Subsidiary Granted Capital Markets Services License by MAS INTL FCStone Pte.’s new MAS license will help the group expand its regional capabilities and personnel to meet a growing demand. Advertising Print This Post Photo: Bloomberg \nINTL FCStone Inc. (NASDAQ:INTL), a provider of financial services across multiple asset classes, has announced that its Singapore-based subsidiary, INTL FCStone Pte. Ltd., has received a Capital Markets Services License from the Monetary Authority of Singapore (MAS), according to an INTL FCStone statement. \nINTL FCStone Pte.’s new MAS license will help the group expand its regional capabilities and personnel in a collective effort to ultimately keep up with an increasing demand for commodity risk management services. Currently, the subsidiary provides its Asia-based customers with access to global markets via INTL FCStone’s widespread offering of financial services. However, the MAS license now grants a higher degree of latitude over the activity of trading in futures contracts, namely those relegated to the energy, metals and agricultural markets. \nAccording to Peter Rizzo, Deputy Chief Executive Officer, Asia, for the INTL FCStone Inc. group of companies, in a recent statement on the license, “Singapore is considered a global hub for the trading and broking of commodities given its proximity to key markets. This CMS license represents a critical step in our business development not just our business in Singapore, but also for all our business in Asia and around the world. We must thank the MAS for the opportunity the license represents.” \n“We are growing our Asia operations from Singapore and this license gives us the ability to build on that growth. We have assembled a very talented team and can now expand the delivery and range of the products and services offered to our customers. The team’s expertise spans the entire range of commodities including energy, softs, agricultural, metals and tropical oils,” added David Pike, Managing Director with INTL FCStone Pte. Ltd. in Singapore, in an accompanying statement. \nYesterday, INTL FCStone (NASDAQ:INTL) made headlines after it appointed Arlan Suderman as the newest member of its research team , INTL FCStone Financial Inc. Consequently, Mr. Suderman will be joining INTL FCStone Financial Inc.’s FCM division as its Chief Commodities Economist following a lengthy career in commodity market analysis, spanning over seventeen years. Got a news tip? Let Us Know FOUND A MISTAKE", "external_links": [], "published": "2015-10-21T19:29:00.000+03:00", "crawled": "2015-10-21T16:55:30.156+03:00", "highlightTitle": ""}