{"organizations": [], "uuid": "5905813b326d165f1648a7121600c456b5788433", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/k/6/5/r/d/image.related.afrArticleLead.620x365.gk9js6.png/1445218365567.jpg", "site_section": "http://www.afr.com/personal-finance", "section_title": "Personal Finance News | afr.com", "url": "http://www.afr.com/personal-finance/no-debate-that-the-next-crisis-can-come-from-anywhere-20151014-gk9js6", "country": "AU", "title": "No debate that the next crisis can come from anywhere", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "No debate that the next crisis can come from anywhere | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T08:59:00.000+03:00", "replies_count": 0, "uuid": "5905813b326d165f1648a7121600c456b5788433"}, "author": "Jeremy Chunn", "url": "http://www.afr.com/personal-finance/no-debate-that-the-next-crisis-can-come-from-anywhere-20151014-gk9js6", "ord_in_thread": 0, "title": "No debate that the next crisis can come from anywhere", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So much wisdom was sparking off debating teams at a recent conference on dysfunctionality in capital markets that was was worth noting. Mark Cini by Jeremy Chunn A conference on dysfunctionality in capital markets might not seem an obvious place to gather tips for everyday investors. However, so much wisdom was sparking off members of debating teams asked to reflect on the reign of former US Federal Reserve chairman Alan Greenspan that Smart Investor decided to take notes.\nIn a lecture hall, amid the hurly-burly of the University of Technology Sydney's Frank Gehry-designed crumpled-paper-bag building, a small audience of wealth industry propellerheads caught their breath between a keynote address on dark trading and lunch with a quick to-and-fro about Greenspan's 2004 claim that \"not only have individual financial institutions become less vulnerable to shocks ... but the financial system as a whole has become more resilient.\" Is it spot on, or a load of rot?\nSmart Investor 's recorder caught the action, which included swipes at bankers, regulators, journalists, all humankind and Ayn Rand.\nON THE AFFIRMATIVE\nGraham Harman, senior investment strategist Asia-Pacific, Russell Investments\n\"In an uncertain world one thing you can bet on is that whatever went wrong last time there was a crisis is not the thing that's going to go wrong this time there's a crisis … crises are a design feature of capitalism.\"\n\"Many of the older bankers here will have grown up on 3-6-3 banking: you borrow at 3 per cent, you lend at 6 per cent and you go home at 3 o'clock. That model has just suffered six years of a blowtorch to the belly, with zero interest rates. But [bankers] have survived, and clearly they are alive and well.\"\nTom Valentine, adjunct professor of finance, MGSM Macquarie University\n \"The global financial crisis in by view was a failure of the regulators in the US. They allowed bad lending. They didn't regulate credit rating agencies properly, and probably still haven't. And they allowed people to function out of tax havens.\"\n\"I basically agree with the statement but the fact it was attached to Greenspan is a bit embarrassing … I am prepared to defend that statement if you just forget who said it.\"\nON THE NEGATIVE\nBrian Parker, chief economist, Sunsuper\n\"Maybe not everybody is stupid but we are all human. The sad reality is the more the good times roll the more people base their financial decisions on those good times continuing to roll. They take more and more risks … and eventually it ends in tears. Has that changed since 2004? No, it hasn't. Will there be another financial crisis at some point to rival the GFC? Yes, there will. … As long as we have a system that is run by human beings, it cannot be more resilient than the system we had in 2004.\"\n\"The next [financial] crisis is really only a matter of time. The system has not changed fundamentally, people have not changed fundamentally and the resilience has not improved.\"\nRoss Barry, head of research, First State Super\n\"In Greenspan's linear reductionist world there is a symphony of market clearing mechanisms, where everyone has rational expectations, full knowledge of the system and [there exists a] seamless artistry of all these agents shifting risk from people who have it and don't want it to the people who supposedly are looking for it … Would we describe as efficient the same seamless artistry of Wall Street … in spawning the structured credit boom? A lot of those things finished up in the balance sheet of my local council, who could only invest in AAA securities.\"", "external_links": [], "published": "2015-10-19T08:59:00.000+03:00", "crawled": "2015-10-19T13:06:16.601+03:00", "highlightTitle": ""}