{"organizations": [], "uuid": "894b5cce3c48fde7d34afd37d84f90991d841e3b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/1/0/6/6/x/a/image.related.articleLeadwide.620x349.gk4a2a.png/1444284319559.jpg", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2530/consumer-discretionary/consumer-services", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/banking-and-finance/calls-grow-for-government-to-release-fsi-response-20151008-gk4a2a.html", "country": "AU", "title": "Calls grow for government to release FSI response", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Calls grow for government to release FSI response", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "894b5cce3c48fde7d34afd37d84f90991d841e3b"}, "author": "", "url": "http://www.smh.com.au/business/banking-and-finance/calls-grow-for-government-to-release-fsi-response-20151008-gk4a2a.html", "ord_in_thread": 0, "title": "Calls grow for government to release FSI response", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Professor Kevin Davis says banks focused on customer interests shouldn't worry about ASIC getting new powers. Photo: Michel O'Sullivan\nFinancial system inquiry panel member Kevin Davis has urged Treasurer Scott Morrison to release the government's response to the inquiry and says banks serving customer interests should not fear new ASIC powers that could allow the regulator to temporarily ban certain financial products.\nThe federal government's response to the FSI, chaired by David Murray, was due to be released the morning after the Liberal party room voted to change the leadership.\nYou would hope that entities that have concerns about their long term reputation will have in place practices to identify whether products are appropriate to the groups they are being sold to.\nKevin Davis Publication of the response, prepared by former assistant treasurer Josh Frydenberg, has been delayed as Mr Morrison and Assistant Treasurer Kelly O'Dwyer get on top of their new responsibilities. The government has not indicated when it will be released.\n\"Hopefully, the change of Treasurer won't lead to much change in the government's response, but we will see,\" said Professor Davis, a professor at Melbourne and Monash universities.\nAdvertisement Mark Degotardi, the chief executive of the Customer Owned Banking Association, backed Professor Davis' call. \"The government needs to move decisively to respond formally to the FSI,\" Mr Degotardi said.\nCOBA successfully lobbied for the government to drop an initial fee for deposit insurance as recommended by the inquiry.\nClear signal Mr Degotardi said while regulators and policy makers had started the process of implementing other reforms based on the FSI, \"they need a clear signal from the government that more competition and better consumer protections are a clear priority and that the reforms to the financial services sector must continue.\"\nAmid expectations that the government may back-peddle from the inquiry's call for self managed super funds to be prevented from borrowing to buy property, Professor Davis said the lack of leverage in the super system was one of the key factors that protected Australia from the ravages of the global financial crisis.\nHe said the controversial recommendation for ASIC to be given power to temporarily ban certain financial products should be read alongside the call for banks to be forced to demonstrate that products are suitable for the customers they are targeting.\n\"You would hope that entities that have concerns about their long-term reputation will have in place practices to identify whether products are appropriate to the groups they are being sold to, so that type of action by ASIC [banning products] would never happen.\"\nThe Australian Bankers' Association supported a targeted product intervention power where there was a risk of significant detriment or harm to consumers but said they must be based on a clear and defined policy intent and avoid introducing unnecessary legal and regulatory complexities and costs.\nABA chief economist Tony Pearson said on Thursday a key objective of the government's response to the financial system inquiry \"must be to ensure the banking system continues to serve Australia as well in the future as it has in the past\" and \"to ensure banks continue to play their part in Australia's growth, the burden of government regulation and tax should be kept as low as possible.\n\"With the right policy settings, the banking industry believes that Australia can respond to our economic challenges and opportunities and we will play our part in achieving this.\"", "external_links": [], "published": "2015-10-08T03:00:00.000+03:00", "crawled": "2015-10-08T10:23:17.227+03:00", "highlightTitle": ""}