{"organizations": [], "uuid": "d593975dcff456a76d1b5e5b0050c4addf01052d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/WABV3C_4lfRKQ.PA6dxlxA--/YXBwaWQ9eW5ld3NfbGVnbztpbD1wbGFuZTtxPTc1O3c9NjAw/http://globalfinance.zenfs.com/images/US_AHTTP_REUTERS_OLUSBUS_WRAPPER_H_LIVE_NEW/2015-10-24T215118Z_1_LYNXNPEB9N0EN_RTROPTP_3_USA-ELECTIONS-ILLINOIS_original.jpg", "site_section": "http://finance.yahoo.com/rss/topstories", "section_title": "Yahoo! Finance: Top Stories", "url": "http://finance.yahoo.com/news/misshapen-budget-priorities-center-stage-215118237.html?l=1", "country": "GB", "title": "Misshapen budget priorities take center stage in Illinois", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Misshapen budget priorities take center stage in Illinois - Yahoo Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-25T02:00:00.000+02:00", "replies_count": 0, "uuid": "d593975dcff456a76d1b5e5b0050c4addf01052d"}, "author": "yahoo", "url": "http://finance.yahoo.com/news/misshapen-budget-priorities-center-stage-215118237.html?l=1", "ord_in_thread": 0, "title": "Misshapen budget priorities take center stage in Illinois", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ". View photo\nRepublican Bruce Rauner smiles after winning the midterm elections in Chicago, Illinois, November 4, 2014. REUTERS/Jim Young By Dave McKinney\nCHICAGO (Reuters) - To see the fickle fiscal state of affairs in cash-strapped Illinois, you need look no further than how the musical acts Styx, Sammy Hagar and Hank Williams Jr got paid for performing at the state fair in August, but the woman who sculpted the event’s life-sized butter cow did not.\nNearly five months into a budget impasse pitting new Republican Governor Bruce Rauner against long-serving Democratic House Speaker Michael Madigan, Illinois is deep into uncharted territory.\nVendors are paid, or denied payment, at the behest of obscure laws or on demand from state and federal courts, resulting in misshapen priorities between the budgetary haves and have-not's.\nA provision in state law, for example, allows grandstand acts to be paid up-front, enabling Rauner’s administration to authorize more than $2 million in expedited payments to 20 performers, state records show. \nBut Sharon BuMann, the New York butter sculptor who for 14 years has carved a cow from a large block of butter at the state's fair is considered a vendor, and that status sent her invoice into an unpaid pile that has reached $7 billion.\nDespite the state's not having a spending plan, court orders and other mandated spending have put Illinois on a trajectory to exceed Rauner’s proposed $32 billion budget by $5 billion. And the state comptroller, who must pay the bills, has warned that Illinois will miss a $560 million pension payment next month if the stalemate persists. \nThe state's decision not to pay BuMann's $2,500 bill even as it dispensed tens of thousands of dollars to musical performers has left her frustrated.\n“It’s not fair. I do performance art, too,” BuMann said. “They don’t spend their time in refrigeration for 30 or 40 hours at a time, all week long. They just perform something they do all the time.\"\nMedalists for prize-winning pigs, cows and quilts haven’t received their prize money either, a spokeswoman for the state Department of Agriculture said. \n\"The ridiculousness of Sammy Hagar and these guys getting paid first is just a symptom of our dysfunction,” said state Representative Jack Franks, a veteran Democrat from far northwest suburban Chicago.\nThe state's fiscal meltdown has drawn notice from Moody's Investor Services and Fitch Ratings, which this week both downgraded Illinois’ credit rating, citing the budget impasse, the growing inventory of unpaid bills and the state's dismally funded pension systems.\nThe range of unpaid vendors and service providers is as broad and varied as Illinois itself.\nA janitorial firm, owed about $114,000 for cleaning the atrium in the state’s main Chicago office building, the James R. Thompson Center, walked away from its contract in mid-October. And lottery winners sued last month after the state-run lottery failed to make timely payment on $288.4 million in winnings.\nRauner has taken cost-cutting steps. This summer, Rauner sold five state planes, banking $2.5 million, and grounded aircraft that ferried politicians on the 200-mile trip between Chicago and the state capital in Springfield. And earlier this month, he proposed selling the Thompson Center to save $12 million a year in operating costs. \nRauner has said he will not sign any budget until after the legislature approves his \"turnaround agenda\" that seeks to weaken public-employee unions and impose other business-friendly changes. But Democrats who control the state legislature have balked at those demands, leaving the state without a budget as pressure mounts on vendors and social-service networks.\nNumerous social service agencies that depend on state funding say they are facing shutdowns if the budget impasse is not resolved. The Sexual Assault Counseling and Information Service, a rape counseling agency in the campus town of Charleston, expects to close in three weeks without a budget deal freeing up about $240,000 in expected state funding, the agency told Reuters.\nErin Walters, the group’s executive director, wondered aloud about priorities that determined musicians would be paid while her organization is left to contemplate closing for the first time since its 1977 founding.\n“That is so disheartening on so many levels because we’re placing such a high value on being entertained for a moment,\" Walters said. \"It seems selfish for that to be a priority when we have so many other social services suffering right now.\"\nBut Rauner spokeswoman Catherine Kelly said performers netted the fair a $38,000 profit. She blamed the overall budget meltdown on “the Democratic supermajority that controls the legislature [that] has repeatedly refused to consider any of the governor’s reforms.”\nMadigan’s camp acknowledged paying musical acts up front is important to recruit top-shelf entertainment but hit Rauner for the mess. “Programs … where people have had to shut down or cut back all [are] totally in his court,” Madigan spokesman Steve Brown said.\nThose dealing with Illinois might learn from the cash-and-carry approach recognized as standard practice in the music industry and long accepted by earlier Illinois administrations to draw interest in fairs that are favorite campaign venues for politicians.\nCharlie Brusco, manager for the 1970s rock band Styx, said the group collected its $75,000 payment before the bus carrying lead singers James “JY” Young and Tommy Shaw and their band left the state fairgrounds.\n\"We always leave the venue with our money,\" Brusco said.\n\n(Reporting by Dave McKinney; Editing by David Greising and Sue Horton)\nIllinois Bruce Rauner Michael Madigan Sammy Hagar", "external_links": [], "published": "2015-10-25T02:00:00.000+02:00", "crawled": "2015-10-25T01:35:20.840+03:00", "highlightTitle": ""}