{"organizations": [], "uuid": "cb6df04fd84d9e52a567f6f526799bce5613f6f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "thehill.com", "main_image": "http://thehill.com/sites/default/files/article_images/cbo1.jpg", "site_section": "http://thehill.com/taxonomy/term/30/feed#", "section_title": "The Hill: Finance Policy", "url": "http://thehill.com/policy/finance/256933-cbo-backs-up-treasurys-nov-5-debt-limit-deadline", "country": "US", "title": "CBO backs up Treasury's Nov. 5 debt limit deadline", "performance_score": 0, "site": "thehill.com", "participants_count": 1, "title_full": "CBO backs up Treasury's Nov. 5 debt limit deadline", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T21:55:00.000+03:00", "replies_count": 0, "uuid": "cb6df04fd84d9e52a567f6f526799bce5613f6f8"}, "author": "pschroeder@thehill.com (Peter Schroeder)", "url": "http://thehill.com/policy/finance/256933-cbo-backs-up-treasurys-nov-5-debt-limit-deadline", "ord_in_thread": 0, "title": "CBO backs up Treasury's Nov. 5 debt limit deadline", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CBO backs up Treasury's Nov. 5 debt limit deadline Getty images By Peter Schroeder - 10/14/15 02:55 PM EDT \nThe Congressional Budget Office gave credence Wednesday to the Nov. 5 debt-limit deadline set by the Treasury Department, saying the government will likely not be able to pay all its bills some time in the first half of November. \nThe independent CBO's report bolsters the deadline set by Treasury Secretary Jack Lew, who told lawmakers at the beginning of October that he would run out of accounting tricks to stay under the borrowing cap on Nov. 5, leaving the government just its cash on hand to pay bills, which Lew warned would go quickly. \nWhen Lew set that deadline, several Republicans expressed skepticism about the timing. Previous estimates from in and outside the government had projected the government would likely need a boost to the $18.1 trillion borrowing cap sometime later in November, or perhaps even December. \nGiven the turmoil among House Republicans, some wondered if the earlier deadline was meant to nudge outgoing Speaker John Boehner (R-Ohio) to deal with the debt limit before he steps down at the end of the month. The CBO said it was releasing the report “in response to congressional interest.” \nBut the Treasury said its tax receipts had come in lower than expected and some investments in military trust funds were higher than anticipated. As a result, the government was facing a cash crunch sooner than anticipated, giving Congress just a few weeks to hammer out a debt-limit deal. \nFurthermore, Lew's deadline established when the Treasury would have exhausted its \"extraordinary measures\" to maneuver beneath the debt limit, not when it would miss a payment. After Nov. 5, Lew warned, the government would be at risk for missing a payment in the near future, given that only existing cash reserves would be available. \nThe CBO’s new findings could tamp down speculation that Congress might have significantly more time to wrangle over the debt limit. And it could help increase the odds that Boehner will deal with the debt limit before leaving office. \nAnd the CBO’s findings also agree with outside analysis. The Bipartisan Policy Center, which tracks the debt-limit deadline closely, has projected that the government will miss some sort of government payment between Nov. 10 and 19 without additional borrowing room.", "external_links": [], "published": "2015-10-14T21:55:00.000+03:00", "crawled": "2015-10-15T05:12:08.685+03:00", "highlightTitle": ""}