{"organizations": ["Delek Group"], "uuid": "ce5396bd199ff724f596967aab5a06093a7913cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/israels-delek-group-eyes-london-121529577.html", "country": "GB", "title": "Israel's Delek Group eyes London share listing in 2016-source", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Israel's Delek Group eyes London share listing in 2016-source", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T15:15:00.000+03:00", "replies_count": 0, "uuid": "ce5396bd199ff724f596967aab5a06093a7913cd"}, "author": "", "url": "https://uk.finance.yahoo.com/news/israels-delek-group-eyes-london-121529577.html", "ord_in_thread": 0, "title": "Israel's Delek Group eyes London share listing in 2016-source", "locations": ["Israel", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0.00 \nBy Steven Scheer \nJERUSALEM, Oct (HKSE: 3366-OL.HK - news ) 13 (Reuters) - Israeli conglomerate Delek Group could list on the London Stock Exchange (Other OTC: LDNXF - news ) as soon as in 2016 as part of a strategy to become a global oil and gas exploration firm, a source close to the company said on Tuesday. \nDelek had planned a London listing in mid-2015 but halted the process due to energy market volatility and regulatory issues in Israel. \nIsrael's anti-competition regulator had ruled that two large natural gas fields, Leviathan and Tamar, largely owned by Delek and Noble Energy (NYSE: NBL - news ) , were a monopoly, since both companies would control most of Israel's gas reserves. \nA deal was subsequently reached that would allow Noble and Delek to keep ownership of Leviathan, but they would have to sell other assets, including stakes in neighbouring Tamar. \nParliament has given its nod to the deal, but it still needs to be finalised and signed. Issues relating to the powers of Israel's competition regulator in relation to the ownership of the field also need to be resolved, but Delek expects this to happen soon, the source said. \n\"After the roadmap is approved and signed, which we believe will happen in the next couple of weeks, you will see the process of listing Delek Group (Other OTC: DGRLY - news ) in London start to move forward,\" the source told Reuters, without giving any further details such as how much money the company planned to raise. \nThe source said Delek had been reassured by comments from Prime Minister Benjamin Netanyahu and Energy Minister Yuval Steinitz that they will do what they can for the deal to be implemented. \n\"Their support in the roadmap for the Israeli economy also supports the intention of Delek in 2016 to list in London,\" the source said. \nAs part of the listing plan, foreign banks had told Delek it needed to focus solely on energy. Delek has since sold off most of its auto, real estate and financial services businesses. \nLast week, Delek's investment arm bought a near 20 percent stake in North Sea-focused oil producer Ithaca Energy (Other OTC: IACAF - news ) for $66 million. \n\"This has been on our radar for quite a while,\" the source said, noting the Ithaca deal was one of many steps the company would like to do. \"We are the biggest shareholder in Ithaca with almost 20 percent and we shall consider increasing it.\" \nThe source said buying a stake in Ithaca \"leaves the door open for other opportunities, including operating in our own gas discoveries.\" (Editing by David Holmes)", "external_links": [], "published": "2015-10-13T15:15:00.000+03:00", "crawled": "2015-10-13T16:01:53.103+03:00", "highlightTitle": ""}