{"organizations": ["GSMA", "United Arab Emirates Mobile", "Gulf Cooperation Council"], "uuid": "340785037973fc660666ed49d9fea171948d668b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/cat-business-finance.xml", "section_title": "BusinessWire India.com - Business/ Finance", "url": "http://businesswireindia.com/news/news-details/new-gsma-study-sees-accelerating-mobile-broadband-smartphone-adoption-across-arab-states/45771", "country": "US", "title": "New GSMA Study Sees Accelerating Mobile Broadband and Smartphone Adoption across the Arab States", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "New GSMA Study Sees Accelerating Mobile Broadband and Smartphone Adoption across the Arab States", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T12:00:00.000+03:00", "replies_count": 0, "uuid": "340785037973fc660666ed49d9fea171948d668b"}, "author": "", "url": "http://businesswireindia.com/news/news-details/new-gsma-study-sees-accelerating-mobile-broadband-smartphone-adoption-across-arab-states/45771", "ord_in_thread": 0, "title": "New GSMA Study Sees Accelerating Mobile Broadband and Smartphone Adoption across the Arab States", "locations": ["UAE", "Arab States Dubai", "Arab States", "Bahrain", "North Africa", "Yemen", "Syria", "Dubai", "Sudan", "Kuwait", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex Sinclair", "Sinclair"], "text": "Tuesday, October 20, 2015 2:30PM IST (9:00AM GMT) New GSMA Study Sees Accelerating Mobile Broadband and Smartphone Adoption across the Arab States Mobile Operators Investing in Networks, Jobs and Innovation Throughout the Arab States Dubai, United Arab Emirates Mobile broadband networks will support more than two-thirds of all mobile connections across the Arab States of the Middle East and North Africa by 2020, according to a new GSMA study published at the GSMA Mobile 360 Series – Middle East conference being held in Dubai this week. The new study, ‘The Mobile Economy – Arab States 2015’, finds that there will be 350 million 3G/4G mobile broadband connections in the Arab States by 2020, accounting for 69 per cent of the region’s total connections by 2020, up from just 34 per cent at the end of 2014 1 . This rapid migration to higher-speed mobile networks is being driven by operator investments in 3G and 4G networks and rising smartphone adoption. The number of smartphones connections 2 in the region is forecast to almost triple between 2014 and 2020, reaching 327 million. “The mobile landscape in the Arab States varies considerably in terms of market maturity, ranging from the fast-developing North African markets to the highly advanced Gulf Cooperation Council (GCC) states, but the entire region is benefiting from the shift to mobile broadband networks and devices triggered by rising mobile operator investment,” said Alex Sinclair, Acting Director General and Chief Technology Officer at the GSMA . “We encourage governments in the region to adopt policies that will further accelerate mobile broadband adoption, for example by releasing more internationally harmonised spectrum; introducing incentives that encourage the deployment of infrastructure in remote and economically challenging areas; and revising taxation and regulatory policies that can negatively impact uptake of innovative new mobile services.” Over the last four years, mobile operators across the Arab States have spent more than US$40 billion on capital investments, or approximately 18 per cent of total revenue. Investments have focused on improving network coverage, increasing network capacity, and deploying 3G/4G mobile broadband networks. According to the report, 3G networks are now live in every country in the region except one, while there are 23 live 4G networks in ten countries in the region and 4G launches planned in a further eight markets. A Diverse Mobile Landscape The Arab States encompasses 18 markets across the Middle East and North Africa 3 . The number of unique mobile subscribers 4 in the Arab States as a whole reached 199 million at the end of 2014, equivalent to 54 per cent of the region’s population. However, the levels of market maturity vary considerably across the region in line with economic development; the Arab States are home to three countries – Bahrain, Kuwait and the UAE – that have penetration rates above 75 per cent, but also four (Palestine, Sudan, Syria and Yemen) where fewer than half the population has a mobile subscription. It is forecast that the number of unique mobile subscribers in the Arab States will reach 233 million by 2020, representing 57 per cent of the expected population by this point. However, subscriber growth will be slower than the global average over this period and subscriber penetration will fall behind the 59 per cent global figure expected by 2020. This can be attributed to several factors: the declining growth potential in already highly penetrated markets; the challenge of growing penetration in the lower income and rural-based groups in less developed markets; and the unstable political and economic conditions that currently exist in several regional markets. Mobile Industry Delivering Economic Growth, Employment and Public Funding In 2014 the mobile industry in the Arab States made a total contribution of US$115 billion to the regional economy in value-added terms, equivalent to around 4 per cent of the region’s total GDP 5 . It is forecast that this contribution will grow to U$160 billion by 2020, equivalent to 4.5 per cent of projected regional GDP by this point. The mobile industry is also a key source of jobs and public funding in the region. It is calculated that the industry directly and indirectly supported 1.3 million jobs across the Arab States in 2014, a figure expected to surpass 1.5 million by 2020. The mobile ecosystem also made a total tax contribution to the public finances of the region’s governments of US$12.6 billion in 2014, excluding regulatory fees and spectrum auction payments. It is forecast that this contribution to public funding will rise to US$14.3 billion by 2020. “The mobile industry has a pivotal role to play in addressing social and developmental challenges in the Arab States, challenges that are becoming increasingly acute in those regional markets that are seeing high unemployment levels, a youthful population, and ongoing social and political instability,” added Sinclair. “In many of the region’s emerging markets, mobile is connecting unconnected populations by providing essential access to the internet where there are no other alternatives and enabling mobile-powered solutions in essential areas such as banking, healthcare and education. Meanwhile, in developed markets, mobile operators are launching advanced services in sectors such as digital commerce, digital identity, digital security and the Internet of Things.” To access the full report and related infographics please visit: http://www.gsmamobileeconomy.com/arabstates/ .", "external_links": [], "published": "2015-10-20T12:00:00.000+03:00", "crawled": "2015-10-20T12:49:27.549+03:00", "highlightTitle": ""}