{"organizations": [], "uuid": "b87bbdd004849ce1606728183edaaba6822628d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "sg.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=NVS", "section_title": "Yahoo! Finance: NVS News", "url": "https://sg.finance.yahoo.com/news/novartis-flags-margin-increase-higher-112431412.html", "country": "US", "title": "Novartis flags margin increase, higher dividends, bolt-on deals - Yahoo Singapore Finance", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Novartis flags margin increase, higher dividends, bolt-on deals - Yahoo Singapore Finance", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "b87bbdd004849ce1606728183edaaba6822628d2"}, "author": "Reuters", "url": "https://sg.finance.yahoo.com/news/novartis-flags-margin-increase-higher-112431412.html", "ord_in_thread": 0, "title": "Novartis flags margin increase, higher dividends, bolt-on deals - Yahoo Singapore Finance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ZURICH (Reuters) - Novartis AG (NOVN.VX) said on Thursday it expects to increase its profit margin this year as it restructures its drug portfolio and cuts costs, as well as generate cash for a higher dividend and smaller, strategic acquisitions. \n\"While we continue to improve productivity and generate leverage, our capital allocation priorities remain the same: investing in the existing business, growing the annual dividend, bolt-on acquisitions, and share buybacks,\" the Basel-based drugmaker said in a statement. \nNovartis, the world's biggest supplier of prescription \ndrugs by sales, is briefing investors about prospects at its research centre in Boston later on Thursday.\nThe drugmaker is in a strong position relative to its peers thanks to recent advances with new drugs, including the widely anticipated heart failure medicine LCZ696 and a recently launched psoriasis injection called Cosentyx.\nThese should buffer it from cheaper copycat competition to older drugs.\nIn particular LCZ696, which could win U.S. approval this summer, is forecast to become a huge seller over time, although its initial commercial take-off may be gradual as Novartis has to educate doctors about its benefits over cheaper existing drugs.\nThe drugmaker is also raising its bet in cancer treatments, after completing an asset swap earlier this year with GlaxoSmithKline (GSK.L), which has seen it take over the British company's marketed oncology drugs.\nAnd it is broadening its work to harness the body's immune system to fight tumours in different ways, building on its leading position in a cell-based immunotherapy approach known as CAR-T. [ID:nL5N0YU3L8]\nMany industry experts expect various kinds of cancer immunotherapy to eventually generate tens of billions of dollars in annual sales.\nUnlike many rivals, Novartis maintains a diversified approach to healthcare and the company is also a dominant player in eyecare, through its Alcon unit, and in off-patent generic medicines, sold by the Sandoz business.\nSandoz is now chasing new opportunities to market cut-price versions of expensive biotech medicines, known as 'biosimilars', that industry analysts expect to account for a growing share of prescriptions in the coming years.\n\n(Reporting by Katharina Bart and Ben Hirschler; Editing by Kenneth Maxwell)", "external_links": [], "published": "2015-10-02T03:00:00.000+03:00", "crawled": "2015-10-02T01:56:44.696+03:00", "highlightTitle": ""}