{"organizations": ["Provident Financial Holdings, Inc", "California Housing Finance Agency Opens All Loan Programs to Mortgage Brokers California Housing Finance Agency Opens All Loan Programs"], "uuid": "6c591f44dab29f97ab35a79d5a07e0e4e0b9b08f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/industry/8779/Mortgage%20Finance", "section_title": "GlobeNewswire: Industry News on Mortgage Finance", "url": "http://globenewswire.com/news-release/2015/10/05/773601/0/en/California-Housing-Finance-Agency-Opens-All-Loan-Programs-to-Mortgage-Brokers.html?f=22&fvtc=3&fvtv=8779", "country": "US", "title": "California Housing Finance Agency Opens All Loan Programs to Mortgage Brokers", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "California Housing Finance Agency Opens All Loan Programs to Mortgage Brokers", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T01:00:00.000+03:00", "replies_count": 0, "uuid": "6c591f44dab29f97ab35a79d5a07e0e4e0b9b08f"}, "author": "", "url": "http://globenewswire.com/news-release/2015/10/05/773601/0/en/California-Housing-Finance-Agency-Opens-All-Loan-Programs-to-Mortgage-Brokers.html?f=22&fvtc=3&fvtv=8779", "ord_in_thread": 0, "title": "California Housing Finance Agency Opens All Loan Programs to Mortgage Brokers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "California Housing Finance Agency Opens All Loan Programs to Mortgage Brokers October 05, 2015 18:00 ET | Source: Provident Financial Holdings, Inc. \nRIVERSIDE, Calif., Oct. 05,   Provident Financial Holdings, Inc. (“Company”), (NASDAQ: PROV ), the holding company for Provident Bank (“Bank”), today announced that Provident Bank Mortgage, a division of the Bank, will initially be the EXCLUSIVE Wholesale Lender for the California Housing Finance Agency (“CalHFA”). On September 25, 2015, CalHFA announced that they will be allowing mortgage brokers to participate in all residential loan programs offered by the agency. Provident Bank Mortgage will initially be the exclusive Wholesale Lender for the CalHFA programs. Effective October 15, 2015 CalHFA’s first mortgages, both FHA and conventional, and subordinate loan programs will become available to the California broker community, including the newly implemented My Home Assistance program which takes the place of the recently discontinued CHDAP program. Any broker who is interested in offering a competitive down payment assistance program for low-moderate income borrowers located in the state of California should contact Provident Bank Mortgage to become eligible for the programs. For further information, please contact David Seaton, Vice President of Wholesale and Correspondent Lending at (925) 621-2645. Southern California brokers can contact Christina Hosseini, Provident Bank Mortgage Regional Wholesale Manager at (909) 980-3657 x17150. Provident Bank Mortgage is a division of Provident Savings Bank, F.S.B., NMLS #449980. Equal Housing Lender. Safe-Harbor Statement Certain matters in this News Release may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements may relate to, among others, expectations of the business environment in which the Company operates, projections of future performance, perceived opportunities in the market, potential future credit experience, and statements regarding the Company’s mission and vision. These forward-looking statements are based upon current management expectations, and may, therefore, involve risks and uncertainties. The Company’s actual results, performance, or achievements may differ materially from those suggested, expressed, or implied by forward-looking statements as a result of a wide range of factors including, but not limited to, the general business environment, interest rates, the California real estate market, competitive conditions between banks and non-bank financial services providers, regulatory changes, and other risks detailed in the Company’s reports filed with the Securities and Exchange Commission, including its Annual Report on Form 10-K for the fiscal year ended June 30, 2015. Craig G. Blunden Chairman and Chief Executive Officer Donavon P. Ternes President, Chief Operating Officer, and Chief Financial Officer (951) 686-6060 Related Articles", "external_links": [], "published": "2015-10-06T01:00:00.000+03:00", "crawled": "2015-10-06T04:14:35.660+03:00", "highlightTitle": ""}