{"organizations": [], "uuid": "4038137563f6fb052b71f1796657fd44f8f43fe0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/z/7/m/d/image.related.afrArticleLead.620x365.gjypvd.png/1443748076997.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/the-pm-may-find-that-free-advice-comes-at-a-high-cost-20151001-gjypvd", "country": "AU", "title": "The PM may find that free advice comes at a high cost", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The PM may find that free advice comes at a high cost | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-01T15:55:00.000+03:00", "replies_count": 0, "uuid": "4038137563f6fb052b71f1796657fd44f8f43fe0"}, "author": "Fleur Anderson", "url": "http://www.afr.com/news/politics/the-pm-may-find-that-free-advice-comes-at-a-high-cost-20151001-gjypvd", "ord_in_thread": 0, "title": "The PM may find that free advice comes at a high cost", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Malcolm Turnbull at the mini-summit on Thursday, with Scott Morrison to his left, and Warren Truss, right. AAP Share on twitter by Fleur Anderson Question: If you wanted to build a nation that is agile, innovative and creative, would you rely on the establishment for advice on how to go about it?\nThis week's Malcolm Turnbull's \"21st century\" government has promised to listen. But it's another question altogether whether he will follow the establishment's advice –instead of his extensive, eclectic business and social networks – to build the kind of nation he dreams of.\nOn Thursday, Turnbull and some of his senior ministers sat down with business, union and community leaders for a three-hour mini-summit which – from the outside at least – looked like one of those drinking sessions with mates where you solve all the problems in the world over a bottle or two of red.\nRaise the GST, cut super tax breaks for the rich, restrict pensions, lower penalty rates on weekends, lift productivity, invest in infrastructure and innovation, get old people, young people, and women into work. Yes,we've heard it all before.\n\"From our part, we are here to listen; it's what politicians don't possibly do enough of and we are very committed to listening to you and then the discussion that follows to tease out some of the proposals that you have and the discussions you have,\" Turnbull said.\nAll the usual suspects were there: the Australian Chamber of Commerce and Industry, the Business Council of Australia, the Australian Industry Group, the Australian Council of Trade Unions, seniors groups, youth groups, and think tanks. Hell, even Glenn Stevens from the Reserve Bank was there.\nPeter Strong of the Council of Small Business Organisations, who so vocally cheered dumped small business minister Bruce Billson, was snubbed and instead lurked around Parliament tweeting, \"Meeting of some of the ruling business class? Smbiz? Sigh...\"\nSince the Hawke government's 1983 Prices and Incomes Accord between Labor and the unions and 1985 tax summit, it's become the fashion of professional lobbyists trying to get a hearing of their particular bugbear to call for summits, or national conversations, so they can put their arguments on a national stage.\n But times have changed, and the big institutions represent interests so varied that reform ideas have become predictable and any truly original ideas are very thin on the ground.\nCabinet secretary Arthur Sinodinos says the days of a formal pact between big business, big unions or big government to bring about economic reform are probably over.\n\"The economy is a lot more diverse,\" he told ABC TV.\n\"That's why we had all those stakeholders around the table. We will involve working parties and parts of government, we will engage with the stakeholders, the states and territories, because they administer important parts of the public sector, big on service delivery. Health and education were areas where we need better incentives to promote better on the health and education sectors and that will also impact on the efficiency of spending in those areas.\"\nYet, as one Turnbull supporter observed privately, if you were going to find the best people in Australia to give advice on how to lift growth [and] productivity and encourage the individual to be the very best they can be, would you ask the heads of mainstream lobby groups?\n\"Don't you think people who have agile, innovative or creative ideas might be doing something else other than leading a union or a business group?\" he said.\nAll this suggests that rather than a single grand gesture, a Holy Grail of economic reform, a gradual inch-by-inch approach to gradually rebalance tax breaks and revenue collections away from less-productive forms of investment – like, say, investment properties and one-off sugar hits like the 2015 small business \"coffee machine\" tax break – into more transformative investments like digital technology and the like.\nThe most intriguing aspect of Turnbull 2.0 is who the Prime Minister is talking to away from the cameras, not in front of carefully staged picture opportunities. Backbenchers who previously expressed an interest in parliamentary friendship groups of science, innovation or the digital economy – like Wyatt Roy, Paul Fletcher and Karen Andrews – find themselves promoted, and even Abbott sympathisers report that Turnbull seems genuinely interested in their thoughts on a smooth-running government.\nTurnbull's regular dining partner Clive Palmer was in Parliament House on Thursday too; an unusual occurrence during a non-sitting week and coinciding with the government's surprise decision to delay Abbott's signature higher-education deregulation, which Palmer stridently opposed.\nOf course, there was one other person who was conspicuously absent at Thursday's meeting.\nCoalition backbencher Tony Abbott found himself in Melbourne, no doubt on electorate business, and dropped in for a chat with radio broadcaster Neil Mitchell at precisely the same time as Turnbull began his meeting with the people who complained that reform had stalled under an Abbott government.\nIt was his second radio interview this week. There was no hiding his bitterness, at Turnbull, Scott Morrison, Julie Bishop, the \"feckless\" Senate crossbenchers, The Australian newspaper and those calling for reform.\nAbbott now joins former Labor treasurer Wayne Swan blaming the business and community establishment for failing to sell their unsuccessful policies.\nSwan blamed the BCA's \"capitulation\" to the mining lobby for the Gillard government being forced to dump its planned company tax cut that would have been funded by the mining tax. And Abbott blames those who called for tough reforms – to the welfare system, health and education – but didn't have the stomach to support them.\n\"Frankly, um, I'm a little disappointed, Neil, that more of the people who keep saying we need reform, we need cuts in government spending, we need long term structural change, did not get behind the 2014 budget,\" Abbott said.\nIt was too brave and \"too gutsy\" for this parliament, Abbott said. As Abbott knows and Turnbull could soon discover, following free advice can cost you everything.", "external_links": ["https://twitter.com/@fleur_anderson"], "published": "2015-10-01T15:55:00.000+03:00", "crawled": "2015-10-02T04:11:51.074+03:00", "highlightTitle": ""}