{"organizations": ["Vodafone Cash"], "uuid": "4dafda67f99d41a6fa731fdd6c91ce186c99530f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/ot37naymlh_119899472_980693.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/650085/1/vodafone-cash-takes-off-to-a-good-start.html", "country": "US", "title": "Vodafone Cash takes off to a good start", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Vodafone Cash takes off to a good start", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T04:36:00.000+03:00", "replies_count": 0, "uuid": "4dafda67f99d41a6fa731fdd6c91ce186c99530f"}, "author": "", "url": "http://www.modernghana.com/news/650085/1/vodafone-cash-takes-off-to-a-good-start.html", "ord_in_thread": 0, "title": "Vodafone Cash takes off to a good start", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Samuel Dowuona"], "text": "  19 October 2015 02:36 CET Vodafone Cash takes off to a good start By Adom News | Samuel Dowuona \nAfter five years of staying out of the Mobile Money space, Vodafone Ghana has now started its own mobile money service dubbed Vodafone Cash, which promises to boost the national drive towards a cashless society. \nVodafone has already started sending messages to its customers to register for the service, and Adom News gathered that patronage has been encouraging so far. \nIt would be recalled that former CEO of Vodafone Ghana, Kyle Whitehill described the existing mobile money platforms in Ghana as not designed to boost the drive towards a cashless/cash-lite society, and promised that Vodafone's mobile money service will be designed to drive that move. \nVodafone Cash is therefore modeled strictly on the original world acclaimed mobile money service, M-Pesa, which was started in Kenya by Safaricom, a Vodafone company in that country. \nAdom News is reliably informed that, unlike the other mobile money platforms in Ghana, which do over-the-counter services, and therefore stifling the drive towards a cashless society, Vodafone Cash would be strictly wallet-based. \nOver-the-counter is the situation where people walk to an agent and give the agent money to transfer on their behalf. But Vodafone Cash would insist the money is loaded into the customer's wallet for him/her to send the money by him/herself. \nSources at Vodafone said the strict wallet-based transaction is necessary to drive the needed growth of mobile money in the country and that is what Vodafone is committed to. \n\"That is how M-Pesa works and that is why it has grown and taken over the whole of Kenya the way it has,\" the source said, adding that a strictly wallet-based service also empowers the customer rather than the agent to master the service and use it consistently. \nAs part of its commitment to building a solid mobile money platform, Vodafone poached one of the leading mobile money wizkids from Airtel Ghana, Carl Ashie, who is largely credited with the success of the award-winning Airtel Money service. \nCarl and his team at Vodafone have been working behind the scenes for more than a year now, putting together what they believe would revolutionalize mobile money in Ghana. \nVodafone Cash currently offers the basic mobile money services such as money transfer, prepaid airtime top-up and the payment of Vodafone bills, namely mobile postpaid, fixed line and broadband bills. \nEven though it has just started, it is already offering up to 15 per cent bonus for any one who uses the service to pay their Vodafone bills. \nVodafone Cash comes at a time when the Bank of Ghana has introduced two new guidelines for the mobile money industry. \nUnder the new guidelines, mobile money license would now be issued to telcos instead of to the banks, and that would give telcos some amount of autonomy from the banks as far as mobile money is concerned. \nIt would also allow the greater majority of unbanked Ghanaians to have access to full retail banking services through mobile money outlets without having to visit any bank. That promises to boost financial inclusion and help banks to cut cost on building branches nationwide. \nUnlike before, the new guidelines now require banks to pay interest on the cash they hold on behalf of the telcos and their mobile money customers, and that would enable the telcos' to also pay interest to their mobile money customers from January next years. \nAdom News gathered that even though Vodafone Cash has just taken off, its customers stand to enjoy the mandated interest on their money when that offer starts.", "external_links": [], "published": "2015-10-19T04:36:00.000+03:00", "crawled": "2015-10-19T03:49:37.702+03:00", "highlightTitle": ""}