{"organizations": [], "uuid": "7eb9eba2b162c5646093e44aa6f000207ef189d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/v/e/c/w/image.related.afrArticleLead.620x365.gjyu6q.png/1443772569652.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/sport/wayne-bennetts-tough-love-brand-of-leadership-bring-success-back-to-brisbane-20151001-gjyu6q", "country": "AU", "title": "Wayne Bennett's 'tough love' brand of leadership bring success back to Brisbane", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Wayne Bennett's 'tough love' brand of leadership bring success back to Brisbane | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-02T22:15:00.000+03:00", "replies_count": 0, "uuid": "7eb9eba2b162c5646093e44aa6f000207ef189d6"}, "author": "John Stensholt", "url": "http://www.afr.com/business/sport/wayne-bennetts-tough-love-brand-of-leadership-bring-success-back-to-brisbane-20151001-gjyu6q", "ord_in_thread": 0, "title": "Wayne Bennett's 'tough love' brand of leadership bring success back to Brisbane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is that a hint of a smile: Broncos coach Wayne Bennett watches on as his team celebrates victory over the Roosters. Getty Images Share on twitter by John Stensholt In mid-August, the Brisbane Broncos travelled south for a clash against fellow high-flyers Sydney Roosters. The match lived up to its billing as a potential NRL grand final preview, as the Sydney side ground out a tough 12-10 victory.\nBroncos coach Wayne Bennett walked into a devastated dressing room after the match, full of players with battered and bruised bodies and egos. An even tougher game against defending champions South Sydney loomed only five days later, and suddenly the Broncos looked vulnerable as the end of the season approached rapidly.\n\"I remember Wayne got in there, gave a 10-minute speech that several people say is just about the best sporting speech they've heard,\" Broncos chairman Dennis Watt tells AFR Weekend .\nInstead of blaming the players for losing by such a tight margin, Bennett turned it around by saying his team had really \"won\".\n\"He said they had won because they had played State of Origin-intensity football, they had won because of the tackles they made, they had won because everyone could look at their mate next to them and said they had played their best,\" Watt says.\n\"On and on he went, telling them how and why they had actually won. It instantly turned the players around. They walked out of there full of belief, and five days later belted Souths 47-12. It was so impressive. But that is the sort of leader Wayne is.\"\nNot looked back The Broncos have not looked back since as, except for a loss against Melbourne Storm in the last round of the season, and have charged into Sunday night's grand final against North Queensland Cowboys in impressive fashion.\n It's the sort of \"tough love\" leadership style that was so successful for former Manchester United manager Alex Ferguson. It mixes the public reputation of being dour and taciturn, rarely showing emotion, with a genuine interest in developing players professionally and personally.\n\"Bennett is tough and demanding, but it is also about accountability,\" Watt says.\n\"We had one star player who lost his training shorts and came in and said he wanted a new pair. Wayne said, 'Fine, but that will cost you $40'. He's about doing more with less, leaving the players hungry for more. When he came back he actually cut back some of the spending. He's not only a good manager of people but he's actually a very good manager of resources too.\"\nBennett starting working back at the Broncos late in 2014, weeks before his new contract had begun, meaning he was effectively working unpaid.\nHe spent his time getting to know everyone in the club. He made sure everyone, from players to staff, knew exactly what their role was and how it would contribute to their success.\nOne of the best Bennett, 65, has been a top-grade coach since the early 1980s and has long been considered one of the best in the game, and is regarded as one of the best mentors and leaders in sport. He led Brisbane to six grand final wins before leaving after the 2008 season. Past players such as Glenn Lazarus, now a senator, still have Bennett as a mentor, and Watt says the team was buoyed by Bennett rejoining the Broncos at the start of 2015.\n\"We probably had lost a bit of our aura, and that was reflected by players not necessarily wanting to come here,\" Watt says.\n\"But that has changed under Wayne. He brought some players with him and we've signed some internationals as well.\"\nA similar mentality exists at AFL club Hawthorn, president Andrew Newbold says. Hawthorn play West Coast Eagles in the AFL grand final on Saturday, in what will be their fourth consecutive appearance in the season decider as they seek their its third win in succession.\n\"There is a lot of respect [at Hawthorn] about the role you are going to to play. The CEO doesn't try to coach, the coach doesn't try to run the club, the president doesn't try to pick the side,\" Newbold says.\n\"It's all simple stuff, but it is discipline. I always say to the board we are fans for the few hours of the game, but as soon as it is finished we are administrators and we are running a business.\n\"It's not rocket science, it's discipline. It's not about the silverware, it's about the people. And if you get the people, the silverware will flow.\"\nRecord is impressive Hawthorn's record is impressive in a league that, like the NRL, has stringent parity and equalisation measures such as a player draft and salary cap in place. Newbold says with a laugh that the AFL, in pursuit of a balanced competition where anyone can win in any match, is upset seeing Hawthorn in the grand final yet again.\nThe club is ruthless in its pursuit of self-improvement, he says. Even after thrashing the Sydney Swans by 63 points to win the 2014 grand final, the Hawthorn board had a rigorous post-season external review to examine deficiencies and how directors could improve their contributions.\n\"We have to show the rest of the club the board is going to lead by example and the message we are sending to everyone else in the organisation, even the playing group, is that the board is self-reviewing in a year we had a record profit, won a premiership and so on.\n\"Most people would say 'you're doing well', but that's not what we say. We are saying 'how can we get better?', and finding those incremental improvements we can make to get better.\"\nThe Hawthorn way can be described as fostering a culture of the pursuit of relentless improvement.\n\"We want to create a club of expectation,\" Newbold says.\n\"When you walk through the door we expect a certain level of performance from you. We will give you a chance and promote you to give that contribution. If you are unable to after a period of time with all that support, we will find someone else to give that contribution. Sometimes we have to be ruthless.\"\nImplicit trust Newbold says Hawthorn's leaders, from captain Luke Hodge to coach Alistair Clarkson to chief executive Stuart Fox and himself as president, have \"implicit trust\" in each other.\n\"I did a speech this week and Stuart and and Alistair would have known what I was going to say beforehand, without me telling them. It is about having no surprises.\"\nYet over the weekend, those leadership strategies will be tested to the fullest. Ironically, West Coast coach Adam Simpson is a former Hawthorn assistant and North Queensland coach Paul Green played and later worked under Bennett at the Broncos.\nIt is the football version of imitation being the sincerest form of flattery – before the matches begin, at least.", "external_links": ["https://twitter.com/JohnStensholt"], "published": "2015-10-02T22:15:00.000+03:00", "crawled": "2015-10-02T22:09:28.081+03:00", "highlightTitle": ""}