{"organizations": [], "uuid": "99b95a735c245176f9f2a8275a6eddbd82b30a1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/10/Kingfisher-Airlines-EPs.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/industry/companies/kingfisher-airlines-allegedly-diverted-portion-of-loans-to-tax-havens/149660", "country": "IE", "title": "Kingfisher Airlines allegedly diverted portion of loans to tax havens", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Kingfisher Airlines allegedly diverted portion of loans to tax havens | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T05:30:00.000+03:00", "replies_count": 0, "uuid": "99b95a735c245176f9f2a8275a6eddbd82b30a1d"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/companies/kingfisher-airlines-allegedly-diverted-portion-of-loans-to-tax-havens/149660", "ord_in_thread": 0, "title": "Kingfisher Airlines allegedly diverted portion of loans to tax havens", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Infosys results 2015: Top 5 things Vishal Sikka did right since August 1, 2014 Infosys Q1 FY16 results: Top 5 highlights Myntra aims to ship 6 lakh parcels during 5-day Big Billion sale Kingfisher Airlines had allegedly diverted a substantial chunk of Rs 4,000 crore in loans secured from public sector banks to tax havens which has now come under the scanner of the CBI that has expanded its probe in the matter.\nThe material recovered during searches yesterday indicated that the airlines, which stopped flights in October 2012, has allegedly diverted part of loans taken from 11 nationalised banks, with total exposure of Rs 4,000 crore, to tax haven countries for different purposes not specified in loan applications, sources claimed.\nThey claimed that the agency will be expanding the ambit of the probe from Rs 900 crore loan from IDBI bank to loans received from 10 other public sectors banks as well which have total additional exposure of Rs 3,100 crore to the company.\nThey said that the allegations of diverting the loan amount from specified purposes to tax havens for different reasons will also be probed by the agency.\nThe consortium of 17 banks had an outstanding of over Rs 7,000 crore on loans to Kingfisher with State Bank of India having the highest exposure of Rs 1,600 crore.\nThe 10 public sector banks whose loans have come under the scrutiny of CBI, besides IDBI, are UCO bank, Punjab National Bank , State Bank of India, Vijaya Bank, Bank of Baroda, Corporation Bank, Bank of India, United Bank of India, State Bank of Mysore and Indian Overseas Bank.\nThe banks will have to explain reasons for extending the loan to the airlines, ignoring its own internal report which has warned against such a move.\nThe sources remained tight lipped about the countries where such transfers were made as they feel it might compromise the information that they might be seeking through Letters Rogatory, judicial requests, from these countries.\n“There was no need for the bank to take the exposure outside the consortium when already other loans were getting stressed,” a senior CBI official, probing the matter, had earlier said.\nCBI has yesterday registered a case against Vijay Mallya, Director of defunct Kingfisher Airlines, the company, A Raghunathan, Chief Financial Officer of the Airlines, and unknown officials of IDBI Bank in connection with alleged default of over Rs 900 crore loan from the Bank.\nIt is alleged that the loan was sanctioned in violation of norms regarding credit limits.\nThe agency had yesterday carried out searched at the offices and residence of Mallya in Mumbai, Goa, Bangalore and other places.\n“The CBI officials visited UB Group premises in Bengaluru, Goa and Mumbai in the course of an investigation regarding a loan facility availed by Kingfisher Airlines.\n“The company co-operated with the officials…,” said the official spokesperson of the UB Group.\nFirst Published on October 11, 2015 9:30 pm", "external_links": [], "published": "2015-10-12T05:30:00.000+03:00", "crawled": "2015-10-12T06:09:24.186+03:00", "highlightTitle": ""}