{"organizations": [], "uuid": "bdc8878ee4080fb3c1606c122a5b9c10c8a8f651", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/05/markets-stocks-europe-idUSL8N1252VD20151005", "country": "US", "title": "European shares rise on easy monetary backdrop, France outperforms", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "European shares rise on easy monetary backdrop, France outperforms | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-05T17:55:00.000+03:00", "replies_count": 0, "uuid": "bdc8878ee4080fb3c1606c122a5b9c10c8a8f651"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/05/markets-stocks-europe-idUSL8N1252VD20151005", "ord_in_thread": 0, "title": "European shares rise on easy monetary backdrop, France outperforms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details, updates prices) * Glencore, Arcelor lift mining sector; VW hits 5-yr low * France outperforms as economic data beat expectations * K+S wipes out one-quarter of value as Potash withdraws bid * Lisbon shares higher after Portuguese election By Danilo Masoni MILAN, Oct 5 European shares rose on Monday as weak data in Europe and elsewhere reinforced expectations the broad monetary policy backdrop will remain equity-friendly, with Glencore and ArcelorMittal lifting the mining sector. The pan-European FTSEurofirst 300 index < .FTEU3> was up 2.7 percent and the euro zone's blue-chip Euro STOXX 50 index climbed 3.4 percent. Both indexes fell on Friday before Wall Street rebounded to end in the black. Euro zone business activity grew at its weakest pace in four months during September, surveys showed on Monday. \"Data today is moderately negative for equities .... but their impact is practically neutral because of growing expectations that easing monetary policies in various countries will continue or be expanded,\" said Marco Vailati, head of research at Italy's Cassa Lombarda. U.S. stocks opened higher on Monday, after disappointing U.S. jobs data on Friday hardened views that the Federal Reserve will not raise interest rates this year. France's CAC outpaced the rest of Europe with a gain of 3.6 percent following a report showing services activity accelerated in September more than previously thought, a sign that the euro zone's second-biggest economy finished the third quarter on a firm footing. \"The economic data in France was today's surprise,\" said Andrea Cuturi, chief investment officer at asset manager Anthilia Capital. \"Data elsewhere in Europe was not particularly exciting. Signs of an economic acceleration in the euro zone are there, but full of traps, from China to emerging markets and local politics.\" Mining and trading giant Glencore extended its rebound from a sell-off a week ago, rising 13.6 percent on Monday after a surge in its Hong Kong-listed shares. Some traders said Glencore was buoyed by talk it might sell some of its agricultural assets to cut its debt. \"Sentiment is improving towards Glencore on the signs that it may be able to sell some of its assets,\" said Thames Capital Markets' trader Nav Banwait. Gains by steelmaker ArcelorMittal also helped mining stocks. It rose 6.2 percent after Citigroup raised its rating on the stock to \"buy\" from \"sell\". Volkswagen, the car maker caught in a scandal over rigging emissions tests, fell 0.3 percent. The stock earlier fell as much as 6.5 percent to touch a five-year low, while its credit default spreads on jumped. German potash producer K+S slumped 24.5 percent after Potash Corp withdrew a bid. Lisbon's benchmark PSI-20 index rose 3 percent after Portugal's centre-right government on Sunday won an election, albeit without securing an outright majority. European stocks remain below their 2015 peaks, reached around April. Concern China's economy was slowing pulled them lower in the third quarter. According to data from Sentix on Monday, sentiment in the euro zone deteriorated further in October as investors rattled by a slowdown in emerging markets pared back their expectations for the economy. Today's European research round-up (Additional Reporting by Sudip Kar-Gupta in London; editing by John Stonestreet)", "external_links": [], "published": "2015-10-05T17:55:00.000+03:00", "crawled": "2015-10-05T17:04:42.365+03:00", "highlightTitle": ""}