{"organizations": ["Namibia Statistics Agency"], "uuid": "509a82433270f1ece93abdcedbd64bcce56daeec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201510260201.html", "country": "US", "title": "Namibia: Some Progress On Agri Census", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Namibia: Some Progress On Agri Census", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T08:08:00.000+02:00", "replies_count": 0, "uuid": "509a82433270f1ece93abdcedbd64bcce56daeec"}, "author": "", "url": "http://allafrica.com/stories/201510260201.html", "ord_in_thread": 0, "title": "Namibia: Some Progress On Agri Census", "locations": ["Erongo", "South Africa", "Namibia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Khomas", "Ndamona Kali", "Ipumbu", "Hardap", "Karas", "Ipumbu Sakaria"], "text": "South Africa: Police Confirm That Seven Students Arrested By Ogone Tlhage The results of the first Agricultural Census to have been conducted in over 20 years will be released in due course. This is according to Ndamona Kali, Director of Economic Statistics at the Namibia Statistics Agency. According to her, the communal agricultural census report will be released soon, with the Agency hard at work preparing the results while the commercial agricultural census report will be released early next year. Briefly responding, she said, \"the Communal Agriculture Census Report is under preparation and will be released in due course. The data collection for the Resettled and Emerging farmers is in progress, the data will form part of the Commercial sector analysis. Ipumbu Sakaria, Deputy Director of Communication in June this year gave a similar update to the Economist. \"The communal sector survey which is divided into two phases, saw the first phase which included the listings of house holds, interviews and demarcations of sub plots recently conclude in all 14 regions. Currently the number of agricultural house holds interviewed were 10,250 while an estimated 3,109 plots were demarcated for the crops cutting experiment. The work force at this stage included 96 supervisors and 384 enumerators and also 110 vehicles.\" \"Through out this phase, teams will visit farms that have demarcated sub plots and harvest the crops which will then be used to calculate the yield,\" he said. Ipumbu pointed out that some of the regions like the Karas, Erongo, Hardap and Khomas would not be a focus for the second phase due to their insignificant amount of crops. The results for the communal agriculture census were initially expected to be released in September 2015 while those for the commercial sector were initially planned for December 2015. Namibia \nA group of schoolgirls from St Charles Lwanga School in Omusati stand accused of insulting patrons at some cuca-shops on … see more » Copyright © 2015 Namibia Economist. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 1,600 reports a day from more than 140 news organizations and over 500 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-10-26T08:08:00.000+02:00", "crawled": "2015-10-26T08:20:21.843+02:00", "highlightTitle": ""}