{"organizations": [], "uuid": "0ab212612b243c02588189073c832f6453b9b743", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/us-3.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/us-cfpb-says-you-should-be-able-to-sue-your-bank/43601.html", "country": "IN", "title": "US CFPB Says You Should Be Able to Sue Your Bank", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "US CFPB Says You Should Be Able to Sue Your Bank", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T11:56:00.000+03:00", "replies_count": 0, "uuid": "0ab212612b243c02588189073c832f6453b9b743"}, "author": "TruthInAdvertising.org", "url": "http://www.moneylife.in/article/us-cfpb-says-you-should-be-able-to-sue-your-bank/43601.html", "ord_in_thread": 0, "title": "US CFPB Says You Should Be Able to Sue Your Bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » US CFPB Says You Should Be Able to Sue Your Bank 43601 US CFPB Says You Should Be Able to Sue Your Bank 0 Comments, Be the first to comment Agency proposes new rules that would allow for restitution through class-action litigation The US Consumer Financial Protection Bureau believes that consumers wronged by their credit card company or student loan provider should be entitled to their day in court. The agency has proposed new rules that would ban financial firms from imposing arbitration clauses that strip consumers of their right to pursue restitution as part of a class-action lawsuit. “Consumers should not be asked to sign away their legal rights when they open a bank account or credit card,” said CFPB Director Richard Cordray. “Companies are using the arbitration clause as a free pass to sidestep the courts and avoid accountability for wrongdoing.” Forced arbitration clauses, which are often tucked away in contracts or terms and conditions agreements , allow for disputes between consumers and companies to be settled by privately appointed individuals, or arbitrators, rather than through the courts. But the CFPB says the scales of justice in this arrangement can be unfairly tilted toward the company. RELATED : FTC sues weight-loss marketers for blocking bad reviews “Often the harm to an individual consumer may be too small to make it practical to pursue litigation, even when the overall harm to consumers is significant,” the CFPB said in a statement released Wednesday. “In cases involving small injuries of anything less than a few thousand dollars, it can be difficult for a consumer to find a lawyer to handle their case.” That’s why it is important that consumers have the option to join together in bringing a class-action lawsuit that not only seeks restitution for all affected class members but an injunction against the company to prevent future wrongdoing, the CFPB said. The agency said the rules change would empower tens of millions of consumers who have arbitration clauses in the contracts for the products they use, many of whom aren’t even aware of the agreement. See TINA.org’s continuing coverage of arbitration issues here .", "external_links": [], "published": "2015-10-08T11:56:00.000+03:00", "crawled": "2015-10-08T12:38:57.418+03:00", "highlightTitle": ""}