{"organizations": [], "uuid": "6f99fe4be5b4abf096030da9a2fbfe49be233cdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-avoid-oil-153228037.html", "country": "US", "title": "Questor share tip: Avoid Oil services until prices fully recover", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Questor share tip: Avoid Oil services until prices fully recover", "spam_score": 0.0, "site_type": "news", "published": "2015-10-10T18:32:00.000+03:00", "replies_count": 0, "uuid": "6f99fe4be5b4abf096030da9a2fbfe49be233cdb"}, "author": "", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-avoid-oil-153228037.html", "ord_in_thread": 0, "title": "Questor share tip: Avoid Oil services until prices fully recover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "11.45 0.00 \nA short lived oil rally is no reason to buy bombed out oil services stocks on the cheap, says Questor \nOil services \nQuestor says AVOID \nIT IS 40 years since the first North Sea oil reached the shores of Scotland. Since then the UK oil services and engineering industry has flourished creating thousands of jobs and steady returns for investors. Shares (Berlin: DI6.BE - news ) across the sector have soared during the past two weeks as the oil price staged a recovery, but we would be wary of joining the party as many challenges remain. \n= Oil price slump = \nWhen oil was above $100 per barrel at the start of last year, the oil majors were spending billions on the exploration and development of existing oil fields. \nTechnological advancements also unlocked shale deposits in the US , creating a whole new boom of drilling and spending. \nFast forward 18 months and the oil services sector is facing a nuclear winter. Spending plans by the oil majors have been slashed and, with the oil price having plunged to about $50 per barrel, US shale is being pushed to the brink. \n= Lumpy revenues = \nThe worst may still be ahead for the sector because revenue streams are dependent on other firms spending. \nProjects to build oil rigs or maintain existing facilities can be delayed or cancelled when the oil price falls. A reduced budget on a project can greatly impact profits. As a result, the rate at which cash comes into an oil services businesses can be very lumpy and the full impact from falling oil prices could still lie in the future. \n= Buying the rally? = \nAnalysts at broker Investec (LSE: INVP.L - news ) feel that industrial valve and pump maker Weir is facing tough times ahead . \nWeir was downgraded to a sell with a price target of £11.20 as it grapples with a slowdown in both the oil and gas, and mining industries. \nIn the last five years, engineers Wood Group and Amec Foster Wheeler (Other OTC: AMCBF - news ) both completed big deals that increased exposure to US shale gas. Amec paid £1.9bn for Foster Wheeler last year and Wood Group bought PSN in 2010. \nWe downgraded Amec to a sell (972½p, March 24) and although the shares may look attractive trading on 10 times forecast earnings, that recommendation remains. Wood Group has been on a tear, gaining 20pc last week. However, the shares, trading on 12 times forecast earnings, are at risk, and we wouldn’t be looking to take part in this rally. \nThe smaller players Petrofac (Amsterdam: PF6.AS - news ) and Lamprell (LSE: LAM.L - news ) have both joined in the rally with their shares rising sharply. However, according to investment bank Goldman Sachs little has changed in the fundamental outlook for the oil market, with weak demand and oversupply pushing down prices. \n= Patience is key = \nInvestors should base any decision on results rather than hope, and would be advised to wait for audited full-year numbers. Only then can a sensible investment decision be made, as this relief rally may prove short lived.", "external_links": [], "published": "2015-10-10T18:32:00.000+03:00", "crawled": "2015-10-10T19:29:09.834+03:00", "highlightTitle": ""}