{"organizations": [], "uuid": "f8a15604bc57c08361673e14f2ca584b647b6ced", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/10/19/diary-top-econ-idUSL3N12G4RP20151019", "country": "US", "title": "DIARY-Top Economic Events to Oct 30", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "DIARY-Top Economic Events to Oct 30 | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T04:01:00.000+03:00", "replies_count": 0, "uuid": "f8a15604bc57c08361673e14f2ca584b647b6ced"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/10/19/diary-top-econ-idUSL3N12G4RP20151019", "ord_in_thread": 0, "title": "DIARY-Top Economic Events to Oct 30", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oct 19 (Reuters) -\nFor other diaries, please see:\nU.S. Federal Reserve\nPolling unit diary\nToday in Washington\nPolitical and general news\nIndex of all diaries\nMajor central bank events ** This Diary is filed daily ** MONDAY, OCTOBER 19 CHICAGO - The board of governors of the Federal Reserve System, the Office of the Comptroller of the Currency and the Federal Deposit Insurance Corporation hold a joint meeting on the Economic Growth and Paperwork Reduction Act of 1996 regulations - 1400 GMT. RICHMOND - Federal Reserve Bank of Richmond President Jeffrey Lacker speaks on \"Early Childhood Education in the Context of Lifetime Human Capital Investment\" at an event hosted by the Virginia Chamber of Commerce and the Virginia Early Childhood Foundation - 1600 GMT. FRANKFURT - European Central Bank banking supervisor chief Daniele Nouy speaks in the European Parliament - 1430 GMT. INGOLSTADT, Germany - German Bundesbank board member Joachim Nagel to speak on \"Internationalization of Renminbi\" - 0800 GMT. VIENNA - National Bank of Austria Governor Ewald Nowotny to speak on Economic Forecasts - 1500 GMT. STOCKHOLM - Meeting of the executive board of Sweden's Riksbank. TUESDAY, OCTOBER 20\nWASHINGTON - Federal Reserve Chair Janet Yellen, Labor Secretary Thomas Perez and Bureau of Labor Statistics Commissioner Erica Groshen participate in Labor Hall of Honor induction ceremony for former Bureau of Labor Statistics commissioners Carroll Wright and Janet Norwood. LONDON - Bank of England Governor Mark Carney and Deputy Governor Andrew Bailey appear before Treasury Committee - 0900 GMT. SYDNEY - Reserve Bank Australia releases minutes of its October monetary policy meeting - 0030 GMT. MADRID - Bank of Spain Governor Luis Maria Linde to speak on \"From the restructuring to the transformation\" - 0740 GMT. VIENNA - National Bank of Austria Governor Ewald Nowotny to speak on \"90th anniversary of world savings day\" - 1600 GMT.\nWEDNESDAY, OCTOBER 21\nWASHINGTON - U.S. Treasury Secretary Jack Lew, U.S. Commerce Secretary Penny Pritzker, Former U.S. Treasury secretary Lawrence Summers and Former Council of Economic Advisers chair Laura Tyson participate in Center for American Progress \"Creating Long-Term Value: Business Leaders on Shared Prosperity, Innovation and Investment\" conference - 1230 GMT. OXFORD - Bank of England Governor Mark Carney gives a lecture in Oxford - 1700 GMT. OTTAWA - Bank of Canada key policy interest rate announcement and monetary policy report - 1400 GMT. OTTAWA - Bank of Canada Governor Stephen Poloz holds a press conference after the interest rate announcement - 1515 GMT. SYDNEY - Reserve Bank of Australia Assistant Governor (Financial System) Malcolm Edey speaks at the International Swaps and Derivatives Association's (ISDA) 2015 Annual Australia conference - 2245 GMT. THURSDAY, OCTOBER 22\nLONDON - UK Finance Minister George Osborne appears before Treasury Committee to discuss Bank of England Bill - 0900 GMT. WASHINGTON - Former Federal Reserve vice chair Donald Kohn participates in a discussion on \"The politics of the Fed: Past, present and future\" before the Brookings Institution - 1430 GMT. MALTA - European Central Bank governing council meeting, followed by an announcement on interest rates and a news conference - 1145 GMT. FRIDAY, OCTOBER 23\nOSLO - Central Bank of Norway Governor Oystein Olsen holds lectures on tax administration - 0715 GMT.\nSUNDAY, OCTOBER 25 ABU DHABI - Summit on the Global Agenda 2015 (to Oct. 27).\nMONDAY, OCTOBER 26 BRUSSELS - European Central Bank board member Yves Mersch speaks at Belgian Financial Forum on \"The Challenges of Innovation\" in an event organised by the National Bank of Belgium - 1045 GMT.\nTUESDAY, OCTOBER 27 WASHINGTON - U.S. Federal Reserve's Federal Open Market Committee (FOMC) holds two-day meeting on interest rates. STOCKHOLM - Swedish central bank holds monetary policy meeting (to Oct. 28). MEXICO CITY - European Central Bank board member Benoit Coeure at Instituto Tecnologico Autonomo de Mexico (ITAM) - 2200 GMT.\nWEDNESDAY, OCTOBER 28 WASHINGTON - U.S. Federal Reserve's Federal Open Market Committee (FOMC) announces interest decision - 1800 GMT. LONDON - Former Federal Reserve chief Ben Bernanke speaks at London School of Economics on his new book, The Courage to Act: A Memoir of a Crisis and its Aftermath - 1830 GMT. TALLINN - Estonia central bank to release its financial stability report - 1000 GMT. STOCKHOLM - Swedish central bank announces interest rate decision - 0830 GMT. Monetary Policy Report will be published.\nTHURSDAY, OCTOBER 29 LONDON - UK finance minister George Osborne meets Brazilian finance minister Joaquim Levy as a part of UK-Brazil Economic and Financial Dialogue. LONDON - European Central Bank Vice President Vitor Constancio speaks on \"The Role of Stress Testing in the European Central Bank's Policy Framework\" at a conference on \"Stress Testing and Macro-prudential Regulation: A Transatlantic Assessment\" - 1400 GMT. FRIDAY, OCTOBER 30 WASHINGTON - Federal Reserve Bank of San Francisco President John Williams participates in a discussion on \"Where Interest Rates Will Be When the Economy is (Finally) Healthy and Why It Matters\" at event hosted by the Brookings Institution in Washington - 1400 GMT. TOKYO - Bank of Japan announces interest rate decision - 0200 GMT.", "external_links": [], "published": "2015-10-19T04:01:00.000+03:00", "crawled": "2015-10-19T03:19:58.138+03:00", "highlightTitle": ""}