{"organizations": ["HSBC Holdings plc", "British American Tobacco plc", "SSE PLC"], "uuid": "5a96b523d7a5571b7452693c25ae861908c6d480", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-utilities/?format=rss", "section_title": "Utilities News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/why-hsbc-holdings-plc-british-124112746.html", "country": "GB", "title": "Why HSBC Holdings plc, British American Tobacco plc And SSE PLC Are Too Good To Miss!", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why HSBC Holdings plc, British American Tobacco plc And SSE PLC Are Too Good To Miss!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T15:41:00.000+03:00", "replies_count": 0, "uuid": "5a96b523d7a5571b7452693c25ae861908c6d480"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-hsbc-holdings-plc-british-124112746.html", "ord_in_thread": 0, "title": "Why HSBC Holdings plc, British American Tobacco plc And SSE PLC Are Too Good To Miss!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Oct 23, 2015, 14:55 BST - UK Markets close in 1 hr 35 mins Why HSBC Holdings plc, British American Tobacco plc And SSE PLC Are Too Good To Miss! By Peter Stephens | Fool.co.uk – 1 hour 14 minutes ago 1,577.00 +2.0000 \nLife as an investor is full of disappointments. It is rare to find any company which has not, at some point, endured a challenging period at one time or another and during which time has posted negative returns for its investors. \nHowever, the key to enjoying success in the long run is realising that ups and downs are part of the fabric of being an investor and, moreover, the downs can be opportunities to reposition a portfolio and ensure it is ready for better company performance down the line. In other words, buy when the outlook is downbeat at a lower share price. \nThat appears to be the situation at which HSBC (LSE: HSBA) currently finds itself. Its shares have been hugely disappointing in recent months and have now fallen by 10% in the last three months. A key reason for this is the company's considerable exposure to the Asian economy, which is offering a very uncertain outlook, as well as high costs and sluggish prospects for top line growth. \nThis, though, presents an opportunity to buy HSBC when it trades on a price to earnings (P/E) ratio of just 10.1. This appears to be exceptionally low considering that earnings growth is due to be positive in each of the next two years and HSBC is implementing a major cost-cutting programme as it seeks to improve profitability. And, with a yield of 6.5%, it appears to be an outstanding dividend opportunity for the long term, too. \nSimilarly, buying a slice of British American Tobacco (LSE: BATS) seems like a very good move at the present time. The outlook for tobacco stocks is, of course, rather downbeat on the one hand since cigarette volumes continue to fall across the globe due to greater counterfeiting and a switch to e-cigarettes. However, the latter reason is also an opportunity for growth and, with British American Tobacco owning the e-cigarette brand Vype, it stands to benefit from the shift in consumer tastes towards 'vaping'. \nClearly, British American Tobacco is viewed as a quasi-utility and, regarding its dividend, this is a fair classification. Dividends have increased by 37% in the last five years and, looking ahead, a similar rate of growth is very much on the cards. But, with growth potential from new products, it could surprise on the upside when it comes to capital gains, too. \nMeanwhile, SSE (LSE: SSE) is likely to become an increasingly valuable investment due to the slow pace of interest rate rises. Realistically, with inflation near-zero the Bank of England simply cannot justify a quick rise in rates. So, while there is still discussion of a rate rise, the reality is that even within a few years, rates are unlikely to be anywhere near their 4% -- 5% historic norm. \nTherefore, SSE's yield of 5.8% is likely to hold great appeal over the medium term and, with the outlook for global markets being highly uncertain, defensive stocks such as SSE could become increasingly popular and post capital gains as well as high income returns. \nOf course, SSE, HSBC and British American Tobacco aren't the only companies that could boost your portfolio returns. However, finding the best stocks at the lowest prices can be challenging when work and other commitments get in the way. \nThat's why the analysts at The Motley Fool have written a free and without obligation guide called 10 Steps To Making A Million In The Market. \nIt's a step-by-step guide that could make a real difference to your financial future and allow you to retire early, pay off your mortgage, or even build a seven-figure portfolio. \nClick here to get your free and without obligation copy - it's well-worth a read! \nPeter Stephens owns shares of British American Tobacco, HSBC Holdings, and SSE. The Motley Fool UK has recommended HSBC Holdings. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-10-23T15:41:00.000+03:00", "crawled": "2015-10-23T17:05:17.719+03:00", "highlightTitle": ""}