{"organizations": [], "uuid": "70ed14515dcddc9768bad49f530979e5e82138ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/it.EBHB7PWnY/v1/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-12/china-etfs-jump-in-u-s-on-stimulus-outlook-before-economic-data", "country": "US", "title": "China ETFs Jump in U.S. on Stimulus Outlook Before Economic Data", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "China ETFs Jump in U.S. on Stimulus Outlook Before Economic Data - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T01:32:00.000+03:00", "replies_count": 0, "uuid": "70ed14515dcddc9768bad49f530979e5e82138ff"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-12/china-etfs-jump-in-u-s-on-stimulus-outlook-before-economic-data", "ord_in_thread": 0, "title": "China ETFs Jump in U.S. on Stimulus Outlook Before Economic Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Exchange-traded funds tracking Chinese A shares rallied in New York amid speculation policy makers will introduce more measures to boost growth in the world’s second-largest economy and stabilize mainland markets.\nThe Deutsche X-trackers Harvest CSI 300 China A-Shares ETF rose 3.7 percent to the highest since Aug. 21 on Monday. The Market Vectors ChinaAMC A-Share ETF increased 4.1 percent, also reaching a seven-week high. American depositary receipts of Alibaba Group Holding Ltd. advanced for a fourth day as Societe Generale SA analysts said they may be included in MSCI Inc.’s global investment benchmarks at a review next month.\nThe gains in the ETFs mirrored an advance in the Shanghai Composite Index, which rose 3.3 percent following speculation that the People’s Bank of China will reduce interest rates or reserve-requirement ratios as data this week will likely show slowing exports and decelerating inflation. The central bank has cut the amount of cash lenders must set aside as reserves three times this year and lowered rates five times since November, as the economy heads for its weakest annual expansion in more than two decades.\n“It’s all about what the Chinese officials decide to do,” said Ankur Patel, chief investment officer at R-Squared Macro Management LLC. “As more and more anticipation builds for stimulus, I think you’ll see the Chinese markets stabilize on the back of that.”\nPolicy Meeting The PBOC announced over the weekend it will expand a relending trial to nine more cities and provinces, while Premier Li Keqiang said the government will increase fiscal support for shantytown redevelopment. Chinese policy makers are slated to meet to lay out a five-year economic plan Oct. 26-29, Xinhua reported.\nRebounding from a 45 percent meltdown between June and August, the two A-share ETFs have advanced more than 16 percent since their August lows on investor optimism that a $5 trillion rout in mainland markets is over as the government intervened in trading and introduced targeted support for important industries to bolster growth.\nThe government will release export and consumer-price data on Tuesday and Wednesday, respectively. Overseas shipments probably dropped 6 percent last month from a year earlier, while the inflation rate slowed to 1.8 percent, according to the median estimates of Bloomberg surveys.\nShares of as many as 15 Chinese companies on American exchanges may be added to MSCI’s benchmarks at the index provider’s semi-annual review in November, following a rule change to allow shares trading outside their home markets to be added to their native gauges, Societe Generale analysts including John Carson wrote on Oct. 9. The inclusion of ADRs of Alibaba, Baidu Inc. and JD.com Inc. in the MSCI Emerging Markets Index would account for over 2 percent of the benchmark alone, according to the report.\nA Bloomberg gauge of the most-traded Chinese stocks in the U.S. added 1.4 percent on Monday to the highest level since Aug. 19. Alibaba rose 2.3 percent to $70.30, a level the shares haven’t closed at since Aug. 27. The Deutsche Bank ETF climbed to $34.85 while the Market Vectors fund reached $43.83. The yuan strengthened 0.34 percent, the most since March, as the central bank raised its fixing and signaled support for the currency.", "external_links": [], "published": "2015-10-13T01:32:00.000+03:00", "crawled": "2015-10-13T01:31:16.639+03:00", "highlightTitle": ""}