{"organizations": [], "uuid": "88c212156ab71400c5d0aab218694019944eb369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/prospero-announces-private-placement-215949113.html", "country": "US", "title": "Prospero Announces Private Placement", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Prospero Announces Private Placement", "spam_score": 0.0, "site_type": "news", "published": "2015-10-23T00:59:00.000+03:00", "replies_count": 0, "uuid": "88c212156ab71400c5d0aab218694019944eb369"}, "author": "", "url": "https://uk.finance.yahoo.com/news/prospero-announces-private-placement-215949113.html", "ord_in_thread": 0, "title": "Prospero Announces Private Placement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 22, 2015, 23:38 BST - UK Markets closed Prospero Announces Private Placement 0.000 Related Content VANCOUVER, BRITISH COLUMBIA--(Marketwired - Oct 22, 2015) - Prospero Silver Corp. (TSX VENTURE:PSL) (\"Prospero\" or the \"Company\") is pleased to announce that it will undertake a non-brokered private placement of up to 4 million Units (the \"Units\") at a price of $0.075 per Unit, for gross proceeds of up to $300,000 (the \"Offering\"). Each Unit will consist of one common share (a \"Share\") of Prospero and one non-transferable share purchase warrant (a \"Warrant\") exercisable for a term of 5 years. Each Warrant will entitle the holder thereof to purchase one Share at an exercise price of $0.12 per Share. If at any time from four months and one day after the closing of the Offering, the volume weighted average trading price of Prospero's common shares on the TSX Venture Exchange over a period of 20 consecutive trading days exceeds $0.40, Prospero may, within five days of such event, provide notice (the \"Notice\") to the holders of the Warrants that the Warrants will expire early, namely on the date which is 30 calendar days after the date of the Notice. Prospero does not anticipating paying any finders' fees or commissions in connection with the Offering. \nCertain insiders of the Company may acquire Units under the Offering. Any such participation would constitute a \"related party transaction\" as defined under Multilateral Instrument 61-101 Protection of Minority Security Holders in Special Transactions (\"MI 61-101\"). Such participation, however, is exempt from the valuation and minority shareholder approval requirements of MI 61-101 based on the fact that neither the fair market value of the Offering, nor the consideration paid by such persons, exceeds 25% of the Company's market capitalization. \nThe net proceeds from the Offering will be used by Prospero for exploration expenditures on its Petate project in Mexico and for general working capital purposes. All securities issued in connection with the Offering will be subject to a hold period expiring four months and one day following the closing of the Offering. \nThis proposed Offering is subject to the acceptance of the TSX Venture Exchange. \nAbout Prospero Silver Corp.: \nProspero is a Canadian resource company with the majority of its staff based in Mexico and who work for its wholly owned subsidiary Minera Fumarola, SA de CV (Fumarola). Prospero's objective is to quickly evaluate the properties currently optioned for their suitability to provide size potential and/or amenability for strategic joint ventures. \nForward-Looking Statement Cautions: \nThis press release contains certain \"forward-looking statements\" within the meaning of Canadian securities legislation, relating to, among other things, the Company's plan to undertake the Offering and the proposed use of proceeds. Although the Company believes that such statements are reasonable, it can give no assurance that such expectations will prove to be correct. Forward-looking statements are statements that are not historical facts; they are generally, but not always, identified by the words \"expects,\" \"plans,\" \"anticipates,\" \"believes,\" \"intends,\" \"estimates,\" \"projects,\" \"aims,\" \"potential,\" \"goal,\" \"objective,\" \"prospective,\" and similar expressions, or that events or conditions \"will,\" \"would,\" \"may,\" \"can,\" \"could\" or \"should\" occur, or are those statements, which, by their nature, refer to future events. The Company cautions that Forward-looking statements are based on the beliefs, estimates and opinions of the Company's management on the date the statements are made and they involve a number of risks and uncertainties. Consequently, there can be no assurances that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Except to the extent required by applicable securities laws and the policies of the TSX Venture Exchange, the Company undertakes no obligation to update these forward-looking statements if management's beliefs, estimates or opinions, or other factors, should change. Factors that could cause future results to differ materially from those anticipated in these forward-looking statements include, the risk that the Company will not be able to secure sufficient subscriptions from investors to complete the proposed Offering, possible, accidents and other risks associated with mineral exploration operations, the risk that the Company will encounter unanticipated geological factors, the possibility that the Company may not be able to secure permitting and other governmental clearances necessary to carry out the Company's exploration plans, the risk that the Company will not be able to raise sufficient funds to carry out its business plans, and the risk of political uncertainties and regulatory or legal changes that might interfere with the Company's business and prospects. The reader is urged to refer to the Company's reports, publicly available through the Canadian Securities Administrators' System for Electronic Document Analysis and Retrieval (SEDAR) at www.sedar.com for a more complete discussion of such risk factors and their potential effects. \nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Contact:", "external_links": [], "published": "2015-10-23T00:59:00.000+03:00", "crawled": "2015-10-23T01:39:31.754+03:00", "highlightTitle": ""}