{"organizations": ["Libor First"], "uuid": "99991d1056b2eeb77338a5aadbfd61d841c43ae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/24/102862436-GettyImages-481748822.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000664/device/rss/rss.html", "section_title": "Finance", "url": "http://www.cnbc.com/2015/10/04/first-brokers-stand-trial-over-libor.html", "country": "US", "title": "First brokers stand trial over Libor", "performance_score": 0, "site": "cnbc.com", "participants_count": 0, "title_full": "First brokers stand trial over Libor", "spam_score": 0.0, "site_type": "news", "published": "2015-10-04T15:33:00.000+03:00", "replies_count": 0, "uuid": "99991d1056b2eeb77338a5aadbfd61d841c43ae4"}, "author": "", "url": "http://www.cnbc.com/2015/10/04/first-brokers-stand-trial-over-libor.html", "ord_in_thread": 0, "title": "First brokers stand trial over Libor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lindsay Fortado"], "text": "First brokers stand trial over Libor Lindsay Fortado, legal correspondent Financial Times SHARES \nThe first brokers to face prosecution in the global Libor investigation over allegations they helped traders from various panel banks to manipulate the rate by acting as middlemen will go on trial this week in London. \nThe case will highlight the role played by the brokers, from ICAP , Tullett Prebon and RP Martin, rather than traders and submitters from panel banks, who set the daily rate. \nAll six men standing trial are accused of conspiring with Tom Hayes, a former Tokyo-based trader for UBS who later joined Citigroup , and others to manipulate Libor tied to the Japanese yen . Matthew Lloyd | Bloomberg | Getty Images Thomas 'Tom' Hayes, 35, a former trader at banks including UBS Group AG and Citigroup Inc., left, and his wife Sarah, arrive for his trial at Southwark Crown Court in London, U.K., on Friday, July, 24, 2015. \nDarrell Read, Colin Goodman and Danny Wilkinson, formerly of ICAP, face one count each of conspiring with Mr Hayes and other UBS traders over three years up until December 2009, to rig Libor by agreeing to suggest rates that were false or misleading. \nMr Read and Mr Goodman each face a second count of conspiring with Brent Davies, another ICAP employee, and Mr Hayes, who by then had moved on to Citigroup, from December 2009 until September 2010. \nTerry Farr and James Gilmour, of RP Martin, are each charged with conspiring with the UBS traders, Paul Robson of Rabobank and Luke Madden of HSBC to rig the rate. Mr Farr faces an additional count of conspiring with Mr Hayes while he was at Citigroup to rig Libor. \nThe sixth defendant, Noel Cryan, who worked for Tullett Prebon, is also accused of one count of conspiring with UBS traders in the case. \nThe defendants are alleged to have dishonestly agreed to procure or make submissions of rates by panel banks, which were false or misleading in that they \"deliberately disregarded the proper basis for the submission of those rates, thereby intending to prejudice the economic interests of others\", according to the charges by prosecutors at the UK Serious Fraud Office. \nMore from the FT:", "external_links": [], "published": "2015-10-04T15:33:00.000+03:00", "crawled": "2015-10-04T22:30:32.892+03:00", "highlightTitle": ""}