{"organizations": [], "uuid": "e6537029d38de5f0e4395c31c79f07869e636c28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/goncalodevasconcelos/2015/10/18/transparency-in-equity-crowdfunding-the-final-missing-ingredient/", "country": "US", "title": "Transparency In Equity Crowdfunding: The Final Missing Ingredient?", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "Transparency In Equity Crowdfunding: The Final Missing Ingredient?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-18T22:24:00.000+03:00", "replies_count": 0, "uuid": "e6537029d38de5f0e4395c31c79f07869e636c28"}, "author": "Goncalo de Vasconcelos", "url": "http://www.forbes.com/sites/goncalodevasconcelos/2015/10/18/transparency-in-equity-crowdfunding-the-final-missing-ingredient/", "ord_in_thread": 0, "title": "Transparency In Equity Crowdfunding: The Final Missing Ingredient?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I founded SyndicateRoom, one of the fundamental principles was transparency. Being an investor -led crowdfunding platform was about more than challenging the status quo – it was to be the philosophy that informs how we conduct our business. With trust in banks being at its lowest for years , FinTech companies such as SyndicateRoom have huge opportunities to assert themselves as reliable providers of financial services in their place. But for these companies to truly succeed they need to earn and keep the trust of their members. Disintermediation opens the door to transparency; equity crowdfunding is no different . As the founder of an equity crowdfunding platform , I knew that it was a matter of time before we would have a business funded via the platform failing to perform. After two years and 59 businesses funded, we had our first company close down. When we met with him earlier in the month, Soshi Games’ CEO Cliff Dennett reflected on what went wrong and the things he’d do differently next time around. If you are curious of how an entrepreneur, his company, the investors and the equity crowdfunding platform should all come together to learn from the experience, I would urge you to watch Cliff’s interview. It’s a fascinating watch.[caption id=\"attachment_438\" align=\"\" width=\"640\"] Transparency Counts: The lessons of failure, and coming back stronger[/caption]Equity crowdfunding is no longer the newest kid on the alternative finance block. It’s ‘growing up’ into a major source of growth capital for UK businesses and as an established asset class. Part of this ‘growing up’ necessitates being open and transparent about the failures – an approach we’ve been advocating since our beginnings. Firstly, let’s explore a central truth: given the risk profile of equity crowdfunded businesses, failures are inevitable and will occur much earlier than the successes. These losses are balanced against the potential for high returns from the successes. This balance is not a passive ‘invest and hope’ process. Investors can take concrete steps to maximise the likelihood of a good return. We believe that these steps will go a long way:\nInvest with the Angels: We argue that SyndicateRoom’s investor-led model can be said to have helped to protect us from a business failure until now. We only list companies that are already backed by professional, experienced business angels, who have taken an active role in evaluating the strength of the deal. t Get the best deal: The high valuations associated with many company-led crowdfunding platforms will work against an investor seeking the best return. Investors should ensure they enjoy the same share class, and same price per share, as those the professional investors and institutions have negotiated for themselves, which is what investor-led platforms give their investors. t Build a balanced portfolio: A typical risk-management strategy is to diversify by investing in multiple businesses rather than in just one or two businesses. t Focus on EIS/SEIS investments: The UK offers generous tax relief in order to encourage investment in early-stage growth businesses. The Enterprise Investment Scheme and Seed Enterprise Investment Scheme offer income tax and capital gains tax reliefs to qualifying private investors who invest in eligible businesses. SyndicateRoom enjoys an enviable position in the industry, with such a low failure rate. In everything in life I have always been a huge fan of quality over quantity . SyndicateRoom’s approach to business is no different. Our vision is to create a long-term, sustainable crowdfunding platform by challenging the status quo of this nascent industry . Other platforms should follow SyndicateRoom’s footsteps: openness is the only route forward for a maturing equity crowdfunding industry.", "external_links": ["https://www.syndicateroom.com/investors/what-is-equity-crowdfunding", "http://www.crowdfundinsider.com/2015/10/75573-transparency-counts-syndicateroom-talks-about-first-funded-company-failure/", "https://hbr.org/2015/03/why-our-trust-in-banks-hasnt-been-restored", "http://syndicateroom.us5.list-manage.com/track/click?u=f6cade88db5301f18c78a83cc&id=ac5d4be661&e=401e318b52", "https://www.syndicateroom.com/learn/glossary/a/alternative-finance.aspx", "http://syndicateroom.us5.list-manage2.com/track/click?u=f6cade88db5301f18c78a83cc&id=5f170cda36&e=401e318b52", "http://www.youtube.com/watch?v=kESsIMYuCwE"], "published": "2015-10-18T22:24:00.000+03:00", "crawled": "2015-10-18T18:15:49.534+03:00", "highlightTitle": ""}