{"organizations": [], "uuid": "09c9efe6a7a1856ded75bef61a1af27a7c7325a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/01/21/mario-draghi-xxx/ALTERNATES/crop_100x100/Mario+Draghi++xxx", "site_section": "http://www.bdlive.co.za/personalfinance", "section_title": "Personal Finance | BDlive ", "url": "http://www.bdlive.co.za/world/europe/2015/10/18/global-week-ahead-draghi-in-the-spotlight-amid-growth-worries", "country": "ZA", "title": "GLOBAL WEEK AHEAD: Draghi in the spotlight amid growth worries | Europe", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "GLOBAL WEEK AHEAD: Draghi in the spotlight amid growth worries | Europe | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T00:34:00.000+03:00", "replies_count": 0, "uuid": "09c9efe6a7a1856ded75bef61a1af27a7c7325a4"}, "author": "Sarah White", "url": "http://www.bdlive.co.za/world/europe/2015/10/18/global-week-ahead-draghi-in-the-spotlight-amid-growth-worries", "ord_in_thread": 0, "title": "GLOBAL WEEK AHEAD: Draghi in the spotlight amid growth worries | Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mario Draghi. AFP PHOTO / DANIEL ROLAND Related articles Weak inflation puts ECB in tight spot Drop in jobless rates adds to hints of rebound in Europe Europe’s plan for liquidity gets credit flowing Europe’s bond-buying quells deflation fears In this article Companies and organisations: European Central Bank MADRID — Mario Draghi will take centre stage next week as the European Central Bank, steeped in concern over sluggish eurozone growth and struggling to increase consumer prices, takes stock of how effective its stimulus measures have been so far.\nNot that the ECB chief is expected to take drastic action when the governing council meets in Malta on Thursday — but markets will be looking for signs of how inclined Mr Draghi will be to do so weeks from now.\nLower oil prices dragged eurozone consumer prices into negative territory in September and growth in the currency bloc appears to be slowing again.\nThat is putting the ECB under increasing pressure to expand or prolong an asset purchase scheme already running to more than a trillion euros. At the same time, faltering global growth prospects, especially in emerging markets, are also clouding the timing of an interest rate increase by the US Federal Reserve.\n\"Draghi is likely to stress the central bank’s readiness to adjust the duration, volume and structure of the quantitative easing purchase programme if need be,\" Commerzbank economist Michael Schubert said in a note.\nAnalysts believe quarterly economic forecasts due from the eurozone’s central bank in early December would be more likely to trigger new measures if they proved disappointing, though few see an interest rate cut as a likely option.\nThe ECB is a little over six months into a plan to buy €60bn of assets a month, mostly government bonds. That scheme runs September 2016, though economists polled by Reuters expect it to be extended beyond then.\nWith eurozone inflation seen well below the ECB’s target of just under 2% for this year, some believe the ECB could increase the overall size of the quantative easing programme from the current €1.1 trillion goal.\nThe question also starting to haunt markets is what more can be done to stimulate growth when even major eurozone economies such as Germany are turning out poor data. A slowdown in emerging markets, including in China and Brazil, is weighing on German exports, for instance.\nECB Governing Council member Ewald Nowotny suggested in recent days that new instruments outside of the bank’s remit may be needed, putting the onus on structural measures and policies to stimulate demand.\nFresh PMI data next week should also set the tone for a crucial fourth quarter for economic indicators, with preliminary estimates of activity in the eurozone’s services and manufacturing sectors due on Friday.\nChina growth in focus\nBefore then, all eyes will be turning to China, where a slowdown has stoked worries about an erosion in global demand that could weigh on countries around the world going into next year.\nThe world’s second-largest economy is expected to announce its weakest economic growth in years on Monday, with output rising by less than 7% year-on-year in the third quarter.\nAfter a surprise devaluation of the yuan earlier this year, confirmation of a slowdown may prompt Beijing to step up efforts to bolster the economy, including more interest rate cuts.\nEconomists polled by Reuters expect that growth in gross domestic product declined to 6.8% in the third quarter from the same period in 2014, the slowest since early 2009.\nChinese data on retail sales and industrial production next week will also give investors and authorities food for thought.\nIn the meantime, expectations are waning for the first interest rate increase in a decade in the United States, after the Fed held off last month. That decision is also keeping the euro uncomfortably strong for exporters in the eurozone.\nHousing data on Thursday is the only indicator of note in the United States next week. Sales are expected to have risen in September after falling more than forecast a month earlier.\nFurther strong housing reports and signs of resilience in the US economy could add to expectations for a rate increase from near zero in December, though some economists are already looking to early 2016 as more likely.\nReuters", "external_links": [], "published": "2015-10-19T00:34:00.000+03:00", "crawled": "2015-10-18T19:26:33.044+03:00", "highlightTitle": ""}