{"organizations": [], "uuid": "32f3c805d0edf5e51b584de3edeacc9f5f1fe924", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/j/d/y/j/0/image.related.articleLeadwide.620x349.gkhpyh.png/1445831603884.jpg", "site_section": "http://www.smh.com.au/business", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/money/planning/income-insurance-protects-your-biggest-asset-20151024-gkhpyh.html", "country": "AU", "title": "Income insurance protects your biggest asset", "performance_score": 0, "site": "smh.com.au", "participants_count": 1, "title_full": "Income insurance protects your biggest asset", "spam_score": 0.0, "site_type": "news", "published": "2015-10-26T02:00:00.000+02:00", "replies_count": 0, "uuid": "32f3c805d0edf5e51b584de3edeacc9f5f1fe924"}, "author": "Thabojan Rasiah", "url": "http://www.smh.com.au/money/planning/income-insurance-protects-your-biggest-asset-20151024-gkhpyh.html", "ord_in_thread": 0, "title": "Income insurance protects your biggest asset", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Your ability to produce an income is your most important financial asset.\nIf you had a machine at home in the corner of your living room and it spat out $100,000 each year, would you insure it?\nIf you thought about your most significant asset, would you insure it?\nOf course you would!\nWe all know that insurance is something that we have \"just in case\". Just in case the unexpected happens and we need to call upon it. Our home insurance is in place just in case we incur major damage to our house or contents. Our car insurance is in place just in case we have a major accident. Our hospital health insurance is in place just in case we need to go to hospital.\nAdvertisement In fact, the best-case scenario is that any insurance we have is a complete waste of money. If we haven't had to make a claim, then we haven't crossed paths with disaster.\nFor those who have been unlucky enough to make a major claim on any insurance policy, they would thank their lucky stars that they had a good-quality policy in place that allowed them to get through a tough period and eventually move on with life, albeit with a major disruption.\nIn my second question above I asked, what is your most significant asset? Is it your home? Your car? Your business? The answer is probably none of these.\nThe largest asset that any of us will have over our lifetimes is our ability to earn income. Looking at it simply, if you earned, say, $50,000 a year (increasing at the rate of inflation) from the age of 25 to the age of 65, you would have earned more than $3.26 million after tax. Similarly, if you earned $100,000 a year from the age of 35 to the age of 65, you would have earned more than $3.65 million after tax.\nIf we are to protect this vital and significant asset, a quality income-protection policy is a must. Not all income protection (or salary continuance) policies are alike, so it is important to understand their differences and any deficiencies. For example, the medical definitions of a policy are critical to ensure you receive payment if you are unable to work because of illness or injury. A poor-quality policy may have strict criteria, meaning you might not receive payments, just when you need it the most.\nAnother thing to look out for is that many policies (particularly some held within superannuation) have a limited benefit period of as little as two years. Ideally, we want our income protection policies to replace our income until our retirement age (say 65). Two years of income, while helpful, will not replace our lifelong income.\nSo I ask again … if you had a machine at home in the corner of your living room and it spits out $100,000 each year, would you insure it? Well let's say it's not a machine, but it's you … of course you would insure it!\nThabojan Rasiah is a leading financial adviser, commentator and blogger. Email: thabojan.rasiah@sfg.com.au Twitter: @t_rasiah", "external_links": [], "published": "2015-10-26T02:00:00.000+02:00", "crawled": "2015-10-26T07:42:52.100+02:00", "highlightTitle": ""}