{"organizations": [], "uuid": "81cfa270db3ca071842d315e930361d32ff68854", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/personal-finance/", "section_title": "Personal Finance News:Personal Finance Articles,Personal Finance Tips,Banking and Finance News | The Financial Express", "url": "http://www.financialexpress.com/article/personal-finance/time-amplifies-money-when-it-comes-to-compounding/150252", "country": "IE", "title": "Time amplifies money when it comes to compounding", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Time amplifies money when it comes to compounding | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-10-13T08:04:00.000+03:00", "replies_count": 0, "uuid": "81cfa270db3ca071842d315e930361d32ff68854"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/personal-finance/time-amplifies-money-when-it-comes-to-compounding/150252", "ord_in_thread": 0, "title": "Time amplifies money when it comes to compounding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles 'India home to 2,080 uber-rich with wealth over $50 mn' Investing: Multiply your happiness Income tax laws and retirement: Top 7 empowering points COMPOUNDING is the most easily accessible, and yet the most underutilised, tool for wealth creation. Those in search of get-rich-quick investments are likely to miss out on the grand benefits of patience and consistency.\nMultiplying your investment by merely allowing the amount earned on it to grow with it, over a sufficient period of time, is a wonder in itself.\nSo, in a span of 30 years, Rs 1 crore if left in your savings account can fetch you Rs 3 crore at 4% per annum. If grown at a ‘safe’ rate of 8% per annum, it will fetch you Rs 10 crore. If grown at a ‘risky’ rate of 15% per year, it will get Rs 66 crore. But the true power of compounding lies in growing your portfolio at a sensible rate consistently and doing the needful to maximise the probability of achieving this rate. But what is a sensible rate? To understand this, we first need to understand the factors that spoil the effect of compounding.\nCompounding spoilers\nInflation: Inflation is often known as a silent killer. Both compounding and inflation are functions of time, but while one multiplies wealth, the other corrodes it. The two features that allow inflation to impede portfolios are tax inefficiency and risk aversion.\nTax inefficiency: Few care to look into how tax-efficient investments are. For example, an investor may choose to invest in an fixed deposit (FD) at the rate of 7-8% per year, but the post-tax returns that this instrument would generate would be about 5%. With a collection of such instruments in your portfolio, wealth erosion is certain. These instruments are incapable of meeting inflation, let alone beating it.\nRisk aversion: Even if we insist on playing on safe grounds of 7-8% post-tax returns, say, by investing in tax-free bonds, it would effectively just about compensate for the erosion caused by inflation. As mentioned above, Rs 1 crore grows to Rs 10 crore at 8% return per year in 30 years. But assuming an inflation rate of 7%, the value of this Rs 10 crore becomes almost equivalent to R1 crore (the same as it was 30 years ago). Clearly, no wealth lost and none found.\nTiming the market: Investors often try to time the market and lose out on the benefits of compounding in the bargain. In a market environment driven by sentiments, investor behaviour is often impulsive, resulting in hasty entries and exits from time-to-time. Rushing in and out of markets as and when the moods swing only compounds stress. In contrast, the secret of compounding money lies in staying invested long-term. So, even if you stay invested for 30 years in a reasonably good equity mutual fund, which earns you about 15% per year, your Rs 1 crore can grow to a whooping Rs 66 crore. When it comes to compounding, time amplifies money.\nCompounding and wealth creation\nWealth management is not about product-shopping, fishing for high return products. It is about setting your goal (target return) and strategising to meet it by balancing risks with requirements for wealth creation and protection.\nPlaying safe or being erratic is very likely to kill your wealth. So, what should one do to harness the power of compounding and build substantial wealth? The answer is: Taking sufficient (calculated) risk. A sensible rate of return accommodates sufficient risk to both: Deal with inflation and meet your target returns/goals. The objective is to use the power of compounding to beat inflation by a substantial margin to create wealth. Being aware of how the power of compounding can aid wealth creation and what one stands to lose by playing ‘safe’ can help investors take informed decisions and invest in a disciplined manner.\nThe writer is deputy CEO, AnandRathi Private Wealth Management\n 13, 2015 12:04 am", "external_links": [], "published": "2015-10-13T08:04:00.000+03:00", "crawled": "2015-10-14T11:01:42.132+03:00", "highlightTitle": ""}