{"organizations": [], "uuid": "967238a5ff6b02962c288fda06de3b44ebe43658", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wisebread.com", "main_image": "http://www.wisebread.com/files/fruganomics/blog-images/000048727382.jpg", "site_section": "http://www.wisebread.com/taxonomy/term/6/all/feed", "section_title": "Wise Bread (Personal Finance posts)", "url": "http://www.wisebread.com/how-do-airline-companion-tickets-work-and-where-do-you-get-them", "country": "US", "title": "How Do Airline Companion Tickets Work and Where Do You Get Them?", "performance_score": 0, "site": "wisebread.com", "participants_count": 1, "title_full": "How Do Airline Companion Tickets Work and Where Do You Get Them?", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T22:26:00.000+03:00", "replies_count": 0, "uuid": "967238a5ff6b02962c288fda06de3b44ebe43658"}, "author": "Jason Steele", "url": "http://www.wisebread.com/how-do-airline-companion-tickets-work-and-where-do-you-get-them", "ord_in_thread": 0, "title": "How Do Airline Companion Tickets Work and Where Do You Get Them?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Credit Cards » How Do Airline Companion Tickets Work and Where Do You Get Them? How Do Airline Companion Tickets Work and Where Do You Get Them? This post contains references to products from our advertisers. We may receive compensation when you click on links to those products. Please visit our Advertiser Disclosure to view our partners, and for additional details. Wise Bread Picks 0% Balance Transfer Credit Cards \nThe credit card industry knows that there are few offers as tempting as a \"free flight.\" And while many cards offer points or miles to be redeemed for award travel, companion tickets are another strategy that is quite common. So do these offers represent a fantastic value, or are they just another trick to get you to sign up for a credit card? (See also: Best Credit Cards that Offer Airline Companion Tickets ) What Is a Companion Ticket? \nThe term \"companion ticket\" or \"companion pass\" is thrown around a lot by the airline and credit card industry, and it can mean different things ranging from unlimited free tickets, to just a relatively small discount on the purchase of a second ticket. When evaluating one of these offers, you should skip right to the fine print to see how and when you can actually redeem it, and what it will ultimately cost you. Here are the most popular companion ticket offers and what you actually get. Southwest Rapid Rewards \nThe Southwest Companion Pass is by far the best companion pass of all. Once you earn it, you choose an individual that can travel with you on any paid or award ticket for just the price of taxes and government fees. The two tickets must be on the exact same itinerary and you must fly together. To receive this pass, you must earn 110,000 points in a calendar year, either through flying or by using their Rapid Rewards credit card . Once earned, the pass is valid until the end of the next calendar year, so you can receive up to two years of this benefit. \nClick here to learn more and apply for the Southwest Airlines Rapid Rewards® Premier Credit Card today! British Airways Executive Club \nThe British Airways Visa Signature® Credit Card offers a Travel Together certificate to cardholders who spend $30,000 during a calendar year, which allows you to redeem two award tickets by only using the mileage for one. However it's not nearly as good as it sounds. To use it, cardholders must book an award flight using their British Airways(BA) Avios points, and those reservations need to be on flights operated by BA, which imposes huge fuel surcharges on its awards. In fact, the fuel surcharges alone often approach the price of just buying an economy class ticket, so this program only makes sense for much more valuable awards in business and first class. The annual fee for this card is $95. \nClick here to learn more and apply for the British Airways Visa Signature® Card today! Delta SkyMiles \nThe only way to get companion tickets for Delta is through the Delta Skymiles Credit Cards . The cards both offer similar companion tickets that are actually quite valuable as they cover the entire fare except for taxes and government fees. The Platinum Delta SkyMiles card offers a companion fare certificate that is valid in economy class when used with a paid ticket within the 48 contiguous United States (residents of Alaska and Hawaii can use it for travel originating from home), while the Reserve card's certificate is also valid for paid first class travel. Thankfully, reservations on almost all fare classes (except some highly discounted bulk fares) are eligible to use. Certificates are earned each year when you renew your credit card and pay the annual fee. Alaska Airlines Mileage Plan \nFrequent flyers on Alaska Airlines can get a companion ticket through one of their credit cards. These cards provide a discount code that lets you purchase a companion ticket in economy class on Alaska Airlines for $99 (plus taxes and fees starting at $22). This companion pass offer is only eligible on paid fares (not award tickets), but both travelers are eligible to earn miles. The annual fee is $75 for the Visa Signature card , $50 for Platinum Plus accounts, and it varies for different versions of their business card. Lufthansa Miles & More \nLufthansa offers a Companion Award for their Senator or HON Circle Members, which allows you to redeem a companion ticket for 50% fewer miles. The Miles & More MasterCard however, gives you an economy-class companion ticket after your first use, and again each year on your account anniversary. Sadly, this offer is only valid on paid economy-class tickets in H class or higher, which will always be priced more than the lowest fare available. So in this case, the discount is likely to be modest. There is a $79 annual fee, which is waived for Senator and HON Circle Members. Virgin America Elevate \nThe companion fare offer from Virgin America credit cards is really more like a highly restricted, fixed-value coupon for $150 off rather than an actual companion ticket. It can only be used in conjunction with a full-fare, round-trip ticket booked at least 14 days in advance. The Virgin America Visa Signature card has a annual fees of $49 while the Premium Visa Signature version is $149. Editorial Note: Any opinions, analyses, reviews or recommendations expressed in this article are those of the author’s alone, and have not been reviewed, approved or otherwise endorsed by any bank, card issuer, airline or hotel chain. Best Credit Cards", "external_links": [], "published": "2015-10-14T22:26:00.000+03:00", "crawled": "2015-10-14T22:46:10.742+03:00", "highlightTitle": ""}