{"organizations": [], "uuid": "8850bf6d659915f59e43239e476cda8cb1aba10a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/investor/2015/10/14/how-to-profit-from-escapism/", "country": "US", "title": "How To Profit From Escapism", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "How To Profit From Escapism", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T18:30:00.000+03:00", "replies_count": 0, "uuid": "8850bf6d659915f59e43239e476cda8cb1aba10a"}, "author": "Jon Markman", "url": "http://www.forbes.com/sites/investor/2015/10/14/how-to-profit-from-escapism/", "ord_in_thread": 0, "title": "How To Profit From Escapism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In a year that has featured an energy crash, a China crash and a biotech crash, you would think the few tech stocks left standing among the smoking ruins would be damned serious stuff.Yet the market gods have an amazing sense of humor and, instead, decided to set entertainment at the top of their hit parade for 2015. As of mid-October [entity display=\"Netflix\" type=\"organization\" subtype=\"company\" active=\"true\" key=\"netflix\" ticker=\"NFLX\" exchange=\"NASDAQ\" natural_id=\"fred/company/6132\"]Netflix[/entity] is the top gainer this year among tech companies in the S&P 500, followed by [entity display=\"Amazon.com\" type=\"organization\" subtype=\"company\" active=\"true\" key=\"amazon\" ticker=\"AMZN\" exchange=\"NASDAQ\" natural_id=\"fred/company/196\"]Amazon.com[/entity] and two videogame makers, [entity display=\"Activision Blizzard\" type=\"organization\" subtype=\"company\" active=\"true\" activated=\"true\" deactivated=\"false\" key=\"activision-blizzard\" ticker=\"ATVI\" natural_id=\"fred/company/39\"]Activision Blizzard[/entity] and [entity display=\"ELECTRONIC ARTS\" type=\"organization\" subtype=\"company\" active=\"true\" key=\"electronic-arts\" ticker=\"EA\" exchange=\"NASDAQ\" natural_id=\"fred/company/1420\"]Electronic Arts[/entity] .The story behind the success of the last two is remarkable and potentially important as a window into what tech investors will most highly value not just the rest of this year but next year, too, in the event that slowing global demand leaves all public companies gasping for growth.The first thing you need to know about the videogame industry is that revenues are Godzilla-size. Tech research firm Gartner sees the worldwide videogame market of console, online, mobile and PC products at $111 billion by 2016 and $128 billion in 2017. Compare that to the film industry, which had $88 billion in worldwide revenue in 2015, according to PwC.If the videogame industry were covered as heavily as Hollywood by the media, every director, character designer and scenarist in hit franchises like Call of Duty and Battlefield would be a celebrity stalked by TMZ. Instead they labor mostly in anonymity and just vacuum up cash from the universe without having to feel sorry about wasting money on good clothes or bodyguards.How could the industry be that large? Well, almost everything you think you know about it is wrong. According to an industry trade group, around 42% of Americans play videogames regularly; the average age of a gamer is 35, with 27% aged 50 or over; women 18 or over amount to a third of the game-playing population versus only 15% for boys 18 and younger.So, yeah, it's superpopular. If you were born after 1975, videogames are \"just a part of your life; they don't replace anything,\" says research analyst James Mack. But it's more than that. Frequent gamers feel they get more for their money than they do from DVDs, movies and music. A typical console game is $60, it lasts forever and your friends can enjoy it for free. A single date at the cineplex for just two people is easily $60 for tickets, food, driving and parking.There's more: If it's been a while since you tried a game, you would be shocked at the gorgeous graphics, the intricate plot lines, the depth of character development and the sheer thrill of exploring new worlds. The latest installment of the Fallout franchise by Bethesda Game Studios contains 111,000 lines of actors' dialogue. That's 100 times more lines than a blockbuster movie has. In fact, the latest games have morphed into a mix of spectacle, sport and art that attract tens of thousands to stadium competitions and conventions.From a business standpoint, Activision and Electronic Arts are benefiting from a major sales cycle in PlayStation and Xbox consoles that offer improved speed, power and connectivity. Think of it as the iPhone cycle but with real innovation. The number of PS4 and XboxOne consoles will soon climb to an estimated 50 million worldwide from 30 million today.According to Columbia Threadneedle Investments in Boston, Activision and EA are both enjoying sizable margin growth by increasingly bypassing retailers like Gamestop (GME) via downloads into the new consoles. EA's gross margins have gone from a low of some 60% a couple years ago to 75% now.Companies are also increasing user engagement within games to boost monetization and customer retention. You pay $60 for the latest Call of Duty disc, but you might then spend another $60 per year on map packs and gear. Gamers are spending hundreds of dollars on microtransactions for virtual \"player packs\" for the sports games Madden and FIFA.In short, Electronic Arts and Activision are smart buys in a tech industry challenged for growth. It's not often you get to invest in innovative duopolists that, in terms of demographics and product cycle, have the wind at their backs. Be bullish on escapism. It is always in style.---- Jon D. Markman is president of Markman Capital Insight , an investment research firm based in Seattle.", "external_links": ["http://www.markmancapital.net/"], "published": "2015-10-14T18:30:00.000+03:00", "crawled": "2015-10-14T14:17:40.210+03:00", "highlightTitle": ""}