{"organizations": [], "uuid": "2ee0bcf7f27870cb5b02292f91b9dd1abe7b1515", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/US-Gun-Lobby-300.jpg", "site_section": "http://moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/is-the-us-gun-lobbys-power-overstated/43577.html", "country": "IN", "title": "Is the US Gun Lobby’s Power Overstated?", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Is the US Gun Lobby’s Power Overstated? - Moneylife", "spam_score": 0.0, "site_type": "news", "published": "2015-10-06T17:23:00.000+03:00", "replies_count": 0, "uuid": "2ee0bcf7f27870cb5b02292f91b9dd1abe7b1515"}, "author": "Alec MacGillis (ProPublica)", "url": "http://www.moneylife.in/article/is-the-us-gun-lobbys-power-overstated/43577.html", "ord_in_thread": 0, "title": "Is the US Gun Lobby’s Power Overstated?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The National Rifle Association and other anti-gun-control groups are formidable, but political trends may be loosening their grip on lawmakers.   This story was co-published with The New York Times’ Room for Debate . Read the full discussion here .   No sooner had the toll from the latest mass shooting been tallied than came the world-weary predictions that the carnage would have zero political effect. “Why the Gun Debate Won’t Change After the Oregon Shooting,” read the headline at The Fix , The Washington Post’s political blog.   Without doubt, the gun rights lobby is a formidable force. It is backed by a truly grass-roots network of committed and well-organized supporters who are willing to make calls to legislators and turn out in even low-turnout elections to back pro-gun candidates. This “intensity gap” bedevils gun-control groups, which, however well some of their proposals poll, have trouble getting voters to agitate and to prioritize the gun issue the way that gun-rights defenders do.   But the invincibility of the gun lobby is being overstated. For one thing, gun ownership is becoming more concentrated in a smaller share of the population , one that is increasingly clustered in certain regions, thus limiting the lobby’s political reach.   For another thing, the big recent defeat for the gun-control movement, the 2013 failure to pass universal background checks for gun purchases, was a close call. Six senators with A-ratings from the NRA voted for the bill; it fell just five short of the filibuster-proof 60 . Had it passed the Senate, there would have been great pressure from the Sandy Hook families to bring it up for a vote in the House, and it would have needed only about 20 Republicans to pass.   No, the odds of the bill being revived anytime soon are not good, with the Senate now in Republican control. But things are shifting beneath the surface. The two Democrats who voted against the bill and were up for re-election last year both lost, after getting zero backing from the NRA in exchange for their vote ; this will make centrist Democrats less likely to vote with the NRA in the future. Meanwhile, two Democratic governors who signed tough gun laws, in Colorado and Connecticut, both won re-election in an otherwise brutal year for their party. A year earlier, Terry McAuliffe was elected governor of Virginia, the NRA’s home state, while running on an outspokenly anti-NRA platform.   As more elected officials take on the NRA and live to tell the tale, the calculus for even self-interested politicians will evolve , especially if gun control supporters start to really challenge those who vote against them. There are three “no” votes on background checks with tough re-election races in swing states next year: Kelly Ayotte in New Hampshire, Ron Johnson in Wisconsin and Rob Portman in Ohio. Simply deciding that the gun control issue is a political loser is self-fulfilling, just the sort of fatalism that the NRA counts on to preserve the status quo.   Courtesy: ProPublica", "external_links": [], "published": "2015-10-06T17:23:00.000+03:00", "crawled": "2015-10-06T12:46:17.925+03:00", "highlightTitle": ""}