{"organizations": [], "uuid": "e4c6f2fe5c77194e39aae1857c634a2955a5817b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-10-14/asia-stocks-follow-u-s-shares-lower-before-china-inflation-data", "country": "US", "title": "Asia Stocks Follow U.S. Shares Lower Before China Inflation Data", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Asia Stocks Follow U.S. Shares Lower Before China Inflation Data - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-10-14T08:05:00.000+03:00", "replies_count": 0, "uuid": "e4c6f2fe5c77194e39aae1857c634a2955a5817b"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-10-14/asia-stocks-follow-u-s-shares-lower-before-china-inflation-data", "ord_in_thread": 0, "title": "Asia Stocks Follow U.S. Shares Lower Before China Inflation Data", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Asian stocks dropped for a second day, tracking a decline in U.S. equities, as investors awaited Chinese inflation data amid renewed concern about the slowdown in the world’s second-largest economy.\nThe MSCI Asia Pacific Index fell 0.4 percent to 132.35 as of 9:00 a.m. in Tokyo. Global equities snapped their longest rally since February on Tuesday and the Standard & Poor’s 500 Index fell from a seven-week high amid a plunge in Chinese imports. Investors will be watching Wednesday’s consumer and producer prices data to gauge how weakness in China’s economy will impact the global economic outlook.\n“The cautionary element in the market is likely to continue,” Chris Green, an Auckland-based strategist at First NZ Capital Ltd., said by phone. “In terms of global growth the risk is skewed towards the downside. A softer read on the Chinese inflation data reinforces the backdrop of deflationary pressures and a softer growth profile globally. The Chinese economy is probably the largest risk that the global economy faces.”\nJapan’s Topix index lost 0.8 percent. South Korea’s Kospi index slid 0.3 percent. Australia’s S&P/ASX 200 Index fell 0.3 percent. New Zealand’s S&P/NZX 50 Index added 0.4 percent. Markets in China and Hong Kong have yet to start trading.\nThe Shanghai Composite Index gained 0.2 percent on Tuesday, after sliding as much as 1.1 percent, as investors weighed the prospects of stimulus measures after imports fell more than estimated. FTSE China A50 futures advanced 0.4 percent in most recent trading, while contracts on the Hang Seng China Enterprises Index added 0.2 percent.\nChinese Inflation Chinese consumer prices may have risen 1.8 percent in September from the previous year, according to a Bloomberg survey of economists and analysts, against a 2 percent increase in August. Producer prices may have dropped 5.9 percent, the same as the previous month, the survey showed.\nE-mini futures on the S&P 500 were little changed. The underlying gauge declined 0.7 percent on Tuesday as industrial shares sank and selling picked up in biotechnology stocks.\nTraders are now pricing in a 37 percent chance of a Federal Reserve interest-rate increase by December.", "external_links": [], "published": "2015-10-14T08:05:00.000+03:00", "crawled": "2015-10-14T03:22:28.057+03:00", "highlightTitle": ""}