{"organizations": [], "uuid": "e5d458ee16cdc8252e26404ae910b0086a0fcdfd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/jack-dorseys-square-files-york-221057755.html", "country": "US", "title": "Jack Dorsey's Square files for New York IPO", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Jack Dorsey's Square files for New York IPO", "spam_score": 0.0, "site_type": "news", "published": "2015-10-15T01:10:00.000+03:00", "replies_count": 0, "uuid": "e5d458ee16cdc8252e26404ae910b0086a0fcdfd"}, "author": "", "url": "https://uk.finance.yahoo.com/news/jack-dorseys-square-files-york-221057755.html", "ord_in_thread": 0, "title": "Jack Dorsey's Square files for New York IPO", "locations": ["New York"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jack Dorsey"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Oct 15, 2015, 00:09 BST - UK Markets open in 7 hrs 51 mins Jack Dorsey's Square files for New York IPO By Rebecca Burn-Callander | Telegraph – 59 minutes ago -1.23 \nThe payments company has finally filed the documents for going public \nMobile payments company Square, which is run by Jack Dorsey, Twitter (Xetra: A1W6XZ - news ) 's co-founder and recently appointed chief executive , has filed documents for an initial public offering (IPO) in New York following years of industry speculation . \nThe company, which generated revenues of $560.5m (£362.3m) in the six months to the end of June, up from $371m in the same period last year, has grown at an exceptional rate, driven by the booming market for mobile payments. \nSquare, co-founded by Mr Dorsey in 2009 , pioneered the use of instant payments through smartphones. \n\"We've built one of the fairest and most efficient payments businesses in the world,\" said Mr Dorsey, in a letter attached to the filing for the Securities and Exchange Commission. \n\"Creating more inclusion and greater equality in the global economy is both a social need and a huge business opportunity.\" \nSquare has already attracted one of the highest valuations in Silicon Valley. Last month, estimates put its worth at $6bn based on its most recent round of funding. * These are the most valuable start-ups in the world However, the company is still struggling to turn a profit, posting a $77.6m loss during the same period - almost flat on the $79.4m loss a year ago. \nAs a result, Square warns potential investors that dividends will not be forthcoming: \"We do not expect to pay any dividends on our capital stock in the foreseeable future,\" it said in the filing document. \nMr Dorsey took to Twitter to announce that Square was seeking an IPO. \nSquare has set a nominal fundraising target of $275m for the IPO, although this could change. It (Other OTC: ITGL - news ) will use the symbol \"SQ\". \nGoldman Sachs (NYSE: GS-PB - news ) , Morgan Stanley (Xetra: 885836 - news ) , Barclays (LSE: BARC.L - news ) and Jefferies are among the underwriters for the offering. \nIn its filing, the company outlines the risks that could slow Square's growth. Mr Dorsey's dual role as boss of Twitter and Square is among them. \n\"Jack Dorsey, our co-founder, President, and Chief Executive Officer, also serves as Chief Executive Officer of Twitter. This may at times adversely affect his ability to devote time, attention, and effort to Square,\" the document states. \nThe rate of revenue growth is also expected to drop. Starbucks (Swiss: SBUX.SW - news ) , one of the company's biggest clients, will move off the platform in the coming year to focus on developing its own payments system. \nWorldpay, another payments processor, joined the London Stock Exchange (Other OTC: LDNXF - news ) earlier this week in the UK's largest IPO this year . \nIt secured a market value of more than £5bn, giving its existing investors and staff a windfall of more than £1bn. \nMr Dorsey, who founded Twitter in 2006, was appointed as permanent chief executive of Twitter last week despite refusing to give up his responsibilities leading Square. \nOn Monday, Twitter announced massive job cuts to secure the future of the social media platform; 336 staff are being let go. \nEarlier today, Twitter named Google veteran Omid Kordestani as its executive chairman . \nMr Dorsey is the largest shareholder of Square with a 24.4pc stake. Co-founder James McKelvey owns 17.3pc.", "external_links": [], "published": "2015-10-15T01:10:00.000+03:00", "crawled": "2015-10-15T02:10:23.202+03:00", "highlightTitle": ""}