{"organizations": ["Anheuser-Busch", "Anheuser-Busch InBev"], "uuid": "3bd80c27541a5acb4982e8e0d075a20504f46668", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/source-newspapers/rss/627", "section_title": "Source Newspapers : Personal Finance", "url": "http://business-news.thestreet.com/source-newspapers/story/10-brews-watch-the-anheuser-busch-inbev-sabmiller-deal/1", "country": "US", "title": "10 Brews To Watch In The Anheuser-Busch InBev SABMiller deal", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "10 Brews To Watch In The Anheuser-Busch InBev SABMiller deal", "spam_score": 0.0, "site_type": "news", "published": "2015-10-21T22:19:00.000+03:00", "replies_count": 0, "uuid": "3bd80c27541a5acb4982e8e0d075a20504f46668"}, "author": "", "url": "http://business-news.thestreet.com/source-newspapers/story/10-brews-watch-the-anheuser-busch-inbev-sabmiller-deal/1", "ord_in_thread": 0, "title": "10 Brews To Watch In The Anheuser-Busch InBev SABMiller deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "10 Brews To Watch In The Anheuser-Busch InBev SABMiller deal 10/21/2015 - 3:19 PM EDT What's going to be the impact of beer giant Anheuser-Busch InBev 's purchase of rival SABMiller ? \nThe general consensus is this: we don't know. \nThe folks at Anheuser-Busch InBev and SABMiller are tight-lipped about it , since A-B's $104.5 billion deal hasn't been codified with a formal offer as of yet. It's a necessary step thanks British takeover rules, and Brazilian-Belgian A-B InBev's deadline for that formal offer was extended to October 28. \nThat should give the world a better idea of what Anheuser-Busch InBev will be getting out of the deal, which will likely include SABMiller's vast holdings in Africa and business interests in China and other parts of Asia. However, it will likely be up to the Department of Justice to decide what SABMiller products Anheuser-Busch InBev will and won't be able to sell here in the U.S. More Headlines You Can Fund Retirement By Marrying Rich \nCurrently, SABMiller's U.S. interests are wrapped up in the MillerCoors joint venture it formed with Molson Coors back in 2008. Under the terms of that venture, Molson Coors can buy 8% of SABMiller's share of the partnership immediately to bring it to 50% ownership. Then Molson Coors gets first and last offer on SABMiller's remaining 50%, as well as the ability to name the new Molson chief executive when the dust settles. \nBecause MillerCoors exists as its own entity, there is a chance that the Department of Justice may require it to sell SABMiller products here without Anheuser-Busch InBev benefitting from the agreement. The precedent for such a scenario was set in 2011, when Anheuser-Busch InBev purchased Mexico's Grupo Modelo for $20.1 billion, but was ordered by the DOJ to relinquish the rights to U.S. brewing and sales to Grupo Modelo's U.S. distributor, Constellation Brands. \nThat is certainly a viable option for MillerCoors, but we likely won't see a decision from the Department of Justice on the Anheuser-Busch InBev/SABMiller deal until 2016 at the earliest. A-B InBev's formal offer for SABMiller will offer some clues about the company's intentions in the U.S., but even that decision will result in more speculation than solid answers for the U.S. beer market. \nHowever, there are some items within SABMiller's sphere of influence that are worth focusing on as this deal progresses. The following ten beverages could have significant impact not only on this deal, but on the future of A-B InBev, Molson Coors and MillerCoors. 1", "external_links": [], "published": "2015-10-21T22:19:00.000+03:00", "crawled": "2015-10-22T00:55:54.516+03:00", "highlightTitle": ""}