{"organizations": [], "uuid": "f225ad800322435e149a353334932a26f0131c6e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/n/c/a/o/image.related.afrArticleLead.620x365.gk4nwr.png/1444314544875.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/national/brian-loughnanes-position-was-untenable-and-he-had-to-go-20151008-gk4nwr", "country": "AU", "title": "Brian Loughnane's position was untenable and he had to go", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Brian Loughnane's position was untenable and he had to go | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-10-08T15:22:00.000+03:00", "replies_count": 0, "uuid": "f225ad800322435e149a353334932a26f0131c6e"}, "author": "Tony Walker", "url": "http://www.afr.com/news/politics/national/brian-loughnanes-position-was-untenable-and-he-had-to-go-20151008-gk4nwr", "ord_in_thread": 0, "title": "Brian Loughnane's position was untenable and he had to go", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brian Loughnane and his wife Peta Credlin at one of their last public outings - Canberra's Midwinter Ball in June. Alex Ellinghausen by Tony Walker When Tony Abbott fell to a party room putsch it was only a matter of time before the dominoes in his \"command and control\" government would fall, one by one.\nOnce Abbott went and with him his controversial chief of staff, Peta Credlin, the position of Federal Director Brian Loughnane was hardly tenable . It has taken a month for Loughnane to advise Prime Minister Malcolm Turnbull he would be vacating a role he has held since 2003.\nLoughnane might be described as an unfortunate casualty of an ill-starred Abbott government. As far as can be judged, he was only peripherally involved in the strategies – and appalling management of government processes – that contributed to the former Prime Minister's downfall.\nBut the fact remains – from a governance standpoint – it was a huge mistake for Tony Abbott to allow a situation to arise where his own chief of staff and her husband occupied the Liberal party's two most senior operative roles.\nIn the commercial world it would be like the chairman of a company having his chief executive and chief operating officer married to each other. In business, except perhaps for a family dynasty, it simply would not happen.\nWhy this situation was allowed to persist is one of many mysteries that surround the byzantine world of the Abbott office, not that Loughnane himself should be held accountable, except on the margins, for the plethora of mistakes that were made.\nHe was not responsible, for example, for the jarring relationships that existed between the Abbott office and much of the rest of the government. That was the work of Abbott himself, and his headstrong chief of staff.\nHowever, Loughnane should have realised early on that an incestuous management arrangement was inimical to the interests of both the Liberal Party and the government.\n Ultimately, this state of affairs reflected poorly on Abbott's own judgement and the management of his relationships with senior colleagues and the organisational wing of the Liberal Party itself.\nIn fairness to Loughnane, he has been a committed servant of the Liberal Party at Federal and State levels, having served the Jeff Kennett government in Victoria and later various Howard ministers before finding his way to the Federal secretariat.\nIn the role of Federal Director he performed creditably, overseeing two election victories, losing one and effectively drawing another. His batting average was better than 50 percent.\nBut unfortunately for him he will leave under something of a cloud after Abbott's scarring defeat and the responsibility, fair or not, that is attached to his wife's role in what had become a shambolic administration.\nMalcolm Turnbull has, in a few short weeks, remade the government in his own likeness, and now has the opportunity to spring clean the Liberal Party organisationally. Such a spring-cleaning was overdue.\nAs a former Treasurer of the party, its bagman, Turnbull would understand the importance of an effective back-room organisation, both at federal and state levels.\nTurnbull will now have his own man running the party federally, and in the process overseeing state branches, including the troubled Victorian branch whose auditing practices have left much to be desired.\nAssuming Tony Nutt becomes federal director Turnbull will have a hardened professional in the role, and someone who knows where weak spots exist. The decks continue to be cleared for the federal election due by the end of next year.", "external_links": [], "published": "2015-10-08T15:22:00.000+03:00", "crawled": "2015-10-09T01:08:59.046+03:00", "highlightTitle": ""}