{"organizations": [], "uuid": "61ee9fbb9703c2c5c9c1ba1ff05b721d6074c7db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/272461/business-finance", "section_title": "Business: Finance - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30238765/greenberg-traurigs-david-gitlin-to-speak-on-angel-capital-associations-webinar-on-structured-exits", "country": "US", "title": "Greenberg Traurigs David Gitlin to Speak on Angel Capital Associations Webinar on Structured Exits", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Greenberg Traurigs David Gitlin to Speak on Angel Capital Associations Webinar on Structured Exits - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-10-12T17:02:00.000+03:00", "replies_count": 0, "uuid": "61ee9fbb9703c2c5c9c1ba1ff05b721d6074c7db"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30238765/greenberg-traurigs-david-gitlin-to-speak-on-angel-capital-associations-webinar-on-structured-exits", "ord_in_thread": 0, "title": "Greenberg Traurigs David Gitlin to Speak on Angel Capital Associations Webinar on Structured Exits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Gitlin, co-leader of the Emerging Technology Group and Corporate & Securities Practice shareholder at international law firm Greenberg Traurig, LLP, will be a featured speaker for the Angel Capital Association’s (ACA) webinar, “Structuring Exits for Competitive Returns.” This live webcast takes place 12 p.m. to 1 p.m., Wednesday, Oct. 14, 2015.\nPHILADELPHIA, PA (PRWEB) October 12, 2015\nDavid Gitlin, co-leader of the Emerging Technology Group and Corporate & Securities Practice shareholder at international law firm Greenberg Traurig, LLP, will be a featured speaker for the Angel Capital Association’s (ACA) webinar, “Structuring Exits for Competitive Returns.” This live webcast takes place 12 p.m. to 1 p.m., Wednesday, Oct. 14, 2015.\nGitlin and fellow panelists will discuss creative approaches to structuring an exit including demand dividends, equity redemption, and mezzanine debt – all of which provide liquidity and competitive returns in alignment with the goals of the entrepreneur and investors. The panel will also share a structured exit case study from both the investor and entrepreneur’s perspectives.\nGitlin has been a regular speaker, author, and commentator on structured exits. In September 2015, he authored the article “Structured Exits: A New Universe of Potential Funding for Companies in Underserved Markets,” published by The Deal. He was also Quote: d in the Forbes article “Structured Exits: A New Path To Angel Liquidity?” published October 8, 2015.\nGitlin focuses his practice on corporate and securities, with an emphasis on mergers and acquisitions, venture capital, technology development, and corporate finance. Gitlin represents both U.S. and foreign venture capital funds and angel investors, and has handled numerous technology development transactions, including collaborations between industry and academia. He has structured more than 350 M&A and venture capital deals, many of which have been cross-border transactions involving leading businesses in Finland, India, Israel and Sweden, among others. He is recognized by Chambers USA Guide as a leading M&A attorney, and is nationally ranked as a leader in venture capital.\nAbout Greenberg Traurig’s Emerging Technology Group\nGreenberg Traurig’s Emerging Technology Group is a multidisciplinary legal team focused on guiding emerging technology companies through all the stages of their development, from initial business formation through angel or venture capital financing to initial public offerings and mergers and acquisitions. Drawing on the firm’s broad platform, the group offers clients a streamlined approach to meeting their diverse legal needs – a single team that can scale up its services as clients’ businesses grow. The attorneys regularly advise clients on a host of pressing legal issues, from IP protection and software/IT matters through labor and employment, compensation, and tax issues.\nAbout Greenberg Traurig, LLP\nGreenberg Traurig, LLP is an international, multi-practice law firm with approximately 1,900 attorneys serving clients from 38 offices in the United States, Latin America, Europe, Asia, and the Middle East. The firm is No. 1 on the 2015 Law360 Most Charitable Firms list, third largest in the U.S. on the 2015 Law360 400, on the 2015 Am Law Global 100, and among the 2015 BTI Brand Elite. More information at: http://www.gtlaw.com .\nContact: Jenna MacNeill | T: 617.310.6275 | E: macneillj(at)gtlaw(dot)com\n //www.prweb.com/releases/2015/10/prweb13015400.htm\n ", "external_links": ["http://www.prweb.com/releases/2015/10/prweb13015400.htm"], "published": "2015-10-12T17:02:00.000+03:00", "crawled": "2015-10-12T16:17:29.908+03:00", "highlightTitle": ""}