{"organizations": [], "uuid": "6d5d4bc80f014478ddabf2621275a54696d0cf46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/forex/wp-content/uploads/sites/8/2015/10/London-Award_pic_Header.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/forex/brokers/voting-for-the-finance-magnates-awards-has-just-started/", "country": "US", "title": "Voting for the Finance Magnates Awards Has Just Started!", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "Voting for the Finance Magnates Awards Has Just Started!", "spam_score": 0.0, "site_type": "news", "published": "2015-10-19T19:09:00.000+03:00", "replies_count": 0, "uuid": "6d5d4bc80f014478ddabf2621275a54696d0cf46"}, "author": "", "url": "http://www.financemagnates.com/forex/brokers/voting-for-the-finance-magnates-awards-has-just-started/", "ord_in_thread": 0, "title": "Voting for the Finance Magnates Awards Has Just Started!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Voting for the Finance Magnates Awards Has Just Started! Voting for the Finance Magnates Awards Has Just Started! You have only 48 hours to decide who will make it to the final round of the Finance Magnates' Awards. Advertising Print This Post \nFinance Magnates is happy to set in motion the London Summit Awards 2015, the only industry trophy given independently by peers. As the Summit is just two weeks away, the time has come for attendees to have their say and engage in the first round of voting. How Does It Work? \nAs only registered attendees are eligible for voting, if you haven’t registered yet, this would be the first step . Once registration is confirmed, you will receive an email with full instructions for the first round of voting. In each category you will be asked to choose five firms for each category. Categories for the Finance Magnates Awards for 2015 \n\nWe will aggregate the results and publish the finalists of each category. In the next phase, you will be asked to choose one of the candidates who received the majority of votes. The ultimate winners will be announced at the closing ceremony of Finance Magnates’ London Summit on November 3 rd . \nThe first round of voting will be opened in the next couple of hours, for the duration of 48 hours. Make sure to use this timeframe and have your say about the industry’s finest for 2015. If you are a registered attendee and haven’t received an email from us, please let us know at Summit@financemagnates.com . \nThis is the fourth year that Finance Magnates (formerly known as Forex Magnates) is facilitating the Awards, elected by industry peers. In the past, breakthrough firms which won awards for technology innovations, made inroads into the industry and currently constitute an integral part of the FX landscape. The info-graphic below showcases all past winners. Now it’s up to you to determine who will be there next year. \nGot a news tip? Let Us Know FOUND A MISTAKE How do you feel about the article? Educated 0", "external_links": [], "published": "2015-10-19T19:09:00.000+03:00", "crawled": "2015-10-19T16:29:02.975+03:00", "highlightTitle": ""}