{"organizations": [], "uuid": "7d7df1c3c9d623f1c09af49ed95424af2a416113", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://www.prnewswire.com/rss/financial-services/financing-agreements-news.rss", "section_title": "PR Newswire: Financing Agreements", "url": "http://www.prnewswire.com/news-releases/naia-limited-raises-53-million-in-series-a-financing-led-by-pharco-pharmaceuticals-300161652.html", "country": "US", "title": "Naia Limited Raises $5.3 Million in Series A Financing Led", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Naia Limited Raises $5.3 Million in Series A Financing Led", "spam_score": 0.0, "site_type": "news", "published": "2015-10-20T08:30:00.000+03:00", "replies_count": 0, "uuid": "7d7df1c3c9d623f1c09af49ed95424af2a416113"}, "author": "Naia Limited", "url": "http://www.prnewswire.com/news-releases/naia-limited-raises-53-million-in-series-a-financing-led-by-pharco-pharmaceuticals-300161652.html", "ord_in_thread": 0, "title": "Naia Limited Raises $5.3 Million in Series A Financing Led", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RICHMOND, Calif. , Oct. 19, Naia Limited, an international drug development company with Subsidiaries developing innovative, clinical-stage compounds for short bowel syndrome (SBS), non-alcoholic steatohepatitis (NASH) and Type 2 diabetes, today announced it has raised $5.3 million in a Series A financing led by existing investor and strategic partner, Pharco Pharmaceuticals. The financing also included participation from several veteran healthcare investors, including members of the management team of The Trout Group, a leading investor relations firm in the life sciences industry. Naia will use the proceeds to continue to invest in its Subsidiaries and their diverse and innovative portfolio of therapeutic approaches, including a program focused on the treatment of SBS, an orphan indication. \"We continue to invest in Naia because we believe that the company will be successful in attaining its goal of meeting the needs of a complex global healthcare ecosystem and improving access to medicines in various international markets,\" said Sherine Helmy , Pharm. Bsc., DBA, chief executive officer of Pharco Pharmaceuticals and a member of Naia's Corporate Board of Directors. \"The company continues to execute on a unique business model in developing its promising pipeline.\"\nH. Daniel Perez , M.D., co-founder, chairman and chief executive officer of Naia Limited, said, \"We are pleased that these high-caliber existing and new investors have participated in the financing round. We have been working diligently to advance our pipeline, build our company and achieve several critical milestones. We are committed to our global business strategy and will utilize these new funds to advance our compounds toward clinical trials.\"\nNaia's operating Subsidiary, Naia Rare Diseases, has in-licensing agreements with Amunix Operating Inc. for its GLP-1 and GLP-2 XTEN™ receptor agonist product candidates and a licensing agreement with Cedars-Sinai Medical Center in Los Angeles for a use patent for GLP-1. These compounds are being developed for patients with Short Bowel Syndrome. A second Subsidiary, Naia Metabolic, is developing clinical compounds to treat Type 2 diabetes, and NASH.\nAbout Naia Limited\nNaia Limited builds and funds new biotech companies using de-risked clinical stage assets. Naia's structure spreads overhead costs and resources during early development of assets thus reducing costs and time. The company has an international base of operations to develop therapeutics better, faster and more inexpensively – in proximity to target markets. Naia's operating structure includes a Cayman Island-based management company and several holding companies that focus on development activities of like assets. The company is developing a diverse portfolio of therapeutics that address regional and global unmet medical needs in various markets with an initial focus on rare and metabolic diseases. For more information, please visit www.naiapharma.com .\nSOURCE Naia Limited\nRELATED LINKS\nhttp://www.naiapharma.com", "external_links": ["http://www.naiapharma.com/"], "published": "2015-10-20T08:30:00.000+03:00", "crawled": "2015-10-20T03:49:25.997+03:00", "highlightTitle": ""}